[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/01/2022",
        "dateOfIncident": "03/21/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459243,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving this car on the highway, the car shut down leading to severely decreased speed placing my life in danger. The engine was repaired in 2019.  Again, on Monday 3/21/2022, while driving on the highway, this car decreased speed and put my life in danger again. This time KIA will not rectify the situation and denies any responsibility for the second engine issue.  This vehicle now requires a total engine replacement at the cost of myself. No explanation of what led to the cause of this engine failure was provided. Multiple attempts requesting written explanation of diagnostic findings have not been met. No invoice has been provided at the time of this claim.",
        "vin": "KNDPNCAC1H7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/18/2022",
        "dateOfIncident": "02/18/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457278,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Unknow I took my kia 2/10/2022 in because the control knob was not working they did not have the part On 2/11/2022 I picked it up. On 2/17/2022 I dropped off my Kia so that the replacement part could be installed. On 2/18/2022 I picked up my vehicle and seen that my knob was fixed be discovered another problem had occurred that was no there before. My check engine light was on. I never left the service area. I informed [XXX] the he contacted (by radio) the mechanic that worked on my Kia. The took the vehicle back to the mechanic and when I got my vehicle back the check engine light was off and if the check engine light came back on to let him know.  On Feb 19 the check engine light was back on so I called and left a message for [XXX] to call me back but he never did. Feb 21 I called [XXX] again and left a message for him to call me back. Feb 22.2022 My Husband [XXX] spoke to [XXX] , and he then informed him to call Kia Service Center because he [XXX] already had call them about my Kia explaining what the problem was. on Feb 24 I dropped off my Vehicle to Kia Service Center. On Feb 25 [XXX] from Kia Service Center called me to ask me where [XXX] go the part from and what was the part number On Feb 26 I went to Advantage Toyota and spoke to [XXX] for the information he informed me hi did not know the part number because he got the part from the warranty company On Feb 28 I informed [XXX] what [XXX] told me  On March 2 [XXX] from Kia Service Center informed me that the Bocy Harness was burned out and that it would cost me $4000 dollars to fix  On March 3  I went back to Advantage Toyota to speak to a manager about my situation because i was tired of getting the run around and I needed help to resolving this issue. I spoke with [XXX] yet again no one there was willing to help me. I left a message With General Manager [XXX] he did not return my call, I spoke with the corporate office still no one has called me  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "KNDPMCAC2H7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/15/2022",
        "dateOfIncident": "02/13/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456898,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "My Sportage SX started to slow in an off-ramp & then died completely stranding me in traffic. 2/13/22 is when this happened. Dealer is saying that engine pressure caused a spark plug to break & batter the cylinder. Resolve is a factory warranty engine block. Still waiting on the engine part, a month later.",
        "vin": "KNDPRCA68H7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/10/2022",
        "dateOfIncident": "03/06/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456224,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "My vehicle was stolen in the middle of the day while locked through the rear window.  There is now $8,000 worth of damage to it including the windows, ignition, body.  I have since learned that there is a flaw in the way that Kia designed the vehicle that makes is extremely easy to steal.",
        "vin": "KNDPMCAC7H7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/06/2022",
        "dateOfIncident": "02/28/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455429,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I started to hear a rattle sounds or ticking while driving. I let the car test over the weekend and then come Monday was going to drive it to my mechanic.  I was left stranded and had to get the car towed to the mechanic.  I'm being told the entire engine is bad and needs to be replaced.   This makes no sense as I've kept up regular maintenance on the vehicle and am still paying on it.",
        "vin": "KNDPMCAC8H7"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/03/2022",
        "dateOfIncident": "03/03/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455130,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Check engine light came on after I exit the ramp getting onto I-75. The vehicle started to stall. The vehicle started making a jerking move as though it was loosing power. I had to pull over in the side of the highway. I turned off the vehicle for about 5 minutes and turned it back on. I pull back onto the highway and noticed that when I press the gas it started repeating the same as I stated before and it wouldn’t accelerate pass 65 mph. When you slow down to about 20 mph and press the gas it stalls really bad as though it’s about to cut off. The acceleration hands jumps back and forth between 1 and 2 when pulling off.",
        "vin": "KNDPM3ACXH7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/01/2022",
        "dateOfIncident": "02/26/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454752,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Kia Sportage. The contact stated while driving approximately 55 MPH, she heard a pop underneath the vehicle. The contact pulled over and upon inspection, the contact became aware that an unknown part was loosened underneath the vehicle. The contact stated that the check engine, oil, and battery warning lights were illuminated. The vehicle was towed to a local dealer where it was diagnosed with needing the engine replaced. The vehicle was not repaired. The manufacturer was not informed of the failure. The failure mileage was approximately 64,000.",
        "vin": "KNDPMCAC6H7"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/17/2022",
        "dateOfIncident": "01/16/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452566,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Unreasonable amount of engine oil decreasing. When I drained engine oil after 5000 miles of driving, less than 1/2 of 5qt jug was filled. It could eventually result engine fire due to loss of lubrication on engine.",
        "vin": "KNDPMCAC9H7"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/12/2022",
        "dateOfIncident": "02/11/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451673,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle basically activates Traction control System while going 70 to 85 on highway. Basically feels like you hit a decent sized bump. Then the car activates downhill brake control which limits the RPMs of the vehicle. The TCS and DBC lights remain on requiring you to pull over. Once the engine is restart the lights disappear for the time being until is occurs on the highway again. Happened 4 times in one day. Didn't happen when the car shop drove it... about to go to the dealership...who probably knows less.",
        "vin": "KNDPMCAC2H7"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/31/2022",
        "dateOfIncident": "12/26/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11449584,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Kia Sportage. The contact stated that while driving at 30-35 MPH, another vehicle crashed into the rear end of her vehicle. The air bags failed to deploy. The contact was unsure whether there was a warning light illuminated. The contact was transported to the hospital with the assistance of a family member. The contact sustained a concussion, jaw and back injuries. A police report was filed. The vehicle was towed to a tow lot, where it was totaled. The dealer was notified of the failure and referred the contact to the manufacturer. The manufacturer was notified of the failure and advised the contact that the air bags do not always deploy in the event of a crash; therefore they could not assist. The failure mileage was approximately 66,000.",
        "vin": "KNDPR3A65H7"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/21/2022",
        "dateOfIncident": "12/15/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448392,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Passenger airbag malfunction light came on and has stayed on. We are 30 days pass warranty and were given a quote of over $2600 to replace the airbag by the Kia dealership where we purchased this 2017 Kia Sportage. There are only 26,000 miles on it with no accidents. This is a safety issue and puts any passengers riding in that seat at a very high risk. A recall needs to be issued asap. My research on this problem revealed other recalls in the past on Kia airbags.",
        "vin": "KNDPNCAC2H7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/12/2022",
        "dateOfIncident": "09/20/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447201,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Kia Sportage. The contact stated while driving approximately 60 MPH, the vehicle failed to accelerate with the accelerator pedal depressed. The contact stated that the check engine warning light was illuminated. The vehicle was taken to a dealer where it was diagnosed with needing the Hydraulic Electronic Control Unit (HECU) replaced. The vehicle was repaired. The manufacturer was not informed of the failure. The failure mileage was 131,101.",
        "vin": "KNDPM3AC8H7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/08/2022",
        "dateOfIncident": "01/07/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446700,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I filed a claim 14001328 for excessive oil consumption.  I am told that one quart of oil per 1000 miles is normal consumption.  The car holds 4.5 quarts of oil.  This means that for a 7500 mile oil change interval the entire volume is replace almost twice.  I do not accept this as normal.  I purchased a 2017 Kia Sportage in August of 2016. I believe that Kia is running out the warranty.  I have driven 158,000 miles in a VW Rabbit - no oil issues.  238,000 miles in a VW Jetta 195,000 miles in a VW Jetta TDI, 175,000 miles in a Chrysler Town and Country.  Average oil consumption between changes was .25 quarts.  You are now telling me this Kia Sportage has a normal oil consumption of one quart per 1000 miles.  I find this then to be an inferior design.  I should be entitled to a repair.  I have oil coming out of my exhaust tailpipe.  I am copying this to the NHTSA.  All of the time I have my Sportage I have maintained proper oil change intervals and I have service records.",
        "vin": "KNDPMCAC4H7"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/08/2021",
        "dateOfIncident": "11/10/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443115,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Transmission intermittently goes into neutral while driving causing engine rev, loss of ability to continue to drive/maintain speed.  Very dangerous as you have to drift to the side of the road and put the transmission into Park and back to Drive to get it to engage again.  Meanwhile you could easily be struck by another car trying due to sudden loss of momentum with no brake light warning or trying to maneuver to the side of the road with no engine power.  Occurs every month or two.  Dealer unable to duplicate multiple times.  No warnings before it happens. There are at least 20 other reports of this on the NHTSA site.  When will an investigation be opened?  This has the potential to cause a serious crash.",
        "vin": "kndprca6xh7"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/06/2021",
        "dateOfIncident": "05/08/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442934,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "On November 2020 I bought my 2017 Kia Sportage 4DR FWD LX. I been having issues with the  driver's and passenger windows since 05/08/2021. The driver's window will not go down, Deland Kia Dealer inspection said the rubber window channel for the driver's windows needed to be lubricated and it got fix. Now 8 months later the same situation is happening again on the the same window, the window will not go down, and the motor works because you can hear it running. On 10/18/2021 I had to get my kia Sportage for service due the right (passenger) window not going up, it was stock and will not go up at all, again the motor was working because you can heart running. I got my Kia serviced at Deland Kia and they changed the window regulator gear panel. Is working (for now) but now my left rear window will not go up and is sliding down, like it loose and the drive's windows also having the same problem. I believe all this issues are a safety concern due to; first what if that window that is sliding will break and cut someone, plus is an easy way for someone to brake into my vehicle. Also the windows not coming down, what if I had an accident and the only way to get me out will be breaking the window because it will not go down and if there was a gas leak or something I will get trap there. I looked online to multiple vehicle forums and there is multiple complains about this window issue, some believe is due to a regulator wheel malfunction or a complete regulator malfunction. At this point almost all my windows had an issue which is putting my safety and my family safety on risk.",
        "vin": "KNDPM3AC4H7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/02/2021",
        "dateOfIncident": "12/02/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442383,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I have performed the required oil changes since the car was purchased with the KIA dealer network.  At 50,000 miles my oil light came on while making a turn and I brought it to the nearest dealer.  They changed the oil and started an oil comsumption test. Since then, we have done 3 oil comsumption tested which \"just passed\" the criteria.  I burn enough oil that I have a soot deposit in my exhaust pipe.  My car is at 81,000 miles and has lost enough oil from the last oil change (4,000 miles ago - scheduled oil change for December 15) that there is no oil indication on the dipstick.  The dealer has asked me to not add oil because it is 2 quarts low and ok to drive.   They have said the warranty only covers if the consumption is greater than 1 quart per 1000 miles and this much oil loss is normal.  THIS IS NOT NORMAL and indicates a defect in the piston rings, which would be a warranty repair that is being denied.",
        "vin": "KNDPMCAC4H7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/21/2021",
        "dateOfIncident": "11/18/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441238,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The car is manufactured in such a way that it is easy to steal without a key.  When a car is stolen, typically it is driven recklessly putting many others at risk.  Also any child or animal in the car could be taken as well as needed possessions of the owner.  The problem has been recognized by the manufacturer and several police departments. The problem became well known to the manufacturer, however, the manufacturer neglected to ever notify individuals who purchased their vehicles.   This can be verified by any large police department.  Some of these would include:  Milwaukee, Denver and multiple others.  There is no warning that this is a problem in the vehicle you own.  The manufacturer or dealer would have to notify such as they do in a recall.",
        "vin": "KNDPMCAC9H7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/19/2021",
        "dateOfIncident": "11/11/2021",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441020,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact's daughter owns a 2017 Kia Sportage. The contact stated that while her daughter was driving at 5-10 MPH, she heard an abnormal popping sound and she saw black and white smoke coming from underneath the hood of the vehicle. The check engine warning light was illuminated. The contact's daughter exited the vehicle immediately and called the fire department. The fire department was able to extinguish the fire. The contact's daughter did not sustain physical injuries however, she was mentally traumatized and had been seeking therapy. A police report was filed. The vehicle was towed to a tow lot, where the vehicle was deemed totaled. The contact stated that the vehicle had been serviced two months prior to catching on fire and several recall repairs were performed. The dealer and the manufacturer were not notified of the failure. The approximate failure mileage was 100,000.",
        "vin": "KNDPM3AC1H7"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/29/2021",
        "dateOfIncident": "10/28/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438709,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "bad transmission. engine revs up but car isnt moving at all.",
        "vin": "KNDPM3AC9H7"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/19/2021",
        "dateOfIncident": "10/01/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437397,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving heard a loud cracking noise, when I made ot to my destination I noticed that the dash infront of the passenger seat were the airbag is has two v cracks in it",
        "vin": "Kndpm3ac8h7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/19/2021",
        "dateOfIncident": "10/01/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437400,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Around December 2020 our driver side window stopped working. We had the dealership replace the inner door panel accuator. As soon as we went over 60,000 and lost our warranty all of the other 3 windows stopped working. The plastic gears crumbbled. We bought 3 panels to fix the windows in January they have worked until the beginning of October. Same problem!!!",
        "vin": "Kndpm3ac8h7"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/07/2021",
        "dateOfIncident": "10/05/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435843,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The car start button failed to start the car . It has happened sporadically over last 4 months .It is available for inspection. I have not reported it as of today to the dealer . It is not a safety issue since it happens while parked. The cars dashboard lite up ,radio was on as were the headlights and all other warning lights when I depressed the start button with my foot on the brake pedal. The only thing that was different was the brake pedal was extremely  hard to depress it didn't move at all.The brake pedal was up higher then normal by a couple of inches. It took multiple times before it started.",
        "vin": "KNDPNCAC4h7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/29/2021",
        "dateOfIncident": "09/16/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434858,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I just changed my oil 2 weeks ago and it has lost 3 quarts of oil already, and I do not have any oil leaks, nor is the oil/engine light coming on.",
        "vin": "Kndpm3ac6h7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/10/2021",
        "dateOfIncident": "09/10/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432513,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "In Oct 2020, we took the vehicle in as it had low oil. A prior inspection and oil change had been performed in June 2020, and it was assumed that the inspection mechanic did not change the oil. The dealership (Fred Beans Kia of Langhorne) changed the oil in October, and in December 2020 the vehicle was again low on oil well before the 3000 mile mark. The dealership informed us that it was likely due to an error on their part, and the technician was no longer employed there. Once again in April 2021 the vehicle was low on oil, and was taken to the dealership. In June 2021 the vehicle was once again low on oil, and taken to the dealership where they confirmed oil consumption was out of spec. Cleaning was performed in July and the vehicle was again low on oil in Sept 2021. Dealer is claiming the oil consumption is now \"normal.\"  The vehicle is both burning and leaking oil, causing a concern for both safety (engine seizure) and durability.",
        "vin": "KNDPN3AC9H7"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/24/2021",
        "dateOfIncident": "04/30/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430317,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Kia Sportage. The contact stated while driving at an undisclosed speed, several unknown warning lights illuminated. The vehicle was towed to the local dealer to be diagnosed. The contact was informed that the engine needed to be replaced. The vehicle was repaired. The contact received notification of NHTSA Campaign Number: 21V137000 (Engine) however, the part to do the recall repair was not yet available. The vehicle was taken to the local dealer for several months. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. Parts distribution disconnect. The failure mileage was approximately 41,000.",
        "vin": "KNDPR3A65H7"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/17/2021",
        "dateOfIncident": "07/31/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429510,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Kia Sportage. The contact stated while driving 65 MPH, the vehicle inadvertently stalled and lost power. There were no warning lights illuminated. The contact stated that while attempting to restart the vehicle there was an abnormal knocking sound and the vehicle lost power. The vehicle was towed to the dealer who diagnosed that the engine needed to be replaced; however, the dealer informed the contact that the repair would not be covered under the warranty since the knock sensor software upgrade was not completed on the vehicle prior to the failure. The manufacturer was made aware of the failure and stated that the knock sensor software upgrade was not completed on the vehicle prior to the failure and offered no further assistance. The vehicle was not repaired. The failure mileage was 95,079.",
        "vin": "KNDPMCAC8H7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/02/2021",
        "dateOfIncident": "08/02/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427433,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle failed to accelerate to highway speed while climbing on ramp of highway.  Vehicle started to go to idle speed and would not accelerate when highway speed was needed to keep with flow of traffic. Had fear of being rear ended as car was just coasting. Dealer replaced VCM under warranty. Tech service bulletin TSB eng 158. Check engine light on with code DTC p200a00.",
        "vin": "kndpmcac8h7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/20/2021",
        "dateOfIncident": "07/12/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425664,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Kia Sportage. The contact stated that the transmission shifter would not go into the reverse position. The vehicle was taken to the local dealer who repaired the transmission. No further information was available. Later, while driving the vehicle suddenly stalled and was towed to the dealer who diagnosed that the engine had failed and needed to be replaced. No further information was available. The approximate failure mileage was 60,000. The VIN was not available.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/10/2021",
        "dateOfIncident": "05/17/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424182,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Mileage at 94,000 miles, less than 100,000 warrantied for,  and this car is using oil until its dry less than every 1000 miles.  I can't go anywhere without carrying oil in the car.  Took it to the dealer and was told Kia would not approve engine work.  Reported to them also that the oil light does NOT come on, it only blinked once causing concern for me because the engine was kind of dragging.  The dipstick was dry. Has happened three times since then.",
        "vin": "KNDPM3AC2H7"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/15/2021",
        "dateOfIncident": "04/30/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421050,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Kia Sportage. The contact received notification of NHTSA campaign number: 21V137000 (Service Brakes, Hydraulic) however, the part to do the recall repair was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The dealer was contacted and confirmed that the part was not yet available. The contact had not experience a failure. The manufacturer was made aware of the issue. Parts distribution disconnect.",
        "vin": "kndpmcac3h7"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/08/2021",
        "dateOfIncident": "06/08/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420202,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "i have been trying to get my recall fixed for a month now. I took it to John L Sullivan Kia in Roseville Ca and the part was not available. They were suppose to call me when they received the part and never did call me back. I recently had my A/C repaired last week at Folsom Lake Kia in Folsom CA and asked them if they could repair the recall issue as well. They had my car since last week and provided me a rental on friday, 6/4. Today on 6/8, I am told my A/C is fixed and no part for the recall so I had to pick up my car and return the rental. I have a newborn baby and this recall is extremely dangerous and its not safe. I should not have to pay for a rental when the recall is dangerous and not at fault of mine. This is ridiculous and all dealerships should provide rental cars when a recall is very serious with the part(s) being unavailable.",
        "vin": "kndpmcac6h7"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/25/2021",
        "dateOfIncident": "05/25/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418496,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Kia Sportage. The contact received notification of NHTSA campaign number: 21V137000 (Service Brakes, Hydraulic) however, the part to do the recall repair was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The local dealer and the manufacturer were made aware of the issue. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "kndpn3ac8h7"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/25/2021",
        "dateOfIncident": "05/25/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418517,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Kia Sportage. The contact received notification of NHTSA campaign number: 21V137000 (Service Brakes, Hydraulic) however, the part to do the recall repair was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The local dealer and the manufacturer were made aware of the issue. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "kndprca66h7"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/24/2021",
        "dateOfIncident": "05/24/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418335,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Kia Sportage. The contact received notification of NHTSA campaign number: 21V137000 (Service brakes, Hydraulic) however, the part to do the recall repair was unavailable. The local dealer was contacted and it was confirmed that the part was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact filed a complaint with the manufacturer. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "KNDPM3AC6H7"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/24/2021",
        "dateOfIncident": "05/24/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418398,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Kia Sportage. The contact received notification of NHTSA Campaign number: 21V137000 (Service Brakes, Hydraulic) however, the part to do the recall repair was not yet available. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was notified of the issue. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "KNDPR3A69H7"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/21/2021",
        "dateOfIncident": "05/20/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418006,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Kia Sportage. The contact received notification of NHTSA Campaign Number: 21V137000 (Service Brakes, Hydraulic) however, the part to do the recall repair was not yet available. The contact took the vehicle to the local dealer and it was confirmed that the part was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "KNDPR3A61H7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/11/2021",
        "dateOfIncident": "01/27/2021",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416124,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2017 KIA SPORTAGE. THE CONTACT STATED WHILE DRIVING AT 60 MPH, THE VEHICLE STALLED. THE CONTACT THEN HAD THE VEHICLE TOWED TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED WITH THE STARTER NEEDING TO BE REPLACED. THE VEHICLE HAD BEEN REPAIRED BUT UPON RETRIEVING THE VEHICLE FROM THE INDEPENDENT MECHANIC AND STARTING THE VEHICLE SMOKE WAS SEEN COMING FROM THE FRONT OF THE VEHICLE.  THE CONTACT OPENED THE HOOD AND SAW A FIRE BEHIND THE ENGINE COMPARTMENT. THE FIRE DEPARTMENT WAS CONTACTED AND WAS ABLE TO EXTINGUISH THE FIRE. A POLICE REPORT WAS FILED. THE VEHICLE WAS THEN TOWED TO KIA OF CHERRY HILL (1803 MARLTON PIKE W, CHERRY HILL, NJ 08002) WHERE IT WAS DEEMED A TOTAL LOSS.  THE CONTACT WAS RELATING THIS ISSUE TO NHTSA CAMPAIGN NUMBER: 21V137000 (SERVICE BRAKES, HYDRAULIC). THE MANUFACTURER HAD BEEN INFORMED OF THE FAILURE AND REFERRED THE CONTACT TO THE KIA ENGINE SETTLEMENT HOTLINE. THE FAILURE MILEAGE WAS 80,542.",
        "vin": "KNDPNCAC3H7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/01/2021",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414762,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE THE USED CAR LOT DID NOT SUPPLY IS WITH A KEY FOB, WE HAVE TO USE THE KEY TO UNLOCK THE DOORS. WHEN PUTTING KEY IN DRIVER'S DOOR AND TURNING KEY TWICE IN A ROW (QUICKLY)TO UNLOCK ALL DOORS, WE HAVE TO PULL HANDLE ANYWHERE FROM 2-3 TIMES BEFORE THE DOOR WILL OPEN. THE CAR WAS STOPPED AND NOT RUNNING WHEN THIS HAPPENS.",
        "vin": "KNDPM3AC5H7"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/30/2021",
        "dateOfIncident": "04/28/2021",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414555,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 KIA SPORTAGE. THE CONTACT STATED THAT WHILE DRIVING, THE CHECK ENGINE AND BATTERY LIGHTS SUDDENLY DISPLAYED AND SMOKE WAS SEEN COMING FROM THE ENGINE COMPARTMENT BEFORE THE VEHICLE STALLED. THE VEHICLE WAS TOWED TO THE LOCAL DEALER KIA OF BEDFORD LOCATED 18180 ROCKSIDE RD, BEDFORD, OH 44146. THE CAUSE OF THE FAILURE WAS NOT YET DETERMINED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VIN LOOKUP INDICATED THE VEHICLE WAS LISTED IN THE  NHTSA CAMPAIGN NUMBER 21V137000 (SERVICE BRAKES). THE CONTACT STATED THAT THE VEHICLE HAD EXPERIENCED THE SAME FAILURE LISTED IN THE RECALL. THE FAILURE MILEAGE WAS 84,000.",
        "vin": "KNDPN3AC1H7"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/18/2021",
        "dateOfIncident": "04/14/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11412755,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 KIA SPORTAGE GOING ON 2 YEARS WITH THIS VEHICLE 71256 MILEAGE NO ACCORDING ACCIDENTS ..AIRBAG LIGHT TURNED ON AND STAYED SOLID .. AFTER SCANNING ALL SYSTEMS FOR POSSIBLE TROUBLE CODES I DID GET A B1375 .. WHICH REFERS TO A PASSENGER DEFECTIVE AIRBAG MODULE THAT NEEDS REPLACEMENT OR FURTHER TESTING WHAT CONCERNS ME IS IF IN AN ACCIDENT WILL THIS AIRBAG FUNCTION ESPECIALLY WHEN I HAVE MY FAMILY IN THIS ONLY VEHICLE WE HAVE I CONTACTED LOCAL DEALERSHIP NOT UNDER ANY KIND OF WARRANTY I EXPLAINED WHAT IT MIGHT BE THEY QUOTED A PRICE OF OVER 1000 DOLLARS OR MORE AT THIS TIME CANNOT AFFORD SUCH AN EXPENSE I HAVE NEVER OWNED A VEHICLE WITH AIRBAG ISSUES AT ALL KIA MOTORS SHOULD ADDRESS IMMEDIATELY THIS EXTREMELY SAFETY DEFECT",
        "vin": "KNDPM3AC2H7"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/15/2021",
        "dateOfIncident": "04/11/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408269,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE DRIVING STEADY AT ABOUT 45 MPH AND THE RPM GAUGE RUBBED AT RANDOM JUST ONCE EVERY TIME. IT HAS HAPPENED MORE THAN ONCE WE DON'T CHANGE YOUR SPEED OR ANYTHING IT JUST RUBS UP TO ABOUT 5000 RPM AND GO BACK TO NORMAL AND DOES IT SPORADICALLY",
        "vin": "KNDPM3AC9H7"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/09/2021",
        "dateOfIncident": "04/03/2020",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407196,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR CAUGHT FIRE AFTER BEING DRIVEN. AS SOON AS IT WAS PARKED IT STARTED SMOKING AND WITHIN MINUTES IT WAS ENGULFED IN FLAMES AND TOTALLY DESTROYED",
        "vin": "KNDPNCAC6H7"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/08/2021",
        "dateOfIncident": "01/14/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407154,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JANUARY 14,2021 AFTER WORK AROUND 3:30 WHEN I GOT IN MY CAR IT WOULDN'T START. WE CHECKED THE OIL AND IT HAD NO OIL. A TOWING TRUCK PICKED UP MY CAR AND TOOK IT TO CLAY COOLEY KIA IN IRVING. IT'S BEEN SITTING THERE SINCE THEN AND I WAS TOLD I NEEDED TO PAY 2,600 AND THAT'S ONLY FOR WHAT THEY BELIEVE IS WRONG WITH IT. WHY AM I BEING CHARGE? ON THE RECALL NOTICE SAYS THEY WILL REPAIR AT NO COST TO THE COSTUMER. AM I BEING SCAM?",
        "vin": "KNDPM3AC6H7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/02/2021",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406127,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 KIA SPORTAGE. THE CONTACT STATED THAT THE VEHICLE WAS CONSUMING EXCESSIVE OIL. THE CONTACT STATED THAT THE OIL CONSUMPTION CAUSED THE RPM TO SURGE TO 5,000 RPMS. THE CONTACT ALSO STATED THAT AFTER DRIVING 75 MILES, DUE TO THE OIL CONSUMPTION FAILURE, THE VEHICLE USED UP A HALF TANK OF FUEL. THE VEHICLE WAS TAKEN TO CHUCK OLSEN CHEVROLET OF SEATTLE (17037 AURORA AVENUE N, SHORELINE, WAS 98133, (206)607-8743) TO BE INSPECTED. THE CONTACT WAS ASKED TO BRING THE VEHICLE BACK AFTER 1,000 MILES TO PERFORM AN OIL CONSUMPTION TEST. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 64,000.",
        "vin": "KNDPNCAC3H7"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/26/2021",
        "dateOfIncident": "03/25/2021",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404989,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACTS SON OWNED A 2017 KIA SPORTAGE. THE CONTACT STATED WHILE DRIVING AT 30 MPH, THE VEHICLE BEGAN TO SMOKE COMING FROM THE FRONT END OF THE VEHICLE. WHILE ATTEMPTING TO DEPRESS THE BRAKE PEDAL, THE VEHICLE CONTINUED FORWARD MOVEMENT. THE CONTACT PULLED OVER TO THE SIDE OF THE ROAD, AND THE VEHICLE BECAME ENGULFED IN FLAMES. THE FIRE MARSHALS WERE CALLED TO SCENE AND EXTINGUISHED THE FIRE, AND A REPORT WAS TAKEN. THE VEHICLE WAS TAKEN TO A TOW LOT WHERE IT WAS DIAGNOSED WITH BEING DESTROYED. THE VEHICLE WAS NOT REPAIRED. UPON INVESTIGATION, THE CONTACT ASSOCIATED THE FAILURE WITH, NHTSA CAMPAIGN NUMBER: 21V137000 (SERVICE BRAKES, HYDRAULIC). THE MANUFACTURER WAS INFORMED OF FAILURE AND WAS AWAITING A RESPONSE. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "KNDPMCAC8H7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "03/20/2021",
        "dateOfIncident": "03/20/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404037,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS DRIVING THE ENGINE BOGGED DOWN AND WHEN NOT ACCELERATE SO WHEN I PUSHED DOWN HARD ON THE GAS IT FINALLY KICKED IN SUPER HARD CAUSING ME TO CRASH INTO A POLE.",
        "vin": "KNDPM3ACXH7"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/13/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402804,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER DOOR WILL ONLY OPEN FROM THE OUTSIDE IF THE DOOR UNLOCKS FROM BEING PUT IN PARK. IF I UNLOCK FROM INSIDE THE CAR OR THE KEY FOB THE EXTERNAL PASSENGER HANDLE WILL NOT OPEN THE DOOR.",
        "vin": "KNDPM3AC6H7"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/12/2021",
        "dateOfIncident": "11/02/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402607,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE LIGHT CAME ON SMELL OF GAS WHEN YOU LIFT HOOD",
        "vin": "KNDPM3AC0H7"
    },
    {
        "components": "EXTERIOR LIGHTING,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "03/10/2021",
        "dateOfIncident": "01/26/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11400198,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY I HAD A CAR ACCIDENT , MY CAR BREAKS FAILED TO STOP WHEN I WAS DRIVING, MY KIA WAS GIVING ME ALERTS WITH TIRES PRESURES, NEEDS A LT S IDE BRAKE LAMP REPLACED IN MULTIPLE TIMES,  BRAKES ROTATORS BEEN CHANGED, SMELL OF BURNT CABLE INSULATION, CAN YOU INVESTIGATE IF IT COULD BE RELATED TO THE RECALLS NKS TWICE,*DT*JB",
        "vin": "KNDPN3AC6H7"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/10/2021",
        "dateOfIncident": "06/15/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400083,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL 4 WINDOW REGULATORS MALFUNCTIONED AND DO NOT WORK.  PREVENTS WINDOWS AND GOING UP AND DOWN. UNABLE TO ROLL WINDOWS DOWN. HAPPENED WHILE CAR WAS PARKED.",
        "vin": "KNDPM3AC5H7"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/09/2021",
        "dateOfIncident": "02/09/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399976,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT A STEADY SPEED, CAR WILL SUDDENLY DISENGAGE THE TRANSMISSION, THE RPMS WILL REV HIGH AND THEN TRANSMISSION WILL RE-ENGAGE.  THIS USUALLY LASTS 20-30 SECONDS, IT IS VERY RANDOM.  I HAVE TAKEN IT IN AND BECAUSE NO CODES ARE SHOWING AND THEY ARE UNABLE TO RECREATE THERE IS NOTHING THEY CAN DO.  IT IS A VERY SERIOUS ISSUE AS IF I'M DRIVING IN HEAVY TRAFFIC AND THIS OCCURS IT COULD RESULT IN A CRASH.  IT HAPPENS SPORADICALLY AND CANNOT DOCUMENT ANYTHING AS IT IS OVER BEFORE I CAN AS I AM DRIVING WHEN IT HAPPENS",
        "vin": "KNDPM3AC1H7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/08/2021",
        "dateOfIncident": "01/14/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399677,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE HAS BEEN BURNING OIL SINCE 2019. I TOLD THE SERVICE DESK AND THEY SAID A QT EVERY 1000 MILES IS NORMAL. IT STARTED TO WORSEN. IN JANUARY 2021 THE DID AN OIL CONSUMPTION TEST. I DRIVE TO CAR FOR 957 MILES AND THE DEALERSHIP TOLD ME THE CAR WAS DOWN 2 QTS OF OIL. THEY SAID THEY RUN THE TEST AGAIN. THEY FILLED THE CAR WITH WHAT THEY SAID WAS THE RIGHT AMOUNT.THE NEXT MORNING AFTER GETTING MY CAR BACK I CHECKED THE DIPSTICK THREE TIMES. THE OIL WAS A 1/2 INCH OVER THE FILL MARK I RETURN THE CAR WITH LESS THE 1000 MILES AND THIS TIME THEY SAID IT WAS ONLY DOWN A QT. AND IT WAS IN MANUFACTURERS SPEC FOR CONSUMPTION . I TOLD THEM IT WAS OVER FILLED SO THEY SAID WE WILL TEST IT AGAIN. THIS TIME THEY TOLD ME TO BRING IT BACK AT 1500 MILES. I HAVE NOT REACHED THAT AMOUNT OF MILES YET . I WORRIED ABOUT HAVING CATASTROPHIC ENGINE FAILURE WHILE I'M DRIVING . THEY HAVE ALREADY INSTALLED TWO TRANSMISSION THAT WERE DEFECTIVE.I WILL SUPPLY ANY OTHER DOCUMENTS YOU NEED .",
        "vin": "KNDPNCAC4H7"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/03/2021",
        "dateOfIncident": "01/05/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398905,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVERS SIDE REAR DOOR WILL NOT UNLOCK.  NOT MANUALLY OR ELECTRONICALLY.  THIS STARTED 2 MONTHS AGO AND THE ROSEVILLE, CA KIA SERVICE DEPT. WALNUTS TO CHARGE FOR REPAIRS.  I FEEL THAT THIS IS A SAFETY ISSUE THAT THEY SHOULD REPAIR AT NO COST TO THE BUYER.",
        "vin": "KNDPMCAC4H7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/25/2021",
        "dateOfIncident": "01/18/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389779,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR IS RAPIDLY BURNING OIL AND NOT DRIPPING ON GROUND. RECENT ACTIVITY: OIL DIPSTICK SHOWED NO OIL ON 01/18/2021 AND TOOK 3 QUARTS. IT READ FULL! ON 01/25/2021. SERVICE STATION REPORTED OUT OF OIL AGAIN! OIL LIGHT ON DASHBOARD DID NOT LIGHT.KIA DEALERSHIP ADVISED AN OIL CONSUMPTION TEST THAT WILL BE REPORTED TO YOU. I THINK IT IS IMPORTANT FOR YOU NOTE THAT THIS OCCURRED 1000 MILES INTO MY REGULARLY SCHEDULED 3000 MILE OIL CHANGE. OUR LOCAL SERVICE STATION INDICATED THAT THIS IS A WIDESPREAD PROBLEM FOR THIS CAR AND LITIGATION IS BEING CONSIDERED.",
        "vin": "KNDPMCACXH7"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/28/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385291,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 KIA SPORTAGE. THE CONTACT STATED THE CHECK ENGINE WARNING LIGHT WAS ILLUMINATED. THE CONTACT STATED THAT THE ENGINE CONSUMED OIL VERY QUICKLY. ADDITIONALLY, WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE VIBRATED ABNORMALLY. THE CONTACT STATED THE VEHICLE FAILED TO ACCELERATE AS DESIGNED. THE CONTACT ALSO STATED THAT WHILE ATTEMPTING TO PARK, THE VEHICLE STALLED WITH THE BATTERY WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO A CERTIFIED MECHANIC WHO DIAGNOSED THAT THERE WERE CYLINDER MISFIRES AND THE ENGINE NEEDED TO BE REPLACED. THE VEHICLE HAD NOT BEEN REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 127,000.",
        "vin": "KNDPMCAC6H7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/08/2020",
        "dateOfIncident": "10/12/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373724,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON OCTOBER 6,2020 MY 2017 KIA SPORTAGE SEEMED TO HAVE EXCELLERATION ISSUES; THE CAR WOULD HESITATE WHEN THE GAS PEDAL WAS DEPRESSED.  THEN ABOUT A WEEK LATER 10/9/20 MY ENGINE LIGHT WENT ON.  I USED FIXD APP TO ASSIST DIAGNOSIS.  420 CODE CATALYTIC CONVERTER.  TOOK IT TO REPUTABLE SHOP WHERE THEY CONFIRMED AND SUGGESTED I TAKE TO KIA DEALER DUE TO 80,000 MILE CATALYTIC WARRANTY.  I DID THE NEXT BUSINESS DAY.  KIA STATED THAT THEY HAD TO RUN THEIR OWN DIAGNOSIS AND WOULD CALL ME.  THEY CONFIRMED THE 420 CODE BUT STATED THEY SIMPLY 'RESET' THE COMPUTER STATING THIS IS KIA DIRECTIVE PRIOR TO REPLACING THE CATALYTIC CONVERTER; AND SAID TO BRING IT IN IF THE ENGINE LIGHT WENT ON AGAIN.  IT DID A WEEK LATER; THEY REPLACED THE VCM MOTOR 10/19/20.  NOW 11/7/20 ENGINE LIGHT IS ON AND FIXD CODE 420 CATALYTIC CONVERTER AGAIN. THEY DID NOT WANT TO HONOR THE 80,000 MILE CATALYTIC CONVERTER WARRANTY.  I AM JUST UNDER 80,000 MILES NOW AND WHEN I BROUGHT IT IN WAS AT 78,000 MILES.",
        "vin": "KNDPMCAC8H7"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/26/2020",
        "dateOfIncident": "10/02/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366566,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 KIA SPORTAGE BOTH PASSENGER AND DRIVER REAR DOORS WILL NOT OPEN FROM NEITHER THE INSIDE NOR THE OUTSIDE DOOR HANDLES. THIS IS A SERIOUS SAFETY ISSUE WITH MY AUTISTIC SON WHO MUST CLIMB OUT OF THE CAR FROM THE BACK SEAT THROUGH THE FRONT SEAT. THERE ARE NUMEROUS COMPLAINTS FROM OTHER KIA OWNERS ABOUT THIS SAME ISSUE POSTED ON HERE ON THE NHTSA WEBSITE, AND IT NEEDS TO BE ADDRESSED BY KIA.",
        "vin": "KNDPM3AC0H7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/20/2020",
        "dateOfIncident": "10/16/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365476,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2017 KIA SPORTAGE COMPLETELY DIED ON ME. IT WAS TOWED TO JENSEN TIRES AND I WAS TOLD THAT THE ENGINE WAS TOTALLY BLOWN. I THEN HAD IT TOWED TO H&H KIA IN OMAHA, NE AND SHANE CLAPPS (SERVICE PERSON) STATED THAT THE ENGINE WAS INDEED BLOWN AND NEEDS A NEW ENGINE. THE VEHICLE WAS IN MOTION AND DIED ON MY IN THE MIDDLE OF HWY 370 & 25TH ST IN BELLEVUE, NE. TRIED JUMPING THE VEHICLE, BUT IT WOULD NOT START AT ALL. THAT IS WHEN OR GOT TOWED TO JENSEN TIRES, FIRST, THEN TO H&H KIA",
        "vin": "KNDPNCAC1H7"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/09/2020",
        "dateOfIncident": "08/20/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363625,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "LEAKING COUPLER / REAR DIFFERENTIAL. GEAR OIL LEAKING.  UNDER 14,000 MILES ON VEHICLE.",
        "vin": "KNDPMCAC8H7"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/06/2020",
        "dateOfIncident": "03/08/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362971,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 KIA SPORTAGE. THE CONTACT STATED THAT WHILE DRIVING AT AN UNDISCLOSED SPEED, THE VEHICLE STALLED WITH THE CHECK ENGINE WARNING LIGHT ILLUMINATED. WHILE STOPPED AT A STOP LIGHT, THE ACCELERATOR PEDAL WAS DEPRESSED HOWEVER, THE VEHICLE FAILED TO RESPOND. THE VEHICLE WAS NOT TAKEN TO A DEALER OR AN INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING. THE CONTACT STATED THAT THE FAILURE RECURRED INTERMITTENTLY. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE CONTACT WAS REFERRED TO AN AUTHORIZED DEALER FOR ASSISTANCE. THE FAILURE MILEAGE WAS APPROXIMATELY 54,000.",
        "vin": "KNDPNCACXH7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/27/2020",
        "dateOfIncident": "09/25/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361372,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE CHANGED OIL IN LESS THAT 3000 MILES EVERY TIME AS IT WAS SUPPOSED TO BE CHANGED. NOW I HAVE METAL SHAVINGS IN MY OIL",
        "vin": "KNDPM3AC4H7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/24/2020",
        "dateOfIncident": "09/09/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361000,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE MAKING A STOP SIGN MY KIA SPORTAGE STARTED ACCELERATING INVOLUNTARILY LIKE IF I STEP ON THE GAS PEDAL ALL THE WAY!  I IMMEDIATELY THOUGHT OF JUST TURNING MY VEHICLE OFF BUT AFTER I SWITCH THE GEAR TO NEUTRAL. THIS INCIDENT WAS VERY SCARY TO THE POINT THAT I DO NOT FEEL SECURE TO DRIVE IT. VERY SCARY EXPERIENCE.",
        "vin": "KNDPMCACXH7"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/15/2020",
        "dateOfIncident": "01/15/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355067,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH SECOND ROW (PASSENGER) WINDOWS NO LONGER OPEN.",
        "vin": "KNDPR3A61H7"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/10/2020",
        "dateOfIncident": "09/04/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354292,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE THE VEHICLE IS IN MOTION INTERSTATE OR CITY STREET, THE ENGINE REVS UP WITHOUT PUTTING MORE PRESSURE ONTO THE GAS PEDDLE. ON SEVERAL OCCASIONS I HAD TO HIT THE BRAKE PEDDLE TO AVOID HITTING ANOTHER VEHICLE AND ONCE PULLED INTO THE SIDE OF THE ROAD AS A PRECAUTION. WE FIRST NOTICED THIS PROBLEM ABOUT A COUPLE OF MONTHS AFTER PURCHASING THE VEHICLE. I PREVIOUSLY REPORTED THIS TO KIA DEALERSHIP, HOWEVER HE INDICATED THAT IT WOULD BE THE ALTERNATOR OR SOMETHING THAT IS CAUSING THE ENGINE TO NOT KNOW WHAT GEAR IT'S ACTUALLY ON. THIS HAPPENS RANDOMLY AND AT ANY SPEED. THE SEAT BELT LIGHT FLASHES OCCASIONALLY ALTHOUGH NO ONE ELSE IS SITTING IN THE VEHICLE AND MY SEAT BELT IS ATTACHED.",
        "vin": "KNDPMCAC5H7"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/04/2020",
        "dateOfIncident": "08/20/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353206,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS HAPPENED TWICE IN 10 DAYS. ONCE WHILE DRIVING AND ONCE IN PARKING MODE WITH VEHICLE ON - SUDDENLY THE VEHICLE LOSES POWER, CANNOT ACCELERATE, POWER STEERING IS LOST, AND 3 PANEL LIGHTS TURN ON SIMULTANEOUSLY: BATTERY, OIL, CHECK ENGINE. BOTH TIMES BY TURNING OFF AND RESTARTING ENGINE I HAVE BEEN ABLE TO CONTINUE DRIVING, POWER IS RESTORED AND PANEL LIGHTS TURN OFF.   HAVE TAKEN BOTH TIMES TO KIA SERVICE SOUTHSIDE/JACKSONVILLE FL AND THEY HAVE NOT BEEN ABLE TO IDENTIFY THE CAUSE, THEREFORE UNABLE TO FIX A POTENTIALLY VERY DANGEROUS AND LIFE-THREATENING SITUATION IF THIS CONTINUES TO HAPPEN, ESPECIALLY WHILE DRIVING. EXTREMELY CONCERNED!",
        "vin": "KNDPM3AC5H7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/31/2020",
        "dateOfIncident": "08/17/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352204,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CLASS ACTION LAW SUIT FOR MY CAR FOR ENGINE PROBLEMS (KNOCKING, FIRE, ECT). MY CAR IS KNOCKING AND DOES NOT HAVE AN ACTIVE RECALL.",
        "vin": "KNDPM3AC0H7"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/27/2020",
        "dateOfIncident": "08/27/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351692,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG SAFTY LIGHT CAME ON AND WILL NOT GO OFF..  THE OWNER'S MANUAL SAYS THIS MEANS THE AIRBAG IS NOT WORKING OR IS MALFUNCTIONING.",
        "vin": "KNDPM3ACXH7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/24/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350929,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SIDE WINDOW REGULATOR BROKE WHILE WINDOW WAS DOWN THEN A WEEK LATER THE EXACT SAME THING HAPPENED ON THE DRIVERS SIDE.",
        "vin": "KNDPM3AC9H7"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/24/2020",
        "dateOfIncident": "08/18/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351012,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST RECEIVED A NOTICE OF PROPOSED CLASS SETTLEMENT REGARDING : ENGINE SEIZURE,ENGINE STALL,ENGINE NOISE,OR ILLUMINATION OF OIL LAMP THAT WAS DIAGNOSED AS REQUIRING REPAIR OF ENGINE. I AM VERY CONCERNED ABOUT THIS CAN YOU PLEASE LOOK INTO THE INFORMATION THAT I HAVE PROVIDED ASAP. THANKS, [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "KNDPMCAC1H7"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/04/2020",
        "dateOfIncident": "07/03/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343364,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SIDE REAR DOOR FAILS TO OPEN FROM BOTH INSIDE AND OUTSIDE OF THE VEHICLE. THIS HAPPENED UNEXPECTEDLY AND WITHOUT PROVOCATION. THERE ARE NUMEROUS FILED COMPLAINTS SITING THIS VERY SAME ISSUE ON THE NHTSA.GOV WEBSITE AND SHOULD BE INVESTIGATED.",
        "vin": "KNDPM3AC0H7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/03/2020",
        "dateOfIncident": "08/03/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343067,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MID-DECEMBER I NOTICED MY CAR WAS SKIPPING AS I ACCELERATED. I CHECKED THE OIL AND THERE WAS NONE. I HAD JUST GOTTEN AN OIL CHANGE 10/26/19. I TAKE THE CAR IN 12/23/19. THEY DO ANOTHER OIL CHANGE AND TELL ME AS IT GETS LOW ON OIL TO BRING IT IN AND THEY WILL TRACK IT. WE DO THIS A FEW TIMES AND COVID HAPPENS. SO, I'M ADDING MY OWN OIL AND RESTART THE PROCESS 6/23/20. MY BF BRINGS THE CAR IN 7/31/20 AND THE MECHANIC STATES KIA WILL NO LONGER BE DOING OIL CONSUMPTION TESTS AND WOULD ONLY SEE THE CAR IF SOMETHING CATASTROPHIC OCCURS. THEN PLAINLY SAYS DO NOT ADD OIL AND LET IT BLOW IT UP. I RETURN 8/3/20 TO SPEAK TO THE MANAGER IN CHARGE AND HE CONFIRMS THAT IT IS KIA'S POLICY THAT THEY WILL NOT ADD OIL ANYMORE. SAYS HE CANNOT GIVE ME THE POLICY IN WRITING. I SAID I HAD AN OIL CHANGE WITH YOU ON 6/23/20 AND TODAY 8/3/20 MY CAR DOESN'T HAVE ANY OIL IN IT AND YOU WON'T LOOK AT IT? HE CONFIRMED HE WOULD NOT LOOK AT IT.",
        "vin": "KNDPMCAC7H7"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/13/2020",
        "dateOfIncident": "06/13/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328680,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ON THE STREET DRIVING PULLING OUT IN TRAFFIC. WHEN I TRIED TO GIVE GAS CAR MADE IDLE SOUND BUT DID NOT MOVE. I WAS IN MIDDLE OF STREET. NOT FIRST TIME HAPPENING..ADVISED NALLY KIA DEALERSHIP. DID NOT HELP ME.  *TR",
        "vin": "KNDPM3AC6H7"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/20/2020",
        "dateOfIncident": "06/25/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325344,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE HEADLIGHT LAMP LENS IS TURNING YELLOW, VERY DISTORTED.  *TR",
        "vin": "KNDPN3AC1H7"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "05/15/2020",
        "dateOfIncident": "05/14/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324703,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE ACCELERATED ON ITS OWN CAUSING ACCIDENT & HEAD ON COLLISION TO A WALL.  AIRBAGS WAS NOT DEPLOYED. I WAS PULLING UP THE DRIVEWAY GETTING READY TO PARK WHEN SUDDENLY THE CAR ACCELERATED ON ITS OWN WHICH LED TO CRASH THROUGH THE GARAGE DOOR & HIT A WALL.  *TR",
        "vin": "KNDPN3AC7H7"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "05/15/2020",
        "dateOfIncident": "05/14/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324707,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON PULLING UP TO THE DRIVEWAY TO GET READY TO PARK, VEHICLE SUDDENLY ACCELERATED ON ITS OWN LEADING TO CRASH THROUGH THE GARAGE DOOR & IMPACT TO THE WALL.  AIRBAGS DID NOT DEPLOY.  *TR",
        "vin": "KNDPN3AC7H7"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/21/2020",
        "dateOfIncident": "04/10/2020",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11321777,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 KIA SPORTAGE LOST ALL POWER AS I WAS DRIVING DOWN THE ROAD.   NO POWER STEERING NO BRAKING NOTHING.   SMOKE AND FUMES FILLED THE CAB OF SUV.   ONCE I GOT OFF THE ROAD SMOKE WAS BOILING OUT OF HOOD OF CAR.",
        "vin": "KNDPR3A69H7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/10/2020",
        "dateOfIncident": "05/28/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320770,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR CHECK ENGINE LIGHT COMES ON WHILE DRIVING. PUTTING THE CAR INTO LIMP MODE. VERY DANGEROUS IN TRAFFIC. LOW POWER. THE CAR HAS TO BE TOWED. THEY REPLACE A SINGLE WIRE UNDER THE HOOD EACH TIME.. HAPPENED 3 TIMES IN 1.5 YEARS. THEY ARE NOT FIXING THE CAR, JUST PUTTING A BAND AID ON IT ,AND  KICKING THE CAN DOWN THE ROAD.",
        "vin": "KNDPM3AC0H7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/03/2020",
        "dateOfIncident": "07/15/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320115,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS 3 YEARS OLD AND I AM NOT ABLE OPEN BOTH FRONT DOORS FROM OUTSIDE. IT IS MECHANICAL ISSUE WITH KIA QUALITY PRODUCT. SPECIALLY MY PASSENGER DOOR WAS NOT OPEN THAT OFTEN. THE ISSUE IS THAT AFTER LOCKING THE CAR AND THEN I TRY UNLOCK, THE DOOR IS UNLOCK BUT OUTSIDE HANDLE DO NOT OPEN THE DOOR. INSIDE HANDLE WORKS WITH NO PROBLEM. SINCE MY WARRANTY ENDED AT 60K, SO IT IS NOT COVER BUT I AM SURE MORE CARS HAVE THE SAME ISSUES AND SHOULD BE RECALL CREATED FOR THIS ISSUE,",
        "vin": "KNDPMCAC9H7"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/09/2020",
        "dateOfIncident": "11/17/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317011,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD JUST STARTED THE CAR WHEN THE AIR BAG CAUTION LIGHT APPEARED ON THE DASHBOARD. TOOK THE VEHICLE TO DEALER FOR DIAGNOSTIC TO FIND OUT THE AIR BAG CONTROL MODULE WAS BAD AND NEEDED TO BE REPLACED. WHILE WAITING FOR SERVICE, MY HUSBAND WAS ASKED WHETHER WE HAD BEEN IN AN ACCIDENT AND HE TOLD  THEM NO. WE PURCHASED THE CAR FROM THE DEALER CERTIFIED USED AND THERE WAS NO MENTION OF ANY ACCIDENTS PRIOR TO US PURCHASING IT. FAILURE TO REPLACE THE CONTROL UNIT WOULD HAVE RENDERED THE AIR BAG SYSTEM USELESS.",
        "vin": "KNDPM3AC6H7"
    },
    {
        "components": "PARKING BRAKE,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/06/2020",
        "dateOfIncident": "03/06/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316603,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY PARKING BRAKE NO LONGER SETS, IT JUST PUMPS AND NEVER LOCKS.  SO I HOPE I DON'T HAVE TO PARK ON ANY HILLS FOR A WHILE.  ALSO, MY HEATING AND AIR GOES WONKY SOMETIMES AND WON'T SHOW ME THE ACTUAL TEMP OR GIVE ME THE OPTION TO INCREASE OR DECREASE IN TEMP OR MODE UNLESS I PARK AND TURN THE ENGINE OFF, START IT AGAIN, THEN TURN OFF THE WHOLE COOLING OR HEATING SYSTEM AND THEN MESS WITH IT MORE.  MY CAR IS ALSO OFTEN TIMES IN DRIVE, AND IT'LL REV UP FOR NO REASON TO THE RED LINE, THEN STALL AND COAST TO A STOP.  I'VE BEEN LUCKY MY KIDS HAVE YET TO BE WITH ME WITH THIS HAPPENING AND IT'S BEEN ON BACK ROADS WITH LITTLE TRAFFIC.  ALL THESE THINGS WHILE CAR IS IN DRIVE/MOTION, EXCEPT PARKING BRAKE, THAT IS OBVIOUSLY WHILE IN PARK THAT I'VE NOTICED.",
        "vin": "KNDPM3ACXH7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/05/2020",
        "dateOfIncident": "11/27/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316463,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "KIA SPORTAGE 2017 BEGAN SHOWING EXCESSIVE OIL CONSUMPTION. IT WAS TAKEN TO THE LOCAL KIA SERVICE STATION. THE DEALER PERFORMED AN OIL CONSUMPTION TEST THAT SHOWED, TWICE, THAT THE VEHICLE CONSUMED ONE AND A HALF QUARTS OF OIL PER 1,000 MILES OF USE. IT WAS TAKEN FOR FURTHER ANALYSIS AFTER CONFIRMATION OF ADEQUATE OIL CHANGE SCHEDULE AND AT 39914 MILES. MOTOR WAS DISASSEMBLED AND AFTER MORE THAN 3 WEEKS, DIAGNOSIS IS UNCERTAIN. THIS PROBLEM MAY CAUSE MALFUNCTION OF INTERNAL PARTS AND THERE MAY BE A HIGH PROBABILITY OF SAFETY COMPROMISE ON PUBLIC HIGHWAYS.",
        "vin": "KNDPM3AC1H7"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/28/2020",
        "dateOfIncident": "02/27/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11312180,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL FOUR POWER WINDOW REGULATOR/MOTORS HAVE HAD TO BE REPLACED.  VEHICLE PLACED IN SERVICE MAY 2016 AND CURRENTLY HAS 34,000 MILES.  DRIVER SIDE AND PASSENGER SIDE REGULATOR/MOTOR'S FAILED WHILE VEHICLE STILL UNDER WARRANTY.  BOTH REAR WINDOW REGULATOR/MOTOR'S FAILED DECEMBER 2019 AND WERE REPLACED FEBRUARY 2020 BY THE DEALER AT A COST TO THE OWNER OF  $1044.63.",
        "vin": "KNDPM3AC8H7"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/06/2020",
        "dateOfIncident": "12/11/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307549,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 KIA SPORTAGE. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 20-50 MPH, THE RPM REVVED SUDDENLY WHICH CAUSED THE FRONT WHEELS TO SPIN AND THE VEHICLE TO INDEPENDENTLY ACCELERATE. THE VEHICLE WAS TAKEN TO DUTCH MILLER KIA OF CHARLESTON (339 MACCORKLE AVE SW, SOUTH CHARLSTON WEST VA) THERE THE TRANSMISSION SENSOR WAS RESET HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS NOT NOTIFIED. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 38,000.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/28/2020",
        "dateOfIncident": "01/15/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302554,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PULLING INTO A PARKING SPACE WITH MY FOOT ON THE BRAKE, MY ENGINE ACCELERATED AS IF IT HAD A MIND OF IT'S OWN AND HIT A POST. I PUSHED HARD ON THE BRAKE WITH NO RESPONSE. THE AIRBAG DID NOT DEPLOY EVEN WITH $5,500 DAMAGE TO THE FRONT END.",
        "vin": "KNDPRCA66H7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/23/2020",
        "dateOfIncident": "09/28/2019",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301464,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE CAUGHT ON FIRE",
        "vin": "KNDPM3AC2H7"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/13/2019",
        "dateOfIncident": "09/10/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288914,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 KIA SPORTAGE. WHILE DRIVING APPROXIMATELY 60 MPH, THE SUN ROOF EXPLODED WITHOUT WARNING OR AN IMPACT OCCURRING. THE CONTACT STATED THAT THE GLASS SHATTERED. THERE WERE NO INJURIES. THE DEALER AND MANUFACTURER WERE NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS REPAIRED BY THE INSURANCE COMPANY. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE FAILURE MILEAGE WAS APPROXIMATELY 20,000.",
        "vin": "KNDPNCAC7H7"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/05/2019",
        "dateOfIncident": "12/03/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287098,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Tireco, Inc.",
                "productMake": "MILESTAR",
                "productModel": "TRACTION",
                "productYear": "9999",
                "size": "9.00-20 E/10",
                "type": "Tire"
            }
        ],
        "summary": "THOUGH SOLD AS \"ALL SEASON\" M+S RATED TIRES, THE MILESTAR MS932XP+ HAS DANGEROUSLY POOR TRACTION ON EVEN MINOR SNOW ACCUMULATIONS. WHILE DRIVING ON A FLAT PAVED STATE ROAD THAT HAD 1/4 INCH OR LESS FRESH SNOW AND MINIMAL/NO TREATMENT, IN A LATE MODEL AWD CROSSOVER SUV WITH 245/45R-19 TIRES, THE MILESTAR TIRES HAD DANGEROUSLY POOR TRACTION. ANY ACCELERATION, NO MATTER HOW SLOW, RESULTED IN WHEELSPIN AND LATERAL MOVEMENT OF THE VEHICLE WITH TRACTION/STABILITY CONTROL ENGAGEMENT. EVEN MINIMAL BRAKING PRESSURE RESULTED IN FULL ABS ENGAGEMENT. BRAKING DISTANCES WERE EXTREMELY LONG. THE PERFORMANCE OF THESE TIRES WAS NOT CONSISTENT WITH ANY OTHER ALL-SEASON M+S RATED TIRE I'VE USED, AND WAS MORE CONSISTENT WITH A \"SUMMER\" TIRE. SELLING THESE TIRES AS \"ALL SEASON M+S\" IS MISLEADING AND DANGEROUS.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/01/2019",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277468,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER WINDOW MOTORS FAILING.  THIS CAR HAS LESS THAN 55,000 MILE ONE IT AND ONLY 2 YEARS OLD BUT THREE OUT OF THE FOUR POWER WINDOW MOTORS HAVE FAILED IN THE PAST TWO MONTHS.",
        "vin": "KNDPM3AC4H7"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/30/2019",
        "dateOfIncident": "10/26/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277144,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH 60,700 MILES, THE DRIVER'S SIDE  REAR DOOR LOCKS AND UNLOCKS, BUT WILL NOT OPEN.  DEALERSHIP STATED I WAS OVER WARRANTY BY 700 MILES.  I EXPLAINED THAT I THOUGHT THIS SHOULD BE TREATED AS A SAFETY ISSUE AS IF THE VEHICLE IS IN AN ACCIDENT ON THE PASSENGER SIDE, REAR OCCUPANTS CAN NOT EXIT THE VEHICLE ON DRIVER'S SIDE",
        "vin": "KNDPMCAC3H7"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/29/2019",
        "dateOfIncident": "10/18/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11276909,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SOMETIMES WHEN WE ACCELERATE THE CAR STALLS & REVS UP, THEN IT WILL ACT FINE, BUT THE CHECK ENGINE LIGHT WILL STAY ON FOR A BIT.  THEN GOES OFF AND IT ACTS NORMAL.  THIS IS ALL WHILE DRIVING.  THIS HAS BEEN HAPPENING OVER A FEW MONTHS,,,IT'S JUST EVERY SO OFTEN.",
        "vin": "KNDPM3AC5H7"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/07/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266883,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 KIA SPORTAGE. WHILE DRIVING 60 MPH, A LOUD NOISE WAS DETECTED, THE VEHICLE VIOLENTLY JERKED, AND THE CHECK ENGINE INDICATOR ILLUMINATED. THE CONTACT ALSO DETECTED FUMES. THE VEHICLE WAS PULLED OVER TO THE SIDE OF THE ROAD, RESTARTED, AND WAS ABLE TO FUNCTION NORMALLY; HOWEVER, THE FAILURE RECURRED MULTIPLE TIMES. THE VEHICLE WAS TAKEN TO JIM SHORKEY KIA (12900 US-30, IRWIN, PA 15642, (724) 241-0176) WHERE THE CONTACT WAS INFORMED THAT THE FAILURE WAS DUE TO THE ENGINE AND FLOORMAT. WHEN THE VEHICLE WAS PREVIOUSLY TAKEN TO THE DEALER, NO FAILURES WERE FOUND. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 3,000.",
        "vin": "KNDPMCAC4H7"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/26/2019",
        "dateOfIncident": "09/19/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258358,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "07/25/2019 TOOK CAR TO HILLTOP KIA BECAUSE AUTO TRANSMISSION HAD BEEN SLIPPING, THEN STUCK IN 4TH GEAR. COULD NOT MANUALLY SHIFT TO CHANGE. DEALER REPLACED TRANSMISSION SWITCH PLATE/SENSOR. CAR WAS RETURNED TO ME ON 8/15/2019. 9/19 RETURNED CAR TO DEALER AS TRANSMISSION STARTED SLIPPING AGAIN, SHIFTING ROUGH AND THEN ACCELERATING TO GET ON FREEWAY RPMS FLEW UP AS CAR WENT INTO NEUTRAL. I LUCKILY STAYED TO RIGHT AS TRUCK BEHIND ME SWERVED LEFT. CAR THEN WENT INTO GEAR, I GOT OFF FREEWAY. DEALER HAD ME RIDE WITH MECHANIC AND PROBLEM OF SLOW UPSHIFTING, ROUGH SHIFTING AND DELAYED SHIFTING WAS DUPLICATED. DEALER WAS NOT ABLE TO PULL ANY CODES.  THIS IS SERIOUS SAFETY ISSUE. I OPENED KIA CASE NUMBER  13369527. KIA CUSTOMER SERVICE, CHRIS, STATED PER HIS MANAGER JADA WOULD ESCALATE. CHRIS ALSO STATED THERE WAS NO RECORD OF PREVIOUS NHTSA COMPLAINT 11231076 FILE 07/11/2019",
        "vin": "KNDPM3AC5H7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/22/2019",
        "dateOfIncident": "09/04/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257240,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "EXPERIENCING REDUCED PERFORMANCE AND INTERMITTENT MALFUNCTIONING OF THE AIR CONDITIONING SYSTEM WHILE THE ENGINE IS IN IDLE.",
        "vin": "KNDPM3AC0H7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/17/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256065,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 KIA SPORTAGE LX 2.4L BOUGHT BRAND NEW AND HAS BEEN USING OIL. CAR NOW HAS A LITTLE OVER 22,000 MILES AND IS USING 1.4 QUARTS OF OIL DURING THE 5000 MILE DEALERSHIP OIL CHANGES WHICH HAVE ALL BEEN DONE AT THE DEALERSHIP SINCE PURCHASING NEW. THE DEALERSHIP ACKNOWLEDGES THERE IS A PROBLEM WITH THE ENGINE AFTER PERFORMING 3 OIL CONSUMPTION TEST HOWEVER KIA CORPORATE CONSIDERS THE OIL USAGE NORMAL SO THEY ARE DECLINING TO FIX THE ISSUE SINCE THEIR \"TECHNICIANS\" DOES NOT SEE THIS AS A PROBLEM TO COVER UNDER WARRANTY.  AN INTERNET SEARCH \"KIA OIL CONSUMPTION\" FOUND MULTIPLE COMPLAINTS FROM OTHER OWNERS WITH THE SAME ISSUE AND SAME RESPONSE FROM KIA.",
        "vin": "KNDPM3AC0H7"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/16/2019",
        "dateOfIncident": "07/08/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255756,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT REAR PASSENGER DOOR CAN NOT BE OPENED FROM INSIDE OR OUTSIDE THE VEHICLE.  PROBLEM NOTICED AT ABOUT 55,000 MILES.  DEALER HAS BEEN UNABLE TO OPEN DOOR.  CURRENTLY 56,600 MILES ON VEHICLE.  'PARTS ON ORDER' FOR THE FIRST PROBLEM LIKE THIS THEY HAVE SEEN.",
        "vin": "KNDPR3A60H7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/16/2019",
        "dateOfIncident": "08/15/2019",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244424,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS IN MOTION ON A HIGHWAY, THERE WAS WHITE SMOKE COMING FROM THE ENGINE.  IMMEDIATELY AFTER PULLING OVER MORE WHITE SMOKE CAME OUT OF THE ENGINE TOWARDS THE REAR OF THE MOTOR.  AFTER EXITING THE VEHICLE FLAMES APPEARED FROM UNDER THE CAR NEAR THE REAR OF THE MOTOR, THE FLAMES GREW FROM ALL SIDE OF THE ENGINE.  THE FIRE SPREAD TO THE DASH AND INTERIOR OF THE CAR CAUSING THE PASSENGER AIRBAGS TO BLOW.",
        "vin": "KNDPN3AC0H7"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/14/2019",
        "dateOfIncident": "08/01/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244046,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION WILL SUDDENLY DISENGAGE AND ENGINE WILL ACCELERATE TO 4500 RPM OR HIGHER.  THIS HAPPENS WHILE DRIVING MOSTLY WHEN VEHICLE IS BETWEEN 25 AND 45 MPH.  THIS HAPPENS SEVERAL TIMES A MONTH. THIS HAS CAUSED VEHICLE TO PAUSE WHEN SWITCHING LANES, ALMOST CAUSING AN ACCIDENT.  THIS HAS HAPPENED MULTIPLE TIMES OVER THE LAST YEAR.",
        "vin": "KNDPNCACXH7"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/12/2019",
        "dateOfIncident": "07/04/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243353,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION STARTED EARLY UPSHIFTING AFTER 12K MILES.  WHILE NOT APPARENTLY DANGEROUS, I FIND IT VERY ANNOYING.",
        "vin": "KNDPNCAC7H7"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/08/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242513,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT DRIVER HANDLE DO NOT OPEN THE CAR. IF YOU LOCK THE CAR AND UNLOCK, YOU CAN NOT OPEN DRIVER DOOR FROM OUTSIDE. I TRIED DOOR ADJUSTMENT AND DIDN'T WORK. IT COULD BE OPEN FROM INSIDE. THE CAR IS 2 YEARS OLD. IT IS SAFETY HAZARD SINCE THE DOOR COULD NOT BE OPEN FROM OUTSIDE.",
        "vin": "KNDPMCAC9H7"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/08/2019",
        "dateOfIncident": "08/07/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242516,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTER STOPPED WORKING AFTER 80000 MILES. IT WAS THE ISSUE WITH SOLENOID BUT I HAD TO REPLACE THE STARTER. MY SAFETY CONCERN WAS THAT I WAS ATE GAS STATION AT SAMS CLUB AND I WAS NOT ABLE RESTART THE CAR AFTER FUELING GAS.",
        "vin": "KNDPMCAC9H7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/07/2019",
        "dateOfIncident": "06/24/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242231,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUNROOF / MOONROOF EXPLODED FOR NO REASON WHILE DRIVING.",
        "vin": "KNDPR3A64H7"
    },
    {
        "components": "POWER TRAIN,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/11/2019",
        "dateOfIncident": "07/07/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231076,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC TRANSMISSION INTERMITTENTLY, SLIPPING GEARS BUT SEEMS TO RESOLVE ON IT'S OWN WHILE DRIVING ON CITY STREETS AND HIGHWAY. NOW ALSO INTERMITTENTLY ITS NOT SHIFTING GEARS AT ALL ALSO WHILE DRIVING ON CITY STREET. AUTOMATIC TRANNY STUCK IN 4TH AND UNABLE TO MANUALLY SHIFT INTO ANOTHER GEAR. THE INSTRUMENT DISPLAY SHOWS ESP ON (ELECTRONIC STABILITY PROGRAM) INDICATOR AND DBC ON (DOWNHILL BRAKE CONTROL) INDICATORS WHEN STUCK IN GEAR. SAFETY ISSUE AS UNABLE TO MOVE WITH NORMAL ACCELERATION, BUT SLOW CRAWL TO GET OUT OF ROADWAY.   REAR SEATBELT WONT LATCH WHEN CAR IS STATIONARY.",
        "vin": "KNDPM3AC5H7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/06/2019",
        "dateOfIncident": "06/05/2019",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218227,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR BLEW UP IN DRIVEWAY AFTER NOT EVEN BEING DROVE FOR TWO DAYS ENGINE ENGULFED IN FLAMES",
        "vin": "KNDPN3AC7H7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/23/2019",
        "dateOfIncident": "05/04/2019",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209468,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2017 KIA SPORTAGE. THE CONTACT STATED THAT TEN MINUTES AFTER THE VEHICLE WAS PARKED, THE CONTACT NOTICED SMOKE BILLOWING FROM UNDER THE HOOD OF THE VEHICLE. SEVERAL FIRE FIGHTERS ON SITE AT THE MOMENT ATTEMPTED TO EXTINGUISH THE FIRE BUT WAS UNABLE TO DO SO. THE FIRE DEPARTMENT WAS CONTACTED AND WAS ABLE TO EXTINGUISH THE FIRE. A FIRE REPORT WAS FILED. THE VEHICLE WAS TOWED TO A TOW FACILITY. THE VEHICLE WAS NOT YET INSPECTED. THE DEALER WAS NOT CONTACTED OR NOTIFIED OF THE FIRE. THE MANUFACTURER WAS CONTACTED AND NOTIFIED OF THE FAILURE. THE VEHICLE WAS DESTROYED. THE APPROXIMATE FAILURE MILEAGE WAS 30,000.",
        "vin": "KNDPR3A60H7"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/14/2019",
        "dateOfIncident": "03/21/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11207754,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 KIA SPORTAGE. CONSUMER WRITES IN REGARDS TO UNHEALTHY AIRBORNE MOLD IN VEHICLES. *LD    THE CONSUMER STATED THE MANUFACTURER REPAIRED THE DASHBOARD, BUT THE CONSUMER WAS STILL BECOMING SICK DUE TO THE DOOR PADS BEING MADE FROM THE SAME MATERIAL. THE TRANSMISSION  AND THE ECM WAS REPLACED DUE TO IT THE TRANSMISSION SLIPPING, BUT THE FAILURE RECURRED.  *JS  *JS",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/09/2019",
        "dateOfIncident": "05/09/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11206714,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 KIA SPORTAGE. CONSUMER WRITES IN REGARD TO TRANSMISSION SLIPPAGE AND AIRBORNE MOLD WITHIN CABIN. *AS    THE CONSUMER WAS GETTING SICK FROM THE SUBSTANCE FORMING ON THE DASHBOARD AND HAD TO RECIEVE MEDICAL ATTENTION FROM URGENT CARE. THE TRANSMISSION WOULD INTERMITTENTLY SLIP WITHOUT ANY ERROR MESSAGE DISPLAYED. THE TRANSMISSION WAS REPLACED, BUT THE FAILURE RECURRED.*JS",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/20/2019",
        "dateOfIncident": "03/20/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190322,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WON'T START FOR NO REASON AT ALL ON SOME OCCASIONS",
        "vin": "KNDPM3AC7H7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/19/2019",
        "dateOfIncident": "12/14/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190050,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT GLASS OR THE SUNROOF EXPLODED WHILE DRIVING",
        "vin": "KNDPNCAC3H7"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/13/2019",
        "dateOfIncident": "12/04/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186625,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 KIA SPORTAGE. THE CONTACT STATED THAT THE FRONT PASSENGER SEAT WAS TOO LOW AND COULD NOT BE  ADJUSTED. THE VEHICLE WAS TAKEN TO THREE DIFFERENT DEALERS, INCLUDING CHINO HILLS FORD (909-203-5700, LOCATED AT 4480 CHINO HILLS PKWY, CHINO, CA 91710), BUT THEY STATED THAT NOTHING COULD BE DONE. THE MANUFACTURER WAS CONTACTED AND STATED THAT IT WAS A KNOWN FAILURE, BUT THEY COULD NOT ASSIST. THE FAILURE WAS NOT REMEDIED. THE FAILURE MILEAGE WAS APPROXIMATELY 34,000.",
        "vin": "KNDPM3AC0H7"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/06/2019",
        "dateOfIncident": "01/08/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184696,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 KIA SPORTAGE. WHILE DRIVING 70 MPH, THE SUN ROOF EXPLODED WITHOUT WARNING OR IMPACT. THERE WERE NO INJURIES. THE VEHICLE WAS TAKEN TO ARAPAHOE KIA (9701 E ARAPAHOE RD, CENTENNIAL, CO 80112) AND THE CONTACT WAS INFORMED THAT THERE WERE NO OPEN RECALLS. THE MANUFACTURER WAS CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 15,000.",
        "vin": "KNDPRCA68H7"
    },
    {
        "components": "POWER TRAIN,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/05/2019",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184330,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITIONING / HEAT SYSTEM LEAKS AIR ONTO FRONT WINDSHIELD CAUSING FOG ON THE INSIDE/OUTSIDE OF FRONT GLASS. TRANSMISSION DOES NOT ENGAGE FULL TIME WHILE IN MOTION. WHILE DRIVING FORWARD, THE ENGINE WILL RACE AND THE TRANSMISSION WILL BECOME DISENGAGED, WITHIN 20-90 SECONDS THE TRANSMISSION RE-ENGAGES AND YOU CAN PROCEED. THIS HAPPENS SOMETIME WHILE YOU ARE ENTERING A HIGHWAY FROM AN ON RAMP AS YOU ACCELERATE INTO MOVING TRAFFIC. THE TRANSMISSION WAS REPLACED WITH A REMANUFACTURED TRANSMISSION LESS THAN 6 MONTHS AGO AND THE VEHICLE IS STARTING, TO SHOW THESE SAME SYMPTOMS AGAIN. IT HAPPENED WHILE ON 1-95 IN THE ALEXANDRIA AREA OF VIRGINIA, ROUTE 66 SOUTH, ROUTE 29 EXPRESSWAY IN LYNCHBURG, VA JUST LAST WEEK. I HAVE BROUGHT THIS TO THE ATTENTION OF THE DEALERSHIP AND THE MANUFACTURER WITHOUT ACTION. THIS MALFUNCTION IS A THREAT TO THE SAFETY OF THE DRIVER AND OCCUPANTS AS WELL AS OTHER VEHICLES ON THE HIGHWAY. WITHOUT THE ABILITY TO MAINTAIN CONTROL OF THE VEHICLE IT IS POSSIBLE TO CAUSE AN ACCIDENT.",
        "vin": "KNDPMCAC2H7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/05/2019",
        "dateOfIncident": "01/03/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184413,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DECEMBER 2018 RECEIVED A NOTICE FROM KIA THAT THE COMPANY WAS CONDUCTING A PRODUCT IMPROVEMENT CAMPAIGN TO PERFORM A SOFTWARE UPDATE ON ALL 2016-2018 MY SPORTAGE VEHICLES EQUIPPED WITH 2.4L GASOLINE DIRECT INJECTION AND 2.0L TURBOCHARGED ENGINES TO PROTECT THE ENGINE FROM EXCESSIVE CONNECTING ROD BEARING DAMAGE.  UPDATE WAS TO BE DONE FREE OF CHARGE AND WOULD ONLY INVOLVE THE ADDITION OF NEWLY DEVELOPED COMPUTER SOFTWARE FOR THE ECU.  ON JANUARY 3RD 2019 I HAD THE UPDATE COMPLETED AT THE KIA DEALERSHIP FROM WHERE THE VEHICLE HAD BEEN LEASED.  APPROXIMATELY 15 MILES AFTER LEAVING THE DEALERSHIP THE VEHICLE WENT INTO \"LIMP MODE\", RESTRICTING THE ENGINES RPM'S AND ACCELERATION.  I IMMEDIATELY PULLED OFF THE ROADWAY AND CONTACTED THE DEALERSHIP.  I WAS INFORMED TO RETURN WITH THE VEHICLE TO THE DEALERSHIP.  ONCE AT THE DEALERSHIP I WAS INFORMED THAT AN ADDITIONAL WIRE HARNESS WOULD NEED INSTALLED AND REPAIRS WOULD BE COMPLETED WITHIN ONE DAY.  JUST PRIOR TO LEAVING THE DEALERSHIP I WAS INFORMED THAT KIA WAS INSTRUCTING THE DEALERSHIP IT WOULD BE NECESSARY FOR THE ENTIRE ENGINE BE REPLACED.  AT THE TIME OF THE INCIDENT THE VEHICLE ON HAD 5800 MILES ON THE ODOMETER.  I HAVE BEEN WAITING IN EXCESS OF TWO MONTHS FOR THE VEHICLE.  DEALERSHIP CAN GET NO FURTHER INFORMATION FROM KIA AS TO WHEN THE ENGINE WILL BE DELIVERED.  I HAVE CONTACTED KIA 3 TIMES AND SPOKE WITH REPRESENTATIVES THAT ARE UNABLE TO PROVIDE INFORMATION ON ENGINE DELIVERY.  I WAS TOLD ON LAST CALL THAT A ELEVATED CASE MANAGER WAS ASSIGNED AND WAS GIVEN HIS DIRECT LINE.  ON 3/5/2018 I ATTEMPTED TO CONTACT THE CASE MANAGER AND LEFT I MESSAGE ON VOICEMAIL.  I HAVE NOT BEEN RE-CONTACTED AS OF THIS WRITING.  I AM ALSO STILL MAKING THE LEASE PAYMENT ON THE VEHICLE AND OBVIOUSLY INSURING THE VEHICLE.",
        "vin": "KNDPMCAC9H7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/27/2019",
        "dateOfIncident": "09/20/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182886,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DATE I GAVE WAS ONE OF MANY.  IT HAPPENS A LOT. WHEN DRIVING MY ENGINE REVS WAY UP HIGH. LIKE YOU ARE PUSHING THE ACCELERATOR TO THE FLOOR. AND I AM DRIVING NORMAL. I TOOK THE CAR TO THE SERVICE DEPARTMENT. THEY SAID THERE WAS NOTHING THEY COULD DO. BECAUSE THEY COULDN'T GET IT TO REV UP FOR THEM. IT IS VERY SCARY. I REALLY DON'T FEEL SAFE DRIVING THE VEHICLE. THIS HAPPENS A LOT. THERE HAS TO BE SOMETHING THAT IS CAUSING THIS. IT CAN HAPPEN AT ANYTIME YOU CAN BE DRIVING NORMAL SPEED, YOU CAN BE SLOWING DOWN, YOU CAN JUST BE TAKING OFF FROM A STOP. WHENEVER IT WANTS TO REV UP..    BL",
        "vin": "KNDPN3AC4H7"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "02/23/2019",
        "dateOfIncident": "01/22/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182172,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAND NEW 2017 KIA SPORAGE EX VEHICLE STOPPED WITHOUT ANY WARNING WHILE I WAS DRIVING IN THE MIDDLE LANE OF A BUSY STREET  AND ALMOST GOT ME KILLED.  THERE WAS AN ACCIDENT TRYING TO AVOID HITTING ME BECAUSE OF THE VEHICLE STOPPING. I  WAS TERRIFIED. THE POLICE CAME AND THE VEHICLE WAS TOWED.",
        "vin": "KNDPN3AC0H7"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/17/2019",
        "dateOfIncident": "12/23/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180630,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD MOTOR REPLACED ON 2017 KIA SPORTAGE WITH 65K ON IT.  NEW MOTOR LASTED TO ABOUT 67K ON IT. BEEN WAITING ALMOST 2 MONTHS FOR ENGINE REPLACEMENT.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/14/2019",
        "dateOfIncident": "02/13/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180023,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE SECOND TIME THE CAR HAS CUT OFF IN THE LAST 2-3 MONTHS. THE FIRST TIME I WAS IN TRAFFIC WAITING FOR A TRAFFIC LIGHT,  THE CAR WAS IN DRIVE, IT STARTED TO ROUGH IDLE AND THEN IT CUT OFF,  IT TOOK A COUPLE OF TRIES TO RESTART THE CAR, I TOOK IT TO THE DEALERSHIP THE NEXT DAY AND WAS TOLD IT WAS DUE TO DIRTY FUEL INJECTORS AND WAS CHARGED FOR FUEL INJECTOR CLEANING.  YESTERDAY 2/13/19.  I WAS SITTING IN A PARKING LOT, THE CAR WAS IN PARK AND RUNNING, WHEN I  TURNED THE HEAT ON, THE CAR ROUGH IDLED AND CUT OFF. I  WAITED ABOUT 20 SECONDS THEN WAS ABLE TO RESTART THE CAR. I DROVE HOME AT NIGHT WITHOUT TURNINNG ON THE HEAT FOR FEAR OF THE CAR CUTTING OFF.",
        "vin": "KNDPM3ACAH7"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/04/2019",
        "dateOfIncident": "01/24/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173931,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERAL TIMES WHILE DRIVING, NO MATTER IF I'M IN ECO MODE OR SPORTS MODE, MY RPMS SPIKE, AND MY ENGINE SOUNDS AS THOUGH I HIT THE ACCELERATOR VERY HARD. THIS TYPICALLY HAPPENS WHENEVER I'M STOPPED AT A RED LIGHT OR STOP SIGN AND AND LIGHTLY HIT THE ACCELERATOR TO BEGIN MOVING AGAIN. I TOOK MY CAR IN (BECAUSE I RECEIVED A RECALL LETTER FOR THIS VERY ISSUE) AND THE KIA SERVICE DEPARTMENT ESSENTIALLY SAID THERE WAS NOTHING THEY COULD DO, AND WHEN THEY TOOK MY CAR OUT TO RE-CREATE THE ISSUE, NOTHING HAPPENED. I'VE BEEN PROVIDED WITH A CASE NUMBER, BUT THEY TOLD ME THAT NO ACTION WAS TAKEN. MY RPMS CONTINUE TO OCCASIONALLY SPIKE, AND IT'S VERY CONCERNING THAT KIA IS UNABLE TO RESOLVE THIS PROBLEM.",
        "vin": "KNDPN3AC4H7"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/29/2019",
        "dateOfIncident": "01/29/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11172726,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ON THE HIGHWAY- DRIVING UNDER A UNDERPASS. THE SCREEN TO THE PANORAMIC ROOF WAS BACK BUT THE SUNROOF ITSELF WAS CLOSED- THERE WAS A LOUD NOISE AND THE GLASS TO THE MOVING PART OF THE SUNROOF SHATTERED FALLING INTO THE CAR. ALL THAT REMAINED WAS A SMALL GLASS OUTLINE AROUND THE PERIMETER OF THE ROOF.",
        "vin": "KNDPN3AC1H7"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/28/2019",
        "dateOfIncident": "07/13/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11172551,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HIGHLIGHTS TO BRIGHT, CAN NOT DRIVE AT NIGHT WITHOUT GETTING HIGH BEAM BY MOST CARS THAT PASS",
        "vin": "KNDPRCA68H7"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "01/20/2019",
        "dateOfIncident": "12/26/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171105,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERSTATE, WEATHER AFFECTED COLLISION WITH CABLE BARRIERS AT 70MPH. AIRBAGS DID NOT DEPLOY EVEN THOUGH AN IMPACT SENSOR WAS DEFINITELY HIT. I AM LOOKING TO TAKE THIS CASE TO KIA AS WELL.",
        "vin": "KNDPMCAC1H7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/18/2019",
        "dateOfIncident": "02/28/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170873,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A PRODUCT IMPROVEMENT CAMPAIGN LETTER FROM KIA MOTORS OF AMERICA INCORPORATED DATED DECEMBER 2ND 2018 THEY SAID THEY WOULD LIKE TO PERFORM A SOFTWARE UPDATE TO THE ECU IN MY VEHICLE IT ALSO STATES KIA IS PROVIDING LIFETIME WARRANTY COVERAGE TO BOTH NEW AND USED VEHICLE OWNERS FOR ENGINE LONG BLOCK ASSEMBLY REPAIRS NEEDED DUE TO EXCESSIVE CONNECTING ROD BEARING DAMAGE UPON COMPLETION OF THIS PRODUCT IMPROVEMENT CAMPAIGN I DID TAKE THE CAR IN FOR THE ECU SENSOR UPDATE AND ASK THEM EXACTLY WHAT DOES THAT MEAN AND THEY SAID THE ECU SENSOR WILL INDICATE TO THE DRIVER THAT THE ENGINE IS EXPERIENCING DAMAGE OR PROBLEMS AND TO BRING IT IN. IF IT FALLS UNDER THE GUIDELINES OF THE ENGINE COVERAGE THEY WILL TAKE CARE OF IT. IN THE MEANTIME I AM DRIVING AROUND IN A DEFECTIVE VEHICLE WHERE DAMAGE IS OCCURRING AS I'M DRIVING IT AND IT WILL WORSEN TO THE POINT THAT THE ECU SENSOR WILL NOTIFY ME WHEN THE DAMAGE IS SO BAD THAT IT NEEDS TO BE BROUGHT IN I AM AFRAID FOR MY SAFETY AND THE SAFETY OF MY PASSENGERS WILL THIS DAMAGE OCCUR IN 1 MONTH 1 YEAR 5 YEARS OR IS IT OCCURRING EACH AND EVERY TIME I CRANK IT UP. WHAT SPECIFIC DAMAGE IS OCCURRING TO THE ENGINE BECAUSE THE ENGINE HAS MANY COMPONENTS THIS INFORMATION I DO NOT KNOW WILL IT CATCH ON FIRE WILL IT STALL IN THE MIDDLE OF TRAFFIC WILL IT LEAVE ME STRANDED SOMEWHERE IF THE ISSUE CAN BE REPAIRED OR REPLACED WHY NOT MAKE ME THAT OFFER TO REPAIR THE ENGINE NOW REPLACE THE ENGINE NOW OR REPLACE THE VEHICLE IS THIS VEHICLE SAFE TO BE ON THE ROAD BASED ON THE CONCERNS KIA HAVE ABOUT THE LONG ENGINE BLOCK ASSEMBLY AND THE CONNECTING RODS I AM A LAY PERSON WITH NO MECHANICAL EXPERTISE BUT WHAT I'M HEARING IS THAT THIS CAR HAS AN EXISTING PROBLEM THAT COULD BE HAZARDOUS I HAVE NOT ON THIS VEHICLE A FULL YEAR YET AN ENGINE PROBLEMS IS NOT SOMETHING A CONSUMER WANTS TO HEAR ABOUT THANK YOU  *TR",
        "vin": "KNDPM3AC6H7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/17/2019",
        "dateOfIncident": "07/27/2018",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170666,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "EL VEHCULO KIA SPORTAGE 2017 SE INCENDI DE UN MOMENTO A OTRO, ESTABA PARADO ENCENDIDO EL MOTOR Y EMPEZ A SALIR HUMO DEL MOTOR Y SE INCENDI MUY RPIDO , EN MENOS DE 3 MINUTOS . SUCEDI EN CALI , COLOMBIA,",
        "vin": "KNAPM81ABH7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/17/2018",
        "dateOfIncident": "11/10/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162133,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY KIA SPORTAGE ENGINE LIGHT CAME ON AND THE ENGINE STARTED MAKING A KNOCKING NOISE WHILE DRIVING DOWN ROAD ON A SATURDAY NIGHT . (DEALERAHIP WAS CLOSED) FIRST THING MONDAY MORNING CALLED KIA DEALER. TOOK INTO DEALER . AFTER THEY CHECKED IT OUT THEY INFORMED MY ENGINE WAS RUINED . HAD METAL SHAVINGS IN IT . AND BECAUSE I DIDNT TAKE IT INTO THEM OR A PROFESSIONAL TO CHANGE THE OIL(I HAD FAMILY DO IT) MY WARRENTY NO LONGER WILL COVER IT. FOUGHT THIS FOR WEEKS WITH CONSUMER AFFAIRS.. AND GOT NOWHERE . DID SOME RESEARCH AND THE EXACT SAME THING WAS RECALLED IN THE 2015 KIA SPORTAGE .. JUST SEEMS IRONIC THE SAME THING HAPPEND TO MY 2017 SPORTAGE.",
        "vin": "KNDPM3AC2H7"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/29/2018",
        "dateOfIncident": "11/29/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154737,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHOUT WARNING THE CAR DROPS OUT OF GEAR, THE ENGINE REVS. YOU HAVE TO TAKE YOUR FOOT OFF THE GAS FOR THE CAR TO GO BACK INTO DRIVE AND YOU CAN CONTINUE DRIVEING. THIS HAPPENS AT ANY SPEED.",
        "vin": "KNDPNCAC4H7"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/29/2018",
        "dateOfIncident": "10/29/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11143609,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL LINE SEEMS TO BE CLOGGED?  WHEN I STEP ON THE GAS SOMETIMES THE CAR DOESN'T GO BUT THE RMP'S REV UP.  SEEMS LIKE IT WANTS TO STALL OR JUST NO GO. THIS HAPPENS EVEN WHILE JUST DRIVING DOWN THE STREET AND THEN GIVING THE CAR GAS TO SPEED UP; NOT JUST AT STOP AND GO;",
        "vin": "KNDPM3AC4H7"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/26/2018",
        "dateOfIncident": "10/17/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142869,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALING WITH OIL LOSS SINCE LAST YEAR, SINGLE OWNER NEW VEHICLE. FIRST TIME NO OIL TOWED TO FAYETTEVILLE NC KIA WHERE THEY SAID NOTHING WAS COVERED UNDER WARRANTY BECAUSE I HAD THE OIL CHANGED SOMEWHERE ELSE. I PAID FOR TOW AND REPAIR WHICH BASICALLY INVOLVED ADDING OIL JUMPING BATTERY IN MORNING. THEY SHOULD HAVE KNOWN ABOUT A PART RECALL ON THE OIL PAN PER THE KIA FEMALE REPAIR REP AT PINEHURST KIA IN SOUTHERN PINES NC WHERE I HAD IT TOWED TO WHEN BATTERY DIED A COUPLE OF DAYS LATER. AGAIN THEY FOUND NO OIL BUT OIL SPLATTERED UNDERNEATH IN ENGINE AND SPOKE WITH KIA NATIONAL CONSUMER IN CA AT THAT TIME. THEY CONFIRMED THE ISSUE, AND CHANGED OIL AND CALLED FOR PART. RETURNED 2 WEEKS LATER JUST TO HAVE OIL CHECKED AND AGAIN NO OIL. XALLED KIA NATIONAL AGAIN. WAS TOLD TO SELF MANAGE FOR REIMBURSEMENT FROM FAYETTEVILLE NC KIA MANAGER BY DEALING WITH HIM MYSELF. 2 MONTHS OF FAILED CONTACT ATTEMPTS ENSUED.     LAST WEEK ON WAY BACK FROM UNC CHILDREN'S ONCOLOGY WITH SON, BRAKES AND STEERING LOCKED UP AGAIN. CLOSE TO ACCIDENT. TOEED TO RONALD MACDONALD HOUSE 0.7 MI AWAY, AGAIN NO OIL. PUT OIL IN. ALSO SMOKE AND SMELL OF BURNING ELECTRICAL SOMETHING FRKM ENGINE FOR SOME TIME. NEXT MORNING PAID TO TOW TO UNIVERSITY KIA CHAPEL HILL. FOUND OUT MY CASE # HAD BEEN ERRONEOUSLY CLOSED. NOW DEALING WITH CASE MANAGER TAMMY WHO I HAVENT BEEN ABLE TO CONTACT. CASE NUMBER NOW IS 12908741. A NEW CAR OBVIOUSLY ACTS THIS WAY WHEN THERE IS A BIG ISSUE AND NOBODY AT KIA WOULD HELP ME. NOW I SIT AT MY SONS BEDSIDE WITH A DEAD 2017 KIA SPORTAGE AT UNIVERSITY KIA WHERE BRANDON IS TRYING TO PUT TOGETHER ALL PAST RECEIPTS. MY SON WAS DX'D LAST MONTH AND NO I DO NOT KNOW WHERE EACH RECEIPT IS, I HAVE BEEN AT THE HOSPITAL MORE THAN AT HOME. I HAVE HAD TO APPLY FOR FMLA FROM MY JOB AS WELL. I EXPECT AN HAVE READ OF MANY ISSUES WITH KIA AND THIS OIL ISSUE AS WELL AS PAST RECALLS. RENTED CAR 10 23 18",
        "vin": "KNDPM3AC547"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/02/2018",
        "dateOfIncident": "09/01/2018",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11124013,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SAT MORNING MY SUV CAUGHT FIRE WITHOUT WARNING. THIS OCCURRED IN INDIANAPOLIS ON HARDING ST. NEAR THE INTERSTATE EXIT. WE WERE AT A COMPLETE STOP WHEN SMOKE STARTED COMING OUT OF THE CAR THEN FLAMES. I GOT MY KIDS AND DOGS OUT. THEN I REALIZED OUR MEDICATIONS WERE IN THERE. I THEN WENT BACK TO TRY TO GRAB THE BAG. I COULDN'T BECAUSE OF HOW FAST IT WENT UP. IN THE PROCESS I ENDED WITH TWO SMALL BURNS AND A SLIGHT ABRASION. THERE WAS NO WARNING. THE SUV HAS BEEN MAINTENANCE AND GIVEN ALL REQUIRED MAINTENANCE. IN FACT IN JUNE IT WAS TAKEN IN FOR AN OIL CHANGE.AND 15000 MILE MAINTENANCE. CURRENTLY IT SUSPECTED THAT THIS WAS ELECTRIC FIRE. I ALSO HAVE A VIDEO OF SOMEONE THAT WAS PASSING BY. THE SUV WAS TOWED BY THE INDIANAPOLIS POLICE DEPARTMENT TO THEIR LOT WERE IT IS CURRENTLY.",
        "vin": "KNDPMCAC5H7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/24/2018",
        "dateOfIncident": "07/15/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122126,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SPORTAGE ACCELERATES RANDOMLY AND OFTEN WHILE DRIVING OR STOPPED AT A STOP LIGHT I'VE TAKEN IT TO KIA AND THE CONTACTED THE KIA NORTH AMERICA A CASE WAS FILED THEY WON'T SEEM TO CARE IF ITS FIXED BC THEY CAN'T DUPLICATE THE ISSUE",
        "vin": "KNDPM3AC3H7"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/22/2018",
        "dateOfIncident": "07/15/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11121651,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 KIA SPORTAGE. THE CONTACT CALLED ON BEHALF OF THE DRIVER. WHILE THE DRIVER WAS AT A STOP LIGHT, THE VEHICLE WAS T-BONED IN THE MIDDLE OF THE DRIVER SIDE DOOR. THE AIR BAGS FAILED TO DEPLOY. THE DRIVER SUSTAINED BACK AND NECK INJURIES THAT REQUIRED MEDICAL ATTENTION. THE CONTACT WAS NOT AWARE OF THE OTHER DRIVER'S INJURIES. A POLICE REPORT WAS FILED. THE VEHICLE WAS DRIVEN TO THE DRIVER'S RESIDENCE. THE VEHICLE WAS NOT TAKEN TO A DEALER OR AN INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND DID NOT ASSIST. THE APPROXIMATE FAILURE MILEAGE WAS 17,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "08/18/2018",
        "dateOfIncident": "08/14/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120776,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE LAST 2-3 MONTHS MY CAR HAS BEEN RANDOMLY ACCELERATING ON ITS OWN, DUE TO THIS I WAS RECENTLY (AUG 14, 2018) IN AN AT FAULT ACCIDENT. I HAVE CALLED MY DEALERSHIP MULTIPLE TIMES INQUIRING IF THERE HAVE BEEN ANY RECALLS AND THERE HAVEN'T BEEN. I AM CURRENTLY IN THE SERVICE DEPARTMENT (AUG 18, 2018) HAVING THE PROBLEM LOOKED AT BUT HAVE BEEN TOLD THEY MIGHT NOT BE ABLE TO PIN POINT THE ISSUE.",
        "vin": "KNDPM3AC4H7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/08/2018",
        "dateOfIncident": "08/08/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118611,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICE ENGINE LITE ON DASH LIT UP. I ONLY HAVE 6641 MILES ON THIS VEHICLE.  I AM PLANNING TO TAKE MY KIA TO MY DEALER TO HAVE THIS ITEM CHECKED OUT ON 9 AUG 18. I WAS DRIVING VEHICLE AT THE TIME.  I WAS DRIVING VEHICLE AT THE TIME ON CITU STREET.",
        "vin": "KNDPMCAC4H7"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/13/2018",
        "dateOfIncident": "06/23/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11111138,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HIT A SMALL DEER AT 73MPH TOTALED MY KIA HEAVY FRONT END DAMAGE HOOD CAME UP AND BUSTED MY WINDSHIELD WHICH CAUSED GLASS TO GET IN MY EYES.  NOT ONE AIR BAG DEPLOYED. IT KNOCKED THE BATTERY OUT AND BUSTER THE RADIATOR, HADN'T MADE MY FIRST PAYMENT YET.",
        "vin": ""
    },
    {
        "components": "AIR BAGS,STRUCTURE,ENGINE",
        "crash": true,
        "dateComplaintFiled": "07/09/2018",
        "dateOfIncident": "06/29/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11110355,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INVOLVED IN A HEAD ON COLLISION, RESULTING IN MY SUV BEING TOTALED. I WAS STATIONARY IN THE DOUBLE TURNING LANE OF A CITY STREET. THE ENGINE BLOCK WAS PUSHED NEARLY INTO THE DRIVER'S SEAT. FRONT WINDSHIELD CRACKED FROM END TO END, HEAVY FRONT END DAMAGE. THE VEHICLE THAT HIT ME WAS DOING ABOUT 45-50MPH AND HER AIRBAGS DID DEPLOY ALTHOUGH SHE HAD SIDE IMPACT/DAMAGE. MY AIRBAGS NEVER DEPLOYED. I HAVE A CONCUSSION RESULTING IN MEMORY LOSS AND PAINFUL SWELLING BEHIND MY EYE. I AM ALSO BEING TREATED FOR MULTIPLE BACK INJURIES. MY 17M OLD WAS IN THE VEHICLE AS WELL BUT WAS IN HIS REAR FACING CAR SEAT, NOT YET SHOWING ANY SIGNS OF INJURY.",
        "vin": "KNDPM3AC5H7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/28/2018",
        "dateOfIncident": "06/07/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104496,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2017 KIA SPORTAGE SX TURBO    MY CAR HAS NOT RUN RIGHT EVER SINCE I LEASED IT. THERE WERE TIMES WHERE IT SEEMED LIKE THE CAR WASN'T GOING TO START, CRANKING, BUT NOT TURNING OVER. THERE ARE TIMES WHEN I HEAR A LOUD CLICKING NOISE WHEN I ACCELERATE, WHICH SOUNDS LIKE SOMETHING UNDER THE HOOD OF MY CAR IS ABOUT TO BREAK. AND THEN I STARTED HAVING ISSUES WITH MY SPARK PLUGS.    THE SPARK PLUG ON CYLINDER 3 HAS BURNT OUT AND CAUSED MISFIRES IN MY ENGINE 3 TIMES NOW, STARTING AS SOON AS 9,000 MILES. BEFORE, THE DEALERSHIP I WENT TO BLAMED IT ON POOR GASOLINE OR TOO MUCH OIL IN MY VEHICLE AND NEVER FIXED THE ISSUE AFTER BEING AT THE DEALERSHIP 3 DIFFERENT TIMES BECAUSE OF THE MISFIRING I WAS EXPERIENCING. THE FIRST TIME I WENT TO SUMMIT PLACE KIA, THEY PUT ME BACK INTO A FAULTY VEHICLE WITHOUT FIXING ANYTHING. MY CAR THEN FAILED WHILE DRIVING ON THE FREEWAY, MISFIRING AND NOT PROPERLY ACCELERATING. LUCKILY, I WAS ABLE TO GET OFF THE FREEWAY SAFELY AND TOWED TO ANOTHER DEALERSHIP THAT REPLACED THE SPARK PLUGS. MY CAR STARTED MISFIRING AGAIN, AND SUMMIT PLACE KIA REPLACED THE CYLINDER 3 SPARK PLUG AND BLAMED THE ISSUE ON \"TOO MUCH OIL.\"  NOW MY CAR IS AT THE DEALERSHIP FOR THE FOURTH TIME AFTER FAILING AGAIN WHILE DRIVING, SEVERELY MISFIRING, CAUSING THE CAR NOT TO ACCELERATE PROPERLY OR DRIVE WELL AT ALL WHILE DRIVING IT. KIA MOTORS, INC. AND FELDMAN KIA IN NOVI HAVE DECIDED TO REPLACE THE SHORT BLOCK OF MY ENGINE, STILL NOT KNOWING EXACTLY WHAT IS GOING ON OR CAUSING THE 3RD CYLINDER SPARK PLUG TO BURN OUT. I AM NOT CONFIDENT THAT SIMPLY REPLACING THE SHORT BLOCK WILL FIX THIS, UNLESS THEY KNOW SOMETHING THAT IS NOT BEING DISCLOSED TO ME. I FEEL THAT THERE IS SOMETHING INHERENTLY WRONG WITH THE DESIGN OF THE ENGINE OF THIS CAR, AND THIS PROBLEM WILL AFFECT THOUSANDS OF OTHERS WHO HAVE PURCHASED THIS VEHICLE.",
        "vin": "KNDPRCA67H7"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/13/2018",
        "dateOfIncident": "05/23/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101573,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER SEVERAL COMPLAINTS OF ROUGH IDLE, BURNT OIL AND DRIVE-ABILITY ISSUES STARTING AT 7128 MILES, 16066 MILES, 21000 MILES,22711 MILES & 29356 MILES,  THE ENGINE WAS REQUIRED REPLACEMENT.  AFTER THE ENGINE WAS REPLACED (SHORT BLOCK WE WERE TOLD),  THE BRAKE ASSIST SYSTEM (BAS) & THE FORWARD & REAR COLLISION WARNING SYSTEM ARE INTERMITTENT IN THEIR OPERATION.  RANDOMLY WHEN SITTING STILL THE SENSORS WILL ALERT  OR WHEN CROSS TRAFFIC (FRONT OR REAR) THE SENSORS FAIL TO DETECT.  THIS WAS A DEFINITE CHANGE OF BEHAVIOR SINCE THE ENGINE WAS REPLACED.  THE LOCAL DEALER SAID THEY CHECKED IT AND AFTER A FEW MILES OF DRIVING DECLARED IT TO BE WORKING PROPERLY.  THIS RANDOM BEHAVIOR OCCURS SEVERAL TIMES A DAY..  ATTACHED IS A CAR FAX REPORT OF OUR VEHICLE REFLECTING THE PROBLEMS.",
        "vin": "KNDPR3A68H7"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/04/2018",
        "dateOfIncident": "03/09/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099600,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 KIA SPORTAGE. WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE DECELERATED ON ITS OWN. ALSO, WHILE AT A STOP, THE VEHICLE VIBRATED AND MADE A TAPPING NOISE WHEN THE ENGINE WAS TURNED OFF. THERE WAS NO WARNING INDICATOR ILLUMINATED. THE FAILURES RECURRED SEVERAL TIMES. THE VEHICLE WAS TAKEN TO COVINA VALLEY KIA (626 S CITRUS AVE, COVINA, CA 91723, 626-736-4275) WHERE THE TECHNICIAN STATED THAT THE VEHICLE WAS OPERATING AS DESIGNED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT NOTHING COULD BE DONE SINCE THE DEALER WAS UNABLE TO DIAGNOSE ANY FAILURES. THE CONTACT WAS PROVIDED A CASE NUMBER. THE FAILURE MILEAGE WAS APPROXIMATELY 4,645.",
        "vin": "KNDPM3AC3H7"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/22/2018",
        "dateOfIncident": "05/15/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097301,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 KIA SPORTAGE. WHILE DRIVING 55 MPH AND MAKING A RIGHT TURN, THE STEERING WHEEL SEIZED AND THE VEHICLE TRAVELED TO THE LEFT INSTEAD. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER (KIA OF DULUTH, 1701 W MICHIGAN ST, DULUTH, MN 55806, (866) 722-4542), BUT THE FAILURE COULD NOT BE DUPLICATED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED AND REFERRED THE CONTACT TO THE LOCAL DEALER AND NHTSA. THE FAILURE MILEAGE WAS 16,000. *TT",
        "vin": "KNDPMCAC6H7"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/14/2018",
        "dateOfIncident": "05/10/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093748,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN STARTING TO ACCELERATE FROM THE VEHICLE WILL START TO MOVE AND THEN THE ENGINE RPMS WILL DROP TO IDLE. AT THAT TIME THE CAR WILL NOT RESPOND TO THE THROTTLE. IT SEEMS TO TAKE FROM THREE TO FIVE SECONDS BEFORE THE ENGINE WILL RESPOND TO THE ACCELERATOR BEING PUSHED. THIS SEEMS IT COULD HAPPEN IN ANY LOCATION USUALLY FROM A STOP POSITION. IT HAPPENED SEVERAL TIME BACKING UP MY DRIVEWAY BUT ALSO ON A CITY STREET WHEN I WAS STARTING TO MAKE A LEFT TURN.   VERY DANGEROUS SITUATION.",
        "vin": "KNDPMCAC8H7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/08/2018",
        "dateOfIncident": "04/25/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092481,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IN MOTION ON CITY STREETS OR HIGHWAY.  GAS PEDAL DOES NOT RESPOND WHEN ATTEMPTING TO ACCELERATE, CAR DECELERATES, TACHOMETER GOES DOWN TO ZERO.  IN ORDER TO ACCELERATE YOU MUST REMOVE YOUR FOOT FROM GAS PEDAL, THEN REATTEMPT TO ACCELERATE.  THIS HAS HAPPENED ON STRAIGHT ROADS, HIGHWAYS, AND WHILE TURNING AT A VARIETY OF SPEEDS IE: FROM 15-70 MPH. I CANNOT PREDICT NOR CAUSE THIS TO HAPPEN. SOMETIMES I DRIVE FOR WEEKS BEFORE IT HAPPENS, THEN IT CAN HAPPEN MULTIPLE TIMES IN THE SAME DAY, SAME DRIVE. THE LAST TIME IT HAPPENED 5 TIMES IN ONE HOUR. I'M CONCERNED THAT I MIGHT GET REAR ENDED BY SOMEONE NOT NOTICING THAT I'M DECELERATING WITHOUT BRAKING. NO ERROR CODES APPEAR. KIA SERVICE CANNOT FIGURE OUT THE PROBLEM. I HAVE A LITTLE OVER A YEAR LEFT ON MY LEASE AND JUST UNDER 21,000 MILES. THIS HAS BEEN OCCURRING FOR OVER A YEAR. KIA SERVICE BEING VERY PATRONIZING ABOUT THE PROBLEM!",
        "vin": "KNDPNCAC8H7"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/24/2018",
        "dateOfIncident": "04/24/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089965,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WAS RUNNING THEN LOST POWER WHILE DRIVING UP A HILL ON A STREET. IT WOULD NOT ACCELERATE, THEN SHUT OFF. IT WOULD RESTART, IDLE FOR 10 SECONDS AND DIE.I TOOK TO THE DEALERSHIP. IT ONLY HAD 20000 MILES.",
        "vin": "KNDPMCAC2H7"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/25/2018",
        "dateOfIncident": "02/21/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11074870,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING APPROX. 60 MPH ON A FREEWAY, WE HEARD A LOAD \"BANG\" NOISE FROM THE ROOF ABOVE US. WE HAD NOT SEEN ANY PROJECTILE FLYING TOWARDS US PRIOR TO THE NOISE. WE FOUND OUT WHEN WE STOPPED TO LOOK THAT THE TINTED GLASS PIECE THAT STRETCHES ACROSS THE WIDTH OF THE CAR AND IS LOCATED IN FRONT OF THE SUNROOF, HAD SHATTERED ALL THE WAY ACROSS THE CAR FROM ONE SIDE TO THE OTHER. IT LOOKS LIKE A JAGGED CREVICE AFTER AN EARTHQUAKE.",
        "vin": "KNDPNCAC4H7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/16/2018",
        "dateOfIncident": "10/21/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073284,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A USED 2017 KIA FOR MY DAUGHTER WITH 30 THOUSAND MILES WHEN WE RECIEVED THE KEYS NETHIER ONE WILL OPEN YOU HAVE T MANUALLY OPEN BOTH OF THEM THIS IS A SAFTY HAZARD FOR MY DAUGHTERIF SHE WAS IN A SITUTATION WHERE SHE HAD TO GET N HER CAR N A HURRY SHE WOULDNT BE ABLE TOO IS THIS A DEFECT ?",
        "vin": "KNDPM3AC3H7"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/25/2018",
        "dateOfIncident": "01/24/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064822,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "NEWER MODEL KIA SPORTAGE VEHICLES HAVE LOW MOUNTED TURN SIGNALS THAT ARE SEPERATE FROM THE REST OF THE BRAKE LIGHT ASSEMBLY. THIS PRESENTS TWO ISSUES:   1: THE LOW MOUNT MAKES IT HARDER TO SEE IN GENERAL  2: THE SEPARATION MAKES THE TURN SIGNAL NOT AS APPARENT WHEN THE SIGNAL IS USE.     I BELIEVE THAT THESE VEHICLES ARE A HAZARD ON THE ROAD DUE TO THE DESIGN OF THE TURN SIGNAL.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/09/2018",
        "dateOfIncident": "01/05/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11061515,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS SERVICE ENGINE LIGHT ON, WHEN TO DEALER TUESDAY AND THEY SCHEDULE ME AN APPOINTMENT A WEEK LATER ON TUESDAY, BUT MY CAR BREAKDOWN ON  FRIDAY NIGHT ON HIGHWAY, RADIATOR OVERHEAT AND START LEAKING, DAMAGE SOME OTHER PARTS AND NOW DEALER DOESN'T WANT TO FIX MY CAR AND WANT ME TO PAY $2800.00.  MY CAR WAS ON MOTION ON THE HIGHWAY DRIVING 60 TO 70MILE PER HOUR.   KIA HAS A RECALL FOR SAME PROBLEM I HAD ON KIA SORENTO  2017.",
        "vin": "KNDPM3ACH71"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/01/2018",
        "dateOfIncident": "12/28/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057847,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH ONLY 6762 MILES ON THE ODOMETER, GOING 79-80 MPH ON CRUISE CONTROL, THE FOLLOWING HAPPENED ALL AT ONCE WITHOUT WARNING:     (1) LOUD THUNK UNDER THE HOOD  (2) ENGINE STOPPED  (3) ELECTRICAL SYSTEM SHUT DOWN, INCLUDING AUDIO, DASHBOARD, AND HEADLIGHTS  (4) RAPID DECELERATION, AS IF I HAD SLAMMED ON THE BRAKES (THOUGH I HAD NOT).   (5) APPROACHING THE SHOULDER, I NOTICED THAT THE POWER STEERING AND POWER BRAKES WERE ALSO INACTIVE.     AFTER PUTTING IN PARK, IT MIRACULOUSLY STARTED RIGHT BACK UP AND GOT ME HOME. BUT THIS IS UNACCEPTABLE, AND A VERY SERIOUS SAFETY ISSUE, BECAUSE THE NEXT TIME IT HAPPENS, IT'LL BE DURING RUSH HOUR AND THEN I'LL GET REAR-ENDED BY THE UBIQUITOUS TAILGATER, GOING 70 MPH. EVEN IF THE BRAKE LIGHTS WORK WHEN I GET A CHANCE TO APPLY THEM, THERE WOULD STILL BE A DELAY OF A SECOND OR TWO DURING WHICH THE VEHICLE WOULD BE RAPIDLY DECELERATING ON ITS OWN, WITHOUT BRAKE LIGHTS. NOT TO MENTION THE UNDOUBTEDLY ACCELERATED WEAR AND TEAR ON INTERNAL PARTS.",
        "vin": "KNDPMCAC8H7"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/28/2017",
        "dateOfIncident": "11/16/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057245,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON NOVEMBER 16, 2017 I PICKED UP MY DAUGHTER FROM SCHOOL, SHE ASKED ME TO TURN ON THE HEATER THAT SHE WAS COLD, WHEN I TURNED ON THE HEATER, WITHIN A MINUTE THE WHOLE CAP OF MY KIA SPORTAGE WAS ENGULFED IN A TERRIBLE GAS ODOR, WHICH BOTH MY DAUGHTER AND I BECAME DIZZY AND NAUSEA. I IMMEDIATELY OPENED ALL THE WINDOWS AND DROVE A SHORT WAY TO MY PARENTS HOUSE. I DROVE MY SPORTAGE STAIGHT INTO THE DEALERSHIP WITH MY MOM AND DAUGHTER FOLLOWING ME IN HER CAR. I DROPPED THE CAR OFF AT THE DEALERSHIP. THE NEXT DAY SAVAGE KIA CALLED ME AND STATED I SHOULD PICK UP A LOANER THAT THEY WOULD HAVE MY CAR FOR APPROXIMATELY A WEEK. WHEN MY DAD AND I WENT TO THE DEALERSHIP TO PICK UP THE LOANER, WE ASKED WHAT WAS THE ISSUE WITH MY SPORTAGE, THE SERVICE MANAGER STATED THAT THEY CONTACTED KIA ASSISTANCE TO DIAGNOSE THE ISSUE, THAT GAS WAS SPURTING OUT FROM THE INJECTORS AND INTO MY ENGINE,THAT THE SUV HAD A DEFECTIVE ( FAULTY FUEL INJECTOR AND HOUSING IN IT) MY FATHER THEN STATED TO THE SERVICE MANAGER THAT THAT COULD OF KILLED MY SON AND GRANDDAUGHTER IF THE GAS WOULD OF SPARKED IN THE ENGINE AND ALSO STATED LUCKILY MY SON IS NOT A SMOKER OR THEY WOULD BOTH BE DEAD. THE SERVICE MANAGER DID NOT DENY THE ISSUE WAS A SERIOUS ISSYE. WHEN I CONTACTED KIA CORP TO FILE A COMPLAINT THEY WERE LIKE ROBOTS, LIKE THERE ONLY RESPONSABILITY IS TO FIX THE CAR, NOTHING HAPPENED SO IT'S ALL GOOD. I STATED TO THEM THAT I REALLY DO NOT WANT TO DRIVE THIS CAR AND ASKED THEM IF THEY COULD GIVE ME ANOTHER ONE. THEY STATED THIS IS NOT A OPTION. THE ONLY THING THEY COMPENSTATED ME WITH WAS ONE LEASE PAYMENT. COULD YOU PLEASE INFORM ME WHAT MY OPTIONS ARE. I JUST DO NOT FEEL COMFORTABLE DRIVING THIS VEHICLE AND I AM VERY UPSET THAT KIA DID NOT HAVE ANY COMPASSION TOWARDS THERE VEHICLE POTENTIALLY CAUSES GREAT HARM OR DEATH TO MY SEVEN YEAR OLD DAUGHTER. THANK YOU VERY MUCH FOR YOUR TIME.",
        "vin": "KNDPMCAC9H7"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/24/2017",
        "dateOfIncident": "12/23/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11056310,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE FAILURE OCCURS WHILE IN MOTION ON CITY STREETS - 2X IN ONE WEEK. TOWED BOTH TIMES. DEALER UNABLE TO DETECT PROBLEM, SAID TO JUST DRIVE IT AND CALL IF IT HAPPENS AGAIN. GAS SMELL WHEN THIS HAPPENS.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/14/2017",
        "dateOfIncident": "09/15/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054667,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AC BUILD UP OF WATER FROM AC UNIT OVER FLOWS AND LEAKS OVER THE GAS PEDAL, I ALL MOST LOST MY FOOTING WHEN DRIVING WATER ON PEDAL MADE MY FOOT SLIDE OFF THE GAS PEDAL. PLUS AFTER FIRST CHECK UP THE AC FILTER NEEDED TO BE REPLACE, NOT COVERED UNDER WARRANTY. I FEEL THIS CAN CAUSE A BIG ACCIDENT.",
        "vin": "KNDPM3AC8H7"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/11/2017",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045367,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SAFETY ISSUE: 2017 KIA SPORTAGE REAR TURN SIGNALS NOT INTEGRATED INTO THE BRAKE LIGHTS AND TOO LOW TO BE EASILY SEEN.    I'VE BEEN TOLD ON MULTIPLE OCCASIONS THAT MY REAR TURN SIGNALS ARE TOO SMALL (7 7/8\" WIDE X 1 3/4\" HIGH), TOO LOW (23\" FROM STREET LEVEL, ON THE REAR BUMPERS), AND TOO FAR AWAY FROM MY BRAKE LIGHTS (20\" FROM TURN SIGNALS ON BUMPERS TO BRAKE LIGHTS) TO BE SEEN BY CARS BEHIND ME, ESPECIALLY DURING DAYLIGHT HOURS.    WHAT MAKES THIS EVEN MORE UNSAFE IS THE SIGNALS WRAP AROUND THE BUMPER, SO THAT OF THE 7 7/8\" OF LAMP, ONLY 2 1/2\" SHOW IN THE REAR. THE REST OF THE SIGNAL LAMP AREA IS ON THE SIDE OF THE VEHICLE AND NOT VISIBLE TO CARS BEHIND ME. (PLEASE SEE UPLOADED PHOTOS.)    IF A DRIVER IS FOLLOWING TOO CLOSE OR IF I'M IN BUMPER-TO-BUMPER TRAFFIC, IT'S IMPOSSIBLE FOR A CAR BEHIND ME TO SEE ME SIGNAL. THIS MAKES IT DANGEROUS FOR ME TO CHANGE LANES, MERGE, OR MAKE TURNS.    AFTER BEING NOTIFIED BY MANY DRIVERS OF MY SMALL, OUT-OF-PLACE AND INCONSPICUOUS TURN SIGNALS, I TOOK THE CAR TO THE DEALER, THINKING THAT THE CIRCUIT TO THE BRAKE LIGHTS WAS FAULTY, SINCE THE BRAKE LIGHTS DON'T BLINK TO SIGNAL A TURN. THE DEALER CHECKED THE CAR AND STATED THAT THIS IS THE WAY THE CAR WAS DESIGNED: BRAKES LIGHTS DO NOT BLINK TO SIGNAL A TURN; THE ONLY REAR TURN SIGNALS ARE LOCATED ON THE REAR BUMPERS.    ODDLY, THIS DANGEROUS DESIGN FLAW SHOWS UP ONLY ON THE SPORTAGE. OTHER KIA MODELS HAVE TURN SIGNALS INCORPORATED INTO OR ADJACENT TO THE BRAKE LIGHTS. IT SHOULD BE A SIMPLE MATTER FOR KIA TO INCORPORATE THE TURN SIGNALS INTO THE BRAKE LIGHTS ON THE SPORTAGE, SINCE ALL THEIR OTHER MODELS ALREADY DO SO.    TO MY KNOWLEDGE THIS IS THE ONLY CAR IN THE UNITED STATES WITH TINY BUMPER-MOUNTED TURN SIGNALS AND NO SIGNALS IN THE BRAKE LIGHT AREA. HOPEFULLY, THIS DANGEROUS DESIGN IS SO RADICALLY OUT OF STEP WITH RECOGNIZED AUTO SAFETY STANDARDS AS TO MERIT A SAFETY RECALL.",
        "vin": "KNDPM3AC1H7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/11/2017",
        "dateOfIncident": "11/04/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045392,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "NOVEMBER 4TH 2017 MY PANORAMIC SUNROOF SHATTERED. WAS DRIVING ABOUT 35 - 40 MPH. MY INTERIOR SUN SHIELD WAS CLOSED AT THE TIME. THIS KEPT THE GLASS FROM ENTERING THE CAR. THE SOUND WAS LIKE A SHOTGUN. AND IT CLEARLY EXPLODED OUTWARD. KIA INVESTIGATED AND COULD NOT DETERMINE THE CAUSE. THEY ARE REPLACING AT THEIR COST. PAVEMENT WAS SMOOTH. MY CAR WAS WARM ON A COLD DAY. TEMP ABOUT 45 DEGREES.",
        "vin": "KNDPRCA6XH7"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/08/2017",
        "dateOfIncident": "11/08/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11044659,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD MY CAR FOR 30 DAYS & AFTER DRIVING FOR ABOUT 5 MILES THIS MORNING MY TIRE WARNING LIGHT SAID THE PSI WAS AT 19 FOR MY REAR DRIVER SIDE, SECONDS LATER IT WAS A 0.  I PULLED INTO A GAS STATION WHERE WE DISCOVERED A HUGE TEAR IN THE SIDE WALL OF MY TIRE.  THIS IS DEFINITELY A DEFECT AS I HAVE NOT BEEN IN AN ACCIDENT OR SCRAPPED ANY CURBS HOWEVER, ONCE I GOT IT TO THE DEALERSHIP THEY SAID THAT THIS HAD TO BE CAUSED BY ME POSSIBLY HITTING SOMETHING. I THINK I WOULD REMEMBER HITTING SOMETHING THAT WOULD CAUSE A SLICE ACROSS MY PASSENGER REAR TIRE. SO IN A NUTSHELL I WAS FORCED TO BUY A NEW TIRE $181.00 FOR A CAR I HAVE HAD FOR 30 DAYS. NEITHER GROSSINGER KIA DEALERSHIP OR HANKOOK TIRE WOULD TAKE RESPONSIBILITY. I WAS JUST ABOUT TO GET ON THE EXPRESSWAY AND THANK GOODNESS THE TIRE MALFUNCTIONED BEFORE I DID.",
        "vin": "KNDPM3AC1H7"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "10/25/2017",
        "dateOfIncident": "04/11/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11039649,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS PARKED OVERNIGHT KEYS WERE TAKEN AND CAR LOCKED AT 8PM AT 530 AM HEARD CRASH CAR ROLLED INTO TREE AND DOORS WERE STILL LOCKED CAR CAME OUT OF PARK AND ROLLED AFTER 9.5 HOURS OF SITTING CAR HAD TO BE IN PARK FOR KEY FOB TO LOCK DOORS AFTER IT ROLLED THE DOORS WERE LOCKED BUT GEAR WAS IN REVERSE",
        "vin": "KNDPNCAC2H7"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/23/2017",
        "dateOfIncident": "10/14/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11035763,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SUNROOF \"EXPLODED\" ON SATURDAY, OCT. 14, 2017.I WAS DRIVING ON A HIGHWAY AND THERE WAS SOME TRAFFIC. AFTER THE INITIAL \"BOOM\" AND RUSH OF WIND WE HEARD GLASS SHATTERING. THE SUNROOF AND SHADE WERE CLOSED, THANKFULLY! I PULLED OVER AND ATTEMPTED TO COLLECT THE GLASS BUT I WAS GETTING CUT SO MOST OF THE GLASS REMAINED ON THE SUN SHADE.",
        "vin": "KNDPN3AC0H7"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/15/2017",
        "dateOfIncident": "10/14/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11033443,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FMVSS 108,TABLE I-A, DAYTIME RUNNING LAMP (DRL), DEVICE ACTIVATION REQUIRES THAT DRLS BE \"AUTOMATICALLY DEACTIVATED WHEN THE HEADLAMP CONTROL IS IN ANY 'ON' POSITION.\"  ON THE 2017 KIA SPORTAGE THE DRLS REMAIN ON WITH THE HEADLAMP CONTROL IN ALL \"ON\" POSITIONS.  THIS GIVES THE APPEARANCE THAT THE HIGH BEAMS ARE ON ALL THE TIME.  OPPOSING DRIVES HAVE FLASHED THEIR LIGHTS AT ME TO INDICATE THAT MY HIGH BEAMS WERE ON WHEN THEY WERE NOT.  THIS CREATES TENSION AND ANGER IN BOTH DRIVERS.  I WAS EVEN STOPPED ONCE BY THE POLICE BECAUSE OF THE HIGH BEAM ON APPEARANCE.  SINCE THESE LIGHT FAIL TO MEET FMVSS REQUIREMENTS, KIA SHOULD INITIATE A RECALL TO REMEDY THE PROBLEM.  GIVEN THE COMMONALITY OF SYSTEMS MANUFACTURERS USE IN SEVERAL VEHICLE MODELS, OTHER KIA MODELS MAY BE SIMILARLY AFFECTED.",
        "vin": "KNDPNCAC5H7"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/15/2017",
        "dateOfIncident": "08/30/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11033456,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 8/30/17 I WAS DRIVING IN THE MIDDLE LANE OF THE HIGHWAY WHEN MY SUNROOOF EXPLODED.  THERE WERE NO OVERPASSES AND VERY FEW CARS AROUND ME SO NOTHING HIT THE SUNROOF TO CAUSE THE EXPLOSION.  I WAS ABLE TO SAFELY PULL OVER TO THE SHOULDER BECAUSE OF THE LIGHT TRAFFIC AT THE TIME.  NORMALLY THIS SECTION OF THE HIGHWAY IS VERY BUSY AND HAD I BEEN TRAVELING DURING COMMUTING TIMES THE OUTCOME COULD HAVE BEEN VERY DIFFERENT.    I HAD A FEW CUTS AND THROBBING EARS FOR TWO DAYS DUE TO THE BUFFETING WIND WHEN THE ROOF OPENED UP.  SHARDS OF GLASS COVERED THE ENTIRE INSIDE OF THE CAR AND I AM STILL FINDING GLASS EVEN AFTER THE DEALERSHIP CLEANED THE CAR.    THE SUNROOF WAS REPAIRED AFTER LENGTHY DISCUSSIONS WITH KIA HEADQUARTERS.  I WAS ABLE TO GET THE CAR BACK ONE MONTH LATER BUT NOW I KEEP THE SHADE CLOSED AND PROBABLY WILL CONTINUE TO DO SO.  I PAID EXTRA FOR THIS FEATURE AND NOW WILL NOT USE IT.    BILL DODGE KIA IN WESTBROOK MAINE PROMISED TO SEND ME THE REPAIR RECORD BUT HAVE NOT DONE SO TO DATE.",
        "vin": "KNDPNCACXH7"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/08/2017",
        "dateOfIncident": "09/01/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11022317,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FOCUSED BEAM HEADLIGHTS ON LOW BEAM ARE EXTREMELY BRIGHT WHEN SET TO KIA STANDARDS. ONCOMING TRAFFIC PERIODICALLY FLASHES HEADLIGHTS AT ME TO DIM MY HEADLIGHTS WHICH ARE ON LOW BEAM. A FEW ONCOMING CARS HAVE KEPT THEIR HIGH BEAM LIGHTS ON EVEN THOUGH I FLASH MY HIGH BEAMS TO LET THEM KNOW MY LOW BEAMS ARE ON. THE APPROACHING HIGH BEAM LIGHTS PARTIALLY BLIND ME RESTRICTING MY VISION. SOME CARS I AM FOLLOWING INDICATE MY LOW BEAM LIGHTS ARE TOO BRIGHT BY SLOWING DOWN OR USING THE TURN SIGNAL FLASHERS TO INDICATE MY LIGHTS ARE TOO BRIGHT. THESE ACTIONS OCCUR ON STATE HIGHWAYS WHILE I AM DRIVING AT NIGHT. I HAVE AN OPEN CASE WITH KIA. CASE NUMBER 12446047. KIA CUSTOMER SERVICE HAS ADVISED THEY CAN DO NO MORE BECAUSE THE FOCUSED BEAM HEAD LIGHTS ARE SET PER KIA SPECIFICATIONS.",
        "vin": "KNDPM3AC2H7"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/13/2017",
        "dateOfIncident": "05/17/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005140,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "RE: 2017 KIA SPORTAGE EX.  THE REAR TURN SIGNALS AND THE BACK-UP LIGHTS ARE IN-CONSPICUOUSLY LOCATED. 16\" LOWER THAN TAIL/BRAKE LIGHTS AND LOWER THAN LICENSE PLATE DEEMS A PROBABLE TRAFFIC SAFETY HAZARD. THE 9\" CURVED LENSES ILLUMINATE APPROX 2-3 \" IN THE REAR AND APPROX 6-7\" ON THE SIDE. A CERTAIN DAYTIME HAZARD. VERY POOR ENGINEERING  THIS PROBABLE UNSAFE HAZARD TAKES PLACE EVERY TIME THE TURN SIGNALS ARE APPLIED OR THE VEHICLE IS IN REVERSE.  AN ACCIDENT HAS NOT OCCURRED DIRECTLY OR INDIRECTLY TO THIS COMPLAINT...YET. THIS COMPLAINT IS ONGOING SINCE I PURCHASED THE VEHICLE, 5/17/2017. PLEASE INVESTIGATE AND RETURN FURTHER INFORMATION. THANK YOU",
        "vin": "KNDPNCAC4H7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/19/2017",
        "dateOfIncident": "12/17/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10990684,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE BEEN FIGHTING WITH KIA SINCE I PURCHASED THIS CAR IN DEC. OF 2016 TO NO AVAIL. PAID AN ADDITIONAL $4700 TO GET THE AUTONOMOUS BRAKING SYSTEM WHICH DOES NOT WORK. I HAVE GONE TO OTHER KIA DEALERS UNDER THE GUISE OF PURCHASING THIS VEHICLE AND NOT ONE OF THE FOUR DEALERS THAT I TESTED THE CAR AT COULD GET THIS SYSTEM TO WORK. I HAVE INFORMED KIA OF THIS FACT BUT JUST KEEP STONE WALLING ME. MY NEXT COURSE OF ACTION IS TO GO TO THE BBB, I THINK YOU SHOULD KNOW ABOUT THIS SINCE IT IS A VERY IMPORTANT SAFETY ISSUE. I ALSO INTEND TO INFORM THE CENTER FOR AUTO SAFETY AND CONSUMER UNION WHO HIGHLY RATED THIS CAR. HOPE TO HEAR FROM YOU SOON [XXX]  [XXX].     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'*JB",
        "vin": "KNDPNCAC3H7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/14/2017",
        "dateOfIncident": "05/10/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985641,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING AT HIGHWAY SPEED MY VEHICLE EXPERIENCED NEAR INSTANT LOSS OF MORE THAN 50% ENGINE POWER WITH CONTINUAL LOST OF THE REMAINING POWER.  MOVING FROM THE MIDDLE LANE INTO THE RIGHT LANE WAS DIFFICULT AND RISKY DURING HEAVY TRAFFIC.  I WAS LUCKY FINDING A SAFE SPOT TO PULL OVER.  AMBLING TO THE SAFE SPOT THE ENGINE SPUTTERED, HESITATED AND REACTED VERY LITTLE TO ANY FOOT ACTION ON THE THROTTLE, LEAVING ME WITHOUT THE ABILITY TO EFFECTIVELY CONTROL THE VEHICLE.",
        "vin": "KNDPRCA63H7"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/28/2017",
        "dateOfIncident": "03/28/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10969185,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN PURCHASED IN MAY, 2017, THE HEADLIGHTS HAD TO BE ADJUSTED AS THEY WERE AIMED TOO HIGH. THE ADJUSTMENT MADE THE LIGHTS TOO LOW AND WITH A VERY SHORT \"CUT-OFF\" POINT. IT IS ALMOST IMPOSSIBLE TO SEE THE ROADWAY IN FRONT OF THE VEHICLE AT NIGHT.",
        "vin": "KNDPR3A68H7"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/30/2017",
        "dateOfIncident": "01/17/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10948543,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 KIA SPORTAGE. WHILE DRIVING APPROXIMATELY 75 MPH ATTEMPTING TO PASS ANOTHER VEHICLE, THE SPEED DROPPED TO APPROXIMATELY 50 MPH AND THE ACCELERATOR PEDAL DID NOT RESPOND WHEN DEPRESSED. THE CONTACT DROVE THE VEHICLE HOME AT A VERY SLOW SPEED. THE FAILURE HAD BEEN OCCURRING SINCE THE BEGINNING OF JANUARY AND THE CHECK ENGINE WARNING INDICATOR WAS CONSTANTLY ILLUMINATED. THE DEALER DID NOT HAVE THE REMEDY AVAILABLE TO REPAIR THE VEHICLE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 5,343.",
        "vin": "KNDPRCA66H7"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/24/2017",
        "dateOfIncident": "12/23/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10947421,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD 4 INSTANCES OF WHAT FEELS LIKE THE CAR SLIPPING OUT OF \"DRIVE\".  WHILE IN DRIVE, WHEN I PRESS ON ACCELERATOR BUT WHILE THE RPM'S GO UP, THE CAR DOESN'T MOVE..  ONCE I REMOVE MY FOOT AND THEN PRESS AGAIN ON THE ACCELERATOR, IT PROCEEDS NORMALLY.  KIA CANNOT FIND ANYTHING WRONG WITH VEHICLE BUT LAST INSTANCE WAS LESS THAN 30 DAYS AGO.  THIS IS AFTER KIA HAD TO REPLACE THE BLOCK THE FIRST MONTH OF OWNERSHIP OF THIS BRAND NEW VEHICLE.",
        "vin": "KNDPNCAC9H7"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/09/2017",
        "dateOfIncident": "01/04/2017",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10943749,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT RENTED A 2017 KIA SPORTAGE. THE CONTACT STATED THAT WHILE PULLING INTO AN ARMY BASE AT APPROXIMATELY 30 MPH THERE WAS SMOKE COMING FROM THE VEHICLE. A WITNESS INFORMED THE CONTACT THAT THERE WERE FLAMES COMING FROM UNDER THE VEHICLE. THE FLAMES SPREAD TO THE HOOD AND WRAPPED AROUND TO THE DRIVER'S SIDE OF THE VEHICLE. THE CONTACT EXITED THE VEHICLE AS IT ENGULFED IN FLAMES. THE CONTACT OBSERVED THAT THERE WAS A TRAIL OF FUEL COMING FROM THE VEHICLE. THE FIRE WAS DISTINGUISHED BY THE LOCAL FIRE DEPARTMENT. A POLICE REPORT WAS FILED AND THERE WERE NO INJURIES REPORTED. THE VEHICLE WAS TOWED BACK TO THE RENTAL COMPANY. THE VEHICLE WAS DESTROYED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE.  THE FAILURE MILEAGE WAS 83,044.   UPDATED 02/03/17*LJ  UPDATED 09/07/2017*JS",
        "vin": "KNDPMCAC9H7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/03/2017",
        "dateOfIncident": "06/10/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10939172,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN PUSHING ON THE GAS THE RPM GO UP BUT THE CAR DOESN'T KICK IN RIGHT AWAY. THE TRANSMISSION? IT LIKE YOU HAVE A MANUAL TRANSMISSION AND YOU HAVEN'T LET OUT ON THE GAS. DOESN'T DO IT ALL THE TIME, BUT IS DOING IT ABOUT ONCE EVERY TIME I DRIVE.  IT IS GETTING MORE FREQUENT, WONDERING IF ITS DUE TO COLD WEATHER.",
        "vin": "KNDPN3AC3H7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/29/2016",
        "dateOfIncident": "10/14/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10938503,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 KIA SPORTAGE. WHILE DRIVING 60 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE CONTACT WAS ABLE TO RESTART THE VEHICLE. THE FAILURE RECURRED ON ANOTHER OCCASION WHILE DRIVING 50 MPH. THE VEHICLE WAS TAKEN TO BE REPAIRED, BUT THE FAILURE RECURRED. THE VEHICLE WAS DIAGNOSED AS HAVING A FAULTY SPARK PLUG AND THE ENGINE WAS REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 10,000.",
        "vin": "KNDPRCA66H7"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/02/2016",
        "dateOfIncident": "11/01/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10923939,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR SLIGHTLY VEERED TO THE LEFT, AT FIRST.  I BROUGHT IT UP TO THE SALES PERSON DURING THE DRIVE.  THERE WAS ALSO A SLIGHT BURNING SMELL WHEN I DROVE THE CAR HOME IN THE EVENING FROM THE DEALER.  I BROUGHT IT BACK THE NEXT DAY TO HAVE IT CHECKED OUT, AND THE SERVICE MANAGER SAID THAT HE COULD NOT FIND ANYTHING.  ONE OF THE SALES' PEOPLE STATED THAT SOME NEW CARS HAVE SMELLS IN THE BEGINNING AND TO RUN THE AIR THROUGH THE CAR.",
        "vin": "KNDPMCAC2H7"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/29/2016",
        "dateOfIncident": "09/28/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910527,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 KIA SPORTAGE. THE CONTACT STATED THAT WHEN THE VEHICLE WAS STARTED, A STRONG FUEL ODOR EMITTED FROM THE VEHICLE. THE VEHICLE WAS TOWED TO THE DEALER WERE IT WAS DIAGNOSED THAT AN ANIMAL CHEWED THE PLASTIC FUEL LINE AND CAUSED A FUEL LEAK. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 1,900.",
        "vin": "KNDPRCA65H7"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/07/2016",
        "dateOfIncident": "09/01/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10904405,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING , ESPECIALLY ON THE HIGHWAY, THE VEHICLE VEERS SLIGHTLY TO LEFT OR RIGHT AND TAKES CONSTANT CORRECTIONS TO KEEP IT DRIVING STRAIGHT. THE STEERING REQUIRES CONSTANT OVER CORRECTIONS AND THE STEERING ALSO FEELS VERY LOOSE.  IT FEELS LIKE DRIVING ON ICE.  I BROUGHT IT TO THE DEALER AND THE ALIGNMENT AND OTHER FACTORS HAVE BEEN CHECKED AND THEY SAY THERE IS NOTHING PER SAY WRONG WITH THE CAR.",
        "vin": "KNDPM3AC6H7"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/26/2016",
        "dateOfIncident": "06/23/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10899004,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A 4-LANE STREET IN MY COMMUNITY I STOPPED FOR A RED LIGHT. I STEPPED ON BRAKES AND THE PEDDLE WENT DOWN TO THE FLOOR. MY CAR GLIDED TO A STOP IN THE MIDDLE OF INTERSECTION. MY CAR'S MILEAGE WAS 810 MILES. I CALLED KIA AUTO REPAIR. THEY TOOK ME IN THE FOLLOWING MORNING. THE BRAKE CYLINDER HAD TO BE REPLACED.",
        "vin": "KNDPMCAC3H7"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/05/2016",
        "dateOfIncident": "06/02/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882617,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 KIA SPORTAGE. DRIVER REMOTE STARTS VEHICLE, UNLOCKS VEHICLE AND IMMEDIATELY SHIFTS FROM PARK TO ANY OTHER GEAR, WITHOUT PUSHING START/STOP BUTTON, AND WITHIN 10 SECONDS ENGINE SHUTS OFF WHILE IN DRIVE, NEUTRAL OR REVERSE.  ANTI-THEFT PROGRAMMED TO SHUT OFF ENGINE 10 SECONDS AFTER UNLOCKING DOORS UNLESS THE START/STOP BUTTON HAS BEEN PUSHED.  THERE IS NO WAY THAT DRIVER SHOULD BE CAPABLE OF SHIFTING OUT OF PARK UNTIL THE AFTER THE START/STOP BUTTON HAS BEEN ACTIVATED.  NOTE: THIS IS A CORRECTION FOR COMPLAINT # 10872312, REFERENCE 970797",
        "vin": "KNDPRCA67H7"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/03/2016",
        "dateOfIncident": "06/02/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872312,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 KIA SPORTAGE. AFTER STARTING THE VEHICLE WITH THE REMOTE STARTER AND SHIFTING FROM THE PARK POSITION TO REVERSE, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS ABLE TO RESTART. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 1,000.   UPDATED 07/12/16*LJ    *CN",
        "vin": "KNDPRCA67H7"
    }
]