[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/08/2022",
        "dateOfIncident": "02/07/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451067,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving my 2017 Sedona and it started making knocking noises and quit running. I then started it back up and it quit again and never restarted. No other lights came on and there was no warning, the car just stalled. I had it towed in and the mechanic stated that the engine has failed. I believe there were recalls on Kias engines and I feel like my Sedona should be covered because the engine has failed just like the Kias that have had extended warranties.",
        "vin": "kndmb5c12h6"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/21/2022",
        "dateOfIncident": "01/20/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448362,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "We purchased this car in Dec 2020, and since that time the rear brake light bulbs have been blowing on a regular basis. Now the headlights blew as well. We took it to the Kia dealer who informed us that the bulbs are shorting due to moisture leaking in to the rear sealed beams. There is no crack and no sign of impact. This issue has been found on two other cars that friends of mine have (VIN#'s shown below), and dealer says they are seeing these on a regular basis. This is an extremely dangerous problem, as most drivers don't know that their rear bulbs are not illuminating. This issue must be addressed ASAP.  KNDMB5C11H6293784;  KNDMB5C17G6180615",
        "vin": "KNDMB5C16H6"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/20/2022",
        "dateOfIncident": "01/20/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448285,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving home at night my main headlights randomly turned off while moving and went completely dark.  The headlight setting was set to always on at the time of the incident.  I quickly tried flipping to the auto setting and the head lights came back on.  I drive 50 yards and they went back off.  Fortunately I was not to far from home and kept switching back and forth to keep the lights on.  I see similar complaints on the internet.  Scary!",
        "vin": "Kndme5c16h6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/15/2021",
        "dateOfIncident": "11/14/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440479,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Engine turned off unexpectedly while driving. It has happened twice since owning the car (bought September 2021). Both instances occurred while I was slowing down into a turn. The first, I was slowing into a turn lane at a stop sign. The second, I was slowing into a turn through a green light. I was able, in both instances, to shift to neutral and restart while still moving. When the engine shuts off, the red engine light turns on, power steering is gone, but electrical stays on",
        "vin": "Kndmb5c13h6"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/26/2021",
        "dateOfIncident": "10/24/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11438182,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Kia Sedona. The contact stated while using the original jack that came with the vehicle when one side of the jack bent and caused the vehicle to collapse. The contact stated he pulled his back and did seek medical attention at a walk-in clinic. The vehicle was not diagnosed or repaired. A dealer was not contacted. The manufacturer had not been informed of the failure.",
        "vin": "KNDMB5C15H6"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/27/2021",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434565,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Kia Sedona. The contact stated that the driver's side sliding door failed to open. There was an abnormal clicking noise detected. The left turn signal failed to work intermittently. Additionally, the left signal would turn on randomly to the right turn signal. The vehicle was taken to the local dealer where it was diagnosed that the door motor needed to be replaced. The aftermarket hitch was causing the failure for the turn signal. The vehicle was repaired however, the failure recurred. The manufacturer was notified of the failure and referred the contact to another dealer. The failure mileage was 32,000.",
        "vin": "KNDMC5C12H6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/10/2021",
        "dateOfIncident": "09/10/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432396,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Since the beginning of using this vehicle every so many times of going to open the passenger and rear doors they will not open (manually or electronically by pulling on door handle.  I have to reach into car and push the door open buttons on the front seat console on ceiling or the car.  I took it back to Kia and they said it was a software update. I have made complaints and taken it back on more then three occasions and nothing has fixed the problem.  I should have made this complaint a long time ago.  I am raising my grandchildren and I should be able to manually pull the door open from pulling on the door handle.  If there is an accident I won’t be able to Extricate the children from the middle or back rows by manually pulling on the handle and Opening the door.  Same thing happens on the truck door.  So tired of this issue!!!",
        "vin": "KNDMC5C19H6"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/16/2021",
        "dateOfIncident": "07/12/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429210,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Both low beam H7 bulbs have blown out 3 times each.  I have used Basic bulbs, and more expensive bulbs and both have failed within several months.  I have used gloves when installing them avoiding touching the glass each time.  Bulbs seem to fit properly into socket.  Called dealer and no advice as to why this reoccurs.",
        "vin": "KNDMB5C1XH6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/23/2021",
        "dateOfIncident": "06/03/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11421963,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "This event occurred on June 3, 2021.   The passenger sliding door sunshade (in use) began to rip from the top edge due to a 3.4 year old child pulling on it from their front facing carseat on a long drive.    Unknown to the driver, the sunshade fabric had ripped about 5 inches away, leaving a portion of the rod exposed.  When the damage was noticed, the driver disconnected the shade and recessed it for the next duration of travel in an attempt to keep the child safe and to ensure no further damage to the shade.  While continuing the drive child, the child reached over and had begun mouthing the end of the rod while recessed.   The van later stopped.  Driver opened automatic sliding door from outside unknowingly while rod was in toddler's mouth.  As the door retracted to the rear, the exposed rod end was thrust down the toddler's throat.  The child shrieked in pain and fear.  Driver reached around and attempted to pull the rod forward from the toddler's throat unsuccessfully (because the door was still in backwards movement.  The toddler's head was pinned.  The child finally turned their head towards the door and the road sprung out from pressure.  Child had bruising and slight bleeding from the back of throat and a scrape along the inside of the cheek where the rod drug on its way out of the mouth.  Child was removed from carseat and checked for severe injuries.  There was no significant bleeding, the airway was unaffected, and photographs could not be taken due to the location of the injury and the age of the child.   The child was held and consoled. The child and parents were extremely traumatized and it took nearly an hour to continue the drive to the destination.  Child had instantly become fearful of the carseat.  The sunshade was manually removed entirely from the rod and the fabric recessed itself into the opening.  The rod is intact and in possession. We will not be repairing it due to fear of a repeated injury.  This event could easily occur again.",
        "vin": "KNDMC5C17H6"
    },
    {
        "components": "AIR BAGS,SEATS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/25/2021",
        "dateOfIncident": "03/15/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404787,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2017 KIA SEDONA PASSENGER SIDE SEAT BELT SIGN WAS FLASHING AND AIR BAG WARNING RED LIGHT WAS TURN ON. ACCORDING TO THE MANUAL AIR BAG ON PASSENGER SIDE MAY NOT WORK PROPERLY. IT'S KEEP GOING ON AND OFF ON MY DASH.",
        "vin": "KNDMB5C19H6"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/16/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403414,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLAMP WIRING HARNESS DEFECTIVE. LOW BEAM INOPERATIVE. HAPPENED AD I WAS DRIVING  ON VACATION.  I'VE READ SEVERAL BLOGS ABOUT SAME ISSUE WITH OTHER OWNERS. NO RECALL HAS BEEN ISSUED. MY VEHICLE IS 4 YEARS OLD.",
        "vin": "KNDMB5C13H6"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/18/2021",
        "dateOfIncident": "02/17/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396804,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE REPLACED THE HEADLAMP BULBS EVERY 3 MONTHS OR LESS, PURCHASING THE BRIGHTEST BULB, USING THE RECOMMENDED GEL,.  ALSO HAVE PURCHASED THE LESS EXPENSIVE ONES.. NOTHING SEEMS TO BREAK THIS CYCLE.  IT IS GETTING QUITE EXPENSIVE .. OVER $50 FOR 2 BULBS. IS THIS NORMAL?  THE DRIVER'S SIDE BLOWS OUT QUICKER THAN THE PASSENGER SIDE.    WOULD LIKE SOME HELP IN THIS.  THANKS",
        "vin": "KNDMB5C19H6"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/15/2021",
        "dateOfIncident": "12/31/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396229,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2017 KIA SEDONA FROM A KIA DEALER IN QUEENS, NY, IN 2017 WITH 50 MILES. I HAD AN ENGINE MALFUNCTION AT AROUND 65,000 WHILE DRIVING ON A HIGHWAY WITH A RELATIVE AND MY CHILDREN ON NEW YEAR'S EVE 12/31/20. WHEN I INITIALLY STARTED THE CAR, I HEARD A RATTLING SOUND, WHICH I THOUGHT WAS DUE TO THE COLD WEATHER; HOWEVER, AS I DROVE OFF AND DROVE FURTHER AND APPROACHED THE HIGHWAY, THE CAR STARTED TO DECELERATE. AFTER THE CAR DECELERATED, THE CAR CUT OFF WHILE I WAS DRIVING. IN A PANIC, I STARTED THE CAR AGAIN AND PULLED OVER TO THE SIDE. I HAD TO REPEAT TURNING THE CAR ON, THE CAR SHUTTING OFF AND DECELERATING, TURNING THE CAR ON, AND DRIVING TEN MILES TO RETURN HOME. THE VERY NEXT DAY, 1/1/2021 THE CAR WAS TOWED TO THE DEALERSHIP THAT HANDLED MY LEASE BUYOUT. THE SERVICE MANAGER EXHIBITED PROFESSIONALISM AND OFFERED EXCEPTIONAL SERVICES TO ENSURE THAT  I UNDERSTOOD THE REPAIR PROCESS. HE INFORMED OF CHARGES THAT WOULD BE INCURRED IF KIA DID NOT COVER THE WARRANTY.  KIA WILL NOT HONOR THE WARRANTY. THE SERVICE MANAGER INDICATED THAT RECEIPTS WERE REQUIRED TO DOCUMENT OIL CHANGES PERFORMED ON THE 2017 KIA SEDONA. SERVICE RECEIPTS FROM KIA DEALERSHIPS WERE PROVIDED; HOWEVER, ADDITIONAL RECEIPTS WERE REQUIRED. I CONTACTED THE KIA CORPORATE CUSTOMER SERVICE, THE CUSTOMER SERVICES REPRESENTATIVE EXHIBITED PROFESSIONALISM AND ADVISED ME TO GET RECEIPTS OF OIL PURCHASES FOR ANY OIL CHANGES DONE OUTSIDE OF A SERVICE SHOP. DUE TO LIMITATIONS IN RETRIEVING RECEIPTS WITHIN A CERTAIN TIMEFRAME, I AM UNABLE TO PRODUCE ADDITIONAL RECEIPTS. I AM WITHOUT MY CAR FOR ONE AND A HALF MONTHS, I AM RENTING A CAR WHILE PAYING MY MONTHLY FINANCE BILL, AND KIA WILL NOT HONOR MY WARRANTY BECAUSE OF A LACK OF RECEIPTS OF OIL CHANGES, ALTHOUGH THE CAR WAS PREVIOUSLY CAR SERVICED IN NOVEMBER 2020 AT A KIA DEALERSHIP.",
        "vin": "KNDMB5C14H6"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "02/11/2021",
        "dateOfIncident": "02/11/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395713,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 KIA SEDONA. THE CONTACT STATED THAT THE DRIVER'S AND PASSENGER'S SIDE SLIDING DOOR LATCHES FAILED TO KEEP THE DOORS SECURELY LOCKED WHILE DRIVING. THE CONTACT STATED THAT OCCASIONALLY THE DOORS SLID OPEN WHILE DRIVING AT VARIOUS SPEEDS. THE CONTACT HAD TAKEN THE VEHICLE TO FOX KIA IN GRAND RAPIDS (4141 28TH ST SE, GRAND RAPIDS, MI 49512, (616) 942-5000) WHO REPLACED THE DRIVER'S SIDE SLIDING DOOR LATCH. THE CONTACT THEN TOOK THE VEHICLE TO A CERTIFIED MECHANIC WHO REPLACED THE PASSENGER'S SIDE SLIDING DOOR LATCH. THE CONTACT STATED THAT BOTH DOOR LATCHES FAILED AGAIN AND WERE SCHEDULED TO BE REPLACED BY THE CERTIFIED MECHANIC WHICH WAS STILL PENDING. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND REFERRED THE CONTACT TO NHTSA FOR ASSISTANCE. THE APPROXIMATE FAILURE MILEAGE WAS 70,000.",
        "vin": "KNDMB5C18H6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/08/2020",
        "dateOfIncident": "10/04/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363375,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VAN STARTED TO MAKE A RATTLING  NOISE FROM UNDER THE HOOD 09/30/2020. THE CHECK ENGINE LIGHT CAME ON THE NEXT DAY 10/01/2020. I CALLED THE DEALERSHIP THEY SAID THEY DIDN'T HAVE AVAILABLE TIME SLOTS AND IT WAS FIRST COME, FIRST SERVE. THEN THE VAN SEEMED TO BE SLIPPING(NOT CATCHING GEARS) 10/04/2020. THAT EVENING 10/04/2020 AS I WAS DRIVING HOME ON THE HIGHWAY 70MPH THE VAN SHUT OFF (AS I WAS DRIVING) I MANAGED TO TRY AND STEER THE VAN TO THE SIDE OF THE ROAD. I TRIED TO RESTART THE VAN, BUT NOTHING(NOT EVEN MY FLASHERS WERE WORKING. I SAT FOR 10 MINS THEN TRIED AGAIN TO START THE VAN. IT WORKED, HOWEVER THERE WAS NOW A WORSE NOISE COMING FROM UNDER THE HOOD. I WAS ABLE TO DRIVE ANOTHER 3 MILES BEFORE IT SHUT OFF AGAIN, MID MOTION 58 MPH. AGAIN I WAITED, AFTER 23 MINS I WAS ABLE TO START THE VAN AND TRY TO GET CLOSER TO THE DEALERSHIP. THIS IS WHEN THE VAN BLEW UP!!!! AS I WAS DRIVING AGAIN, SHUT OFF MID MOTION.THIS TIME HOWEVER, THERE WAS SMOKE COMING FROM THE HOOD. I CALLED A TOW TRUCK AND OUR VAN IS CURRENTLY AT THE DEALERSHIP WHERE THEY ARE STATING WE'VE NEVER DONE MAINTENANCE TO OUR VAN. WE HAVE PROOF OF OIL CHANGES FROM JULY 2020 AND JANUARY 2020, SEPTEMBER OF 2019 AND JANUARY OF 2019. THEY ARE SAYING THE MOTOR NEED TO BE COMPLETELY REDONE AND THAT WERE NOT COVERED UNDER THE 100,000 POWER TRAIN WARRANTY. OUR VAN ONLY HAS 68,000 SOMETHING MILES AND IT'S A LEASED VEHICLE",
        "vin": "KNDMB5C11H6"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/27/2020",
        "dateOfIncident": "11/30/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351516,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 KIA SEDONA. THE CONTACT STATED THAT THE DRIVER'S SIDE SLIDING DOOR FAILS TO OPEN. THE DOOR WOULD EITHER MAKE A POPPING NOISE AND DOES NOT OPEN OR IT OPENS THE RETRACTS BACK TO CLOSE.  THE CONTACT STATED THAT THE PASSENGER SIDE SLIDING DOOR BEGAN TO EXHIBIT THE SAME ISSUE AT TIMES. THE CONTACT TOOK THE VEHICLE TO THE DEALERS (KIA OF DAYTON  ADDRESS: 8560 TROY PIKE, HUBER HEIGHTS, OH 45424   PHONE: (937) 358-8822,   MATT CASTRUCCI KIA  ADDRESS: 3013 MALL PARK DR, DAYTON, OH 45459  PHONE: (855) 250-8987, AND  KIA OF BEAVERCREEK  ADDRESS: 2220 HELLER DR, BEAVERCREEK, OH 45434  PHONE: (937) 358-8793)  WHO ALL HAVE EITHER ADJUSTED THE DOOR AND OR REPLACED THE MOTOR FOR THE DOOR A TOTAL OF APPROXIMATELY 6 TIMES WITHIN THE PAST 3 YEARS. THE HEADLIGHTS AND FOG LIGHTS SEEM TO BURN OUT AND NEED TO BE REPLACED AN EXCESSIVE AMOUNT OF TIME. THE  LEFT TURN SIGNAL WOULD WORK INTERMITTENTLY, ALSO,  WHILE THE VEHICLE WAS PARKED IN THE DRIVEWAY AND TURNED OFF, THE VEHICLE'S DRIVER SIDE HAZARD BEGAN TO FLASH AND THE HORN BEGAN TO SOUND OFF. THE CONTACT STATED THAT THEY RETURNED THE VEHICLE TO THE DEALER (KIA OF DAYTON ADDRESS: 8560 TROY PIKE, HUBER HEIGHTS, OH 45424 PHONE: (937) 358-8822) WHO STATED THAT BECAUSE OF AN AFTERMARKET HITCH WAS ATTACHED TO THE ELECTRICAL SYSTEM, BATTERY. THE WIRING HARNESS WAS REPLACED, HOWEVER, THE FAILURE PERSISTED. THE CONTACT STATED THAT THERE WAS A LOUD NOISE EMITTING FROM THE REAR OF THE VEHICLE. THE CONTACT TOOK THE VEHICLE TO THE DEALER (KIA OF BEAVERCREEK ADDRESS: 2220 HELLER DR, BEAVERCREEK, OH 45434 PHONE: (937) 358-8793) WHO STATED THAT THE SHOCKS AND CONTROL ARM FAILED AND REPLACED THE REAR SUSPENSION. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND OPENED A CASE REGARDING THE MATTER. THE APPROXIMATE FAILURE MILEAGE WAS 24,000.",
        "vin": "KNDMC5C17H6"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/24/2020",
        "dateOfIncident": "08/16/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351050,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN THE ROAD THE LOW BEAMS STOPPED WORKING ON MY 2017 KIA SEDONA, REPLACED BOTH LIGHT BULBS AND THEY STILL DO NOT WORK, THE HIGH BEAMS WORK NOT THE LOW BEAMS.",
        "vin": "KNDMB5C11H6"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/03/2020",
        "dateOfIncident": "01/31/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337324,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE JANUARY 2020 I HAVE BEEN EXPERIENCING MALFUNCTIONING ELECTRICAL ISSUES  BOTH WHILE DRIVING AND STANDING STILL.  WITHOUT ME NEEDING THE USE OF MY WIPERS   THEY WILL TURN ON ALL BY THEMSELVES WHILE IN THE OFF POSITION.  THIS WOULD BE BOTH  FRONT AND REAR WIPERS.  AS I TRY TO TURN THEM OFF BY MOVING THE WIPER ARM UP AND DOWN  AT TIMES THE SPEED WON'T CHANGE AT ALL OR FOR EXAMPLE THE HIGHEST SPEED LEVEL  WOULD WORK AT THE LOWEST SPEED LEVEL.  AS WELL THE HIGH BEAM WOULD ACTIVATE  THROUGHOUT DIFFERENT TIMES DURING THESE OCCURRENCES. I ALSO EXPERIENCED THE HEADLIGHTS TURNING OFF WHILE NIGHT DRIVING.  FOR MONTHS AS I WOULD BRING IN THE  VAN TO BE CHECK 3 TIMES TO BE EXACT WHICH I HAVE SOWN VIDEO THAT I STILL HAVE  SAVED.  FIRST TIME THEY SAID SINCE THEY COULDN'T DUPLICATE THE ISSUE I HAVE TO   BRING IT BACK,  SECOND TIME I PULLED UP WITH THE ISSUE OCCURRING AND THEY CHANGED  A MODULE BUT IT DIDN'T RESOLVE THE PROBLEM ABOUT A MONTH LATER THEY SAID IT WAS  THE CLOCK SPRING AND KIA CHANGED THAT AND TILL THIS DATE IT HAPPENS BUT NOT AS  FLUENT AS BEFORE AND THE WIPERS ALONE HAVE BEEN THE ISSUE.   IN THE.  *TR",
        "vin": "KNDMA5C16H6"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/27/2020",
        "dateOfIncident": "02/25/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311957,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2017 KIA SEDONA SHUT OFF WHILE IN MOTION ON A STREET.  I HAD TO PUT MY CAR IN PARK TURN THE KEY AND THEN RESTART MY CAR.  THIS HAPPENS ON 10/31/2019.  ROUGHLY 20 MINUTES LATER IT HAPPENED AGAIN WHILE ON THE HIGHWAY.  IT WAS TOWED TO THE KIA SERVICE CENTER AND THEY COULD NOT REPLICATE THE ISSUE.  ON 2/1/2020 MY CAR SHUT OFF AGAIN WHILE AT A RED LIGHT.  ON 2/25/2020 WHILE THE VEHICLE WAS IN MOTION IT SHUT OFF AGAIN.  THIS TIME A CAR BEHIND ME HAD TO SWERVE INTO THE OTHER LANE IN ORDER NOT TO SLAM IN TO ME.  ON 2/26/2020 WHILE DRIVING MY DAUGHTER TO SCHOOL IT SHUT OFF AGAIN WHILE IN MOTION.  THE VEHICLE WAS TOWED TO KIA SERVICE CENTER.  IT IS STILL CURRENTLY THERE.  THEY ARE STATING THEY CAN'T REPLICATE THE ISSUE.",
        "vin": "KNDMB5C12H6"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/26/2020",
        "dateOfIncident": "12/30/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301933,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE USING THE VARIABLE CRUISE CONTROL I WAS FOLLOWING A CAR WHICH WAS TRAVELING 40MPH.  I HAD MY VARIABLE CRUISE CONTROL SETTING AT 75MPH AND THE MAXIMUM DISTANCE SETTING. THEREFORE I WAS TRAVELING AT 40MPH.  A MOTORCYCLE PASSED ME ON MY RIGHT GOING 50MPH+.  AS MY CAR RECOGNIZED THE MOTORCYCLE IN FRONT OF ME IT SLOWED INITIALLY, AND THEN ACCELERATED TO FOLLOW THE MOTORCYCLE.  THE ACCELERATION CONTINUED AFTER THE MOTORCYCLE HAD PASSED THE CAR IN FRONT OF ME.  IT SEEMS THAT THE VARIABLE CRUISE CONTROL REMAINED FOCUSED ON THE MOTORCYCLE ALTHOUGH THERE WAS NOW A CAR BETWEEN ME AND THE MOTORCYCLE.  THE ACCELERATION CONTINUED AND THE DISTANCE BETWEEN ME AND THE CAR IN FRONT OF ME DECREASED UNTIL I INTERRUPTED THE CRUISE CONTROL AND SLAMMED ON THE BRAKES.  THIS SCENARIO HAS OCCURRED SEVERAL TIMES.  THIS ALL OCCURRED ON A HIGHWAY IN THE CARPOOL LANE WHILE GOING STRAIGHT.",
        "vin": "KNDMC5C11H6"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/26/2020",
        "dateOfIncident": "01/26/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301934,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR VIEW CAMERA SETTING ENGAGES WHENEVER THE CAR IS PUT INTO REVERSE.  THE DRIVER COMES TO RELY ON THE BACKUP CAMERA.  SEVERAL TIMES THE BACKUP CAMERA FAILS TO TURN ON AND CAN NOT BE MANUALLY TURNED ON.  I FEEL THAT THERE IS A CORRELATION BETWEEN TURNING THE CAR ON AND PUTTING IT INTO REVERSE QUICKLY HOWEVER I CAN NOT REPRODUCE THIS AT WILL.  THIS HAS HAPPENED 10+ TIMES.  I HAVE ALSO NOTICED ON SOME BUT NOT ALL OCCASIONS THAT AFTER REVERSING, WHEN I PUT THE CAR IN DRIVE, SUDDENLY THE BACKUP CAMERA DOES ENGAGE ALTHOUGH I'M NOW DRIVING FORWARD.  I'M CONCERNED THAT PEOPLE WHO HAVE BEEN ACCUSTOMED TO USING THE BACKUP CAMERA WILL GET IN A CRASH OR RUN INTO A PERSON WHEN THE BACKUP CAMERA INTERMITTENTLY FAILS.",
        "vin": "KNDMC5C11H6"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/26/2020",
        "dateOfIncident": "01/26/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301935,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "IMAGES ON THE BACKUP CAMERA IS INTERMITTENTLY VERY DIFFICULT TO SEE.  THIS IS EASY TO REPRODUCE WHEN BACKING OUT OF A COVERED GARAGE INTO SUNLIGHT.  WHILE THE ENTIRE CAR IS IN THE SHADE THE IMAGE IS CLEAR, HOWEVER AS SOON AS THE CAMERA ON THE BACK OF THE CAR HITS THE SUN, THE IMAGE BECOMES VERY DIFFICULT TO SEE.  IT IS \"BLOWN OUT\" AND VERY WHITE.  AS SOON AS THE FRONT OF THE CAR WHERE THE LIGHT SENSOR IS HITS THE SUNLIGHT THE BACKUP IMAGE ADJUSTS AND IS CLEAR AND EFFECTIVE.  THE SYSTEM NEEDS A LIGHT SENSOR WHERE THE CAMERA IS LOCATED IN ORDER TO ADJUST THE LIGHT SETTINGS TO MATCH THE CAMERA'S ENVIRONMENT.  THIS IS DANGEROUS IN THAT THE CAMERA IS INITIALLY WORKING AND THEN SUDDENLY BECOMES UNUSABLE WHILE THE DRIVER MAY BE RELYING ON IT.  THIS COULD RESULT IN A CRASH OR INJURY AS THE DRIVER BACKS UP WHILE RELYING ON THE BACKUP CAMERA SYSTEM.  THIS IS FAIRLY EASY TO REPRODUCE CONSISTENTLY.",
        "vin": "KNDMC5C11H6"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/22/2020",
        "dateOfIncident": "01/21/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301128,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Kumho Tire Co., Inc.",
                "productMake": "KUMHO",
                "productModel": "KUMHO",
                "productYear": "9999",
                "size": "P195/55R15",
                "type": "Tire"
            }
        ],
        "summary": "2017 KIA SEDONA OEM TIRES KUMHO CRUGEN 235/65R17 104H X 4 ALL FACTORY INSTALLED TIRES REPLACED DUE TO VIBRATION/ SAFETY CONCERNS DUE TO BELT SEPARATION IN 2019 WITH 2 WITH LESS THAN 20K REMAINING 2 WITH LESS THAN 30K. REPLACED  X 4 WITH IDENTICAL SIZE MAKE AND MODEL. 1/21/2020 EXPERIENCED NON REPAIRABLE TIRE FAILURE DUE TO BELT SEPARATION/ RUPTURE ON TREAD SURFACE. APPROX 40K MILES ON AFFECTED TIRE WITH USABLE TREAD LEFT.    TRYING TO FILL OUT THIS FORM TO ENCOMPASS A HISTORY OF  5 TIRE FAILURES FOR  BELT SEPARATION OVER AN 18 MONTH PERIOD FOR A LINE OF TIRES PRODUCED OVER THREE YEARS IS CONFUSING,  THANKS",
        "vin": "KNDMB5C12H6"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/30/2019",
        "dateOfIncident": "05/05/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277186,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SIZE DOOR MAKES A GRINDING NOISE AND WILL NOT OPEN SOMETIMES. IT DOES THE SAME WHEN I TRY TO CLOSE IT. ON AVERAGE IT IS ABOUT 50/50 AND I AM CONCERNED THAT #1 IT WILL NOT SHUT ONE DAY WHEN WE NEED TO DRIVE IT, AND #2 SINCE THE DOOR DOES NOT OPEN AND CLOSE PROPERLY WHAT IF IT DOES NOT STOP IF SOMEONE IS IN THE WAY OF IT?  THIS OF COURSE HAPPENS WHEN THE VAN IS STATIONARY. THIS HAPPENS OFTEN AND I NOTICED IT FIRST AT ABOUT 40K MILES.  THE DEALERSHIP TOLD ME THIS IS NOT COVERED UNDER WARRANTY.",
        "vin": "KNDMB5C10H6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/26/2019",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222724,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE DRIFTS TO RIGHT, ABOUT TO CAUSE AN ACCIDENT",
        "vin": "KNDMB5C10H6"
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/17/2019",
        "dateOfIncident": "01/17/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11197050,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AROUND A CORNER DOING 25 MPH, ON A BACK ROAD THAT WAS DRY, I CORRECTED THE STEERING  TO THE LEFT OUT OF THE CURVE AND THE STEERING CONTINUED TO PULL TO THE RIGHT AND WOULD NOT CORRECT. VEHICLE WENT DOWN A 20 FOOT EMBANKMENT AND STRUCK A TREE HEAD ON. THE AIRBAGS DID NOT DEPLOY IN THE COLLISION AND THE ENGINE DID NOT SHUT OFF. I SUSTAINED SERIOUS INJURIES, RESULTING IN 4 MONTHS OF MISSED WORK AND A DOUBLE DISCECTOMY TO REPAIR TWO SEVERELY HERNIATED  DISCS. UNTIL MY SURGERY I WAS IN A WHEELCHAIR FROM THESE INJURIES, AS MY SPINAL CORD WAS COMPRESSED BY THE DISCS IN MY NECK. THE KIA SERVICE DEPARTMENT AND THE CUSTOMER RELATIONS HOTLINE WILL NOT SPEAK TO ME REGARDING THE SAFETY FEATURES OTHER THAN TO SAY THERE HAS NOT BEEN A RECALL. IT IS MY UNDERSTANDING THAT THE AIRBAGS SHOULD DEPLOY FROM A FULL FRONT IMPACT GOING A SPEED OF AT LEAST 25MPH (AS THERE WAS DOWNWARD MOMENTUM AT THAT POINT) HOWEVER THE AUTO BODY REPAIR SHOP THAT OUR INSURANCE COMPANY ASSIGNED US TO SAYS THE AIRBAGS ARE NOT DESIGNED TO DEPLOY IN SUCH AN ACCIDENT. AS I CANNOT GET AN ANSWER FROM KIA AS TO WHETHER THIS HAS MERIT, I AM LEFT DRIVING A VEHICLE THAT I AM UNSURE IS SAFE.",
        "vin": "KNDMC5C15H6"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/13/2019",
        "dateOfIncident": "02/07/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11179875,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HEADLIGHTS HAVE BLOWN 3 TIMES WITHIN THE LAST 3 MONTHS.  IT WAS HAPPEN ON BOTH DRIVERS AND PASSENGERS SIDE 3 TINES EACH.  SO I REPLACED A TOTAL OF 6 LIGHT BULBS.",
        "vin": "KNDMB5C11H6"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/05/2019",
        "dateOfIncident": "01/25/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174419,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SLIDING DOORS  HAVE BEEN MALFUNCTIONING AND OPENING WHILE THE CAR IS IN DRIVE AND MOVING THE DRIVER SIDE BACK DOOR DOES NOT STOP IF THERE IS SOMETHING THERE. SLIDING DOORS FAILED TO CLOSE.",
        "vin": "KNDMB5C12H6"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/28/2019",
        "dateOfIncident": "01/16/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11172652,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING VERY COLD WEATHER, THE PASSENGER SIDE POWER DOOR WOULD NOT CLOSE",
        "vin": "KNDMB5C11H6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/01/2018",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11155360,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TODAY (DECEMBER 1, 2018) AT ABOUT 12:45 PM-MY FAMILY AND I WERE DRIVING IN OUR 2017 KIA SEDONA NORTHBOUND ON INTERSTATE 75 AND SUDDENLY HEARD A LOUD EXPLOSION. I WAS TERRIFIED, THEN HEARD MY CHILDREN START SCREAMING AND CRYING. MY HUSBAND WAS SITTING IN THE PASSENGER SEAT TURNED BACK AND SAW OUR YOUNGEST BABY (SEATED ON THE DRIVER SIDE) COVERED IN SHARDS OF GLASS. I PULLED OVER TO THE SIDE OF THE ROAD TO CALM OUR CHILDREN.  THERE WERE SHARDS OF GLASS COVERING THE BACK OF THE VAN. WE THEN CALLED KIA AND EXPLAINED THE PROBLEM AND WAS ADVISED THAT \"KIA CORPORATE\" WOULD NEED TO BE CONTACTED ON MONDAY (12/3/2018) BEFORE ANYTHING COULD BE AUTHORIZED.",
        "vin": "KNDMB5C12H6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/04/2018",
        "dateOfIncident": "08/10/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11124426,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "KEYLESS PUSH BUTTON ON/OFF BUTTON FAILED TO TURN OFF ON OUR 2017 KIA SEDONA AND THE VEHICLE HAD NO ALARM TO WARN US. OUR HOME FILLED TO TOXIC LEVELS OF CARBON MONOXIDE AND I AM UNDERGOING CONTINUATION OF MEDICAL TREATMENT. OUR HOME FILLED TO A LEVEL OF 190 AND DEATH OCCURS AT 200 PER THE HAZMET TEAM WHO RESCUED US.THE VEHICLE WAS PARKED IN OUR GARAGE.",
        "vin": "KNDMB5C19H6"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/01/2018",
        "dateOfIncident": "08/30/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123985,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SIDE BACK DOOR DOES NOT STOP IF THERE IS SOMETHING THERE. IT ALMOST CLOSED ON MY SON WHO HAD TO GET OUT OF THE WAY FAST BECAUSE IT CLOSED AND DIDN'T SENSE HE WAS THERE.",
        "vin": "KNDMB5C12H6"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/07/2018",
        "dateOfIncident": "07/26/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11118334,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 KIA SEDONA. THE CONTACT STATED THAT THE HATCH AND SLIDING DOORS FAILED TO CLOSE. THERE WERE NO WARNING INDICATORS ILLUMINATED. ADDITIONALLY, THE HATCH INADVERTENTLY CLOSED ON THE CONTACT'S BODY. THE CONTACT SUSTAINED HEAD INJURIES THAT REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER (ELK GROVE KIA, 8480 LAGUNA GROVE DR., ELK GROVE, CA 95757, (916) 753-1000), BUT THE FAILURE COULD NOT BE DUPLICATED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED AND PROVIDED CASE NUMBER: [XXX]. THE FAILURE MILEAGE WAS 13,679. *BF    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TT",
        "vin": "KNDME5C13H6"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/23/2018",
        "dateOfIncident": "02/26/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089677,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I BOUGHT THIS CAR I WAS NOT GIVEN ANY WARNINGS/INFORMATION ABOUT THE EDIBLE WIRING IN THE AUTO EVEN THOUGH THERE ARE NUMEROUS COMPLAINTS AND LAWSUITS ABOUT THIS PROBLEM.  I COULD FIND NOTHING IN THE PROVIDED LITERATURE.  I AM A 73 YEAR OLD WIDOW AND I HAD RESEARCHED THIS CAR.  IT RATED HIGH FOR SAFETY.  I HAD TO HAVE A SAFE CAR.  IN FEBRUARY,2018 WHILE I WAS ON THE ROAD WARNING LIGHTS ABOUT ABS APPEARED AND THE REAR WASHER DID NOT WORK.  DIAGNOSED AS CHEWED WIRING.  THE DEALERSHIP SAID NOT THEIR PROBLEM! A FEW WEEKS LATER THE CAR STALLED ON A HIGHWAY AND WARNING LIGHTS SAID ABS AND THE CRUISE CONTROL DID NOT WORK.  A FEW MINUTES LATER THE CHECK ENGINE LIGHT CAME ON.  THE CAR FELL TO PIECES AS I WAS DRIVING.  AGAIN DIAGNOSED AS CHEWED WIRING.  AGAIN HAD IT REPAIRED AT MY EXPENSE.  I RESEARCHED AND SPENT SEVERAL HUNDRED ON REPELLANTS, ETC.  I HAD INSIDE THE CAR AND ALL AROUND THE CAR SURROUNDED WITH EVERYTHING I COULD FIND.  I CALLED AN EXTERMINATOR BUT HE SAW NO EVIDENCE OF RATS.  POSSIBLE SQUIRRELS.  GAME CAM TOOK PICTURES OF RACCOONS.  THOUGHT MAYBE I WAS SAFE.  TWO WEEKS LATER NO WATER TO FRONT OR REAR WINDOWS.  DEALER SAID ABOUT 8 INCHES OF THE WATER HOSE HAD BEEN EATEN.  MY PREVIOUS CAR (CHEVY UPLANDER 2008) SAT IN THE SAME PLACE FOR OVER 3 YEARS AND NO WIRING PROBLEMS.  RESEARCH SHOWED MOST CARS TODAY MADE WITH SOY-BASED WIRING THAT ATTRACTED RODENTS.  I AM NOT SAFE DRIVING THIS CAR.  THERE WERE NO WARNINGS ABOUT A KNOW PROBLEM.  THE DEALER DENIES ALL RESPONSIBILITY AND THE MANUFACTURER CUSTOMER COMPLAIN DEPARTMENT WILL NOT RETURN MY CALLS.   WHEN I CALL THEM THEY SAY \"NOT THEIR PROBLEM\".  I SAY IT IS THEIR PROBLEM!!  I WANT A BUYBACK OR AT LEAST WRAPPING ALL THE WIRING WITH REPELLANT TAPE, REFUND OF ALL MONEY SPENT IN REPAIRS AND PREVENTATIVES, A PROMISE TO FIX ANY FUTURE DAMAGE AND A MONETARY AWARD FOR ALL MY STRESS AND INCONVENIENCE.",
        "vin": "KNDMB5C10H6"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/14/2018",
        "dateOfIncident": "07/06/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11034969,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 KIA SEDONA. CONSUMER WRITES IN REGARDS TO BRAKE ISSUE. *LD     THE CONSUMER STATED AFTER 29 DAYS AND 4 VISITS THE BREAKS STILL WERE NOT REPAIRED.    *JS",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/27/2018",
        "dateOfIncident": "01/30/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075308,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE LIGHT CAME ON AND STAYED ON FOR TWO DAYS. MIRRORS AND HORN DOES NOT FOLD OR BEEP WHEN PRESSING THE KEY PAD TO LOCK THE DOORS. ENGINE IS BEGINNING TO SOUND LOUD. ITS TOUGH DRIVE UP SMALL SLOPES. IT HAVE THE \"ECO\" BUTTON BUT IT DOES NOT SAVE ON &#9981;. WHEN THESE ISSUES HAPPENED THE VEHICLE WAS PARKED, DRIVING UP STEEP HILLS, SMALL HILLS, LEVEL ROAD, HIGHWAYS...",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/14/2018",
        "dateOfIncident": "01/08/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072918,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH SLIDING DOORS ON MY SEDONA HAVE BEEN MALFUNCTIONING AND OPENING WHILE THE CAR IS IN DRIVE AND MOVING ON THE ROAD AT 10+ MILES AN HOUR.  THE CAR WILL CONFIRM THAT ALL DOORS ARE SHUT AND THE INDICATOR LIGHTS ARE OFF WHEN I PULL AWAY FROM THE CURB OR PARKING SPOT.  ONCE I AM ON THE ROAD, BOTH DOORS HAVE INTERMITTENTLY HAD THEIR OPEN DOOR LIGHT INDICATORS COME ON WHILE I AM DRIVING.  ONCE I STOP THE CAR AND INSPECTED THE DOOR WITH THE INDICATOR LIGHT ON, I CONFIRMED THAT THEY ARE INDEED UNLATCHING AND COMING AJAR.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/25/2017",
        "dateOfIncident": "09/24/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11025293,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 KIA SEDONA. WHILE THE VEHICLE WAS PARKED AND THE REAR PASSENGER DOOR WAS SLIDING CLOSED, THE LEFT HAND OF THE CONTACT'S CHILD WAS SMASHED IN THE DOOR. THE LOCAL DEALER (MATT BLATT KIA OF TOMS RIVER, 1070 RTE 37 W, TOMS RIVER, NJ, 08755) WAS CONTACTED AND AN APPOINTMENT WAS SCHEDULED. THE CONTACT'S CHILD SUSTAINED INJURIES TO THE LEFT HAND THAT REQUIRED MEDICAL ATTENTION. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND FILED A REPORT. THE FAILURE MILEAGE WAS APPROXIMATELY 2,000.",
        "vin": "KNDMB5C17H6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/06/2017",
        "dateOfIncident": "08/04/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013117,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HANDS FREE DEVICE IN VEHICLE DOES NOT WORK WITH ANDROID OR APPLE SMART PHONES AS ADVERTISED.",
        "vin": "KNDMA5C15H6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/28/2017",
        "dateOfIncident": "06/26/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10968902,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VAN COMPLETELY SHUTS DOWN UPON SLOWING DOWN TO COME TO A STOP. THIS DOES NOT HAPPEN EVERY TIME I STOP, BUT HAS HAPPEN A TOTAL OF 8-10 TIMES IN THE 9 MONTHS THAT I HAVE OWNED THE VAN. WITHIN THE FIRST WEEK THAT I PURCHASED THE VAN THE VAN STALLED TWICE. WHEN THE VAN STALLS THERE IS A COMPLETE LOST OF POWER. IN ORDER TO RESTART THE VAN I NEED TO RETURN THE KEY TO THE START POSITION IN THE IGNITION AND TURN THE KEY OVER AGAIN TO START THE VEHICLE. I HAVE BROUGHT THE VAN TO THE DEALERSHIP WHERE I BOUGHT THE VAN ON THREE OCCASIONS TO HAVE THE VEHICLE DIAGNOSED AND REPAIRED. THEY HAVE YET TO FIND A PROBLEM.",
        "vin": "KNDMB5C17G6"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "11/08/2016",
        "dateOfIncident": "10/31/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925049,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT RENTED A 2017  KIA SEDONA. WHILE DRIVING APPROXIMATELY 35 MPH, THE CONTACT REAR ENEDED THE PRECEDING VEHICLE. THE FRONTAL AIR BAGS DID NOT DEPLOY AND THE SEAT BELT DID NOT RESTRAIN THE DRIVER. A POLICE REPORT WAS FILED AND THERE WERE NO INJURIES. THE VEHICLE WAS TOWED TO A PRIVATE IMPOUND LOT AND WAS NOT DRIVABLE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 7,609. UPDATED 02/15/2017*CT",
        "vin": "KNDMB5C17H6"
    }
]