[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/10/2022",
        "dateOfIncident": "03/09/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456065,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Lincoln MKZ. The contact stated while driving approximately 45 MPH, the brake pedal was depressed and traveled to the floorboard. The contact stated the braking distance was extended due to the failure. The contact stated that no warning light was illuminated. The vehicle was taken to a dealer who stated that the failure was caused by the front driver’s side brake rubber hydraulic line that needed to be replaced due to damage. The contact stated that the vehicle was currently at the dealer for the repair. The manufacturer was notified and stated that the vehicle was not included in a recall. The contact related the failure to NHTSA Campaign Number: 20V469000 (Service Brakes, Service Brakes, Hydraulic). The approximate failure mileage was 47,000.",
        "vin": "3LN6L5DC8HR"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/16/2022",
        "dateOfIncident": "11/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11452290,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I own a Lincoln mkz reserve it started running rough and i was informed it had a misfire code and the recommendation was to change the coils and spark plugs, after that was done it still wasn't fixed after multiple items on vehicle changed it stopped running altogether and i was told the engine lost compression and that this is common flaw on 2017-2019 Lincoln engines and that ford even has a service bulletin and my sole remedy was to buy a new engine this isn't right someone could be inured if vehicle dies in traffic on top of the fraud by ford they are selling vehicle that intentionally blow there engine after the warranty period, i have send hundred of other poor soul that this has happened to online . the us government needs to take action to stop this fraud",
        "vin": "3ln6l5e98hr"
    },
    {
        "components": "WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/15/2022",
        "dateOfIncident": "02/15/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452150,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Lugnuts are stripped and swollen at only 60k miles. An improperly seated lug nut could result in the tire coming off at high rate of speeds posing a safety hazard. The dealer found and confirmed the swollen and stripped lug nuts. Lincoln dealer is the only entity who has serviced the vehicle while in my possession. After speaking with advisor, they said this is a common problem - indicating Lincoln is aware of the issue. After researching, MANY Ford and Lincoln owners are filing complaints, and lawsuits over this issue and Ford is denying them. This indicates Ford and Lincoln are aware of the problem. Part was inspected by the manufacturer, Lincoln. No warning lamp, message, or symptom indicating the problem. Last service appointment (approx 5100) miles ago did not indicate any issue with the lug nuts.",
        "vin": "3LN6L5MUXHR"
    },
    {
        "components": "ELECTRICAL SYSTEM,WHEELS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/13/2022",
        "dateOfIncident": "02/06/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451750,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "After a year with the purchasing dealer we are still having on-going electrical issues with the vehicle.  Apple Sync, voice control.  Still have issues with rims pitting after only less than 10,000 miles on the vehicle.  Bolt rusting on under carriage.   Film on back window.    Lincoln Corporate has been following this case for a year now and my rep is Mr. Dehane Davis.  This file is still open at Lincoln Corporate.",
        "vin": "3LN6L5F91HR"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/17/2022",
        "dateOfIncident": "01/06/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447792,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I went to the dealer for a tire rotation and could not do it because they said I had swollen lug nuts , they  are not covered on my extended warranty",
        "vin": "3LN6L5E92HR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "12/29/2021",
        "dateOfIncident": "12/21/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445416,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 Lincoln MKZ had the \"Auto Hold\" on and the car came to a complete stop at an intersection with a red traffic light.  One other vehicle was in front of me and we had been stopped for at least 30 seconds.  Without notice the Lincoln MKZ quickly lunged forward and struck the vehicle in front of me.  I kept applying the brake but the car would not stop, it kept hitting the car in front 3 times before it stopped.  Auto Hold button was still illuminated.  The car was then turned off.  The person in the car in front of me stated that they thought I was hit from behind and pushed into their car.  I also thought that I was hit from behind and pushed into the car in front.  There were no injuries.  If I would have been the first car at the light, chances are my car would have been T-boned.  I have not driven the car since the incident.  No warning signals were given prior to the incident.  I would like to have the EDR , black box, evaluated to determine why the Auto Hold malfunctioned.  Air bags did NOT deploy.  The car is scheduled for service on January 10, 2022.",
        "vin": "3LN6L5E9XHR"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/16/2021",
        "dateOfIncident": "11/05/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440648,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Navigation fails to locate correct GPS location rendering all navigation functions useless. APIM module replaced once under warranty, now 1 year later the issue has returned.",
        "vin": "3ln6l5hc3hr"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/05/2021",
        "dateOfIncident": "09/16/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435578,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I took car in to get oil change found coolant leaking. Car has 32000 miles. I went to ford store and they said coolant is leaking out side of engine and cylinders no 3 and 4 have coolant inside  Ford replaced engine.  2.0 Eco bost Engine",
        "vin": "3LN6L5A98HR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/21/2021",
        "dateOfIncident": "07/15/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425795,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I have a 2017 Lincoln mkz  2.0L 6 speed automatic transmission.   The torque converter weld studs. The torque converter is on longer connected to the engine flex plate causing its ability to move. If you look at recall 17S16 it is an expansion of recall 17V427. my car is available  I was driving on a 4 lane highway going about 60mph when car cut off. I was very afraid for my life. But also the life if others when I had no control of my speed. Personal mechanic. I first heard some noise under the car that would come and go, on this day I heard a thump and the vehicle lost its ability to move. which cause a very dangerous situation,  cars where going around my car at speeds of 70 to 80mph. I am lucky to be alive!",
        "vin": "3LN6L5E90HR"
    },
    {
        "components": "POWER TRAIN,EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/30/2021",
        "dateOfIncident": "06/20/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422885,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "1) Every used miz I test drove had a super hard jerk out of first gear including the one I purchased, I was told it was fine, went to another dealership and was told the transmission clutch was gone, repaired under warranty. 2) Gas tank door spring failed, saw its a common problem with Ford Lincoln vehicles, dealer replaced entire door housing sleeve, not covered under warranty, had to be installed twice after coming out after incorrectly installed. 3) Front headlights lens spider web cracking. When purchased I saw small stress cracks at top by hood 3 to 7 months later entire lens/globe housing look like shattered glass but still in tacted, not covered under warranty, now passenger light starting to look the same. Only had the car 13 months. Dealer service rep ask do I drive car alot or drive in the rain, I was shocked. 4) Rear trunk tail light across entire back end full of moisture. Not covered under warranty. Every since 2007 this seem to be a common problem with every car I had to poor designed product that consumer have to pay for and shouldn't. It will cost thousands of dollars to replace.",
        "vin": "3LN6L5D95HR"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/29/2021",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422848,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Lincoln MKZ. The contact stated that the headlight housing was cracked. The vehicle was diagnosed but not repaired. The manufacturer was informed of the failure and informed the contact that the Vin was not under recall. The failure mileage was approximately 53,000.",
        "vin": "3LN6L5D95HR"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/23/2021",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422046,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The daytime running lights fail to illuminate which is a safety hazard.  A message to check the headlights is displayed on the dashboard ONLY when the car is started with the remote start feature.  This is a known problem as confirmed by technical service bulletin  (TSB #SSM 46508)",
        "vin": "3LN6L5F92HR"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": true,
        "dateComplaintFiled": "11/05/2020",
        "dateOfIncident": "10/09/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11373156,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS STATIONARY BEHIND A CAR TURNING LEFT ON HWY 154 S IN COWETA CO, GA, WHEN I WAS HIT FROM BEHIND BY ANOTHER AUTOMOBILE GOING APPROXIMATELY 50+ MPH. THE DRIVER WHO HIT ME NEVER APPLIED HIS  BRAKES, WHICH PUSHED MY CAR INTO THE SUV IN FRONT OF ME. THE CAR I WAS PUSHED INTO WAS SHOVED 30+ YARDS DOWN THE ROAD. MY AIRBAGS DID NOT DEPLOY AND MY DRIVER'S SIDE SEAT BROKE.",
        "vin": "3LN6L5CC5HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/21/2020",
        "dateOfIncident": "09/04/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360197,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "COLLISION MITIGATING BRAKING DOES NOT ENGAGE THE BRAKES. WHEN A TRUCK SUDDENLY CUT ME OFF, THE AUDIBLE AND VISUAL WARNING INDICATE OBJECT IN THE WAT BUT NO BRAKING OCCURS. BRAKE PEDAL DOES NOT PUMP UP (AS IT DOES WHEN THE RADAR CRUISE CONTROL SLOWS THE CAR). CAN REPRODUCE BY FOLLOWING TURNING VEHICLE TOO CLOSELY.",
        "vin": "3LN6L5FC7HR"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/03/2020",
        "dateOfIncident": "08/25/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353095,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED CPO WITH 38K MILES ON IT. A WEEK AFTER OWNING SMOKE EMITTED FROM EXHAUST, CHECK ENGINE LIGHT CAME ON AND CAR WAS ROUGH TO START, IDLING HARD. CAR MELTED STRONGLY OF ANTIFREEZE BUT NO VISIBLE LEAKS. LINCOLN DID INSPECTION AND SAYS NEEDS A NEW ENGINE DUE TO COOLANT LEAKING INTO CYLINDERS AND PISTONS FAILING. ENGINE IS ON BACKORDER FOR TWO MONTHS. THIS SEEMS TO BE A KNOWN PROBLEM. WE ARE EXTREMELY UNHAPPY. HAVEN'T EVEN HAD THE CAR TWO WEEKS BEFORE THIS STARTED HAPPENING. WE WANT OUT OF THIS CAR!",
        "vin": "3LN6L5E93HR"
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/15/2020",
        "dateOfIncident": "06/15/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328834,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "JERKS HARD INTO SECOND GEAR AND  JERKS WHEN PUT IN REVERSE IN MOTION.  *TR",
        "vin": "3LN6L5H99HR"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/15/2020",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324706,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED HAVE PROBLEMS WITH THE HEAT ON THE CAR, TOOK IT TO THE FORD DEALERSHIP AND WAS TOLD THE ENGINE NEEDED TO BE REPLACED. ACCORDING TO TSB 19-2346 IT IS A KNOWN DEFECT WITH THIS MODEL OF VEHICLE AND THEY REFUSE TO PAY FOR REPAIR DUE IT BEING OUT OF WARRANTY.  *TR",
        "vin": "3LN6L5D93HR"
    },
    {
        "components": "STEERING,WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/13/2019",
        "dateOfIncident": "11/04/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279778,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 LINCOLN MKZ. WHILE DRIVING 25 MPH, THE CONTACT DEPRESSED THE BRAKE PEDAL AND THE VEHICLE PULLED TO THE RIGHT OR LEFT INTERMITTENTLY WITHOUT WARNING. THE VEHICLE WAS TAKEN TO GRAND LEDGE FORD LINCOLN (6080 E SAGINAW HWY, GRAND LEDGE, MI 48837, (517) 627-8100) WHERE IT WAS TEST DRIVEN. THE DEALER DID NOT FIND ANY FAILURES. THE VEHICLE WAS NOT REPAIRED. THE VEHICLE WAS THEN TAKEN TO LAFONTAINE FORD OF LANSING (5103 S CEDAR ST, LANSING, MI 48911, (517) 394-7000) WHERE IT WAS TEST DRIVEN. THE DEALER CONFIRMED THAT THE ALIGNMENT WAS UNEVEN. THE VEHICLE WAS NOT REPAIRED AND THE FAILURE RECURRED MULTIPLE TIMES. THE CONTACT REFERENCED NHTSA CAMPAIGN NUMBER: 18V167000(STEERING). THE MANUFACTURER WAS MADE AWARE OF THE FAILURES AND PROVIDED CASE NUMBER: 24864137. THE FAILURE MILEAGE WAS APPROXIMATELY 23,000.",
        "vin": "3LN6L5E99HR"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/21/2019",
        "dateOfIncident": "10/11/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269944,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WENT TO START MY VEHICLE NO POWER AT ALL.. WEIRD NOTHING EVER HAPPENED LIKE THAT BEFORE. SO I GET AAA TO GIVE ME A BOOST. I GET TO MY DESTINATION. GO TO GET BACK IN MY CAR AND LEAVE. CAR DEAD NO POWER AT ALL. GET TOWED TO THE DEALER. BATTERY CHECK WAS GOOD. THEY COULDN'T FIND OUT THE PROBLEM. THEN THE CAR WOULD GET JUMP STARTED BUT WOULDN'T TURN OFF WHEN YOU PRESS THE BUTTON ONLY THE AUXILIARY THINGS WOULD POWER OFF.    THE DEALER IS TELLING ME IT'S WATER DAMAGE BUT HOW? IT'S GARAGE KEPT..",
        "vin": "3LN6L5A98HR"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/30/2019",
        "dateOfIncident": "09/15/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11259085,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL PAN LEAK RTV LEAK.  THIS MKZ IS LEAKING UP TO 1/4 QUART OF OIL A DAY.",
        "vin": "3LN6L5DC3HR"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/30/2019",
        "dateOfIncident": "09/09/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11259092,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER LOSS WHEN ACCELERATING HARD ON THE FREEWAY (65MPH+).  POWER IS SIGNIFICANTLY REDUCED, MAKING ME A HAZARD ON THE ROAD!  THE VEHICLE CONTINUES TO 'LIMP' UNTIL CAR IS TURNED OFF AND RESTARTED.  WHEN I TOOK IT TO THE GARAGE, THE VALVES WERE FOUND TO HAVE MAJOR CARBON BUILDUP AND THE #1 CYLINDER HAD A CRACKED SPARK PLUG.",
        "vin": "3LN6L5DC3HR"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/10/2019",
        "dateOfIncident": "07/08/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230663,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLS/LOSES POWER ONCE FUEL REACHES BELOW HALF TANK OF GAS. FORD HAS ISSUED TSB'S ON THIS VERY ISSUE ON MANY OF THEIR OTHER ENGINES, BUT I'VE BEEN UNABLE TO FIND A TSB FOR THIS ISSUE FOR MY VEHICLE SPECIFICALLY. HERE IS THE TSB FOR FORD FOCUS'S WITH THIS ISSUE:    FORD MOTOR COMPANY (FORD) IS RECALLING CERTAIN 2012-2018 FORD FOCUS VEHICLES WITH A 2.0L GDI OR 2.0L GTDI ENGINE. THE CANISTER PURGE VALVE (CPV) MAY MALFUNCTION, POSSIBLY CAUSING EXCESSIVE VACUUM IN FUEL VAPOR MANAGEMENT SYSTEM. TSB # 18S32.    WHEN PRESSURE IS BEING RELEASED FROM THE GAS TANK VIA THE FUEL DOOR OPENING, GAS SPRAYS OUT OF THE OPENING AND GOERS STUCK/HARDENED TO EXTERIOR OF CAR.",
        "vin": "3LN6L5FC0HR"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/29/2018",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11143842,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 LINCOLN MKZ. THE CONTACT STATED THAT WHILE DRIVING VARIOUS SPEEDS, THE HOOD AJAR WARNING LIGHT ILLUMINATED. THE CONTACT PULLED TO THE SIDE OF THE ROAD SEVERAL TIMES SINCE JUNE OF 2018 TO CHECK IF THE HOOD OF THE VEHICLE WAS OPEN AND/OR UNLATCHED. THE CONTACT STATED THAT THE HOOD WAS NOT OPEN OR UNLATCHED SEEMINGLY. IN ADDITION, THE CONTACT STATED THAT THE FAILURE WAS INTERMITTENT. CLASSIC FORD LINCOLN (8540 TYLER BLVD, MENTOR, OHIO 44060 (440) 266-3000) WAS MADE AWARE OF THE FAILURE BUT THE FAILURE WAS NOT DIAGNOSED OR REPAIRED. THE DEALER WAS MADE AWARE OF THE REOCCURRENCE TWICE BUT COULD NOT DUPLICATE THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND REFERRED THE CONTACT TO ANOTHER DEALER. THE FAILURE MILEAGE WAS APPROXIMATELY 15,000. *DT *JB",
        "vin": "3LN6L5F91HR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/03/2018",
        "dateOfIncident": "05/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099382,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE JERKS AGGRESSIVELY FROM PARK TO REVERSE THEN REVERSE TO DRIVE AT COLD START. AND FROM PARK TO DRIVE. THEN THERE IS A DELAY IN ENGAGEMENT WHERE THERE IS NO MOVEMENT AT ALL AS YOU SIT IN THE ROADWAY WITH TRAFFIC. NO CODES DISPLAYING AFTER AN APPOINTMENT WITH DEALERSHIP AND ALTHOUGH I PROVIDED VIDEOS OF ISSUE OCCURRING THEY SAY THEY CAN'T DUPLICATE ISSUE AND I MUST COME BACK, WEEKS LATER. AS SOON AS I LEAVE ISSUE OCCURS AGAIN.....",
        "vin": "3LN6L5D90HR"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/01/2018",
        "dateOfIncident": "02/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066489,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IN HEAVY TRAFFIC ON THE INTERSTATE ATTEMPTED TO CHANGE LANES AND ACCELERATE, CAR SUDDENLY LOST POWER AND THE \"SEE MANUAL\" LIGHT ILLUMINATED WITH TOOL - FORTUNATELY WAS ABLE TO COAST CAR OFF EXIT RAMP SAFELY AND PULL OVER, AT WHICH POINT THE ENGINE CHUGGED AND STALLED.  FIRST RESTART \"SEE MANUAL\" LIGHT STILL ON, SPUTTERED AND STALLED. TURNED OFF VEHICLE. 2ND ATTEMPT SAME AS 1ST. 3RD CAME ON AND RAN WITHOUT ENGINE LIGHT AND SEEMED TO REV UP HIGHER THAN NORMAL, THEN CAME BACK DOWN.  NO OTHER INDICATIONS APPEARED OTHER THAN \"NO USE OF AUTO BRAKE AVAILABLE\"",
        "vin": "3LN6L5C9XHR"
    },
    {
        "components": "SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/09/2018",
        "dateOfIncident": "01/06/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11061424,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "1-CAR STALLED AND DIED TURNING FROM PARKING LOT ONTO STREET. BARELY AVOIDING COLLISION.   1/6/2018. DEFECT IN FUEL DELIVERY.  STILL IN SHOP.  2- ODD NOISE AND SMELL WHILE BACKING UP DUE TO CRACKS  IN BRAKE PAD . 1/17/17  REPLACED 01/17/17 ( HAVE REPAIR INVOICE, NOT SURE HOW TO UPLOAD)",
        "vin": "3LN6L5D9XHR"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/30/2017",
        "dateOfIncident": "05/23/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11041485,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT",
        "vin": "3LNHM26T57R"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/02/2017",
        "dateOfIncident": "09/02/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11021168,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH THE V6 TWIN TURBO EQUIPPED FRONT WHEEL DRIVE MKZ YOU GET AN EXTRA TRILL IN ADDITION TO THE FAST ACCELLERATION . THE TORQUE STEER PROBLEM IS SO BAD THE STEERING WHEEL SNAPS OUT OF YOUR HAND AND JUMPS INTO THE ON COMMING LANE ! IF YOUR LOOKING FOR AN EXCITING CAR TO DRIVE, THIS IS IT !!!!",
        "vin": "3LN6L5CC7HR"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/13/2017",
        "dateOfIncident": "07/06/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005181,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 LINCOLN MKZ. WHILE THE VEHICLE WAS PARKED, THE CONTACT NOTICED THAT THE VEHICLE WAS NOT PARKED CORRECTLY AND DECIDED TO STRAIGHTEN THE VEHICLE. WHILE THE BRAKE PEDAL WAS DEPRESSED, THE CONTACT HEARD AN ABNORMAL DING NOISE AND THE VEHICLE INDEPENDENTLY ACCELERATED WITHOUT WARNING AND DROVE OVER A CURB. WHILE ATTEMPTING TO REVERSE THE VEHICLE OFF OF THE CURB WITH THE BRAKE PEDAL STILL DEPRESSED, THE CONTACT HEARD AN ABNORMAL DING NOISE AGAIN. THE VEHICLE INDEPENDENTLY ACCELERATED IN REVERSE AND FAILED TO STOP. AS A RESULT, THE VEHICLE ROLLED INTO TWO PARKED VEHICLES. A POLICE REPORT WAS FILED AND THERE WERE NO INJURIES. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TOWED TO HINES PARK LINCOLN (40601 ANN ARBOR RD, PLYMOUTH, MI 48170, (734) 619-6272) WHERE THE FAILURE COULD NOT BE DUPLICATED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND INFORMED THE CONTACT THAT SHE COULD FILE A SUBROGATION INSURANCE CLAIM. NO FURTHER ASSISTANCE WAS OFFERED. THE FAILURE MILEAGE WAS UNAVAILABLE. UPDATED 09/06/17*LJ    *CN",
        "vin": "3LN6L5D94HR"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/10/2017",
        "dateOfIncident": "11/06/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001069,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 LINCOLN MKZ.  CONSUMER WRITES IN REGARDS TO COMPUTER TOUCH SCREEN MALFUNCTION, HEADLIGHTS CONTROL SWITCH PROBLEMS.  *LD    THE CONSUMER STATED WITHIN THE FIRST MONTH OF PURCHASING THE VEHICLE THE TOUCH SCREEN WOULD SHUT DOWN AND REBOOT ITSELF WHILE DRIVING. THE SWITCH THAT CONTROLS THE HEADLIGHTS WAS ALSO FAULTY.  UPDATED 07/10/2017*JS",
        "vin": ""
    }
]