[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/27/2021",
        "dateOfIncident": "06/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438436,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle Leased for 36 months December, 2016.  3 miles on it. At end of lease then purchased the vehicle with a Lincoln Premier Warranty. June 2021 the passenger side dashboard began to lift from its mounting and bubbling up and sort of waffeling across the top of the dashboard then migrating toward the Airbag  assembly. Complaint made to Lincoln June 2021.  Instructed to take it to a local Lincoln Dealer. Dealer indicated repair would cost some 5 to 6 thousand dollars and that it was not covered under any warranty.   Current vehicle mileage:  17,200. Making things worse is that the Airbag is  integral to the dashboard.  Further lifting and/or peeling off would necessarily present a serious safety and possibly  functional  hazard, let alone cosmetic features.  This is a luxury SUV (Lincoln MKX Black Label) costing approximately 75 thousand dollars, by no means Chump Change. A  verbal complaint to Lincoln Customer Service late August 2021.  It was indicated this item was NOT covered under warranty and be a total cost to the owner.  Not good enough! My position is that is was a manufacturing defect. This whole issue was covered in a certified letter to Lincoln Customer Service September 15, 2021;  as yet no reply or resolution from Lincoln.",
        "vin": "2lmpj7jp3hb"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/24/2021",
        "dateOfIncident": "05/02/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434192,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Lincoln MKX.  The contact received notification of NHTSA campaign number: 20V469000 (Service Brakes, Service Brakes, Hydraulic) however, the part to do the recall repair was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The local dealer and the manufacturer were made aware of the issue. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "2lmpj6kr9hb"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/30/2021",
        "dateOfIncident": "03/30/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405537,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V469000 (SERVICE BRAKES, SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CALLED GRAPEVINE LINCOLN (801 E. STATE HWY 114, GRAPEVINE, TX 76051, (817) 442-3777) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMPJ6LR2HB"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/02/2021",
        "dateOfIncident": "07/17/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398632,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "NHTSA 20V414 RECALL DID 7/10/20 NOT REMEDIED.",
        "vin": "2LMPJ6LR2HB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/02/2021",
        "dateOfIncident": "03/02/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398634,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "NHTSA 19V-809 BATTERY CABLE MAY CHAFE & CAUSE ELECTRICAL SHORT",
        "vin": "2LMPJ6LR2HB"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/22/2021",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397311,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V469000 (SERVICE BRAKES, SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CALLED BILL COLLINS FORD LINCOLN OF LOUISVILLE (4220 BARDSTOWN RD, LOUISVILLE, KY 40218, (502) 459-9550) AND OXMOOR FORD LINCOLN (100 OXMOOR LN, LOUISVILLE, KY 40222, (502) 426-2500) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMPJ6LR7HB"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/28/2020",
        "dateOfIncident": "09/16/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361482,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT NORMAL HIGHWAY SPEED'S THE ENGINE SHUTS DOWN WITH NO THROTTLE RESPONSE OR ACCELERATION. THE ONLY OPTION IS TO COAST THE VEHICLE TO THE SIDE OF THE ROAD. AT THAT POINT THE ENGINE IS AT A VERY SLOW AND ROUGH IDLE WITH THE ORANGE SERVICE WRENCH AND WARNING LIGHTS ILLUMINATED ACROSS THE DASH. TO REGAIN A THROTTLE RESPONSE, THE OPERATOR MUST TURN THE VEHICLE OFF AND RESTART IT, THIS RESETS SOMETHING FOR A SHORT PERIOD OF TIME. THIS IS THE FIFTH TIME THAT THE VEHICLE HAS SHUT DOWN DURING NORMAL TRAVEL AND IT HAS BEEN TO THE DEALER WITH NO CODES FOUND AND NO SOLUTION. I NOW CONSIDER THIS VEHICLE TO BE VERY UNSAFE AFTER HAVING THIS FAILURE WHILE BEING IN THE LEFT LANE PASSING A TRACTOR TRAILER TRUCK.",
        "vin": "2LMPJ8LP5HB"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/02/2020",
        "dateOfIncident": "09/02/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352890,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BELT JAMS WITHOUT LETTING ME PULL IT TO PUT IT ON.",
        "vin": "2LMPJ6JR8HB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/11/2020",
        "dateOfIncident": "04/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348542,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A  2017 LINCOLN MKX. THE CONTACT RECEIVED NHTSA CAMPAIGN NUMBER: 17V226000 (ELECTRICAL SYSTEM). THE CONTACT STATED THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE VEHICLE WAS TAKEN TO MAC HAIK JACKSON CHRYSLER DODGE JEEP RAM 5395 INTERSTATE 55 NORTH FRONTAGE RD, JACKSON, MS 39206 (844) 332-1864 WHO STATED THE REMEDY PARTS WERE NOT AVAILABLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT DID NOT EXPERIENCE A FAILURE. THE MANUFACTURER WAS NOT CONTACTED. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2LMPJ8LR0HB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/02/2020",
        "dateOfIncident": "05/05/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342784,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL NOTICE 19S41. RECEIVED NOTIFICATION ON 5/2/2020 THAT PARTS ARE AVAILABLE. CONTACTED LOCAL DEALERSHIP, FELIX SABATES LINCOLN, ON 5/5/2020 TO SCHEDULE RECALL. WAS TOLD AT THE TIME, THEY HAD TO ORDER THE PART FOR RECALL AND IT WILL BE APPROXIMATELY 2-3 WEEKS. ON 6/2/2020, I MADE ANOTHER CALL ASKING FOR UPDATE ON RECALL PARTS.WAS TOLD THAT PART HAS NOT ARRIVED AND IT WILL BE ANOTHER 2 WEEKS. CALLED AGAIN ON 6/15/2020 FOR UPDATE. AGAIN WAS TOLD STILL WAITING ON PARTS. MAYBE ANOTHER 2 WEEKS. CALLED AGAIN ON 7/1/2020 AND WAS TOLD PARTS STILL HAVE NOT ARRIVED. THE GAVE THE REASONING AS COVID-19 AS THE PROBLEM FOR DELAY IN RECEIVING PARTS. CALLED LINCOLN ON 7/13/2020 AND WAS TOLD TO CONTACT LOCAL DEALERSHIP FOR UPDATE. CALLED DEALERSHIP AGAIN ON 7/29/2020 AND HAVE NOT RECEIVED A CALL BACK AS OF 8/2/2020. THIS HAS BEEN GOING ON FOR 90 DAYS AND I BELIEVE THIS TO LONG FOR THE RECALL FIX.",
        "vin": "2LMPJ8LR2HB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/22/2020",
        "dateOfIncident": "11/12/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340862,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V809000 (ELECTRICAL SYSTEM) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT CALLED RIVERSIDE FORD LINCOLN LOCATED AT 2089 RIVERSIDE DR, MACON, GA 31204, AND IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT. *BF  CONSUMER STATED SHE HAS CALLED NUMEROUS TIMES.*JB",
        "vin": "2LMPJ6LR2HB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/10/2020",
        "dateOfIncident": "11/12/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338627,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V809000 (ELECTRICAL SYSTEM) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. OLIVER FORD LOCATED AT 1001 E JEFFERSON ST, PLYMOUTH, IN 46563, (574) 935-1001, AND IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.*DT*JB",
        "vin": "2LMPJ8LR4HB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/23/2020",
        "dateOfIncident": "04/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330304,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V809000 (ELECTRICAL SYSTEM) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CALLED TO PUGMIRE LINCOLN OF MARIETTA (1865 COBB PKWY SE, MARIETTA, GA 30060; (770) 952-2261) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER HAD NOT BEEN MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMPJ6KR28B"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/05/2020",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327381,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V809000 (ELECTRICAL SYSTEM) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. BRINSON FORD LOCATED AT 1951 E. HIGHWAY 31, CORSICANA, TX 75110, (903) 874-8880, AND THE MANUFACTURER WAS NOTIFIED BUT NO ASSISTANCE WAS OFFERED. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2LMPJ6LR6HB"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/02/2020",
        "dateOfIncident": "02/20/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320003,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "10 MILES AFTER STARTING OUR 2017 LINCOLN MKX IT SUDDENLY GAVE ME THE WARNING CODE OF ERROR: VEHICLE SHUTTING DOWN NOW.  THE CAR COASTED ACROSS 5 LANES OF SPEEDING TRAFFIC. I ALMOST DIED WITH OUR SMALL CHILD IN THE CAR.  THE CAR RESTARTED FINE ON THE SIDE OF THE ROAD.  SANDERSON LINCOLN TOWED THE CAR AND DID THE BARE MINIMUM TESTS ON THE CAR PER THE MANUFACTURER STANDARDS.  I REQUESTED THEM TO DO MORE AS THIS EXACT SAME SITUATION HAS HAPPENED TO OTHER LINCOLN OWNERS MULTIPLE TIMES IN ONE CAR.  THERE HAS ALSO BEEN A RECALL ON THIS ON PREVIOUS YEARS.  THIS VEHICLE ALSO HAD SOME STRANGE ACCELERATION ISSUES WHEN WE INITIALLY BOUGHT IT AND IT WAS DISMISSED BY THE SERVICER.  LINCOLN CUSTOMER SERVICE NOW TOLD US WE ARE OUT OF LEMON LAW AND THEY CANNOT HELP US.  DUH.  LINCOLN CUSTOMER SERVICE ALSO DID SHADY THINGS TO US.  THEY WOULD CALL US AT 11PM FLORIDA TIME FROM A DUMMY PHONE LINE SO THAT THEY COULD \"SAY\" THEY CALLED US.  THE SERVICER REPLACED OUR BATTERY AND CALLED IT A DAY.  INITIALLY THE MANUFACTURER SEEMED OUTRAGED THAT THE BATTERY COMPLETELY FRIED ON THE VEHICLE DURING TESTING....THEN THEY SUDDENLY CHANGED THEIR TUNE AND SAID WE WERE OUT OF LEMON LAW IN OUR STATE.",
        "vin": "2LMPJ6KR5HB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/17/2019",
        "dateOfIncident": "08/12/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244588,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HAS CARBON MONOXIDE IN THE CABIN ON HIGHWAY DRIVING . I HAVE A CO METER AS I HAVE HAD THE CAR IN TO DEALER 7 TIMES FOR SAME ISSUE & IT IS STILL NOT FIXED. THEY NOW CLAIM IT IS OK BUT STILL HAVE 15 PPM IN 10 MINUTES OF DRIVING ON HIGHWAY AND LEVEL STILL RISING. THEY SAY THIS IS AN ACCEPTABLE LEVEL.  I OPEN WINDOWS & CO LEVEL DROPS TO 2PPM. THEN CLOSE WINDOWS & METER READS AGAIN IN 15 MIN  15PPM. THIS CAR IS NOT SAFE. & LINCOLN WILL NOT TAKE IT BACK. PLEASE CONTACT ME & TAKE CAR FOR TESTING IF YOU WISH I HAVE 3 MONTHS LEFT ON LEASE .THEN SOMEONE NEW WILL DIE DRIVING THIS NOT KNOWING THIS ISSUE.    THIS HAS BEEN GOING ON FOR 2.5 YEARS DOES NOT HAVE ISSUE IN CITY DRIVING METER DOES NOT MOVE OVER 3PPM . ONLY ON HIGHWAY DRIVING. EVEN MORE WHEN CLIMBING GRADES . LEVELS GO UP TO 15PPM IN 5-8 MIN.  THEN OF COURSE I OPEN WINDOWS. LAST FIX 8-15-19 THEY CLAIM TO HAVE FIXED A BAD BACK DOOR SEAL. DID NOT CHANGE LEVELS WHEN DRIVING ON HIGHWAY SAME .",
        "vin": "2LMPJ6LR0HB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/16/2019",
        "dateOfIncident": "08/16/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244537,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AT 50 MPH ON A MAIN HIGHWAY WHEN SUDDENLY HEARD A BELL TONE, THE CAR BEGAN TO SLOW DOWN, THE ENGINE HAD SHIFTED INTO NEUTRAL AND THE MESSAGE CENTER STATED THE ENGINE WAS SHUTTING OFF.  I STEERED TO THE SIDE OF THE ROAD AND RESTARTED THE ENGINE.  THIS HAS LEFT ME QUITE SHAKEN AS WE HAVE ONLY OWNED THIS VEHICLE FOR A LITTLE OVER 2 WEEKS AND DO NOT KNOW WHAT TO EXPECT.  WE HAVE SEEN THIS HAS OCCURRED WITH OTHER OWNERS, ALSO.",
        "vin": "2LMPJ8JR3HB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/10/2019",
        "dateOfIncident": "06/05/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231310,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAD TAKEN OUR LINCOLN FOR WARRANTY WORK ON THE NAVIGATION/STEREO AND IT WAS DETERMINED A PART NEEDED TO BE ORDERED. WE WERE TOLD WE COULD DRIVE THE CAR WHILE WAITING ON THE PART TO ARRIVE BUT WHEN WE WENT TO PICK IT UP OUR CAR WOULD NOT START. THE DEALERSHIP CHARGED THE BATTERY AND RAN IT THROUGH SOME TESTS AND EVERYTHING CHECKED OUT SO WE PICKED IT UP THE NEXT DAY. ONE DAY LATER THE VEHICLE ONCE AGAIN WOULD NOT START. DEALERSHIP ONCE AGAIN CHARGED BATTERY AND RAN IT THROUGH TESTS AND ONCE AGAIN EVERYTHING CHECKED OUT. WE DECIDED TO LEAVE THE VEHICLE AT THE DEALERSHIP UNTIL THE PART FOR THE NAVIGATION/STEREO WAS REPLACED AND THEN PICKED IT UP. WE DROVE IT ABOUT A WEEK WITH ABSOLUTELY NO PROBLEMS UNTIL I WAS PULLING OUT OF A PARKING LOT INTO  A STREET AND MY CAR LOST ALL POWER INCLUDING STEERING WITHOUT ANY WARNING. I MANAGED TO COAST INTO A SINGLE LANE SO I WASNT BLOCKING THE ENTIRE STREET. MY CAR WOULD NOT RESTART GIVING A MESSAGE ABOUT POWER FAILURE OR POWER OFF ON THE DISPLAY. I TRIED RESTARTING SEVERAL TIMES WHILE SITTING BLOCKING TRAFFIC INCLUDING TAKING THE KEY FOB OUT OF THE CAR COMPLETELY FOR A FEW MINUTES THEN PLACING IT BACK IN THE CAR HOPING SOMETHING WOULD RESET AND STILL HAD NO LUCK. A TOW TRUCK ARRIVED AND TOWED MY LINCOLN INTO THE DEALERSHIP WHERE IT STARTED RIGHT UP SO NO CODE COULD BE FOUND. THE DEALERSHIP HAS NO WAY TO FIX THE ISSUE WITHOUT CODES. I FEEL LUCKY THIS PROBLEM HAS ONLY OCCURED IN RELATIVELY CALM TRAFFIC AND NOT WHILE I WAS ON THE INTERSTATE WHERE THIS ISSUE COULD BE DEADLY.",
        "vin": "2LMPJ8LR3HB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/06/2019",
        "dateOfIncident": "07/27/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229749,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING HARD ACCELERATION, THE SMELL OF ROTTEN EGGS ENTERS THE CABIN REGARDLESS OF WHAT TYPE OF FAN IS BLOWING (AIR CONDITIONING - FRESH AIR OR RECIRCULATE). LINCOLN UNDER A TSB CLAIMED THAT THEY FIXED THE PROBLEM BY RESEALING THE REAR SEALS TO THE REAR HATCH. THE SMELL CONTINUES AND IF YOU DO RESEARCH, THIS IS A WIDESPREAD PROBLEM IN FORD EDGE'S, EXPLORER'S AND LINCOLN MKX'S. FORD DOESN'T SEEM TO THINK THAT EXHAUST ENTERING THE CABIN FOR WHICH THEY DO NOT HAVE FIX FOR IS WORTHY OF A SYSTEM WIDE RECALL. I SUSPECT THAT CARBON MONOXIDE AND OTHER POISONOUS GASES ARE ENTERING THE CABIN AND CANNOT BE GOOD FOR THE OCCUPANTS... THIS ISSUE WAS PRESENT FROM THE FIRST DAY I LEASED THE VEHICLE.",
        "vin": "2LMPJ8LP4HB"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/25/2019",
        "dateOfIncident": "01/02/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182361,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR SHUTS OFF WITHOUT WARNING WHEN YOU ARE DRIVING.  IT HAS HAPPENED 6 TIMES IN THE LAST 3 MONTHS.  THE POWER STEERING SHUTS OFF AND THE CAR COMES TO A COMPLETE STOP BEFORE YOU ARE ABLE TO TRY TO RESTART THE CAR.  THIS IS A VERY SERIOUS SAFETY ISSUE WHEN THIS HAPPENS ON A BUSY HIGHWAY AND YOU ARE IN THE FAST LANE OR MAKING A LEFT TURN ACROSS ONCOMING TRAFFIC.  I TOOK THE CAR TO A LOCAL DEALER (JERRY'S FORD OF LEESBURG VA) AND IT IS NOT SHOWING ANY MAINTENANCE CODES FOR THE ISSUE AND THEY SAID THERE IS NOTHING THEY CAN DO.  I SPOKE TO FORD (CASE# CAS-17221031-Z4L4R3) AND THEY SAID TO DRIVE THE CAR UNTIL THE ISSUE HAPPENS AGAIN AND HAVE IT TOWED BACK TO THE DEALER AS RESTARTING THE CAR WILL CLEAR THE MAINTENANCE CODE.  I TOLD FORD THIS WAS UNACCEPTABLE DUE TO THIS BEING A VERY SERIOUS SAFETY ISSUE AND I DIDN'T THINK IT WAS A GOOD IDEA TO PUT SOMEONE'S LIFE AT RISK TO TROUBLE SHOOT THE PROBLEM WITH THE CAR.  FORD HAS NO OTHER OPTIONS AT THIS TIME.  FROM RESEARCH I HAVE DONE ONLINE I CAN SEE OTHER PEOPLE HAVE HAD THIS SAME EXACT ISSUE.  NHTSA ID NUMBERS 11047965 AND 11055106 SEEM TO BE THE SAME ISSUE.",
        "vin": "2LMPJ6LR4HB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/05/2018",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11156123,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "STRONG SMELL OF EXHAUST LEAKAGE COMING FROM REAR OF VEHICLE WHEN ACCELERATING. OTHER OWNER OF MKX HAD SAME PROBLEM AND DEALER HAS CORRECTED.",
        "vin": "2LMPJ8LP1HB"
    },
    {
        "components": "VISIBILITY,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/26/2018",
        "dateOfIncident": "03/24/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081298,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 LINCOLN MKX. THE CONTACT STATED THAT WHILE DRIVING AT 55 MPH, THE SUN ROOF CRACKED WITHOUT IMPACT. THE LOCAL DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 30,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/20/2017",
        "dateOfIncident": "08/24/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024701,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 LINCOLN MKX. THE CONTACT STATED THAT THE VEHICLE WAS DESIGNED TO HAVE A TOW MODE, WHICH WOULD ALLOW THE VEHICLE TO TOW. WHILE THE 39,000 LBS VEHICLE WAS TOWING A 50,000 LBS RV, THE VEHICLE'S BATTERY FAILED. THE VEHICLE WAS DESIGNED TO GO INTO PARK MODE, WHICH LOCKED ALL FOUR TIRES WHEN THE BATTERY FAILED. ONCE THE VEHICLE WENT INTO PARK MODE, IT CAUSED THE VEHICLE TO BE DRAGGED BY THE RV FOR SEVERAL MILES. THE CONTACT STATED THAT THE PARK MODE FEATURE SHOULD NOT OCCUR SINCE THE VEHICLE WAS IN NEUTRAL WHEN IN TOW MODE. THE CONTACT CALLED CAMELBACK FORD (1330 E CAMELBACK ROAD, PHOENIX, AZ 85014; 602-635-7551) AND WAS INFORMED THAT THE VEHICLE FUNCTIONED AS EXPECTED ACCORDING TO THE DESIGN OF THE FEATURE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE, BUT THE CONTACT DID NOT RECEIVE A RESPONSE. THE APPROXIMATE FAILURE MILEAGE WAS 22,000.",
        "vin": "2LMPJ8LR5HB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/16/2017",
        "dateOfIncident": "08/16/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015815,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "STRONG SMELL OF ROTTEN EGGS IN PASSENGER CABIN. BECAME STRONGER AS VEHICLE SPEED INCREASES . A/C IN USE.",
        "vin": "2LMPJ8LR3HB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/14/2017",
        "dateOfIncident": "08/11/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11014999,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "STRONG SMELL OF ROTTEN EGGS IN PASSENGER CABIN.  BECAME STRONGER AS VEHICLE SPEED INCREASES .  A/C IN USE.  ALL PASSENGERS DEVELOPED HEADACHES.",
        "vin": "2LMPJ6LR0HB"
    }
]