[
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/24/2021",
        "dateOfIncident": "10/14/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11441571,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I was involved in a side collision accident and my car was determined to be total loss by the At-Fault's insurance company. I was lucky that my son and I came out with bruises and a few scratches but the main problem here is the airbags. It DID NOT deploy at all when it was hit. The force hit us from lane 1 all the way to lane 3 and damages to the structure near cabin was found by one of the vertified accident body shop. So yes, no airbags were deployed.",
        "vin": "2T2ZZMCA1HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/08/2021",
        "dateOfIncident": "10/08/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436026,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The car stalls while I'm driving, and it almost caused a traffic. Accident, I have been trying to contact my local lexus dealer and they keep hanging up the phone when I try to call and make appointments",
        "vin": "2T2BZMCA1HC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/21/2021",
        "dateOfIncident": "07/20/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425869,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Engine hesitation.  sometimes the engine suddenly slows down or like lossing it’s power while running on the freeway or making a turn or going uphill .  This is a very scarry situation everytime it does .",
        "vin": "2T2BZMCA2HC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/23/2021",
        "dateOfIncident": "04/23/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413555,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX450H",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 LEXUS RX450H. THE CONTACT STATED WHILE DRIVING AT VARIOUS SPEEDS, THE MAIN DISPLAY SCREEN WENT BLANK AND WOULD NOT FUNCTION PROPERLY. THE CONTACT ALSO STATED THAT ONCE THIS FAILURE OCCURRED, THE SAFETY FEATURES IN THE VEHICLE WOULD DISENGAGE AS WELL. THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO VALLEY LEXUS (4701 MCHENRY AVE, MODESTO, CA 95356) WHERE IT WAS DIAGNOSED WITH THE SCREEN NEEDING TO BE REPAIRED OR REPLACED. THE VEHICLE WAS REPAIRED HOWEVER, THE FAILURE RECURRED. THE CONTACT RELATED THE FAILURE TO AN UNKNOWN RECALL. THE MANUFACTURER WAS INFORMED OF THE FAILURE AND REFERRED THE CONTACT TO A LOCAL DEALER FOR ASSISTANCE. THE FAILURE MILEAGE WAS APPROXIMATELY 40,000. *DT",
        "vin": "2T2BGMCA5HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "04/10/2021",
        "dateOfIncident": "04/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407425,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX450H",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, VEHICLE'S COMPUTER SYSTEMS SEEMED TO SHUT DOWN ENTIRELY.  THESE INCLUDED THE MULTI-INFORMATIONAL DISPLAY IN THE INSTRUMENT CLUSTER AND THE PRIMARY INFOTAINMENT DISPLAY IN THE CENTER.  VEHICLE'S PARKING SENSORS, ADAPTIVE CRUISE SYSTEM, AND INFOTAINMENT ALL WENT OFFLINE.  THE SCREEN WENT BRIGHT MAGENTA AND THEN COMPLETELY SHUT DOWN.  VEHICLE WAS ON THE HIGHWAY DURING THE INCIDENT IN DENSE TRAFFIC WITHIN THE BAY AREA OF NORTHERN CALIFORNIA.  CAUTIOUS MEASURES WERE TAKEN, AND AFTER EXITING THE HIGHWAY AND FINDING A REST STOP, VEHICLE WAS SHUT DOWN AND REBOOTED 3X BEFORE SYSTEM CAME BACK ONLINE.",
        "vin": "2T2BGMCA5HC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/04/2020",
        "dateOfIncident": "11/11/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11377968,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX450H",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2017 LEXUS RX450H. THE CONTACT STATED THAT THE VEHICLE ACCELERATED FORWARD 120 FEET GOING BETWEEN 50 MPH, THE CONTACT DEPRESSED THE BRAKE PEDAL WHICH FAILED TO ENGAGE PROPERLY CAUSING THE CONTACT TO CRASH INTO A TREE, AS THE VEHICLE BOUNCED BACKWARDS AND CRASHED INTO THE CURB. ALL AIR BAGS DEPLOYED. THE CONTACT SUSTAINED MINOR INJURIES BRUISING TO THE RIGHT SIDE OF HER BODY. MEDICAL ATTENTION WAS CONTACTED BUT NOT NEEDED. THE CONTACT WENT TO THE HOSPITAL THE NEXT DAY FOR MINOR INJURIES. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO A COLLISION LOT WHERE THE INSURANCE ADJUSTER DEEMED THE VEHICLE A TOTAL LOSS. FREEMAN TOYOTA 2875 CORBY AVE, SANTA ROSA, CA 95407 (707) 535-2330 WAS CONTACTED AND INFORMED THE CONTACT TO CONTACT THE MANUFACTURER. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND SENT A TECHNICIAN OUT TO THE COLLISION LOT TO INSPECT THE VEHICLE. THE FAILURE MILEAGE WAS APPROXIMATELY 125,000.  INVALID VIN.",
        "vin": "272BGMCA2HC"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/04/2020",
        "dateOfIncident": "06/26/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337487,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX450H",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITIONER RADIATOR FLUID SMELL, THEN STARTED LEAKING IN PASSENGER SIDE",
        "vin": "2T2BGMCA1HC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "08/01/2019",
        "dateOfIncident": "07/26/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241031,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX450H",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 LEXUS RX450H. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 5 MPH AND ATTEMPTING TO PARK THE VEHICLE, THE VEHICLE INDEPENDENTLY ACCELERATED WHICH CAUSED THE VEHICLE TO CRASH INTO A WALL. THE AIR BAGS DID NOT DEPLOY. THE CONTACT WAS NOT INJURED. THE VEHICLE WAS NOT TAKEN TO BE DIAGNOSED. THE VEHICLE WAS STILL WAITING TO BE REPAIRED. A DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS CONTACTED AND INFORMED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 27,000. PIIR = Y.  *TR",
        "vin": "2T2BGMCA2HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/24/2019",
        "dateOfIncident": "05/15/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222036,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX450H",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY INCURRED A A $2900 REPAIR BILL FOR RODENT DAMAGE TO MY KNOCK SENSOR WIRE HARNESS ON MY 2017 LEXUS RX 450H. (MILEAGE 13,000). IT WAS NOT COVERED UNDER WARRANTY. THE WIRING INVOLVED HAS A SOY BASED COATING. THIS COATING MAKES IT A FOOD SOURCE FOR 'CRITTERS '. THE REPLACEMENT WIRING HAS THE SAME COATING MAKING THE CHANCES OF THIS HAPPENING AGAIN EXTREMELY HIGH. THE CAR IS GARAGED WITH PERIODS OF OUTDOOR TIME.   WHEN I ASKED THE SERVICE MANAGER HOW TO PREVENT THIS FROM HAPPENING AGAIN I WAS TOLD TO SPREAD MOTHBALLS ON THE DRIVEWAY AND GARAGE FLOOR AND TO STUFF BOUNCE DRYER SHEETS IN THE ENGINE COMPARTMENT. SERIOUSLY!!!!  NEEDLESS TO SAY I AM CONCERNED ABOUT THIS HAPPENING AGAIN. HOW MANY OTHER LEXUS/TOYOTA OWNERS HAVE EXPERIENCED THIS PROBLEM? I WOULD HOPE THERE WOULD BE A BETTER SOLUTION THAN MOTHBALLS AND DRYER SHEETS.   LEXUS RESPONDED WITH AN 'APOLOGY ' BUT NO MONETARY ASSISTANCE AND STATED THAT THERE ARE NO CURRENT RECALLS FOR THIS PROBLEM.",
        "vin": "2T2BGMCA9HC"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/27/2018",
        "dateOfIncident": "12/23/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163711,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX450H",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING ON INTERSTATE I - 5  IN PORTLAND, OREGON, AVERAGE SPEED OF 60 MILES PER HOUR WHEN MY BACK REAR TRUNK GLASS SHATTERED AND CONTINUE TO BREAK IN LITTLE PIECES.     BECAUSE I WAS TRAVELING ON THE HIGHWAY , II RULED OUT ANY MALICIOUS ACT, JUST THE WINDOW SHATTERING FOR KNOW REASON.",
        "vin": "2T2BGMCA8HC"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "03/12/2018",
        "dateOfIncident": "10/31/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11078703,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX450H",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 LEXUS RX450H. THE CONTACT STATED THAT THE BLIND SPOT DETECTION FEATURE INTERMITTENTLY FAILED TO FUNCTION. THERE WERE NO WARNING INDICATORS ILLUMINATED. LEXUS OF CONCORD (2001 MARKET ST, CONCORD, CA) DETERMINED THAT THE VEHICLE WAS OPERATING AS INTENDED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS APPROXIMATELY 7,893.",
        "vin": "2T2BGMCA8HC"
    },
    {
        "components": "AIR BAGS,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/22/2018",
        "dateOfIncident": "01/27/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11074358,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX450H",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "1 YEAR OLD (LESS THAN 9800 MILES) VEHICLE AC DRAIN LINE CLOG - SERVICE CENTER DIAGNOSIS CAUSE \"SPIDER WEB\" , BUT NO VISUAL PROOF.   IT SUSPECTED LIKE 2013 TOYOTA RECALL 13V-442 (ATTACHED).   DRAIN LINE CLOG CAUSE ALL INTERIOR CARPET/LINING/SOUND PROOF MATERIAL DAMAGE WITH BLACK MOLD.  LX DO NOT WANT TO COVER THIS FOR WARRANTY. I FILED MY OWN INSURANCE TO PROCEED TO FIX. REQUESTED MANUFACTURING TEST METHOD BEFORE/AFTER DRAIN LINE INSTALL AND CAR MANUFACTURING. LX DO NOT WANT TO PRESENT THE RELATED TEST RESULT.  THE REPAIR QUOTE IS OVER $9K AND ESTIMATED OVER 4-6 WEEKS DURATION.    OWNER SUSPECT THAT LX IS PUSHING RELIABILITY ISSUE (RARE CASES LIKE TOYOTA RECALL ABOVE) TO CUSTOMER SIDE SO THAT THEIR REPORT IS SHINING.    DRAIN LINE UNCLOG METHOD BY LX PROFESSIONAL WAS JUST USING COMPRESSED AIR TO CLEAN OUT THE CLOG. (THEY KEPT CHANGING THE METHOD SUCH LIKE USED NEGATIVE PRESSURE ONE END OF LINE, ETC.)  - CLOG FIX IS DONE ON 1 YEAR COMPLEMENTARY SERVICE (TOOK ABOUT 6-7 HRS. THEIR REGULAR PROMISE FOR ROUTINE CHECK UP IS LESS THAN 3 HRS).    FOUND SIMILAR PROBLEM OWNERS COMPLAINT FROM LEXUS FORUM. (ABOUT ~60 POSTING EXCLUDING MY CASE):   HTTPS://WWW.CLUBLEXUS.COM/FORUMS/RX-4TH-GEN-2016-PRESENT/869775-WATER-INSIDE-CAR-DRAIN-CLOGGED-MERGED-THREADS-4.HTML",
        "vin": "2T2BGMCA4HC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/08/2018",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072548,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX450H",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "S10 DIRECT REPLY - LETTER FROM RE ENCLOSING DOCUMENTS REGARDING CONCERNS ABOUT THE LEXUS SYSTEM AND PROBLEMS COMPUTER MONITORING SYSTEM. *LD    THE CONSUMER STATED THE MONITORING SYSTEM SEND EMAILS OF THE VEHICLE BEING UNLOCKED EVEN THOUGHT THE VEHICLE WAS LOCKED. THE VEHICLE REPORTS THAT THE DRIVER NEEDED TO TAKE A REST FOR NO APPARENT REASON, BY DISPLAYING A CUP OF COFFEE. THE CONSUMER REQUESTED THE SYSTEM BE DISCONNECTED AS IT MAY REPORT FALSE INFORMATION TO THE INSURANCE COMPANY. *JS",
        "vin": "2T2BGMCAXHC"
    }
]