[
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/04/2022",
        "dateOfIncident": "01/03/2022",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446133,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS PARKED IN A CARPORT ON FLAT GROUND. CAME OUTSIDE CAR WAS GONE .. ROLLED OUT OF THE CARPORT DOWN A 500 FT DRIVEWAY, TURNED INTO THE DRIVEWAY ACROSS THE HIGHWAY INTO A VEHICLE PARKED THERE.. ELECTRONIC BRAKING WAS  APPLIED  AND STILL ENGAGED..  PARKED THE CAR BACK INTO THE CARPORT AND TRIED PUSHING IT OUT OF THE CARPORT AND WOULDNT BUDGE... MY VEHICLE ROLLED ACROSS A BUSY HIGHWAY AND IF THE LADY DIDNT HAVE A VEHICLE PARKED THERE IT WOULD HAVE WENT INTO THE SIDE OF HER HOUSE...",
        "vin": "3MZBN1V7XHM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/08/2021",
        "dateOfIncident": "09/01/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432107,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Mazda Mazda3. The contact stated while depressing the brake pedal, the instrument panel display was intermittently inoperable. The contact stated no warning light was illuminated. The contact took the vehicle to the local dealer, where it was diagnosed with needing the instrument panel to be replaced. The vehicle was not repaired but was pending repairs. The manufacturer had been informed of the failure. The failure mileage was 40,000.",
        "vin": "JM1BN1U70H1"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/21/2021",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421734,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "52000 miles and warped brake rotors. Car stops fine. No danger just shimmy in steering wheel when stopping. This has happened way too soon. If it’s about Zoom Zoom Zoom then Mazda should be using a better quality rotor. I will be attempting to do the brake repair myself.",
        "vin": "JM1BN1L35H1"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "06/21/2021",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421735,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Power seat sliding mechanism on drivers side when actuating the forward and reverse lever is extremely noisy. The noise started at around 45000 miles when the car was 3 years old. I was able to make the repair myself after finding a tsb on nhtsa.gov.  https://static.nhtsa.gov/odi/tsbs/2018/MC-10143977-9999.pdf. Required part # can found in this tsb. The original part is defective.  Dealer will make the repair for $800 plus. You can do it yourself for $25. The actual repair is extremely simple. Also there is no reason to remove the seat bolts as done in the tsb.",
        "vin": "JM1BN1L35H1"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/07/2021",
        "dateOfIncident": "02/26/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399635,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HORN FAILED INTERMITTENTLY STARTING AFTER ODOMETER HIT 36000 MILES AND WHEN BROUGHT IN FOR REGULAR MAINTENANCE IT PASSED ALL CHECKS; MAY 2020 WHILE DRIVING WHEN STEERING WHEEL HORN WAS PRESSED THE HORN  SORT OF 'WHINED' IN AUGUST, WHILE DRIVING WHEN HORN WAS PRESSED IT  WOULD WHINE AND DONE IT SMELLED LIKE SOMETHING BURNING; NOW, IF YOU PRESS HORN IT DOESN'T WORK BUT IT SMELLS LIKE LIKE SOMETHING IS BURNING LIKE A CIGARETTE SMOLDERING( THERE IS CLEARLY SOMETHING WRONG WITH EUTH THE STEERING  OR ELECTRICAL RELAY SOMETIMES . MAZDA WON'T ASSIST WITH THIS ISSUE SAYING NOTHING IS WRONG  - THIS IS A SAFETY ISSUE CAUSE WITHOUT A HORN A CAR WILL NOT PASS A SAFETY INSPECTION.",
        "vin": "3MZBN1M34HM"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/24/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366238,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PAINT CHIPS VERY EASILY. THE HOOD IS VERY PITTED. TITANIUM FLASH PEARL. THIS PAINT COLOR WAS AN EXTRA COST TOO. SINCE INITIAL OWNERSHIP, IT HAS JUST BECOME SO BAD OVER THE OWNERSHIP PERIOD, THAT I CAN'T TOUCH IT UP ANY MORE. EXTREMELY RELIABLE CAR OTHERWISE. I PURCHASED THE CAR NEW.",
        "vin": "JM1BN1W38H1"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/13/2020",
        "dateOfIncident": "03/20/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364219,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CONTROL ARMS HAVE STARTED LEAKING WHERE THE FRONT BALL JOINTS ARE AND THE WARRANTY DEPARTMENT IS DECLINING TO COVER ANY OF THE COSTS. THEY HAVE BEEN LEAKING SINCE MARCH 2020, RIGHT BEFORE MY WARRANTY EXPIRED. THE DEALERSHIP CLAIMED TO NOT HAVE FOUND ANYTHING WRONG BUT THAT WAS NOT THE CASE. MY PERSONAL MECHANIC FOUND THEY WERE LEAKING THE WEEK BEFORE MY WARRANTY EXPIRED AND SUGGESTED I GO TO THE DEALER. THE CAR MAKES A CLUNKING NOISE GOING OVER SPEED BUMPS AND DIPS. MY CAR IS ONLY AT 42K MILES.",
        "vin": "3MZBN1K77HM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/24/2020",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360866,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BACK-UP CAMERA DOES NOT OPERATE CONSISTENTLY.  SOMETIMES IT WILL CONNECT JUST FINE. OTHER TIMES, IT WILL NOT CONNECT AT ALL, SOMETIMES IT WILL CONNECT BUT BE STREAKY AND JUMPY, MAKING IT DIFFICULT TO SEE BEHIND THE CAR.  THIS HAS BEEN ON-GOING FOR SOME TIME.",
        "vin": "JM1BN1M39H1"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/10/2020",
        "dateOfIncident": "08/06/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11344263,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM CURRENTLY STATIONED OVERSEAS AND CONTACTED MAZDA CUSTOMER SERVICE SEVERAL TIMES FOR ASSISTANCE WITH THE ISSUE. I NEVER RECEIVED A REPLY AND IT HAS BEEN ALMOST A YEAR SINCE I WAS FIRST NOTIFIED OF THE RECALL.",
        "vin": "3MZBN1V79HM"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/12/2020",
        "dateOfIncident": "04/01/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320884,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING INITIAL MOVEMENT OF VEHICLE AFTER STARTING, SUSPENSION MAKES SQUEAKING NOISE,  SPECIALLY WHEN WHEELS ARE TURNED COMPLETELY LEFT OR RIGHT. AND YOU CAN HEAR THE RUBBING SQUEAKY NOISE MORE WHEN GOING ON BUMP WITH WHEELS TURN. NOISE GOES AWAY AFTER DRIVING AND WARMED UP. MORE THAN LIKELY UPPER SUSPENSION STRUT BEARING GOING BAD PREMATURELY. THIS CAUSES WHEEL ALIGNMENT PROBLEMS.",
        "vin": "3MZBN1V77HM"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/18/2020",
        "dateOfIncident": "03/17/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318577,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 MAZDA 3 GRAND TOURING HATCHBACK    DRIVING ON A ROAD GOING 30 MPH AND HEAR WHAT SOUNDED LIKE A MUFFLED GUNSHOT RIGHT ABOVE ME. I SAW THAT I HAD GLASS RAINING DOWN THE BACK OF MY CAR, EMPTYING ONTO THE STREET AND CAUSING CARS TO SWERVE TO AVOID THE GLASS. THAT WAS WHEN I REALIZED THAT MY SUNROOF JUST EXPLODED. I PULLED OVER AND SAW THAT THE SUNROOF WAS SHATTERED WITH SPLINTERS OF GLASS EVERYWHERE. I NOTICED THAT THE SUNROOF BURSTED OUTWARD, AS IF NOTHING FELL ON IT. THERE WAS NOTHING ABOVE ME OR BESIDE ME AT THE TIME OF THE EXPLOSION. THE F-150 IN FRONT OF ME WAS GOING THE SAME SPEED 5 CAR-LENGTHS IN FRONT OF ME.    THE PIECES OF GLASS THAT FELL BEHIND MY CAR LEFT MANY SCRATCHES ON THE ROOF AND SPOILER OF MY CAR. THE ROAD I WAS DRIVING ON HAD ROLLING DIPS AT AN INCLINE, BUT NOTHING LIKE A JOLTING BUMP OR POTHOLE-LIKE BUMP.    NOTE HOW MY SUNROOF EXPLODED OUTWARD, MEANING THAT THE SUNROOF MIGHT HAVE BEEN FITTED IMPROPERLY, SQUEEZING THE GLASS INWARD. I THINK THAT WHEN I WENT OVER THE ROLLING GRADUAL BUMPS THAT THE CHASSIS FLEXED AND CAUSED THE SUNROOF TO BEND IN A DIFFERENT WAY AND EXPLODE.",
        "vin": "JM1BN1M36H1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/21/2020",
        "dateOfIncident": "02/20/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310563,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 MAZDA MAZDA3. THE CONTACT STATE THAT WHILE DRIVING AT VARIOUS SPEEDS THE ENTERTAINMENT SYSTEM FAILED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO THE DEALER ROYAL MOORE MAZDA 1380 SE RIVER RD, HILLSBORO, OR 97123 (503) 648-1153, HOWEVER THE DIAGNOSTIC TEST WAS STILL PENDING. THE VEHICLE WAS NOT REPAIRED. THE FAILURE RECURRED INTERMITTENTLY. THE MANUFACTURER WAS NOT CONTACTED NOR INFORMED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 11,000.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/25/2020",
        "dateOfIncident": "01/25/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301814,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE ONLY 38K MILES ON MY VEHICLE I WENT TO GET EMISSIONS DONE I FAILED DUE TO GAS CAP WENT TO DEALERSHIP AND FOUND OUT A LOT OF PEOPLE HAVE BEEN REPLACING THERE GAS CAPS AND THIS IS MY FIRST YEAR TO HAVE TO DO EMISSIONS TEST AND THIS IS MAKING ME WONDER WILL MY GAS CAP FAIL AGAIN NEXT YEAR OR EVERY 3 YEARS AND MY GAS CAP HAS A STRING ATTACHED TO IT SO IT HAVE NEVER HIT THE GROUND OR ANY THING OF THAT NATURE IF I HAVE TO REPLACE THE GAS CAP DUE TO INEFFICIENT SEALING OF GAS CAP TO GAS TANK I FEEL THERE SHOULD B A RECALL TO FIX THE ISSUE I HAVE FAITH IN MAZDA TO DO THE RIGHT THING I JUST WANT THEM TO RECTIFY THE SITUATION SO I DON'T HAVE TO BUY A GAS CAP EVERY YEAR OR HOW EVER LONG IT TAKES TO FAIL BUT 3 YEARS WITH A GAS CAP THAT LOOKS BRAND NEW IS UNACCEPTABLE",
        "vin": "JM1BN1L34H1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/20/2020",
        "dateOfIncident": "01/16/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300508,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE STALLS WHEN IN MOTION ON HIGHWAY.  SAME AS OTHER MODELS ON NHTSA WEBSITE.",
        "vin": "JM1BN1L78H1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/20/2020",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300606,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE STALLS; STOPS RUNNING.  LOSES TOTAL POWER WHILE DRIVING ON A HIGHWAY. THIS HAS HAPPENED AT LEAST 4 TIMES, BUT MOST LIKELY MORE.  MY MAZDA COMPUTER SHOULD HAVE RECORDED THESE INCIDENTS.",
        "vin": "JM1BN1L78H1"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/08/2019",
        "dateOfIncident": "09/06/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278910,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD MY 3RD FLAT TIRE IN A PARKING LOT, MY HUSBAND CAME TO CHANGE MY TIRE, HE USED THE BREAKER BAR HE USED BEFORE (ONLY WAY TO GET TIRE OFF) AND 4 BEARINGS BROKE, THIS LED TO ME NEEDING A WHOLE NEW HUB ASSEMBLY AND TIRE, I DON'T FEEL THAT A 2 YEAR OLD CAR SHOULD NEED A NEW HUB ASSEMBLY ESPECIALLY BECAUSE THE TIRE REPLACEMENT TOOLS THAT COME WITH THE CAR DO NOT WORK WHEN TRYING TO TAKE THE TIRE OFF MY BILL WAS OVER $600 AND THE CAR IS ONLY 2 YEARS OLD",
        "vin": "3MZBN1U79HM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/06/2019",
        "dateOfIncident": "10/10/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278539,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I LEASED THIS CAR BRAND NEW IN 2016 , SINCE THEN, I HAVE HAD TWO INCIDENTS WHICH WHILE PARKED AND IN GEAR WITH THE MECHANICAL E-BRAKE SET I HAVE WALKED OUTSIDE TO FIND MY CAR NOT WHERE I LEFT IT. THE FIRST TIME THIS HAPPENED WAS IN SEPTEMBER OF 2017 RESULTING IN SUBSTANTIAL DAMAGE TO THE PASSENGER SIDE AS WELL AS THE REAR END. I WAS LIVING ON BLOCK ISLAND AND THE CAR LET LOOSE OUT OF THE PARKING SPOT AND ROLLED BACKWARDS INTO A TREE DOING SIGNIFICANT DAMAGE TO THE PASSENGER SIDE AND COMPLETELY TAKING THE MIRROR OFF. AFTER HITTING THE TREE THE CAR THE REDIRECTED TOWARDS ANOTHER GROUP OF SMALL TRESS CAUSING DAMAGE TO THE DRIVERS SIDE WHERE IT THEN STOPPED IN A STONE WALL DAMAGING THE REAR BUMPER. AFTER A BATTLE WITH BOTH MAZDA AND THE INSURANCE COMPANY I WAS LEFT REPAIRING THE CAR MYSELF.     ON OCTOBER 10TH OF THIS YEAR I WENT OUTSIDE TO START MY CAR TO FIND IT HAD YET AGAIN RELEASED ITSELF AND WAS IN A DITCH AT THE END OF MY DRIVEWAY. CAUSING DAMAGE TO BOTH SIDES OF THE VEHICLE, THE REAR LIGHTS AND BUMPER COVER. THIS TIME THE CAR WENT DOWN INTO A DITCH SO THERE IS ALSO DAMAGE TO THE UNDERCARRIAGE AS WELL. I HAVE SPOKEN WITH MAZDA AND THEY CLAIM THERE IS NOTHING WRONG WITH THE CAR.  LUCKILY IN BOTH INCIDENTS THE CAR WAS IN RURAL AREA SO IT DIDN'T INJURE ANYONE AND IT ONLY TOOK OUT VEGETATION AND A STONE WALL.    I PAY A SUBSTANTIAL AMOUNT MONTHLY TO LEASE THIS CAR AND I NO LONGER FEEL SAFE DRIVING IT, I FEAR WHAT WILL BE BEHIND IT NEXT TIME THE E-BRAKE LETS LOOSE. I HAVE BEEN FORCED TO BRING A WHEEL CHOCK WITH ME WHENEVER I GO INTO THE CITY SINCE THE INCIDENT IN 2017.  DUE TO THE INSURANCE COMPANY DELAYING ANY PROGRESS ON FIXING THE CAR I HAVE BEEN FORCED TO RENT A CAR PAYING OUT OF POCKET THE EXPENSE SO THAT I AM SAFE ON THE ROADS. ANY HELP OR DIRECTION IN THIS MATTER WOULD BE GREATLY APPRECIATED. I HAVE PHOTOS AND QUOTES I CAN OBTAIN FROM THE GARAGE IF NECESSARY.",
        "vin": "JM1BN1L37H1"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/27/2019",
        "dateOfIncident": "09/27/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258570,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM NOTICING EXCESSIVE PAINT CHIPS ON THE HOOD AND FRONT FENDERS OF MY 2017 MAZDA 3.  THE PAINT IS: SOUL RED CRYSTAL PAINT. I HAVE NOT NOTICED OR HEARD ROAD DEBRIS HIT THE CAR.  THE CAR HAS ABOUT 23000 MILES. THE PAINT SEEMS VERY THIN.  I HAVE NOTICED OTHER MAZDA OWNERS WITH THIS PAINT HAVING SIMILAR ISSUES.  PERHAPS THESE CARS SHOULD BE RECALLED AND BE REPAINTED. I HAVE SUBMITTED A PHOTO - THERE IS ONE DENT RIGHT FRONT FENDER FROM A ROCK THAT DID HIT THE CAR OVER A YEAR AGO, BUT THE CHIPS WERE NOT THERE.",
        "vin": "3MZBN1W3XHM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/28/2019",
        "dateOfIncident": "07/09/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240160,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR BRAKES SEVERLY CORRODED AND NEAR FAILURE BETWEEN 13000 AND 17000 MILES DESPITE ROUTINE WASHING. REAR BRAKE NOISES BEGAN EARLY IN THIS MILEAGE RANGE THEN ESCALATED ALONG WITH REDUCED STOPPING POWER. DEALER REPLACED BRAKES AT 17000 MILES (COST NOT COVERED) AND STATED REAR PADS WORN TO 3/32 AND 4/32 AND FROZEN IN THE CALIPERS ALONG WITH DEEP SCORING ON ROTOR SURFACES. CO WORKER WITH THE EXACT SAME CAR HAD THE EXACT SAME ISSUE/DIAGNOSIS/FIX/MILEAGE, YET SOMEHOW THEY COVERED HIS REPALCEMENT...",
        "vin": "3MZBN1M39HM"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/18/2019",
        "dateOfIncident": "05/29/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220822,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALERSHIP UNABLE TO PERFORM SAFETY RECALL.  THE FOLLOWING IS A COPY I HAVE SENT TO THE DEALERSHIP AND MAZDA USA.    I HAVE BEEN ATTEMPTING TO HAVE SAFETY RECALL REPAIR ON MY VEHICLE SINCE 05/12/19. I RECEIVED A SAFETY RECALL 3219D LETTER FOR MY 2017 MAZDA3. I SCHEDULED AN APPOINTMENT AT BILL HOOD MAZDA ON 05/29/19 @8:00AM. UPON ARRIVAL AT THE DEALERSHIP, I WAS TOLD THEIR COMPUTER TO RECALIBRATE THE RELAY FOR THIS RECALL WAS BROKEN AND I WOULD NEED TO RESCHEDULE. LES IN THE SERVICE DEPARTMENT TOLD ME THAT IT WAS ORDERED AND WOULD BE IN BY THE NEXT TUESDAY, 06/05/19. I WENT HOME AND ON 06/09/19 I RESCHEDULED FOR 06/12/19 @8:15AM, WITH A REQUEST THAT IF THEY WERE UNABLE TO PERFORM THE RECALL REPAIR TO PLEASE CONTACT ME AND I PROVIDED MY PHONE NUMBER AND EMAIL ADDRESS. I ONCE AGAIN ARRIVED AT THE DEALERSHIP ON 06/12/19 @8:15AM AND WAS TOLD BY LES IN THE SERVICE DEPARTMENT THAT THEY COULD NOT PERFORM THE RECALL REPAIR BECAUSE OF THEIR COMPUTER WAS OBSOLETE. I ASKED WHY I WAS NOT CALLED TO RESCHEDULE, HE TOLD ME HE DID NOT SEE THE APPOINTMENT. HE TOLD ME THAT HE HAD NO IDEA AS TO WHEN THE NEW COMPUTER WOULD BE IN SO I COULD NOT RESCHEDULE. ON 06/13/19, I EMAILED THE DEALERSHIP WITH THE SAME INFORMATION LISTED ABOVE, ASKING ABOUT THIS RECALL REPAIR COMPUTER, BUT HAVE NOT RECEIVED A RESPONSE. I AM FRUSTRATED WITH THE LACK OF CUSTOMER CONCERN FOR THIS WINDSHIELD WIPER SAFETY RECALL. I LIVE IN SOUTH LOUISIANA, WHERE AFTERNOON THUNDERSTORMS ARE DAILY ON MY COMMUTE HOME. WE CURRENTLY OWN TWO VEHICLES, BOTH ARE MAZDA3 AND PURCHASED NEW, IN 2010 AND 2017. I CANNOT UNDERSTAND WHY YOUR SITE MAZDARECALLINFO.COM IS REDIRECTING ME TO BILL HOOD MAZDA TO SCHEDULE APPOINTMENTS IF THEY DO NOT HAVE THE CORRECT EQUIPMENT TO PERFORM THE SERVICE. CAN YOU PLEASE LET ME KNOW WHEN MAZDA CAN REPAIR MY VEHICLE?",
        "vin": "JM1BN1V76H1"
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/03/2019",
        "dateOfIncident": "05/03/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205569,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "IT HAS BEEN MORE THAN ONE MONTH SINCE A RECALL HAS BEEN PLACED ON MY MAKE AND MODEL, NEITHER THE MANUFACTURER OR DEALER OF MY VEHICLE ATTEMPTED TO CONTACT ME TO INFORM OF THIS RECALL SO I CAN TAKE NECESSARY MEASURES. I JUST SO HAPPENED TO GOOGLE 'MAZDA 3 WINDSHIELD WIPERS' AND STUMBLED ACROSS AN ARTICLE. THIS IS UNACCEPTABLE AS THIS COULD END UP BEING DANGEROUS.",
        "vin": "JM1BN1U72H1"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/23/2018",
        "dateOfIncident": "12/04/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163194,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WROTE THE FOLLOWING DESCRIPTION OF WHAT HAPPENED TO MAZDA CUSTOMER SERVICES:     ON THE EVENING OF DECEMBER 4, 2018, I WAS ON MY WAY HOME FROM WORK. I WAS DRIVING 75 MPH, THE POSTED SPEED LIMIT FOR THAT STRETCH OF TEXAS HIGHWAY. THE SURFACE OF THE ROAD IS BRAND NEW AND DRIVING CONDITIONS WERE IDEAL.     AT APPROXIMATELY 6:10 PM, ABOUT 10 MILES FROM HOME, THERE WAS A LOUD THUD AND MY CAR DROPPED AND LURCHED TOWARD THE CENTER LINE. I THOUGHT I HAD HIT SOMETHING HUGE, AND EXPECTED TO FIND SIGNIFICANT DAMAGE TO MY CAR AND A SHREDDED TIRE. I MANAGED TO KEEP THE CAR UNDER CONTROL AND AVOID BEING HIT, AND WITH A SOUND OF GRATING METAL, MOVED OVER TO THE SHOULDER.     TO MY SURPRISE, THERE DIDN'T SEEM TO BE ANY DAMAGE TO THE CAR. NO OTHER VEHICLES HAD TO SWERVE AROUND ANYTHING IN THE ROAD. THERE WAS NO DEBRIS IN THE ROAD. I CALLED A WRECKER SERVICE TO CHANGE THE TIRE. HE DISCOVERED THAT THE FRONT DRIVERS SIDE WHEEL WAS SPLIT IN HALF, AND SAID THE WHEEL NEEDED TO GO BACK TO THE DEALERSHIP.    MAZDA CUSTOMER SERVICE FOLKS SOUNDED SYMPATHETIC BUT TOOK OVER A WEEK AND SEVERAL CALLS TO TOW THE CAR TO A MAZDA DEALER. THEY INSPECTED THE CAR AND DETERMINED THAT I HAD HIT SOMETHING, THUS THEY WOULD NOT COVER ANY OF THE COST. THERE WAS NO EVIDENCE OF ROCK, WOOD, OR ANIMAL IN THE TREAD - I REMAIN CONVINCED THAT THE RIM SIMPLY BROKE WHILE I WAS DRIVING. NO METALLURGIST LOOKED AT THE SPLIT RIM, AND THE OTHER THREE RIMS WERE ONLY VISUALLY INSPECTED.    I PAID $601 FOR A NEW WHEEL AND TIRE BUT AM CONCERNED ABOUT POTENTIAL ACCIDENTS CAUSED BY METAL WHEEL RIMS BREAKING. I HAVE PHOTOS AND THE BROKEN WHEEL RIM AND TIRE.",
        "vin": "3MZBN1L76HM"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES,ENGINE",
        "crash": true,
        "dateComplaintFiled": "08/04/2018",
        "dateOfIncident": "07/08/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115710,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE BEGAN REVVING HIGH AS I TOOK MY FOOT OFF THE ACCELERATOR AND APPLY THE BRAKES AS I APPROACHED A TRAFFIC RED LIGHT.  I PUT THE CAR IN NEUTRAL TO SEE IF BY TAPPING THE GAS PEDAL IT WOULD STOP REVVING.  IT DID NOT.  WITH MY FOOT ON THE BRAKE PEDAL TO THE FLOOR, I PUT THE CAR IN DRIVE AND THE CAR SPED FORWARD DESPITE MY FOOT ON THE BRAKE PEDAL.  I WENT THROUGH A RED LIGHT TRYING TO MAKE A LEFT TURN ON TO A MAJOR HIGHWAY, CROSSED A MEDIAN STRIP, CLIPPED A VEHICLE IN THE REAR, TURNED THE CAR TRYING TO AVOID COLLISIONS WITH OTHER CARS, WENT OFF THE ROAD HITTING UTILITY POLE AND TRANSFORMER BOX ON THE OPPOSITE SIDE OF THE HIGHWAY, FINALLY COMING TO REST WITH AIR BAGS DEPLOYED ON THE DRIVER SIDE.  THIS HAPPENED ON JULY 8, 2018, A SUNDAY AFTERNOON.  NO ONE WAS HURT, BUT OBVIOUSLY SHAKEN AND CONFUSED HOW MY BRAKES COULD FAIL ON A CAR RECENTLY IN FOR ITS 10000 MILE SCHEDULED MAINTENANCE 9 DAYS PRIOR.  RESEARCHING THIS ON LINE FOUND SIMILAR INCIDENTS OF THIS OCCURRING WITH MAZDA 3 VEHICLES AND OTHER MANUFACTURERS (I.E. TOYOTA).  REFERRED TO AS SUDDEN UNINTENDED ACCELERATION (SUA).  THERE ARE MANY REPORTED CASES OF SUA, SOME WHERE DRIVERS ARE AT FAULT.  MY CASE WAS CLEARLY MECHANICAL DEFECT RELATED.",
        "vin": "3MZBN1K76HM"
    },
    {
        "components": "STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "06/20/2018",
        "dateOfIncident": "06/11/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102914,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS GOES WITH PREVIOUS FORM TGE OTHER THING IS THAT MY DOOR FLEW OF ON FREEWAY RIGHT BEFORE IT JERKED LIKE STATED IN OTHER FORM MY CAR HAD JUST BEEN FIXED FROM SAME DOORS AND NOW ONE FLIES OF CAR DOINGB80 MILES PER HR ON I15 IN NEVADA CAUSIN THE ACCIDENT I HAD I FEEL REPAIR SHOP NEEDS TO COVER THE COST OF ACCIDENT",
        "vin": "3MZBN1U72HM"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "06/20/2018",
        "dateOfIncident": "06/11/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102912,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SO I HAVE VISITED MAZDA DEALER IN CERRITOS. FEW TIMES SINCE I PURCHASED CAR I HAVE BEEN TELLING THEM ABOUT MY CAR JERKING TO THE SIDE WHILE DRIVING ITS LIKE A WOBBLE EFFECT THEY SAID CAR WAS FINE I INSISTED TO GET IT CHECKED AND THEY DIDNT SONI WENT BACK AND TOLD THEM I WANTED FULL CHECK THEY SAID FOR WHATBITS A NEW CAR I SAID I DONT FEEL SAFE WITH MY CAR JERKIN TO SIDE AND MAKING ME COME CLOSE TO SIDE SWIPE OTHER CARS. ON THE FREEWAY THEY CHECKED IT MILDLY I SAY THAT BECAUSE THEY DIDNT LAST NOT EVEN AN HOUR WHEN I GOT CAR RETURNED TO ME THE PROBLWM CONTINUED INRECENTLY GOT AN A ACCIDENT DUE TO THIS JREKIN CAR KEPT DOING WHAT DONI DO NOW I DONT FEELBITS OK TO LETBTHIS DEALER CONTINUE WORKINGBIF THEY ARENT CHECKING CARS CORRECTLY",
        "vin": "3MZBN1U72HM"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/15/2018",
        "dateOfIncident": "05/31/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101965,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN FROM A FULL STOP, THEN WITH WHEN NEEDING TO ACCELERATE QUICKLY, THERE IS A DELAY IN ENGINE RESPONSE.  USUALLY HALF A SECOND TO ONE FULL SECOND DELAY IN ENGINE RESPONSE BEFORE IT STARTS TO ACCELERATE.  ONE ONE OCCASION, IT DID NOT ACCELERATE AT ALL.  I HAD TO THEN LET MY FOOT OFF OF THE GAS PEDAL AND PRESS DOWN ON THE GAS AGAIN FOR IT TO FINALLY ACCELERATE.    THIS WAS VERY DANGEROUS FOR EXAMPLE WHEN I WAS ON THE FREEWAY.  MY LANE WAS STOP-AND-GO TRAFFIC, BUT THE LANE TO MY RIGHT WAS OPEN, SO I WAITED TILL IT WAS CLEAR THEN TURN THE STEERING WHEEL TO THE RIGHT AND PRESS THE GAS PEDAL.  WELL TO MY SURPRISE IT DID NOT ACCELERATE AND CONSISTENTLY MOVED AROUND 5 MPH, WELL THERE WAS A CAR COMING IN THAT LANE AND MY CAR WOULD NOT ACCELERATE SO I LET OFF MY FOOT AND PRESS THE GAS AGAIN AND IT STARTED TO ACCELERATE.",
        "vin": "JM1BN1W3XH1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/29/2018",
        "dateOfIncident": "07/15/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11098712,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN STARTING THE CAR SMART CITY BRAKE AMBER WARNING LIGHT AND SMART CITY AMBER FAULT LIGHT WILL SOMETIMES APPEAR ON THE DASH AFTER CAR SITS IN HOT SUN AND REMAIN ON AFTER CAR IS STARTED AND IS BEING DRIVEN. THE WARNING LIGHTS MAY OR MAY NOT DISAPPEAR WHILE THE CAR IS BEING DRIVEN. THE FIRST TIME THIS OCCURRED WAS SOON AFTER PURCHASING THE CAR MAY 25, 2017. THE DEALER SERVICE DEPARTMENT WAS NOTIFIED AND AFTER INVESTIGATING REPLACED THE FORWARD SENSING CAMERA (FSC) AND PERFORMED A DYNAMIC AIMING PROCEDURE SYSTEM OPERATION. NO FURTHER SIMILAR PROBLEM WAS ENCOUNTERED UNTIL MAY, 2018. THE DEALER SERVICE DEPARTMENT WAS AGAIN NOTIFIED OF THE REPEAT PROBLEM. AFTER AGAIN INVESTIGATING THE PROBLEM THE SERVICE DEPARTMENT INFORMED ME \"....THE FSC CANNOT                     OPERATE NORMALLY DUE TO HIGH TEMPERATURES, THE SYSTEM     FUNCTIONS RELATED TO THE FSC ARE TEMPORARILY STOPPED AND   THE WARNING LIGHTS ARE DISPLAYED. HOWEVER, THIS DOES NOT   A INDICATE A MALFUNCTION.\" TSB15-006/17 (NHTSA ID:101234390) WAS CITED. ADDITIONAL WRITTEN INFORMATION FROM MAZDA WAS ALSO SUPPLIED BY THE DEALER SERVICE DEPARTMENT WHICH STATED \"THE WARNING LIGHTS WILL TURN OFF WHEN THE FSC COOLS DOWN BY TURNING ON THE AIR CONDITIONER OR PARKING IN THE SHADE\" ALL OF THE ABOVE INFORMATION INDICATES THE SYSTEM FUNCTIONS RELATED TO THE FSC ARE TEMPORARILY STOPPED BUT THERE IS NO MALFUNCTION AND THE SYSTEM NEEDS TO BE COOLED DOWN. THIS MAYBE TRUE BUT IS IT ALWAYS TRUE OR IS IT A SAFETY HAZARD MALFUNCTION DUE TO FAILURE OF THE FSC FOR A REASON OTHER THAN A HEAT.     COPIES OF THE REPAIR INVOICES CAN BE MAILED TO YOU IF NEEDED.",
        "vin": "3MZBN1V79HM"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/03/2018",
        "dateOfIncident": "05/03/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091527,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MAKING A RIGHT TURN FROM A STOP ONTO A FREEWAY SIDE STREET. IT IS A 50 MPH ZONE.  ABOUT HALFWAY THROUGH THE TURN ON LIGHT THROTTLE AT ABOUT 10 MPH, I GIVE IT THE GAS AND NOTHING HAPPENS. THE ENGINE IS STILL RUNNING BUT WILL NOT ACCELERATE.  I LET OFF THE THROTTLE COMPLETELY THAN REAPPLY IT. NOW IT ACCELERATES. GAS TANK IS SLIGHTLY OVER 1/4 FULL.    THIS HAS BEEN PREVIOUSLY REPORTED TO MAZDA AS IT HAS OCCURRED A FEW TIMES BEFORE. THEY HAD INSTALLED A RECORDING DEVICE IN THE CAR FOR A WHOLE MONTH BACK IN JANUARY THIS YEAR. TODAY WAS THE FIRST TIME SINCE BEFORE THE BLACK BOX THAT THIS PROBLEM CAME BACK.    THE CAR WAS PURCHASED IN AUGUST 2017.",
        "vin": "3MZBN1L72HM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/27/2018",
        "dateOfIncident": "08/09/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075322,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WE LEASED THIS CAR IN JULY OF 2017. A COUPLE WEEKS LATER ON 8/9/17 MY DAUGHTER WAS DRIVING THE CAR. AS SHE APPROACHED THE EXIT RAMP ON A HIGHWAY NEAR OUR HOUSE SHE FELT WHAT SHE THOUGHT WAS ANOTHER CAR HITTING HER IN THE REAR. SINCE NO VEHICLES STOPPED SHE DROVE THE CAR TO A CORNER NEAR OUR HOUSE WHILE HEARING A LOUD GRINDING SOUND COMING FROM THE REAR OF THE VEHICLE.    WHAT HAD HAPPENED WAS THAT THE DRIVER SIDE REAR BRAKE UNIT WAS MISSING 1 OF THE 2 BOLTS THAT HELD IT IN PLACE AND THE SECOND BOLT HAD DISLODGED TO THE POINT WHERE IT WAS NO LONGER ABLE TO HOLD THE BRAKE UNIT IN PLACE. LUCKILY THE UNIT DID NOT COMPROMISE THE INTEGRITY OF THE BODY WHEN IT WAS DISLODGED AT 55 MILES PER HOUR AND MY DAUGHTER DID NOT LOSE CONTROL OF THE VEHICLE. HOWEVER, THIS WAS A BRAND-NEW CAR THAT WAS DELIVERED TO OUR DEALER FROM ANOTHER DEALER AND PREPARED FOR US BY OUR DEALER, HUNTINGTON MAZDA.    WE ASKED THEM TO ENGAGE MAZDA TO FIND OUT HOW THIS COULD HAVE HAPPENED. IT APPEARS THAT NO INVESTIGATION ACTUALLY TOOK PLACE AND THE VEHICLE WAS FIXED AND RETURNED TO US AFTER ABOUT 3 OR 4 WEEKS DUE TO PARTS AVAILABILITY. I HAVE A GREAT CONCERN THAT THIS ISSUE MAY NOT BE LIMITED TO OUR VEHICLE AND THAT SOMEONE COULD BE IN DANGER. THE QA MARKINGS APPEAR WHERE THE BOLTS SHOULD HAVE BEEN, SO THIS DEFECT OCCURRED EITHER AT THE DEALER OR A RESULT OF NORMAL OPERATION DISLODGING THE BOLTS.    THE ATTACHED IMAGES SHOW THE BRAKES FROM THE INSIDE AND OUTSIDE. I ALSO CREATED A SECOND COPY OF EACH OF THE PICTURE WITH THE AREA IF INTEREST HIGHLIGHTED.",
        "vin": "3MZBN1M30HM"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/31/2018",
        "dateOfIncident": "01/17/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066024,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE SHUT DOWN IN TRAFFIC AND WOULD NOT COME OUT OF DRIVE. MAZDA DEALER SERVICE TOLD ME TO DISCONNECT BATTERY TO RESET SYSTEM. I THINK THIS IS SAFETY ISSUE. PLEASE CONTACT ME WITH ANSWER",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/24/2018",
        "dateOfIncident": "01/23/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064669,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I DROVE ALONG A MAJOR ROUTE, I CAME TO A STOP LIGHT. WHEN ITTURNEDGREEN, I PROCEEDED TO DRIVE FORWARD AND FELT CAR PULLING TO RIGHT SIDE.  AS MY SPEED INCREASED TO 25, THE PULL BECAME STRONGER BUT,  I PROCEEDED SLOWLY AND REMAINED UNDER 30MPH. AFTER DRIVING APPROXIMATELY 1 MILE, I HEARD THREE TONE ALERTS FOLLOWED BY LOW PRESSURE WARNING LIGHT.  PULLED OVER, CALLED AAA WHO  REPLACED FLAT TIRE. THE SIDEWALL WAS SPIDERED PATTERN AND BLOWN.  THIS MORNING,  I NOTICED THAT ANOTHER TIRE HAS THAT SAME SPIDER PATTERN BUT IS NOT BLOWN OUT.  I CONTACTED DUNLOP TO INQUIRE IF THERE ANY RECALL AND WAS INFORMED THERE WAS NOT.  I WAS TOLD THESE TIRES DUNLOP SP SPORT 5000 215/45R/18 89W HAVE REINFORCED SIDEWALLS THAT PREVENT BLOWOUTS AND FLATS; I INQUIRED IF THE GRADE OF RUBBER COULD WITHSTAND  THE SALT COVERED ROADS OF NEW ENGLAND BECAUSE  I HAD WITNESSED DAMAGE TO RUBBER SOLES OF BARETRAP BOOTS WITH A SIMILIAR SPIDER PATTERN A FEW WINTERS AGO CAUSED FROM ROCK SALT. I WAS TOLD THEY ARE UNAWARE THAT ROCK SALT COULD BE A CAUSE OF DEGRADE IN RUBBER . IN ADDITION, IT HAD BEEN RAINING HEAVILY AT TIMES AND ACCORDING TO MAZDA, CERTAIN CONDITIONS WILL PUSH/SHIFT LOAD TO FRONT OF VEHICLE.  WHETHER THIS ADDED LOAD CAUSED THE TIRE TO BLOW AND ADD SPIDER PATTERN TO TIRE STILL ON VEHILCE  BUT NOT FLAT (PUCTURED BELIW) OR THE MANUFACTURER SELECTED TIRES THAT CAN'T CARRY THE LOAD, OR THE  TIRES ARE DEFECTIVE",
        "vin": "3MZBN1M34HM"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/15/2017",
        "dateOfIncident": "12/15/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054988,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE THE AIR BAG WARNING LIGHT BEGAN TO BLINK ON THE DRIVER DISPLAY. AFTER REACHING MY DESTINATION AND AFTER TURNING OFF THE VEHICLE AND TURNING IT BACK ON THE AIR BAG WARNING LIGHT DISAPPEARED AND DID NOT COME BACK ON.",
        "vin": "3MZBN1U76HM"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/12/2017",
        "dateOfIncident": "03/11/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985045,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD HAS MULTIPLE RIPPLES FROM THE DRIVER AND PASSENGER SIDE PILLARS TO 6 INCHES IN.  THIS CONDITION CAUSES EYE STRAIN WHILE DRIVING.  I HAVE TO LOOK OUT OF THE SIDE WINDOW TO CLEAR/ RESET MY EYES, THEN, LOOK THOUGH THE RIPPLED WINDSHIELD.  THIS ISSUE HAS BEEN GOING ON SINCE DAY 1 (2 MONTHS IN) AND NO RESOLUTION.    POTENTIAL CAUSE FOR ACCIDENT DUE TO HAVING TO NOT FACE FORWARD.  ISSUE OCCURS AT ANY STAGE OF OPERATION, DAY TIME IS WORSE THAN NIGHT.  WEATHER CONDITIONS NO NOT CHANGE ISSUE.",
        "vin": "MZBN1V71HM1"
    }
]