[
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "04/05/2022",
        "dateOfIncident": "04/02/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459654,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The armbar connected to the front driver's side tire locked up during a left turn and then disconnected from the tire.  I had no control over the steering and the car was still moving.  I had two choices, run into the curb to stop the car or go over into a ditch about 30 feet down.  When I ran into the curb it busted the tire and damaged my front bumper.  I could've been seriously injured, injured someone else, died, or killed someone because I had no control over the steering. This is very dangerous and I have seen a few other people report similar instances like mine.  the vehicle is currently at the Ancia Nissan in San Antonio and waiting for my insurance company to look at it.  The mechanic said it may be totaled but he wasn't sure.  There was no warning signs or anything.  I am going to get to the bottom of this our lives were put in danger and I don't want this to happen to anyone else.",
        "vin": "1N4AL3APXHN"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/22/2022",
        "dateOfIncident": "02/01/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457836,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "There is a headlight system error that pops up on dash",
        "vin": "1N4BL3APXHC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/10/2022",
        "dateOfIncident": "03/09/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455966,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Since October 2021 I have been taking my car back and forth to the Nissan Dealer Bob Bell in Baltimore MD for a check engine light. They fix parts each time and the light still came back on . As of today this will be my 6th time taking the car back. I don’t feel safe driving it and don’t know if this light caused other issues that may put me and other drivers in immediate danger. I have anxiety that it may break down on the road while driving and I won’t have a way to get out of harms way. I don’t know what else to do. It’s my only means of transportation.",
        "vin": "1N4AL3AP7HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/04/2022",
        "dateOfIncident": "01/07/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455193,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I was in the middle of an intersection turning left, and the car stalled and I was almost hit by oncoming traffic. The car has problems accelerating and shifting gears. It will get up to 4 rpm's and not shift. This has happened several times, and is a safety risk . Fortunately, I was never hit. Nissan says I need a need CVT transmission. There's a class action suit filed for this model and the CVT transmission. However, since my car is 103, 000, Nissan will not replace unless 85,000. This is a manufacturer defect that needs fixed ASAP before someone gets in a terrible crash!",
        "vin": "1n4al3ap2hc"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/05/2022",
        "dateOfIncident": "02/01/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450604,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving 2017 Altima (48000 miles)in the city Airbag light came on and stayed on.",
        "vin": "1N4AL3AP7HN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "02/02/2022",
        "dateOfIncident": "01/24/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449843,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HOOD LATCH RECALL 2017 NISSAN ALTIMA SR- CAUSED ACCIENT AND TOTAL DAMAGE TO MY CAR!!!  1.24.22 my 18yr daughter was getting on the on ramp to interstate 75 south, accelerating to merge onto the interstate. The hood flies up, breaking the windshield, hitting the roof, where the interior light falls smacking my daughter in the face, causing her to veer off the road, where she took out a reflector on the side of the ramp, where it damaged my front end and the car then sliding to a crashing stop over a steel grate or utility box in the ground, where it snatched the under carriage apart- my car is totalled! I have since filed a claim with Nissan and gap insurance apprasier should come to the house tomorrow. I really feel like we need a lawyer. Please let me know your thoughts. I work nights at the hospital from 7p to 7am. I can be reached by text or email as well.   I have reported this to Nissan file number is 45641261, I have spoke with several reps since the accident and no one seems to want to do anything and has referred my case to a reginal dept., but I work nights 7p-7a and during the days I am sleeping, they leave a voicemail to notify me of there call and that's it! same customer number to call back into to have the same cycle repeated!  I have GAP insurance on the vehicle and have an appraiser coming to the house tomorrow between noon/2am.   no POLICE WERE CALLED, I DID A POLICE REPORT ON LINE- I DID NOT GO THRU MY  INSURANCE AS I FEEL THIS SHOULD BE SOLVED BY NISSAN! I SHOULD NOT HAVE TO PAY DEDUCTIBLES FOR REPAIR TO MY CAR ON A RECALL!  THIS ACCIDENT HAPPEND WITH OUT WARNING! NO WARNING SIGNS!!",
        "vin": "1N4AL3AP7HC"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/29/2022",
        "dateOfIncident": "09/19/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449354,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I have a clunking from the rear of my 2017 nissan altima when going over bumps and the front end of the car is also very unstable going around curves at highway speeds, the clunking is heard after going over bumps or dips in the road and it's the same noise that generated recall p9324 and I have attempted to get it fixed at the dealer to no prevail",
        "vin": "1N4AL3AP2HC"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/22/2022",
        "dateOfIncident": "01/21/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448470,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Twice in one day, one hour apart, the xar would not accelerate, then accelrated wildly. First time, pulling onto a road from a stop, it hardly sped up, I put the pedal to the floor, and it did not increase speed as expected, in fact hardly at all. I was trying to merge with oncoming traffic so this would have caused a wreck if there wasn't as much space between me and the oncoming traffic. I kept trying to accelerate, pushing the pedal, letting it out, pushing it again, and it continued to not accelerate as expected. I then pulled off the road to let traffic pass and see if it revved in park, and it sounded fine. After traffic cleared, I tried again, and thia ti.e it functioned normally. I drove about 50 miles, stopped somewhere, and ha no problems.  When I left that place, trying to pull onto the road and merge with oncoming traffic,  it happened again. I once again tried to push the pedal further to speed up, and at first it would not, but then it SUDDENLY accelerated and I fishtailed in a busy road. Luckily there was not an accident. I let off the pedal and gained control, and it drove normally after that.",
        "vin": "1n4al3ap5hn"
    },
    {
        "components": "ENGINE",
        "crash": true,
        "dateComplaintFiled": "01/19/2022",
        "dateOfIncident": "08/16/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448095,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The transmission on my 2017 Nissan Altima is stalling. It stall when I accelerate and in the middle of driving. This is a safety issue and has caused me to be in a recent accident.",
        "vin": "1N4AL3AP8HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "01/04/2022",
        "dateOfIncident": "01/03/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446235,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The BACKUP CAMERA LENSE has become blurry and makes it harder to recognize objects. My vehicle has only 38K + miles on it. I own a 2017 1/2 Nissan Altima SV.",
        "vin": "1N4AL3AP0HC"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "12/19/2021",
        "dateOfIncident": "12/18/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444355,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I was on my way to work on Saturday 12/18 and as I was making a left turn my steering wheel locked and I actually hit a curb hopped it and went back into traffic. My axel broke on left hand side and blew my tire. Thankfully my children weren't in the car and a police officer happen to see the whole thing. I couldn't get my steering wheel to turn or come unlocked. That was very dangerous, and I could have been seriously injured and someone else also. I didn't get any warning lights or anything to this was going to happen. Clearly from the complaints this has been ongoing and there still hasn't been a recall to get the issue fixed or resolved. My insurance company will be looking into it.",
        "vin": "1n4al3ap6hc"
    },
    {
        "components": "WHEELS",
        "crash": true,
        "dateComplaintFiled": "12/14/2021",
        "dateOfIncident": "12/12/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443809,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "On Sunday December 12th just north of Birmingham on I-65 there was a foreign object in the lane (appeared to be a fairly large piece on concrete).  It was between 8-9p thus dark.  Due to the amount of traffic driver could not swerve to avoid the object.  The object bent the front driver wheel which resulted in needing to replace the driver front wheel and tire (OEM Nissan Wheel and cover, third party recycled tire).  The object in the road could have caused far worse damage and bodily injury.  We do not have a receipt for the $60.00 used tire.",
        "vin": "1N4AL3AP3HC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/06/2021",
        "dateOfIncident": "12/06/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442901,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Nissan Altima. The contact stated that while driving at an undisclosed speed, the air bag warning light illuminated. The vehicle was not diagnosed nor repaired by an independent mechanic or dealer. The manufacturer was not made aware of the failure. The failure mileage was approximately 65,000.",
        "vin": "1n4al3ap9hn"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/10/2021",
        "dateOfIncident": "11/09/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440087,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The transmission seems to be going. Car will not accelerate accordingly and randomly slows down in traffic. Holding the accelerator to the floor on a small incline I could only reach 44mph. I live in an area that has no shoulders and this could be a very dangerous situation.",
        "vin": "1N4AL3AP3HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/02/2021",
        "dateOfIncident": "11/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439119,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The car delays to accelerate from a stopped position. While sitting at traffic lights you can press the gas all the way to the floor and the car will not accelerate for a few seconds and then slingshot you forward.  After this happens the car will not change gears and revs to 5000 RPMs while in the middle of traffic.  If you can safely pull off to the side of the road and turn the car off for a few seconds and restart it, the car resumes to function normally.  This is extremely dangerous, especially when making left hand turns with children in the car.  In my research, this a known problem to Nissan and there has been no recall.",
        "vin": "1N4AL3AP9HC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/01/2021",
        "dateOfIncident": "08/26/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438990,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The system failure is the airbag I'm not sure if it is a malfunction or what. It started as staying on when I start car then would go away. Then I notice it just come up and would stay on. I made appointment for dealership to take a assessment and they would not look unless I pay ahead to have it seen. I don't feel safe to drive my vehicle that this could be a serious matter. It has been a while now about 3 months  now.",
        "vin": "1n4al3ap2hc"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/29/2021",
        "dateOfIncident": "10/06/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438586,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Hello  I’m not sure how to actually go about this.   Just looking for a little clarification or guidance, I purchased my 2017 Nissan Altima from a dealership March 2020.  Two weeks ago the airbag popped on that it’s no longer working and I’m not understanding why I haven’t been in any accidents or anything.   It doesn’t make any sense to me that I took the car to Nissan and it cost 1700 just for the part that’s not including labor.   Is this happening to all Nissans and where do I go from here?    That’s a lot of money just for parts.",
        "vin": "1N4AL3AP5HC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/13/2021",
        "dateOfIncident": "10/11/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11436717,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "1. Air Bag: Car was released from towing company to Progressive as total loss vehicle. 2. Component did not deploy when hit by an 18 wheeler. 3. Unknown, being in the crash as well as post crash visual evidence proves non deployment. 4. Total loss was declared and car was released to Progressive. 5. No warning or error was present in dashboard.",
        "vin": "1N4AL3AP0HC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/10/2021",
        "dateOfIncident": "09/11/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436227,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I am driving for about 40min my nissan stop accelerating. I can floor the gas pedal. It will not increase speed. My speed starts to decline . I can't go faster.  I have to put my hazard lights on and coast to get of freeway. No check engine lights no warning. I have taken it to nissan to get updated soft ware. Still no warnings no codes.  I paid 150 for them to tell me nothings is wrong. Clearly something is wrong.",
        "vin": "1N4AL3AP8HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/27/2021",
        "dateOfIncident": "09/27/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434499,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The transmission without any advance issue or problem began to shimmy and shake the entire car . The car slowed down to less than 10 mph while jerking forcefully . The car is and was serviced regularly at Nissan in Murfreesboro Tennessee. There was no warning. Nissan was called and they picked up car on roll back. They said transmission failed. This was at mileage less than 100,000 actual mileage was 93,404. The invoice number is 6088347/1 dated 5/16/20. This happened in traffic and is a definite safety issue. Nissan should not be  permitted to continue building and selling these faulty c v t transmissions, continuing to put our life’s in jeopardy and financially devastating us. Your form will not allow us to put the date of incident 5/15/2020 the form will not change from sept 2021 you might want to fix this.",
        "vin": "1N4AL3APXHC"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "09/23/2021",
        "dateOfIncident": "05/31/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434006,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Nissan Altima. The contact received notification of NHTSA Campaign Number: 20V315000 (Latches/Locks/Linkages). The contact called the local dealer, but they failed to respond. The vehicle was not diagnosed or repaired. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was not notified of the issue. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "1N4AL3AP6HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/21/2021",
        "dateOfIncident": "09/06/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433764,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Transmission stopped working while driving the car,  at relatively low mileage. No warning lights. Car would just no longer accelerate.",
        "vin": "1N4AL3AP8HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/07/2021",
        "dateOfIncident": "03/21/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432065,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I allege odometer tampering.  I purchased the vehicle on 03/21/2021 with 74,826 miles.  I found a smog document in the car which reflects the vehicle was smogged on 02/06/2021 with 75,526 miles.",
        "vin": "1N4AL3AP3HC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/01/2021",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431354,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Nissan Altima. The contact stated that the airbag warning light was illuminated. The vehicle was taken to a local dealer but was not diagnosed or repaired. The manufacturer was informed of the failure but was unable to assist. The failure mileage was approximately 67,000.",
        "vin": "1N4AL3AP5HC"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/31/2021",
        "dateOfIncident": "08/31/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431262,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I went to buckle my sons seat and as I went to tighten the belt the seat belt came completely out of buckle. And will not stop doing it everytime I go to tighten his seat its clean no debris i checked that but when i go to tighten it pops right out Its very unsafe and I fear that if a accident ever happened he could be ejected out the car now.",
        "vin": "1N4AL3AP2HC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/24/2021",
        "dateOfIncident": "08/08/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430285,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "My airbag light came on 2 weeks ago. I took it to Nissan and was told I had no error codes, but if the airbag light came back on to bring it back. The light came on again yesterday. I returned to Nissan to be informed that the airbag has to be replaced. Meaning the entire passenger seat has to be replaced because that is where the airbag is located. Nearly $2,000 to repair it. All of the 17 Nissan models have the airbag recall except for the 17 Altima which is what I have.",
        "vin": "1N4AL3AP2HC"
    },
    {
        "components": "AIR BAGS,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "08/08/2021",
        "dateOfIncident": "08/08/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428209,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "At certain times the front impact radar will say it is blocked or not functioning. Twice it has actually applied the brakes with nothing in front of it. Now the air bag light is on and will not go off.",
        "vin": "1n4al3ap5hc"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/04/2021",
        "dateOfIncident": "11/24/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427762,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Transmission problems Brake system is horrible, constantly have to replace brakes and rotors Powertrain and other problems I've made several complaints to Nissan, I have put so much money in this car! Compressor went out almost 7 months after I purchased this car. I would give Nissan a 0 rating on the 2017 Nissan Altima",
        "vin": "1N4AL3AP3HN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/14/2021",
        "dateOfIncident": "06/23/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424862,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2017 ALTIMA SR IS AGAIN EXPERIENCING A DELAY WHEN ACCELERATING FROM A STOP. IT REVS UP TO ABOUT 3500-4000 RPM’S FOR A COUPLE OF SECONDS NO MATTER HOW FAR DOWN THE PEDAL IS. ONLY GETS UP TO ABOUT 20 MPH THOUGH. THEN IT WILL FINALLY GO. THERE IS NO CHECK ENGINE LIGHT AND NO CODES. IF I TURN THE CAR OFF, IT'S LIKE IT RESETS AND HAS MORE POWER AFTERWARDS.  THIS HAPPENED 14 MONTHS AGO AS WELL. I HAD TO SERVICE THE TRANSMISSION AND IT WAS OK AFTER THAT. NOT EVEN 18,000 MILES LATER AND IT IS DOING IT AGAIN.",
        "vin": "1n4al3ap0hc"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "07/08/2021",
        "dateOfIncident": "07/07/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423985,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Nissan Altima. The contact stated that while the vehicle was in for routine maintenance, it was discovered that the hood could not be opened. The vehicle was taken to the local dealer who confirmed that the vehicle was included in the NHTSA recall campaign number 20V315000 (Latches/Locks/Linkages) however, no repairs were performed. The manufacturer was not yet notified of the failure. The VIN was not available. The failure mileage was 78,000.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/07/2021",
        "dateOfIncident": "06/16/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423763,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Had to replace rear brake pads at 21,100 miles…very odd to have to replace at such a low mileage.  Also, the major issue I’m having is with water leaking into my car…the dealership first said they thought it was due to clogged sunroof drains….they were wrong…took it back after issue still happening, and now they are saying that the sunroof drains are deformed…the water is coming in from under the dash onto the passenger side of the floor and going to the back.  Also, leaking from the top edge onto the passenger seat.  There also is some water on the driver seat, and the driver’s seatbelt feels damp.  Under both the passenger & driver’s seat there is rust….this car was brand new when I got it.  The car has heated/power seats.  I’m concerned that this water damage may cause other issues down the road..including safety issues.  Rust and mold are not good.  There also is a bad odor.",
        "vin": "1N4AL3AP9HC"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "07/06/2021",
        "dateOfIncident": "05/11/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11423535,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "1).Sometimes I can smell exhaust gas inside the car room like in my previous car Nissan Maxima SE 2008, which is extremely dangerous. 2).The rear camera works no so well - sometimes rearview disappearing completely.   Also, approximately a year ago, I received a letter regarding Nissan Altima SV 2017 recall(s). I contacted several different Nissan dealers in Miami but nobody knows about the recall.  Could you explain please what is going on with recalls? Thanks.",
        "vin": "1N4AL3AP8HC"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/01/2021",
        "dateOfIncident": "05/24/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423149,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Nissan Altima. The contact stated while driving at low speeds and making a left turn, the vehicle stalled. Additionally, while accelerating from a complete stop, the vehicle was slow to respond. There was no warning light illuminated. The rpm increased to 4,000. The vehicle was taken to the local dealer where the failure was undetermined. The vehicle was not diagnosed nor repaired. The manufacturer was notified of the failure. The approximate failure mileage was 46,700.",
        "vin": "1N4AL3AP2HC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/28/2021",
        "dateOfIncident": "06/28/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422629,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Speakers randomly stop working during a drive. No longer will come. Back on. As well as the door button to unlock the vehicle on the door handle on the driver side doesn't work at all  and constant stereo issues. Stereo doesn't always provide connected devices current song playing.",
        "vin": "1N4AL3AP9HC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/22/2021",
        "dateOfIncident": "06/13/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421791,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Car was parked luckily but when door was shut the sunroof exploded like a volcano",
        "vin": "1N4AL3AP6HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/10/2021",
        "dateOfIncident": "06/09/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420489,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving, my car seems to lock up, for instance, I was driving down the highway, doing 70 mph, and my car suddenly locked up, slowing me down to 55 mph within seconds, before it finally unlocked. Also, while I was breaking, the car accelerated, almost shooting me through a stop sign.",
        "vin": "1N4AL3APXHC"
    },
    {
        "components": "POWER TRAIN,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/08/2021",
        "dateOfIncident": "05/30/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420199,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Car purchased 5/21/2021 Experienced delayed acceleration twice after stopping, after approximately 2-4 seconds vehicle picked up momentum..Approximately 7days later engine light came on. 6/5/21 tool vehicle to Auto zone for diagnostic check received code P0776. Then took it took certified mechanic 6/7/2021 received same code report stating that belt is worn in the transmission and will eventually fail.",
        "vin": "1N4AL3AP0HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/01/2021",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414740,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ATTEMPTING TO ACCELERATE RAPIDLY VEHICLE HAS LONG DELAY, EVEN WITH PEDAL PRESSED ALL THE WAY DOWN, AN INTERMITTENT DELAY AT A FULL STOP, WHEN TAKING OFF VEHICLE HAS A 5 SECOND DELAY, GURGLING SOUND COMING FROM TRANSMISSION DURING IDLE, RPMS REV WAY HIGHER THAN THEY SHOULD WHEN ACCELERATING, JERKING FROM TRANSMISSION WHEN AT A SLOW ACCELERATION THROUGH PARKING LOTS AND SUCH, DELAYED ACCELERATION ALSO CAUSED ME TO ALMOST HAVE A WRECK, PULLED OUT INTO TRAFFIC AT A SLOW ROLL BECAUSE VEHICLE WOULDN'T GO AND THEN VEHICLE TOOK OFF FULL SPEED",
        "vin": "1N4AL3AP1HC"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/26/2021",
        "dateOfIncident": "03/16/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414059,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DELAYED ACCELERATION   MY 2017 ALTIMA IS EXPERIENCING A    DELAY WHEN ACCELERATING FROM A STOP.  IT WON'T   REV OR DO ANYTHING FOR A COUPLE OF SECONDS NO   MATTER HOW FAR DOWN THE PEDAL IS.  THEN ALL OF   A SUDDEN IT'LL GO.  THERE IS NO CHECK ENGINE   LIGHT AND NO CODES.  IF I TURN THE CAR OFF, IT'S   LIKE IT RESETS AND HAS MORE POWER AFTERWARDS.",
        "vin": "1N4AL3AP2HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/25/2021",
        "dateOfIncident": "02/16/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413722,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE PRODUCED A CHECK ENGINE LIGHT. I PAID $1300 FOR A NEW MASS FLOW SENSOR AND MODIFICATION TO MY AIR FLOW. TWO DAYS LATER, I DROVE OUT OF TOWN AND THE CAR LOST POWER. RPM WAS JUMPING AND CAR STARTED JERKING AND WOULDN'T ACCELERATE. TOWED IT TO NISSAN AND THEY COULDN'T FIND A ISSUE! OBVIOUSLY THERE IS A ISSUE BECAUSE EVERYONE I'VE KNOW HAVE A NISSAN BEEN HAVING ISSUES WITH THEIR CAR AND NISSAN HASN'T DONE NOTHING ABOUT IT! I PAID $1300 FOR A CHECK ENGINE LIGHT, WHAT MAKES U THINK I'M GOING TO PAY $4000 FOR A NEW TRANSMISSION. THIS MY SECOND ALTIMA AND SAME ISSUE!",
        "vin": "1N4AL3AP6HC"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/25/2021",
        "dateOfIncident": "04/24/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413861,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2017 NISSAN ALTIMA SV, 4CYL, 2.5L... I AM HAVING WORSENING PROBLEMS WITH ACCELERATION. WHEN ATTEMPTING TO PULL OFF FROM A RED LIGHT FOR EXAMPLE, IT WILL HESITATE FOR ABOUT 4,5 SECONDS,  RPMS INCREASE THEN A SURGE OF ACCELERATION. ALSO,  WHILE DRIVING IT WILL LOSE SPEED WITH MY FOOT ON THE GAS, EVEN WITH THE RPMS UP AS IF IT WERE MOVING FASTER.. THANKFULLY THE DRIVERS BEHIND ME WERE ATTENTIVE OR IT COULD HAVE CAUSED ME AND OTHERS A GREAT DEAL OF DAMAGE, LIKE WHEN I WAS TRYING TO ACCELERATE FROM A CROSS STREET TURN LANE. IT WAS SPORADIC AT FIRST; I WENT TO VALVOLINE AND GOT REPLACEMENT TRANSMISSION FLUID, AND THE GUY TURNED OFF THE ENGINE LIGHT. IT STARTED UP AGAIN A FEW WEEKS LATER, AND I GOT A NEW AIR FILTER AND WENT BACK FOR A FUEL SYSTEM CLEANING. ANOTHER GUY RESET THE ENGINE LIGHT AGAIN, AND NOW(ABOUT 3 WEEKS LATER)IT'S BACK WITH THE SAME PROBLEM. SOMETIMES, I'D PULL OVER AND TURN OFF THE CAR AND IT HELPED A BIT. NOW(YESTERDAY) THAT ISN'T HELPING AND THE SLOW ACCELERATION AND SPEED HAPPENS EVERY TIME. I USED THE DIAGNOSING TOOL AT AUTO ZONE WHICH READ, \"P0776-PRESSURE CONTROL SOLENOID B PERFORMANCE OR STUCK OFF\". I AM SEEING THAT THERE ARE MANY COMPLAINTS ABOUT THE EXACT SAME THING, AND EVEN A RECALL ON THE MODELS UP TO 2016 REGARDING THIS, BUT 2017 AND AFTER SEEM TO BE GETTING IGNORED.",
        "vin": "1N4AL3AP2HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/20/2021",
        "dateOfIncident": "04/12/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413037,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 NISSAN ALTIMA. THE CONTACT STATED THAT WHILE THE VEHICLE WAS STOPPED AT A RED TRAFFIC LIGHT, THE VEHICLE STALLED AFTER THE ACCELERATOR PEDAL WAS DEPRESSED. THE CHECK ENGINE WARNING WAS LIGHT ILLUMINATED. THE VEHICLE WAS TOWED TO NISSAN OF MISSION HILLS (11000 SEPULVEDA BLVD, MISSION HILLS, CA 91345) TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE TRANSMISSION NEEDED TO BE REPLACED. THE SENSOR FOR THE BRAKE PADS WERE REPLACED HOWEVER, THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 76,000.",
        "vin": "1N4AL3AP1HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/18/2021",
        "dateOfIncident": "04/18/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408683,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE KEEPS SHIFTING INTO SPORTS MODE WITHOUT ACTIVATING IT",
        "vin": "1N4AL3AP1HC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/16/2021",
        "dateOfIncident": "04/14/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408400,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG LIGHT IN THE DASH CAME ON AND STAYS ON.",
        "vin": "1N4AL3AP7HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/07/2021",
        "dateOfIncident": "04/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406970,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CVT TRANSMISSION IS JERKING, STALLING, SHUDDERING, AND HESITATING WHILE DRIVING.  CAR ONLY HAS 65K MILES.  ISSUE HAS BEEN HAPPENING RANDOMLY FOR ABOUT A WEEK.  I DO NOT FEEL COMFORTABLE DRIVING IN THE CAR ANYMORE BECAUSE I FEEL THAT THIS MALFUNCTION CAN EVENTUALLY CAUSE AN ACCIDENT.",
        "vin": "1N4AL3AP2HC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/28/2021",
        "dateOfIncident": "03/26/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405218,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I DRIVE MY VEHICLE SOMETIMES THE HOOD LATCH OPENS I DON'T KNOW WHY? VERY SCARY WHEN DRIVING ON FREEWAY",
        "vin": "1N4AL3AP6HN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/17/2021",
        "dateOfIncident": "03/17/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403442,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "GEAR SHIFT GETS STUCK IN PARK.",
        "vin": "1N4BL3AP9HC"
    },
    {
        "components": "SUSPENSION,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/09/2021",
        "dateOfIncident": "12/24/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399947,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL THE SUDEN I WILL START MY CAR AND GIVE IT GAS AND WILL NOT MOVE AS IF IT WAS BEING FORCE TO RUN. THIS HAS HAPPEN MANY TIME AFTER THIS DAY.",
        "vin": "1N4AL3AP5HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/08/2021",
        "dateOfIncident": "02/20/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399851,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR DOESNT GO, IT STUTTERS, AND THEN SUDDENLY GOES. TAKE A LOT OF TIME TO CHANGE GEAR, IN SMALL HILLS DOESN'T GO UP, THE RPM AND SPEED JUST GO DOWN. THE CHECK ENGINE LIGHT COMES ON AND OFF. NISSAN DEALERS SAYS IT IT OUT OF GUARANTEE. A NISSAN ALTIMA 2017, 85K MILES AND ITS OUT OF NISSAN GUARANTEE ALREADY, AND THAT THEY CANT DO ANYTHING ABOUT IT. UNBELIEVABLE. SADDLY FOR ME THE CARE IS ALREADY PAYED OFF, THEY HAVE ALREADY ALL THEIR MONEY, SO NO NEED TO FIX MY PROBLEM. ALSO WHEN I BOUGHT THE CAR, IN A NISSAN DEALER, THEY GAVE A FAKE CARFAX OF THE CAR, THEY OMIT AN CRASH REPORT, ALSO THEY ADVERTISED THE CAR FOR A VERY MUCH LOWER PRICE THAN THEY SOLD IT TO ME, THEY PUT A LOT OF FEES ON IT THAT THE PRICE WAS 2K OVER THAN THE ADVERTISED.",
        "vin": "1N4AL3AP7HN"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/28/2021",
        "dateOfIncident": "03/15/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398278,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A DELAY IN ACCELERATION FROM A COMPLETE STOP. STOPS FOR RED LIGHTS, STOP SIGNS AND TURNS ARE EXTREMELY DANGEROUS AS THE ISSUE OF DELAYED ACCELERATION OCCURS RANDOMLY AND WITHOUT WARNING.",
        "vin": "1N4AL3AP4HC"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/19/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396966,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "NISSAN ALTIMA 2017 LOUD RATTLING FROM PASSENGER REAR SUSPENSION. VIBRATION OR TRAVELING OVER BUMPY CONDITIONS WOULD CREATE RATTLE NOISE. VEHICLE HAS LESS THAN 16,000 MILES AND DEALER STATED THAT BOTH REAR SHOCKS NEED TO BE REPLACED. AFTER RESEARCHING MULTIPLE NISSAN FORUMS HAVE DISCOVERED THIS IS A COMMON PROBLEM NOT ONLY WITH ALTIMA MODELS BUT WITH MAXIMA AS WELL. DEALER STATED DUE TO YEAR IT IS OUT OF WARRANTY AND RECEIVED REPAIR ESTIMATE FOR OVER $800. DEALER CHARGED $50 FOR DIAGNOSTIC EVEN THOUGH I TOLD THEM WHAT THE PROBLEM WAS. HAD SHOCK MOUNT KIT REPLACED ON PASSENGER SIDE AT ANOTHER REPAIR FACILITY FOR LESS THAN $200. LOUD RATTLE IS NOW GONE BUT SHOCK WAS NOT REPLACED AND IS STILL MAKING SOME NOISE OVER BUMPY CONDITIONS. DRIVER SIDE IS CURRENTLY NOT MAKING ANY NOISE BUT PROBABLY WILL FAIL EVENTUALLY. CONTACTED NISSAN AND THEY WOULD NOT CREDIT ME FOR REPAIR COST I INCURRED AND WOULD ONLY COVER HALF OF THE COST IF I TOOK VEHICLE BACK TO DEALER TO HAVE BOTH SHOCKS REPLACED. THIS IS UNACCEPTABLE AND SHOULD HAVE BEEN RECALLED BY NISSAN DUE TO HIGH FAILURE RATE ON PARTS WITH MINIMUM MILEAGE. THEY SHOULD BE RESPONSIBLE FOR 100% OF COSTS.",
        "vin": "1N4AL3AP5HC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/14/2021",
        "dateOfIncident": "02/14/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396206,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STOPPED WHEN ON STOP LIGHT WAS IN MOTION AND NEVER CAME BACK HAVE TO TOWE THE  CAR . SOME TIME IT START AND SOMETIME NOT . SO IT'S SCARY IF  YOU PRESS THE BRAKE AND STOPS AND SOMEONE FROM BEHIND CAN HIT YOU .",
        "vin": "1N4AL3AP5HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/04/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394671,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING AND THE STALL WHILE I PULL OUT INTO TRAFFIC ACTING LIKE IT DON'T WANT TO GO",
        "vin": "1N4AL3AP8HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/22/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11389384,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE SHUTS OFF WHILE DRIVING, DOES NOT MAINTAIN A SOLID SPEED, INCREASES AND DECREASES SPEED ON IT OWN, WHEN STOPPED THE VEHICLE WITH NOT GO WHEN THE GAS PEDAL IS PRESSED, IT WILL TAKE A FEW MOMENTS AND THEN ACCELERATE AT A REALLY HIGH SPEED OR FORCE. THE WINDOWS RANDOMLY STOP WORKING, THE LIGHTS FLICKER ON AND OFF, THE STEERING COLUMN TIGHTENS AND THE VEHICLE RANDOMLY SHUTS OFF WHILE DRIVING IT ON THE ROAD. IT WILL DISPLAY THAT THE KEY IS MISSING AND TURN OFF. IT HAS TAKEN SEVERAL MINUTES TO RESTART THE CAR. THIS HAPPENS DURING IDLE AND IN MOTION, ON THE HIGHWAY OR IN THE CITY.",
        "vin": "1N4AL3AP1HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/19/2021",
        "dateOfIncident": "11/07/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388775,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I WAS DRIVING MY CAR AND STOPPING AT A TRAFFIC LIGHT AND WHEN I WOULD START TO DRIVE AGAIN THE CAR AT TIMES HAS A PROBLEM WITH ACCELERATION AND ALL OF SUDDENLY THE CHECK ENGINE LIGHT CAME ON I SCANNED THE ENGINE CODE AND IT SHOWED A PO 776 TRANSMISSION PRESSURE CONTROL SOLENOID B PERFORMANCE OR STUCK OFF THE CAR WOULD NOT MOVE BUT WHEN I TURNED IT OFF AFTER 10 MINUTES REST THE CAR WILL START TO DRIVE AGAIN BUT WITH VERY SLOW ACCELERATION AND THE RPM WAS VERY HIGH WHEN THE CAR WAS ONLY MOVING AT 20 MPH,  MY UNDERSTANDING IS THAT THIS HAPPENS TO A LOT OF THE CARS OWNERS BUT THESE NISSAN CARS NISSAN SHOULD FIX THE PROBLEMS WITH THE TRANSMISSION THEY BUILT KNOW FULL WELL THAT THESE TRANSMISSIONS ARE NO GOOD ,CURRENTLY THERE'S NO RECALLS ON THE 2017 NISSAN ALTIMA SV WITH THIS ISSUE I WILL NEVER BUY ANOTHER NISSAN AGAIN TILL THEY FIX THE TRANSMISSION PROBLEMS COSTING THE CUSTOMERS MONEY AND NOT FIXING THE PROBLEMS WITH THEIR BAD TRANSMISSION THAT THEY KNOW ABOUT SHAME ON NISSAN THE TRASH VEHICLES OF THE CENTURY  ONLY GOOD FOR A SHORT TIME THEN IT JUNK AFTERWARDS",
        "vin": "1N4AL3AP1HC"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "01/15/2021",
        "dateOfIncident": "01/10/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388338,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2017 ALTIMA HAD BEEN JERKING, ALMOST FELT LIKE THE TRANSMISSION WAS SLIPPING. THIS WOULD OCCUR AT RANDOM ACCELERATION CAUSING THE VEHICLE TO STALL FOR BRIEF SECONDS BEFORE IT WOULD ACTUALLY ACCELERATE. ON TOP OF THAT VEHICLE HAS NOW STARTED A LOUD WINING SOUND THAT GETS LOUDER WHEN TRYING TO ACCELERATE. THE CAR WILL NOT MOVE FOR SEVERAL SECONDS AND THEN GRADUALLY IT WILL BEGIN TO TAKE OFF. THIS HAPPENS AT EVERY STOP OR SLOW DOWN MADE. MY CRUISE CONTROL NO LONGER WORKS EITHER. SEVERAL TIMES IN THE PAST I HAD ISSUES WITH THE VEHICLE NOT WANTING TO SHIFT OUT OF FIRST GEAR. SINCE THEN THIS IS WHAT HAS OCCURED. AT THIS POINT I CAN NO LONGER DRIVE THE VEHICLE DUE TO NO ACCELERATION AND IM AFRAID THAT I MIGHT CAUSE AN ACCIDENT DUE TO EXTREMELY SLOW IF NOT ANY TAKE OFF FROM ANY STOP. I AM VERY UPSET OVER THIS ISSUE CONSIDERING EVERYTHING I HAVE READ UP ON ALL LEADS BACK TO THE CVT TRANSMISSION PROBLEMS FROM SEVERAL OTHER OWNERS, AND THE FACT THAT SEVERAL RECALLS HAVE BEEN MADE DUE TO THIS, BUT FOR SOME REASON NOT THE 2017 ALTIMA? IT IS APPARENT TO ME THAT THIS YEAR HAS ALSO BEEN AFFECTED. I AM A SINGLE MOTHER AND CAN'T AFFORD ANOTHER EXSPINCE AT THIS TIME ESPECIALLY SINCE I LOST MY JOB DUE TO COVID-19. NOW I AM UNEMPLOYED AND CANT DRIVE MY CAR DUE TO TRANSMISSION PROBLEMS THAT OBVIOUSLY SEEMS TO BE A REACCURING PROBLEM FOR NISSANS WITH THE CVT TRANSMISSIONS.",
        "vin": "1N4AL3AP4HC"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "12/29/2020",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385459,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 NISSAN ALTIMA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V315000 (LATCHES/LOCKS/LINKAGES) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. CEDAR PARK NISSAN (2121 S BELL BLVD, CEDAR PARK, TX 78613, (512) 620-7200) WAS CONTACTED BY PHONE AND IT WAS CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "1N4AL3AP9HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/29/2020",
        "dateOfIncident": "12/29/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385518,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ISSUE HAPPENED MULTIPLE TIMES BUT SEEMS TO HAPPEN MORE, THE LONGER THE VEHICLE IS RUNNING. THE FIRST TIME I WAS WAITING IN A  PARKING LOT WITH THE AIR CONDITION RUNNING. I WAS LEAVING THE PARKING LOT AND THE VEHICLE PAUSED AND LOST ACCELERTION POWER FOR A  FEW SECONDS AND STARTED GOING. I THOUGH IT WAS AN ISSUE WITH THE AIR CONDITION SO I TURNED OFF THE AIR CONDITION TO SEE IF IT WOULD  HAPPEN AGAIN. WHEN I GOT TO A STOP LIGHT AND STARTED TO ACCELERATE IT PAUSED AGAIN THEN ACCELERATED. THE PAUSE SEEMS TO BE FROM 5 TO 10   SECONDS BEFORE THE CAR WOULD MOVE.THE LONGER THE CAR WAS RUNNING THE MORE IT HAPPENED. AT THIS TIME THE CHECK ENGINE LIGHT WAS NOT ON.  ON SHORTER DISTANCES THE PROBLEM WOULD NOT START BUT ON LONG DISTANCES OR ON ACCELERATION, THE PAUSE WOULD CONTINUE. FINALLY THE CHECK  ENGINE LIGHT CAME ON AND I WENT TO AUTO ZONE TO GET THE CODE CHECKED. IT WAS A P0776 CODE,\"PRESSURE CONTROL SOLENOID B PERFORMANCE OR STUCK OFF\"  . I FINALLY TOOK IT TO THE DEALERSHIP TO GET THE ISSUE CHECKED AND THEY STATED THAT THE TRANSMISSION WOULD NEED TO BE REPLACED FOR $6000 ON A 3 YEAR OLD   CAR WITH ONLY 74000 MILES.    PROBLEMS  1. LOST ACCELERATION FOR A FEW SECONDS BEFORE THE VEHICLE WILL ACCELERATE AGAIN  2. COMPLETELY LOST ACCELERATION AND COULD NOT MOVE AND A HILL.  3. LOST ACCELERATION ON THE FREEWAY AND BARELY MADE TO THE SIDE TO TURN OFF THE CAR.    SEEING THE ISSUES FOR THE NISSAN ALTIMA AND THE COMPLAINTS ABOUT THE TRANSMISSION, NISSAN NEEDS TO TAKE RESPONSIBILITY FOR A TRANSMISSION THEY KNOW   HAS PROBLEMS AND REPAIR THE ISSUE. THEY UPDATED THE WARRANTY UP TO 2016 BUT NOT THE 2017 OR 2018 MODELS THAT STILL HAVE ISSUES, USING THE SAME   TRANSMISSION AS THE 2016 MODELS. I WILL NOT BE BUYING ANOTHER NISSAN AGAIN BECAUSE OF THEIR KNOWLEDGE OF THE ISSUE AND NOT CORRECTING IT.",
        "vin": "1N4AL3APXHC"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/27/2020",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385099,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION STARTED TO SLIP IN EARLY 2019. WENT TO DEALERSHIP IMMEDIATELY TO BE INFORMED THAT THE CVT TRANSMISSION NEEDED TO BE REPLACED. DEALERSHIP QUOTED US $5600 FOR THE REPAIR OF A REBUILT.  WE LOOKED AT THE ERROR CODE AND SAW THAT ALL OTHER YEARS AND MODELS HAD ALREADY BEEN RECALLED DUE TO THE EXACT SAME ERROR.  NISSAN TOLD US THEY WOULD GIVE US \"ASSISTANCE\" AT 60%, WHICH STILL WAS OVER $1600 EXPENSE,  FOR A CAR JUST 2 YEARS OLD.  THE CAR WAS AT THE DEALERSHIP FOR 3 WEEKS.  WHEN I PICKED UP THE VEHICLE,  THE CHECK ENGINE LIGHT CAME ON AGAIN. TOOK IT RIGHT BACK.  NISSAN INFORMED ME IT WAS A FAULTY OXYGEN SENSOR. COST ANOTHER $800. WE WILL NEVER BUY ANOTHER NISSAN AGAIN.",
        "vin": "1N4AL3APXHC"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "12/23/2020",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384712,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 NISSAN ALTIMA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V315000 (LATCHES/LOCKS/LINKAGES) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. AN UNKNOWN DEALER WAS CONTACTED IN REGARD TO THE RECALL. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "1N4AL3AP6HN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/09/2020",
        "dateOfIncident": "12/08/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11382787,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT HIGHWAY SPEED (75MPH), MY RPM'S SHOT UP.  I LET OFF THE ACCELERATOR BRIEFLY AND WHEN I ATTEMPTED TO PUSH THE ACCELERATOR AGAIN, NOTHING HAPPENED.  MY CAR CONTINUED TO SLOW DOWN AND I WAS ALMOST HIT FROM BEHIND.  I WAS ABLE TO PULL OFF TO THE SIDE OF THE HIGHWAY.  I HAD MY CAR TOWED TO A GARAGE AND THEY SAID THE CAR HAD 4 ERROR CODES, ALL HAVING TO DO WITH THE TRANSMISSION.  I HAVE HAD MY CAR TOWED TO THE DEALERSHIP AS I AM STILL COVERED UNDER MY 5 YEAR/ 60000 MILE WARRANTY.",
        "vin": "1N4AL3AP5HN"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "11/18/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375230,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 NISSAN ALTIMA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V315000 (LATCHES/LOCKS/LINKAGES) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. SHORTY AFTER RECEIVING THE NOTIFICATION, THE VEHICLE WAS PARKED AND THE CONTACT NOTICED THAT THE HOOD HAD INDEPENDENTLY OPENED. THE VEHICLE WAS TAKEN TO GLENDALE NISSAN (484 E NORTH AVE., GLENDALE HEIGHTS, IL 60139; (630) 469-6100) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS APPROXIMATELY 58,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "1N4AL3AP5HN"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/09/2020",
        "dateOfIncident": "11/05/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373882,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2017 NISSAN ALTIMA, WHEN STOPPED AT A TRAFFIC LIGHT, ONCE THE LIGHT TURNED GREEN, I WAS ATTEMPTING TO ACCELERATE WHEN MY CAR WOULDN'T MOVE OR GO. AS I'M ATTEMPTING TO ACCELERATE, MY GAUGES ARE JUMPING BUT STILL NO MOVEMENT. EVENTUALLY AFTER ME TRYING PARK/NEUTRAL,  THEN BACK IN DRIVE,  IT JERKED INTO GEAR. ONCE IN GEAR, MY RPM GAUGE STARTED SURGING UP AND DOWN, CAR JENKINS OUT OF CONTROL. I COASTED TO A NEARBY STORE WHERE MY DAD TOWED TO HOME, TO CHECK IT OUT. ATTEMPED TO TRY AND TAKE IT TO THE LOCAL NISSAN DEALERSHIP THE NEXT DAY,  AND IT CONTINUED TO DO THE SAME EXACT THING. NISSAN HAS PUT A FAULTY CVT IN THE 2017 NISSAN ALTIMA. I WOULD NOT RECOMMEND THIS CAR TO NO ONE.",
        "vin": "1N4AL3AP4HC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "11/05/2020",
        "dateOfIncident": "09/11/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11373119,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2017 NISSAN ALTIMA. THE CONTACT STATED THAT WHILE SHE WAS DRIVING AT 35 MPH AND BRAKED TO STOP AT A STOP SIGN, WHEN THE VEHICLE UNINTENDEDLY ACCELERATED. THE BRAKE PEDAL WAS DEPRESSED WITH FORCE UT FAILED TO STOP THE VEHICLE. THE VEHICLE WENT THROUGH THE STOP SIGN AND FOUR LANES ON THE ROAD AND CRASHED INTO A TREE WHERE IT CAME TO A STOP. THE CONTACT'S FOOT WAS CRUSHED, HER NECK WAS BROKEN IN THREE PLACES , HER RIBS ON HER RIGHT SIDE WERE ALSO BROKEN. THE CONTACT'S LEFT WRIST WAS BROKEN AND THE RIGHT WRIST WAS SPRAINED. THE CONTACT WAS TRANSPORTED TO THE HOSPITAL AND REQUIRED FOUR QUARTS OF BLOOD. THE VEHICLE ROLLED OVER ON THE PASSENGER'S SIDE AND THE MOTOR WAS PUSHED INTO THE CAB ON ALSO THE PASSENGER'S SIDE. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOTALED BY THE INSURANCE COMPANY AND THE WRECKAGE WAS TOWED AWAY. THE DEALER AND MANUFACTURER WERE NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 8,000. *DT*JB",
        "vin": "1N4AL3AP3HN"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/04/2020",
        "dateOfIncident": "04/15/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372955,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STARTED LEAKING OIL.  CHECK ENGINE LIGHT CAME ON.  TOOK IT TO FUCILLO NISSAN,  WHERE I PURCHASED IT , NEW.  THEY KEPT VEHICLE OVER ONE MONTH,  RETURNED IT SUPPOSEDLY FIXED.  THEY HAD MOTOR OUT,  TO FIX A LEAK.  STILL LEAKING IN MY DRIVEWAY.  WE ARE IN OUR SEVENTIES AND AFRAID OF FIRE.  PLEASE HELP!!",
        "vin": "1N4AL3AP1HC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/29/2020",
        "dateOfIncident": "10/02/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366966,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WILL STOP ACCELERATING OUT OF NOWHERE, WHEN AT A STOP LIGHT YOU PRESS THE GAS AND IT JUST WANT GO ALSO CAR WILL SPIKE THE RPMS BUT THE CAR DOESN'T ACCELERATE WHILE DRIVING",
        "vin": "1N4AL3AP3HC"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/26/2020",
        "dateOfIncident": "02/24/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366364,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 NISSAN ALTIMA. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 35 MPH, THE HOOD INADVERTENTLY UNLATCHED AND OPENED, STRIKING THE FRONT WINDSHIELD AND CAUSING A VISIBILITY HAZARD FOR THE DRIVER. DURING THE INCIDENCE, THE DRIVER LOST CONTROL OF THE STEERING AND DROVE OFF THE ROADWAY BEFORE COMING TO A STOP. THE VEHICLE WAS DRIVEN TO PORTSMOUTH NISSAN LOCATED AT 120 SPAULDING TURNPIKE, PORTSMOUTH, NH 03801. THE CAUSE OF THE FAILURE WAS NOT YET DETERMINED. THE MANUFACTURER WAS NOT NOTIFIED. THE VIN WAS INCLUDED NHTSA CAMPAIGN NUMBER: 20V315000 (LATCHES/LOCKS/LINKAGES) HOWEVER, THE PARTS WERE NOT YET AVAILABLE. THE FAILURE MILEAGE WAS 38,000.",
        "vin": "1N4AL3APXHC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/26/2020",
        "dateOfIncident": "10/23/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366487,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DELAY WHEN ACCELERATING FROM A STOP, IT WONT REV OR DO ANYTHING FOR A FEW MINUTES UNTIL THE CAR WILL FINALLY MOVE. VERY DANGEROUS WHEN IN AN INTERSECTION OR SWITCHING LANES. NO CHECK ENGINE LIGHT, NO CODES WHEN THE DEALER TEST IT. DOESN'T ALWAYS HAPPEN, HAD TO THE DEALER MULTIPLE TIMES, NO HELP. ONCE I TURN OFF THE CAR IT RESETS ITSELF AND WILL WORK FINE UNTIL THE NEXT STOP.",
        "vin": "1N4AL3AP6HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/26/2020",
        "dateOfIncident": "06/20/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366509,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS AN ACTIVE RECALL FOR THE HOOD LATCH WHICH NISSAN HAS NO RESOLUTION FOR AT THIS TIME.  FIRST- THIS SAME RECALL EXISTED ON MY 2014 NISSAN ALTIMA AND WHILE THE CURRENT RECALL IS LISTED AT JUNE 2020 FOR THE 2017 ALTIMA THIS ISSUE IS NOT NEW OR UNKNOWN TO NISSAN.  THEY SIMPLY DO NOT KNOW HOW TO PERMANENTLY AND SAFELY RESOLVE THE ISSUES.  SECOND- THE CURRENT \"FIX\" IS TO PRESS DOWN FIRMLY ON THE HOOD EVERY TIME BEFORE DRIVING.  THIS IS NOT A RESOLUTION AND OWNERS OF VEHICLES IMPACTED BY THIS RECALL SHOULD QUALIFY FOR A MANDATORY BUY BACK FROM THE MANUFACTURER.",
        "vin": "1N4AL3AP3HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/19/2020",
        "dateOfIncident": "10/13/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365103,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR TRANSMISSION GAVE OUT ON 41,982 MILES, IT IS CURRENTLY GETTING \"REBUILD\" AT NISSAN. TOMORROW WILL MAKE IT A WEEK SINCE NISSAN HAS OUR CAR AND IT STILL HASN'T BEEN WORKED ON. WE WERE TOLD IT'S IN ROTATION. NISSAN WARRENTY SUCKS, THEY HAVE US A $105 VOUCHER THAT ONLY COVERS 3 DAYS. WE LIVE IN NYC, THERE ARE NO CAR RATE FOR $35 A DAY, IT IS $65 A DAY INCLUDING TAX. NISSAN WANTS TO CONTACT OUR EXTENDED WARRENTY TOSEE IF THEY CAN COVER A PORTION OF THE RENTAL, WHICH IS RIDICULOUS. IT'S THEIR FAULT FOR MAKING FAULTY TRANSMISSION, I SHOULD PAY THE COST TO RENT A CAR.",
        "vin": "1N4AL3AP3HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/14/2020",
        "dateOfIncident": "08/15/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364279,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED NEW IN 2017 NOTICED A SERIOUS OIL LEAK A COUPLE YEARS LATER.  TOOK BACK TO DEALER , THEY KEPT IT FOR A MONTH.  FINALLY AFTER ENGINE IN AND OUT OF CAR, THAT OIL LEAK WAS SILVED.  NOT SO STILL LEAKING. WE ARE AFRAID OF FIRE.WE ARE IN OUR SEVENTIES. PLEASE HELP US.DRIVEWAY SHOWS OIL LEAK.",
        "vin": "1N4AL3AP1HC"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/10/2020",
        "dateOfIncident": "10/09/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363707,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE PAST TWO WEEKS I NOTICED THAT MY VEHICLE STARTED LOOSING POWER AT HIGHWAY SPEEDS RANDOMLY. THERE WERE TIMES I DEPRESSED THE ACCELERATOR AND A SIGNIFICANT DELAY TOOK PLACE WITH THE CAR SPEEDING UP. YESTERDAY 10/09/2020 WHILE DRIVING HOME FROM WORK  IT HAPPENED AGAIN. THE CAR FAILED TO ACCELERATE AT HIGHWAY SPEEDS AND BEGAN SKIPPING BETWEEN GEARS. AFTER GETTING OFF MY EXIT FOR HOME, I CAME TO A COMPLETE STOP AND WAITED FOR THE LIGHT TO TURN GREEN. I DEPRESSED THE ACCELERATOR AND NOTHING HAPPENED FOR ABOUT 5 SECONDS. THE CAR FINALLY DROVE FORWARD AND I SLOWLY DROVE THE REMAINING 4 MILES HOME WITH MY HAZARD LIGHTS ON. I MADE AN APPOINTMENT WITH THE GRAINGER NISSAN DEALER IN GARDEN CITY, GEORGIA FOR TODAY AT 9:00 AM. I EXPLAINED THE SITUATION TO THEM AND WAS INFORMED THAT IT WOULD TAKE A FEW DAYS TO DIAGNOSE THE PROBLEM. A COUPLE HOURS LATER I GOT A CALL FROM THE ADVISOR STATING THAT MY CARS TRANSMISSION NEEDED TO BE REPLACED FOR $3800. I ASKED IF THIS WAS A COMMON ISSUE WITH NISSAN ALTIMA'S THAT HAVE 90K MILES ON THEM. HE STATED THAT THERE ARE SOME VEHICLES THAT HAVE BEEN IDENTIFIED WITH THIS ISSUE BY THE MANUFACTURER AND OTHERS ARE NOT COVERED BY ANY WARRANTY. HE STATED THAT DURING PRODUCTION THEY LABELED SOME VEHICLES BY THE VIN NUMBER WITH THE ISSUE AND WOULD REPAIR THOSE VEHICLES AT NO COST TO OWNER. HOWEVER MY VEHICLE DID NOT RECEIVE THAT LABEL. MY CONCERN IS IF THEY ARE AWARE OF THE FAILURE WITH THEIR TRANSMISSION HOW DO THEY DETERMINE WHICH CARS THEY WILL FIX AND WHICH ONES THEY WILL NOT. WHAT ARE THE CRITERIA TO MEET ELIGIBILITY FOR REPAIR THEIR DEFECTIVE PRODUCT?",
        "vin": "1N4AL3AP1HN"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/01/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361830,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 NISSAN ALTIMA. CONSUMER WRITES IN REGARDS TO MANUFACTURING DEFECT IN HOOD LATCH. *LD *JS",
        "vin": "1N4AL3AP1HC"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "09/29/2020",
        "dateOfIncident": "09/15/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11361730,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEPT. 15TH 2020, I WAS IN AN ACCIDENT ON THE HIGHWAY, I WAS REAR ENDED BY A TRACTOR TRAILER AND FROM THERE PUSHED ACROSS FOUR LANES HEAD ON INTO MEDIAN CEMENT WALL THE CAR THEN ROLLED BACK INTO TRAFFIC WHERE I WAS HIT AGAIN BY ANOTHER TRUCK IN THE FRONT DRIVERS SIDE WHEEL AND HOOD AREA, THIS SENT ME BACK INTO THE GUARD RAIL ON  THE OTHER SIDE OF THE HIGHWAY. DURING THIS COLLISION NONE OF AIRBAGS DEPLOYED  IN THE FRONT OR REAR, THIS CAR HASN'T BEEN IN ANY ACCIDENTS, AND THERE ARE NO RECALLS LISTED FOR THE AIRBAGS, SYSTEM DID NOT ALERT ME TO TRAFFIC IN BLIND SPOT, SAFETY FEATURE FOR THIS WAS ON. THE CAR IS LOCATED AT BARROW WRECKER SERVICE SHOP & YARD 2267 DIXIE AVE SE, SMYRNA, GA 30080. 770-435-8945. I WILL ATTACH POLICE REPORT AND PICTURES.",
        "vin": "1N4AL3AP8HC"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "09/29/2020",
        "dateOfIncident": "09/15/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11361735,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEPT. 15TH 2020, I WAS IN AN ACCIDENT ON THE HIGHWAY, I WAS REAR ENDED BY A TRACTOR TRAILER AND FROM THERE PUSHED ACROSS FOUR LANES HEAD ON INTO MEDIAN CEMENT WALL THE CAR THEN ROLLED BACK INTO TRAFFIC WHERE I WAS HIT AGAIN BY ANOTHER TRUCK IN THE FRONT DRIVERS SIDE WHEEL AND HOOD AREA, THIS SENT ME BACK INTO THE GUARD RAIL ON  THE OTHER SIDE OF THE HIGHWAY. DURING THIS COLLISION NONE OF AIRBAGS DEPLOYED  IN THE FRONT OR REAR, THIS CAR HASN'T BEEN IN ANY ACCIDENTS, AND THERE ARE NO RECALLS LISTED FOR THE AIRBAGS, THE BLIND SPOT SAFETY FEATURE WAS ON AND DID NOT ALERT ME TO DRIVER SIDE BLIND SPOT. IMMEDIATELY AFTER ACCIDENT I WAS TRANSPORTED TO ATLANTA VA MEDICAL HOSPITAL OFF 1670 CLAIRMONT RD. DECATUR, GA 30033.*DT*JB",
        "vin": "1N4AL3AP8HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/28/2020",
        "dateOfIncident": "08/08/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361464,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR PASSENGER SIDE DOOR LOCK STOPPED WORKING INTERMITTENTLY THEN THE RIGHT FRONT PASSENGER SIDE DOOR LOCK STOPPED WORKING INTERMITTENTLY.  I NEVER KNOW IF THE DOORS ARE LOCKED OR UNLOCKED. IF THE FOB WAS USED TO LOCK THE CAR AND THELOCK DID NOT FULLY LOCK, YOU CAN OPEN THE DOOR BUT THEN IT SETS OFF THE CAR ALARM. THE REMOTE START WILL NOT WORK ANYMORE WHICH I AM ALSO GUESSING IS DUE TO THE LOCKING ISSUE. SPOKE TO THE DEALER BUT MY CAR IS OVER 3 YEARS OLD AND I DID NOT PURCHASE AN EXTENDED WARRANTY, SO THEY SAY IT'S AN EXTREMELY COSTLY DIAGNOSIS AND REPAIR. I FEEL THIS IS A HUGE SAFETY ISSUE, ESPECIALLY FOR A CAR THATS ONLY A LITTLE OVER 3 YEARS OLD.",
        "vin": "1N4AL3APXHC"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/02/2020",
        "dateOfIncident": "08/30/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352830,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2017 ALTIMA IS EXPERIENCING A SPORADIC  DELAY WHEN ACCELERATING FROM A STOP.  IT WON'T  REV OR DO ANYTHING FOR A COUPLE OF SECONDS NO  MATTER HOW FAR DOWN THE PEDAL IS.  THEN ALL OF  A SUDDEN IT'LL GO. I'VE ALMOST DIED MULTIPLE TIMES NOW BECAUSE OF THIS, THIS IS GOING TO COST SOMEONE THEIR LIFE!     I'VE NOW BROUGHT IT TO THE DEALER WHERE I BOUGHT IT TWICE FOR THEIR REVIEW AND EACH TIME THEY'VE CLAIMED THEY CAN'T FIND A PROBLEM.     THIS SEEMS TO BE A WIDESPREAD ISSUE: HTTPS://WWW.CARGURUS.COM/CARS/DISCUSSION-T63248_DS999189",
        "vin": "1N4AL3AP2HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/01/2020",
        "dateOfIncident": "08/31/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352418,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TRANSMISSION IS SLIPPING AT 50K MILES.       I'M EXPERIENCING HESITATION AND JERKING  WHILE DRIVING. TODAY I HAD TO PULL OFF TO THE SIDE OF THE HIGHWAY BECAUSE I WAS SO SCARED THAT MY CAR GOING TO SHUT OFF WHILE DRIVING. I STOP AT A RED LIGHT AND MY CAR STALL & WOULDN'T MOVE FOR A FEW SECONDS. I HAD TO PUT MY EMERGENCY BLINKER ON. I'M SO SCARED OF DRIVING THIS VEHICLE BECAUSE IF MY CAR STOP WHILE DRIVING AND SOMEONE  HIT ME FROM BEHIND, I MIGHT END UP DEAD.",
        "vin": "1N4AL3AP9HN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/01/2020",
        "dateOfIncident": "08/31/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352557,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM AN OWNER OF A 2017 NISSAN ALTIMA. WITHIN TWO WEEKS MY TRANSMISSION TENDS TO JUMP, JERK, WHILE ACCELERATING. THE CHECK ENGINE COMES ON. ACCORDING TO AUTO ZONE, IT'S A P0776 CODE. I SPENT $152 FOR TAKING IT TO BE CHECKED OUT AT A DEALERSHIP. I WAS TOLD THAT THE TRANSMISSION IS SLIPPING.   I REACHED OUT TO SOMEONE AT NISSAN DEALER, WHEN I WAS INFORMED THAT THERE IS NO DIFFERENCE BETWEEN THE 2016 2016 TRANSMISSION AND THE 2017 TRANSMISSION.    ON MY WAY HOME FROM THE DEALERSHIP, MY TRANSMISSION SLIPPED AGAIN. PRIOR TO ALL THIS, I HAD NO ISSUES OR COMPLAINT. CURRENTLY, MY VEHICLE HAS 72,475 MILES ON IT.",
        "vin": "1N4AL3AP2HN"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "09/01/2020",
        "dateOfIncident": "08/24/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352577,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 NISSAN ALTIMA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V315000 (LATCHES/LOCKS/LINKAGES) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE RECALL LETTER STATED THAT THE REMEDY WOULD BE AVAILABLE IN MID 2021. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "1N4AL3AP9HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/29/2020",
        "dateOfIncident": "07/08/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352049,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION TENDS TO JUMP WHEN ACCELERATING AND CAR JERKS EVEN WHEN PRESSING ON THE GAS GRADUALLY. THE CHECK ENGINE LIGHT WILL THEN FLICKER ON AND OFF BUT DOESN'T STAY ON LONG ENOUGH FOR ME TO MAKE IT TO THE SHOP.",
        "vin": "1N4BL3AP8HC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/27/2020",
        "dateOfIncident": "08/15/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351638,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS A RECALL ON 2013 TO 2016 ON SUPPLEMENTAL AIRBAG WARNING LIGHTS, WHICH CAME OUT IN 2017,HOWEVER THEY NEVER FIXED THE 2017 MODELS THAT WERE ALREADY OUT UNDER THE NEW RECALL. THE SUPPLUMENTIAL WARNING G LIGHT STAYS ON, AND THE NISSIAN WILL CHARGE $2000 TO FIX.",
        "vin": "1N4AL3AP8HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/27/2020",
        "dateOfIncident": "08/27/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351673,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR LOST POWER WHILE TURNING ON TO HIGHWAY   CAR LOST POWER WHILE DRIVING FOWN INTERSTATE  TRANSMISSIONBIS FAULTY NISSAN ADMITS TO KNOWING IT AND WON'T RECALL IT. I HAVE POWER TRAIN WARRNENTY AND THEY WON'T ACKNOWLEDGE IT. THE BILL IS 3600. THIS IS NOT SAFE THE CAR LOSES POWER WHILE DRIVING YOU HAVE NO ABILITY TO PRESS GAS. NO WARNING NO LIGHTS NO POWER SOME ONE COULD DIE",
        "vin": "1N4AL3AP6HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/15/2020",
        "dateOfIncident": "05/29/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349583,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE TRANSMISSION QUITE WORKING AT ONLY 92996. I HAVE HAD THE VEHICLE FOR 3 YEARS AND WELL MECHANICALLY MAINTAINED ALL THE TIME. DEALERSHIP AND MANUFACTURE COMPANY IS WILLING TO DO ANYTHING ABOUT THE FAULTY TRANSMISSIONS THAT THEY KNOW THEY PUT IN THE VEHICLES. ALTIMAS UP TO 2016 HAS HAD THEIR WARRANTY EXTENDED BUT COMPANY REFUSES TO ADD THE 2017 TO THE LIST.",
        "vin": "1N4AL3AP5HN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/13/2020",
        "dateOfIncident": "08/11/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349124,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "COLLISION LIGHT SHOWS UP ON DASH. THE LIGHT COMES ON ALL THE TIME WHEN DRIVING ON LITTLE BUMPY HIGHWAY STREETS AND / OR  DRIVING DOWN ON BRIDGES. LIGHT TURNS OFF AFTER DRIVING FOR SOME TIME.  NISSAN DEALERSHIP HAS CHECKED AND COULD NOT FIND ANY PROBLEM.   NO DTC. WAS PRESENT WHEN SCANNED BY TECHNICIAN.  CAR IS DRIVEN 17500 MILES ONLY AND NO ACCIDENTS.",
        "vin": "1N4AL3AP5HC"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "08/12/2020",
        "dateOfIncident": "08/12/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348792,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 NISSAN ALTIMA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V315000 (LATCHES/LOCKS/LINKAGES) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. AN UNKNOWN DEALER WAS CONTACTED AND CONFIRMED THAT PARTS WOULD NOT BE AVAILABLE UNTIL 2021. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "1N4AL3AP6HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/12/2020",
        "dateOfIncident": "07/28/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348913,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TRANSMISSION IS SLIPPING AT 80K MILES. MY VEHICLE HAS BEEN WELL-MAINTAINED AND I AM AWARE OF THE CLASS ACTION LAWSUIT FOR TRANSMISSIONS  THAT AFFECTS NISSANS OF MY SAME YEAR.     MY VEHICLE SHAKES, I EXPERIENCE HESITATIONS AND JERKING WHILE DRIVING. POWER LOSS BUT NO STALLING YET.",
        "vin": "1N4AL3AP0HC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/06/2020",
        "dateOfIncident": "07/10/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343784,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE TAKEN MY CAR IN SERVAL TIMES TO HOPFULLY GET THIS PROBLEM FIXED BUT THEY CAN'T FIGURE OUT WHAT IT IS! MY STEERING WHEEL LOCKS UP WHEN I'M ON THE ROAD OR TURNING AND I CAN'T TURN MY WHEEL WHEN IT LOCKS ON ME. I HAVE BLOWN A TIRE BECAUSE OF THIS ISSUE IT PUSHED ME OFF THE ROAD AND I COULDN'T CORRECT IT UNTIL THE STEERING WHEEL LOOSENED UP. I HAVE 3 KIDS AND I DON'T FEEL SAFE IN MY OWN CAR NISSIAN CAN'T FIGURE OUT WHAT IS WRONG WITH IT BUT IT DOES IT IN TOWN RANDOMLY  AND EVEN ON THE INTERSTATE AND I CAN'T DO ANYTHING UNTIL  IT UNLOCKS. LIKE I SAID IT'S BEEN DOING IT FOR OVER A YEAR NOW BUT HAS JUST BECAME MORE OFTEN OVER TIME AND MORE DANGEROUS I AM SCARED TO DRIVE MY OWN CAR",
        "vin": "1N4AL3AP1HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/05/2020",
        "dateOfIncident": "07/25/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343508,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS A 2017 NISSAN ALTIMA WITH ONLY 67,000 MILES ON IT. UNTIL 7/25/20, I HAD NO ISSUES OR COMPLAINTS. ON 7/25/20 THE GEAR STARTED DELAYING SO I IMMEDIATELY TOOK IT IN TO A LOCAL AUTO SHOP. I HAD TO PAY $130 FOR THEM TO TELL ME I NEEDED A BRAND NEW TRANSMISSION ON A 3 YEAR OLD CAR WITH EXCEPTIONAL CONDITION AND MAINTENANCE. NISSAN WAS AWARE OF THIS ISSUE BECAUSE THEY EXTENDED THE CVT TRANSMISSION WARRANTY ON THE 2015 ALTIMAS, BUT BECAUSE MINE WAS 7,000 MILES OUT OF THE STANDARD WARRANTY AND THE 2017 VEHICLES WEREN'T SPECIFICALLY INCLUDED IN THE EXTENSION, I WAS BEING ASKED TO PAY $6000 FOR THE REPLACEMENT. THEY ULTIMATELY OFFERED 60% OF COVERAGE BECAUSE OF THE FAULTY TRANSMISSIONS BUT NOW I AM DEALING WITH THE ALIGNMENT NOT WORKING AND THE CAR STILL JERKING AFTER PAYING AN ADDITIONAL $1650. I AM LIVID AND UPSET THAT THIS IS NOT ONLY A KNOWN ISSUE BUT THAT NISSAN IS NOT TAKING CARE OF THEIR CUSTOMERS. I HAVE CHILDREN I DRIVE AROUND AND IT'S NOT SAFE TO BE DOING SO WITH A CAR THAT HAS DEFECTIVE PARTS.",
        "vin": "1N4AL3AP5HN"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/05/2020",
        "dateOfIncident": "08/03/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343568,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THIS CAR FROM A DEALERSHIP AND THERE WAS A SAFETY RECALL DEALING WITH THE HOOD LATCH",
        "vin": "1N4AL3AP9HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/01/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342721,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION ON MY 2017 NISSAN ALTIMA FAILED AFTER 35,000 MILES.  THE TRANIMSSION WAS REBUILT A WEEK AGO AND THE REBUILT CVT TRANSMISSION ALSO FAILED BEFORE THE CAR REACHED 36,000 MILES.  I DO NOT TRUST NISSAN TRANSMISSIONS AND FEEL THAT THIS CAR WILL FAIL ON ME AGAIN STOPS ACCLERATING WHICH HAS HAPPENED TO ME TWICE ALREADY.",
        "vin": "1N4AL3AP5HC"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": true,
        "dateComplaintFiled": "07/28/2020",
        "dateOfIncident": "07/24/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341784,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 NISSAN ALTIMA.  THE CONTACT STATED WHILE DRIVING 65 MPH THE HOOD OPENED WITHOUT WARNING. THE CONTACT STATED THAT HE STOPPED IN THE MEDIAN OF THE HIGHWAY TO CLOSE THE HOOD AND AS A RESULT AN UNKNOWN VEHICLE CRASHED INTO THE PASSENGER'S SIDE OF THE VEHICLE. THE CONTACT STATED THAT BOTH FRONT AND REAR PASSENGER SIDE DOORS WERE UNABLE TO CLOSED. THERE WAS NO FIRE, AIR BAG DEPLOYMENT, OR POLICE REPORT FILED. THE LOCAL DEALER AND MANUFACTURER WERE NOT CONTACTED. THE CONTACT CALLED HIS INSURANCE COMPANY WHERE INFORMED THE DAMAGE WAS NOT COVERED. THE CONTACT MENTIONED THE HOOD WAS UNLATCHED ON SEVERAL OCCASIONS, PREVIOUSLY. THE FAILURE MILEAGE WAS 72,465. INVALID VIN.*DT LN*JB",
        "vin": "1N4AL3AE3HN"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/23/2020",
        "dateOfIncident": "06/30/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341084,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE REAR DOOR WONT LOCK AS WELL AS WINDOW DOES NOT GO DOWN ALL THE WAY.",
        "vin": "1N4AL3AP1HN"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/21/2020",
        "dateOfIncident": "04/30/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340751,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 NISSAN ALTIMA. THE CONTACT STATED SHE NOTICED THE HOOD LATCH WAS CONSTANTLY UNLATCHED. THE CONTACT STATED THE FAILURE RECURRED THREE TIMES. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V315000 (LATCHES/LOCKS/LINKAGES) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. ADDITIONALLY, WHILE DRIVING AT AN UNDISCLOSED SPEED, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE RESTARTED. A DEALER WAS NOT NOTIFIED OF THE FAILURE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER HAD NOT BEEN MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "1N4AL3AP6HC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/19/2020",
        "dateOfIncident": "06/02/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340241,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HOOD LATCH",
        "vin": "1N4AL3AP9HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/17/2020",
        "dateOfIncident": "06/30/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339953,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 30 JUNE, 2020, AT APPROXIMATELY 4:15 PM, MY 3 YEAR OLD NISSAN ALTIMA STOPPED ACCELERATING. I WAS ON INTERSTATE 64 EAST BOUND GOING UP THE HIGH RISE BRIDGE. ABOUT HALF WAY UP I WAS NO LONGER ABLE TO ACCELERATE. MY MOMENTUM ALLOWED ME TO REACH THE TOP AND COAST DOWN THE OTHER SIDE. DUE TO BEING IN THE LEFT LANE AND RUSH HOUR TRAFFIC THIS CAUSED A SAFETY ISSUE FOR MYSELF AND OTHER DRIVERS. ALTHOUGH NO ONE WAS HURT, THE POTENTIAL FOR IT WAS HIGH. AFTER GETTING TO THE SIDE OF THE ROAD AT THE BOTTOM OF THE BRIDGE NEAR MILE MARKER 294, I TURNED THE VEHICLE OFF THEN BACK ON, NO CHANGE. I WAS ABLE TO BACK UP AND REV THE ENGINE IN NEUTRAL BUT NO REVVING/RPM INCREASE OR NON GRAVITY FORWARD MOTION WHILE IN DRIVE. AFTER GETTING TOWED TO THE DEALER, I WAS TOLD THE NEXT DAY THAT THE PROBLEM WAS A BAD THROTTLE BODY. I RESEARCHED IT AND THE SYMPTOMS DID NOT MATCH A THROTTLE BODY ISSUE. I ALSO RESEARCH TO SEE OF OTHERS HAD THIS ISSUE AND IT APPEARS TO BE COMMON WITH NISSAN VEHICLES. MY VEHICLE IS STILL UNDER WARRANTY. SOME OTHERS WITH VEHICLES UNDER WARRANTY WERE ALSO TOLD THE SAME THING. OFTEN WHEN THIS SAME PROBLEM OCCURRED WITH OTHER VEHICLES AFTER THE WARRANTY WAS UP, AND REOCCURRED AFTER THE WARRANTY WAS OFF, THEY WERE TOLD IT WAS A TRANSMISSION ISSUE. DUE TO THE NATURE OF THIS ISSUE AND THE POTENTIAL FOR SERIOUS HARM, I THINK THIS SHOULD BE LOOKED INTO. I WAS ON A BRIDGE AND IN A CONSTRUCTION AREA. THIS COULD HAVE CAUSED A REALLY BAD ACCIDENT, AND HURT PEOPLE. NISSAN NEEDS TO BE HELD ACCOUNTABLE FOR EQUIPMENT THAT THEY KNOW IS DEFECTIVE.",
        "vin": "1N4AL3AP9HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/16/2020",
        "dateOfIncident": "07/10/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339834,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING THE VEHICLE WHEN SUDDENLY IT LOST POWER AND WOULD HARDLY MOVE EVEN WITH THE GAS PEDAL PUSHED ALL THE WAY TO THE FLOOR. I HAD THE CAR TOWED TO A MECHANIC WHERE I WAS TOLD THAT I NEEDED A NEW TRANSMISSION.",
        "vin": "1N4AL3APXHC"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/10/2020",
        "dateOfIncident": "07/10/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338687,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY NISSAN ALTIMA 2017 WILL JUST STOP ACCELERATING OUT OF NOWHERE WHILE OTHER VEHICLES ARE COMING BEHIND ME ON THE INTERSTATE ROAD THIS MAY CAUSE AN ACCIDENT AND IT HAPPENS LIKE ALMOST EVERY 3 WEEKS BACK TO BACK, SINCE DECEMBER 2019 TILL DATE MY CAR DOESN'T ACCELERATE AND WILL BE MOVING TOO SLOW LIKE ITS ABOUT TO STOP ON THE ROAD WHILE STILL DRIVING AND ALL OF A SUDDEN IT WILL ACCELERATE SLOWLY AND MOVE BUT STILL NOT MOVING LIKE NORMAL.",
        "vin": "1N4AL3AP8HC"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/09/2020",
        "dateOfIncident": "07/09/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338499,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION ON MY ALTIMA WAS STRUGGLING TO SHIFT GEARS WHILE ON THE HIGHWAY.  THE CAR DROVE AS THOUGH IT WAS STUCK BETWEEN DRIVE AND NEUTRAL.  AFTER EXITING THE OFF-RAMP MY CAR WOULD NOT ACCELERATE AND WAS ADRIFT.  SHIFTING FROM VARIOUS GEARS AND BACK TO DRIVE DID NOTHING.  I HAD TO TURN THE CAR OFF AND THEN BACK ON AND SHIFT TO DRIVE AS LOWER DRIVE DID NOT WORK.  I WAS ABLE TO DRIVE TO A DEALERSHIP BUT COULD FEEL THE CAR'S TRANSMISSION DYING ALONG THE WAY.  THE ALTIMA WAS 2017 WITH ONLY 35,000 MILES.  I PURCHASED THE CAR USED WITH ONLY 5,000 MILES.",
        "vin": "1N4AL3AP5HC"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/29/2020",
        "dateOfIncident": "05/13/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331582,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WILL STOP ACCELERATING OUT OF NOWHERE .   CAR WILL SPIKE THE RPMS BUT CAR DOESN'T ACCELERATE WHILE DRIVING   I WAS ALMOST T-BONED WHEN MY CAR DELAYED FOR 4 SECONDS BEFORE IT ACCELERATED .   NISSAN IS CLAIMING IT'S THE TRANSMISSION AND IT'S NOT FAULTY . THIS HAS BEEN A NIGHTMARE . IF THEY DO NOT FIX NISSAN WILL ME LOSING MY BUSINESS .  *TR",
        "vin": "1N4AL3AP6HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/25/2020",
        "dateOfIncident": "06/24/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330748,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SOLENOID IN THE TRANSMISSION RESPONSIBLE FOR SHIFTING WENT BAD AT 67,000 MILES AND THE VALVE BODY HAD TO BE REPLACED IN THE TRANSMISSION.    I WAS DRIVING AND WHEN IT WAS NEEDING TO MAINTAIN THE SPEED WITHOUT GAS OR BRAKE APPLIED IT WOULD JUMP BETWEEN GEARS WITHOUT REASON AND FELT LIKE A SHUDDER AS I WAS DRIVING IT.  *TR",
        "vin": "1N4AL3AP6HN"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/24/2020",
        "dateOfIncident": "06/03/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330584,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2017 NISSAN ALTIMA AND THE ABS LIGHT COMES ON AND OFF. I REPORTED THE ISSUE TO NISSAN BUT I WAS TOLD THAT BECAUSE MY CAR WAS NOT LISTED IN THE CAMPAIGN THERE WAS NOTHING THAT THEY COULD DO.  *TR",
        "vin": "1N4AL3AP2HN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/05/2020",
        "dateOfIncident": "02/10/2020",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327431,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "II NOTICED A WEIRD SMELL COMING FROM THE ENGINE FOR A ABOUT MONTH BUT DIDN'T THINK ANYTHING OF IT. I WAS DRIVING ON MY WAY TO WORK WHEN MY CAR STARTED SMOKING, SHUT OFF, AND CAUGHT ON FIRE! HAD THIS CAR FOR NOT EVEN 1 YEAR WHEN THIS INCIDENT HAPPENED. TOOK GOOD CARE OF THE CAR, TOOK IT TO GET OIL CHANGES. NOT SURE HOW THIS CAN RANDOMLY HAPPEN.   *TR",
        "vin": "1N4AL3AP9HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/31/2020",
        "dateOfIncident": "05/21/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326707,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION HAS GONE OUT AT 76000 MILES ON THE FREEWAY. COULDN'T GET MY SPEED OVER 45 MPH. THOUGHT I WAS GONNA DIE! NISSAN REFUSES TO HELP ME. THEY WANT 4000 DOLLARS TO REPLACE THE CRAP CVT TYRANNY.",
        "vin": "1N4AL3AP6HC"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/29/2020",
        "dateOfIncident": "05/22/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326545,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2017 ALTIMA IS EXPERIENCING A SPORADIC   DELAY WHEN ACCELERATING FROM A STOP.  IT WON'T   REV OR DO ANYTHING FOR A COUPLE OF SECONDS NO   MATTER HOW FAR DOWN THE PEDAL IS.  THEN ALL OF   A SUDDEN IT'LL GO.  THERE IS NO CHECK ENGINE   LIGHT AND NO CODES.  IF I TURN THE CAR OFF, IT'S   LIKE IT RESETS AND HAS MORE POWER AFTERWARDS.  *TR",
        "vin": "1N4AL3AP2HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/27/2020",
        "dateOfIncident": "03/11/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326234,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS A DELAY WHEN ACCELERATING, WHEN STARTING FROM A STOP.  YOU HAVE TO BE CAREFUL NOT TO PUSH TOO FAR ON THE ACCELERATOR SINCE THE CAR WILL EVENTUALLY ACCELERATE. THE TACHOMETER WILL ALSO GO UP TO 5000 RPM WHEN GOING BETWEEN 55 AND 60MPH.  IT WILL NOT SHIFT DOWN AT HIGH WAY SPEED.  THE ONLY WAY TO CORRECT EITHER ISSUE IS TO TURN THE CAR OFF AND ON.   BOTH ISSUES ARE INTERMITTENT BUT IF ONE OCCURS THE OTHER DOES ALSO.  THIS ONLY HAPPENS AFTER COME TO A STOP A FREE DRIVING FOR A PERIOD OF TIME.   THE VEHICLE IS JUST UNDER THREE YEARS OLD WITH 54,000 MILES.    RECENTLY I HAD THE DEALER LOOK AT IT AND I HAD TO HAVE THE TRANSMISSION FLUID CHANGED/INSPECTED, CODES/COMPUTER CHECKED AND THE PROGRAM UPDATED FOR A GRAND TOTAL OF $330.   TIME WILL TELL IF FIXED THE ISSUE.  I HAD TO PAY FOR THIS EVEN THOUGH I AM UNDER THE 60000 POWERTRAIN WARRANT AND THE 60000 MILE RECOMMENDED TRANSMISSION FLUID CHANGE.  *TR",
        "vin": "1N4AL3AP1HC"
    },
    {
        "components": "STRUCTURE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/22/2020",
        "dateOfIncident": "06/30/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325521,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR PASSENGER DOOR CAN'T BE OPENED FROM THE INSIDE.  CABLING CAME LOOSE FROM THE HANDLE APPARENTLY.  DOOR IS ABLE TO BE OPEN FROM THE OUTSIDE.  IT WAS LIKE THE CHILD SAFETY LOCK WAS ON.    ALSO THE FRONT FLOOR MAT EYE HOOK RING TORE AWAY FROM THE FLOOR MAT ALLOWING IT TO MOVE UP UNDER THE GAS AND BREAK PEDAL.  *TR",
        "vin": "1N4AL3AP3HN"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/21/2020",
        "dateOfIncident": "05/21/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325389,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A USED 2017 NISSAN ALTIMA WITH NO PROBLEMS WITH IT AND NO ACCIDENTS SINCE I'VE HAD IT. THERE'S QUITE  COLLECTION OF WATER ON THE BACK PASSENGER SIDE. NO LEAKS FROM THE ROOF, DOORS, OR WINDOWS.  *TR",
        "vin": "1N4AL3AP8HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/15/2020",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324609,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FOB HAD STOPPED WORKING ONLY THING IT'S DOES IS START THE CAR NO REMOTE START NOT UNLOCK DOORS. AFTER PAYING 200 FOR A NEW PHONE TO BE PROGRAMMED NOT TO MUCH THE THOUSANDS OF DOLLARS I HAVE SPENT IN GETTING LOCK OUT ASSISTANCE FOR LOCKING  KEYS IN CAR A FOB IS EASILY LOST WHEN IT HAD TO BE UNATTACHED FROM THE DOOR KEY ITSELF.  *TR",
        "vin": "1N4AL3AP1HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/14/2020",
        "dateOfIncident": "02/13/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324532,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR GET CRAZY ELECTRICAL DRIVING ON THE HIGHWAY THE TRANSMISSION SLEEP ALONE 5 MINUTES LATER CAR TURN ON BY SELF LIKE NOTHING HAPPENED WHEN STAR HAPPENED I TRY TO STOP THE CAR BRAKE DON'T WORK CAR STILL RUNNING ONLY THINK ITS WORK EMERGENCY BRAKE.  *TR",
        "vin": "1N4AL3AP4HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/12/2020",
        "dateOfIncident": "05/08/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324314,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "IT WAS CLEAR FOR ME TO PULL OUT ON TO THE HIGHWAY FROM A COMPLETE STOP. AS I WAS ALMOST IN MY LANE OF TRAFFIC MY CAR STARTED JERKING, SLIPPING, AND WAS UNABLE TO DRIVE SAFELY.  *TR",
        "vin": "1N4AL3AP3HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/10/2020",
        "dateOfIncident": "05/10/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324047,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER DRIVING HOME FROM A TRIP TO THE LAKE OUR CAR STARTED HAVING DIFFICULTY ACCELERATING FROM STOP LIGHTS IN DRIVE. . IT WOULD SEEM TO STALL OUT AND NOT ACCELERATE. LUCKILY IT WORKED ENOUGH TO GET US THE LAST MILE HOME. TODAY (THE NEXT DAY) MY HUSBAND WENT TO GO RUN ERRANDS AND AFTER PUTTING THE 2017 NISSAN ALTIMA INTO GEAR THE CAR WILL NOT MOVE. THE CAR IS PARKED IN OUT DRIVEWAY. THERE IS A WHINING SOUNDS THAT COMES OUT OF THE ENGINE WHILE IDLING.  WHEN THE CAR IS PUT INTO GEAR THE WHINING GETS LOUDER AND THE RPMS WILL JUMP UP BUT THE CAR WILL NOT MOVE AT ALL. NO MATTER WHAT GEAR THE VEHICLE IS PUT IN.  *TR",
        "vin": "1N4AL3AP2HC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/08/2020",
        "dateOfIncident": "05/06/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323830,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 NISSAN ALTIMA. THE CONTACT STATED WHILE DRIVING AT 60 MPH, THE VEHICLE DECELERATED INDEPENDENTLY WITHOUT WARNING. THE CONTACT STATED THAT THE VEHICLE WAS TOWED TO HER RESIDENCE. THE VEHICLE WAS NOT TAKEN TO BE DIAGNOSED NOR REPAIRED. NEITHER THE DEALER NOR THE MANUFACTURER WERE NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 75,000.",
        "vin": "1N4AL3AP0HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/28/2020",
        "dateOfIncident": "04/27/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322482,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ON THE HIGHWAY BACK IN FEBRUARY AND MY CAR STOPPED AT A CERTAIN SPEED AND WHEN I TRIED TO GO FASTER THE CAR WOULDN'T PICK UP SPEED. NO CHECK ENGINE LIGHT WAS ON.I TOOK IT TO A MECHANIC AND THEY SAID THEY COULDN'T FIND ANYTHING WRONG. THERE HAVE BEEN SEVERAL OCCASIONS WHERE I'VE STOPPED AT A STOP LIGHT AND WHEN TIME TO GO THE CAR SEEM TO STALL FOR A MINUTE BEFORE MOVING. JUST A FEW DAYS AGO MY CHECK ENGINE LIGHT CAME ON AND I TOOK IT BACK TO THE MECHANIC TO BE TOLD THE CODE THAT CAME UP WAS P0776 AND I WOULD HAVE TO REPLACE MY TRANSMISSION. THE MECHANIC CALLED NISSAN AND WAS TOLD THEY MY MODEL AND YEAR CAR DOES NOT HAVE THE EXTENDED WARRANTY AND THEY WILL NOT COVER IT. I HAVEN'T EVEN HAD THIS CAR FOR 3 YEARS YET. I'M CONCERNED FOR MY SAFETY IN THIS VEHICLE. I HAVE 3 KIDS WHICH ONE IS A NEWBORN THAT I TRANSPORT IN THIS VEHICLE. NISSAN NEEDS TO BE HELD ACCOUNTABLE FOR THIS.",
        "vin": "1N4AL3AP3HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/08/2020",
        "dateOfIncident": "02/22/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320599,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL ROTORS ARE BAD PADS OK",
        "vin": "1N4AL3AP7HC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/24/2020",
        "dateOfIncident": "03/22/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319097,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "PUSH BUTTON START FAILS IN DRIVEWAY",
        "vin": "1N4AL3AP7HN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/15/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318124,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE 2ND NISSAN ALTIMA WITH TRANSMISSION/POWER TRAIN ISSUES. THE FIRST I IMMEDIATELY RETURNED THINKING THAT PERHAPS IT WAS AN ISOLATED INCIDENT. MY CAR DOES NOT WANT TO ENGAGE ON TAKE OFF. THE RPMS GO UP REALLY HIGH AND THE CAR BARELY TAKES OFF. THIS OCCURS DURING ALL WEATHER CONDITIONS ON ALL TERRAINS.",
        "vin": "1N4AL3AP9HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/15/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318123,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE 2ND NISSAN ALTIMA WITH TRANSMISSION/POWER TRAIN ISSUES. THE FIRST I IMMEDIATELY RETURNED THINKING THAT PERHAPS IT WAS AN ISOLATED INCIDENT. MY CAR DOES NOT WANT TO ENGAGE ON TAKE OFF. THE RPMS GO UP REALLY HIGH AND THE CAR BARELY TAKES OFF. THIS OCCURS DURING ALL WEATHER CONDITIONS ON ALL TERRAINS.",
        "vin": "1N4AL3AP9HC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "03/12/2020",
        "dateOfIncident": "03/12/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317756,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 6 ALTIMA, THIS  ONE,  HAS BY FAR BEEN THE WORST!I TOOK IT TO DEALERSHIP FOR RECALLS & RECVD A NEW BATTERY, I  TOLD THEM THE BRAKES DON'T STOP THE VEHICLE, THEY TURNED FRONT ROTERS, I TOOK IT BACK FOR SEVERE SQUEAKY SQU DEALERSHIP DID NOT HEAR A THING! I HAVE SINCE BEEN IN A REAR END COLLISION UNABLE TO STOP THE VEHICLE AND A DRIVER LEFT TURN COLLISION AGAIN UNABLE TO STOP THE VEHICLE, I  WENT BACK TO THE DEALERSHIP AND RECVD ANOTHER NEW BATTERY BUT BRAKES ARE FINE!!  LAST NIGHT IN THE RAIN APPROACHING A RED LIGHT,   NOT HYDROPLANING,  AGAIN ALMOST  HIT A STOPPED CAR & SWERVED. THEYKEEP INSISTING IT IS MY DRIVING CAUSING THE ISSUE, MY CAR HAS 20,00 MI  I WANT A BRAND NEW ALTIMA WITH PROPERLY WORKING PARTS! I CALLED BOTH BRANCH & DISTRICT MANAGER WITH NO RETURN CALL!  I WILL ESCALATE TO THE TOP OF NISSAN!",
        "vin": "1N4AL3AP0HC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/08/2020",
        "dateOfIncident": "03/05/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316817,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I PULLED OUT ONTO THE HIGHWAY FROM WORK AS I NORMALLY WOULD, MY CAR IMMEDIATELY STALLED AND WOULD NOT EVEN GO PAST 20 MILES PER HOUR EVEN THOUGH I HAD THE PEDAL DOWN TO THE FLOOR. I LIFTED MY FOOT SLOWLY UP FROM THE PEDAL HAVING TO PULL OVER TO THE RIGHT LANE AND IT STARTED TO ACCELERATE MORE AFTER A GOOD MINUTE. I GOT MAYBE 3 MILES UP THE ROAD AND SLOWED DOWN BEHIND A DIESEL AND MY CAR STALLED AGAIN WITH MY FOOT COMPLETELY ON THE FLOOR PUSHING MY GAS PEDAL, IT STAYED UNDER 40 MPH FOR A GOOD 30 SECONDS. IT TOOK ME A MINUTE TO UNDERSTAND WHAT WAS GOING ON. I KNOW THE SYMPTOMS BECAUSE I HAD PREVIOUSLY OWNED A NEWER 2017 CHEVY MALIBU, I WAS THE ONLY OWNER OF THE VEHICLE AND MY THROTTLE POSITION SENSOR WENT OUT AT 22,000 MILES. THEY SAID IT WASNT NORMAL FOR IT TO GO OUT THAT EARLY, BUT MINE DID. IT WASNT A RECALL WHEN IT WENT OUT, BUT BECAME A RECALL AFTERWARDS IN LESS THAN A MONTH. THAT COULD HAVE KILLED ME AS MY CAR SUDDENLY REDUCED ENGINE SPEED WHILE PULLING OUT OF A RESTAURANT, LUCKILY I WAS ABLE TO PULL OVER SLIGHTLY TO A NEARBY GAS STATION.",
        "vin": "1N4AL3AP0HN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/08/2020",
        "dateOfIncident": "03/08/2020",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316907,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE FIRE STARTED FROM PASSENGER SIDE UNDER HOOD WHILE TRAVELING APPROXIMATELY 55 MPH ON BATTLEFIELD PARKWAY IN RINGGOLD, GA.  CAR HAD 50,000 MILES.  PULLED OVER AND GOT OUT TO CALL 911, CAR GOT ENGULFED IN FLAMES AND IS A TOTAL LOSS.  CATOOSA COUNTY SHERIFF AND CATOOSA COUNTY FIRE DEPARTMENT RESPONDED.",
        "vin": "1N4AL3AP5HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/25/2020",
        "dateOfIncident": "02/12/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311461,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TRANSMISSON STARTED SHUDDERING THEN JUST QUIT PULLING IN THE MIDDLE OF THE INTERSTATE WHICH BOUT GOT ME RAN OVER, THIS WAS LIKE THE THIRD TIME, THERE IS COUNTLESS CASES OF THE SAME EXACT THING HAPPENING WITH THE SAME CAR FROM 2014 TO 2018 MODELS DUE TO CVT TRANSMISSONS, SOMEONE NEEDS TO DO SUM HOMEWORK AND SEE THIS IS GONNA GET SOMEBODY HURT. NISSAN DOESNT WANT TO ADMIT THE ISSUES AND COVER THE ISSUES.",
        "vin": "1N4AL3AP3HC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/20/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310331,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING ON ROUGH TERRAIN GOING AT APPROXIMATELY 30 TO 35 MPH, MY STEERING WHEEL LOCKS UP FOR ABOUT 3 SECONDS AND THEN RELEASES. WHEN THIS ISSUE HAPPENS I AM UNABLE TO CONTROL MY VEHICLE. THE FIRST 3 TIMES THIS PROBLEM HAPPENED I WAS DRIVING ON THE HIGHWAY. THIS ISSUE HAS HAPPENED AT LEAST 4 TIME SINCE I'VE PURCHASED MY VEHICLE ON 12/31/2019.",
        "vin": "1N4AL3AP5HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/20/2020",
        "dateOfIncident": "09/13/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310437,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LOW BEAMS ARE DANGEROUSLY DIM.  I WAS ALMOST IN A ONE CAR ACCIDENT (COULDN'T SEE UPCOMING TRAFFIC CIRCLE) AS A RESULT.  I HAVE TO RELY ON HIGH BEAMS FOR VISIBILITY WHENEVER POSSIBLE .  THIS APPEARS TO BE A COMMON PROBLEM FROM WHAT I'VE RESEARCHED.  I AM POSITIVE THERE WILL BE ACCIDENTS IF THIS ISSUE IS NOT FIXED.",
        "vin": "1N4AL3AP8HN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/20/2020",
        "dateOfIncident": "02/08/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310445,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TRYING TO ACCELERATE, THE CAR WILL HESITATE TO GAIN POWER FROM A STOP POSITION. SOMETIMES THE RPMS WILL RAMP UP WITHOUT ME PRESSING HARD ON THE GAS PEDDLE. I HAVE TAKEN IT TO ADVANCE AUTO AND THE CODE THAT COMES UP IS P0776 PRESSURE CONTROL SOLENOID. THE DEALERSHIP SAYS THAT THE WARRANTY IS EXPIRED BUT I'VE ONLY HAD THIS CAR FOR 7 MONTHS. AND I'M SURE OTHERS ARE HAVING THIS ISSUES IF NOT NOW VERY SOON. CUSTOMER WILL VERY MUCH SOON BE VERY PISSED OFF AFTER 7 MONTHS OF HAVING THEIR VEHICLE OR WHEN THE TRANSMISSION HITS 60K. AT THIS POINT I DON'T KNOW WHAT TO DO AND THIS HAS BEEN A NIGHTMARE AND I FEEL LIKE IT WAS A MISTAKE GETTING THIS CAR.",
        "vin": "1N4AL3AP0HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/10/2020",
        "dateOfIncident": "02/07/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308161,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING THE VEHICLE WILL MAKE A VIBRATION NOISE, LOSES POWER. ABSOLUTELY NO THROTTLE RESPONSE. ALMOST LIKE GETTING NO FUEL, BUT YOU CAN HEAR THE ENGINE REVVING AND VEHICLE WILL NOT MOVE. THEN ALL OF THE SUDDEN IT WILL START TO MOVE SLOWLY. THEN IT WILL GO. THIS PROCESS WILL REPEAT OVER AND OVER. UNTIL STOP AND TURN THE CAR OFF. WHEN YOU COME BACK IT ACTS FINE. THEN STARTS OVER ONCE DRIVEN A WHILE. THIS HAPPEN WHEN CITY DRIVING OR HIGHWAY. I FINALLY GOT A LIGHT TO COME ON AFTER SEVERAL MONTHS OF DRIVING THIS WAY. CHECK ENGINE CODE P0776 PRESSURE CONTROL SOLENOID. THAT'S IN THE TRANSMISSION. DEALER SAYS ITS NOT COVERED EVEN THOUGH THERE HAVE BEEN COMPLAINTS AND RECALLS ON OTHER NISSAN MODELS WITH CVT TRANSMISSIONS.",
        "vin": "1N4AL3AP6HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/05/2020",
        "dateOfIncident": "02/05/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307263,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS DRIVING I NOTICED AS I WAS GIVING MY CAR GAS. IT WAS ACTING AS IF IT DIDN'T WANT TO PULL. IT WAS IDLING VERY HIGH AND WOULDN'T GO OVER 30MPH. I BEGAN TO PANIC BECAUSE THIS IS A NEW CAR. I'M LIKE IS IT THE TRANSMISSION. I PULLED OVER CUT THE CAR OFF AND STARTED IT BACK UP. THE CAR BEGAN TO DRIVE BACK NORMAL. IT HAS DONE THIS MANY TIMES BEFORE EVEN WHILE I HAD UBER RIDERS ACTING AS IF IT DOESN'T WANT TO PULL. IT'S WAS IN MOTION EACH TIME IT HAPPENED EVEN ON THE INTERSTATE IN BUSY TRAFFIC.",
        "vin": "1N4AL3AP0HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/05/2020",
        "dateOfIncident": "05/01/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307293,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN VEHICLES PUT IN REVERSE AND THE BACK UP CAMERA IS ENGAGED MOST OF THE TIME THE SCREEN IS VERY DARK YOU HAVE TO PUT THE CAR INTO PARK AND THEN BACK INTO REVERSE AGAIN TO SEE. WHEN VEHICLE IS PUT IN REVERSE AND THE BACK UP CAMERA IS ENGAGED MOST OF THE TIME THE SCREEN IS VERY DARK YOU HAVE TO PUT THE CAR INTO PARK AND THEN BACK INTO REVERSE AGAIN TO SEE. THIS CREATES A SAFETY HAZARD WHEN TRYING TO BACK UP OUT OF TIGHT AREAS AND HAS HAPPENED SEVERAL TIMES OVER THE LAST FEW WEEKS FOR",
        "vin": "1N4AL3AP8HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/04/2020",
        "dateOfIncident": "02/04/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307117,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ISSUES WITH CVT ON MY 17 ALTIMA. CURRENTLY AT THE SHOP FOR THE SECOND TIME. AT COMPLETE STOP THE CAR DOES NOT WANT TO ACCELERATE, I PUSH THE PETAL TO THE FLOOR AND THE RPMS RACE WHILE THE CAR BASICALLY CRAWLS. I HAVE TO TURN THE CAR OFF AND ON AGAIN TO GET IT TO RUN NORMAL. HAPPENS A LOT.",
        "vin": "1N4AL3AP2HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/26/2020",
        "dateOfIncident": "11/05/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302132,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2017 NISSAN ALTIMA  AND MY TRANSMISSION HAS GONE OUT.I HAVE THE NEW CVT TRANSMISSION  AND MY MECHANIC TOLD ME THAT THOSE NEW TRANSMISSIONS ARE HORRIBLE ONCE THEY GO BAD YOU HAVE TO GET A NEW ONE. ALSO THERE ARE TWO CLASS ACTION LAWSUIT AGAINST THE SIZE FOR THOSE SPECIFIC TRANSMISSION. THE FIRST TIME I NOTICED SOMETHING WAS WRONG MY CAR IS WHEN I WAS HEADED TO MIAMI TO THE DOLPHINS STADIUM FOR MY DAUGHTER'S CHEER PERFORMANCE I WAS ON I 95 SOUTH AND MY CAR STARTED JERKING AS IF IT WANTED TO STOP THERE WAS NO CHECK ENGINE LIGHT ON TO INDICATE THAT'S SOMETHING WAS WRONG. I TOOK MY CAR TO AUTO ZONE FOR A FREE DIAGNOSTIC TEST. I CALL NISSAN AND ASKED HOW MUCH WOULD IT BE TO FIX MY CAR THEY REFUSE TO TAKE THE AUTO ZONE DIAGNOSTIC TEST RESULTS THEY WANTED TO CHARGE ME $300 DOLLARS JUST TO LOOK AT MY CAR. THE SECOND TIME MY CAR STOPPED ON ME IT HAPPENED WHEN I WAS HEADED HOME FROM WORK SITTING AT A RED LIGHT ON 441 AND WHEN IT WAS TIME TO GO I PRESS DOWN ON THE GAS IN MY CAR WILL NOT MOVE I WAS SO SCARED I JUST SHUT OFF MY CAR TURNED IT BACK ON AND IT STARTED TO WORK AND THE  LAST TIME IT HAPPENED I WAS ON MY WAY COMING BACK FROM TAKING MY DAUGHTER TO SCHOOL I'M TAKING MY DAUGHTER AND I WAS BUSY INTERSECTION SOUTHERN BOULEVARD MY CAR JUST STOPPED IN THE MIDDLE OF THE ROAD I HAD TO PRESS DOWN ON THE GAS SO MANY TIMES IT'S AGO AND WHEN IT DIDN'T SHUT OFF LIKE A ROCKET I WAS SO SCARED.",
        "vin": "1N4AL3AP3HC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/19/2020",
        "dateOfIncident": "03/20/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300293,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH THE DRIVE SIDE AND PASSENGER SIDE FRONT BRAKES ON MY 2017 NISSAN ALTIMA SR SQUEAK ONLY WHEN GOING IN REVERSE.  THE NOISE IS VERY PRONOUNCED WHEN THE CAR IS DRIVEN OUT OF THE GARAGE IN THE MORNING IN REVERSE.  IT ALSO HAPPENS WHEN THE CAR HAS BEEN PARKED ANYWHERE ELSE FOR A WHILE.  THE BOTTOM LINE IS WHEN THE BRAKES ARE COLD THEY ALWAYS SQUEAK WHEN THE CAR IS DRIVEN IN REVERSE.  THE CAR WAS PURCHASED IN 2017 AND THE BRAKES HAVE BEEN SQUEAKING FOR YEARS.",
        "vin": "1N4AL3AP8HN"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/14/2020",
        "dateOfIncident": "12/18/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299259,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS BEEN HESITATING TO ACCELERATE AND GETS THIS WEIRD MOTION. IT STARTS SOUNDING LIKE THE ENGINE IS GOING FAST BUT IT DOES NOT GO MORE THAN 20 FOR TIMES.",
        "vin": "1N4AL3APXHC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/11/2020",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298526,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LOW BEAM HEADLIGHTS ARE SO DIM THAT DRIVING AT NIGHT IS EXTREMELY DANGEROUS.",
        "vin": "1N4AL3AP3HN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/11/2020",
        "dateOfIncident": "01/09/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298592,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS HEADING SOUTH BOUND ON RT 83. FRONT DRIVER SIDE TIRE BLEW OUT & MY SIDE AIR BAGS DEPLOYED. THIER WAS NO IMPACT TO THE VEHICLE",
        "vin": "1N4AL3AP6HC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/27/2019",
        "dateOfIncident": "10/17/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291432,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE MADE A COMPLAINT TO ATTORNEY GENERAL OFFICE ALSO.. I BOUGHT MY NISSAN BRAND NEW AUGUST 2017, NOT EVEN A YEAR OLD IT STARTED HAVING ISSUES , WITH THE PUSH BUTTON START AND THE BRAKES. I WAS DRIVING HOME FROM WORK AND MY CAR STOP. I COULD NOT MOVE IT THIS WAS 2018 WHERE YOU CANT MOVE THE CAR OR START IT . IT WAS TOWED TO NISSAN DEALER. THEY STATED THAT IT WAS THE BRAKE SWITCH SYSTEM FAILURE .THERE SHOULD BE A RECALL ON THIS PROBLEM WITH 2017 NISSAN ALTIMAS. VERY DANGEROUS! IN 2019 THE SAME ISSUE HAPPEN AGAIN BRAKE SWITCH SYSTEM FAILURE. I ALSO HAVE RECEIPTS STATING THIS. THE CAR STOP ON A BUSY STREET. I WAITED 2 HOURS FOR NISSAN ROAD SIDE ASSISTANCE , THEY TOWED IT TO NISSAN. THIS IS A VERY DANGEROUS ISSUE. THER SHOULD BE A RECALL ABOUT THE BRAKE SWITCH SYSTEM FAILURE.THE TOWED IT TO KLINE NISSAN IN MAPLEWOOD. THIS ISSUE HAPPEN TWICE I DON'T KNOW I MAY HAPPEN AGAIN. I COULD HAVE BEEN ON THE FREEWAY CAR JUST STOPS!! I DID CONTACT NISSAN NORTH AMERICA,CONSUMER AFFAIRS. THEY DID NOTHING I STATED THAT VERY DANGEROUS BRAKE ISSUE AND THERE SHOULD BE A RECALL .",
        "vin": "1N4AL3AP5HC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/08/2019",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287789,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER STEERING PUMP (2017 NISSAN ALTIMA SR, 2.4L, 35,980 MILES) BEGAN TO  PRODUCE WHINING NOISES (HIGH FREQUENCY PITCH SOUNDS) BOTH WHEN THE ENGINE RUNS WITH MOVING AND WHEN THE CAR MOVES. PARTICULARLY, WHEN I TURN THE STEERING WHEEL WHILE THE ENGINE IS ON, IT PRODUCES HIGHER NOISES. IF I DON'T TURN THE POWER STEERING WHEEL WHILE THE ENGINE IS ON, IT PRODUCES LOWER WHINING SOUNDS. THUS, BOULDER NISSAN IN COLORADO REPLACED THE PROBLEMATIC PUMP WITH A NEW ONE. HOWEVER, THE NEW ONE IS NOT THE SOLUTION AT ALL. I HAVE COMPLAINED THIS ISSUE AGAINST BOULDER NISSAN. THEY COULDN'T SOLVE THE ISSUE BECAUSE THE POWER STEERING PUMP ITSELF IS DEFECTIVE. I KNOW ALL OF 2011 ~ 2018 ALTIMA HAVE THE SAME ISSUE, WHICH HAS BEEN WELL KNOWN ON THE INTERNET. NISSAN COMPANY MUST RECALL THE POWER STEERING WHEEL PUMP AND REPLACE IT WITH A NEWLY DESIGNED PUMP (NOT THE SAME DEFECTIVE ONE). WHAT HAPPENS IF THE POWER STEERING WHEEL DOESN'T FUNCTION PROPERLY WHILE DRIVING?",
        "vin": "1N4AL3AP5HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/04/2019",
        "dateOfIncident": "12/04/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286855,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR IS NOT SHIFTING PROPERLY BY ITSELF WHEN ACCELERATING GET STUCK IN THE FIRST GEAR. ALSO PERIODICALLY THE PEDAL HAS A THREE SECOND DELAY WHEN PRESSING ON IT TO ACCELERATE THIS HAPPENS ALMOST DAILY. THE ONLY REMEDY THAT FIXES IT IS TO SHUT THE CAR OFF AND RESTART IT. THIS HAPPENS WHEN THE CAR IS STOPPED AS FAR AS THE PEDAL GOES. THE ACCELERATION WHERE IT DOES NOT SHIFT CAN HAPPEN AT ANY TIME BUT AT LEAST HAPPENS 2 TO 3 TIMES A WEEK DOES IT MATTER IF I'M ON THE HIGHWAY OR ON A REGULAR ROAD.",
        "vin": "1N4AL3AP6HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/21/2019",
        "dateOfIncident": "11/17/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281646,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION WENT OUT AND THE CAR HAD NO POWER.  IT HAPPENED TWICE WITHIN 3 MONTHS AND THE DEALER DIDN'T WANT TO TAKE RESPONSIBILITY THE 2ND TIME, THEY CLAIMED I HAD RODENT DAMAGE TO THE TRANSMISSION SPEED SENSOR HARNESS.  I HAD TO PAY OUT OF POCKET $450.00",
        "vin": "1N4AL3AP3HC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/17/2019",
        "dateOfIncident": "09/02/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280643,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MY CAR IS AT A STOP LIGHT AND THE LIGHT TURNS GREEN, IT TAKES A WHILE FOR MY CAR TO ACCELERATE WHEN I PRESS THE PEDAL. THIS HAPPENS EVERY NOW AND THEN, NOT EVERY TIME. ALSO SOMETIMES WHEN I'M TRYING TO ACCELERATE MY CAR'S RPM STALLS AT THE 3/4 AND STRUGGLES TO SHIFT DOWN LIKE NORMAL. I AM ABLE TO FIX THIS PROBLEM IF I TURN OFF THEN TURN MY CAR BACK ON. THESE ARE TWO LARGE ISSUES THAT I'M HAVING WITH MY 2017 NISSAN ALTIMA.",
        "vin": "1N4AL3AP3HN"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/15/2019",
        "dateOfIncident": "11/12/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280382,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TUESDAY, NOV 12TH, APPROXIMATELY 7 PM, WHILE IN THE MIDDLE OF EVENING TRAFFIC ON A BUSY THOROUGHFARE, VEHICLE LOST COMPLETE POWER AND COASTED TO A STOP ON SIDE OF ROAD. PRIOR TO THIS, VEHICLE LOST POWER TEMPORARY ABOUT 20 MINUTES PRIOR ON ANOTHER VERY BUSY STRETCH OF ROAD BUT WAS ABLE TO RESTART. THROUGHOUT THE DAY, THE CAR WOULD SPUTTER WHILE IN MOTION.  BY THE EVENING THE SPUTTERING BECAME MORE INTENSE AND WAS MORE INDICATIVE OF THE VEHICLE TRYING TO CUT OFF. THE SUDDEN SLOW DOWN, AND ALMOST STOPPING CAUSED DRIVER AND PASSENGER TO JERK FORWARD AND BACK AS THE VEHICLE WOULD SLOW ALMOST TO A COMPLETE STOP (EVEN WITH PRESSURE ON GAS PEDDLE). TO KEEP CAR FROM CUTTING OFF REQUIRED FLOORING GAS PEDDLE. VEHICLE PURCHASED AT APPROX 67,000 MILES ON NOV. 5TH. DISCOVERED HORN DID NOT WORK PROPERLY EITHER.",
        "vin": "1N4AL3AP1HC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/11/2019",
        "dateOfIncident": "10/20/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279333,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR ALWAYS QUIT OFF WHILE I AM DRIVING FOR WHATEVER REASON. I WAS DROPPING MY KIDS OFF AT SCHOOL ONE DAY IN TRAFFIC AND IT CUT OFF ON ME AND IT ALSO CUT OFF ON ME ON THE RAILROAD TRACKS, THERE WASN'T A TRAIN INSIGHT THANK GOD.... THIS  IS VERY DANGEROUS AND SOMETHING NEEDS TO BE DONE ABOUT THIS...",
        "vin": "1N4AL3AP7HN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/01/2019",
        "dateOfIncident": "10/26/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277617,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS LESS THAN 3 YEARS OLD AND MAINTAINED PROPERLY. WHILE DRIVING THE CAR IT STARTS TO HESITATE WHILE TRYING TO ACCELERATE AND AT TIMES IT IT SHAKES VIOLENTLY. I HAVE CONTACTED NISSAN AND THEY SEEM IN NO RUSH TO ASSIST ME IN GETTING IT FIXED ALTHOUGH THE BIG ISSUE JUST OCCURRED WHILE DRIVING HOME WHERE MY CAR RPM SHOT ALL THE WAY UP BUT MY CAR HAD NO ACTUAL ACCELERATION TO IT IN A 55PMH ZONE WHERE I COULD HAVE BEEN CRASHED INTO BY CARS MOVING QUICKLY.",
        "vin": "1N4AL3AP6HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/14/2019",
        "dateOfIncident": "10/02/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268305,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN HAVING PROBLEMS WITH THE CAR SPUTTERING, STALLING AND NOT SHIFTING IN GEAR FOR MONTHS BUT THOUGHT IT WAS A TRANSMISSION FUEL PROBLEM.  AT THE END OF SEPT THE PROBLEMS GOT WORSE WHERE THE CAR WOULD HARDLY DRIVE.  FINALLY DECIDED TO TAKE TO TRANSMISSION SHOP BUT THE CAR COMPLETELY STOPPED IN THE SHOP'S DRIVEWAY AND HAD TO BE PUSHED INTO THE STALL.  WAS TOLD THE TRANSMISSION WAS BAD AND NEEDED TO BE REPLACED ON A 2017 ALTIMA?  DIDN'T HAVE THE $5000 NEEDED SO I HAD THE VEHICLE TOWED TO MY AUNT'S HOUSE WHERE IT STILL SITS FOR REPOSSESSION.  I HAVE SMALL CHILDREN AND DON'T NEED A CAR THAT STALLS IN TRAFFICE TO THIS EXTENT IN TRAFFIC!",
        "vin": "1N4AL3AP6HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/11/2019",
        "dateOfIncident": "10/11/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267996,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUNK IS CLOSE BUT DASH BOARD SAYS OPEN WHILE DRIVING IT BEEPS AND PERIODICALLY HESITATES TO TAKE OFF AT NORMAL SPEED",
        "vin": "1N4AL3AP1HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/02/2019",
        "dateOfIncident": "09/03/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11265727,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "IN MY DRIVEWAY AT HOME GETTING MY BAGS, PURSE FELL OVER WENT TO REACH TO GET ITEMS THAT FELL OUT BETWEEN THE SEAT ON DRIVER SIDE AND FINGER STUCK IN BRACKET, COULD NOT TAKE MY FINGER OUT BY MYSELF BECAUSE OF THE BRACKET HAS METAL RIGIDES AROUND IT HAD TO CALL 911 AND THEY SENT OUT THE PARAMEDIC THEY HAD TO CALL THE FIRE DEPT. TO CUT THE SEAT FRAME BECAUSE THEY COULDN'T REMOVE MY FINGER FROM BRACKET ALSO SO I WOULDN'T HAVE ANYMORE DAMAGES TO THE FINGER.*DT*JB",
        "vin": "1N4AL3APXHC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/16/2019",
        "dateOfIncident": "09/14/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255560,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE STALLS AND WON'T CATCH WHEN IT IS PUT INTO GEAR.  I WAS ALMOST STUCK IN PARKING LOT WHILE TRYING TO BACK INTO A SPOT. THE CAR JUMPS/STUTTERS AND WHEN IT WAS PUT ON CRUISE CONTROL, IT WOULD LOSE SET SPEED AND THEN CATCH UP AGAIN.  IF I GAVE THE CAR GAS, IT WOULDN'T GO EVEN WITH THE PEDAL TO THE FLOOR.",
        "vin": "1N4AL3AP8HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/09/2019",
        "dateOfIncident": "08/27/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254119,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR STOPPED RUNNING. THEN IT WOULD NOT CATCH IN DRIVE OR IN REVERSE. IT JUST STOPS RUNNING SOMETIMES AND SOMETIMES DOESN'T START AT ALL.",
        "vin": "1N4AL3AP3HC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/27/2019",
        "dateOfIncident": "08/22/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246723,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE WAS PURCHASED NEW FROM FRED HAAS NISSAN - TOMBALL, TX ON MARCH 5, 2018. THE VEHICLE NOW HAS 42,250 MILES ON IT AND HAS DEVELOPED A BRAKING ISSUE. THE MASTER CYLINDER OR BRAKE BOOSTER IS FAILING ON THE CAR WHICH IS CAUSING THE VEHICLE STOPPING DISTANCE TO ALMOST DOUBLE WHEN ATTEMPTING TO MAKE A COMPLETE STOP. THE DEALERSHIP IS UNWILLING TO PAY FOR THE REPAIRS DUE TO IT BEING JUST OUTSIDE OF THE 36,000 MILE WARRANTY.",
        "vin": "1N4AL3AP8HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/26/2019",
        "dateOfIncident": "08/25/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246540,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CVT TRANSMISSION IN THE ALTIMA STOPPED WORKING AND VERY VERY NEARLY CAUSED A BIG ACCIDENT WHICH WAS ALMOST NOT AVOIDED DUE TO THIS. IT WAS IN MOTION IN TRAFFIC PEOPLE ALMOST HIT ME BECAUSE I HAD NO POWER TO GO. I WAS ON A MAJOR BOULEVARD WITH RUSH HOUR.",
        "vin": "1N4AL3AP8HN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/20/2019",
        "dateOfIncident": "08/17/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245326,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE HIGHWAY VEHICLE SUDDENLY BEGAN EXPERIENCING PROBLEMS WITH ACCELERATION AND BEGAN A SLOW SHUDDERING OR SHAKING. 15 MINUTES LATER THE ENGINE MALFUNCTION INDICATOR LIGHT CAME AND LUCKY FOR ME I WAS ALREADY HOME. HOWEVER BEGAN EXPERIENCING PROBLEMS KEEPING THE VEHICLE IN GEAR AND THE VEHICLE HESITATED TO REVERSE. TOOK IT IMMEDIATELY TO THE NISSAN DEALERSHIP AND WAS TOLD THE PROBLEM WAS A BAD SUB ASSEMBLY THAT NEEDED TO BE REPLACED. \"NISSAN IS AWARE OF THE PROBLEM\" THE TECH TOLD  AND THEY WOULD REPLACE THE SUB ASSEMBLY AT NO COST TO   ME AS I WISELY HAD DECIDED TO GET THE 150K WARRANTY.  I  WAS HURRIED INTO A LOANER -RENTAL VEHICLE AND TOLD IT MAY TAKE OVER TWO WEEKS JUST FOR THE SUB ASSEMBLY TO ARRIVE.",
        "vin": "1N4AL3APXHC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/30/2019",
        "dateOfIncident": "06/15/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240577,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 NISSAN ALTIMA  CVT TRANSMISSION STALLS AND JERK WHEN DRIVING AT 60-65 MILES PER HOUR HIGHWAY AND AT A RED LIGHT  HAVE TO PUSH START TO CONTINUE DRIVING WHICH CAN CAUSE INJURIES OR DEATH",
        "vin": "1N4AL3AP0HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/26/2019",
        "dateOfIncident": "07/21/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11235076,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CVT - CONTINUOUS VARIABLE TRANSMISSION FAILURE AND NEEDS REPLACEMENT WITH 2017 NISSAN ALTIMA SL AND 37K MILES ON THE VEHICLE.  ALL HIGHWAY MILES AND CAR IS EXACTLY 2 YEARS YOUNG.  CAR WOULD NOT GO FORWARD OR IN REVERSE.",
        "vin": "1N4AL3AP5HC"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/14/2019",
        "dateOfIncident": "07/14/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231692,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I STOP AT A RED LIGHT AND PUT MY FOOT ON THE GAS TO PROCEED IT WOULD BARELY MOVE AND THEN TAKE OFF. MY CAR HAS UNDER 19,500 MILES AND THE CAMERA IS MESSED UP, MY CAR WOULDN'T START BEFORE, MY BLUETOOTH HESITATES AT TIMES AND MY WARNING LIGHTS ARE NOT WORKING PROPERLY. NOW MY CHECK ENGINE LIGHT IS AND I GET MY OIL CHANGES DONE AND JUST GOT MY BRAKES DONE AND MY CAR IS SQUEALING AGAIN.",
        "vin": "1N4AL3AP3HC"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/22/2019",
        "dateOfIncident": "06/21/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221868,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE LESS THAT 8000 MILES ON VEHICLE. I'M A DISABLED VETERAN WITH A SERVICE RELATED DISABILITY. I'VE HAD THE CAR MAYBE TWO YEARS. I WAS ON THE I-12 AND THE CAR BEGIN TO DECELERATE OFF AND ON AND THEN STALLED ON ME IN THE MIDDLE OF THE OFF RAMP. I COULD HAVE BEEN KILLED OR INJURED. CAR STILL ISNT PAID OFF. I'VE READ OTHER YEAR MODLES WITH SAME ISSUES AND NO FIXES EITHER HELP OR SOLVE THE PROBLEM. WHAT OR MY RIGHTS AND CURRENTLY AWAITING FOR DEALER TO LOOK AT CAR.",
        "vin": "1N4AL3AP2HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/21/2019",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221697,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DIM HEADLIGHTS- BULBS HAVE BEEN CHANGED BUT NO DIFFERENCE. BASICALLY CAR CANNOT BE DRIVEN AFTER DUSK. BRIGHT LIGHTS WORK FINE BUT THE DIM ARE SO DIM YOU CANY TELL THEY ARE EVEN ON. NO VISIBILITY AT NIGHT- SAFETY PROBLEM FOR ALL INVOLVED.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/21/2019",
        "dateOfIncident": "03/16/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221777,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY CAR IN 2018, IN FEBRUARY OF 2019 I HAD MY FRONT BRAKES CHANGED, NOT EVEN TWO MONTHS LATER THE SQUEAKING NOISE STARTED AGAIN ON THE SAME FRONT BRAKE MECHANIC TOLD ME THEY WAS DEFECTED BRAKE PADS SO HE CHANGED THEM AND PLACE SOME NEW ONES ON THE CAR. NOW I PICKED MY CAR UP FROM SHOP AND TWO DAYS LATER THE BRAKES ARE SQUEAKING AGAIN. I'VE INQUIRED WITH OTHERS WHO HAS THE SAME MODEL CAR AND THEY INFORMED ME THAT THEY HAVE BEEN HAVING THE SAME PROBLEMS AT THIS POINT I THINK THIS IS SOMETHING THAT NEEDS TO BE LOOKED INTO BECAUSE I SHOULDN'T GO THROUGH THAT MANY BRAKE PADS ON A NEW VEHICLE. THE SQUEAKING USUALLY TAKE PLACE WHEN I PRESS BRAKES TO COME TO A STOP.",
        "vin": "1N4AL3AP5HN"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/18/2019",
        "dateOfIncident": "06/18/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220971,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "NISSAN AUTOMATIC EMERGENCY BRAKING SYSTEM MALFUNCTIONING. THE ALARM GOES OFF  'FRONT RADAR UNAVAILABLE DUE TO OBSTRUCTION\" AND LITTLE SYMBOL LIGHTS UP OF  TWO CARS CRASHING ON DASHBOARD PANEL. MY VEHICLE STOPS SHORT INTERMITTENTLY WHEN THIS WARNING OCCURS. I HAVE NOTICED THE PROBLEM IS MORE FREQUENT WHEN I MAKE A TURN, GO OVER A SPEED BUMP OR IN INCLEMENT WEATHER IT SEEMS TO HAPPEN MORE FREQUENTLY... CAR COMES TO COMPLETE STOP WITHOUT ME TOUCHING THE BRAKE.  I WAS ALMOST REAR ENDED TWICE TODAY BECAUSE OF THIS.   ON THE WAY HOME FROM WORK TODAY THE WARNING LIGHT CAME ON 3 TIMES AFTER MAKING SEVERAL RIGHT TURNS ON CITY STREET IT WAS ALSO RAINING. MY CAR STOPPED SHORT AND CAR BEHIND ME HAD TO SLAM ON THEIR BREAKS TO AVOID HITTING ME. .",
        "vin": "1N4AL3AP4HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/04/2019",
        "dateOfIncident": "05/29/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217671,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SMART KEY STOP TO WORK, WHEN WORK IN THE DASH SHOWS UP KEY ERROR, CAR DON T WANT TO OPEN OR START, LOCK OR OPEN. I GOT TWO KEYS AND BOTH GOT SAME PROBLEM",
        "vin": "1N4AL3AP3HC"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/30/2019",
        "dateOfIncident": "10/19/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210872,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FEB (FRONT RADAR OBSTRUCTION) READS UNAVAILABLE WHILE DRIVING EITHER IN THE CITY OR HIGHWAY. NOTE: THIS HAPPENS WHEN IS CLEAR OUTSIDE AND WHILE IS WINDY, RAINING, FOGGY. MIND YOU THE IDEA OF HAVING THIS SYSTEM IS TO AID THE DRIVER TO PREVENT ACCIDENTS. BUT IT WILL NOT DO SUCH IF IT IS NOT WORKING, SPECIALLY WHILE DRIVING ON THE ABOVEMENTIONED CONDITIONS. THIS FAULT STARTED ON 27 OCT 2018 AT 4:19PM AND IS OCCURRING ON A CONSISTENT BASIS EVEN SINCE. LAST DAY TO OCCUR WAS MONDAY 27 MAY 2019.",
        "vin": "1N4AL3APXHC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/27/2019",
        "dateOfIncident": "05/23/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210222,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKAKA RECALL   I HAVE A 2017 NISSAN ALTIMA THAT STOPS IN MIDLE OF THE HWAY. WHEN I DRIVE AROUND 60 MILES PER HOUR WITH MY 2 KIDS INSIDE. I HAVE TO STOP IN THE SIDE  WITH HEAVI TRAFFIC AND WAIT UNTIL HELP ARRIVE. 2 HOURS LATER IN STILL STUCK WITH SCARE KIDS AND I DRIVE THE CAR WHIT SLIPPING  TRANSMISION TO THE NISSAN DEALER WHERE OF COURSE THEY DONT WANT TAKE ANY RESPONSABILTY I FOUND ALL COMPLAINTS ONLINE AND LAWSUITS AGAINST NISSAN FOR THE CVT TRANSMISION  AND RECALL HAS TO BE ENFORCED",
        "vin": "1NA4L3AP7HN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/21/2019",
        "dateOfIncident": "09/07/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209133,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION FAILED ON INTERSTATE AT APPROXIMATELY 70MPH. I WAS TOLD BY THE NISSAN DEALERSHIP GARAGE MANAGER THAT THEY REALLY DON'T KNOW WHY THEY FAIL EXCEPT THAT THEY THINK THE TRANSMISSION OVERHEATS DUE TO UNDERSIZED PUMP AND MESH NOT ALLOWING ENOUGH CIRCULATION. EVERYTHING WAS REPLACED AT NISSAN'S EXPENSE, HOWEVER I HAVE NO CONFIDENCE IN THE REPAIR. WHEN THIS HAPPENED THERE WAS NOT A SINGLE WARNING LIGHT OR MESSAGE THAT APPEARED ON THE DASH.",
        "vin": "1N4AL3AP3HC"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/27/2019",
        "dateOfIncident": "04/24/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204186,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2017 NISSAN ALTIMA THAT CURRENTLY HAS 35,000 SIMPLY LOST ALL POWER. I COULDN'T USE THE FOB KEY TO OPEN THE DOOR, THERE WERE NO LIGHTS, NO RADIO, NOTHING. BECAUSE IT IS STILL UNDER MANUFACTURER WARRANTY, I HAD IT TOWED TO THE DEALERSHIP AND LEFT IT WITH THEM FOR TWO DAYS FOR THEM TO FIGURE OUT WHAT'S WRONG. THEY WEREN'T ABLE TO SPECIFICALLY IDENTIFY WHAT WAS WRONG. THE CAR EVENTUALLY STARTED ONCE THEY HOOKED IT UP TO THE DIAGNOSTIC COMPUTER. THE LIGHTS CAME ON AND THE CAR ALARM WAS ACTIVATED. THE MECHANICS WERE TOTALLY DUMBFOUNDED BY THE EVENTS. THEY COULDN'T TELL ME WHAT WAS THE REASON FOR THE CAR LOSING ALL POWER.  TWO DAYS LEADING UP TO THE CAR LOSING ALL POWER, I NOTICED THAT WHILE DRIVING AT A SPEED THAT IS WITH THE FLOW OF TRAFFIC, IF FOR WHATEVER REASON I HAVE TO SLOW OR COME TO A COMPLETE STOP, THE CAR SHUTTERS. IT FELT AS IF THE CAR WAS ABOUT LOSE POWER AND SHUTDOWN.  I HAD A SIMILAR EXPERIENCE WITH MY 2011 NISSAN ALTIMA. IT ACTUALLY SHUTDOWN A COUPLE OF TIMES IN THE MIDDLE OF TRAFFIC A COUPLE TIMES. THE PROBLEM WAS FIXED WITH A RECALL THAT UPDATED SOME SORT OF SOFTWARE FOR THAT CAR AND AFTER THAT UPDATE I NEVER HAD THE PROBLEM AGAIN. I GAVE THAT CAR TO MY PARENTS AND THEY HAVE NEVER EXPERIENCED IT SHUTTING NOW. THE PROBLEM THAT I HAVE BEEN EXPERIENCING WITH THE 2017 CAR IS IDENTICAL TO THE PROBLEM I HAD WITH THE 2011 ALTIMA. IT IS FLAT OUT DANGEROUS AND I AM CONCERN IT COULD COST ME MY LIFE.",
        "vin": "1N4AL3AP8HN"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/24/2019",
        "dateOfIncident": "04/24/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203326,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DISTRACTING WIND NOISE FROM DRIVER SIDE, POSSIBLY MIRROR PAST YEARS HAVE HAD DRIVER SIDE MIRROR RECALLS. THE NOISE DISTRACTS THE DRIVER AND CLOSING THE MIRROR STOPS THE NOISE BUT RENDERS THE MIRROR UNUSABLE AND DANGEROUS",
        "vin": "1N4BL3AP2HC"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/19/2019",
        "dateOfIncident": "02/08/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11197312,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SLOWS DOWN WHILE DRIVING OR ACCELERATES GAS PEDALS GET STUCK",
        "vin": "1N4AL3AP8HN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/29/2019",
        "dateOfIncident": "03/24/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192335,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CVT TRANSMISSION FAILED WHICH TRAVELING ON THE HIGHWAY.  CAR DECELERATED ON THE HIGHWAY. I DRIFTED TO AN EXIT AND MANAGED TO GET TO A PARK AND RIDE.  THIS PRESENTED A SERIOUS SAFETY ISSUE ON THE HIGHWAY AS I TRIED TO DRIFT ACROSS A SIDE ROAD TO A PARK AND RIDE",
        "vin": "1N4AL3AP8HC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/22/2019",
        "dateOfIncident": "02/17/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190956,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEM WITH MY 2017 ALTIMA SL. KNOCKING NOISE IN STEERING AT LOW SPEED NOISE COMING FROM STEERING. WENT BACK TO MY NISSAN DEALER AND THEY INSPECTED AND FOUND THAT NOISE IS NORMALL. THEY TOLD ME THAT IF THE NOISE GETS LOAD OR A LEAK TO BRING IT BACK. I TOLD THEM THAT I FEEL THAT ITS NOT SAFE TO DRIVE KNOWING THAT THERE IS A PROBLEM BUT NISSAN WARRANTY DOESN'T WANT TO COVER IT AND IT'S THE OLD RUNNING AROUND UNTIL IT BREAKS AND PERHAPS IT'S ON SAFE FOR MY FAMILY TO RIDE IN THIS CAR KNOWING THAT THIS IS A PROBLEM THAT'S WHY I'M WRITING FOR THIS COMPLAINT THANK YOU.",
        "vin": "1N4AL3AP7HC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/14/2019",
        "dateOfIncident": "03/14/2019",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186864,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 NISSAN ALTIMA. WHILE ATTEMPTING TO PARK THE VEHICLE, IT CAUGHT FIRE UNDER THE HOOD IN THE ENGINE COMPARTMENT WITHOUT WARNING. THE PARKING ATTENDANT ATTEMPTED TO START THE VEHICLE AND IT EXPLODED. A POLICE REPORT WAS FILED AND THERE WERE NO INJURIES. THE FIRE WAS EXTINGUISHED BY THE FIRE DEPARTMENT. THE VEHICLE WAS TOWED BY THE INSURANCE COMPANY TO AN IMPOUND LOT. THE VEHICLE NOT TAKEN TO A DEALER OR INDEPENDENT MECHANIC FOR A DIAGNOSTIC TESTING. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "1N4AL3AP0HC"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/25/2019",
        "dateOfIncident": "02/17/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182349,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT EMERGENCY BRAKING (FEB) WARNING LIGHT COMES ON AND OFF RANDOMLY WHILE DRIVING. THE WARNING STATES, \" FRONT RADAR UNAVAILABLE DUE TO OBSTRUCTION\". THIS HAS OCCURRED WHILE DRIVING ON CITY STREETS, SHORT AND LONG DISTANCE DRIVING, AS WELL AS ON THE HIGHWAY AND WHILE TURNING. THIS WAS ESPECIALLY CONCERNING WHEN IT HAPPENED WHILE MAKING A TURN. THE WARNING WENT OFF IN THE MIDDLE OF MAKING A TURN AND IT WAS DISORIENTING AS IT WAS COMPLETELY UNEXPECTED.. THIS WARNING NOW GOES OFF RANDOMLY ON A DAILY BASIS AND I JUST BOUGHT THE CAR 2 WEEKS AGO.",
        "vin": "1N4AL3AP2HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/22/2019",
        "dateOfIncident": "02/04/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181982,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 NISSAN ALTIMA. WHILE DRIVING AT AN UNKNOWN SPEED, THE VEHICLE DECELERATED AND THE CHECK ENGINE INDICATOR ILLUMINATED. ALSO, WHEN ACCELERATING FROM A STOP, THE GEAR DID NOT SHIFT INTO DRIVE UNTIL THE ACCELERATOR PEDAL WAS DEPRESSED TO THE FLOORBOARD. THE VEHICLE WAS TAKEN TO NISSAN OF NEWNAN (678-552-4957, LOCATED AT 783 BULLSBORO DR, NEWNAN, GA 30265) WHERE IT WAS STATED THAT THE WARRANTY EXPIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 60,000.",
        "vin": "1N4AL3AP4HC"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/06/2019",
        "dateOfIncident": "01/27/2019",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11174845,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS STANDING IN DINING ROOM WHEN I HEARD A LOUD SOUND. I WALKED OUTSIDE AND SAW METAL CABINET (WHICH CONTAINED VARIOUS CLEANING PRODUCTS, SPRAY PAINT, ETC) NEXT TO FRONT LEFT TIRE OF 2017 NISSAN ALTIMA ON FIRE. I DID NOT WALK FAR ENOUGH OFF PORCH TO EXAMINE IF CAR WAS ON FIRE AT THAT TIME. I RAN BACK INSIDE AND GOT MY SON AND HIS GIRLFRIEND OUT OF HOUSE. I CALLED 911 AND MOVED FRIENDS VEHICLE (WHICH WAS PARKED BEHIND MINE.) MY SON REPORTED SEEING FRONT LEFT TIRE OF THE PARKED ALTIMA LOCATED INSIDE CARPORT ON FIRE AND ATTEMPTED TO PUT IT OUT WITH FIRE EXTINGUISHER.  CAR AND PART OF HOUSE BURNED UNTIL FIRE DEPARTMENT ARRIVED AND PUT FIRE OUT. CAR WAS DEEMED TOTAL LOSS BY INSURANCE AND HOUSE IS UNLIVABLE DUE TO FIRE AND SMOKE DAMAGE. *DT  VIN  IS INVALID*JB",
        "vin": "1N4AL3AP1H1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/04/2019",
        "dateOfIncident": "02/04/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174336,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT EMERGENCY BRAKING (FEB) WARNING LIGHTS COMES ON AND THEN OFF, STATES UNAVAILABLE OBSTRUCTION.",
        "vin": "1N4AL3AP3HC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/28/2019",
        "dateOfIncident": "07/09/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11172555,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2017 NISSAN ALTIMA. WHILE THE CONTACT WAS TRAVELING AS A PASSENGER AT APPROXIMATELY 15 MPH, THE VEHICLE WAS STRUCK ON THE FRONT DRIVER'S SIDE BY ANOTHER VEHICLE. ALL THE FRONTAL AND SIDE AIR BAGS DEPLOYED. POLICE REPORT NUMBER: 18002915 WAS FILED. THE DRIVER AND CONTACT WERE INJURED AND TRANSPORTED TO THE HOSPITAL VIA AMBULANCE. THE CONTACT STATED THAT THE AIR BAGS DEPLOYED WITH EXCESSIVE FORCE AND FRAGMENTS OF GLASS AND GRAVEL STRUCK HER FACE. BOTH OCCUPANTS WERE TREATED AND RELEASED. THE VEHICLE WAS TOWED TO AN IMPOUND LOT. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS DESTROYED. THE APPROXIMATE FAILURE MILEAGE WAS 33,100. *DT*JB.*BF  CONSUMER STATED THE OTHER VEHICLE FAILED TO YIELD RIGHT OF WAY ON A RED LIGHT. CONSUMER ALSO STATED SHE HAS ALMOST LOST HER RIGHT EYE AND HAS HAD 3 SURGERIES AND IS STILL UNDER DOCTOR'S CARE.*JB",
        "vin": "1N4AL3AP2HC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/26/2018",
        "dateOfIncident": "12/02/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163464,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE THE START OF 2018 I HAVE HAD MY CAR SHUT OFF WHILE DRIVING. I HAVE TAKEN IT MULTIPLE DEALERSHIPS TO HELP SOLVE THIS ISSUE. EVERY TIME THEY CAME BACK AND SAID THAT THEY COULD NOT DUPLICATE THE PROBLEM AND NOTHING COULD DO FOR ME. I HAVE REACHED OUT TO THE MANUFACTURE THEY ALSO SAID THE SAME THING THEY COULD NOT DO ANYTHING. THIS IS A HUGE SAFETY THAT I STATED. THIS IS STILL UNDER MANUFACTURE WARRANTY  AND THEY WILL NOT DO ANYTHING.",
        "vin": "1N4AL3AP7HN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/26/2018",
        "dateOfIncident": "05/30/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163425,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RIGHT REAR WINDOW CLOSES VERY SLOWLY ALL THE TIME",
        "vin": "1N4AL3AP2HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/18/2018",
        "dateOfIncident": "02/17/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162326,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE COLLISION AVOIDANCE SYSYTEM  COME ON WHEN THERE IS NOTHING IN THE AREA WHILE I AM DRIVING . IS NOW HAPPENING EVERY DAY .",
        "vin": "1N4AL3AP5HC"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/22/2018",
        "dateOfIncident": "11/19/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11153260,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MAKES A POPPING AND CLANKING NOISE WHEN GOING OVER BUMPS SLOWLY",
        "vin": "1N4AL3AP1HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/13/2018",
        "dateOfIncident": "10/29/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151217,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS ABOUT 10,000 MILES WHILE I WAS DRIVING ON LOCAL TARSEAL ROAD THAT HAD NO CUBS TIRE GOT FLAT AND ITS WENT INTO BIG HOLES THAT CAN NOT BE REPAIRED.. TIRE GOT FLAT WITH BIG HOLES ABOUT 10 MONTHS BRAND NEW VEHICLE. TIRE CAME WITH 60,000 MILES WARRANTY OR 6 YEARS WARRANTY. MILEAGE ON THIS LOCAL ROAD WAS 40 MPH.",
        "vin": "1N4AL3AP2HC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/18/2018",
        "dateOfIncident": "10/18/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141189,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 NISSAN ALTIMA. WHEN THE VEHICLE WAS CRANKED, THE CONTACT HEARD A DRILLING SOUND. THE NOISE OCCURRED FOR AT LEAST TWO MONTHS. THE VEHICLE WAS TAKEN TO ALL STAR NISSAN (27700 JUBAN ROAD, DENHAM SPRINGS, LA 70726) WHERE IT WAS DIAGNOSED THAT THE TUBING THAT TRAVELED FROM THE POWER STEERING PUMP TO THE STEERING COLUMN WAS VIBRATING AND CAUSED THE SOUND. THE DEALER STATED THAT THE MANUFACTURER WAS AWARE OF THE FAILURE AND THAT IT WAS COMMON FOR THAT YEAR AND MODEL VEHICLE; HOWEVER, THERE WAS NO REMEDY AVAILABLE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 17,600.",
        "vin": "1N4AL3AP5HN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/30/2018",
        "dateOfIncident": "09/30/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132373,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I AM DRIVING DOWN THE INTERSTATE MY VEHICLE STARTS SPIDER AND JERK AND LOSE POWER MAKING IT HARD TO ACCELERATE. THEN BEGINS TO ONLY REV AT A HIGH RPM AND NOT MOVE FORWARD SO I AUTOMATICALLY ASSUME TRANSMISSION AND AFTER FURTHER REVIEW OF CUSTOMER COMPLAINTS AND TECHNICAL SERVICE  BULLETINS, I REALIZE THAT THIS HAS BEEN A ISSUE WITH THIS MANUFACTURER FOR MANY YEARS. AND ALSO THAT MANY HAVE BEEN REFUSED SERVICE FROM POWERTAIN WARRANTIES THAT COVER TRANSMISSION ISSUES ON THE VEHICLE!!",
        "vin": "1N4AL3AP2HC"
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/24/2018",
        "dateOfIncident": "08/15/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131023,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 NISSAN ALTIMA. WHILE REFUELING THE VEHICLE WITH THE SHIFT LEVER IN PARK, THE VEHICLE ROLLED AWAY SEVERAL FEET FROM WHERE IT WAS PARKED. THE VEHICLE WAS TAKEN TO HUDSON NISSAN OF NORTH CHARLESTON (7331 RIVERS AVE, NORTH CHARLESTON, SC 29406, (843) 553-1000) WHERE IT WAS DIAGNOSED THAT THE WHEEL BEARINGS NEEDED TO BE REPLACED. THE CONTACT STATED THAT THE DEALER HAD THE VEHICLE FOR FIVE DAYS WITHOUT IT BEING REPAIRED OR RETURNED. THE CONTACT STATED THAT THE FAILURE ALSO OCCURRED WITH THE 2018 NISSAN VERSA, WHICH WAS PROVIDED AS A LOANER VEHICLE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 32,000. THE VIN WAS NOT INCLUDED.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/18/2018",
        "dateOfIncident": "08/10/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11130271,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2017 NISSAN ALTIMA. WHILE DRIVING AT AN UNKNOWN SPEED, THE VEHICLE DRIFTED INDEPENDENTLY OFF A CLIFF AND CRASHED. THE CONTACT STATED THAT THE BRAKE PEDAL WAS DEPRESSED, BUT FAILED TO OPERATE. THE CONTACT SUSTAINED WRIST, BACK, HEAD, AND LEG INJURIES THAT REQUIRED MEDICAL ATTENTION. THE CONTACT WAS UNAWARE IF A POLICE REPORT WAS FILED. THE VEHICLE WAS DESTROYED AND TOWED TO A TOW LOT. THE CONTACT NOTIFIED THE DEALER (BULLOCK TOYOTA, (662) 773-6281, 269 N COURT AVE, LOUISVILLE, MS 39339). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 35,000. THE VIN WAS NOT PROVIDED.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/15/2018",
        "dateOfIncident": "08/14/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120008,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WON'T TURN ON. IT KEEP SAYING KEY ID INCORRECT WHEN I PUSH THE REMOTE START BUTTON. I ALREADY REPLACED MY KEYLESS ENTRY KEY FOB BATTERY AND STILL NO POWER IN MY CAR NOT EVEN TO OPEN THE CAR. I HAVE TO USE THE MANUAL KEY TO MANUALLY OPEN THE DOOR TO MY CAR. I TRIED JUMP STARTING MY CAR MAYBE CAR BATTERY DEAD I REPLACED IT WITH A NEW ONE STILL UNABLE TO TURN MY CAR ON. I WILL HAVE TO GET IT TOWED TO THE DEALERSHIP I HAVE ONLY HAD IT FOR 10 MONTHS AND IT WAS WITH 4 MILES SO PRETTY MUCH A BRAND NEW CAR.",
        "vin": "1N4AL3AP2HC"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/06/2018",
        "dateOfIncident": "07/06/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11109943,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE ELECTRICAL ISSUES WITH MY VEHICLE. 1ST THE WINDOWS WOULDN'T ROLL DOWN, AND NOW ALL ELECTRICAL FEATURES ON THE VEHICLE DOESN'T WORK ( POWER LOCKS, REAR VIEW CAMERA, TURNING SIGNALS, DOORS DONT LOCK WITH REMOTE, AND CAR DOESNT SHIFT OUT OF PARK UNLESS I USE THE SHIFT LOCK RELEASE BUTTON). VEHICLE WAS STATIONARY AND IT HAPPENED ON JULY 6 2018",
        "vin": "1N4AL3AP5HC"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/06/2018",
        "dateOfIncident": "07/06/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11109956,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST DAY OF MAJOR HEAT WAVE. FIRE ON SIDE OF TRAVELED ROAD AS TRAFFIC STARTS TO MOVE THE 2017 ALTIMA 3.5 ENGINE CAR WITH ANOUT 9500 MILES ON IT SUDDENLY WITHOUT ANY WARNING LOOSES POWER AND GAS PEDDLE HAS NO RESPONSE. CAR FELT HEAVY ROLLS BACKWARDS TOWARDS EDGE AS IT SEEMED IT HAD SHUT DOWN AUTOMATICALLY. TRY TO RESTART AND WON'T START UNTIL 4TH TRY. STILL HEAVY WITH LOSS OF POWER. MANAGED TO DRIVE PASS THE DANGER AREA NOT KNOWING WHY A NEW VEICHLE WOULD SHUT DOWN WITHOUT NOTICE. DOING SOME RESEARCH NOW AND GETTING SCARED.IT SOUNDS SIMILAR TO OTHER NISSAN VEICHLE PROBLEMS.WORRIED THIS IS A DANGEROUS CAR TO DRIVE",
        "vin": "1N4BL3AP4HC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/11/2018",
        "dateOfIncident": "05/26/2018",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101116,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2017 NISSAN ALTIMA. WHILE DRIVING 35 MPH, THE VEHICLE STALLED WITHOUT WARNING. WHILE THE VEHICLE WAS BEING MANUALLY PUSHED OUT OF THE ROADWAY, IT CAUGHT ON FIRE. THE CONTACT STATED THAT THE FIRE STARTED UNDER THE HOOD ON THE PASSENGER SIDE OF THE VEHICLE. THE FIRE DEPARTMENT WAS CALLED AND WAS ABLE TO EXTINGUISH THE FIRE. A FIRE REPORT WAS FILED. THERE WERE NO INJURIES SUSTAINED. THE VEHICLE WAS TOWED TO A SALVAGE YARD. MATTHEWS NISSAN (LOCATED AT 185 OLD STATE RTE 76, CLARKSVILLE, TN 37043, (931) 552-7555) WAS NOTIFIED OF THE FAILURE. THE MANUFACTURER WAS ALSO NOTIFIED OF THE FAILURE. THE CONTACT WAS INFORMED BY THE MANUFACTURER THAT AN INVESTIGATION OF THE VEHICLE WOULD TAKE PLACE IN TWO WEEKS. THE CONTACT WAS PROVIDED CASE NUMBER: 31560003. THE VEHICLE WAS DESTROYED. THE APPROXIMATE FAILURE MILEAGE WAS 10,000.",
        "vin": "1N4AL3AP2HN"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/06/2018",
        "dateOfIncident": "03/05/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11100121,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS RUNNING VERY HARD IT'S NOT SMOOTH ANYMORE I FEEL THE PRESSURE COMING FROM THE WHEEL AND THE STEERING WHEEL IS NOT STRAIGHT AS SUPPOSED TO.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/05/2018",
        "dateOfIncident": "05/21/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11100068,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INVOLVED IN A 8 CAR COLLISION ON THE INTERSTATE. THE CAR IN FRONT OF ME HIT THE CAR IN FRONT OF THEM, I HIT THEIR CAR AND WAS THEN HIT FROM BEHIND FOLLOWED BY 2 MORE VEHICLES. MY AIRBAG NEVER DEPLOYED.  *DSY",
        "vin": "1N4AL3APXHC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/24/2018",
        "dateOfIncident": "05/14/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097752,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FORWARD COLLISION WARNING SYSTEM STOPPED WORKING. THE DEALER 441 SOUTHERN NISSAN IN WELLINGTON, FL REFUSED TO TEST THE CAR AFTER THEIR COMPUTER SAID THE SYSTEM WAS WORKING. I CALLED NISSAN AND THEY REFERRED ME TO ANOTHER DEALER. THE OTHER DEALER, GREENACRES NISSAN INDICATED THEY KNEW THERE WAS A PROBLEM AFTER CHECKING IT OUT AND SAID THEY ORDERED THE PART. THE PART DID NOT ARRIVE AND NOW THEY SAY NO ONE IN THE AREA HAS THE PART. I BELIEVE THERE IS A BIGGER PROBLEM WITH THESE RADAR SENSORS. SOMEONE IN THE SERVICE DEPT TOLD ME THEY HEARD THERE IS A SOFTWARE FIX BEING WORKED ON.  THIS IS A CRITICAL SAFETY FEATURE.   THANKS,",
        "vin": "1N4AL3AP9HC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/16/2018",
        "dateOfIncident": "05/03/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11094160,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2017 NISSAN ALTIMA. WHILE THE CONTACT WAS STOPPED AT A RED LIGHT, IT WAS STRUCK BY ANOTHER VEHICLE. THE AIR BAGS DID NOT DEPLOY. THE VEHICLE WAS DESTROYED AND TOWED TO A TOW YARD. A POLICE REPORT WAS FILED. THE CONTACT WAS THROWN FORWARD SIX INCHES INTO THE DASHBOARD, AND SUSTAINED MINOR BRUISES AND MODERATE PAIN. MEDICAL ATTENTION WAS REQUIRED. THE DEALER AND MANUFACTURER WERE NOT NOTIFIED OF THE CRASH. THE FAILURE MILEAGE WAS 30,000.",
        "vin": "1N4AL3AP2HC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/06/2018",
        "dateOfIncident": "05/06/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092141,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SON WAS PRACTICING DRIVING. HE WAS TURNING AND THE CAR WOULD NOT TURN. PS WARNING LIGHT CAME ON AND STAYED ON.  ONCE I WAS IN THE DRIVER SEAT, I HAD A HARD TIME TURNING THE STEERING WHEEL. THE 2017 NISSAN ALTIMA SR ONLY HAVE AROUND 8K MILES. I PUT ON FLASHERS TO GET TO NEAREST AUTO STORE. AUTOZONE CHECK THE FLUIDS, IT WAS SOME IN THERE BUT IT COULD BE TOPPED OFF THEY SAID.  I DIDN'T PURCHASE FLUID. I WAS TOLD TO TURNED THE VEHICLE BACK ON. THE WHEEL WAS MOVING VERY LOOSE NOW. I THEN SLOWLY DRIVE IT TO THE DEALERSHIP. THE MANUAL ADVISE TO HAVE IT INSPECTED AND DIAGNOSED. THE VEHICLE WAS LEFT AT THE DEALERSHIP. PENDING INSPECTION",
        "vin": "1N4L3AP2HC1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/01/2018",
        "dateOfIncident": "04/01/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11082405,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TRANSMISSION IS TROUBLING  WHEN ON D CAR DONT OR IF THE CAR  DRIVING ALL THE CERTAIN GOES TO NEUTRAL MAKE LOUD NOISE  ON THE STREET",
        "vin": "1N4AL3AP5HC"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/19/2018",
        "dateOfIncident": "03/18/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080141,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 NISSAN ALTIMA. WHILE DRIVING IN THE PARKING LOT, THE CONTACT HEARD A NOISE COMING FROM ONE OF THE TIRES. THE CONTACT EXITED THE VEHICLE AND REALIZED THAT THE TIRE WAS SITTING ON THE RIM. THE TIRE PRESSURE INDICATOR WAS NOT ILLUMINATED. THE DEALER AND MANUFACTURER WERE NOT NOTIFIED. THE SPECIFIC TIRE WAS NOT SPECIFIED. THE FAILURE MILEAGE WAS 26,000. *TT",
        "vin": "1N4AL3AP3HC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/13/2018",
        "dateOfIncident": "08/15/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11078982,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 NISSAN ALTIMA. SIX MONTHS AFTER THE VEHICLE WAS PURCHASED, THE CONTACT NOTICED THAT THE ELECTRONIC ONBOARD DISPLAY ON THE INSTRUMENT PANEL DISPLAYED AN INACCURATE READING OF THE FUEL MILEAGE PER GALLON. THE DISPLAY WAS TEN PERCENT MORE THAN WHAT THE CONTACT WAS DRIVING AND WAS CONSISTENTLY HIGH. THE VEHICLE WAS TAKEN TO MODERN NISSAN OF WINSTON SALEM (5795 UNIVERSITY PKWY, WINSTON-SALEM, NC 27105, (336) 767-8260) WHERE NO DIAGNOSTIC FAILURE CODES WERE FOUND AND THE FAILURE COULD NOT BE DUPLICATED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER STATED THAT THE VEHICLE WAS DESIGNED IN THAT MANNER AND NOTHING COULD BE DONE. AN INSPECTOR WAS SENT OUT TO TEST AND DIAGNOSE THE VEHICLE AND CONFIRMED THAT THE READING WAS INACCURATE. THE INSPECTOR STATED THAT THE VEHICLE WAS DESIGNED THAT WAY AND NO DIAGNOSTIC FAILURE CODES WERE FOUND. THE VIN WAS UNKNOWN. THE APPROXIMATE FAILURE MILEAGE WAS 3,000.",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/03/2018",
        "dateOfIncident": "01/23/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066806,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2017 NISSAN ALTIMA IS NOT EVEN A YEAR OLD AND HAS LESS THEN 10,000 MILES ON IT. DRIVING ON THE FREEWAY I HEARD A POP AND IMMEDIATELY GOT OFF THE FREEWAY. MY TIRE, WHICH HAS GREAT TREAD, HAS BLOWN AND ONE OF THE LUGS SHOT BACK INTO THE WHEEL. I BELIEVE THIS IS DUE TO A DEFECT WITH THE PARTICULAR LUG. IT WAS NOT PROPERLY SECURED AND BECAME LOOSE CAUSING EXTENSIVE DAMAGE. THIS SHOULD BE COVERED BY NISSAN, BUT THEY ARE REFUSING TO TAKE RESPONSIBILITY FOR THE DEFECT IN THEIR PRODUCT.",
        "vin": "1N4AL3AP8HN"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/08/2018",
        "dateOfIncident": "01/04/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11061148,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INSULATION THAT WRAPS THE ELECTRICAL CABLING TO ENGINE AND OTHER WORKING PARTS TO CAR ARE WRAPPED WITH A CORN AND SOIL PRODUCT AND RATS ATE THE INSIDE OF MY CAR TO THE POINT THAT THE CAR WOULD NOT WORK. IT IS 5 MONTHS OLD WITH 7,000 MILES.",
        "vin": "1N4AL3AP3HC"
    },
    {
        "components": "STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "12/09/2017",
        "dateOfIncident": "11/14/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11053593,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE WAS PARKED IN THE STALLS IN FRONT OF THE CASEY'S GENERAL STORE ENTRANCE IN EVANSVILLE, WISCONSIN.  I WAS PARKED THERE FROM 8AM-5PM AND WHEN I RETURNED TO MY VEHICLE, THERE WAS DAMAGE TO THE REAR RIGHT BUMPER AS IF ANOTHER VEHICLE HAD SWIPED MINE BACKING IN OR OUT OF THE NEIGHBORING STALL.  THERE WAS NO PREVIOUS DAMAGE TO MY VEHICLE-IT WAS IN PERFECT CONDITION AS IT IS BRAND NEW.",
        "vin": "1N4AL3AP3HC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/21/2017",
        "dateOfIncident": "11/20/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11047677,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL",
        "vin": "1N4AL3APXHN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/10/2017",
        "dateOfIncident": "11/10/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045237,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DEPLOY",
        "vin": "1N4AL3AP8HC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/09/2017",
        "dateOfIncident": "11/03/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11044832,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "NONE YET. RECEIVED A POSTCARD TO FILL IN INFORMATION FOR FUTURE RECALL TAKATA AIRBAGS/",
        "vin": "1N4AL3AP0HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/06/2017",
        "dateOfIncident": "10/03/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11032050,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE BACK DRIVER SIDE WINDOW IS ROLLED DOWN, THE BACK DRIVER SIDE DOOR OPENS ON ITS OWN. THIS OCCURRED WHEN MY CHILD WAS SITTING IN THE BACK SEAT AND THE DOOR OPENED ON ITS OWN.  THIS OCCURRED WHEN THE VEHICLE WAS STATIONARY IN A PARKING LOT WITH THE DOORS UNLOCKED.",
        "vin": "1N4AL3AP3HN"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "09/20/2017",
        "dateOfIncident": "03/13/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024585,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "EMERGENCY FORWARD BRAKING DOES NOT DO ANYTHING THAT THE NISSAN BOOK OUTLINES OR THE ON LINE VIDEO OUTLINES . I HAVE TWO CASE NUMBERS 25746321 AND25772524 AND TWO DEALERSHIPS THE WORK REPORT SAYS NO CODE NO PROBLEM.",
        "vin": "1N4AL3AP9HC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/10/2017",
        "dateOfIncident": "09/01/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11022564,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 NISSAN ALTIMA COUPE HAS A DASHBOARD THAT IS MELTING AND BECOMING STICKY TO THE TOUCH. AS THE MELTING AND STICKINESS PROGRESS, THE DASHBOARD IS BECOMING SHINY AND THERE IS A GLARE OCCURRING MAKING IT HARD TO SEE THE ROAD. AS THE STICKINESS AND GLARE BECOME WORSE, THIS VEHICLE IS BECOMING DANGEROUS TO DRIVE.",
        "vin": "1N4BL24E38C"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/10/2017",
        "dateOfIncident": "01/25/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10965508,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 NISSAN ALTIMA. CONSUMER WRITES IN REGARDS TO BRAKE MALFUNCTION. *LD    THE CONSUMER RECEIVED 2 VEHICLES FROM A RENTAL COMPANY WITH MALFUNCTIONING BRAKES.  UPDATED 07/10/2017*JS",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/22/2017",
        "dateOfIncident": "02/14/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10990948,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BLUETOOTH MALFUNCTIONS.  CANNOT MAKE CALLS.",
        "vin": "1N4AL3AP8HC"
    }
]