[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/24/2021",
        "dateOfIncident": "02/28/2021",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430294,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Mercedes-Benz Sprinter 3500. The contact received notification of NHTSA Campaign Number: 20V663000 (Steering) however, the part to do the recall repair was unavailable. The dealer was contacted, and it was confirmed that the part was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount time for the recall repair. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "wdapf4cc4hp"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/29/2021",
        "dateOfIncident": "07/29/2021",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427005,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Mercedes-Benz Sprinter 3500. The contact received a recall notification for NHTSA Campaign Number: 21V042000 (Electronic Stability Control) however, the dealer informed the contact that the part for the recall repair was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was not notified of the issue. The contact had not experienced a failure. Vin tool confirms parts not available.",
        "vin": "WDAPF4CC2H9"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/27/2021",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426633,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact's parents own a 2017 Mercedes-Benz Sprinter 3500. The contact stated that his parents had experienced multiple flat tire failures with various tires on the vehicle. An independent mechanic discovered that there were multiple cracks on three of the rims on the vehicle. Due to that discovery, his parents had all six tires and rims replaced on the vehicle. Recently, the contact discovered that the driver’s side inner tire had blown out after parking the RV. The contact called for emergency assistance and had the tire replaced. On a separate occasion, the contact noticed after parking the vehicle, the rear passenger’s side outer tire was flat. The contact again called for emergency assistance and while the tire was being replaced, it was discovered that the sidewalls had all fallen apart inside the tire. The vehicle was not diagnosed nor repaired. The contact believed that the cause of the tire failures was related to the rims on the vehicle. Neither the manufacturer nor the dealer was notified of the failure. The failure mileage was 8,100.",
        "vin": "WDAPF4CC1H9"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/07/2021",
        "dateOfIncident": "07/07/2021",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423787,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Mercedes-Benz Sprinter 3500. The contact received notification of NHTSA campaign number: 21V042000 (Electronic Stability Control) however, the part to do the recall repair was unavailable. The contact called the local dealer and it was confirmed that the part was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue but was unable to provide a date when parts would be available. The contact had not experienced a failure. Vin tool confirms parts not available.",
        "vin": "WDAPF4CC6H9"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/01/2021",
        "dateOfIncident": "04/08/2021",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419206,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Mercedes-Benz Sprinter 3500. The contact stated while driving at 65 MPH, the cruise control disengaged as the ABS and ESP warning lights illuminated. The contact pulled the vehicle over and read the owner's manual to get information on the failure. Upon restart, the check engine warning light illuminated. The contact received notification of NHTSA campaign number: 21V042000 (Electronic Stability Control) however, the part to do the recall repair was not yet available. The manufacturer was contacted and confirmed that parts were not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The failure mileage was 5,500. Vin tool confirms parts not available.",
        "vin": "WDAPF4CC6H9"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/24/2021",
        "dateOfIncident": "05/24/2021",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418374,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Mercedes-Benz Sprinter 3500. The contact received notification of NHTSA campaign number: 21V042000 (Electronic Stability Control) however, the part to do the recall repair was unavailable. The local dealer was contacted and it was confirmed that the part was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. Vin tool confirms parts not available.",
        "vin": "WDAPF4CC4HP"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/12/2021",
        "dateOfIncident": "04/02/2021",
        "fire": false,
        "manufacturer": "Alcoa Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407752,
        "products": [
            {
                "manufacturer": "Alcoa Inc.",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE ENTRY DOOR OPENED TWICE WHILE DRIVING. 1ST WE THOUGHT WE DIDN'T CLOSE IT RIGHT, BUT I CHECKED AND DOOR HAD LOCKS ENGAGED. THE 2ND TIME THAT DOOR OPENED UP, I PULLED OVER AND CHECKED AND ENGAGED ALL LOCKS ON DOOR AND THEN PUSHED IT A BIT AND TO MY SURPRISE THE DOOR OPENED UP! IT TURNS OUT THE SCREWS WERE LOSE SO THE LOCKS WERE NOT ENGAGING. SO I TIGHTENED THEM UP WITH THE DRILL AND PROBLEM SOLVED. THIS IS AN RV AND IT IS DRIVEN MANY MILES AND ON BUMPY ROADS SO THE SCREWS WILL LOOSEN UP CAUSING THE DEADBOLT LOCKS NOT TO ENGAGE PROPERLY.  2ND ISSUE, HOLES UNDERNEATH BED DESIGNED TO ALLOW SLIDEOUT ROLLERS TO EXTEND BED IS A SAFETY CONCERN AS GAS FUMES ENTER THE RV.*DT",
        "vin": "WDAPF4CCXH9"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/12/2021",
        "dateOfIncident": "01/02/2021",
        "fire": false,
        "manufacturer": "Alcoa Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407764,
        "products": [
            {
                "manufacturer": "Alcoa Inc.",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 MERCEDES-BENZ SPRINTER 3500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 21V042000 (ELECTRONIC STABILITY CONTROL). THE CONTACT STATED THAT MERCEDES-BENZ OF SAN JOSE SERVICE CENTER LOCATED AT 3000 E. CAPITOL EXPY SUITE A, SAN JOSE, CA 95148, (408) 214-3009) EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE PART WAS NOT AVAILABLE FOR THE REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "8BNPF4CC7HE"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/16/2021",
        "dateOfIncident": "02/10/2021",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403215,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WE ARRIVED HOME AFTER A SHORT TRIP, PARKED THE VEHICLE AND DIDN'T SEE IT UNTIL THE NEXT MORNING. WE THEN FOUND THAT BOTH LEFT REAR TIRES WERE FLAT. AIRED THEM UP AND DROVE TO DISCOUNT TIRE WHERE WE WERE INFORMED THAT BOTH RIMS WERE CRACKED AT THE EXACT SAME WELD. THE TIRES WERE IN PERFECT CONDITION: NO BLESS, BUBBLES, OR MARKS. MERCEDES BENZ REFUSED TO WARRANTY OR REPLACE THE RIMS. WE NOW SEE THERE IS A RECALL PENDING ON AN ESP FOR THE REAR TIRES - WE BELIEVE THAT ARE CONNECTED ISSUES.",
        "vin": "WDAPF4CCXH9"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/14/2020",
        "dateOfIncident": "10/12/2020",
        "fire": false,
        "manufacturer": "Alcoa Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364253,
        "products": [
            {
                "manufacturer": "Alcoa Inc.",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2018 CLASS C TIFFIN WAYFARER IS BUILT ON THE 2017 MERCEDES SPRINTER 3500 CHASSIS.  AT 17,380 MILES, WITH NO WARNING, WHILE MOVING, THE VEHICLE BEGAN BANGING, LURCHING AND SPED UP. ALL THIS OCCURRED WHILE ATTEMPTING TO GO THROUGH A CITY STREET INTERSECTION. TO STOP THE VEHICLE FROM THIS ERRATIC MOTION, I IMMEDIATELY SWITCHED IT OFF AND COASTED TO THE SIDE.  HAD THERE BEEN A VEHICLE OR PERSON DIRECTLY IN FRONT OF ME, THERE IS NO QUESTION THAT  I UNFORTUNATELY WOULD HAVE HIT THEM AS THE VEHICLE SPED UP EVEN WITH BRAKES APPLIED.  I RESTARTED THE VEHICLE AND MOVED IT OUT OF  THE INTERSECTION.  MULTIPLE ERROR AND WARNING LIGHTS CAME ON THE DASH.  WITH ONLY THREE MONTHS REMAINING ON THE WARRANTY, MERCEDES HAD THE VEHICLE TOWED TO A DEALERSHIP WHO HAS JUST INFORMED ME THE FAILURE WAS CAUSED BY THE LEFT REAR WHEEL SPEED SENSOR WHICH THEY REPLACED.  THERE ARE FOUR OF THESE SENSORS NONE OF WHICH SHOULD HAVE FAILED  WITH THIS LOW MILEAGE.  WHEN WILL THE OTHER THREE FAIL?  WHAT RISK OF ACCIDENT OR INJURY WILL THEIR POTENTIAL FAILURE CAUSE? THIS IS A MAJOR CONCERN.  APPARENTLY MERCEDES IS WELL AWARE OF THESE SENSOR FAILURES AS THE SERVICE AGENT SUGGESTED THIS AS A PROBABLE CAUSE WHEN I DESCRIBED THE PROBLEM AND REASON FOR HAVING THE VEHICLE TOWED IN.  I DO NOT BELIEVE MERCEDES HAS NOT ISSUED A RECALL  OR EXTENDED THE WARRANTY ON THESE WHEEL SPEED SENSORS.  IN MY OPINION, MERCEDES SHOULD  DEFINITELY REMEDY THESE FAILURES WITH BETTER PARTS AND WARRANTY SO AS NOT TO CAUSE RISK OF ACCIDENT OR INJURY.  I ASKED FOR THE FAILED PART, BUT WAS TOLD MERCEDES HAS THE DEALER SEND THE PARTS TO THEM.*DT  CONSUMER STATED REAR SENSORS AND MOISTURE BEING INVESTIGATED AND FEELS THAT IS NOT THE CAUSE. SERVICE TECH FEELS IT IS A FAULTY PART OR DESIGN. NEW REPLACEMENT SENSOR HAS BEEN REPLACED BUT FAILED AFTER 45 MILES. FRONT SPEED SENSORS ALSO FAILED.*JB",
        "vin": "WDAPF4CC6H9"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/01/2020",
        "dateOfIncident": "08/27/2020",
        "fire": false,
        "manufacturer": "Alcoa Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362276,
        "products": [
            {
                "manufacturer": "Alcoa Inc.",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "RMP SENSOR FAILED CAUSING VEHICLE TO LOSE ANTI LOCK BRAKES, TRACTION CONTROL AND CRUISE CONTROL. PLUS FORCED VEHICLE INTO LIMP MODE SO IT WOULD BARELY MOVE TO REST AREA TO CALL FOR ASSISTANCE.  I'VE BEEN TO THREE DEALERSHIPS WITH THIS ISSUE AND THEY ARE ALL VERY AWARE THAT THESE FAULTY SENSORS EXIST. THEY HAVE BEEN AND ISSUE FOR YEARS PUTTING 100S IF NOT THOUSANDS OF SPRINTER OWNERS AT EXTREME RISK WITH LOSS OF ANTI LOCK BRAKES AND TRACTION CONTROL AT THE SAME TIME. MERCEDES BENZ NEEDS TO CORRECT THIS FAULTY PART AND RECALL ALL VEHICLES AND FIX",
        "vin": "8BNPF4CC3HE"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/02/2020",
        "dateOfIncident": "07/31/2020",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342776,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING ON I-95 WITH THE CRUISE CONTROL SET AT 70 MPH.  SUDDENLY THE VEHICLE DECELERATED AND THREE WARNING LIGHTS (ABS, TRACTION & THE ACCELERATION SKID CONTROL / ELECTRONIC BRAKING ASSIST) CAME ON THE DASH.  THE VEHICLE FELT SLUGGISH AND THE CRUISE CONTROL WOULD NO LONGER WORK. THERE ARE ONLY 21,200+ MILES ON THE VEHICLE AND THIS WAS A VERY DANGEROUS SITUATION FOR MY FAMILY AND I WHILE TRAVELING ON THE INTERSTATE.",
        "vin": "WDAPF4CC2G9"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/30/2020",
        "dateOfIncident": "02/12/2020",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322814,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2017 RV (17,00 MI) MERCEDES BENZ CHASSIS IN DEC 2019 AND IN FEB 2020 WHILE DRIVING HOME FROM A CAMPING TRIP (55 MPH HIGHWAY) THE WARNING LIGHT COME ON AND VEHICLE WAS SURGING. I LOOKED UP THE ISSUE (WHEEL SENSOR FAILURE) AND SLOWLY DROVE HOME. GOT APP WITH MB DEALER AND REAR SENSOR REPLACEMENT MADE UNDER WARRENTRY. I TALKED WITH PREVIOUS OWNER AND WAS GIVEN THE HISTORY OF REAR WHEEL SENSOR FAILURES WITH THIS RV.  BELOW IS HIS RECORD  NOV 2018 (12,00 MI) BOTH REAR WHEEL SENSOR FAILURES AND REPLACED. APRIL 2019 REAR WHEEL SENSOR FAILED AND REPLACED. JULY 2019 ONE SENSOR FAILED AND REPLACED.  I HAVE READ WHERE THIS HAS BEEN A CONTINUED FAILURE ISSUE WITH MB WHEEL SENSORS.  PLEASE LOOK INTO THIS ISSUE AND GET MB TO CORRECT THE PROBLEM.  THANK YOU",
        "vin": "WDAPF4CC8H9"
    },
    {
        "components": "ELECTRICAL SYSTEM,WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/26/2020",
        "dateOfIncident": "03/20/2020",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319376,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEEL SPEED SENSOR FAILURE.   ABS, TRACTION CONTROL SIT DOWN UNTIL REPLACED SENSOR.",
        "vin": "8BNPF4CC2HE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/01/2020",
        "dateOfIncident": "09/06/2019",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11292401,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BODY PARTS ARE FALLING OF FOR RUNNING BOARDS, PARTS HAVE FALLEN OFF ON THE HIGHWAY AND HIT OTHER VEHICLES. DEALER UNABLE TO FIND PARTS TO RESOLVE ISSUE.",
        "vin": "WDAPF4CC4H9"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/09/2019",
        "dateOfIncident": "05/29/2019",
        "fire": false,
        "manufacturer": "Alcoa Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230366,
        "products": [
            {
                "manufacturer": "Alcoa Inc.",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2018 THOR SIESTA MOTOR HOME BUILT ON A MERCEDES BENZ 3500 CHASSIS. I WENT ON A 6700 MILE CROSS COUNTRY TRIP AND UPON RETURN FOUND THE FRONT PASSENGER TIRE FLAT. A LOCAL SHOP DISCOVERED THAT THE RIM WAS LEAKING AIR FROM A BAD WELD SPOT/CRACK ON THE INSIDE. I REPLACED THE RIM BACK ON MAY 27, 2019. I THEN WENT ON A 1000 MILE ROUND TRIP AND THE FOLLOWING DAY I NOTICED ANOTHER FLAT TIRE THIS TIME ON THE INSIDE REAR DUAL ON THE PASSENGER SIDE. MY LOCAL SHOP CONFIRMED THE SAME ISSUE WITH A WELD/CRACK ON THE INSIDE OF THE RIM ON MAY 29, 2019. I HAD TO REPLACE THAT RIM ALSO. BOTH TIMES I NOTICED THE FLAT TIRES AFTER PARKING THE VEHICLE UPON RETURNING FROM LONG ROAD TRIPS. ON THE SECOND WHEEL REPLACEMENT, I WAS SHOWN WHERE THE LEAK WAS DETECTED WHICH WAS AT THE CORNER OF THE INSIDE WELD SPOT. THERE ARE 8 WELD SPOTS ON THE INSIDE OF EACH RIM. EACH TIME THERE WAS AIR LEAKING AT THE SITE OF A WELD SPOT. I CALLED MY LOCAL MERCEDES BENZ DEALERSHIP TO INQUIRE IF THERE WAS A REPORTED ISSUE FROM THE FACTORY AND WAS TOLD NO. I THEN CALLED MY MOTOR HOME DEALERSHIP WITH THE SAME INQUIRY AND WAS TOLD THAT THEY HAVE NOT BEEN MADE AWARE OF ANY SUCH ISSUE.",
        "vin": "WDAPF4CC6H9"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/12/2019",
        "dateOfIncident": "04/11/2019",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195899,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A FOLLOW-UP TO MY COMPLAINT OF AUGUST 27 2018, NHTSA NUMBER 11122749.  I PREVIOUSLY REPORTED THE DATES AND CIRCUMSTANCES OF 3 WHEEL (RIMS) FAILURES DUE TO A CRACKED WELD WHERE THE TWO PIECES OF THE RIM ARE JOINED, CAUSING AIR TO LEAK AND TIRES TO DEFLATE.  ON APRIL 12, 2019, I HAD ANOTHER FLAT TIRE DUE TO THE SAME REASONS AS STATED IN MY PREVIOUS REPORT, A WELD IN THE RIM THAT FAILED TO HOLD AIR.  THUS FAR, FOUR OF THE SEVEN WHEELS/RIMS ON MY VEHICLE HAVE FAILED OVER AN 8 MONTH PERIOD AND 6500 MILES.  DURING MOST OF THIS PERIOD THE VEHICLE WAS IN STORAGE.  I DISCOVERED ALL THE PROBLEMS DURING MORNING AIR PRESSURE CHECKS AFTER DRIVING THE PREVIOUS DAY.  I HAVE NO IDEA HOW MUCH DAMAGE COULD HAVE BEEN SUSTAINED TO THE TIRES WHEN THEY WERE AT 61PSI AT THE START OF ONE DAY AND AT 30PSI THE NEXT MORNING AFTER A 400 PLUS MILE DRIVING DAY.  THEY WERE ALL SLOW LEAKS THAT MANIFESTED THEMSELVES AFTER A DAY OF DRIVING.  THE VEHICLE WAS PURCHASED NEW IN NOVEMBER, 2018.  IT IS A 2018 WINNEBAGO VIEW ON A 2017 SPRINTER CHASSIS.",
        "vin": "WDAPF4CC1H9"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/22/2019",
        "dateOfIncident": "03/20/2019",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191008,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RECALL HAS BEEN EFFECT SINCE 2013. AND YOUR NOTIFING MY NOW IN 2019 !?!  WHAT'S WRONG WITH YOU PEOPLE!!",
        "vin": "WDAPF4CC6G9"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/10/2019",
        "dateOfIncident": "03/09/2019",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185622,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SPRINTER COMPLETELY LOST ELECTRICAL POWER, ENGINE AND DRIVE TRAIN PROPULSION.  THE TACH AND SPEEDOMETER FROZE IN PLACE AT 2500 RPM AND 15MPH. 60 SECONDS PASSED AND THE DASH LIGHTS BLINKED AND THEN ALLOWED ME TO RESTART VEHICLE. IT WAS LIKE THE SYSTEM RE-BOOTED ITSELF. LUCKILY I WAS NOT AT SPEED OR IN A DRIVING LANE WHEN THIS HAPPENED. I HAD JUST FILLED THE TANK WITH DIESEL, MY DEF WAS AT 80% FULL AND I WAS DEPARTING THE SERVICE STATION.   I WAS ABLE TO START VEHICLE AND RETURN HOME, 10 MILES.  WHEN I ATTEMPTED TO RESTART THE VEHICLE AT HOME THE STARTER MADE A GRINDING NOISE AND THE MB DEALERSHIP HAS HEARD THE SAME NOISE.  CALLLED MERCEDES SPRINTER HOTLINE AND GOT THE SPRINTER TOWED TO THE DEALERSHIP. *DT  CONSUMER CONTACTED MANUFACTURER FOR THE SERVICE CALL.*JB",
        "vin": "WDAPF4CC1H9"
    }
]