[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/22/2021",
        "dateOfIncident": "07/14/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425998,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COOPER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Per dealer, the front passenger door latch cable went bad (documentation available if needed) on a 2017 Mini Cooper S (4-door).  Background: there was an episode a few weeks back when I was unable to latch the front passenger door. It just wouldn't latch when you tried to close it - the door would just swing / bounce off the body of the car (so to speak) on closure attempts. I fiddled with locking / unlocking the door, was finally able to have it latch again. Around 7/12, people washing my car accidentally opened that door. Unfortunately, despite again trying to fiddle around to get the door to latch for quite some time, I wasn't able to latch that door again. This obviously created a huge safety issue -- e.g. to even get the car to a dealership for repairs, people in my situation would often have to physically hold the door closed from the inside while driving. I figured out a way to hold it closed with the front passenger seatbelt; that thankfully held the door closed while I drove (including on the highway) the car to the dealership. The dealer eventually diagnosed the front passenger door latch cable as having gone bad (please see attached service report).   First, the latching mechanism for car doors should never fail - customers should never e.g. have to hold their doors closed while driving or have to rig up their seatbelts to do the same. Second, it's also very unexpected that this issue happened in my car -- my car has always been well-maintained (it's regularly serviced), my car is just four years old, it's very low mileage (26k); and hardly anyone uses my front passenger door.",
        "vin": "WMWXU3C58H2"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "11/13/2019",
        "dateOfIncident": "10/21/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279886,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COOPER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS AT A STOP WHEN THE BRAKE WAS RELEASED IT LUNGED FORWARD INTO ONCOMING TRAFFIC. ANOTHER TIME IN DRIVEWAY VEH WAS BOUGHT TO A STOP IN OUR DRIVEWAY TO TURN AROUND. THE BRAKE PEDAL WAS RELEASED AND THE CAR LUNGED INTO A WALL AND THE TIRES CONTINUED TO SPIN UNTIL BRAKES WERE HEAVILY APPLIED",
        "vin": "WMWWG5C38H3"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/28/2019",
        "dateOfIncident": "08/28/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11252000,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COOPER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 MINI COOPER. THE CONTACT CALLED ON BEHALF OF HIS WIFE AND STATED THAT WHILE DRIVING AT 20 MPH, THE CONTACT CRASHED INTO ANOTHER VEHICLE. THE AIR BAGS DID NOT DEPLOY BUT THE CONTACT MENTIONED THAT THE OTHER VEHICLES AIR BAGS DEPLOYED. A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED BACK AND NECK ACHES THAT NEEDED MEDICAL ATTENTION. THE VEHICLE WAS TOWED TO A SALVAGED YARD WAITING TO BE DIAGNOSED BY THE INSURANCE COMPANY. THE VEHICLE WAS NOT TAKEN TO A DEALER FOR A DIAGNOSTIC TEST OR REPAIRS. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS APPROXIMATELY 40,000.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/23/2019",
        "dateOfIncident": "07/21/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11234091,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COOPER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2017 MINI COOPER. THE CONTACT STATED WHILE DRIVING 35 MPH, WHEN ANOTHER VEHICLE FAILED TO STOP AT A STOP SIGN AND IMPACTED THE FRONT PASSENGER SIDE OF HER VEHICLE. THE CONTACT STATED SHE WAS COLLIDED INTO A FIRE HYDRANT. THE AIR BAG DID NOT DEPLOY. THE CONTACT STATED THE PASSENGER FROM THE OTHER VEHICLE SOUGHT MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS NOT DRIVABLE. THE VEHICLE WAS TOWED TO IMPOUND LOT.  A DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED AS OF YET. THE VEHICLE WAS DESTROYED. THE MANUFACTURER HAD NOT BEEN INFORMED OF FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.   *TR*JB",
        "vin": "WMWLN5C54H2"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "05/06/2018",
        "dateOfIncident": "05/06/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092107,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COOPER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SIDE SEAT BELT LOCKING MECHANISM JAMS, PREVENTING THE DRIVER FROM FASTENING THE SEAT BELT AND OPERATING THE VEHICLE IN A SAFE MANNER.",
        "vin": ""
    },
    {
        "components": "STEERING,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/01/2018",
        "dateOfIncident": "03/01/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075717,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COOPER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED VEHICLE NEW 2017 MINI COOPER COUNTRYMAN S AWD  FROM DEALERSHIP IN SEPTEMBER 2017, DAY AFTER PURCHASE ON THE WAY FROM TEXAS TO OKLAHOMA VEHICLE STALLED ON HIGHWAY IN A SPEED ZONE OF 75, THE VEHICLE CHECK ENGINE LIGHT CAME ON AND PERFORMANCE WAS REDUCED AND STARTED SHAKING AND VEHICLE WENT FROM 70 MPH DOWN TO 55MPH IMMEDIATELY.  DRIVETRAIN MALFUNCTION LIGHT WAS LIGHT UP AS WELL AS SERVICE ENGINE LIGHT. DEALERHSIP TOWED VEHICLE AND WAS SUPPOSE TO FLASH/UPDATE SOFTWARE ALSO HAD TO REPLACE SPARK PLUGS AND COILS AFTER THAT VEHICLE WOULD DISPLAY DRIVETRAIN MALFUNCTION AND WOULD LOSE POWER AGAIN. ON 02/28 ON THE WAY BACK FROM TEXAS AGAIN VEHICLE DID SAME THING ALMOST CAUSING A WRECK WHEN VEHICLE DECELERATED AND SHAKED. VEHICLE WAS TOWED AGAIN AND WAS ADVISED THAT VEHICLE SOFTWARE NEEDED FLASHED/UPDATED.",
        "vin": "WMZYT5C35H3"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": true,
        "dateComplaintFiled": "11/03/2017",
        "dateOfIncident": "10/28/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11042942,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COOPER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2017 MINI COOPER CLUBMAN THAT WAS RECALLED FOR AN UNSAFE BRAKE LIGHT CONDITION.  THERE WERE 4 FUNCTIONAL BRAKE LIGHTS ON THE REAR BUMPER.  AFTER MY CAR WAS \"FIXED\", I ONLY HAVE 2 FUNCTIONAL BRAKE LIGHTS ON THE REAR BUMPER.  I FAIL TO UNDERSTAND HOW THIS APPROVED \"FIX\" MADE MY CAR SAFER.  THREE WEEKS AFTER THE \"FIX\" WAS COMPLETED, I WAS REAR ENDED WHILE TURNING ONTO MY STREET.  I FEEL THAT THE NHTSA APPROVED A \"FIX\" FOR A CONDITION THAT MADE MY CAR LESS SAFE.  HOW COULD YOU ALLOW MINI TO PERMANENTLY DISABLE BRAKE LIGHTS AS A FIX?",
        "vin": "WMWLU5C38H2"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/10/2017",
        "dateOfIncident": "07/07/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004029,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COOPER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "A STRESS FRACTURE FROM TOP OF WINDSHIELD MID WAY ALONG DRIVER SIDE, DOWN ABOUT SIX INCHES THEN TURN TOWARDS REAR VIEW MIRROR.",
        "vin": "WMWXP7C31H3"
    },
    {
        "components": "SEAT BELTS,SEATS",
        "crash": false,
        "dateComplaintFiled": "06/12/2017",
        "dateOfIncident": "06/12/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10994488,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COOPER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHAT IS THE PREFERRED MANDATORY PLACEMENT OF A SEAT BELT HOLDER/ADJUSTOR FOR THE VEHICLE THAT IS WITHIN THE REGULATORY SAFETY STANDARDS? THIS VEHICLE DOES NOT HAVE A HOLDER AND CURRENTLY THE BELT LAYS ACROSS THE CONSUMERS NECK, WHICH IS NOT SAFE.",
        "vin": "WMWXP7C39H3"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/02/2017",
        "dateOfIncident": "03/30/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10969982,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COOPER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE MY WIFE WAS DRIVING THE 8-DAY-OLD COUNTRYMAN S ON A PARKWAY AT HIGHWAY SPEED, A PEBBLE WAS APPARENTLY KICKED BACK FROM A VEHICLE AHEAD, CAUSING A PIERCING OF THE RADIATOR AND A VIRTUAL IMMEDIATE INABILITY TO DRIVE.  THIS CREATED A SIGNIFICANT SAFETY HAZARD.  THE ISSUE IS NOT THE PEBBLE ITSELF, BUT RATHER THE FACT THAT, AS WE LEARNED FROM THE MECHANIC, THERE IS NO PROTECTIVE COVER OR SCREEN OVER THE FRONT OF THE RADIATOR TO PREVENT SUCH AN EVENT FROM CAUSING SEVERE DAMAGE TO THE RADIATOR.  THIS IS A BRAND NEW MODEL OF COUNTRYMAN, AND IT APPEARS, AT LEAST AS COMPARED WITH A 2017 CLUBMAN, THAT THE RADIATOR IS NOT FULLY HIDDEN BEHIND THE FRONT END, BUT IS, INSTEAD, EXPOSED TO A PROJECTILE HAZARD.",
        "vin": "WMZYT5C39H3"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/16/2016",
        "dateOfIncident": "06/07/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10874574,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COOPER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY TEST DROVE A MINI COOPER CLUBMAN S. I DID NOT LIKE THE VEHICLE, AND ONE OF THE REASONS IS THE WAY THE LIGHTING (FRONT AND REAR) IS DESIGNED. THE REAR OF THE CAR HAS VERY LARGE LIGHTS THAT GO ACROSS THE 'BARN DOORS' THAT APPEAR TO BE BRAKE LIGHTS. WHEN I WAS AT THE DEALERSHIP I NOTICED ANOTHER CLUBMAN IN THE PARKING LOT BEING PARKED WASN'T LIGHTING UP THE LARGE LIGHTS AS IT SLOWLY BACKED INTO A PARKING SPACE. UPON FURTHER EXAMINATION I REALIZED THE LARGE LIGHTS ON THE REAR DOORS ACTUALLY DO NOT LIGHT UP WHEN BRAKING. INSTEAD THERE ARE VERY SMALL LIGHTS AT THE ABSOLUTE BOTTOM OF THE BUMPER THAT INDICATE BRAKING. NOT ONLY ARE THE LIGHTS IN AN INAPPROPRIATE LOCATION BUT THEY ARE SO SMALL YOU DON'T EVEN NOTICE THEM. WHEN YOU EXPECT YOU ARE LOOKING AT BRAKE LIGHTS AND SOMEONE IN FRONT OF YOU BRAKES, YOU WOULD NEVER KNOW THAT ACTUALLY YOU HAVE TO LOOK DOWN ALMOST TO THE GROUND TO SEE THEIR INDICATOR LIGHT UP. THESE BRAKE LIGHTS ARE EXTREMELY DANGEROUS. WHY WOULD THE LARGE LIGHTS ON THE BARN DOORS IN YOUR LINE OF SIGHT THAT ARE PROBABLY 70% OF THE WIDTH OF THE CAR NOT BE THE BRAKE LIGHTS? IT IS DANGEROUS AND BMW-MINI SHOULD BE FORCED TO RECALL AND/OR STOP SELLING THESE VEHICLES UNTIL THIS ISSUE IS CORRECTED. I WOULD NOT PUT MYSELF OR MY FAMILY IN JEOPARDY DRIVING ONE OF THESE POORLY DESIGNED VEHICLES.     PLEASE SEE THE LINK TO A WEBSITE WHERE OTHER PEOPLE EXPRESS THEIR CONCERN TOO. HTTPS://M.REDDIT.COM/R/CARS/COMMENTS/3MJ3XE/2016_MINI_CLUBMAN_HAS_THE_STUPIDEST_BRAKE_LIGHTS/?UTM_SOURCE=MWEB_REDIRECT&COMPACT=FALSE",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/06/2016",
        "dateOfIncident": "05/31/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872763,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COOPER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE ONLY TWO WEEKS WITH MY NEW CAR, AND ABSOLUTELY LOVE IT!  HOWEVER, THERE APPEARS TO BE A SAFETY ISSUE WITH THE BRAKE LIGHTS.  ON TWO OCCASIONS, TRUCKS HAVE RODE UP ON MY TAIL AND HAD TO ALMOST SLAM THEIR BRAKES BEFORE WINDING UP INSIDE THE TRUNK/BOOT.  AT THE TIME, I JUST THOUGHT THESE WERE INATTENTIVE DRIVERS.    HOWEVER, I HAD READ ON A FORUM SOMEONE ELSE TOO POINTED OUT A SIMILAR INSTANCE.  IF ONE LOOKS AT THE BACK OF THE CLUBMAN, THERE ARE LARGE RED LIGHTS ON THE REAR OF THE BARN DOORS.  THIS IS WHAT APPEARS TO BE BRAKE LIGHTS AND THE 'FOCAL POINT' THAT THE DRIVERS BEHIND YOU ARE WATCHING.    HOWEVER, THESE ARE NOT THE BRAKE LIGHTS; THEY ARE MERELY THE RUNNING LIGHTS AND TURN SIGNALS.  THEREFORE, THE ONCOMING TRAFFIC HAS THEIR FOCAL POINT ON WHAT THEY THINK ARE YOUR BRAKE LIGHTS AND DON'T SEE THE TWO LITTLE LIGHTS IN THE BOTTOM REAR OF THE BUMPER UNTIL IT IS TOO LATE.  WORSE IS WITH TRUCKS, SUV, AND SEMIS WHERE THEY DON'T SEE THEM AT ALL - BECAUSE THEY ARE BELOW THEIR FIELD OF VISION.    I TOO HAVE READ SOMETHING TO THE EFFECT INDICATING THE BRAKE LIGHTS CAN'T BE EXCLUSIVE TO THE OPENING REAR DOORS, HENCE NOT BEING THE BRAKE LIGHTS.  MY PROPOSAL WOULD BE FOR BMW/MINI TO EITHER RE-CODE, CHANGE THE SOFTWARE, OR RE-WIRE TO MAKE THESE LIGHTS THAT ARE PRESENTLY THE TURN SIGNAL ALSO FUNCTION AS BRAKE LIGHTS, IN ADDITION TO THE TWO IN THE BOTTOM OF THE BUMPER.    PLEASE ADOPT A SIMPLE FIX, WHEREAS WE CAN KEEP MOTORING AND ENJOYING OUR NEW CLUBMAN'S; PLEASE TOO UNDERSTAND BMW/MINI, I ABSOLUTELY LOVE THIS CAR AND I AM NOT TRYING TO COMPLAIN OR FIND FAULT.  THE DESIGN IS EXCEPTIONAL WITH THE EXCEPTION OF THIS SAFETY CONCERN THAT COULD CAUSE MANY UNNECESSARY REAR END COLLISIONS, INJURIES, AND OR DEATHS.  PLEASE JUST ADOPT A SIMPLE FIX, WHEREAS WE CAN KEEP MOTORING AND ENJOYING OUR NEW CLUBMAN'S.",
        "vin": "WMWLU5C52H2"
    }
]