[
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/24/2022",
        "dateOfIncident": "03/15/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458146,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Nissan Sentra. The contact stated that the vehicle failed to start as needed. There were no warning lights illuminated. An unknown alarm engaged. The vehicle was not diagnosed or repaired. The manufacturer was not notified of the failure. The approximate failure mileage was 41,000",
        "vin": "3N1AB7AP4HL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/14/2022",
        "dateOfIncident": "02/01/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456618,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Nissan Sentra. The contact received notification of NHTSA Campaign Number: 21V135000 (Exterior Lighting) however, the part to do the recall repair was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. VIN tool confirms parts not available.",
        "vin": "3N1AB7AP7HY"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/04/2022",
        "dateOfIncident": "03/31/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455151,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Car will switch gears without reason at highway speeds. Car also has trouble accelerating, and revs on uphill.",
        "vin": "3N1AB7AP2HY"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/01/2022",
        "dateOfIncident": "02/16/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454611,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The transmission has been having problems since 2019 with shift delays and shuttering or jumping that pulses and surges. I’ve taken it to Nissan several times prior to warranty going out but they say they have not been able to reproduce it. Now that the warranty is expired they have been able to reproduce all of my complaints related to the transmission at $6000 price tag.",
        "vin": "3N1AB7AP8HY"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/22/2022",
        "dateOfIncident": "02/22/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11453480,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "i got thiz note  couple weeks late  you guys dinr warn me its was defective i crashed for this recal reason the lights war having problems when  iwas driving and  of and on and the emgine started to rev and the saftey to turn steering wheel locked and i crashed veichle turn of while that happen  then slamed into side walk and firehidrant frip me over i lost my car becausebof thiz  now tjat i got this recal   youguys destroid my confort now i panic and lost my car",
        "vin": "3n1ab7ap7hy"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "02/22/2022",
        "dateOfIncident": "11/05/2021",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11453492,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owned a 2017 Nissan Sentra S. The contact stated that while driving at 35 mph, the steering wheel seized and the RPM's increased. The brake pedal was depressed however the contact crashed into a curb and then a fire hydrant causing the vehicle to flip. There was smoke and a burning odor present.  The contact was unable to exit the vehicle. A police report was filed and the fire department was present. The contact sustained leg injuries from cracking the front windshield in order to exit the vehicle. The vehicle was towed to a tow yard where it was deemed a total loss. The contact stated that he received an unknown recall notice and felt that it was related to the failure experienced. The manufacturer was not notified of the failure. No further information was available. The failure mileage was 63,000.",
        "vin": "3n1ab7ap7hy"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/21/2022",
        "dateOfIncident": "01/01/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453304,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The front of the stop lamp is not working. The lighting of the lamp stopped working.",
        "vin": "3N1AB7AP2HY"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/17/2022",
        "dateOfIncident": "02/17/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452340,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "As I was driving across the railroad tracks, my car just stop. There was no warning or indication that there was a problem, it just stopped and all the lights shut down as well. No brake, head or emergency lights worked.",
        "vin": "3N1AB7AP0HL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/12/2022",
        "dateOfIncident": "02/11/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451657,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Over some period of time that I do not remember, months likely, my average fuel mileage started to go down.  I started to then notice that I had a faint at first, then stronger, smell of gasoline, after filling up, that would linger for days. It would be inside and outside of my vehicle. I then got a loose fuel cap warning after filling up one day. It wouldn't be immediate but it would come the second time I started my car after filling up. It would keep coming back after each filling up. I just dealt with losing my fuel efficiency and the smell until January 2022, I noticed after a fill up it had actively leaked gasoline. A mechanic looked at my vehicle and says that the gasket at the top of my gas tank was completely flat instead of round and that it was leaking from there and had been for awhile due to the build up off debris he saw.",
        "vin": "3N1AB7AP9HY"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/08/2022",
        "dateOfIncident": "01/29/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451001,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "On January 29th 2022, we drove the car on the interstate at about 65-70 mph for over two hours when suddenly, the vehicle completely shut off. We were able to navigate safely into the shoulder while the power steering, dashboard, and engine were all completely off. No lights or other errors appeared.   We took the car to an auto zone where they checked and cleaned the battery from corrosion. Assuming we were fine, we embarked on the three hour journey home on the same highway the next day. We drove the car for about 45 minutes short distances with no errors. As we got ready to return home, we got on the highway again. About 30 minutes into the drive going the same speed, the car shut down again. No warnings or errors like the last time.   We took the car to a Nissan dealership in Monroeville, PA. They held the car for a week doing inspections and say that there are no errors. I'm wary of the safety of the vehicle and nervous to drive a car that unexpectedly shuts down on the highway",
        "vin": "3n1ab7ap7hy"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/30/2022",
        "dateOfIncident": "01/26/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11449438,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "What component or system failed or malfunctioned, and is it available for inspection upon request? - I was involved in a head on collision while driving approximately 30 mph and hit the side of the other vehicle straight on (not at an angle) and the air bags in my 2017 Nissan Sentra did not deploy. The car was undriveable after the accident and was towed to a tow lot. The insurance adjuster said that it was a total loss. When I went to claim my property from the car, the airbags had not yet deployed which was surprising because the fire rescue squad captain warned me to stay out of the front seat because based on the damage to the front of the car, he was shocked that they had not deployed and warned me that the could go off at any moment and cause me further injury.  The car was towed to a lot and may or may  not be available for inspection - it was released to my insurance company.  How was your safety or the safety of others put at risk? - My safety was put at risk because I banged my head on my steering wheel and suffered whiplash and a concussion. Had my daughter been in the vehicle, she would have been injured too.  Has the problem been reproduced or confirmed by a dealer or independent service center? UNKNOWN  Has the vehicle or component been inspected by the manufacturer, police, insurance representatives or others? UNKNOWN  Were there any warning lamps, messages or other symptoms of the problem prior to the failure, and when did they first appear? NO  The system would not allow me to upload pictures even though there were less than 10 and all were under 5.0 MB",
        "vin": "3N1AB7AP8HL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/18/2022",
        "dateOfIncident": "09/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447856,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "After long drive, at highway speeds, transmission starts oscillating between 1k-3k revs and car starts losing power and speed. Can be dangerous as it forces you to drive at slower speeds on highway. Nissan dealership inspected multiple times and said that this is normal for the CVT transmission in these cars. Multiple forums online describe a similar issue with this car. Issue was not fixed even though it is under warranty.",
        "vin": "3n1ab7apxhy"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/14/2022",
        "dateOfIncident": "08/10/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447560,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "When on the highway, my 2017 Nissan Sentra will “lag” when going up hills. The RPMs goes crazy up and down and it’s almost like my vehicle might stall out.",
        "vin": "3N1AB7AP1HY"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/03/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442595,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Rpm’s spike up to high levels just to get up to 45/50. I have to let off gas & almost stall out to press gas to try & catch it into higher gear. This happens most the time, but not all. 45/50 but won’t go past 55/60mph, let alone 70-80 on I90/I94. & if it’s really bad then I have to be almost gas to the floor just to maintain any speed once up to 40/45++. Especially higher speeds. & other times O/D kicks in at random times random speeds & then I have to park or EMERGENCY park because reduction of speed won’t stay up, or will not even get to 55/60…  I bought this car New March 2017. Maybe 10-20 miles. We had extended warranty. I told them multiple times about the recall & the studdering since a year of owning in 2018. They said they didn’t find anything or that they did the repair. Then during covid we didn’t have funds to have maintenance but about 6 months ago I told them to fix everything do all recalls, do the issues we thought & they agreed & then never did it. Now we aren’t in warranty. We put in 2g of repairs up keep, thought it was low price. But then said ok add in auto start & do the other fluffy stuff. Well… have 9-10 grand left & they wanted to buy it & get us into another 450 car loan. We refused. & repeatedly asked why the recalls & repairs seem to have never been done. & Nissan in crystal lake IL where we have been doing business with for years now claim that the only recall is for the break lights…. & that it’s my fault for doing 60 thousand miles before coming in… during covid… when this has been an issue. Nissan dealership bought, Nissan loan, Nissan warranty. & a solid 6 years at least just to be in a money pit because “no one knows what’s wrong”, it’s the not repairing while I was in warranty telling them the same things. Now I’m not in warranty and they want me to come in to buy a new Nissan from them again, & roll in the remaining balance ️ I don’t feel safe with Nissan, let alone hulling my 2 children at/under 4… plus I use that car to work",
        "vin": "3N1AB7AP9HY"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/02/2021",
        "dateOfIncident": "11/02/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438997,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "On several occasions rear brake lights fail to function and car will not start.no warning it just happens on occasion. We understand there is a recall on matter however have not received a recall. Thank you for your time and attention to this matter",
        "vin": "3n1ab7ap2hy"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/31/2021",
        "dateOfIncident": "10/27/2021",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438808,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Car caught on fire due to electrical issues",
        "vin": "3N1AB7AP2HY"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/23/2021",
        "dateOfIncident": "10/22/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437856,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "On Friday October 22, 2021at about 320pm I was driving between the Ca central valley to the San Fernando Valley area over the grapevine. My vehicle began to surge with the rpm's reeving with little to none forward thrust. There were no warning lights, messages, alerts that illuminated. The vehicle seemed to be stuck in a high gear since driving at freeways speeds didn't appear have any issues, however getting up to freeway speed was something else. When I got to my destination in Agoura Hills, I was not able to drive up hill in any forward gear. I will have the vehicle looked at by a certified mechanic or a local dealership. I am aware that there are some Nissan Sentra models have had the same issue and recalls have been made, in reading the cvt recall information I believe my 2017 Sentra has experienced the same issues of the known recall. A search of my VIN only shows the light switch recall.",
        "vin": "3N1AB7AP4HL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/28/2021",
        "dateOfIncident": "02/28/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434665,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I received notification that my Stop Lamp Switch under my VIN has been recalled, at the beginning of 2021 and to date I have not gotten notice to bring in the car.  I took it in back in March 2021 and was told they don't have the part.  Since that time I looked under my VIN and found a total of three (3) recalls for this car.  I need to have my vehicle FIXED before there's a serious accident or worse.  I am paying a car note and have a warranty that isn't being honored.",
        "vin": "3N1AB7AP1HY"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/13/2021",
        "dateOfIncident": "09/09/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432698,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Getting a sulfur (egg smell) through vents when air conditioner is on. Not sure if something a fautly with fuel system? Car is only 4 years old with 40+ thousand miles on it.",
        "vin": "3n1cb7ap9hy"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/05/2021",
        "dateOfIncident": "09/04/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431828,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "About 6 months ago I had the brake light switch repaired because my car wouldn’t start due to the brake lights not coming on. So yesterday I’m almost was rear ended due to m break lights not coming on, and then got stranded at midnight , by myself, out of town.  Finally I put both of my feet on the break and pushed as hard as I could and it started. Called Nissan in Tracy, CA they stated there’s no fix and to have it towed there if it won’t start. Well what if someone slams into me? They also did not offer to change the switch like the safety recall states they should.  This dealership has now put my safety and my children’s safety at risk.",
        "vin": "3N1AB7AP7HY"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/03/2021",
        "dateOfIncident": "08/18/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431641,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING NORMAL DRIVING CONDITIONS, THE VEHICLE'S TRANSMISSION FAILED TO MOVE FORWARD IN DRIVE. THIS HAPPENED AFTER STOPING AT A GAS STATION. I REVERSED THE VEHICLE TO PULL OUT OF THE SPOT AND SWITCHED TO DRIVE. THATS WHEN THE VEHICLE FAILED TO MOVE FORWARD. CHECKED THE VEHICLE REVERSE, AND THE REVERSE CONTINUE TO WORK. THE VEHICLE WAS TOWED TO THE HOUSE AND THE NEAREST NISSAN DEALER WAS CONTACTED REGARDING THIS ISSUE. THE SERVICE DEPARTMENT SUPERVISOR INFORMED ME THAT THAT ISSUE WAS WELL KNOW AND THE ONLY WAY TO FIX THE PROBLEM WAS TO HAVE THE TRANSMISSION REPLACE AT A COST OF ABOUT $3,750. THE VEHICLE CURRENTLY HAS 79,258 MILES ONLY. AS OF RIGHT NOW THE VEHICLE IS NOT DRIVABLE.",
        "vin": "3N1AB7AP2HL"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/29/2021",
        "dateOfIncident": "04/19/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427074,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Over a year ago there was a recall on the airbags for the Nissan Sentra S 2017. I took my car in to the Nissan dealership to get that recall fixed. In April 2021 I was in a severe car accident and my airbags did not deploy.",
        "vin": "3N1AB7AP0HY"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/23/2021",
        "dateOfIncident": "08/31/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426076,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Nissan Sentra. The contact stated while driving 70 mph, while depressing on accelerator pedal the vehicle failed to exceed 70 mph. The contact stated no warning light was illuminated. The contact stated on July 22, 2021, while making a left turn, the vehicle failed to accelerate. The contact stated no warning light was illuminated. The contact was able to roll into a nearby parking lot. The vehicle was not drivable. The contact towed the vehicle to the local dealer, where it was diagnosed with needing the transmission to be replaced. The vehicle was not repaired but was pending repairs. The manufacturer had been informed of the failure. The failure mileage was approximately 40,000.",
        "vin": "3N1AB7AP3HL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/12/2021",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424475,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Nissan Sentra. The contact stated that while driving at various speeds, the vehicle would hesitate upon the depression of the accelerator pedal without warning. The vehicle had yet to be serviced or diagnosed for the failure. Neither the dealer nor the manufacturer was notified of the failure. The vehicle was not repaired. The failure mileage was approximately 60,000.",
        "vin": "3n1ab7ap1hy"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/17/2021",
        "dateOfIncident": "06/15/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421299,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Nissan Sentra. The contact stated that his daughter was driving the vehicle and had it parked to clean the interior of the vehicle. While placing her hand on the steering wheel, the steering column became loosened. The contact had an independent mechanic arrive at the residence and inspected the vehicle and tightened a loosened linkage to bolt on the steering column. Several days later while the contact’s daughter was driving, the steering wheel loosened. The driver continued to drive until the vehicle was taken to an independent mechanic. The driver's vehicle was then towed to the local dealer. The vehicle was not diagnosed nor repaired. The manufacturer was not made aware of the failure. The failure mileage was approximately 85,000. The Vin was not available.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/04/2021",
        "dateOfIncident": "05/04/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419692,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Nissan Sentra. The contact stated while driving 30 mph, the vehicle suddenly started skipping. The contact stated that after coming to a stop and remaining idle the vehicle failed to accelerate. The contact restarted the vehicle and drove the vehicle to a certified mechanic who diagnosed that the transmission failed and needed to be replaced. The vehicle had not been repaired. The manufacturer was not made aware of the failure. The approximate failure mileage was 100,000.",
        "vin": "3N1AB7AP7HY"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/24/2021",
        "dateOfIncident": "05/24/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418270,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Nissan Sentra. The contact was made aware of NHTSA Campaign Number: 21V135000 (Exterior Lighting) however, the part to do the recall repair was unavailable. A dealer was not contacted. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was not made aware of the issue. The contact had not experienced a failure. VIN tool confirms part not available.",
        "vin": "3N1AB7AP3HY"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/24/2021",
        "dateOfIncident": "05/24/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418318,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 Nissan Sentra. Consumer writes in regard to leaking gas fuel.   THE CONSUMER STATED THE MANUFACTURER WAS CONTACTED BUT, DID NOT OFFER ANY ASSISTANCE. *JS",
        "vin": "3n1ab7apxhy"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/24/2021",
        "dateOfIncident": "05/02/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418365,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "When trying to accelerate to high speed on freeway, transmission acts up. RPM goes up and down like crazy. Significant lag in acceleration while in motion trying to advance higher speeds. 80 MPH or higher vehicle shakes.",
        "vin": "3N1AB7AP9HY"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/18/2021",
        "dateOfIncident": "05/18/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417654,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONTACT OWNS A 2017 NISSAN SENTRA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 21V135000 (EXTERIOR LIGHTING) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER AND IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3N1AB7AP3HY"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/14/2021",
        "dateOfIncident": "05/11/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416573,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON WEDNESDAY,  MAY 11, 2021 I WAS IN AN ACCIDENT THAT TOTALLED MY CAR OUT. RUNNING AT 45 MILES PER HOUR ON A DECLINE HILL A DEEP JUMP STRAIGHT CENTER OF MY VEHICLE CAUSING THE COLLISION. AIRBAGS NEVER DEPLOYED. UPON INVESTIGATION I FOUND THAT IN JUNE 2017, THERE WAS A RECALL FOR THIS PARTICULAR REASON.  I CHECKED THE NHTSA WEBSITE AND IT SHOWS THAT THE ONLY RUNREPAIRED RECALL AT THIS TIME IS FOR A STOP LAMP SWITCH.",
        "vin": "3N1AB7AP6HL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/12/2021",
        "dateOfIncident": "05/12/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416294,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 NISSAN SENTRA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 21V135000 (EXTERIOR LIGHTING) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. BERMAN NISSAN OF CHICAGO (3456 N KEDZIE AVE, CHICAGO, IL 60618,  (312) 778-6228) WAS CONTACTED AND IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3N1AB7AP0HY"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/04/2021",
        "dateOfIncident": "02/14/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415085,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON SEVERAL OCCASIONS AND THE CAR WOULD JUST SLOW DOWN OUT OF NOWHERE ON THE HIGHWAY. I COULDN'T GET THE CAR PAST 80 OR IT WOULD SHAKE. IF I STOPPED THE CAR OR EVEN SLOWED DOWN, (ANYWHERE, STREET OR HIGHWAY) THE CAR WOULDN'T MOVE AT ALL. I WOULD BE PUSHING THE PEDAL ON THE FLOOR FOR 10 MINUTES JUST TO GET IT TO 5MPH. IF I WOULD GO UP A SMALL INCLINE, THE CAR WOULD ROLL BACK AND BARELY STOP ( ALMOST RESULTING IN SEVERAL POTENTIALLY FATAL COLLISIONS). AT TIMES MY REVERSE WOULDN'T EVEN WORK IF I COULDN'T PRESS THE GAS AND IF IT DID WORK THEN I COULDN'T DRIVE FROWARD. IT WOULD TAKE ME ALMOST 30 MINUTES TO GET HOME FROM WORK AND MY JOB IS EXACTLY 10 MINUTES IN A STRAIGHT LINE FROM MY HOUSE (ON THE STREET. NO HIGHWAY). IF THAT GIVES ANY PERSPECTIVE. ONCE THE CAR WAS PARKED IT WAS FINE. ALL THE PROBLEMS OCCURRED WHILE THE CAR WAS IN MOTION.",
        "vin": "3N1AB7AP5HL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/03/2021",
        "dateOfIncident": "03/03/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414933,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 NISSAN SENTRA. THE CONTACT STATED WHILE DRIVING APPROXIMATELY 45 MPH, THE VEHICLE DECELERATED INDEPENDENTLY. THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO DAYTONA NISSAN (950 N. TOMOKA FARMS RD, DAYTONA BEACH, FL 32124, (386) 478-4019) HOWEVER, THE VEHICLE WAS NOT YET DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE AND SUGGESTED THAT THE VEHICLE BE DIAGNOSED BY AN AUTHORIZED DEALER. THE FAILURE MILEAGE WAS APPROXIMATELY 65,000.",
        "vin": "3N1AB7AP4HY"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/29/2021",
        "dateOfIncident": "04/28/2021",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414433,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2017 NISSAN SENTRA. THE CONTACT STATED THAT UPON PARKING HIS VEHICLE, HIS WORK BUILDING WAS EVACUATED DUE TO FIRE. UPON EXITING THE VEHICLE, THE CONTACT DISCOVERED THAT HIS VEHICLE HAD CAUGHT ON FIRE. THE FIRE DEPARTMENT WAS CALLED TO THE SCENE AND THE FIRE WAS EXTINGUISHED. A FIRE AND POLICE REPORT WERE BOTH FILED; NO INJURIES WERE REPORTED AT THE SCENE. DUE TO THE FAILURE, THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHERE THEY DETERMINED THAT THE FIRE WAS CAUSED BY AN ELECTRICAL DEFECT. THE CONTACT CALLED AN UNKNOWN NISSAN DEALER WHERE THEY REFERRED HIM TO THE INDEPENDENT DEALER WHERE THE VEHICLE WAS PURCHASED. THE MANUFACTURER HAD YET TO BE NOTIFIED OF THE FAILURE. THE VEHICLE WAS DEEMED A TOTAL LOSS. THE FAILURE MILEAGE WAS APPROXIMATELY 70,000.",
        "vin": "3N1AB7AP3HY"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/17/2021",
        "dateOfIncident": "04/17/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408593,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY AND NOTICED THAT AS I ACCELERATED, MY RPM WOULD INCREASE BUT MY SPEED-O-METER WOULDN'T. AND IF IT DID MOVE, IT MOVED VERY SLOWLY.",
        "vin": "3N1AB7AP4HY"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/09/2021",
        "dateOfIncident": "04/04/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407269,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION FAILED AT 86,000 MILEAGE. VEHICLE STOPPED ON HIGHWAY IN THE MIDDLE OF DRIVING. TOOK VEHICLE TO DEALERSHIP AND CONFIRMED CVT TRANSMISSION FAILURE.",
        "vin": "3N1AB7AP4HL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/28/2021",
        "dateOfIncident": "03/26/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405197,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE, NOTICED THE VEHICLE START TO SPORADICALLY JERK. ENGINE RPM WOULD JUMP AND THE ACCELERATOR WAS NON RESPONSIVE AT TIMES. NO CHECK ENGINE LIGHT ACTIVATED. PULLED UP TO A STOP LIGHT AND WHEN THE LIGHT TURNED GREEN THE ACCELERATOR WOULD NOT WORK AT ALL. PUSHED THE PEDAL TO THE FLOOR AND HAD NO RESPONSE AT ALL. STILL NO CHECK ENGINE LIGHT. CONTACTED NISSAN AND THEY STATED THE ISSUE WAS THE CVT TRANSMISSION STARTING TO FAIL. CAR IS A 2017 AND HAS LESS THAN 92000 MILES ON IT. EXTENDED WARRANTY ENDS ON THAT YEAR AT 84000 MILES. WITHOUT WARRANTY COVERAGE THE REPAIR IS AROUND $4000. LOOKED ALL OVER THE INTERNET AND FOUND LOTS OF PEOPLE ARE HAVING THE SAME ISSUE. NISSAN NEEDS TO EXTEND THE WARRANTY OR ISSUE A RECALL. IT IS A SERIOUS PROBLEM TO BE DRIVING AND LOSE ACCELERATOR RESPONSE ALL TOGETHER",
        "vin": "3N1AB7APXHY"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/19/2021",
        "dateOfIncident": "01/12/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403867,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED A USED 2017 NISSAN SENTRA IN APRIL 2019. IT CURRENTLY HAS 49,000 MILES ON IT, AND FOR THE PAST THREE MONTHS THERE HAS BEEN A PROBLEM WITH INTERMITTENT SOFT BRAKES. THE PEDAL WILL GO ALL THE WAY DOWN TO THE FLOOR. MECHANIC HAD PROBLEMS DIAGNOSING IT BECAUSE IT WAS INTERMITTENT. FINALLY HE REPLICATED THE ISSUE AND FLUSHED AIR OUT OF THE BRAKE LINES. BRAKES WORKED PROPERLY FOR A FEW DAYS, AND THEN ISSUE STARTED UP AGAIN. STILL TRYING TO GET THE MECHANIC TO DIAGNOSE THE PROBLEM.",
        "vin": "3N1AB7AP7HY"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/12/2021",
        "dateOfIncident": "02/11/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395892,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FRONT COLLISION SENSOR WENT OFF WITH NO PREVIOUS WARNING BY NISSAN IS CALLED THE DISTANCE SENSOR I CALLED THEM AND ALL WHAT THEY SAID IT'S GOING TO COST ME THE REPAIR MY CAR BARELY HAS LESS THAN 45000 MILES ALSO ALL WHAT I GET ON MY DASH IS MALFUNCTION AND IT SHOW THE FRONT SENSOR.",
        "vin": "3N1AB7AP6HY"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/11/2021",
        "dateOfIncident": "02/06/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395769,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS 81229 MILES ON IT THE PROBLEM STARTED AROUND 81,000 CAR SURGING AND TRANSMISSION SLIPPING WHILE DRIVING ON HIGHWAY AND CITY STREETS",
        "vin": "3N1AB7AP3HL"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/07/2021",
        "dateOfIncident": "02/06/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395109,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WAS IN MOTION WHEN I LOSS 90% ACCELERATION  AND VELOCITY WHILE DRIVING. VERY, VERY SCARY! I WAS ON THE HIGHWAY WHEN THIS OCCURRED. I PROCEEDED TO CHECK THE BATTERY, ALTERNATOR, AND STARTER BY AAA WHEN A SERVICE CALL WAS PLACED TO INSPECT THE VEHICLE AT MY HOME. AAA'S. THEY INFORMED ME THAT THE BATTERY, ALTERNATOR AND STARTER ARE GREAT AND THAT THESE THINGS WERE NOT THE REASON WHY THE CHECK ENGINE LIGHT CAME ON AND HAS REMAINED ON. THE CAR IS ONLY 3YRS 11MNTHS OLD. I GET THE STANDARD OIL CHANGE BUT NISSAN HAS DISCONTINUED TO USE CONVENTIONAL OIL. WHICH IS THE RECOMMENDED OIL FOR MY CAR. I ALSO GET THE CAR SERVICED AS NEEDED. IT IS EXTREMELY DANGEROUS TO DRIVE MY CAR. I CANNOT DRIVE IT PERIOD. IT SUDDENLY LOSES POWER 60 TO 120 SECONDS WHEN THE CAR IS IN MOTION.",
        "vin": "3N1AB7AP3HY"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/31/2021",
        "dateOfIncident": "10/17/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390839,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I AM ON THE INTERSTATE AND I AM GOING BETWEEN 60MPH AND 80MPH MY CAR STARTS TO SHAKE. THE ENTIRE FRONT OF MY CAR BEGINS TO SHAKE AND YOU CAN HEAR IT AS WELL. WHEN I START TO BRAKE OR SLOW DOWN, IT'S GETS LOUDER AND THE SHAKING GETS WORSE.",
        "vin": "3N1AB7AP4HY"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/19/2021",
        "dateOfIncident": "01/08/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388900,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS STARTED ACTING CONFUSED WITH THE GEAR SHIFTS. IT'S ALMOST LIKE I AM REPEATINGLY PUTTING IT IN DRIVE THEN NEUTRAL THEN SPORTS MODE WHEN I AM NOT DOING ANYTHING JUST TRYING TO DRIVE. THE CAR STRUGGLES TO PICK UP SPEED AND 'GIDDY UP' WHEN I ACCELERATE.  IT GETS WORSE WHEN I GO UP HILL OR OVER 40 MPH. I WAS TOLD IT'S VERY DANGEROUS AND NOW HAVE TO GET THE TRANSMISSION LOOKED AT PER THE DIAGNOSIS.",
        "vin": "3N1AB7AP9HL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/19/2021",
        "dateOfIncident": "12/01/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388944,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AIR BAG LIGHTS KEEP COMING ON. I HAVE REPLACED SENSOR BUT IT KEEPS HAPPENING",
        "vin": "3N1AB7AP7HL"
    },
    {
        "components": "AIR BAGS,STRUCTURE,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/07/2021",
        "dateOfIncident": "12/29/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11386891,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR'S BRAKES STOPPED RESPONDING IN THE HIGHWAY AND THE CAR HIT ONE SIDE OF THE ROAD (IT WAS SNOWING) THEN IT CUT 3 LANES AND WENT ALL THE WAY TO THE OTHER SIDE AND HIT THE WALL AGAIN. THE IMPACT WAS HIGH, THE  VEHICLE HAS MAJOR DAMAGE BUT THE AIRBAGS NEVER DEPLOYED.",
        "vin": "3N1AB7APXHY"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/22/2020",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375826,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY GEARS DID NOT APPEAR ON MY DASHBOARD WHEN I GOT IN MY CAR TO GO HOME. THE CAR ALSO WOULD NOT GO INTO GEAR (REVERSE OR DRIVE). I KEPT TRYING TO SWITCH THE GEARS AND PRESS THE GAS. THE CAR EVENTUALLY STARTED MOVING FORWARD AND GAINED ENOUGH SPEED FOR ME TO DRIVE HOME. THE NEXT DAY I CRANKED MY CAR, THE GEARS SHOWED UP ON THE DASHBOARD AND THE CAR MOVED (I WAS HOME IN MY DRIVEWAY). HOWEVER SINCE, THE GEARS HAVE DISAPPEARED AGAIN AND THE CAR WILL NOT MOVE.",
        "vin": "3N1AB7AP7HY"
    },
    {
        "components": "STEERING,POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/24/2020",
        "dateOfIncident": "10/23/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366117,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAVE BEEN GIVING ME PROBLEMS SUCH AS CUTTING OFF IN THE MIDDLE OF DRIVING AND I DON'T SEEM TO BE GOING OVER 45 WHEN THIS HAPPEN I TOOK IT TO NISSAN TO GET IT FIXED AND STILL DOES THE SAME THING WITHOUT WARNING THE CAR LOCKS THE STEERING WHEEL AND BRAKES THE LIGHTS ON THE DASH LIGHT UP AND THE CAR CUTS OFF.",
        "vin": "3N1AB7AP0HY"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/20/2020",
        "dateOfIncident": "09/23/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365456,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MULTIPLE OCCASIONS UPON ENTERING THE CAR, PRESSING ON THE BRAKES, AND PUSHING THE START BUTTON, THE CAR WILL NOT START. I HAVE TO WAIT SEVERAL MINUTES, SOMETIMES AS LONG AS AN HOUR AND EVENTUALLY THE CAR STARTS. IT STARTS AFTER MULTIPLE ATTEMPTS. THIS HAS HAPPENED LATE AT NIGHT, SINCE I TRAVEL AND WORK MULTIPLE DIFFERENT SHIFTS AS A TRAVEL NURSE. IT'S EXTREMELY SCARY TO LEAVE WORK IN THE MIDDLE OF THE NIGHT, GET TO THE DARK PARKING LOT, AND YOUR  CAR NOT START.",
        "vin": "3N1AB7AP5HL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/15/2020",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364577,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 NISSAN SENTRA. THE CONTACT STATED THAT THE TRANSMISSION FAILED WHILE DRIVING AT VARIOUS SPEEDS. THE VEHICLE DECELERATED AND FAILED TO GAIN ACCELERATION AFTER A COMPLETE STOP. THE TRANSMISSION JERKED AND SLIPPED. THE CONTACT STATED THAT AFTER RESTARTING THE VEHICLE, THE VEHICLE OPERATED AS INTENDED. THERE WERE NO WARNING LIGHTS BEFORE, DURING OR AFTER THE FAILURE OCCURRED. THE VEHICLE WAS TAKEN TO TWO UNKNOWN NISSAN DEALERS TO HAVE A DIAGNOSTIC PERFORMED THAT WAS UNABLE TO LOCATE A FAILURE CODE FOR THE TRANSMISSION FAILURE. THE VEHICLE WAS ALSO TAKEN TO A TRANSMISSION SPECIALIST WHO LOCATED DTC CODE: P0776 WHICH WAS RELATED TO THE ELECTRONIC PRESSURE CONTROL SOLENOID. THE CONTACT WAS INFORMED THAT THE TRANSMISSION NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE VIN WAS NOT AVAILABLE.  THE FAILURE MILEAGE WAS 49,000.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/23/2020",
        "dateOfIncident": "08/30/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360808,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "LIGHT GOING ON LOOKS LIKE TRANSMISSION AND TRANSMISSION HAS BEEN FAILING WHEN I DRIVE",
        "vin": "3N1AB7AP2HY"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/26/2020",
        "dateOfIncident": "08/26/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351403,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "PUSH TO START NOT WORKING INTERMITTENTLY. KEY FOB HAS BEEN REPROGRAMMED AND BATTERY REPLACED. CAN TAKE UP TO TWO HOURS FOR PUSH TO START TO WORK AND CAR TO START. ALL LIGHTS COME ON AND RADIO START. DOES NOT START CAR. BATTERY AND KEY FOB BOTH WORKING PROPERLY. BRAKES ALSO WORKING PROPERLY. THIS IS A PROBLEM THAT HAS BEEN REPORTED TO NISSAN MANY TIMES FROM REPORTS AND FORUMS FOUND ONLINE AND HAS NOT BEEN CORRECTED BY THE COMPANY. CAR IS IN PARKED POSITION AND OFF.",
        "vin": "3N1AB7AP7HY"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/20/2020",
        "dateOfIncident": "08/17/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350445,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A NEW 2017 NISSAN SENTRA SR AND WHEN I PUSH DOWN ON THE BRAKE TO START THE CAR AND THEN PUSH THE START/STOP BUTTON ALL THE LIGHTS COME ON BUT THE CAR WILL NOT START. THIS HAS HAPPENED VARIOUS TIMES AND I TOOK IT TO THE DEALER ONCE FOR REPAIR, THEY CHANGED THE BRAKE SENSOR, BUT IT KEEPS HAPPENING ALMOST ONCE EVERY OTHER WEEK.",
        "vin": "3N1AB7AP7HY"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/06/2020",
        "dateOfIncident": "03/04/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343625,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE MILEAGE STATED IS IN EXCESS OF THE MECHANICAL LIMITS OF THE ODOMETER THE ODOMETER READING IS NOT THE ACTUAL MILEAGE.",
        "vin": "3N1AB7AP4HL"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/31/2020",
        "dateOfIncident": "07/01/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342540,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 NISSAN SENTRA. THE CONTACT STATED THAT WHEN THE VEHICLE SHIFTED FROM 2ND TO 3RD GEAR AT APPROXIMATELY 30 MPH, THE VEHICLE HESITATED. THE CONTACT THEN STATED THAT WHILE DRIVING AT HIGHWAY SPEEDS WHILE ACCELERATING, THE RPM REVVED UP TO 5,000 RPM AND THE VEHICLE FAILED TO SHIFT GEARS AS DESIGNED. THE VEHICLE WAS TAKEN TO NISSAN 24 (1016 BELMONT ST, BROCKTON, MA 02301, (508) 588-9520) TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE TRANSMISSION NEEDED TO BE REPLACED. THE CONTACT STATED THAT APPROXIMATELY 80% OF THE TRANSMISSION WAS REPLACED HOWEVER, THE FAILURE RECURRED INTERMITTENTLY. ADDITIONALLY, THE VEHICLE SPUTTERED WHILE DRIVING 25 MPH. THE BATTERY BECAME DRAINED AND THE VEHICLE HAD TO BE JUMP STARTED. THE VEHICLE WAS TAKEN TO THE SAME DEALER AND THE BATTERY WAS REPLACED. THE CONTACT STATED THAT ADDITIONAL UNKNOWN REPAIRS WERE PERFORMED HOWEVER, THE FAILURE RECURRED WITH THE CHECK ENGINE WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN BACK TO THE SAME DEALER AND THE CONTACT WAS INFORMED THAT THE ENGINE WIRING HARNESS NEEDED TO BE REPLACED. THE REPAIR WAS STILL PENDING. THE MANUFACTURER WAS CONTACTED AND INFORMED OF THE FAILURE AND A CASE WAS FILED. THE APPROXIMATE FAILURE MILEAGE WAS 60,000.",
        "vin": "3N1AB7AP7HL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/16/2020",
        "dateOfIncident": "07/15/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339722,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I STEP ON THE BRAKE TO START THE CAR IT DOESN'T START. LIKE THE SWITCH OR SENSOR IS COMMUNICATING TO THE ENGINE FOR IT TO START. IT HAS BEEN HAPPENING SINCE I GOT THE CAR A LITTLE OVER A YEAR AGO.",
        "vin": "3N1AB7AP4HY"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/15/2020",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339534,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD MANY ISSUES WITH THIS VEHICLE, AND THE MOST PROBLEMATIC ONE IS THE TRANSMISSION. WHEN I ACCELERATE TO HIGH SPEED ON HIGHWAY  AT A POINT THE TRANSMISSION STARTS TO ACT UP. THE RPM START TO GO UP AND DOWN CRAZY. AND THE VEHICLE DOES NOT ACCELERATE  AND I COULD OF HAD HARDCORE ACCIDENTS THIS HAPPENS FREQUENTLY, BUT RANDOMLY. THERE ARE NO CHECK LIGHTS ON OR ANYTHING, SOMETIMES THE VEHICLE DRIVE NORMAL AND AT TIMES IT DOES NOT. I TOOK IT IN TO THE DEALERSHIP AND THEY NEVER HAD THE TIME TO FIX MY VEHICLE UNTIL I SAID ENOUGH I NEED THIS DONE ASAP. WELL IT TOOK THEM 5 DAYS TO TELL ME IT WAS THE TRANSMISSION  AND GIVEN CODE IS DTC: P17F4. I WAS LOOKING INTO IT AND DID SEE THERE ARE CURRENT RECALLS FOR SOME SENTRA BUT MINE IS NOT ONE I GUESS MAYBE IT IS THE MODEL I DONT KNOW.",
        "vin": "3N1AB7AP9HY"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/13/2020",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339064,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STATIONARY, VEHICLE WILL NOT START WHEN TRYING TO START VEHICLE WITH PUSH START THERE ARE ALSO NO BRAKE LIGHTS WHEN BRAKES ARE APPLIED. PERIODICALLY THE ABS LIGHT WILL TURN ON, WHILE DRIVING ON MULTIPLE TYPES OF ROADS, FOR NO REASON AND WILL NOT TURN OFF UNTIL CAR IS TURNED OFF AND RESTARTED. THIS BEGAN APPROXIMATELY 1 YEAR AGAIN IN 2019 AND HAS CONTINUALLY GOTTEN WORSE AND WON'T START DAILY. DEALERSHIP TOLD ME MY CAR IS NO LONGER UNDER WARRANTY AND THEREFORE WOULD BE AN OUT OF POCKET EXPENSE. AT THE TIME THE ISSUE BEGAN MY CAR WAS ONLY 2 YEARS OLD. THERE ARE NUMEROUS COMPLAINTS ONLINE REGARDING THE SAME ISSUE WITH OTHER CAR OWNERS, HOW IS THIS NOT A RECALL ISSUE ALREADY???",
        "vin": "3N1AB7AP5HY"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/24/2020",
        "dateOfIncident": "05/23/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325742,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL LIGHT WORKING EXCEPT TAIL LIGHTS.  *TR",
        "vin": "3N1AB7AP8HY"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/27/2020",
        "dateOfIncident": "02/27/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311938,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TRANSMISSION IS SKIPPING WHEN DRIVING IT HAS SKIPPED AND WHEN STOP THEN I GO IT SKIPS LIKE IF JUMPS A SPEED TODAY 2/27/20 IT HAS HAPPED TWICE WHILE STOPES AND THEN GO",
        "vin": "3N1AB7AP3HY"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/24/2020",
        "dateOfIncident": "02/23/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311061,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE LOSES FUEL POWER WHEN MAKING TURNS OR WHEN ATTEMPTING TO ACCELERATE QUICKLY (IE: ENTERING FREEWAY ON THE ON-RAMP). RPM FLUCTUATE OR INCREASE EVEN IF ACCELERATOR IS DEPRESSED. PER MECHANIC, FAULTY THROTTLE POSITIONING SENSOR IS VERY COMMON WITH NISSAN.",
        "vin": "3N1AB7AP6HY"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/19/2020",
        "dateOfIncident": "01/25/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310119,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "01/25/2019 NORTH OF INDIANAPOLIS, IN TRAVELING SOUTH ON I-65, THE CAR APPEARED TO SHIFT INTO NEUTRAL AT 70 MPH. STOPPED ON THE INSIDE LANE, SHUT OFF THE CAR AND RESTARTED AND SEEMED TO BE OKAY. GOT JUST SOUTH OF INDY AND STOPPED FOR GAS, MADE IT OUT OF THE GAS STATION AND THE CAR WOULDN'T GO FOWARD BUT WOULD GO IN REVERSE. HAD TO BACK UP THE ENTRANCE RAMP TO I-65 TO AVOID BEING HIT BY SEMI'S COMING DOWN THE RAMP.CALLED NISSAN EMERGENCY ROADSIDE SERVICE AND THEY HAD THE CAR TOWED TO A NISSAN DEALER (HUBLER NISSAN) THEY TOLD US THE TRANSMISSION WOULD NEED TO BE REPLACED.  PRIOR TO THIS INCIDENT I TOOK THE CAR TO M'LADY NISSAN ON 02/02/2018 TO COMPLAIN ABOUT ERRATIC SHIFTING, THEY FOUND NO PROBLEMS. ON 06/11/2019 I AGAIN TOOK THE CAR TO M'LADY NISSAN TO COMPLAIN ABOUT RPM'S JUMPING AS THE CAR ATTEMPTED TO SHIFT AND NOT WANTING TO SHIFT AT ALL GOING FOWARD ON A FLAT SURFACE ROAD. THEY KEPT THE CAR FOR A WEEK AND SAID THE FOUND NO PROBLEMS. AT THE TIME THE TRANS WENT OUT, THE CAR ONLY HAD 3,548 MILES ON IT. FOR THE SECOND COMPLAINT AFTER THE NEW TRANS WAS PUT IN THE CAR ONLY HAD 4201 MILES ON IT. WE NOW ONLY USE THE CAR FOR LOCAL TRIPS AS WE ARE AFRAID TO TAKE IT OUT ON THE ROAD AND THE TRANSMISSION  CONTINUES TO ACT ERRATICALLY. NISSAN WON'T DO ANYTHING  FOR US AND M'LADY NISSAN (WHERE WE BOUGHT THE CAR) DOESN'T OR WON;T EVEN ACKNOWLEDGE THAT THERE IS A MAJOR PROBLEM. THEY DID TELL US IF THE TRANS GOES OUT AGAIN WE MIGHT GET SOMETHING DONE UNDER THE LEMON LAW",
        "vin": "3N1AB7AP9HY"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/13/2020",
        "dateOfIncident": "02/10/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309070,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED MY CAR IN AUG. OF 2017. JAN.  2018 WAS THE FIRST OF 7 TIMES I HAVE TAKEN MY CAR IN FOR THE CHECK ENGINE LIGHT. CASE IS AT NISSAN NORTH AMERICA IN ARBITRATION WHERE THEY WANT TO 'COMPENSATE' ME  $1500 TO ESSENTIALLY SHUT MY MOUTH. THERE IS A SIGNIFICANT LAG IN THE ACCELERATION NOT ONLY FROM A STANDSTILL , BUT ALSO WHILE IN MOTION TRYING TO ACCELERATE TO HIGHER SPEEDS. THE CAR WILL NOT GO FASTER THAN 55 MPH UP A HILL. WHEN THE CAR IS ON SLIGHT INCLINES THE VEHICLE LOSES POWER IN ATTEMPTING TO CLIMB AND THE ENGINE TACHOMETER READINGS CLIMBS WELL ABOVE THE DESIGNED RPM SPECIFICATIONS.  THIS  HAPPENS ON LEVEL GROUND.  WHEN ACCELERATED FROM 45 MPH TO 55 MPH THE TACHOMETER WOULD APPROACH 6000 RPMS PRIOR TO SWITCHING GEAR.  IT DOESN'T OCCUR 100% OF THE TIME, THE VEHICLE CONSISTENTLY REACHES CLOSE TO 6000 RPMS PRIOR TO SHIFTING TO A HIGHER GEAR. AS I  DRIVE I ALSO START TO NOTICE A BURNING SMELL. MY CAR IS CONSUMING EXCESSIVE FUEL COMPARED TO ANOTHER 'LOANER' 2019 NISSAN SENTRA SV WHICH HAS THE SAME EXACT SPECIFICS.  MY CAR REQUIRES 3 TIMES THE FUEL TO DRIVE A SIMILAR DISTANCE. WHEN TELLING  NISSAN CONSUMER AFFAIRS THIS I WAS TOLD 'THIS IS NORMAL BECAUSE MY CAR IS OLDER AND HAS MORE MILEAGE ON IT.'  NORMAL WEAR AND TEAR OVER A 2 TO 3 YEAR PERIOD WOULD NOT ACCOUNT FOR SUCH A DISPARITY IN FUEL MILEAGE.  NISSAN TECH SUPPORT HAS PHYSICALLY GONE TO THE DEALERSHIP TO TRY TO FIX MY VEHICLE AND I SINCE TAKEN IT IN ON FEBRUARY 10 FOR THE 7TH TIME. NISSAN CALLED BECAUSE MY ARBITRATION POC DIDN'T CALL THEM LIKE SHE WAS SUPPOSED TO 4 DAYS AGO SO NOW MY VEHICLE SITS AT THE DEALERSHIP BECAUSE THEY DON'T KNOW HOW TO FIX IT. .   MY VEHICLE IS NOT SAFE TO DRIVE ON A PUBLIC ROADWAY OR TO TRANSPORT MY 8YO. I HAVE SUBMITTED MY CASE TO THE ATTORNEY GENERAL'S OFFICE AND BBB AUTO-LINE CLAIM. I JUST WANT TO BE IN A SAFE VEHICLE. I HAVE ALL THE SERVICE DOCS BUT FILE IS TOO BIG TO ATTACH.",
        "vin": "3N1AB7AP0HL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/11/2020",
        "dateOfIncident": "02/09/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308525,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2017 NISSAN SENTRA SR IS DOING THE SAME EXACT THING THAT OTHER SENTRA AND OTHER NISSAN S TRANSMISSION MESSING UP IT DOESN'T MAKE ANY SENSE. THEY SAY MY SENTRA DON'T FALL UNDER THE RECALL",
        "vin": "3N1AB7AP5HY"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/04/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307128,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE IDLE ON MY 2017 NISSAN SENTRA SR TURBO SURGES EVERY NOW AND THEN, AND WHEN IT IS BELOW ~55 DEGREES OUTSIDE, IT FEELS LIKE IT RUNS ROUGH WHEN IT IS IN NEUTRAL (6 SPEED MANUAL).",
        "vin": "3N1CB7SP3HY"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/27/2020",
        "dateOfIncident": "11/06/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302417,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT 2017 NISSAN SENTRA BRAND NEW FROM DEALERSHIP AND WAS VERY UNFAIRLY OVERCHARGED. I WAS CHARGED $23,014.53 FOR A CAR THAT WAS ONLY WORTH $16,000 AND HAS SO MANY ISSUES. GAS TANK SOMETIMES WILL STOP AT 200 MILES AND WILL NOT FILL UP, SPEEDOMETER SHOOTS UP AND DOWN WHILE DRIVING, SPEED DOES NOT STAY AT A CERTAIN SPEED AND SLOWS DOWN AUTOMATICALLY. THE ENGINE JERKS AND SPUTTERS WHILE DRIVING ON FREEWAYS AND STREETS.",
        "vin": "3N1AB7AP7HY"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/25/2020",
        "dateOfIncident": "01/20/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301877,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CODE P2135 KEEPS SHOWING. BOUGHT A NEW THROTTLE PEDAL POSITIONING SENSOR FROM NISSAN, HAD IT INSTALLED. AFTER 2 WEEKS THE SAME PROBLEM SHOWS BACK. THE VEHICLE CUTS OFF WHILE DRIVING, LOSE POWER AS DRIVING, AND SOMETIMES IDLES HIGH WHILE IDLING AND THEN CUTS OFF.",
        "vin": "3N1AB7AP4HY"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/19/2020",
        "dateOfIncident": "01/14/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300289,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS HAVING THE ISSUE WHERE WHEN THE BRAKE IS PRESSED IT DOES NOT DETECT IT AND THE CAR WILL NOT START, ALSO THE ABS AND TRACTION CONTROL LIGHTS REMAIN ON THERE ARE OTHER CARS THAT NISSAN IS RECALLING FOR THE SAME ISSUE YET THIS ONE HAS YET TO GET A RECALL MAKING IT A VERY UNRELIABLE AND UNSAFE ISSUE",
        "vin": "3N1AB7AP0HY"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/03/2019",
        "dateOfIncident": "12/03/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286697,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IN A STATIONARY POSITION AND OFF THE CAR'S AUTOMATIC START WILL NOT START THE CAR EVEN WHEN PRESSING ON THE BRAKE PETAL AND PRESSING THE AUTOMATIC START BUTTON. THE CAR WILL CYCLE THROUGH THE ELECTRONIC WARNING ON THE DASHBOARD TO SAY - PRESS THE BRAKE PEDAL AND PRESS THE START BUTTON. THE CAR WILL NOT START. INSTEAD IT WILL CYCLE THROUGH THE RADIO COMING ON AND THE DASH ILLUMINATING AND THEN TO OFF. THE CAR WILL NOT START. IT FIRST OCCURRED ON 11/26/19, ON TWO SEPARATE OCCASIONS. FIRST OCCASION WAS ATTEMPTING TO LEAVE OUR HOME GARAGE. SECOND OCCASION WAS DIRECTLY FOLLOWING OCCASION 1 AS WE ATTEMPTED TO LEAVE THE GROCERY STORE PARKING LOT. THE THIRD WAS ON 12/3/19, AS WE ATTEMPTED TO LEAVE A METRO PARKING GARAGE. THE VEHICLE WILL TAKE 3-4 ATTEMPTS AND FULL CYCLES (5 MINUTES) TO START THE CAR.",
        "vin": "3N1AB7AP9HY"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/26/2019",
        "dateOfIncident": "11/12/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282553,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 NISSAN SENTRA. WHEN THE BRAKE PEDAL WAS DEPRESSED, THE VEHICLE WOULD NOT COME A COMPLETE STOP. THE CONTACT DROVE THE VEHICLE TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE DEFECT WAS RELATED TO THE CENTRAL PROCESSING UNIT. THE CONTACT STATED THAT THE CHECK ENGINE AND TIRE PRESSURE WARNING INDICATORS ILLUMINATED. WHILE DRIVING 10 MPH, THE VEHICLE SHUT OFF WITHOUT WARNING. THE VEHICLE HAD NOT BEEN REMOVED FROM THE SCENE OF THE FAILURE. THE MANUFACTURER WAS NOTIFIED AND INFORMED THE CONTACT TO HAVE THE VEHICLE TOWED TO O'NEIL NISSAN (849 STREET RD, WARMINSTER, PA 18974, (215) 674-9300). THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "3N1AB7AP9HL"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/12/2019",
        "dateOfIncident": "11/11/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279468,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I CAN BE DRIVING AND MAINTAINING THE SPEED LIMIT WHEN ALL OF A SUDDEN MY SPEED WILL DROP ALMOST LIKE I AM HITTING THE BRAKES. THIS HAS HAPPENED DURING CITY DRIVING AND WHILE ON THE HIGH WAY. THIS HAS BEEN HAPPENING FOR ABOUT 8 MONTHS NOW.",
        "vin": "3N1AB7AP3HY"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/25/2019",
        "dateOfIncident": "10/15/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271098,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN AT A STANDSTILL OR MOVING AT LOW SPEED, WHEN THE ACCELERATOR IF FULLY DEPRESSED IT INTERMITTENTLY DOES NOT STOP ACCELERATING DESPITE THE REMOVAL OF PRESSURE ON SAID ACCELERATOR. THIS CAUSES THE VEHICLE TO ACCELERATE UNCONTROLLABLY. ONLY BY CONSTANTLY ENGAGING THE ACCELERATOR IN A VIOLENT MANNER DOES THE VEHICLE FINALLY CEASE ACCELERATING. THIS CONDITION HAS CAUSED SOME EXTREMELY DANGEROUS DRIVING CONDITIONS INCLUDING HAVING TO PLACE THE TRANSMISSION IN NEUTRAL WHILE BRAKING AND PULLING TO THE SIDE OF THE ROADWAY UNTIL THE ACCELERATOR DISENGAGED AND THE ENGINE CEASED RACING AT THE VERY HIGHEST RPM.",
        "vin": "3N1AB7AP8HL"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/22/2019",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270148,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION PROBLEMS, SOME TOMES  IT DOES NOT CHANGE GEAR.  SOME TIMES IN STATIONARY THE GEAR WILL NOT CHANGE, SOMETIME WILE IN MOTION THE CAR WIL SLOW DOWN. THIS HAPPENS , IN THE CITY AND ON THE FREEWAY",
        "vin": "3N1AB7AP6HL"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/09/2019",
        "dateOfIncident": "10/07/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11267293,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 NISSAN SENTRA. WHILE THE CONTACT'S VEHICLE WAS AT A COMPLETE STOP, IT WAS REAR ENDED BY ANOTHER VEHICLE. THE IMPACT CAUSED THE TWO VEHICLES IN FRONT OF THE CONTACT'S VEHICLE TO ALSO BECOME REAR ENDED. THE CONTACT'S VEHICLE WAS TOWED. POLICE REPORT NUMBER: [XXX] WAS FILED. THE DRIVER AND PASSENGER AIR BAGS FAILED TO DEPLOY. AS A RESULT, THE CONTACT'S HEAD STRUCK THE STEERING WHEEL. THE CONTACT SUFFERED INJURIES TO THE BACK, NECK, AND HEAD. MEDICAL ATTENTION WAS RECEIVED. THE MANUFACTURER AND DEALER WERE NOT CONTACTED. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE FAILURE MILEAGE WAS 11,100.*DT    ('PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).')*JB",
        "vin": "3N1AB7AP1HY"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/12/2019",
        "dateOfIncident": "08/30/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254980,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2017 NISSAN SENTRA WITH 37,000 MILES WILL NOT START.  I HAVE THE KEYLESS IGNITION AND WHEN I TRY TO START THE CAR I KEEP GETTING A MESSAGE TO PRESS THE BRAKES.  I HAVE THE BRAKE PEDDLE PRESSED BUT CAR DOES NOT REGISTER THAT.  I WORRY THAT THE BRAKES ARE GOING TO FAIL WHILE DRIVING.  IF I KEEP PRESSING THE PEDDLE EVENTUALLY THE CAR WILL START.  THIS HAS BEEN ON-GOING FOR THE PAST 3-4 WEEKS.",
        "vin": "3N1AB7AP7HY"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/09/2019",
        "dateOfIncident": "08/20/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254051,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL . I HAVE A COMPLAINT ON THE CVT TRANSMISSION. MY TRANSMISSION WAS SERVICED BACK IN OCTOBER, NOT EVEN A YEAR AGO AND IT BEGIN ACTING UP AGAIN BACK IN AUGUST WHILE DRIVING AND I'VE SEEN THE LAWSUITS AND RECALLS ON IT. AND NISSAN WOULD NOT ALLOW ME TO STAY UNDER THE WARRANTY OR EXTEND IT. SO I DONT MIND PULLING IN THE LEMON LAW FIRM.",
        "vin": "3N1AB7APXHY"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/24/2019",
        "dateOfIncident": "08/23/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246243,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TAMARA RECALL:   MY CAR HAS THE PUSH BUTTON START AND I JUST RECENTLY PURCHASED IT WITH 50,000 MILES ON IT.  IT USED TO ONLY HAPPEN EVERY ONCE IN A WHILE AND AS OF YESTERDAY IT HAPPENS EVERY SINGLE TIME I TRY TO TURN ON MY CAR. I PUSH THE BRAKE AND PUSH THE BUTTON AND EVERYTHING WILL LIGHT UP BUT THE CAR WON'T TURN ON. THEN THE PUSH BRAKE LIGHT COMES ON AND PUSH START BUTTON COMES ON AND I TRY IT AGAIN BUT THIS TIME THE BRAKE IS REALLY HARD TO PUSH DOWN AND DOESN'T ALLOW ME TO PUSH IT IN FAR ENOUGH TO BE ABLE TO ACTUALLY START IT. AFTER CONTINUOUSLY PUSHING THE BRAKE AND THIS BUTTON AND DISCONNECTING THE BATTERY AND JIGGLING THE BRAKE FOR LIKE 10 MINUTES I MIGHT FINALLY GET IT TO COME ON IF I'M LUCKY. I'VE SEEN ONLINE A LOT OF PEOPLE HAVE HAD THIS ISSUE BUT NOTHING TELLS ME HOW I CAN GO ABOUT FIXING IT.",
        "vin": "3N1AB7AP1HY"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/23/2019",
        "dateOfIncident": "02/21/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245995,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 NISSAN SENTRA. WHILE DRIVING 55 MPH, THE VEHICLE HESITATED AND JERKED HARSHLY. THE CONTACT STATED THAT THE VEHICLE FELT AS IF IT WOULD LOSE POWER, BUT IT DID NOT. THE VEHICLE WAS DRIVEN TO COGGIN NISSAN JACKSONVILLE (0600 ATLANTIC BLVD, JACKSONVILLE, FL 32246, (904) 302-8231) WHERE IT WAS DIAGNOSED THAT A NEW TRANSMISSION WAS NEEDED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 64,810.",
        "vin": "3N1AB7AP5HY"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/21/2019",
        "dateOfIncident": "08/09/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11245607,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A PRIVATE RESIDENTIAL STREET, MY 2017 SENTRA ACCELERATED FROM 20 TO OVER 100 MPH IN SECONDS.  BRAKES NOR EMERGENCY BRAKE WORKED.  CAR SPUN OUT AND CAME TO A VIOLENT STOP BEFORE CAREENING INTO A TOWNHOUSE COMMUNITY.  WAS TOLD MY TRANSMISSION CAUSED THE PROBLEM. *DT  CONSUMER STATED THE CAR HAS BEEN REPAIRED. SOMETHING WITH THE TRANSMISSION CAUSED THE CAR TO LOSE CONTROL.  THEY REBUILT THE TRANSMISSION AND IT IS SUPPOSE TO BE FINE NOW.  YOU HAVE MY APPROVAL TO SPEAK WITH NISSAN REGARDING MY CAR.  UNFORTUNATELY I AM BEING FORCED TO PICK IT UP FROM THE DEALERSHIP TODAY ALTHOUGH I TOLD THEM I DON'T WANT THE CAR ANYMORE. NISSAN CORPORATION WILL NOT BUY IT BACK BECAUSE THEY BELIEVE THE FIX IS GOOD. I DID NOT TAKE ANY PICTURES OF THE CAR AS THERE WAS NO PHYSICAL DAMAGE TO THE EXTERIOR. I HAD TO VISIT URGENT CARE THE DAY OF THE INCIDENCE. I WAS IN SHOCK AFTER WHAT TOOK PLACE ' TERRIBLE HEADACHE, SORE BODY, NAUSEA. I AM CURRENTLY SEEING A PSYCHOLOGIST/PSYCHIATRIST FOR PTSD FROM THE INCIDENT. THAT'S THE REASON I DON'T WANT THE CAR BACK. I FEEL LIKE I WILL HAVE A NERVOUS BREAKDOWN IF I HAVE TO DRIVE IT. IF I MUST TAKE IT HOME TODAY I WILL HAVE IT TOWED TO MY RESIDENCE UNTIL I CAN MAKE ALTERNATIVE PLANS. *JB  *TR *DT  CONSUMER STATED CAR HAS BEEN REPAIRED. SOMETHING WITH THE TRANSMISSION CAUSED THE CAR TO LOSE CONTROL. *JB",
        "vin": "3N1AB7AP6HY"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/10/2019",
        "dateOfIncident": "02/13/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242990,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR RUNS FINE THEN WHEN YOU STOP AND TRY TO RESTART IT, A MESSAGE COMES UP 'WARNING NO KEY DETECTED, SYSTEM ERROR'. THE CAR IS STATIONARY AND WILL NOT START AND EVERYTHING IS SHUT DOWN. YOU NEVER KNOW WHEN THIS WILL HAPPEN.",
        "vin": "3N1AB7AP7HL"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/07/2019",
        "dateOfIncident": "07/17/2019",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242227,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BACK SEAT DRIVER SIDE BEHIND THE HEAD REST- THERE IS SMOKE AND ASHES SMELLS BURNS. THE VEHICLE WAS PARKED IN FRONT OF THE RESIDENCE.",
        "vin": "3N1AB7AP2HL"
    },
    {
        "components": "POWER TRAIN,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/21/2019",
        "dateOfIncident": "07/18/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233720,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY VEHICLE AND IT WAS LOCKED INTO GEAR I WANT TO PRESS ON MY BRAKES IT WOULD NOT SLOW DOWN I REAR-ENDED A VEHICLE, AND THE AIRBAGS DID NOT DEPLOY",
        "vin": "3N1AB7AP5HY"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/09/2019",
        "dateOfIncident": "07/08/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230324,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WILL NOT START",
        "vin": "3N1AB7AP5HY"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/08/2019",
        "dateOfIncident": "07/07/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230270,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 60MPH ON THE HIGHWAY IN THE LEFT LANE, THE CAR SUDDENLY TURNED OFF. THE INSTRUMENT PANEL SUDDENLY WENT DARK, ENGINE TURNED OFF, EVERYTHING SUDDENLY JUST SHUT OFF WITH NO WARNING. WE HAD DIFFICULTY MANEUVERING THE CAR OVER TO THE RIGHT SHOULDER. AFTER WE PULLED OVER IT RESTARTED & WE WERE ABLE TO DRIVE AWAY.   IRONICALLY WE HAD OUR 30,000 MILE SERVICE THE NEXT DAY BUT NISSAN SAID NOTHING IS WRONG. ONLINE WE'VE NOTICED PREVIOUS YEARS WITH THE SAME PROBLEM BUT THE TSB ONLY COVERS NISSANS UP TO 2016.",
        "vin": "3N1AB7AP0HY"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/29/2019",
        "dateOfIncident": "06/21/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228363,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH LESS THAN 12000 MILES . WHILE DRIVING THE SIDE WALL OF A TIRE BLEW OUT.",
        "vin": "3N1AB7AP1HL"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/28/2019",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228245,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 NISSAN SENTRA. WHILE DRIVING 35 MPH AND ATTEMPTING TO BRAKE, THE BRAKE PEDAL HAD TO BE DEPRESSED TO THE FLOORBOARD TO STOP THE VEHICLE. IN ADDITION, THE CONTACT HEARD AN ABNORMAL NOISE WHILE DRIVING. THE VEHICLE WAS TAKEN MULTIPLE TIMES TO BILL RAY NISSAN (LOCATED AT 2724 N US HWY 17 92, LONGWOOD, FL 32750, (407) 831-1318) WHERE IT WAS DIAGNOSED THAT THE REAR ROTORS NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 13,800.",
        "vin": "3N1AB7AP0HY"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "06/24/2019",
        "dateOfIncident": "06/09/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11222320,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN A WRECK AND THE AIRBAGS DID NOT DEPLOY. I WAS ON A MAIN STREET GOING 40MPH AND WAS IN A HIT AND RUN BUT THE AIR BAG NEVER DEPLOYED. I HAVE PICTURES BUT WILL NOT ALLOW ME TO UPLOAD. DT*JB",
        "vin": "3N1AB7AP7HL"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/18/2019",
        "dateOfIncident": "06/15/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221005,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PEDAL SENSOR IS DEFECTIVE, IT INTEREMITTENTLY DETECTS THE BRAKE PEDAL BEING PRESSED AND ALLOWS THE CAR TO START. SOMETIMES THE BRAKE PEDAL WILL GO COMPLETELY TO THE FLOOR AND SOMETIMES IT WOLL NOT ACTIVATE AT ALL. SOMETIMES THE BRAKE LIGHT WILL NOT GO OUT AND THE CAR WILL NOT START. SOMETIMES IF I PUMP THE BRAKE PEDAL THE LIGHT WILL GO OUT AND THE CAR WILL START. SOMETIMES IF I HAVE THE DOOR OPEN  AND PRESS THE PEDAL THE CAR WILL START=, SOMETIMES THERE IS NO PROBLEM AT ALL",
        "vin": "3N1AB7AP8HY"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/06/2019",
        "dateOfIncident": "06/05/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11218396,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL- WHEN IN A COLLISION IN MY CAR THERE WAS NO REASON MY AIR BAGS WOULDN'T HAVE GONE OFF. I AM IN PAIN FROM THIS WRECK AND MY AIR BAGS DID NOT GO OFF. IF THERE IS ENOUGH DAMAGE TO TOTAL PUT A NEW CAR; IT SHOULD HAVE TRIGGERED THE AIRBAGS. *DT  *DT*JB",
        "vin": "3N1AB7AP7HL"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/29/2019",
        "dateOfIncident": "05/29/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210589,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY AT 3AM ON MY WAY TO WORK AT 60 MPH AND THE HOOD OF THE CAR RELEASED AND FLEW OPEN AND SLAMMED INTO MY WINDSHIELD WITH HIGH IMPACT. IF NOT FOR THE TIME AND LESS TRAFFIC ON THE ROAD THIS COULD HAVE BEEN TRAGIC. I WAS ABLE TO GUIDE MY WAY ONTO THE SHOULDER AND CALL A TOW TRUCK.",
        "vin": "3N1AB7AP8HY"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/17/2019",
        "dateOfIncident": "04/20/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208165,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING WITH CRUISE CONTROL SET, THE CRUISE CONTROL WILL DISENGAGE ON ITS OWN. WHEN IT DISENGAGES ON ITS OWN, THE VEHICLE SPEED DROPS AS MUCH AS 10 MPH IN 1 TO 2 SECONDS. ALSO WHEN IT DISENGAGES ON ITS OWN, THE TACHOMETER WILL BLIP UP AND DOWN BEFORE THE ENGINE RESTORES THE POWER TO THE WHEELS.",
        "vin": "3N1CB7AP7HY"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/10/2019",
        "dateOfIncident": "05/04/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206879,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 NISSAN SENTRA. THE CONTACT STATED THAT WHENEVER DRIVING, THE VEHICLE SWERVES SIDE TO SIDE AS A RESULT THE CONTACT BECAME CAR SICK. THE STEERING WHEEL AS BECAME DIFFICULT TO MANEUVER AND AN ABNORMAL RATTLING NOISE WAS HEARD. THE VEHICLE WAS TAKEN TO FRED ANDERSON NISSAN (9225 GLENWOOD AVE, RALEIGH, NC 27617 (919) 324-3443) WHERE THE FAILURE COULD NOT BE DUPLICATED. A MASTER TECHNICIAN TEST DROVE THE VEHICLE AND IGNORED THE FAILURES AND SAID THEIR WAS NO PROBLEM. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND THEY SENT IN THE MASTER TECHNICIAN THAT DENIED ALL OF THE FAILURES. THE FAILURE MILEAGE WAS 11 MILES.    *JS",
        "vin": "3N1AB7AP0HY"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/14/2019",
        "dateOfIncident": "04/13/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196084,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE BYPASS TO GET FROM CHICAGO TO INDIANA WHEN I FELT LIKE THE CAR WAS BEING SHIFTED SO AS I WAS SHIFTING TOWARDS THE LEFT SIDE INTO A DITCH, I ENDED UP ABLE TO PULL OVER TO THE RIGHT SIDE OF THE ROAD AND AS SOON AS A STOPPED AND PUT THE CAR IN PARK, THE AIR BAGS DEPLOYED OUT ON THE DRIVERS AND PASSENGERS SIDE ALONG THE WINDOWS. I LET ME CAR PPL KNOW ABOUT AND THEY TOLD ME BY MY CAR BEING LIGHT WEIGHT, I COULD BE GOING 45MPH, IF THE WIND IS STRONG THEN IT CAN POSSIBLY KNOCK ME OFF THE ROAD BUT I NEVER HEARD ANYTHING LIKE THAT. IF I WAS GOING FAST, MY CAR PROBABLY WOULD'VE FLIPPED OVER! AND WHEN I DRIVE, THE FLOOR MATS BE SLIDING UNDER THE GAS PEDALS AND STUFF AND NOW THAT THE AIR BAGS ARE DEPLOYED, MY SEAT BELTS ARE LOCKED IN THE FRONT",
        "vin": "3N1AB7AP2HY"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/08/2019",
        "dateOfIncident": "03/14/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194518,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE WAS PARKED WHEN ANOTHER CAR STRUCK THE DRIVER'S SIDE REAR BUMPER. THE ENTIRE QUARTER PANEL WAS CAVED IN AND THE BUMPER ALMOST KNOCKED OFF, THE TAIL LIGHT SHATTERED AS WELL. THE ESTIMATED DAMAGE IS OVER 3500.00. THIS SEEMS HIGHLY UNSAFE AS THE CAR IS LITERALLY PLASTIC, WE HAD KNOW WARNING NOR INFORMED THE CAR WAS SO EASILY DAMAGED AND COULD POTENTIALLY TAKE A LIFE OR INJURE A PERSON SEVERELY. SINCE THE CAR WAS PARKED WHEN THE DAMAGE OCCURRED AND IT WAS DONE BY A CAR BACKING OUT OF THE PARKING LOT AT A SLOW RATE OF SPEED WE FEEL UNSAFE IN THIS CAR NOW AND WANT NISSAN TO FIX THIS PROBLEM OR TRADE OUR CAR FOR A STABLE CAR NOT A DEATH TRAP. WE LIVE IN UTAH AND PEOPLE DRIVE LIKE PSYCHOS.",
        "vin": "3N1AB7AP4HY"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/05/2019",
        "dateOfIncident": "04/02/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193968,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AND THE RADIO TURNED OFF, THE DASH TURNED OFF AND THE CAR TURNED OFF WHILE DRIVING BUT LESS THAN A MINUTE ALL TURNED ON IT HAPPENED 4 TIMES... FROM THAT DAY ON THE RADIO WONT TURN OFF EITHER WHEN PRESSING THE TURN OFF BUTTON. AM REALLY SCARED IF SOMETHING GOES CRAZY WITH THE CAR WHILR DRIVING.  SORRY MY ENGLISH IS NOT THAT GOOD.",
        "vin": "3N1AB7AP0HY"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/20/2019",
        "dateOfIncident": "03/19/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190290,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE MY SECOND OIL CHANGE (VEHICLE IS UNDER 15000 MILES CURRENTLY) THE CHECK ENGINE LIGHT WILL RANDOMLY COME ON AND THEN GO AWAY. IT WOULD NOT ALARM ME, BUT I AM HEARING THE SHIFTING OF THE POWER TRAIN NOW MORE OFTEN THAN BEFORE. A CLICKING AS IT SHIFTS UP AND DOWN. THE ENGINE IS A CVT, BUT FROM WHAT OTHER MECHANICS HAVE TOLD ME, THIS IS NOT HOW IT SHOULD SOUND AND SHOULD NOT BE HOW IT PERFORMS.",
        "vin": "3N1AB7AP2HY"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/15/2019",
        "dateOfIncident": "08/23/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187167,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKARA RECALL, AIRBAGS LIGHT IN MIDDLE OF DASH COMES ON SAYING NO AIRBAGS AND GOES OFF CONSTANTLY. I BELIEVE THERE IS A PROBLEM WITH MY AIRBAGS. WHICH I'VE NOTICED A FEW DAYS AFTER PURCHASING THE CAR. WHICH WAS PURCHASED 8/23/2018.",
        "vin": "3N1AB7AP2HY"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/14/2019",
        "dateOfIncident": "03/04/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186876,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS GOING DOWN THE HIGHWAY WITH CRUISE ON AT 70MPH.  RPMS STARTED JUMPING AND LOST POWER. TOOK TO NISSAN HAD IT CHECKED SND ITS A CVT TRANSMISSION FAILURE AT 99,798MILES ON CAR. CONTACTED NISSAN USA ABOUT IT AND WITH A 8 DAY REPLY GOT THAT ITS NOT COVERWD UNDER WARRENTY FOR A KNOWN DEFECT DUE TO THEY ONLY COVER 5/60000 MILES NOT 10YRS/120,000 MILES ON THAT VEHICLE. CAR LESS THAN 1 1/2 YRS OLD. SO WHEN I TOOK IT TO DEALERSHIP LIKE NISSAN USA TOLD ME TO DO  SO THEY WOULD KNOW WHATS WRONG WITH IT FOR SURE. THEY TELL ME THEY WONT FIX IT. SO COST ME $130 TK HAVE IT CHECKED. AND ANOTHER $270 FOR A LOANER CAR WHILE DEALERSHIP HAD MY CAR. AND TO GET CAR FIXED IT WILL COST ME $4000. I KNOW I WOULD NEVER SUGGEST A NISSAN LEMON TO ANYONE, AND WILL NEVER BUY A NISSAN AGAIN SINCE I STILL OWE $18,000+ ON A CAR I CANT DRIVE DO TO NISSAN KNOWING THE CVT TRANSMISSION ARE MESSED UP",
        "vin": "3N1AB7AP0HY"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "01/06/2019",
        "dateOfIncident": "11/11/2018",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11165456,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THE CAR FOR 15K CASH THAT DAY, 45 MINUTES LATER WHILE DRIVING HOME ON THE HIGHWAY I HAVE AN OPTION FOR ECO MODE AND BOOST MODE, I WENT TO TURN ON ECO MODE AND NOTHING I HIT IT AGAIN NOTHIN, 3RD TIME THE ECO LIGHT CAME ON, THEN I GO FOR CRUZE CONTROL , 1,2,3,4 TRYS NOTHIN ON 5TH IT WORKED, IM DOING 70 ON RHE HWY AND ITS NOW 75 I WENT TO HIT ACCELERATE 1 TIME IT IT FLEW INTO THE BACK OF ANOTHER PERSON , AND INSTANTLY WHEN I HIT ACCELERATE THE GAS PEDAL WAS FLOORED AND DIDNT HAVE TIME TO TURN OFF. I DO TRULY FEEL RHIS IS A LEMON CAR AND NOW 16K IN THE HOLD AND NO CAR",
        "vin": "1111111111"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/28/2018",
        "dateOfIncident": "12/12/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11163869,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SUV DRIVER HIT OUR SENTRA FROM BEHIND WHILE STATIONARY; WE WERE THE LAST CAR IN THE LINE OF THE RIGHT LANE OF TRAFFIC AND WE WERE AT A DEAD STOP. WE WERE HIT VERY HARD FROM BEHIND AND WE SLAMMED INTO THE SUV IN FRONT OF US. DRIVER AND PASSENGER AIRBAGS DID NOT DEPLOY FOR EITHER DRIVER OR PASSENGER DURING THIS COLLISION. THERE WAS SIGNIFICANT STRUCTURAL DAMAGE AND THE VEHICLE WAS CONSIDERED TOTALED. MY PARTNER WHO WAS THE PASSENGER SUFFERED A CONCUSSION DUE TO THIS COLLISION, OUR CHILD WAS THANKFULLY UNHARMED IN A SEAT WITH A 5 POINT RESTRAINT. *DSY",
        "vin": "3N1AB7AP9HY"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/21/2018",
        "dateOfIncident": "07/01/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130660,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 NISSAN SENTRA. WHILE DRIVING LOW SPEEDS, THE VEHICLE WOULD NOT ACCELERATE WHEN THE ACCELERATOR PEDAL WAS DEPRESSED. THE CONTACT ALSO STATED THAT THE VEHICLE VIOLENTLY ACCELERATED AFTER SEVERAL ATTEMPTS. THE FAILURES OCCURRED TWICE. THE VEHICLE WAS TAKEN TO NISSAN OF RICHMOND (11401 W BROAD ST, HENRICO, VA 23233, (804) 346-4200) WHERE THE CONTACT WAS INFORMED THAT IN ORDER TO DIAGNOSE THE FAILURE, THE MECHANIC WOULD HAVE TO DRIVE THE VEHICLE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 11,346.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/14/2018",
        "dateOfIncident": "09/14/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129589,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 NISSAN SENTRA. WHILE THE GEAR WAS IN REVERSE, THE CONTACT SHIFTED INTO PARK AND THE VEHICLE SHOOK AND STALLED. THE VEHICLE WAS RESTARTED AFTER SEVERAL MINUTES AND THE BATTERY WARNING INDICATOR ILLUMINATED. THE LOCAL DEALER AND MANUFACTURER WERE NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS 30,000.",
        "vin": "3N1AB7AP7HY"
    },
    {
        "components": "WHEELS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/13/2018",
        "dateOfIncident": "09/06/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129388,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 NISSAN SENTRA. WHILE DRIVING 65 MPH, THE VEHICLE PULLED TO THE RIGHT WITHOUT WARNING. THE VEHICLE WAS TAKEN TO BILLION AUTO NISSAN (LOCATED AT 3715 SINGING HILLS BLVD, SIOUX CITY, IA 51106, (712) 560-4511) WHERE IT WAS DIAGNOSED THAT AN ALIGNMENT WAS NEEDED. THE VEHICLE WAS REPAIRED. IN ADDITION, WHILE DRIVING APPROXIMATELY 65 MPH, THE VEHICLE INDEPENDENTLY BRAKED WITHOUT WARNING, THE CONTACT DEPRESSED THE ACCELERATOR PEDAL AND WAS ABLE TO RESUME DRIVE. THE VEHICLE WAS LATER TAKEN BACK TO THE DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURES. THE APPROXIMATE FAILURE MILEAGE WAS 1,700.",
        "vin": "3N1AB7AP8HY"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/02/2018",
        "dateOfIncident": "09/02/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11124036,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE ACCELERATES (REVS UP) UNEXPECTEDLY ON ITS OWN WHILE DRIVING OR WHILE STOPPED AT A TRAFFIC LIGHT. WHILE DRIVING, THIS CAUSES THE SPEED TO INCREASE EVEN THOUGH I HAVE NOT STEPPED ON THE GAS PEDAL; AND I IMMEDIATELY HAVE TO STEP ON THE BRAKES TO AVOID AN ACCIDENT. AFTERWARDS, I STOP THE CAR AND TURN OFF THE ENGINE BEFORE PROCEEDING TO RESTART AND CONTINUE DRIVING IT. NOTE: THE UNEXPECTED ACCELERATION/REVVING HAS OCCURRED ON DIFFERENT OCCASIONS, INCLUDING AT STOP SIGNS OR RED TRAFFIC LIGHTS, WHILE THE CAR IS STOPPED WITH THE BRAKES APPLIED.",
        "vin": "3N1AB7APXHY"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/16/2018",
        "dateOfIncident": "06/29/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120557,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAGS DID NOT DEPLOY WHEN THE CAR WAS WRECKED, EVEN WHEN THE VEHICLE WAS HIT BASICALLY HEAD ON",
        "vin": "3N1AB7AP4HY"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/04/2018",
        "dateOfIncident": "07/15/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115757,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION DOES NOT SHIFT PROPERLY TO 2ND, 4, AND 5TH GEAR.  I TOOK IT TO THE DEALERSHIP TO GET IT LOOKED AT AND THE MECHANIC REPORTED THAT THIS PROBLEM IS COMMON AMONG MY VEHICLE MAKES.  I STILL DON'T SEE A RECALL FOR IT AND HE SAID THEY WON'T FIX IT UNTIL THEN.  CAN WE GET THIS BALL ROLLING PLEASE, IT'S A HUGE HIGHWAY SAFETY CONCERN.",
        "vin": "3N1CB7AP9HY"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/31/2018",
        "dateOfIncident": "06/16/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114960,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS VEHICLE ON 06/16/2018 ONLY TO BREAK DOWN 4 HOURS LATER CAR LOST POWER WAS LOST CAR WOULD NOT ACCELERATE OVER 10-15MPH HOURS AND ALL THE LIGHTS ON DASH BOARD WERE LIGHTING UP I CONTACTED SALESMAN AND I WENT INTO NISSAN SOUTH IN MORROW CAR WAS CHECKED INTO SERVICE AND HAD U0101-LOST COMMUNICATION CODE 45MINS LATER MY NAME WAS PAGES AND CAR WAS SUPPOSED FIXED THEY REFUSED TO KEEP THE VEHICLE I WAS TOLD THAT HAPPENS SOMETIMES FROM CAR JUST SITTING ON THE LOT 3 DAYS LATER WOKE UP TO LEAVE AND CAR WOULD NOT START AND DASH BOARD WAS LIGHTING UP WITH ALL INDICATORS THAT COULD POSSIBLE BE ON EVENTUALLY CAR STARTED ONLY TO LET ME GET DOWN THE STREET FROM MY HOUSE CAR LOST POWER AND CUT OFF DASH BOARD LIGHTS WERE ALL ON I HAD TO WAIT OVER 1 HOUR AND EVENTUALLY CAR STARTED DROVE NORMAL I WENT BACK TO NISSAN AGAIN TO SERVICE AND BECAUSE THE CAR WAS NOT DUPLICATING THE ISSUES I EXPRESSED THEY TOLD ME THEY COULD NOT HELP ME BECAUSE THE CAR SHOWED NO SIGNS AND THEY COULD NOT KEEP CAR UNTIL THEY COULD DUPLICATE THE ISSUE SENT ME BACK HOME FOR 3RD TIME NOW AND 2 DAYS LATER I WAS ON A BUSY EXPRESSWAY AND THE CAR LOST POWER WOULD NOT ACCELERATE PAST 10-15MPH AND THE GAS PETAL WAS ALL THE WAY TO THE FLOOR AND I WAS ON A BUSY EXPRESSWAY I HAD TO WAIT 2HRS ON SIDE OF THE ROAD AND CAR EVENTUALLY STARTED WENT TO DEALERSHIP AGAIN AND THEY TOLD ME THERE IS NOTHING SHOWING IN THE CODES AND THAT THEY HAVE TO DUPLICATE I WASN'T ASSISTED TOOK IT BACK HOME SAME THING AGAIN NOW THIS TIME THEY KEPT IT AND FINALLY AFTER 2DAYS CAR BROKE DOWN ON THEM AND THEY CLAIM IT WAS FROM WIRE SUPPOSEDLY CAR WAS FIXED AND TIL THIS DAY ENGINE LIGHT AND ACCELERATING LAGS AND IT HAPPENS INTERMITTENTLY AND THEY HAVE NO FIX FOR THE ISSUE BUT TO TELL YOU ABOUT A CODE THIS MODEL AND YEAR THERE IS DEFECT IN THIS VEHICLE AND MY ISSUES NEVER STOP AND THIS IS SUPPOSED TO BE A NEW VEHICLE",
        "vin": "3N1AB7AP2HY"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/29/2018",
        "dateOfIncident": "07/24/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11114350,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS GOING DOWN A S CURVE ROADWAY AND HIT A PATCH OF WATER, HYDROPLANED OFF THE ROADWAY AND DOWN AN EMBANKMENT.  THERE WAS HEAVY DAMAGE TO THE FRONT END OF THE VEHICLE AND NO DAMAGE TO THE SIDES, HOWEVER, THE FRONT DRIVER AND PASSENGER AIRBAG DID NOT DEPLOY ONLY THE SIDE AIRBAGS.  SERIOUS INJURIES TO THE DRIVER WITH A BRAIN BLEED AND ABRASION FROM HITTING THE STEERING WHEEL. *TT  *JS  *TR *DT  *TR",
        "vin": "3N1AB7AP3HY"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/25/2018",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113480,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FEDRAL SEATING CAPACITY ON OFFICIAL FEDERAL LABEL",
        "vin": "3N1AB7AP7HY"
    },
    {
        "components": "EXTERIOR LIGHTING,AIR BAGS,WHEELS",
        "crash": true,
        "dateComplaintFiled": "07/11/2018",
        "dateOfIncident": "06/23/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110675,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAGS DEFECTIVE(NOT WORKING DURING IMPACT OF CRASH)  TIRES BALD 3   FRONT FENDER  BUMPER OFF  VEHICLE IN MOTION NOT TURNING STATIONARY",
        "vin": "3N1AB7AP2HY"
    },
    {
        "components": "STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "07/05/2018",
        "dateOfIncident": "07/03/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11109633,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT INTO A FENDER BENDER HITTING MY RIGHT CORNER OF MY BUMPER AGAINST THE BACK LEFT OF A COROLLA AND THE BUMPER GOT KNOCKED OFF SUPER EASILY. PREVIOUSLY BACK INTO A LAMP POST AND THE BACK BUMPER FELL OFF EASILY AS WELL. DOESN'T SEEM VERY SAFE TO ME .",
        "vin": "3N1AB7AP1HY"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/03/2018",
        "dateOfIncident": "03/16/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099400,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE BOOSTER. IT HAS BEEN REPLACED 3 TIMES. STILL MAKING SOME NOISE (LIKE AIR) EVERY TIME YOU PRESS THE PEDAL.",
        "vin": "3N1CB7AP0HY"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "06/03/2018",
        "dateOfIncident": "05/25/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099435,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE EXPERIENCED THE SAME ISSUES AS DESCRIBED IN 'SERVICE BRAKES PROBLEM OF THE 2014 NISSAN SENTRA 49', WHICH WAS REPORTEDLY SIMILAR TO INVESTIGATION \"PE14-014\". WHILE DRIVING A RENTAL VEHICLE ON A HIGHWAY (LEFT LANE) AT APPROXIMATELY 65 MPH, ALL OF A SUDDEN IT ACCELERATED AND IT WAS AS IF THE VEHICLE TOOK OVER THE STEERING - I COULD NOT KEEP THE STEERING WHEEL STRAIGHT AND THE CAR STARTED MOVING BETWEEN LANES AND EVENTUALLY I HIT THE GUARDING RAIL BY THE RIGHT LANE AND STOPPED. THERE WAS DAMAGE TO THE VEHICLE AND IT WAS VERY SCARY BUT I DID NOT HAVE A SCRATCH. I WAS ABLE TO START THE CAR AGAIN BUT I HAD TO HAVE IT TOWED AS I WAS TOO SCARED TO DRIVE IT AGAIN. I THANK MY LUCKY STARS THAT THERE WERE NO OTHER VEHICLES IN EITHER LANE DURING THE ACCIDENT OR I WOULD NOT BE WRITING THIS REPORT TODAY. I BELIEVE THE CAR ONLY HAD ABOUT 1500 KM. I CAN`T BELIEVE I SURVIVED.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/24/2018",
        "dateOfIncident": "01/10/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089849,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ACCELERATING, IT NOSE DIVES AT AROUND 30 TO 45 MPH, DEPENDING ON HOW HARD ONE IS ACCELERATING.  I BELIEVE THIS IS CAUSED BY A SHIFT SENSOR BECAUSE IT ACTS LIKE IT LETS GO OF THE GEAR AND AFTER A SECOND OR TWO IT ENGAGES INTO THE NEXT GEAR.  THIS HAPPENS EVERY TIME ONE WANTS TO GO OVER 50 MPH.       ALSO, WHEN COMING A COMPLETE STAND STILL STOP AND THEN STAR TO ACCELERATE, IT HESITATES A BIT AND IT MAKES A BUMPING MOVEMENT, LIKE THE TRANSMISSION DIDN'T DOWNSHIFTED INTO 1ST GEAR AUTOMATICALLY, AND DOES IT SO AFTER ONE PRESSES ON THE ACCELERATOR, THUS CAUSING IT TO DOWNSHIFT TO 1ST FROM 3RD AND I BELIEVE THIS IS WHY I FEEL THE BUMPING MOVEMENT AND SLIGHT HESITATION TO ACCELERATE IMMEDIATELY.  IT DOESN'T DO IT ALL THE TIME AND I HAVE NOT STUDIED IT TO PINPOINT WHY OR WHEN IT WILL DO THIS, BUT I CAN TELL RIGHT BEFORE IT IS GOING TO DO IT BECAUSE IT IS IN 3RD GEAR AND WHEN I RELEASE THE BRAKE, THE CAR WON'T MOVE FORWARD AS QUICKLY AS IT WOULD IF IT WAS IN 1ST GEAR.",
        "vin": "3N1AB7AP2HY"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/18/2018",
        "dateOfIncident": "04/12/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11088877,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THIRD TIME IN THE PAST MONTH, PUSH BUTTON START UPS, ENGINE IS FALLING TO START PROPERLY, ENGINE IS FALLING TO START, SMOOTHLY. VECHILE IS IN THE STATIONARY POSITION.",
        "vin": "3N1CB7AP9HY"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/21/2018",
        "dateOfIncident": "02/17/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11080637,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2017 NISSAN SENTRA. WHILE DRIVING APPROXIMATELY 50 MPH, THE CONTACT REAR ENDED THE PRECEDING VEHICLE. THE AIR BAGS FAILED TO DEPLOY. THE CONTACT SUSTAINED BACK, NECK, AND RIGHT RIB INJURIES THAT REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS DESTROYED AND TOWED TO A TOWING LOT. THE VEHICLE WAS NOT TAKEN TO A DEALER. THE MANUFACTURER WAS CONTACTED AND DID NOT PROVIDE ASSISTANCE. THE APPROXIMATE FAILURE MILEAGE WAS 75,000. *TT",
        "vin": "3N1AB7AP8HY"
    },
    {
        "components": "WHEELS,SEATS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/15/2018",
        "dateOfIncident": "03/12/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079499,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DOES NOT REGISTER CORRECT GAS MILES. IF I JUST FILLED GAS TANK AND IT READS THAT I CAN DRIVE 258 MILES ON THAT AMOUNT OF GAS WHEN IVE ONLY DRIVEN 25 MILES IT WILL TELL ME IVE DRIVEN 100 MILES THEREFORE REGISTERING THAT I ONLY HAVE 123 MIES LEFT IN GAS, CAUSING ME TO FILL TANK MORE THAN I PROBABLY NEED TO AND NOT REALLY KNOWING HOW MY MUCH FURTHER I CAN ACTUALLY DRIVE. IVE TAKEN PHOTOS THAT REFLECT MILES DRIVEN TO GAS USED. ALSO, CAR GAINS SPEEDS  WHEN IM PRESSING BREAK TO SLOW DOWN/STOP. ALSO, WHEN I GENTLY PRESS GAS PEDAL CAR SPEEDS UP FASTER THAN THE ACTUAL GAS IM APPLYING. ALSO, WHEN IN MOTION IT MAKES SUDDEN JERKING STOP WHEN IM PRESSING GAS.  SINCE DAY ONE TIRES SEEMED OLDER THAN CAR. IM NOT SURE IF THEY WERE CHANGED OUT AT DEALERSHIP FOR ROTTED/USED TIRES.CONSTANT CHECK TIRE LIGHT COMES ON. THE DRIVER SEAT SEEMS LIKE ITS BEEN TAMPERED WITH OR CHANGED OUT. WHEN YOU SIT IN THE CAR ITS CROOKED, LEANS TO THE RIGHT.    WITHIN WEEKS AFTER I PURCHASED THE CAR IVE COMPLAINED TO THE DEALERSHIP ABOUT ISSUES CAR HAS, THEY CLAIM ALL IS FINE WITH THE CAR AND DONT SEEM TO FIND ANYTHING. WRONG. ALSO YOUR SITE SAYS AIRBAG RECALL ON THE 2017 SENTRA, DEALERSHIP TELLS ME IT DOESNT PERTAIN TO MY CAR.   I FEEL ITS DEFECTIVE ALL AROUND AND IM NERVOUS DRIVING IT.",
        "vin": "3N1AB7AP6HY"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/14/2018",
        "dateOfIncident": "07/07/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11079115,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2017 NISSAN SENTRA. WHILE DRIVING APPROXIMATELY 35 MPH, THE CONTACT'S VEHICLE CRASHED HEAD ON INTO A SECOND VEHICLE. THE FRONT DRIVER'S SIDE AIR BAG DID NOT IMMEDIATELY DEPLOY. THE DRIVER SUSTAINED MULTIPLE INJURIES, INCLUDING FACIAL AND ORAL INJURIES, INTERNAL ORGAN INJURIES, AND MULTIPLE FRACTURED LUMBAR VERTEBRA. THE VEHICLE WAS DESTROYED AND TOWED. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. A POLICE REPORT WAS FILED. THE MANUFACTURER WAS NOTIFIED. THE LOCAL DEALER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 900. *TT *JS",
        "vin": "3N1AB7AP8HY"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/14/2018",
        "dateOfIncident": "04/24/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079121,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THREE WEEKS AFTER PURCHASED IT, I GOT STRANDED. CAR TURNED OFF ON ME WHILE DRIVING. I HAD IT TOWED TO DEALERSHIP, AND WAS TOLD THEY WERE GOING TO REPLACE ALTERNATOR. THEY DID, AND NOW ITS BEEN LIKE 8 MONTHS AND IT WILL START WHEN IT PLEASES.",
        "vin": "3N1CB7AP8HY"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/10/2018",
        "dateOfIncident": "02/10/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072109,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TRACTION CONTROL ACTIVATES IT JERKS THE STEERING WHEEL TO SIDE. PASSING A TRACTOR TRAILER IT TURNED ON AND NEARLY DROVE ME INTO THE TRUCK SEVERAL TIMES UNTIL I GOT BACK OVER TO THE OTHER LANE THAT WAS MORE CLEAR. MY HUSBAND ALSO HAD AN INCIDENT, DRIVING DOWN OUR LANE IT KICKED ON AND RAN HIM DOWN INTO A DITCH AND HAD TO GET PULLED OUT.",
        "vin": "3N1AB7AP1HY"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/26/2018",
        "dateOfIncident": "05/01/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065270,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 NISSAN SENTRA. THE CONTACT STATED THAT THE VEHICLE EMITTED AN ABNORMAL ODOR WHEN THE AIR CONDITIONER WAS ACTIVATED. AS A RESULT, THE FUMES CAUSED HER TO ALMOST FALL ASLEEP. LYNCH NISSAN OF AUBURN (140 W CREEK PKWY, AUBURN, AL) WAS CONTACTED, BUT THE FAILURE COULD NOT BE REPLICATED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 17,836. *TT  *TR",
        "vin": "3N1AB7AP8HY"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/04/2018",
        "dateOfIncident": "12/27/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11058558,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2017 NISSAN SENTRA. AFTER THE CONTACT DROVE THROUGH A GREEN LIGHT AND SLOWED DOWN WHILE APPROACHING TRAFFIC, THE VEHICLE WAS REAR ENDED BY ANOTHER VEHICLE TRAVELING AT A HIGH RATE OF SPEED. A POLICE REPORT WAS FILED. THE DRIVER SUSTAINED A HEAD INJURY, A FRACTURED NOSE, A JAW INJURY, AND BRUISING. MEDICAL TREATMENT WAS RECEIVED. THE CONTACT'S HEAD STRUCK THE STEERING WHEEL BECAUSE NONE OF THE AIR BAGS DEPLOYED. THE VEHICLE WAS TOWED BY THE INSURANCE COMPANY TO INSPECT THE VEHICLE AT A FACILITY. THE VEHICLE WAS NOT DIAGNOSED BY A DEALER. THE MANUFACTURER WAS NOTIFIED WEEKS AFTER THE CRASH TO DETERMINE THE CAUSE OF THE AIR BAG FAILURE. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "3N1AB7AP8HY"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/11/2017",
        "dateOfIncident": "12/27/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054055,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "NISSAN SENTRA 2017 THE GEAR JAMS WHEN PUTTING  INTO REVERSE, DRIVE, AND BACKING UP FROM DRIVE WAY.  VEHICLE HAS A VERY SLOW TAKE OFF UNTILL YOU PICK UP SPEED AT 40 MPH. BUT NOT ENOUGH SPEED TO PASS UP CARS,TRUCKS  IN ENOUGH TIME AND THAT IS STEPPING ON THE GAS PEDDLE TO THE BOTTOM.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/08/2017",
        "dateOfIncident": "03/08/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11053542,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR IS DANGEROUSLY SLOW TO ACCELERATE WHEN ATTEMPTING TO MERGE ONTO A FREEWAY OR A BUSY STREET.  EVEN WITH FLOORING THE ACCELERATOR, VEHICLE WILL NOT MOVE PAST 40MPH FOR ABOUT 5-8 SECONDS, WHICH IN DRIVING, IS A LARGE AMOUNT OF TIME, ESPECIALLY MERGING ONTO THE FREEWAY.",
        "vin": "3N1AB7AP3HY"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/16/2017",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11046520,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA DEFECTIVE AIRBAG(S).",
        "vin": "3N1CN7AP3HL"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/03/2017",
        "dateOfIncident": "09/12/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11043115,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "A STATIC-LIKE NOISE COME OUT WHENEVER THE STEERING WHEEL IS TURNING RIGHT   TWO MECHANICS FORM NISSAN DEALERS HAVE CHECK THE CAR AND NOTICED THE NOISE BUT BOTH OF THEM COULD NOT DIAGNOSE HOW/WHY THE NOISE CAME OUT",
        "vin": "3N1AB7AP4HY"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/13/2017",
        "dateOfIncident": "07/31/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11014903,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I\"M DOCUMENTING THE SCARY SITUATIONS I'VE EXPERINCED WITH MY 2017 NISSAN   SENTRA SR TURBO. ON 7/31/17 THE VEHICLE STARTED TO  STALL AT AN INTERSECTION, THEN  CAME TO A COMPLETE STOP. THE ENGINE TURNED OFF AND I WAS LEFT WITHOUT ANY ABILITY TO CONTROLL THE CAR. I WAS ABLE TO GET IT STARTED AGAIN TRYING TO MAKE IT BACK HOME IT BARELY MADE IT AT A MAXIMUM SPEED OF 10 MILES/HR. IT HAD TO BE TOWED TO A DEALER FOR SERVICED IT WAS COMPLETELLY UNDRIVABLE. THEY  SAID THE BATTERY NEEDED TO BE REPLACED. I DROVE BACK TO WORK  AFTER THE REPAIRS.  THAT EVENING LEAVING WORK THE SAME THING HAPPENED.  HAD TO CALL AGAIN  TO HAVE THE CAR TOWED TO THE DEALER AGAIN.  THE NEXT DAY I GOT A CALL FROM THE SERVICE PERSON TELLING ME THE ALTERNATOR HAD GONE OUT, AND THAT THE PART WOULD TAKE 2 WEEKS TO COME IN.  MEANWHILE I CONTACTED NISSAN CORP. TO LE THEM KNOW OF THE SITUATION AND THE OTHER VARIOUS TIMES I'D TO BRINGIN THE CAR IN FOR REPAIRS SINCE I PURCHSED IT BRAND NEW IN  1/14/17 . I TOLD THEM THIS CAR IS PUTTING MY LIFE AND OTHERS IN DANGER AND THAT I BELIVED IT WAS A LEMMON. A FEW DAYS LATER I GOT A CALL TELLING ME THAT MY CASE HAD BEEN MOVED UP IN THEIR PRIORITY LIST, HOWEVER THEY DID'T LET ME KNOW THAT THIS SITUATION WAS HAPPENING TO OTHER CUSTORMERS.  LAST WEEK I GOT A CALL TELLING ME THAT NISSAN CORP WAS IN NO POSSITION TO TAKE THE CAR BACK, BUT THAT THEY WERE WILLIN TO OFFER ME EITHER $1000.00 BACK OR AN EXTENDED WARRANTY ON THE CAR OF 100.000 MILES/8 YEARS,  WHICH AT THIS POINT I'M NOT WILLINGTO COMIT TO EITHER ONE.",
        "vin": "3N1CB7AP7HY"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/28/2017",
        "dateOfIncident": "05/05/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001942,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 NISSAN SENTRA. WHILE DRIVING VARIOUS SPEEDS OR WHILE PARKED, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO UNITED NISSAN (3025 E SAHARA AVE, LAS VEGAS, NV 89104 (702) 832-5480), BUT THE FAILURE COULD NOT BE DUPLICATED OR DIAGNOSED. THE DEALER ADVISED THE CONTACT TO CHANGE THE FUEL FROM 87 TO 91 OCTANE. THE CONTACT DID AS THE DEALER SUGGESTED, BUT THE FAILURE PERSISTED. THE VEHICLE WAS TAKEN BACK TO THE DEALER, BUT THE CAUSE OF THE FAILURE WAS STILL UNABLE TO BE DIAGNOSED. THE CONTACT STATED THAT DIAGNOSTIC TESTING WAS COMPLETED AND THE RESULTS WERE SENT TO THE MANUFACTURER. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND AN INVESTIGATION WAS OPENED. THE FAILURE MILEAGE WAS APPROXIMATELY 3,400.",
        "vin": "3N1AB7AP7HY"
    }
]