[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/13/2019",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "Outdoors RV Manufacturing",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11279764,
        "products": [
            {
                "manufacturer": "Outdoors RV Manufacturing",
                "productMake": "OUTDOORS RV",
                "productModel": "GLACIER PEAK",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 OUTDOORS GLACIER PEAK F26RKS TRAILER. THE CONTACT STATED THAT THE LIGHT FIXTURE OVER THE TABLE AND THE WOOD COVERING OVER THE WINDOW FELL DOWN. AS RESULT, THE OBJECTS STRUCK THE CONTACT'S TEENAGE DAUGHTER ON THE HEAD. HER INJURY DID NOT REQUIRE MEDICAL ATTENTION. THE VEHICLE WAS NOT TAKEN TO A DEALER OR INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING OR REPAIRS. THE CONTACT REPAIRED THE TRAILER HIMSELF BY ATTACHING L BRACKETS. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 300.",
        "vin": "51W573122H1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/23/2019",
        "dateOfIncident": "08/29/2019",
        "fire": false,
        "manufacturer": "Outdoors RV Manufacturing",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270424,
        "products": [
            {
                "manufacturer": "Outdoors RV Manufacturing",
                "productMake": "OUTDOORS RV",
                "productModel": "GLACIER PEAK",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FRAME ON 2016 ORV GLACIER PEAK F26RKS 5TH WHEEL BROKE NEAR PIN BOX. UNIT BEGAN SEPARATING FROM TRUCK. MAYBE SHOULD HAVE BEEN INCLUDED IN PREVIOUS RECALL (SIMILAR UNITS/PROBLEM). NHTSA SAFETY RECALL 'FIFTH-WHEEL MAY SEPARATE FROM TOW VEHICLE' RECALLED 2015-2016 F26RLS, 2015-2015 F27BHS, & 2015-2017 F28RKS. *DT    CITED 'PIN BOX THAT MAY FLEX RESULTING IN METAL FATIGUE AND POSSIBLY THE SEPARATION OF THE FIFTH-WHEEL TRAILER FROM THE TOW VEHICLE'. WE HAD 1 FULL FRAME BREAK NEAR THE PIN BOX & 5 OTHER PARTIAL TEARS. THE FIX WAS 'ADDING ADDITIONAL 2 X 6 7 GAUGE TUBE STEEL WHILE REPLACING THE 11 GAUGE TUBE STEEL BETWEEN THE PIN BOX AND CHASSIS STRUCTURAL FRAME; WELDING GUSSET PLATES TO BOTH THE OUTSIDE AND INSIDE FRONT CHASSIS FRAME CHANNEL'. ONGOING FIX 'IN THE CURRENT PRODUCTION PROCESS, ORV HAS MADE THE CHANGE TO NOW INSTALLING 7 GAUGE TUBE STEEL TO STRENGTHEN THE CHASSIS PIN BOX FRAME' ORV ALSO HAS ADDED ADDITIONAL GUSSETS THAT ARE TO BE WELDED AT KEY STRUCTURAL JOINTS ON THE UPPER FIFTH-WHEEL CHASSIS FRAME. ALL FUTURE FIFTH WHEEL BUILDS BEGINNING AUGUST 1, 2016 WILL BE PRODUCED WITH THE CHANGES TO INCREASE THE TUBE STEEL TO 7 GAUGE, AS WELL AS ADDING THE SUPPORT GUSSETS TO THE UPPER CHASSIS FRAME'.     OUR UNIT 06/2016 DOES NOT HAVE 7 GAUGE STEEL OR GUSSETS.     ORV'S SAYS BREAK WAS CAUSED BY WEIGHT OF A GENERATOR DEALER INSTALLED IN FRONT COMPARTMENT. UNIT WAS 12,420 LB (UNDER 12,995 GVWR) & PIN WEIGHT WAS 2,460 LB OR 19.8% (WITHIN 15% TO 25% SPECS).     ORV ALSO SAYS PLACING GENERATOR IN THE FRONT COMPARTMENT IS A STRUCTURAL MODIFICATION. I DISAGREE.   ANOTHER POTENTIAL CAUSE OF BREAKAGE. THERE WAS A BAD WELD AT THE PRIMARY POINT OF BREAKAGE WHICH WAS A JOINT WITH 2 WELDS ' 1 ON THE FRONT AND 1 ON THE BACK. THE WELD ON THE BACK MISSED THE JOINT BY ABOUT 1/8TH OF AN INCH. ORV ACKNOWLEDGES THE EFFECTIVELY MISSING WELD BUT SAYS JOINT SUFFICIENTLY STRONG WITHOUT IT. AT THIS TIME, WE AT ORV FEEL WE HAVE NO FURTHER COURSE TO RESOLVE THIS ISSUE WITH THE CUSTOMER. * DT*JB",
        "vin": "51W573126H1"
    }
]