[
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/23/2022",
        "dateOfIncident": "02/23/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453621,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "5500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS and traction control light comes on intermittently when driving. Cruise control does not work and chime and warning lights come on as lights come on.",
        "vin": "3C7WRNFL0HG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/08/2021",
        "dateOfIncident": "12/10/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387121,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "5500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS DRIVING ON INTERSTATE AT 70MPH AND STARTED VIBRATING VIOLENTLY, A FEW SECONDS LATER THERE WAS A LOUD BANG THAT TURNED INTO MULTIPLE BANGS THAT COULD BE FELT AT THE DRIVERS FEET AND THE TRUCK STALLED. WE HAD IT TOWED BACK TO OUR SHOP AND FOUND THAT THE TRANSFER CASE HAD EXPLODED CAUSING THE FRONT DRIVESHAFT TO COME APART WHICH ENDED UP TEARING THROUGH THE DRIVERS FLOORBOARD, DESTROYED THE ENGINE AND TRANSMISSION WIRING HARNESSES, CRACKED THE TRANSMISSION CASING, AND SEVERED THE BRAKE AND FUEL LINES. LUCKILY THERE WERE NO INJURIES. THE TRUCK HAS 103,180 MILES AND IS REGULARLY MAINTAINED PER CHRYSLER SPECIFICATIONS.",
        "vin": "3C7WRNCL1HG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/28/2020",
        "dateOfIncident": "06/10/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331308,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "5500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT FRONT STEERING TIRE EXPERIENCED UNUSUAL WEAR ON THE OUTSIDE CORD ONLY. LEFT SIDE OK. HAD THE ALIGNMENT CHECKED BY DODGE UP TO SPEC. HAD MY MECHANIC ON A $50,000 RACK CHECK THE ALIGNMENT AT MY EXPENSE.  RIGHT FRONT OK LEFT FRONT .7DEGREES OUT. ONLY ADJUSTMENT IS TO REPLACE THE NON ADJUSTABLE BALL JOINTS WITH OFFSET ADJUSTABLE BALL JOINTS AS WELL AS THE TIRES. FCA RESPONSE WAS YOU KNOW WE ONLY HAVE A 12000 MILE 12 MONTH WARRANTY ON THE ALIGNMENT. TRUCK IS ALMOST TWO YEARS OLD WITH 12900 MILES. FIRST THE DODGE DEALERSHIP WAS UNABLE TO DO THE ALIGNMENT AND THE TECH WAS UPFRONT ON NOT BEING COMFORTABLE WORKING ON THIS LARGE TRUCK. SO I AM LEFT TO MANAGE THIS CRITICAL SAFETY ISSUE ON MY OWN. FCA REP ADMITTED MOST DODGE DEALERSHIPS ARE UNABLE TO REPAIR THE 5500 SO THEY HAVE TO OUTSOURCE THE JOB. THE OUTSIDE OF THE TIRE HAS LITERALLY WORN OFF THE TREAD PATTERN. I BELIEVE THIS PRESENTS A POTENTIAL BLOWOUT HAZARD AND AM QUITE CONCERNED. ACCORDINGLY I HAVE NOT DRIVEN THE VEHICLE EVEN THOUGH IT IS MY ONLY WELDING RIG I HAVE FOR MY SIDE BUSINESS. THIS IS A SAFETY CONCERN AS WELL AS A SUBSTANTIAL LOSS OF REVENUE FOR ME. I HAVE SPOKEN WITH THE DEALERSHIP THAT I PURCHASED THE VEHICLE FROM IN COLUMBIANA OHIO. THE COMMERCIAL MANAGER ADMITTED THAT THIS IS NOT AN UNCOMMON PROBLEM AND REQUIRES REPLACING THE BALL JOINTS. I AM AWAITING A RESPONSE FROM FCA IN REGARDS FIXING THE PROBLEM. I HAVE MADE ARRANGEMENTS ON MY OWN TO HAVE THE VEHICLE REPAIRED AND THE TIRES REPLACED. IN VIEW OF THE FACT THAT MY PURCHASING DEALERSHIP ACKNOWLEDGES THIS AS A PROBLEM, YET CHRYSLER MAKES NO EFFORT TO FIX IT IS QUITE DISCONCERTING.  A BLOWOUT ON A VEHICLE RATED TO TOW 30,000 LBS WOULD BE DISASTROUS. THANK YOU FOR YOUR TIME.",
        "vin": "3C7WRNFL7HG"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "03/05/2020",
        "dateOfIncident": "05/01/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316387,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "5500",
                "productYear": "2017",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "HSR",
                "productYear": "9999",
                "size": "11R24.5",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2017 RAM 5500 EQUIPPED WITH CONTINENTAL TIRES, TIRE LINE: HDR, TIRE SIZE: 225/70R/19.5, DOT NUMBER WAS A39YLA4V0217. THE CONTACT STATED BOTH FRONT TIRES WERE ROTATED AND REPLACED 6 TIMES WITHIN 48,000 MILES. THE CONTACT STATED THE OUTSIDE EDGE OF THE TIRE WERE WORN-OUT. THE CONTACT STATED FRONT SUSPENSION REPAIRS WERE NEEDED BUT HAD NOT BEEN PERFORMED. THE VEHICLE WAS TAKEN TO LANDERS MCLARTY DODGE CHRYSLER JEEP RAM LOCATED AT (6533 UNIVERSITY DR NW, HUNTSVILLE, AL 35806) AND WERE UNABLE TO DUPLICATE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS INFORMED OF FAILURE AND A COMPLAINT WAS FILED. THE FAILURE MILEAGE WAS 8,000.",
        "vin": "3C7WRNFL0HG"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/23/2020",
        "dateOfIncident": "02/13/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310844,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "5500",
                "productYear": "2017",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "WRANGLER SR-A",
                "productYear": "9999",
                "size": "LT275/60R20",
                "type": "Tire"
            }
        ],
        "summary": "LEFT HAND FRONT TIRE BLEW OUT TRAVELING ON A STRAIGHT HWY NO WARNING THERE WAS A PROBLEM WITH THE TIRE. WAS DRIVING AT THE LEGAL SPEED LIMIT OF 75 MPH. I WAS LUCKY THERE WERE NO OTHER VEHICLES NEXT TO ME OR TRAVELING IN MY DIRECTION AT THE TIME. IT DAMAGED THE FENDER AND INNER LINER, THE TIRE WAS SENT TO GOODYEAR AND THEY SAID IT WAS MY FAULT THE TIRE BLEW OUT. THAT I HAD HIT SOMETHING AND CAUSED DAMAGE TO THE BELT. THAT IS NOT TRUE. I DID NOT HIT ANYTHING AND THERE WAS NOTHING ON THE ROAD TO CAUSE ANY DAMAGE TO THE TIRE.",
        "vin": "3C6RR6LT7HG"
    },
    {
        "components": "POWER TRAIN,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/11/2019",
        "dateOfIncident": "12/09/2019",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288429,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "5500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON I-40 EASTBOUND MILE MARKER 121 VEHICLE STARTS TO SHAKE AND VIBRATE VIOLENTLY. I HEAR AN EXPLOSION UNDER THE TRUCK WHICH CAUSE A LOSS OF POWER AND HAD TO FIGHT WITH TRUCK TO GET IT OFF THE ROAD ALL WHY AT A SPEED OF 65 MPH. TRANSFER CASE EXPLODED CUTTING WIRE HARNESS IN HALF AND RUPTURING THE FUEL LINE. TRUCK WAS SMOKING BAD AS OIL AND FUEL WAS LEAKING EVERYWHERE. TRUCK IS INOP AT THIS POINT. PLEASE HELP WITH THIS MATTER IN AN EFFORT TO HELP OTHERS FROM THIS EXPERIENCE.  I ALMOST WRECKED TRYING TO GET THE VEHICLE OFF THE ROAD AFTER THE TRANSFER CASE EXPLODED",
        "vin": "3C7WRNFL9HG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/26/2019",
        "dateOfIncident": "11/21/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282469,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "5500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING A VIBRATION WAS NOTICED AT SPEEDS ABOVE 45 MPH. DURING TRANSIT THE TRANSFER CASE EXPLODED CAUSING A MAJOR FAILURE OF MULTIPLE SYSTEMS. THIS FAILURE OCCURRED ON A STATE HIGHWAY LEAVING WACO TX AT 445 A.M. POLICE WERE DISPATCHED TO BLOCK TRAFFIC FROM FURTHER ACCIDENTS UNTIL A TOW VEHICLE WAS DISPATCHED TO THE SCENE. UPON FURTHER INVESTIGATION IT WAS VERY NOTICEABLE THAT THE TRANSFER SYSTEM IN THE POWERTRAIN SYSTEM HAD EXPLODED. THIS FAILURE HAS CAUSED MULTIPLE COLLATERAL DAMAGES TO SYSTEMS IN THE VICINITY OF THE FAILURE.",
        "vin": "3C7WRNBL5HG"
    },
    {
        "components": "STEERING,POWER TRAIN,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/15/2019",
        "dateOfIncident": "10/15/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268481,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "5500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 RAM 5500. WHILE DRIVING APPROXIMATELY 50 MPH, THE VEHICLE SHIFTED OUT OF GEAR AND WENT INTO NEUTRAL. WITHOUT WARNING. THE FAILURE RECURRED SEVERAL TIMES. THE VEHICLE WAS TAKEN TO SOUTHFORK CHRYSLER DODGE JEEP RAM (844-350-9615, LOCATED AT 17725 S FREEWAY, MANVEL, TX 77578) WHERE IT WAS DIAGNOSED THAT THE SHIFTER CABLE NEEDED TO BE REPLACED. THE CONTACT ALSO STATED THAT THE FUSE IN THE FUEL PUMP OVERHEATED WITHOUT WARNING. THE FAILURE CAUSED THE FUEL PUMP TO SEIZE AND THE VEHICLE TO SHUT OFF. THE VEHICLE WAS TAKEN TO THE SAME DEALER AND THE CONTACT WAS INFORMED THAT THE FAILURE WAS NOT COVERED BY THE WARRANTY. THE CONTACT ALSO STATED THAT THE IDLER PULLEY BELT FRACTURED, WHICH CAUSED THE STEERING TO LOSE POWER AND THE AIR CONDITIONING TO LOSE ITS COOLING CAPABILITY. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND REFERRED THE CONTACT TO NHTSA. THE FAILURES WERE NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 37,000.",
        "vin": "3C7WRNBJ5HG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/18/2019",
        "dateOfIncident": "05/08/2019",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256464,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "5500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 RAM 5500. WHILE THE CONTACT'S HUSBAND WAS DRIVING 50-55 MPH, SMOKE EMERGED FROM UNDER THE HOOD AND THE ENGINE CAUGHT FIRE. THE DRIVER EXTINGUISHED THE FIRE. THE SERVICE ENGINE AND OIL WARNING INDICATORS WERE ILLUMINATED. A POLICE REPORT WAS FILED AND THERE WERE NO INJURIES. THE VEHICLE WAS TOWED TO AN INDEPENDENT LOT AND THEN TOWED TO MAC HAIK CHRYSLER DODGE JEEP RAM FLOWOOD (4000 LAKELAND DR, FLOWOOD, MS 39232, (855) 223-8958) WHERE IT WAS DIAGNOSED THAT THE ENGINE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND PROVIDED CASE NUMBER: 35490335. THE MANUFACTURER DID NOT ASSIST. THE WARRANTY AND INSURANCE COMPANIES STATED THAT THE CONTACT WOULD BE RESPONSIBLE FOR THE REPAIR COSTS. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "3C7WRNEL2HG"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/18/2019",
        "dateOfIncident": "11/14/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11197187,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "5500",
                "productYear": "2017",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Nexen Tire Corporation",
                "productMake": "NEXEN",
                "productModel": "ROADIAN HT",
                "productYear": "9999",
                "size": "P245/65R17",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 RAM 5500 EQUIPPED WITH NEXEN RODIAN TIRES, SIZE: LT235/80R17 (NA). TWO MONTHS AGO, THE CONTACT STATED THAT THE VEHICLE EXHIBITED THE DEATH WOBBLE. THE VEHICLE WAS TAKEN TO AN UNKNOWN DEALER, BUT IT WAS NOT DIAGNOSED. LATER, THE CONTACT TOOK THE VEHICLE TO TATE BRANCH ARTESI CHRYSLER DODGE JEEP RAM (919 S 1ST ST, ARTESIA, NM 88210) FOR A MINOR REPAIR. THE DEALER CALLED THE CONTACT AND STATED THAT THE VEHICLE HAD TWO SPLIT TIRES. THE MECHANIC DID NOT EXPLAIN WHICH TIRES WERE SPLIT. THE CONTACT PLANNED TO HAVE THE VEHICLE REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VIN AND DOT NUMBER WERE UNKNOWN. THE TIRE AND FAILURE MILEAGE WAS 28,000.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/27/2018",
        "dateOfIncident": "12/12/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104270,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "5500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE ON THE HIGHWAY THE TRANSFER CASE EXPLODED, CHRYSLER DETERMINED THAT THE REPAIRS WOULD NOT BE COVERED UNDER WARRANTY. HOWEVER, WE PROVIDED PROOF OF SERVICE OVER THE TIME PERIOD THAT THE VEHICLE WAS IN SERVICE WHICH WAS ONLY 6 MONTHS. THEY EXPLAINED OUR PARTS WERE NOT PROPERLY GREASED AND MAINTAINED. WE DO KNOW A BUSINESS ASSOCIATE THAT HAD THE EXACT SAME THING HAPPEN TO HIS VEHICLE. I DID RESEARCH AND IN THE PAST THIS HAS BEEN A SIMILAR PROBLEM AND RECALLS FOR THE SAME EXACT ISSUE...PLEASE HELP!!",
        "vin": "3C7WRNFL5HG"
    }
]