[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/17/2022",
        "dateOfIncident": "02/17/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452492,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Failed brake master cylinder, this is still a rather new vehicle and the mechanics said this is unlikely in a new low mileage vehicle. I did research and this has only happened a few times, seems like a safety recall should be put in place.",
        "vin": "JTEBU5JR8H5"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/02/2021",
        "dateOfIncident": "09/27/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439109,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving at full speed on the freeway, another vehicle stopped suddenly in front of me. My brake pedal was soft and went down almost to the floor. Rapid pulsing of brakes, as would be expected with the ABS (antilock brake system), did not occur.  I pulled around to the shoulder and barely managed to stop in time to avoid a collision, which was quite a frightening experience. I have had a few similar incidents since then, and have noticed that the brake pedal is a bit soft until pumping the pedal a few times.   A local dealer diagnosed the problem and said the \"ABS actuator assembly\" has failed and needs to be replaced. The part itself costs >$2900, making this with labor a ~$3800 repair. (please see attached)  1. This part is not subject to normal wear and tear. 2. Although beyond the 3/36 warranty, this vehicle is relatively new (2019) with only ~55K miles on it. This part should not fail after so relatively few miles.  3. Failure of this ABS part causes the entire brake system to fail, since the ABS is tied in to the brake system. 4. Failure of this part represents a severe hazard, risk, and safety concern, with significant potential to cause injury or death of driver/passengers/pedestrians, or persons in other vehicles. 5. The cost to repair this is not trivial and represents a major expense.    I feel that in light of the above, Toyota should accept responsibility for failure of this part.  Thank you,   [XXX] San Diego  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "JTEBU5JR5H5"
    },
    {
        "components": "SUSPENSION,VEHICLE SPEED CONTROL,WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/28/2020",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341919,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK SHIMMY'S WHENEVER I DRIVE OVER 50MPH. FRONT TIRES ARE DAMAGED FROM CUPPING. MAINTENANCE HAS BEEN DONE AS WELL AS TIRE ALIGNMENT AND ROTATION. DEALERSHIP KEEPS SAYING NOTHING IS WRONG WITH IT.",
        "vin": "JTEBU5JR3H5"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/21/2020",
        "dateOfIncident": "06/20/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11329874,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "A DEER RAN OUT IN FRONT OF ME, DRIVING 50 MPH.  PASSENGER SIDE HIT, ALL 8 AIRBAGS DEPLOYED.  PASSENGER SIDE AIRBAG UNDER STEERING WHEEL, CUT UP MY LEGS HORRIBLY, VERY SWOLLEN, REFUSED HOSPITAL DUE TO COVID 19 FEAR.  THE AIRBAGS CUT UP MY LEFT ARM AND MY DAUGHTER'S RIGHT ARM(SHE WAS PASSENGER).  VERY HAPPY THAT WE WERE SAFE, BUT THE SERIOUS CUTS ON MY BODY SEEMED QUITE SEVERE FOR THE HIT WHICH WAS ON PASSENGER SIDE AND BY A DEER.",
        "vin": "JTEBU5JR3H5"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/25/2020",
        "dateOfIncident": "08/08/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319289,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT A YEAR AFTER OWNING MY MAGNETIC GRAY 4RUNNER I STARTED NOTICING FLAWS ON MY HOOD AND ROOF OF THE VEHICLE ALMOST LIKE THE CLEAR COAT WAS BUBBLING UP.  I EXPRESSED MY CONCERN TO THE DEALERSHIP DURING A ROUTINE VISIT AND THE SUPERVISOR SAID IT WILL BE NOTED IN THE VEHICLES RECORD. I ROUTINELY WASH MY VEHICLE AND DO NOT LET ANYTHING SIT ON MY VEHICLE SUCH AS SAP OR BIRD DROPPINGS AND THE VEHICLE IS IN A GARAGE.  IT IS NOW A YEAR LATER AND I AM NOTICING MORE SPOTS.    KNOWING NOW THAT TOYOTA HAS HAD ISSUES BEFORE WITH DEFECTIVE CLEAR COAT ON THEIR VEHICLES I AM WONDERING IF THEIR IS ANYTHING I CAN DO OTHER THAN TO PAY OUT OF POCKET TO HAVE MY VEHICLE REPAINTED.",
        "vin": "JTEBU5JR2H5"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/03/2020",
        "dateOfIncident": "02/25/2020",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315748,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 4 RUNNER DOWN THE THREE LANE CITY ROAD DOING ABOUT 40-45 MPS WHEN MY NAVIGATION SCREEN SHUT OFF AND TRIED TO RECONNECT TO MY PHONE. THIS HAPPENED TWICE IN  A MATTER OF 5-7 MINUTES. SINCE I WAS DRIVING, I WAS NOT ABLE TO DO ANYTHING WITH EITHER MY PHONE OR MY NAVIGATION SYSTEM. IT ACTED AS IT IF WAS JUST TRYING TO RECONNECT TO MY PHONE WHEN IT WAS ACTUALLY TURNING OFF  AND REBOOTING AS IF I WAS JUST STARTING THE CAR .THE THIRD TIME IT HAPPENED, I WAS MAKING A LEFT HAND TURN ON TO A VERY BUSY FOUR LANE ROAD WHEN IN MID TURN, IT FELT LIKE I HAD LOST POWER STEERING. I CHECKED THE DASHBOARD FOR ANY WARNING LIGHTS AND THAT IS WHEN I NOTICED THERE WAS NO POWER OF ANY SORTS TO MY 4 RUNNER NOR WAS THERE ANY WARNING LIGHTS. I WAS NOT EVEN ABLE TO PUT MY FLASHERS ON TO WARN ONCOMING TRAFFIC. I COASTED TO THE SHOULDER WHEN I NOTICED A STRONG SMELL COMING FROM THE FRONT OF THE CAR. IT SMELT LIKE BURNT PLASTIC.  I GOT OUT OF MY CAR WHEN TRAFFIC PERMITTED AND WENT TO CALL A TOW TRUCK WHEN MY 4 RUNNER STARTED SMOKING VERY HEAVILY FROM UNDER THE HOOD WITH IN A TWO TO THREE MINUTE TIME FRAME. I IMMEDIATELY CALLED 911 AND THEY DISPATCHED A FIRE TRUCK AND POLICE TO THE SCENE WHERE , UPON ARRIVAL, THE FRONT OF MY 4 RUNNER WAS COMPLETELY COVERED IN FLAMES WITHIN A MATTER OF 5-7 MINUTES SINCE THE VEHICLE LOST POWER . THE FIRE DEPARTMENT BLOCKED OFF THE ROAD AND PUT OUT THE VEHICLE FIRE. THE FIREMAN SAID THAT HE BELIEVED FIRE STARTED IN THE ENGINE BLOCK DUE WHERE IT APPEARED THE FIRE STARTED AND HOW IT BURNED.",
        "vin": "JTEBU5JRXH5"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/12/2020",
        "dateOfIncident": "01/30/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308844,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WEIR SOUND ON PASSENGER SIDE (UNDER THE HOOD )WHEN THE VEHICLE JUST MOVING . ONLY ONE TIME BUT IT HAPPEN AGAIN AFTER VEHICLE PARKED AND TURN OFF ENGINE",
        "vin": "JTEZU5JR5H5"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/06/2019",
        "dateOfIncident": "11/20/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287472,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AC BLOWER MOTOR WENT OUT",
        "vin": "JTEBU5JRXH5"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/11/2019",
        "dateOfIncident": "06/05/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267825,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "PEELING STEERING WHEEL ON IT'S OWN.  NO OUTSIDE INFLUENCE.  NO RINGS, SUNSCREEN, LOTION OR CLEANERS USED.  CAUSES LOSS OF GRIP OF WHEEL AND CONTINUED DETERIORATION ALTERS STEEERING WHEEL.  THERE IS A CHANGE.ORG PETITION.",
        "vin": "JTEBU5JR1H5"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/23/2019",
        "dateOfIncident": "07/22/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234158,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 7/22/2019, OUR 4RUNNER REAR-ENDED ANOTHER VEHICLE ON THE FREEWAY. SPEED AT THE TIME OF IMPACT WAS APPROXIMATELY 55MPG AFTER HARD BRAKING FROM APPROXIMATELY 65MPH. NONE OF THE 4RUNNER'S AIRBAGS DEPLOYED. THE ENTIRE FRONT END IS DESTROYED. SEE PHOTOS.",
        "vin": "JTEBU5JR0H5"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/10/2018",
        "dateOfIncident": "10/10/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139574,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "IN MOTION, FROM STREET TURNING INTO STORE PARKING LOT, BRAKES FADED COMPLETELY TO THE FLOOR. LIFTED OFF AND APPLIED PEDAL TO STOP. NO LEAKS, PLENTY OF FLUID. I WILL CHECK WITH ANOTHER DEALER. THERE ARE QUITE A FEW CASES OF THIS ON THE T4R FORUMS. DEALERS CAN NOT DUPLICATE. THIS IS VERY DANGEROUS TO NOT HAVE AN ANSWER FOR. OPINIONS ARE ELECTRICAL ANTILOCK ISSUES.?  (THERE IS NO AIR IN LINES, NO LEAKS AND NO CODES)",
        "vin": "JTEBU5JR7H5"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/27/2018",
        "dateOfIncident": "03/06/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122487,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN YOU APPLY THE BRAKES WITH FULL FORCE WHILE DRIVING; THE BRAKES LOCK UP FOR A SHORT PERIOD OF TIME ON ONE SIDE OF THE VEHICLE, CAUSING THE VEHICLE TO SWERVE UNCONTROLLABLY. THIS IS EXTREMELY DANGEROUS VEHICLE WHEN THE BRAKES ARE APPLIED WITH HARD FORCE AT SPEEDS AT AROUND 35 MPH OR HIGHER. LUCKILY I AM A VERY EXPERIENCED DRIVER AND CAR HANDLER AND WAS ABLE TO REACT QUICK ENOUGH TO CONTROL THE VEHICLE ONE TIME WHEN I HAD TO APPLY THE BRAKES HARD AT HIGHWAY SPEEDS WHEN A CAR SWERVED IN FRONT OF ME SUDDENLY. I HAVE SINCE DONE MANY TESTS ON THIS VEHICLE MYSELF AND CONCLUDED THAT ONE WHEEL ON THE LEFT SIDE OF THE VEHICLE IS LOCKING UP WHICH IS CAUSING THE VEHICLE TO QUICKLY AND VIOLENTLY SWERVE. THE TEST I DID WAS TO APPLY THE BRAKES VERY HARD AND SUDDENLY WHILE DRIVING ON A FLAT GRASSY FIELD AT 35 MPH. THE GRASS IN THE FIELD HAD BEEN CUT A FEW DAYS EARLIER AND WAS AT A HEIGHT OF ABOUT 4 INCHES AND DRY, THE AIR TEMPERATURE WAS 82 DEGREES F. AFTER APPLYING THE BRAKES HARD, I WOULD STOP THE VEHICLE AND GO BACK AND LOOK AT THE PATH OF THE VEHICLE WHERE THE BRAKES WERE APPLIED. THERE WAS CLEARLY A PATCH OF GROUND THE SAME WIDTH AS THE TIRE, EXPOSED DOWN TO ABOUT ONE INCH BELOW SURFACE WITH NO GRASS, WHERE THE ONE WHEEL THAT LOCKED UP, SKIDDED AND RIPPED THE GRASS AND DIRT UP. I HAVE DONE THIS TEST MULTIPLE TIMES AND BASED ON MY RESULTS HAVE CONCLUDED THAT ONE WHEEL ON THE LEFT SIDE IS LOCKING UP. I DID NOT THAT IF I REPEAT THE TEST SEVERAL TIMES BACK TO BACK, THE PROBLEM SEEMS TO CORRECT ITSELF AT TIMES. BUT ALWAYS ON THE INITIAL TEST, THE LOCK UP OCCURS. I HAVE HAD IT TO TWO DIFFERENT TOYOTA DEALERS AND THEY BOTH TOLD ME THAT THE BRAKES ARE WORKING AS DESIGNED. IF YES, THIS IS A VERY DANGEROUS DESIGN AND I DON'T FEEL SAFE AT ALL, AND I ALSO NOTICED THAT THERE ARE SEVERAL OTHER COMPLAINTS ABOUT THE BRAKES FOR THIS 4RUNNER MODEL YEARS.",
        "vin": "JTEBU5JR8H5"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "06/14/2018",
        "dateOfIncident": "04/30/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101898,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 TOYOTA 4RUNNER. WHILE DRIVING AT UNKNOWN SPEEDS, THE DRIVER'S SEAT MOVED AND MADE AN ABNORMALLY LOUD NOISE. THE VEHICLE WAS TAKEN TO AVONDALE TOYOTA (10005 WEST PAPAGO FWY, AVONDALE, AZ 85323, (844) 610-894) WHERE IT WAS DIAGNOSED THAT THE DRIVER'S SEAT FRAME//SUPPORT NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. THE VEHICLE WAS THEN TAKEN TO ANDERSON TOYOTA (6510 SHOWPLACE AVE, LAKE HAVASU CITY, AZ 86404, (928) 764-2886), BUT WAS NOT DIAGNOSED OR REPAIRED. THE DEALER ADVISED THE CONTACT TO ADJUST THE SEAT. THE MANUFACTURER WAS NOTIFIED AND PROVIDED CASE NUMBER: 1806083099, BUT NO FURTHER ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS 5,000. *TT  UPDATED 9/25/18",
        "vin": "JTEBU5JR8H5"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/27/2018",
        "dateOfIncident": "04/21/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11090445,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK MY VEHICLE IN FOR A RECALL SOMETHING TO ADD SUPPORT TO MAYBE GRILL OF THE VEHICLE ON 21ST OF APRIL.  SAT IN WAITING ROOM FOR 2 HOURS, SERVICE GUY, BRANDON(VERY NICE GUY AND THIS IS NOT HIS FAULT), CAME OUT AND TOLD ME THEY WOULD NEED TO PRICE ME A NEW GRILL, BECAUSE ONE I HAVE DON'T SUPPORT THE RECALL.  I REFUSE TO PAY FOR SOMETHING THAT I SHOULD NOT HAVE TO, WHEN THERE IS A RECALL. WHEN YOU GET A RECALL IT'S TO FIX THE PROBLEM, THEREFORE IF MY CAR NEEDS A NEW GRILL TO SUPPORT WHAT THEY NEED TO DO, THEN DEALERSHIP SHOULD PAY FOR WHATEVER IT IS TO FIX THE RECALL.  I PURCHASED THIS VEHICLE AS IS FROM THE DEALERSHIP.",
        "vin": "JTEZU5JR1H5"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/25/2018",
        "dateOfIncident": "04/24/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11090079,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA ENTUNE (IPHONE APP) WILL NOT PAIR WITH YOUR PHONE OR DISCONNECTS DURING USE BECAUSE APP DOES NOT MAINTAIN THE USER'S LOGIN CREDENTIALS. THE BEHAVIOR OF THE CONNECTIVITY BETWEEN THE VEHICLE'S ENTERTAINMENT SYSTEM AND PHONE IS DIFFICULT TO PREDICT, SOMETIMES THE SYSTEM WON'T WORK WITHOUT THE PHONE'S APP RUNNING AND OTHER TIMES IT WILL - SOMETIMES IT WON'T WORK EVEN WHEN THE APP IS RUNNING. OFTEN, WHEN THE ENTERTAINMENT SYSTEM FAILS TO CONNECT IT STOPS FUNCTIONING AND POPS UP MESSAGES THAT REQUIRE USER INPUT WHILE DRIVING. MANY TIMES THE PHONE APPEARS TO BE CONNECTED UNTIL AFTER YOU START DRIVING AND THEN THE SYSTEM ASKS FOR INPUT (WHICH YOU MUST DO ON YOUR PHONE, NOT THE ENTERTAINMENT SYSTEM'S SCREEN). THE WHOLE POINT OF CONNECTING YOUR PHONE WITH THE VEHICLE'S ENTERTAINMENT SYSTEM IS TO ELIMINATE THE NEED TO USE YOUR PHONE WHILE DRIVING, SO A SEAMLESS CONNECTION WITHOUT UNNECESSARY USER INPUT IS IMPERATIVE TO SAFE OPERATION OF THE SYSTEM.     THIS IS ADMITTEDLY A RELATIVELY MINOR SAFETY CONCERN, HOWEVER A FIX WOULD BE REMARKABLY EASY TO ACHIEVE AND WOULD GO A LONG WAY TOWARDS REDUCING DRIVER DISTRACTION.     TOYOTA VEHICLE OWNERS HAVE BEEN ASKING FOR THIS FUNCTIONALITY FOR MANY YEARS (SEE APPLE APP STORE REVIEWS FOR TOYOTA ENTUNE), BUT, DESPITE MULTIPLE REQUESTS, TOYOTA MOTOR COMPANY HAS REPEATEDLY IGNORED THEIR CUSTOMERS.    THIS PROBLEM OCCURS ACROSS MULTIPLE VEHICLES IN THE TOYOTA LINEUP, BUT I AM ONLY FAMILIAR WITH THE IPHONE APP, SO I'M NOT SURE IF IT ALSO EXISTS WITH OTHER PHONES.    THE ISSUE HAS OCCURRED CONSISTENTLY SINCE WE PURCHASED THE VEHICLE A YEAR AGO AND PERSISTS DESPITE KEEPING BOTH PHONE SOFTWARE AND VEHICLE FIRMWARE UPDATED.",
        "vin": "JTEBU5JR2H5"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/20/2018",
        "dateOfIncident": "04/20/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089079,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE BOUGHT NEW 8/2017.  HAS APPROX. 7,000MLES.  THIS IS THE 3RD OR 4TH SIMILAR INCIDENT BUT THE MOST SEVERE.  DRIVING ON I-95, APPROX. 60 MPR, TODAY, WHEN I  APPLIED THE BRAKES THEY SEEMED TO LOCK AND ALTHOUGH MY FIRST THOUGHT WAS THAT THE CAR ALSO ACCELERATED IT MAY HAVE BEEN ONLY MY EXPECTATION OF SLOWING DOWN AND THAT WASN'T HAPPENING.  THE BRAKE PEDAL ONLY SEEMED TO COMPRESS ABOUT 2-3\".  LUCKILY I WAS ABLE TO PULL OVER AND THE CAR DID STOP.  I CONTINUED ON WITHOUT INCIDENT BUT LIKE I SAID THIS WAS THE 3RD OR 4TH TIME AND THE MOST SEVERE.",
        "vin": "JTEBU5JR5H5"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/28/2018",
        "dateOfIncident": "03/28/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081935,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CANADA HAS RECALLED THESE VEHICLES (DOT CANADA  SAFETY RECALL 2017363) DUE TO FIRE HAZARDS FROM ENGINE BLOCK HEATERS. AS MANY NORTHERN LATITUDE VEHCILES  IN THE US HAVE THESE SAME BLOCK HEATERS (AND HAZARDS) IT IS NECESSARY FOR A FORMAL RECALL TO REPLACE THEM, AS WAS DONE IN CANADA.TRIED TO UPLOAD A .DOC DOCUMENT WITH ADDITIONAL INFORMATION, BUT YOUR SYSTEM WOULD NOT ALLOW. SADLY YOU DO NOT ALLOW .DOC OR .DOCX DOCUMENTS AS UPLOADS, YOUR LOSS ....",
        "vin": "JTEBU5JR0H5"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/21/2018",
        "dateOfIncident": "03/21/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080667,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "APPROACHING AN INTERSECTION ON CITY STREETS I EXPERIENCED TEMPORARY BRAKE FAILURE. WHEN APPLYING THE BRAKES TO SLOW DOWN THE PEDAL WENT ALL THE WAY TO THE FLOOR AND DID NOT SLOW DOWN THE VEHICLE. AFTER ROLLING THROUGH THE INTERSECTION WITHOUT INCIDENT I PUMPED THE BRAKE PEDAL A FEW TIMES WHICH RETURNED THE BRAKES TO AN OPERATIONAL STATUS. THIS HAS HAPPENED 3 TIMES IN 2 DAYS. OTHER TOYOTA 4RUNNER OWNERS HAVE ALSO REPORTED THE SAME OR SIMILAR ISSUES IN THE LAST 12MONTHS.",
        "vin": "JTEBU5JRXH5"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/15/2018",
        "dateOfIncident": "03/08/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079706,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THURSDAY MARCH 8, 2018, MY PASSENGER-SIDE FRONT WINDOW EXPLODED AS I WAS DRIVING DOWN THE HIGHWAY AT THE POSTED SPEED OF APPROXIMATELY 70MPH.  NOTHING HIT THE WINDOW, AND I HADN'T HIT A POTHOLE OR ANY BUMP IN THE ROAD, THERE ALSO WAS NO EXTREME CHANGE IN TEMPERATURES ' IT JUST EXPLODED INTO MANY PIECES INCLUDING SMALL SHARDS OF GLASS.  THE GLASS WENT ALL OVER THE INSIDE OF MY CAR INCLUDING BOTH FRONT AND BACK SEATS AND FLOORBOARDS.  THE ENTIRE WINDOW EXPLODED SO THAT THERE WAS NO WINDOW LEFT IN THE OPENING.  I BELIEVE IT WAS FAULTY GLASS.  I UNDERSTAND THAT THERE HAVE BEEN SUNROOFS EXPLODING, AND I BELIEVE THAT THE GLASS ISSUE IS NOT JUST LIMITED TO THE SUNROOF.  I DID SAVE THE RECEIPT FROM HAVING THE GLASS REPLACED, BUT I DON'T CURRENTLY HAVE THE ABILITY TO SCAN AND ATTACH IT.",
        "vin": "JTEBU5JR6H5"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/01/2018",
        "dateOfIncident": "12/30/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057849,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE DRIVING ON THE HIGHWAY FROM DALLAS TO HOUSTON AND ALL OF THE SUDDEN, WE HEARD AND EXPLOSION. AT FIRST WE THOUGHT THAT SOMETHING HIT OUR TRUCK, BUT WHEN WE OPENED THE SUNROOF COVER IT WAS COMPLETELY SHATTERED. SOME PIECES HIT THE CAR BEHIND US, BUT NO ONE WAS HURT. LUCKILY THE INTERIOR COVER WAS CLOSED.",
        "vin": "JTEZU5JR4H5"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/14/2017",
        "dateOfIncident": "12/13/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054845,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I PULLED UP TO A STOP LIGHT AND APPLIED THE BRAKES. I STOPPED BUT WHILE I WAS SITTING WITH THE BRAKES APPLIED, MY 4RUNNER STARTED ROLLING FORWARD. I HAD TO PUSH THE BRAKE PEDDLE TO THE FLOOR TO A POINT I COULD BARELY REACH TO GET IT TO STOP AGAIN. I TOOK IT TO THE DEALERSHIP AND THEY AGREED THE BRAKES WERE NOT ACTING RIGHT. THEY COULD SEE ON THE COMPUTER THAT SOMETHING WAS WRONG AS WELL. THEY SAID I WOULD NEED A NEW MASTER CYLINDER ON THE 4RUNNER. THE VEHICLE IS ONLY 2 1/2 MONTHS OLD WITH 2500 MILES. WHEN I PICKED UP THE VEHICLE, THEY SAID THEY TALKED WITH TOYOTA AND IT WAS ONLY THE 2ND CASE OF THIS HAPPENING IN THE US. THE MORNING IT HAPPENED IT WAS AROUND 30 TO 35 F OUTSIDE. WHEN THE DEALERSHIP TESTED IT THEY SAID THEY APPLIED THE BRAKES TO STOP AND IT SLOWLY STARTED MOVING FORWARD AFTER A FEW SECONDS LIKE HAD HAPPENED AT THE STOP LIGHT.  THEY REPLACED THE MASTER CYLINDER AND WHEN I PICKED IT UP EVERYTHING SEEMED TO BE WORKING OK.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/30/2017",
        "dateOfIncident": "11/18/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11051617,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STALLED ON THE FREE WAY WHILE DRIVING .  THE DASH BOARD  HAD A WARNING TO CHECK ENGINE AT DEALER.  THE CAR WAS TOWED TO THE DEALERSHIP (TANSKY SAWMILL, DUBLIN OH).  THEY RESET THE CAR AND IT WAS RETURNED TO US.     ACCORDING TO DEALERSHIP, DIAGNOSTICS DETECTED TWO ERROR CODES REPORTED A) P0A0F,  B) P3190   CURRENTLY DO NOT FEEL SAFE DRIVING ON THE FREE WAY",
        "vin": "JTMRJREV9HD"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/16/2017",
        "dateOfIncident": "10/26/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11046656,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "RE:  COMPLAINT 11043597.  EXPERIENCED COMPLETE LOSS OF BRAKES.  NO WARNING LIGHT.  BRAKES WERE RESET?  AFTER VEHICLE ARRIVED AT DEALER.  ECU DID NOT DOWNLOAD ANY WARNING CODES.  BASED ON THIS, TOYOTA WILL NOT REPAIR/REPLACE CORRESPONDING BRAKE COMPONENTS AND WANT ME TO DRIVE THE CAR.  THIS WAS A COMPLETE BRAKE LOSS WITH PEDAL TO THE FLOOR AND NO BRAKES.  USED PARKING BRAKE AND TRANSMISSION TO STOP CAR.  CHECKING THE NET, THERE ARE OTHER 5TH GENERATION 4RUNNERS WITH SIMILAR BRAKE FAILURES AND SIMILAR NO ACTION FROM TOYOTA",
        "vin": "JTEBU5JR2H5"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/09/2017",
        "dateOfIncident": "10/02/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11044936,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 TOYOTA 4RUNNER. WHILE DRIVING APPROXIMATELY 35 MPH, THE CURTAIN AIR BAGS LOCATED AT THE FRONT DRIVER AND PASSENGER DOORS, THE REAR CURTAIN AIR BAGS LOCATED AT THE REAR DRIVER'S DOOR, AND THE REAR PASSENGER DOOR AIR BAGS ABRUPTLY DEPLOYED. THE CONTACT LOST CONTROL OF THE VEHICLE AND CRASHED INTO THE MEDIAN. THE FRONT PASSENGER SIDE TIRE AND WHEEL WERE DAMAGED. THE CONTACT RECEIVED BURNS ON THE LEFT ARM DUE TO THE DEPLOYMENT. MEDICAL ATTENTION WAS NOT RECEIVED. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO AN UNKNOWN DEALER FOR DIAGNOSTIC TESTING. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS APPROXIMATELY 7,800.",
        "vin": "JTEBU5JR6H5"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/05/2017",
        "dateOfIncident": "10/26/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11043597,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE FAILURE.  APPROACHING 4 WAY STOP.  WENT TO APPLY BRAKES, HEARD-FELT A POP AND PEDAL WENT TO FLOOR AND LOST ALL BRAKING POWER.   THIS IS A NEW VEHICLE.  HAD TO USE PARKING BRAKE AND TRANSMISSION TO SLOW TO STOP.  FORTUNATELY ONLY GOING 30MPH........STILL ROLLED INTO CENTER OF 4 WAY INTERSECTION.   THANK GOD NO CARS IN FRONT OF ME OR THERE WOULD HAVE BEEN AN ACCIDENT.",
        "vin": "JTEBU5JR2H5"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/06/2017",
        "dateOfIncident": "03/30/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970966,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WAS PARKED OVERNIGHT AND THE NEXT DAY WHEN I GOT IN TO RUN ERRANDS AND MY CHECK ENGINE LIGHT WAS FLASHING AND MY TRAC OFF LIGHT WAS ON. WHEN I PUT THE VEHICLE IN DRIVE IT WAS VERY SLUGGISH, I CALLED THE DEALER AND THEY SENT A TOW TRUCK. THE TRUCK STAYED OVERNIGHT SO THEY COULD DIAGNOSE BUT SHE WAS PRETTY SURE THAT IT WAS RODENTS CHEWING ON THE WIRES BECAUSE IT WAS A COMMON PROBLEM.  MY HUSBAND AND I DID SOME CHECKING WHILE IT WAS IN SERVICE AND FOUND OUT THAT THEY USE A SOY BASE ON THE WIRING AND THAT RODENTS LOVE IT AND IT'S PRETTY COMMON PROBLEM. THE COST TO FIX WAS $535 AND WAS NOT COVERED UNDER THE WARRANTY.  WE HAVE BEEN LIVING IN THE SAME PLACE SINCE 2000 AND HAVE HAD SEVERAL VEHICLES THRU OUT THAT TIME AND HAVE NEVER HAD AN ISSUE BEFORE WITH RODENTS.",
        "vin": "JTEZU5JR9H5"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/26/2017",
        "dateOfIncident": "02/25/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10956997,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER LESS THAN 20 DAYS OF OWNERSHIP OF A NEW 2017 TOYOTA 4RUNNER AND LESS THAN 600 MILES, THE CAR FAILED TO IDLE, SHOWED CHECK ENGINE LIGHT AND TRAC OFF LIGHT STAYED LIT. THE CAR WAS UNSAFE TO DRIVE AND HAD IT TOWED TO THE TOYOTA DEALERSHIP.   THEY DIAGNOSED THAT THE INJECTOR WIRE HAD BEEN CHEWED BY A RODENT. THE COST OF THE REPAIR WAS ESTIMATED TO BE $516 AND NOT COVERED BY WARRANTY. I WAS SURPRISED BY THIS DUE TO THE FACT WE LIVE IN SEATTLE AND MY PREVIOUS CAR HAD BEEN PARKED IN THE EXACT SAME AREA FOR 9 YEARS WITHOUT THIS ISSUE. THIS IS NOT A STORY OF A RARELY DRIVEN CAR PARKED IN A RURAL BARN. I AM CONCERNED ABOUT THE VIABILITY OF THIS VEHICLE'S ELECTRICAL SYSTEM DUE TO THE SOY BASED WIRE INSULATION THAN SEEMS TO ATTACT RODENTS. THIS PROBLEM HAS THE POTENTIAL TO AFFECT ALL SAFETY AND ENGINE FUNCTIONS.",
        "vin": "JTEBU5JR5H5"
    }
]