[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/17/2022",
        "dateOfIncident": "02/14/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452606,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The fuel pump has an issue leading to a check engine light and compromised engine performance. It has been inspected by an independent service center.",
        "vin": "5TDKZ3DC5HS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/27/2022",
        "dateOfIncident": "10/13/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449199,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The hood crumples like aluminum foil. The hood rod was holding the hood up and the slightest pressure on the hood made it bend. The hood should NOT bend as easily as it did. The fragility of the hood could cause a serious issue in the event of a crash.",
        "vin": "5tdxz3dc8hs"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/14/2022",
        "dateOfIncident": "01/13/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447450,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Toyota Sienna. The contact stated that while driving approximately 65 MPH, the third-row driver’s side window suddenly shattered causing shards of glass to enter the vehicle. The cause of the failure was not determined. No object had contacted the vehicle to cause the failure. The local dealer and manufacturer were not yet contacted. The approximate failure mileage was 41,000.",
        "vin": "5TDKZ3DCXHS"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/22/2021",
        "dateOfIncident": "12/22/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444768,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Unknown,   Steering wheel turns several inches when you engage the steering wheel lock.  Causes the steering wheel to be off centered. Which in turn cause the alignment not centered.  Dealer confirmed that it needs a steering shaft replacement.",
        "vin": "5TDKZ3DC9HS"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/12/2021",
        "dateOfIncident": "11/03/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443549,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "My power doors open and won’t close. It takes multiple times to finally get them to close.",
        "vin": "5TDYZ3DC3HS"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "10/19/2021",
        "dateOfIncident": "10/14/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437319,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "On 10/14/2021, as my wife was pulling into our attached garage, the vehicle suddenly accelerated, hitting a metal storage shelf located at the back wall of the garage. The impact of the crash caused the vehicle and the shelf to extensively damage the dry wall of that area of the garage, as well as to damage the pedestal supporting the house water heater, which resulted in the water heater detaching away from the wall and being destroyed. There was, of course, also major damage to the front bumper area of the vehicle. It is my contention that the cause of the accident lies in some component of the vehicle acceleration system. I believe this to be true because of two prior incidents which occurred within the month before this happened. On 09/16/2021, I was driving this vehicle and wanted to make a U-turn. I was traveling at approximately 10 MPH, but as I began the turn, suddenly, the vehicle accelerated to about 25 MPH, even though my foot was off the accelerator. My wife and granddaughter were in the vehicle at the time and both expressed alarm, somehow thinking I had purposely made this maneuver, which I assured them that I had not. Then, approximately 7-10 days later (I am unsure of the date), I was driving, alone, in  this vehicle and went to make a left-hand turn. The vehicle again accelerated, even though I had removed my foot from the accelerator pedal and was applying the brakes. I estimate that as I began the turn, my speed was 10-15 MPH, but the vehicle accelerated to 25-30 MPH. I dismissed both of these prior incidents as not too important and attributed them to some unknown anomaly on the road. However, after the latest incident involving the damage to my garage and vehicle, research showed that several Toyota models and specifically the Sienna have had similar issues in the past.  I am reporting this incident to Toyota for their evaluation, but wanted to make your agency aware, also.",
        "vin": "5TDKZ3DC7HS"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/16/2021",
        "dateOfIncident": "10/15/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436985,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "On October 15, 2021 at 2 pm  I drove into the driveway of a friend.  I turned to the right of the driveway on her grass so I could backup and face the road.  I’ve done this many times in the past.  On this day as I put my foot on the break the van accelerated at a very very high speed. The van was out of my control at this point.  I do not know how fast because this all happened in seconds.  I was heading straight to their privacy wood fence only feet away.  Approximately 20 feet.  I don’t recall breaking again but turned the wheel to the right trying to avoid the fence.  I hit the fence at a high speed damaged the left bumper and scraped the drivers side of the door.  The next second I attempt to break again so I could back out of this when the van continued to accelerate at high speed  going straight toward the house only a few feet away. I attempted to avoid the house and hit the right bumper hard at a high speed on the corner of the house.  At this point the acceleration stopped and I was able to backup and turn the car around and finally turn the car off.   There is major damage to the van and some to the fence and house.  I was very upset and in shock and some soreness the next day but thankfully no one was hurt. This is a very small yard area that this took place at.  I am still in shock and extremely confused as to why this happened. I do know without question my foot was not in the accelerator.  The van is presently in the body shop.   I would like to mention I have a clean record at the age of 64 I have never had an accident and/or speeding ticket in my life.  This truly was not human error.  I’m a very experienced driver.  If it was human error the van should have stopped at the first point of impact on the fence, but did not.  It continued to accelerate at a fast speed after hitting the fence hard. The van paused but continued to accelerate at this point when I hit the break again and it went toward the right straight for their house.",
        "vin": "5TDYZ3DC4HS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/26/2021",
        "dateOfIncident": "08/12/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430575,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Driver side sliding door stops and reopens when trying to close using power option previous van did the same thing but had a recall. When turning power door option off, it's stopped, doesn't want to budge much and you have to use all of your force to try to close it. This has being going on since 2018 when I bought it but there was no recall so delearship wouldn't touch it.",
        "vin": "5TDXZ3DC3HS"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/23/2021",
        "dateOfIncident": "07/23/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430103,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "When vehicle is park on an angle (with Front section lower than the back) power sliding door (behind front passenger) does not fully engages arresting hook and tends to immediately return to close position sometimes hitting passengers trying to enter or exit the vehicle. Vehicle was taken to dealer for check up but dealer claims to have been unable to replicate issue, possibly due to not placing vehicle on an angle. No warning lamps or lights indicate any issue with the vehicle passenger door(s).",
        "vin": "5TDKZ3DC0HS"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/16/2021",
        "dateOfIncident": "07/03/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425207,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "on July 3rd, traveling on highway to airport tire blew out (right rear). Pulled to side of road and attempted assistance but this was friday afternoon before july 4th holiday, NOTHING was going to happen except a tow - possible wait as long as 2-3 hours. reportedly the Sienna has drive flat  (50 miles at 50 mph) We drove 5 mph for approx 3 to 4 miles to tire store/Les Schwab. Flat was replaced but then on inspection ALL remaining tires had card showing wear on inner tires. ALL 4 (including the blowout). Pictures submitted .   Of particular concern is that we had taken the vehicle about 10 K prior (March)specifically for tire wobble noise and to fix alignment. Wear was noted, but no safety concerns raised and no cautionary recommendations offered. When we brought the vehicle and tires to the dealer AFTER the blowout we were told by service manager that the early wear was a known problem to occur specifically on the all wheel Siennas. Again, NO CAUTIONARY ADVICE GIVEN in March despite recognized wear and this known history.  We had a blowout in heavy holiday traffic at 60 mph less than 10K /3month later. This easily could have been catastrophic. We reported to Toyota to a  \"Beth\" at customer documentation and risk reduction department who did an excellent job of deflecting causation/potential blame and advised us  to contact the tire manufacturer or the dealer.  Absolutely no evidence of concern for  safety - ours or those around us - at highway speeds. Review of web shows known problem, service manager volunteered it to be a known problem of premature wear, with service  given shortly before incident WITHOUT GUIDANCE. \"Beth\" told us she would document our concerns but that there was nothing Toyota could do or would do other than documenting. I am hopeful you can investigate further  and initiate some reparative process before there is a preventable catastrophe much like the Prius accelerator problem.  we will send copies of to wherever is useful",
        "vin": "5TDDZ3DC2HS"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/12/2021",
        "dateOfIncident": "07/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424445,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Toyota Sienna. The contact stated while driving 35 MPH and coming to a stop, the brake pedal was depressed but failed to respond. There were no warning lights illuminated. The contact stated the brake pedal was rigid. The contact stated the failure reoccurred while driving. The brake warning light and traction control warning light were illuminated. The vehicle was taken to the dealer who could not determine the cause of the failure. The dealer advised the contact to take the vehicle back to the dealer she purchased the vehicle. The manufacturer was made aware of the failure and referred the contact to the dealer who sold her the vehicle. The vehicle was not repaired. The approximate failure mileage was 14,500.",
        "vin": "5TDYZ3DC0HS"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/05/2021",
        "dateOfIncident": "05/24/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419789,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle began running harshly, then stalled. Check engine light came on. Upon inspection at Toyota dealership, found to have leaked fuel into charcoal canister. Vehicle owner does NOT overfill gas tank.",
        "vin": "5TDDZ3DCXHS"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/10/2021",
        "dateOfIncident": "05/06/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415790,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 TOYOTA SIENNA. THE CONTACT STATED THAT WHILE THE VEHICLE WAS PARKED AND UNATTENDED, THERE WAS AN ABNORMAL POPPING SOUND DETECTED. THE CONTACT'S NEIGHBOR NOTICED THAT THE REAR WINDSHIELD WAS CRACKED, WITHOUT IMPACT. THE CONTACT CALLED WALSER TOYOTA (4401 AMERICAN BLVD W, BLOOMINGTON, MN 55437, (612) 294-0220) AND WAS REFERRED TO A GLASS COMPANY. THE VEHICLE WAS NOT YET REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 46,500.",
        "vin": "5TDXZ3DC0HS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/07/2021",
        "dateOfIncident": "04/28/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415533,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CLIP/HINGE IN FUEL TANK DOOR IS BROKEN. NO LONGER APPEARS FLUSH AGAINST VEHICLE   HAPPENED IN APRIL WHILE STATIONARY PUTTING IN FUEL AT STATION.",
        "vin": "5TDDZ3DC8HS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/06/2021",
        "dateOfIncident": "05/04/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415360,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN INTERSTATE WITH WINDOWS AND SUNROOF CLOSED, THE SUNROOF GLASS EXPLODED DUE TO UNKNOWN CAUSE, BUT NOT AS A RESULT OF FALLING OBJECT OR PROJECTILE.",
        "vin": "5TDXZ3DC5HS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/13/2021",
        "dateOfIncident": "02/20/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402803,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VACUUM BRAKE ASSIST FAILED WITH LESS THAN SLIGHTLY LESS THAN 50K MILES ON THE CAR.  NOT SURE EXACTLY WHEN IT FAILED BECAUSE THE BRAKE AND TRACTION CONTROL LIGHTS WERE ON INTERMITTENTLY FOR AWHILE BEFORE WE TOOK THE CAR IN FOR SERVICE.  WE DID HAVE A NEAR MISS WHILE MAKING A LONG DRIVE WHEN WE WERE TRYING TO LEAVE THE INTERSTATE ON AN OFF RAMP AND I WAS ALMOST UNABLE TO STOP AT THE TOP OF THE RAMP.  I HAD TO ANGLE THE VEHICLE TO THE LEFT TO AVOID HITTING A PICKUP TRUCK AT THE TOP OF THE RAMP.",
        "vin": "5TDYZ3DCXHS"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/18/2021",
        "dateOfIncident": "12/04/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396838,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 20V682000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. TOYOTA OF WICHITA FALLS (2213 OLD JACKSBORO HWY, WICHITA FALLS, TX 76301) AND THE MANUFACTURER WERE MADE AWARE OF THE ISSUE. THE CONTACT HAD EXPERIENCED THE FAILURE LISTED IN THE RECALL. THE FAILURE MILEAGE WAS 40,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TDYZ3DC9HS"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/16/2020",
        "dateOfIncident": "12/16/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383679,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SLIDING DOORS WILL OPEN ON THEIR OWN.",
        "vin": "5TDYZ3DC3HS"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/15/2020",
        "dateOfIncident": "06/17/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374736,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CANNOT SEE SPEEDOMETER IN DAYTIME UNLESS HEADLIGHTS ARE TURNED ON.  BOUGHT NEW AND TOOK BACK TO DEALER BUT .  HE COULD NOLT GET ANY BACK LIGHTING. SPEEDOMETER HAS BLACK BACKGROUND.",
        "vin": "5TDJZ3DCXHS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/03/2020",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372932,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TOP HINGE ON FUEL COVER DOOR BROKEN AFTER 52K MILES. FROM SEARCHING ONLINE, IT SEEMS TO BE A REPORTED ISSUE WITH THE SIENNA DUE TO REQUIRED PRESSURE TO CLOSE THE FUEL COVER DOOR.",
        "vin": "5TDYZ3DC5HS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/21/2020",
        "dateOfIncident": "06/21/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329974,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FINISH ON AC CONTROL PANEL IS BUBBLING UP. THE CAR WAS STATIONARY AND NO APPARENT CAUSE.",
        "vin": "5TDKZ3DC5HS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/01/2020",
        "dateOfIncident": "05/20/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326738,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE EXHIBITS PERIODS OF ROUGH ACCELERATION, CHUGGING, AND HESITATION. AFTER 3 TRIPS TO DIFFERENT TOYOTA DEALERS THEY REFUSE TO ADDRESS PROBLEM. A MASSIVE RECALL OF TOYOTA FUEL PUMPS IS UNDERWAY ON SEVERAL VEHICLES INCLUDING 2017 SIENNA'S BUT DEALERSHIPS CLAIM MY 2017 SIENNA IS NOT ON LIST. I'VE LIVED WITH THIS FOR 3 YEARS AND MY VEHICLE IS TILL UNDER WARRANTY WITH LESS THAN 18,000 MILES ON IT. HAPPENS WHENEVER VEHICLE IS USED. DEALERSHIPS WON'T TEST IT AS THEY HAVE TO DROP GAS TANK.  *TR",
        "vin": "5TDYZ3DC6HS"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/11/2020",
        "dateOfIncident": "05/11/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324135,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRIDGESTONE RUN FLAT TYRES ON MY TOYOTA SIENNA 2017 AWD HAS WORN OUT IN 24,000 MILES. THESE ARE THE FACTORY TYRES AND WHEN THE DEALER SOLD THE CAR TO US, THEY SAID IT COMES WITH WARRANTY . BUT IT SEEMS THAT IS NOT THE CASE. KINDLY HELP. THESE TYRES ARE EXPENSIVE AND IF I HAVE TO CHANGE IT AROUND 20,000 MILES, ITS TOO MUCH. ALL WE USE THE CAR IS TO DROP OFF KIDS TO SCHOOL AND THEIR SPORTING EVENTS. WE NEVER TOOK THE VAN IN BAD ROADS.  *TR",
        "vin": "5TDDZ3DC8HS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/13/2020",
        "dateOfIncident": "04/09/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321018,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BACK WINDOW POPPED AND PARTIALLY SHATTERED. THE VAN WAS IN THE GARAGE AND THE GARAGE DOOR WAS CLOSED.",
        "vin": "5TDXZ3DC1HS"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/06/2020",
        "dateOfIncident": "03/05/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316679,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I'M DRIVING MY VEHICLE IN A CITY STREET I GET AN ALERT ON THE  INSTRUMENT PANEL WHICH SAYS \"TRAC OFF - CHECK AWD SYSTEM\" AND THE SERVICE LIGHT TURNS ON. I DID NOT TURN THE TRAC OFF. WHEN I TURN THE VEHICLE OFF AND THEN BACK ON, THE SERVICE ISN'T ON ANYMORE AND THE MESSAGE GOES AWAY. THIS HAS HAPPENED SEVERAL TIMES WHEN I'M DRIVING AND THE CAR STALLS AND LOSES SPEED AND WANTS TO SHUT OFF  AS I'M DRIVING IN A CITY STREET. FOR SEVERAL MINUTES AND THE SERVICE LIGHT AND THE TRACK AND AWD LIGHT TURN ON AND STAY ON FOR SEVERAL HOURS. HOWEVER, WHEN I TURN OFF THE CAR THE LIGHTS ARE STILL ON BUT GO AWAY AFTER SOME TIME. THIS HAS HAPPENED SEVERAL TIMES.",
        "vin": "5TDJZ3DC9HS"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/14/2020",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309295,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I BRAKE (ESPECIALLY FROM HIGHER SPEEDS) THE STEERING WHEEL SHAKES AND THE CAR RIDE FEELS VERY JERKY - ESP FOR THOSE IN THE FRONT SEATS. THERE ALSO SEEMS TO BE A WHINING OR RUBBING NOISE.",
        "vin": "5TDDZ3DC6HS"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/23/2019",
        "dateOfIncident": "12/18/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290971,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE 2004 TOYOTA HAS KNOWN THAT SIENNA AWD DAMAGE RUN-FLAT-TIRES (RFT) RAPIDLY AND NEVER REACH OR CLOSE TO 60,000 MILES OF THE LIFE OF TIRES WARRANTY. TOYOTA SHOULD FIX THIS PROBLEM THEN OR WARN THEIR CUSTOMER BEFORE THE PURCHASING (SEE THE ATTACHED DOCUMENT OF A CLASS ACTION).    I PURCHASED SIENNA VAN AWD FROM L&S DEALER IN BECKLEY WV, THE SALESMAN NEVER TOLD ME ABOUT THE TIRES PROBLEM WILL BE WORN OUT COMPLETED WITHIN 30,000 MILES, BUT STATE THAT 60,000 MILES INCLUDED TIRES FOR ALL POWER TRAINED AFTER I NOTICED THAT THE VAN DO NOT HAVE SPARE TIRE. WHEN I BROUGHT VAN FOR TIRES WARRANTY FROM  FIRESTONE CORPORATE SERVICE CENTER AND THEY TOLD ME THE SIENNA IS TOO HEAVY TO USE THIS TIRES. I HAVE TO PAY THE PARTIAL USAGE OF 60,000 MILES WARRANTY. THE BIG PROBLEM IS THE TIRES OF MY VAN CUPPED AND MAKING ROAMING NOISE WHEN ONLY 10,000 MILES WHICH MAKE DRIVING VERY UNCOMFORTABLE, DEFEATED THE PURPOSE WHAT I PAID FOR. THIS IS ABNORMAL FOR VAN OR ANY CAR THAT DAMAGES THE TIRES SO BADLY. THE OTHER PROBLEM IS THE VAN ACTS JERKING SOME TIMES WHEN I CHANGE LANE IN HIGHWAY. THIS IS VERY DANGEROUS.    AT 29,000 MILES TOYOTA AUTHORIZED SERVICE CENTER TOLD ME THE TIRES CUPPED BADLY TO STEEL BELT, AFTER PARKED THE VAN FOR 1 MONTH I DECIDED TO PAY TO REPLACE TIRES (SEE ATTACHED PICTURE FOR THE CUPPED TIRES).    I WOULD LIKE TOYOTA TO RESOLVE THE ISSUES -- REPAIR OR REPLACE THE EQUAL VALUE VAN BUT NOT AWD.",
        "vin": "5TDJZ3DC2HS"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/24/2019",
        "dateOfIncident": "09/22/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257724,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HISTORY: PERIODICALLY OVER THE LIFE OF THE VEHICLE, WHEN I PUSH DOWN ON THE GAS PEDDLE THE CAR IS UNRESPONSIVE OR RESPONDS IN FITS AND STARTS. THIS IS USUALLY UPON STARTUP AFTER STOPPING AT A STOP SIGN OR LIGHT. BUT IT DID HAPPEN IN MAY OF 2019 AT 65MPH ON THE FREEWAY (GOING STRAIGHT), RESULTING IN SUDDEN DECELERATION. AS I MOVED OVER LANES TO GET TO THE SIDE OF THE ROAD, THERE WAS A SUDDEN JOLT AND THE CAR BEGAN FUNCTIONING NORMALLY.   ON SUNDAY 9/22/19 AT 10AM I LEFT MY HOME WITH MY DAUGHTER TO GO TO THE MOVIES. LESS THAN 5 MINUTES FROM OUR HOME, IN OUR FLAT NEIGHBORHOOD GOING 25MPH, I STOPPED AT THE STOP SIGN THEN ATTEMPTED TO ACCELERATE THROUGH THE INTERSECTION. THE CAR WENT A FEW FEET INTO THE INTERSECTION AND THEN WOULDN'T MOVE, THE ENGINE MAKING A WHIRRING SOUND. IT WAS IN DRIVE. I TURNED ON THE HAZARD LIGHTS AND GENTLY ATTEMPTED TO PUSH THE GAS PEDDLE, FINALLY ABLE TO MOVE THROUGH THE INTERSECTION IN FITS AND STARTS (JOLTING) TO GET TO THE SIDE OF THE ROAD. I PUT THE CAR IN PARK, THEN NEUTRAL. PUSHED DOWN THE GAS IN NEUTRAL AND HEARD THE WHIRRING NOISE. IN DRIVE AND REVERSE, THE JOLTING CONTINUED. I WAS ABLE TO JOLT MY WAY HOME UNDER 10MPH. THE CAR WAS FINE WHEN IT WAS COASTING WITHOUT NEEDING POWER, JOLTING WHEN IT NEEDED POWER.  BECAUSE THE CAR IS DANGEROUS, I HAD IT TOWED TO MAGNUSSEN'S TOYOTA, WHERE IT IS AS OF THIS WRITING. THIS IS A VERY DANGEROUS DEFECT AND NEEDS TO BE ADDRESSED AS IT SUDDEN DECELERATION IN AN INTERSECTION OR ON THE FREEWAY MAY RESULT IN DEATH.  UPON INITIAL DRIVING, I WAS TOLD THE VEHICLE WAS OPERATING NORMAL. I AM WORRIED THEY WON'T FIX IT AND I WILL END UP WITH A VERY DANGEROUS ALMOST NEW CAR. PLEASE HELP, AND HELP FOR THE SAFETY OF OTHERS WITH THIS SAME DEFECT.",
        "vin": "5TDDZ3DC3HS"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "09/11/2019",
        "dateOfIncident": "09/05/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11254716,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 TOYOTA SIENNA. WHILE THE VEHICLE WAS PARKED ON AN INCLINE, THE PASSENGER SIDE SLIDING DOOR OPENED AND FAILED TO LATCH. AS A RESULT, THE DOOR RETRACTED WHILE THE CONTACT'S ARM WAS STILL INSIDE THE VEHICLE. THE CONTACT MANAGED TO JERK HER ARM OUT OF THE VEHICLE, BUT SUSTAINED BRUISES AND SCRAPES TO THE ARM. MEDICAL ATTENTION WAS NOT RECEIVED. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT TOOK THE VEHICLE TO TOYOTA OF NORTH CHARLOTTE (13429 STATESVILLE RD, HUNTERSVILLE, NC 28078, (704) 875-9199) AND A SERVICE APPOINTMENT WAS SCHEDULED FOR SEPTEMBER 6, 2019. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 45,397.",
        "vin": "5TDKZ3DC7HS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/04/2019",
        "dateOfIncident": "06/12/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253206,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA'S AWD SIENNAS HAVE A DEFECTIVE DESIGN IN THEIR AXLE HUB CAUSING PREMATURE TIRE WEAR WHICH CAN LEAD TO AN ACCIDENT. THERE IS NO WAY TO ALIGN THE REAR WHEELS ON THE AWD VERSIONS. PEOPLE EXPECTING 50-60000 MILES ON THEIR TIRES, WILL NOT GET THAT AMOUNT OF MILES. MOST WILL GET 15-20000 AT MOST. THIS IS CAUSED BY THE LACK OF WHEEL ALIGNMENT FEATURES LIKE THE 2 WHEEL DRIVE SIENNA'S HAVE.",
        "vin": "5TDJZ3DC6HS"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/08/2019",
        "dateOfIncident": "07/19/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242466,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "JULY 2019 , SPEEDOMETER GAUGE IS NOT VISIBLE IN DAYLIGHT WITH THE LIGHTS OFF. TOYOTA SERVICE ALTERED THE LIGHT CONFIGURATION SO THAT NOW THE AUTO LIGHT FEATURE AND THE LIGHTS ON WARNING DOES NOT WORK. DEALER ADVISED I MUST USE PARKING LIGHTS SWITCH SELECTION IN ORDER TO SEE SPEEDOMETER GUAGE IN DAYLIGHT. THE CAR DOES NOT WORK AS ADVERTISED AND IS A \"DRIVING WHILE DISTRACTED\" SIGNIFICANT SAFETY RISK AS NO-ONE CANNOT SEE THE SPEEDOMETER DURING DAYLIGHT DRIVING WITH THE LIGHTS OFF.",
        "vin": "5TDZZ3DC5HS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/22/2019",
        "dateOfIncident": "06/25/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233820,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 TOYOTA SIENNA. WHILE DRIVING 35 MPH, THE CONTACT HEARD A POPPING SOUND COMING FROM THE ENGINE. SIMULTANEOUSLY, ALL OF THE WARNING INDICATORS ILLUMINATED AND SMOKE APPEARED FROM THE HOOD OF THE VEHICLE. THE VEHICLE IMMEDIATELY SHUT OFF AND WAS TOWED TO AN INDEPENDENT MECHANIC WHERE THE WATER PUMP WAS REPAIRED; HOWEVER, THE FAILURE WAS NOT CORRECTED. THE CONTACT SPOKE WITH THE TOYOTA MANUFACTURER WHO ADVISED HIM TO TAKE THE VEHICLE TO A LOCAL TOYOTA DEALER. THE VEHICLE WAS TOWED TO HILLSIDE TOYOTA (139-65 QUEENS BLVD, JAMAICA, NY 11435, (718) 521-4554) WHERE IT WAS DIAGNOSED THAT THERE WAS MASSIVE ENGINE FAILURE. THE CONTACT AGREED TO HAVE THE VEHICLE REPAIRED AND THE DEALER KEPT IT FOR NEARLY A MONTH. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 67,000.",
        "vin": "5CDZZ3DC5HS"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/18/2019",
        "dateOfIncident": "07/15/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232967,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 L MODEL TOYOTA SIENNA MINI VAN / JUST PURCHASED AS A CERTIFIED TOYOTA PRE-OWNED UNIT WITH LESS THAN 13,000 ORIGINAL MILES, I AM THE SECOND OWNER. I CANNOT RELIABLY SEE THE SPEEDOMETER DISPLAY IN DAYLIGHT, NO DISPLAY BACK LIGHTS IN DAY LIGHT, UNLESS HEADLIGHTS OR PARKING LIGHTS ARE ON, VERY POOR VISIBLY OF SPEEDOMETER IS MOST UNSAFE AS I HAVE TO TAKE MY EYES OFF THE ROAD FOR EXTENDED PERIODS OF TIME JUST TO  TRY AND SEE MY SPEED READING. I DID NOT NOTICE THIS ISSUE AT NIGHT WHEN PURCHASED THE CAR.",
        "vin": "5TDZZ3DC5HS"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/27/2019",
        "dateOfIncident": "01/07/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11223049,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR SEAT BELT WOULD NOT LOOSEN. IT ONLY TIGHTEN UP TRAPPING CHILD IN SEAT. THE ENGINE WAS TURNED OFF AND VEHICLE WAS IN PARK. NOTE I DON'T REMEMBER EXACT DATE BUT APPROXIMATE DATE.",
        "vin": "5TDXZ3DC5HS"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/22/2019",
        "dateOfIncident": "06/12/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11221853,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VAN WERE ON A SLIGHT SLOPE DRIVEWAY WITH ENGINE STILL TURN ON AND SHIFT IN PARK. WHEN TURN THE ENGINE OFF, THE VAN ROLE BACKWARD INTO THE STREET. THIS COULD BE A RESULT OF GEAR SHIFT OUT OF PARK. IT IS A AUTOMATIC TRANSMISSION.",
        "vin": "5TDKZ3DC1HS"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/20/2019",
        "dateOfIncident": "03/02/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221455,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER REAR DOOR HAS BEEN OPENING WHILE THE CAR IS ON THE ROAD  I TOOK IT TO THE DEALER THEY WANT MY TO PAY FOR THE SERVICE. THIS IS A SAFETY ISSUE THEY DON'T WANT TO REPLACE THE DOOR LATCH. THEY TOLD ME TO TURN OFF THE POWER DOOR OF BUT THEY PROBLEM STILL OCCUR  IT'S VERY DANGEROUS SITUATION I CAN'T EVEN THAT MY KIDS OUT",
        "vin": "5TDDZ3DC1HS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/13/2019",
        "dateOfIncident": "06/12/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219833,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN OPENING THE PASSENGER-SIDE POWER SLIDER DOOR WHILE THE CAR WAS ON AND PARKED IN THE DRIVEWAY, THE SLIDING CABLE SNAPPED AND IS CURRENTLY HANGING FROM THE SIDE OF THE BODY. I CANNOT USE THE POWER BUTTONS TO OPEN THE DOOR AUTOMATICALLY, NOR CAN I MANUALLY OPEN THE SLIDING DOOR.",
        "vin": "5TDYZ3DC4HS"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/31/2019",
        "dateOfIncident": "05/29/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217020,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER WAS IN THE PROCESS OF PICKING UP FOSTER CHILDREN TO TRANSPORT THEM TO THEIR VISIT WHEN THE DRIVER NOTICED SMOKE COMING FROM THE STEERING WHEEL AND IMMEDIATELY TURNED OFF THE ENGINE TO THE VEHICLE. BECAUSE OF THE SMOKE THE DRIVER WAS CONCERNED AND CANCELED THE VISIT AND NOTIFIED THE AGENCY DIRECTOR (ME) WHO ADVISED HIM TO RETURN TO TOWN AND DROP OFF THE VAN AT TOYOTA OF OLYMPIA.  AS SOON AS I GOT BACK INTO TOWN I WENT TO THE DEALERSHIP AND THEY ADVISED ME THAT AFTER A HALF HOUR OF DIAGNOSTICS IT WAS DISCOVERED THE RADIO WAS NOT WORKING AND THE FUSE WAS BLOWN. THEY ADVISED ME THAT PUTTING IN ANOTHER FUSE WOULD JUST CAUSE IT TO JUST TRIP OR BLOW OUT.  REQUESTED THEY CONTINUE THE DIAGNOSTICS ON THE VEHICLE AND LET ME KNOW WHAT CAUSED THE PROBLEM. I WAS ADVISED DIAGNOSTICS WOULD BE HELD AT NO MORE THAN $250.00 BUT  WE WILL SEE WHEN I GO TO PICK THE VAN UP AND PARK IT IN THE YARD.  PLEASE SEE THE TEXT MESSAGE SCREENSHOT ATTACHED THAT EXPLAINS THE QUESTION OF THE SMOKE THE DRIVER SAW PER THE SERVICE DEPARTMENT CONTACT.  THE RADIO APPARENTLY GROUNDED OUT AND SHORTED THUS THE SMOKE.  HAD MY DRIVER NOT STOPPED THE VEHICLE AND SHUT OFF THE VAN WHAT WOULD HAVE HAPPENED OR WORSE - WHAT IF THE DRIVER HAD NOT NOTICED THE SMOKE COMING FROM THE VEHICLE IN THE FIRST PLACE. WOULD THE VAN HAVE BURST INTO FLAMES IF THE DRIVER HAD NOT SEEN THE SMOKE AND KEPT DRIVING. WE HAVE HAD THE VAN LESS THAN TWO YEARS AND IT IS HAVING SERIOUS ISSUES.  WE JUST HAD TO REPLACE THE WINDSHIELD WIPER MOTOR BECAUSE IT FROZE IN MID MOTION JUST A COUPLE OF WEEKS AGO.  SOMETHING IS NOT RIGHT WITH THIS VEHICLE AND VERY UNSAFE.  SOMEONE NEEDS TO LOOK INTO THIS ISSUE.  ALSO THEY CAN'T DO ANYTHING MORE UNTIL THEY REPLACE THE RADIO BUT ALL WIRING IN THE STEERING WHEEL IS OKAY AND THE COST TO REPLACE THE RADIO IS 4109.00 PLUS THE TAX.",
        "vin": "5TDDZ3DC4HS"
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/31/2019",
        "dateOfIncident": "05/29/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217115,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 SIENNA - 16886 MILES.  FIRESTONE TIRES STARTED WEARING THIN AT 16,462 MILES.   WAS TOLD TOYOTA DOES NOT HANDLE THAT.  CALLED FIRESTONE AND WAS TOLD TO GO TO CORPORATE STORE.  WAS TOLD AT FIRESTONE STORE TIRES WERE AT 5/32 AND NOTHING THEY COULD DO BECAUSE TIRES WERE NOT AT 4/32.  CONCERNED BECAUSE FAMILY CAR, TIRES SHOULD NOT START TO WEAR AT LESS THAN 17,000 MILES.  AT 16,886 MILES WHILE MY WIFE WAS DRIVING DOWN THE CITY ROAD AT 40 MPH, 2 FIRESTONE TIRES BLEW OUT.  MY CONCERN IS MORE TIRES ARE ON ROAD AND THERE HAS TO BE A PROBLEM WITH THAT BATCH OF TIRES.  FIRESTONE STILL WILL NOT SAY THEY ARE IN WRONG.",
        "vin": "5TDKZ3DC9HS"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/17/2019",
        "dateOfIncident": "02/18/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208364,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESIVE FRONT TIRES WEAR. ALL SERVICES AT CERTIFIED TOYOTA DEALER.  NEED TO REPLACE TIRES AT 12000 MILES (BRAND NEW!!)  TODAY 05/17/2019 THE VAN IS 28000 MILES AND I WILL NEED TO REPLACE TIRES AGAIN. REALLY NOT NORMAL. I RESEARCH ONLINE AND MANY COMPLAINTS OF SAME ISSUES.",
        "vin": "5TDYZ3DC9HS"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/10/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206912,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WE ARE EXPERIENCING EXCESSIVE TIRE WEAR ON OUTER EDGES.  NOTHING WAS MENTIONED ABOUT UNEVEN TIRE WEAR UNTIL 10K MILES MARK.  TIRES WERE ROTATED EVERY 5K.  HAD TO  PAY AND PERFORM ALL WHEEL ALIGNMENT AT 10K.  FEW WEEKS AGO, I AM NOT ABLE TO GET REPAIR SHOPS TO REPAIR A PUNCTURED NAIL ON ONE OF THE TIRES BECAUSE THEY DEEM UNSAFE TO REPAIR A TIRE WORN OUTER AGE.  THE VAN NOW HAS 19K MILES AND I AM LOOKING TO GET NEW SET OF TIRES.",
        "vin": "5TDYZ3DC7HS"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/30/2019",
        "dateOfIncident": "03/08/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204697,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL(?) MY HUSBAND BOUGHT ME A 2017 TOYOTA SIENNA IN FEBRUARY 2019, IT WAS PREVIOUSLY A RENTAL. THE VAN WAS IMMACULATE AND ONLY HAD ABOUT 20,000 MILES AT TIME OF PURCHASE. ON OR ABOUT MARCH 8, 2019 WE WERE ON OUR WAY TO DINNER AT ABOUT 9 P.M. I WAS APPROACHING A RED LIGHT, FOOT ON THE BRAKE, MAYBE 15 MPH AND I LOOKED DOWN FOR A SECOND AND ENDED UP REAR ENDING A VEHICLE AND IN THE END THERE WERE 3 VEHICLES BESIDES MINE INVOLVED (4 TOTAL). THERE WAS SIGNIFICANT DAMAGE TO MY VAN, THE PLASTICS CRUMPLED AND IT APPEARED TO HAVE NO MAJOR DAMAGE OUTSIDE OF THE PLASTICS. THE AIR BAGS DID NOT DEPLOY DESPITE THE FRONT END COLLISION. AT THE BODY SHOP, UPON TEAR DOWN THE PASSENGER SIDE RAIL WAS DAMAGED AS WELL AS THE AIR BAG SENSORS WERE CRUSHED. ONE WOULD THINK IF THE SENSORS WERE CRUSHED THE AIR BAGS WOULD HAVE DEPLOYED PRIOR. IN ORDER TO REPLACE THE SENSORS IT WOULD REQUIRE A NEW WIRING HARNESS AND TO REPLACE THAT WOULD REQUIRE REMOVAL OF ENGINE AND TRANSMISSION. MY $26,000 2017 SIENNA WITH LESS THAN 50,000 MILES WAS TOTALED.  THE AIRBAGS SHOULD HAVE DEPLOYED AND DIDN'T. THERE WAS NO 'HARD HIT' AND  NO SIGNIFICANT DAMAGE TO OTHER VEHICLES (REAR BUMPERS) OR TO MY HUSBAND OR MYSELF.    MY FIRST CONCERN IS THE AIR BAGS NOT DEPLOYING, THE SECOND IS HAVING HAD THE VAN TOTALED OVER A 'MINOR REAR END COLLISION' *DT    'PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).' *JB",
        "vin": "5TDKZ3DC1HS"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/09/2019",
        "dateOfIncident": "03/31/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195303,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ISSUE STARTED AT ABOUT 4100 MILES. THE VAN WOULD NOT START AT ALL. THE PUSH BUTTON WOULD ACT AS OF THE VAN WOULD START BUT NOTHING WOULD HAPPEN. AFTER TRYING 5 PLUS TIMES IT STARTED. TOOK THE VAN TO THE DEALER THAT STATED EVERYTHING LOOKED GOOD. NOW ABOUT TWO WEEKS AGO THE SAME ISSUE OCCURED. THE VAN WOULD DISPLAY CHECK CHARGING SYSTEM ON THE DISPLAY AND THE VAN WOULD NOT START NO WOULD THE SIDE DOORS OPEN IN ORDER FOR ME TO GET MY INFANT'S OUT OF THE VAN. AFTER MULTIPLE ATTEMPTS THE VAN GOING AGAIN IT STARTED AND I WAS ON MY WAY. CONTACT TOYOTA TO INFORM THEM AND SO FAR THEY HAVE NOT CONTACTED ME BACK AS WELL AS THE DEALER.",
        "vin": "5TDDZ3DC7HS"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/06/2019",
        "dateOfIncident": "08/18/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194269,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT NEW 2017 TOYOTA SIENNA AWD XLE. I NOTICED IN FIRST MONTH THAT STEERING WHEEL STARTED PULLING LEFT. TOOK THE VAN FOR ALIGNMENT BUT NEVER GOT FIXED. NOW I HAVE 25000 MILES TIRES ROTATION DEALERSHIP TOLD ME THAT MY TIRES ARE MORE WEARING INSIDE THAN OUTSIDE. AND IT'S NOT SAFE ON THE ROADS. I HAVE 4 KIDS THAT WE USE THIS VAN  FOR DAILY TRANSPORTATION. I DON'T FEEL SAFE ON THE ROAD WITH MYSELF AND MY FAMILY.",
        "vin": "5TDDZ3DC8HS"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/19/2019",
        "dateOfIncident": "03/19/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190130,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY 2017 TOYOTA SIENNA WITH LESS THAN 10 MILES ON THE ODOMETER. I'VE TAKEN MY CAR TO DEALERSHIP FOR SERVICE EVERY 5K MILES. CURRENTLY, MY CAR HAS 26, 892 MILES AND I JUST HAPPEN TO LOOK AT THE TIRES AND ALL 4 TIRES WERE WEAR OUT ON THE OUTSIDE EDGE.  I WAS ADVISED BY A TIRES SHOP THAT IT NEEDS TO BE REPLACE SOON. THEY SAID IT IS A KNOWN PROBLEM WITH TOYOTA SIENNA AND THE MGF ARE NOT DOING ANYTHING TO CORRECT THE ISSUE. MY ALIGNMENT CHECK OUT TO BE OKAY. I EXPECTED THE TIRES TO LAST MUCH LONGER. PLEASE ADVISE",
        "vin": "5TDKZ3DC3HS"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/26/2019",
        "dateOfIncident": "02/25/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182471,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "EXTREME TIRE WEAR ON THE OUTSIDE OF THE FRONT TIRES AT 15,000 MILES - REQUIRING IMMEDIATE REPLACEMENT.",
        "vin": "5TDXZ3DC5HS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/04/2019",
        "dateOfIncident": "01/30/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173943,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 TOYOTA SIENNA. DURING EXTREMELY COLD WEATHER WITH A WIND CHILL OF APPROXIMATELY MINUS 53 DEGREES, THE VEHICLE'S HOOD WAS AJAR TO JUMPSTART THE VEHICLE. THE CONTACT STATED THAT THE HOOD WAS BENT AND FAILED TO CLOSE PROPERLY. THE VEHICLE WAS TAKEN TO RUDY LUTHER TOYOTA (8805 WAYZATA BLVD, GOLDEN VALLEY, MN 55426 (612) 424-7924) WHERE THE CONTACT WAS INFORMED TO SUBMIT AN INSURANCE CLAIM. THE CONTACT WAS REFERRED TO THE MANUFACTURER. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS CONTACTED AND DID NOT ASSIST. THE CONTACT STATED THAT THE HOOD DESIGN WAS INADEQUATE AND NOT SUSTAINABLE. THE FAILURE MILEAGE WAS 20,000.",
        "vin": "5TDYZ3DC3HS"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/10/2019",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166234,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR IS BRAND NEW.EXCESSIVE OUTER WEAR ON FRONT TIRES IN ONLY 12000 MILES.GOT NEW TIRES AND DID ALIGNMENT. NOW AFTER 15000 MILES I HAVE THE SAME PROBLEM IN NEW TIRES.",
        "vin": "5TDYZ3DC8HS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/27/2018",
        "dateOfIncident": "11/09/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154285,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 TOYOTA SIENNA. WHILE DRIVING APPROXIMATELY 40 MPH AND ATTEMPTING TO STOP THE VEHICLE, THE BRAKES FAILED. AS A RESULT, THE VEHICLE REAR ENDED THE PRECEDING VEHICLE. THERE WAS NO WARNING INDICATOR ILLUMINATED. THE AIR BAG DID NOT DEPLOY. A POLICE REPORT WAS FILED. THERE WERE NO INJURIES. THE DEALER AND MANUFACTURER WERE NOT MADE AWARE OF THE FAILURE. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE VEHICLE WAS DAMAGED AND TOWED TO A TOW YARD. THE FAILURE MILEAGE WAS APPROXIMATELY 20,000.",
        "vin": "5TDYZ3DC6HS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/23/2018",
        "dateOfIncident": "11/12/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11153275,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DRIVER BACK SLIDING DOOR OPEN THREE TIMES WHILE I AM IN MOTION. THE SECOND TIME OPENED WAS ONE ABOUT ONE WEEK APART THEN THE THIRD TIME WAS IN TWO TO THREE HOURS.",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/15/2018",
        "dateOfIncident": "11/05/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151780,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 TOYOTA SIENNA. WHILE DRIVING 30 MPH, THE CONTACT HEARD AN ABNORMAL NOISE. TWO DAYS LATER, THE SUN ROOF EXPLODED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO CLEARWATER TOYOTA (21799 US HWY 19 N, CLEARWATER, FL 33765, (800) 677-6099) WHERE IT WAS DETERMINED THAT SOMETHING FELL ONTO THE SUN ROOF AND CAUSED THE DAMAGE. THE CONTACT WAS ADVISED TO FILE AN INSURANCE CLAIM. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS CONTACTED AND PROVIDED CASE NUMBER: 1811150671, BUT NO FURTHER ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS APPROXIMATELY 30,000.",
        "vin": "5TDYZ3DC6HS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/06/2018",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11149678,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VAN IS BURNING OIL. TOYOTA DID AN OIL CONSUMPTION TEST AND  IT IS CONFIRMED TO BE BURNING OIL. THEY ARE NOT BEING HELPFUL IN HELPING ME OUT....",
        "vin": "5TDKZ3DCXHS"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/31/2018",
        "dateOfIncident": "08/24/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144289,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M VERY FRUSTRATED SINCE I BOUGHT MY TOYOTA SIENNA, I REALLY LIKE THIS MINIVAN BECAUSE IS VERY COMFORTABLE LIKE A FAMILY CAR, WHOEVER SINCE I BOUGHT IT AND I DID THE TEST DRIVE BEFORE I DECIDED TO BUY IT, I FELT LIKE WHEN YOU DRIVE A CAR IN AN IRREGULAR ROAD, I LET THE SELLER GUY KNOWS AND HE SAID THAT IS NORMAL CONSIDERING THAT THIS IS A LARGE MINIVAN AND THE MODEL  ( SPORT MODEL)  BROUGHT TIRES WITH A LOW PERFIL, SO BECAUSE HE IS THE SPECIALIST I WAS CONFORMING WITH HIS ANSWER. BUT WITH LESS THEN 5,000 MILES MY CAR STARTED TO TURNE ON THE TIRES LIGHT, WHEN I STOPPED IN A GAS STATION TO CHECK THE PRESSURE AND THE RIGHT REAR TIRE HAD NOT ENOUGH PRESSURE, I CHECKED THE REST OF THE TIRES AND I HAD TO FILL IT BUT WEREN'T TO MUCH COMPARED WITH THE RIGHT REAR. THIS SITUATION WERE HAPPENING EVERY WEEK, THE SAME SITUATION, I'M REGULARLY HAD TO STOP IN A GAS STATION TO FILL THE TIRES : (. I WENT TO THE CAR DEALER TO LET THEM KNOW MY CONCERN BECAUSE I THOUGHT MY TIRES HAD PROBLEMS, THEY CHECKED OUT AND THERE WAS NOT ANY PROBLEM JUST LOW PRESSURE. THESE SITUATIONS NEVER STOPPED, THE PAST MONTH SEPTEMBER 2018 I WENT TO THE DEALER AGAIN BECAUSE ONE DAY I WENT WITH MY HUSBAND TO DO WORKS THINGS AND MY CAR IT WAS LIKE A BLENDER, I WAS DRIVING AT 60 MPH IN A HIGHWAY AND I HAVE TO DOWN LOW MY SPEED BECAUSE IT LOOKS LIKE I WERE DRIVING IN A IRREGULAR ROAD. AGAIN TO THE DEALER AND THEY DIAGNOSED I HAVE TO REPLACE MY TIRES (WITH LESS THAT 21,000) . THIS IS NOT THE FIRST TIME I HAVE A NEW BRAND CAR BUT IT IS THE FIRST TIME I HAD TO REPLACE MY 4 TIRES WITH LESS THAN THIS TIME. I'M PRETTY SURE SOMETHING IS WRONG WITH TOYOTA, I'M FEELING AFFECTED WITH ALL THIS SITUATION. EVEN I CHANGE MY TIRES THE DASHBOARD TIRES LIGHT IS TURNED ON AGAIN.",
        "vin": "5TDXZ3DC2HS"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/13/2018",
        "dateOfIncident": "10/13/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11140141,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED VEHICLE BRAND NEW, TIRES WORN TO A DANGEROUS LEVEL FROM NORMAL HIGHWAY DRIVING BY 30,000 MILES.",
        "vin": "5TDDZ3DCXHS"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/11/2018",
        "dateOfIncident": "11/02/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139858,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STALLS WHEN ACCELERATING FROM A STOP. HAPPENS ON HIGHWAY STOP AND GO AND WHEN ENTERING A JUNCTION AFTER A STOP SIGN. AFTER THE STALL THE CAR JERKS AS IT SUDDENLY LACKS TORQUE AND GOES TO A LOWER GEAR.  TOYOTA TECHNICIAN SAID THAT TRACTION CONTROL SHUTS OFF FUEL. THIS IS DANGEROUS SINCE IT LEAVES YOU STALLED AFTER GOING INTO A JUNCTION.  THEY ISSUED A TSB 0197-17 THAT DIDN'T SOLVE THE PROBLEM AND THEY CLAIM THAT THERE IS NO PROBLEM AND THAT IT IS A DRIVING STYLE ISSUE.",
        "vin": "5TDYZ3DC6HS"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/04/2018",
        "dateOfIncident": "08/10/2018",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11124206,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HUSBAND LOST CONTROL OF THE CAR DRIVING 75 MILED PER HOUR ON HIGHWAY.   \"AWD BRAKE OVERRIDE. CONTACT DEALERSHIP\" CAME ON A GAUGE.  PULLED OFF SIDE OF I-95 AND CAR SHOOK AND CAME TO A COMPLETE HAULT AFTER MAKING A LOUD GRINDING NOISE.  WE IMMEDIATLEY NOTICED FIRE COMING FROM UNDER THE HOOD ON DRIVER SIDE.  EVACUATED, CALLED 911.  CAR WAS A TOTAL LOSS.  PLEASE GET TOYOTA TO INVESTIGATE SINCE THIS IS NOT THE FIRST 2017 TOYOTA SIENNA TO CATCH ON FIRE IN THE SAME MANNER.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/30/2018",
        "dateOfIncident": "12/20/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11123467,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DOOR WAS NOT INSTALLED PROPERLY AND CLOSED BY ITSELF MANY TIMES WITHOUT DETECTING IF PEOPLE WERE IN THE WAY AND CRUSHED A CHILD AND HE WAS INJURED",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "08/22/2018",
        "dateOfIncident": "08/21/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121589,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I DON'T HAVE A QUALITY ISSUE.  MY PROBLEM IS THE HEADRESTS THAT HAVE TO MEET NHTSA REQUIREMENTS.  WHEN I DRIVE MY CAR, THE HEADRESTS KILL MY NECK!  I'M NOT EVEN UNDER A DOCTOR'S CARE, BUT I MAY HAVE TO BE, IF I KEEP THIS VEHICLE AS LONG AS I EXPECT TO.  PLEASE CONSIDER REVISING THE HEADREST REQUIREMENTS.  I THINK THERE MAY BE AN UNTOLD NUMBER OF CONSUMERS WITH NECK AND SPINAL PROBLEMS DUE TO THIS MANDATE.",
        "vin": "5TDKZ3DC9HS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/22/2018",
        "dateOfIncident": "08/10/2018",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121773,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE DRIVING SOUTH ON I-95 AT 4 O'CLOCK IN THE MORNING HEADING TO VACATION IN MYRTLE BEACH.  2 HOURS INTO OUR DRIVE AT 6 AM, DRIVER STATED THAT SOMETHING WAS GOING ON WITH THE CAR. FELT LIKE HE WAS LOSING CONTROL OF THE CAR . I LOOKED OVER AND SAW A GAUGE THAT READ AWD BRAKE OVERRIDE CONTACT DEALERSHIP. IT STARTED TO SLOW DOWN EVEN MORE SO HE PULLED OFF TO THE SIDE OF THE ROAD AND WHEN HE DID THE CAR SHOOK AND VIBRATED AND MADE A LOUD NOISE. WHEN THE CAR CAME TO A STOP SMOKE WITH SEEN COMING FROM UNDERNEATH THE HOOD. AND THEN A SECOND LATER A FLAME SHOT OUT FROM UNDERNEATH THE HOOD. IT ALL HAPPENED SO QUICKLY. I TOLD EVERYBODY TO GET OUT OF THE CAR THAT THE CAR WAS ON FIRE. I GRABBED MY PHONE AND MY PURSE AND JUMPED OUT AND CALLED 911. FIRE ENGINE SHOWED UP AND PUT OUT THE FIRE. THE CAR WAS A TOTAL LOSS. THE FIRE WAS SUPER FAST.",
        "vin": "5TDDZ3DC7HS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "08/13/2018",
        "dateOfIncident": "08/09/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11119600,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS TURNED OFF AND IN \"PARK\". VEHICLE APPARENTLY SLIPPED OUT OF \"PARK\" ON ITS OWN AND BEGAN ROLLING OUT OF GARAGE, DOWN AN INCLINED DRIVEWAY, ACROSS AN ALLEY, AND INTO A NEIGHBORING FENCE.",
        "vin": "5TDYZ3DC4HS"
    },
    {
        "components": "SEATS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/02/2018",
        "dateOfIncident": "08/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115424,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE WE BOUGHT THE VEHICLE THERE HAS BEEN A SHAKING AND BANG NOISE FROM THE THIRD SET ROW AND PASSAGER SEAT IN SECOND ROW AND GLOVE BOX. THE ARLINGTON VA DEALER FIXED IT NINE MONTHS LATER BUT THE NOISE AND SHAKING RETURNED YESTERDAY AT THE DEALER IN BOWIE MARYLAND THE TOLD US IT WAS A NORMAL CHARACTERISTICS ISSUE JUST WITH OUR VAN NO OTHER COMPLAINTS WERE ISSUED. THE TRIED TO FORCE US TO TAKE THE VAN BEFORE IT WAS FIXED AND TOOK THE RETAL CAR BACK WHICH LEFT US WITH NO VEHICLE. MY CASE NUMBER IS 108011842. JUST WANT IT FIXED NOT THE RUDE UNSATISFIED SERVICE FROM THE OWNER HIMSELF AND TOM THE SERVICE MANAGER.",
        "vin": "5TDKZ3DC5HS"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/30/2018",
        "dateOfIncident": "07/22/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114698,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "JULY 22 2018 AFTERNOON. I WAS DRIVING THE SIENNA 2017 ON A HIGHWAY IN SPEED 70MPH IN THE ECT MODE WITH MY WIFE AND  KIDS. IT SEEMED EVERYTHING NORMAL AT THE BEGINNING. WHEN I WAS PRESSING GAS PEDAL  THE CAR DID NOT ACCELERATE AT ALL. ON THE CONTRARY, THE MINI-VAN WAS SLOWING DOWN. I BECAME NERVOUS SINCE THAT WAS A 3 LANES HIGHWAY, I WAS IN LEFTIST LANE AND THERE WAS NARROW CUBE AND DID NOT HAVE ENOUGH SPACE TO STOP.    I PRESSED GAS PEDAL HARDER, AND ENGINE GOT TO 6000 RPM HOWEVER THERE WAS NO POWER AT ALL. WHAT MADE ME MORE NERVOUS WAS THAT THE DISPLAY DID NOT SHOW THE TRANSMISSION INDICATOR AT ALL. THE DISPLAY SUPPOSES ALWAYS SHOW THE TRANSMISSION INDICATOR SUCH AS P/N/D'.  HOWEVER, AT THAT TIME THE DISPLAY DID NOT SHOW ANY OF THAT, THE DISPLAY AREA WAS BLANK. I ALSO PULLED THE SHIFT HANDLER BACKWARD TO MAKE SURE THE GEAR WAS ON 'D' , INSTEAD OF 'N'. THAT DID NOT HELP.     I ASKED MY WIFE TO TURN ON THE EMERGENCY LIGHT SINCE I HAD TO FOCUS TO CONTROL THE CAR. I WAS DOING PRESSED/RELEASE GAS PADDLE REPEAT AND IT PROVIDED A LITTLE BIT POWER TO THE CAR. I MANAGED SWITCHED TO THE RIGHTEST LANES   AND GET TO A CLOSED EXIT. I STOPPED THE CAR, OPENED THE FRONT HOOK AND SAW NOTHING WRONG. ONCE I RESTART THE MINIVAN, I SAW THE 'P' SHOWED UP IN THE DISPLAY. I TESTED THE MINI VAN. SEEMED TO ME, IT WAS BACK TO NORMAL. I DROVE WITH EXTRA CAUTION AND FEAR BACK TO HOME.     ALL THIS HAPPENED RIGHT AFTER THE VERY FIRST 5000 MILES SERVICE FOR MY NEW CAR.     TRANSMISSION LOST POWER IN THE HIGHWAY IS VERY DANGEROUS. IT MAY CAUSE FATAL  ACCIDENT.   I AM WORRIED THIS MAY HAPPY AGAIN IN THE FUTURE. I AM SCARED TO DRIVE THIS CAR IN A HIGHWAY WITH MY FAMILY. I REQUEST THIS TO BE INVESTIGATED TO PREVENT IT FROM HAPPENING AGAIN.",
        "vin": "5TDKZ3DC3HS"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/21/2018",
        "dateOfIncident": "07/16/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112804,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "INSTRUMENT PANEL GAUGES HARD OR IMPOSSIBLE TO READ DURING DAYTIME HOURS UNLESS FULL SUN IS OUT. CAN NOT SEE THE SPEEDOMETER NOR OTHER INDICATIONS. INSTRUMENT PANEL LIGHTING COME ON WHEN HEADLIGHTS OR PARKING LIGHTS ON, BUT AT DAY TIME WHEN THEY ARE OFF, THE TERRIBLY DESIGNED DARK CLUSTER IS IMPOSSIBLE TO SEE. DUE TO THE DARK DESIGN OF THE CLUSTER, I RECOMMEND THAT THE VEHICLE  CLUSTER ILLUMINATION TO BE ON AT ALL TIMES DURING VEHICLE OPERATIONS REGARDLESS THE POSITION OF THE HEADLIGHT SWITCH.",
        "vin": "5TDKZ3DC3HS"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "07/04/2018",
        "dateOfIncident": "05/08/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11109515,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE WAITING IN TRAFFIC ON A COUNTY ROAD TO TURN LEFT, OUR SIENNA WAS HIT FROM BEHIND BY A CAR TRAVELING AT APPROXIMATELY 40 MPH. FRONT ROW SEATBELTS DID NOT ENGAGE, NOR DID FRONT AIRBAGS DEPLOY.  OUR SIENNA HIT THE STOPPED VEHICLE IN FRONT OF US UPON IMPACT AS WELL. ONLY RIGHT SIDE CURTAIN AIRBAGS DEPLOYED AND MIDDLE ROW SEATBELTS RESTRAIN.  THIS RESULTED IN MULTIPLE INJURIES TO THE FRONT ROW PASSENGERS, INCLUDING A SEVERE CONCUSSION.",
        "vin": "5TDDZ3DC3HS"
    },
    {
        "components": "STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/01/2018",
        "dateOfIncident": "06/29/2018",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11105014,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE INTERSTATE AT APPROXIMATELY 65 MILES PER HOUR. MY 'CHECK ALL WHEEL DRIVE SYSTEM' WARNING ALARM CAME ON SHORTLY FOLLOWED BY THE: CHECK ENGINE, BATTERY ALARM, COLLISION BREAKING SYSTEM, ETC. I'M CERTAIN THERE WERE MORE ALERTS GOING OFF; HOWEVER I WAS TRYING TO STEER A CAR, THAT HAD LOST POWER OFF THE ROADWAY. I WAS ABLE TO GET THE CAR SAFELY ONTO THE SHOULDER WHERE I ATTEMPTED TO TURN OFF THE VEHICLE. I COULDN'T TURN THE CAR OFF UNTIL I REALIZED I NEEDED THE CAR TO BE IN PARK. AFTER I TURNED THE CAR OFF I NOTICED BLACK SMOKE COMING FROM THE ENGINE AND COULD SMELL SOMETHING BURNING. I OPENED THE DOOR & GOT MY THREE YEAR OLD SON OUT OF THE CAR & NOTICED MORE BLACK SMOKE. I QUICKLY DISTANCED MYSELF FROM THE VEHICLE & NOTICED FIRE COMING FROM THE ENGINE. I CALLED 911 BUT THE CAR WAS ENGULFED IN FLAMES WITHIN MINUTES. THE FIRE DEPARTMENT RESPONDED WITHIN 5 MINUTES & WERE ABLE TO EXTINGUISH THE FIRE.  *JS",
        "vin": "5TDDZ3DC1HS"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/13/2018",
        "dateOfIncident": "06/12/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101665,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 TOYOTA SIENNA. WHILE DRIVING 50 MPH, A LOUD ABNORMAL NOISE WAS HEARD FROM THE ROOF AREA. THE CONTACT PULLED THE VEHICLE OVER TO THE SIDE OF THE ROAD, SLID OPEN THE SUN ROOF COVER, AND NOTICED THAT THE GLASS WAS SHATTERED. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE DEALER (SUNSHINE TOYOTA, 1355 W DICKMAN RD, BATTLE CREEK, MI 49037, (269) 965-1000) WAS CONTACTED AND STATED THAT THE FAILURE NOT UNDER WARRANTY AND THAT AN APPOINTMENT WOULD NEED TO BE SCHEDULED FOR DIAGNOSTIC TESTING AND REPAIRS. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 5,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/21/2018",
        "dateOfIncident": "05/20/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097153,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE INSIDE TIRE WEAR AT ONLY 35,000 MILES, SCALLEPED PATTERN ON ALL FOUR TIRES.  ALL PRIOR SERVICE COMPLETED BY TOYOTA CARE/TOYOTA DEALER, EVERY 5,000 MILES, WITH NO REPORTING OF A PROBLEM TO OWNER.  A) ALINGNMENT PROBLEM FROM FACTORY, AND B) NO EVALUATION BY SERVICE PROFESSIONALS OR REPORT OF CONDITION TO OWNER.   I WOULD NOT BE AWARE OF THIS PROBLEM IF I DID NOT DO THE 35,000 MILE SERVICE MYSELF.   THE PROBLEM IS A SAFETY ISSUE AND SEVERE ENOUGH THAT TIRES HAVE TO BE REPLACED.",
        "vin": "5TDDZ3DC3HS"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/11/2018",
        "dateOfIncident": "05/07/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093362,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE MY WIFE WAS DRIVING DOWN A MAJOR 6 LANE FREEWAY GOING 65 ON HER WAY TO WORK ELECTRONICS SHUT DOWN. DASHBOARD, RADIO, LIGHTS ALL ELECTRONICS. LUCKILY,  SHE WAS STILL ABLE TO DRIVE CAR SAFELY TO SHOULDER.WHILE PULLED OVER DASHBOARD, RADIO AND LIGHTS FLICKERED A COUPLE TIMES THEN CAME BACK ON.UNKNOWN CAUSE.",
        "vin": "5TDDZ3DC4HS"
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/19/2018",
        "dateOfIncident": "01/02/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080187,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE TIRE WEAR ON OUTER EDGES.  TIRES WERE ROTATED EVERY 5,000 MILES OR SO, AFTER 20,000 TIRES WERE VERY WORN.  REPLACED AT 30,000, WHICH WAS ACTUALLY WAY PAST WHAT WAS SAFE FOR THEM.  NOW, WITH MICHELIN DEFENDERS, AN ALIGNMENT UPON INSTALLATION (WHICH DID NOT SHOW ANYTHING), AND PROPER TIRE PRESSURE AT 4500 MILES, SAME WEAR IS HAPPENING.  TOYOTA'S RESPONSE WAS THAT IT IS A HEAVY VEHICLE.  WHAT IS IT: TIRES ARE FALSELY LABELED FOR HIGHER MILAGE THAN THEY GET OR ARE THE SIENNA TIRES NOT THE APPROPRIATE SIZE FOR THE WEIGHT OF THE VEHICLE?      ATTACHED PHOTOS:  FRONT WEAR AT 4500 MILES AS COMPARED TO BACK TIRE AND ORIGINAL TIRES AT 30,000.",
        "vin": "5TDZA23C85S"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/07/2018",
        "dateOfIncident": "04/04/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076633,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 TOYOTA SIENNA. WHILE DEPRESSING THE ACCELERATOR PEDAL AFTER A STOP, THERE WAS A HARD JERK AND THE RPMS INCREASED. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT STATED THAT THE FAILURE WAS AN ONGOING ISSUE WITH THE VEHICLE EVER SINCE IT WAS PURCHASED. THE MIRACLE TOYOTA (37048 US-27, HAINES CITY, FL 33844, (863) 956-1123) STATED THAT THE VEHICLE HAD TRANSMISSION FAILURE, WHICH WOULD DISAPPEAR AFTER DRIVING THE VEHICLE FOR AWHILE. WHILE THE CONTACT'S WIFE WAS DRIVING THE VEHICLE, A LOUD WHINING NOISE WAS HEARD. THE CONTACT'S WIFE WAS ABLE TO TURN OFF AND RESTART THE VEHICLE. AFTER A FEW MINUTES, THE NOISE DISAPPEARED. THE CONTACT RESEARCHED THE FAILURE ONLINE AND FOUND A TSB ISSUED BY TOYOTA FOR A SOFTWARE UPDATE. THE VEHICLE WAS TAKEN TO MIRACLE TOYOTA (37048 US-27, HAINES CITY, FL 33844, (863) 956-1123) WHERE IT WAS DIAGNOSED WITH NEEDING THE SOFTWARE UPDATED FOR THE ECU. THE UPDATE WAS PERFORMED, BUT THE FAILURE PERSISTED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND A CASE WAS OPENED. THE APPROXIMATE FAILURE MILEAGE WAS 10.",
        "vin": "5TDXZ3DC7HS"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/07/2018",
        "dateOfIncident": "11/10/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076669,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 TOYOTA SIENNA. WHILE DRIVING 35 MPH, THE RPMS REVVED INDEPENDENTLY AND THE TRANSMISSION SEIZED WITHOUT WARNING. THE VEHICLE WAS TOWED TO SHEEHY TOYOTA OF FREDERICKSBURG (3507 JEFFERSON DAVIS HWY, FREDERICKSBURG, VA 22408, (540) 507-0076) WHERE IT WAS DIAGNOSED THAT A SOFTWARE FAILURE CAUSED THE TRANSMISSION TO SELECT AN IMPROPER GEAR WHILE THE VEHICLE WAS ALREADY IN THE APPROPRIATE DRIVE GEAR. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED CASE NUMBER: 171130377. THE APPROXIMATE FAILURE MILEAGE WAS 14,000.",
        "vin": "5TDYZ3DC6HS"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/07/2018",
        "dateOfIncident": "03/07/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076734,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 TOYOTA SIENNA. WHILE DRIVING APPROXIMATELY 25 MPH, THE VEHICLE HESITATED AND ACCELERATED FORWARD. THE CONTACT STATED THAT THE FAILURE OCCURRED AT LEAST ONCE A DAY FOR THE PAST THREE MONTHS. THE VEHICLE WAS NOT TAKEN TO A DEALER OR AN INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 5,500.",
        "vin": "5TDJZ3DC3HS"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/14/2018",
        "dateOfIncident": "02/12/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072892,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 TOYOTA SIENNA. WHILE THE CONTACT WAS ATTEMPTING TO LATCH HIS SIX YEAR OLD CHILD IN THE REAR MIDDLE SEAT BELT, THE SEAT BELT FAILED TO MOVE. THE CONTACT PULLED THE SEAT BELT HARDER IN ORDER TO MAKE THE SEAT BELT MOVE TO LATCH, AND NOTICED THAT THE FABRIC WAS SHREDDED. THE VEHICLE WAS TAKEN TO TOYOTA CARLSBAD (5424 PASEO DEL NORTE, CARLSBAD, CA 92008, (760) 438-2000). THE CONTACT WAS INFORMED THAT THE SEAT BELT WOULD BE REPAIRED AS A COURTESY. THE DEALER STATED THAT IT LOOKED AS IF THE SEAT BELT HAD BEEN CUT. THE CONTACT STATED THAT THE DEALER WOULD NOT EXPLAIN THE FAILURE OF THE SEAT BELT OR WHEN THE SEAT BELT RETRACTED. THE SEAT BELT FAILURE WAS NOT UNDER WARRANTY.  THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 20,000. THE VIN WAS NOT AVAILABLE. .*BF  *TR",
        "vin": "5TDYZ3DC6HS"
    },
    {
        "components": "STEERING,POWER TRAIN,VISIBILITY,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/11/2018",
        "dateOfIncident": "08/14/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054313,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 TOYOTA SIENNA. CONSUMER WRITES IN REGARDS TO TRANSMISSION ISSUES. *LD CONSUMER SENT ADDITIONAL CORRESPONDENCE. *LD     THE CONSUMER STATED THE STEERING WAS IMPRECISE. THE VEHICLE WANDERED ON THE ROAD. THE HEATER/AC FAN HAD AN ANNOYING NOISE. THE VEHICLE WOULD NOT ACCELERATE IMMEDIATELY UPON DEPRESSING THE PEDAL. THE TRANSMISSION WOULD CONSTANTLY SHIFT UP AND DOWN ON VERY SMALL HIGHWAY INCLINES. *JS",
        "vin": "5TDDZ3DC2HS"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/28/2017",
        "dateOfIncident": "12/22/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057214,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM HAVING TO REPLACE ALL THE TIRES, WITH ONLY 19,903 MILES ON MY AWD 2017 MINIVAN. AT MY 10,000 MILE TOYOTACARE CHECK, THEY DIDN'T ROTATE THE TIRES BECAUSE THEY SAID NO ROTATION NEEDED DUE TO LESS TREAD ON BACK TIRES, SO ALREADY NOTICING UNEVEN WEAR. AT 15000, THEY ONLY ROTATED ONE SIDE. NOW AT 20,000 THEY TELL ME THE FRONT TIRES SHOW INNER SHOULDER WEAR. THEY DID ROTATE. HAD AN INDEPENDENT DOUBLE CHECK. THE TIRES THAT HAD BEEN ON FRONT ARE VERY WORN/SMOOTH ON INNER SIDE, TREAD LESS THAN 5 IN THE MIDDLE. THESE ARE THE TIRES THAT CAME ON THE MINIVAN WHEN I BOUGHT IT, BRAND NEW. THEY ARE RUN FLAT TIRES. THEY COST OVER $1000, AND LASTED LESS THAN 20,000 MILES, AND ONLY 14 MONTHS OF DRIVING. NO SPARE TIRE OR JACK CAME WITH THE VAN, NOR IS THERE SPACE TO CARRY A SPARE, ALMOST FORCING ME TO BUY MORE RUN FLAT TIRES. FROM WHAT I'VE READ RECENTLY, TOYOTA MINIVANS ARE WEARING TIRES OUT MUCH SOONER THAN OTHER MAKES.",
        "vin": "5TDDZ3DC5HS"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/12/2017",
        "dateOfIncident": "12/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054175,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WIFE WAS DRIVING VEHICLE, WHILE TURNING OFF OF A MAIN ROAD WITH VEHICLE IN DRIVE THE VEHICLE STOPPED ACCELERATING WITH FOOT DEPRESSING GAS PEDAL.  PULLED VEHICLE OVER, TURNED ON AND OFF COUPLE OF TIMES, EACH TIME SHIFTING FROM PARK TO DRIVE AND ATTEMPTING TO ACCELERATE, BUT VEHICLE HAD NO RESPONSE.  I CAME TO SWITCH VEHICLES AND SEND HER HOME WITH THE KIDS.  I STARTED VEHICLE AND ATTEMPTED DRIVE AND REVERSE, NEITHER OF WHICH RESPONDED.  I THEN SWITCHED TO STANDARD TRANSMISSION MODE, THE VEHICLE THEN WOULD DRIVE AND I TOOK IT HOME.  I TURNED VEHICLE OFF AND ON, ATTEMPTED DRIVE AND REVERSE IN AUTOMATIC TRANSMISSION MODE, AND THE VEHICLE WAS WORKING FINE AGAIN AS IF NOTHING EVER HAPPENED.  TOOK VEHICLE TO DEALER, THEY COULD NOT \"DUPLICATE THE PROBLEM\" AND THE VEHICLE PASSED HEALTH CHECK.  APPARENTLY THE ISSUE RESET ITSELF WHEN I SWITCHED THE TRANNY FROM AUTO TO STANDARD.  NO FIX HAS BEEN IMPLEMENTED.  THIS OCCURRED AT 2122 MILES.  THEN JUST TODAY I WAS DRIVING DOWN THE ROAD AND THE HEATER CAME ON FULL BLAST, TEMP. READING 77, ALL ON ITS OWN WITHOUT ME TOUCHING ANYTHING.  WILL BE TAKING IT TO DEALER TODAY.",
        "vin": "5TDJZ3DCOHS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/09/2017",
        "dateOfIncident": "11/09/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11044999,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS TAKEN IN FOR NORMAL SERVICE AND WAS TOLD THAT THE TIRES WERE NEEDING TO BE REPLACED AT 20997 MILES.  TIRES WERE ROTATED PROPERLY AND VEHICLE WAS NOT DRIVEN OUTSIDE OF NORMAL CONDITIONS. BRIDGSTONE TURANZA EL400 RUN FLAT TIRES ARE ORIGINAL TIRES.   WINTER TIRES WERE INSTALLED AT ROUGHLY 6000 MILES AND DRIVEN DURING THE 2016 SEASON WINTER UNTIL 11000 MILES.  INSIDE OF BRIDGESTONE TIRES ARE ALMOST TO CORD.  TOYOTA SAYS THAT IT THE TIRE MANUFACTURES ISSUE, AND IT COULD BE AN ALIGNMENT ISSUE YET THE WINTER TIRES SHOW NO ISSUE OF WEARING OUT OF NORMAL WEAR.  THEY STATE THAT IT IS OUR PROBLEM, WE NEED NEW TIRES.  HAVE READ A LOT THAT OTHERS ARE SEEING THIS SAME WEAR ISSUE AND EVEN CALLED ANOTHER GARAGE AND WAS TOLD THAT THIS A MAJOR ISSUE WITH THESE TIRES CONCERNING THE PREMATURE WEAR ON OEE TIRES ON THIS VAN.",
        "vin": "5TDDZ3DC3HS"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "08/15/2017",
        "dateOfIncident": "07/29/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11015328,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "LOST STEERING ABILITY FROM SOME CAUSE AFTER A LANE CHANGE, ON A HIGHWAY, VEHICLE CONTINUED INTO THE SHOULDER AND WOULD NOT ALLOW CORRECTION INTO THE LANE.  POSSIBLE CAUSE IN MY OPINION MAY HAVE BEEN A L. FRONT TIRE BLOW OUT OR A STEERING LINKAGE ISSUE OR POSSIBLY THE STABILITY CONTROL SYSTEM. THE VEHICLE WAS NEW. IF THE TIRE BLEW OUT PRIOR TO THE RESULTING COLLISION, IT WAS EITHER DEFECTIVE OR PICKED UP DEBRIS ON THE HIGHWAY.",
        "vin": "5TDDZ3DC4HS"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/04/2017",
        "dateOfIncident": "06/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11012766,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2017 TOYOTA SIENNA LE DOES NOT ILLUMINATE THE SPEEDOMETER, TACHOMETER AND OTHER GAUGES WHEN THE HEADLIGHTS ARE SET TO THE AUTO OR DRL OFF (LIGHTS OFF/ DAYTIME RUNNING LIGHTS ON) POSITION.  AS A RESULT, UNDER SOME DAYLIGHT DRIVING CONDITIONS, SUCH AS WHEN EXTERIOR CONDITIONS ARE BRIGHT BUT THERE IS NO DIRECT LIGHT ON THE GAUGES, THE SPEEDOMETER IS NOT EASILY VISIBLE.  FOR THE DRIVER TO DETERMINE THE CURRENT SPEED, FUEL LEVEL, ETC., IT CAN TAKE SEVERAL SECONDS FOR THE DRIVER'S EYES TO ADJUST TO THE DARKER INSTRUMENT PANEL AND LONGER IF THE DRIVER IS WEARING SUNGLASSES.  THIS TAKES THE DRIVER'S ATTENTION OFF THE ROAD OR PREVENTS THE DRIVER FROM ACCESSING CRITICAL INFORMATION.      PREVIOUS MODEL YEARS OF THE TOYOTA SIENNA LE, SUCH AS THE 2010, ILLUMINATED THE GAUGES BRIGHTLY WITH THE HEADLIGHTS TURNED OFF.   TO FURTHER ILLUSTRATED THE PROBLEM, ASSUMING THE GAUGES ARE LIT 100% AT NIGHT WITH THE HEADLIGHTS ON, THE 2010 TOYOTA SIENNA LE LIT THE GAUGES 150% WITH THE HEADLIGHTS OFF AND THE 2017 TOYOTA SIENNA LE LIGHTS THEM 0%.  THERE DOES NOT APPEAR TO BE ANYTHING ABOUT THE DESIGN OR CONTRAST OF THE GAUGES THAT HELPS MAKES THEM VISIBLE WITHOUT BACKLIGHTING.  SOME OTHER TOYOTA SIENNA MODELS HAVE A WHITE BACKGROUND ON THE GAUGES WHICH MAKES THEM VISIBLE IN DAYLIGHT.    NOTE THAT THE VEHICLE HAS A GAUGE DIMMER CONTROL THAT REDUCES THE BRIGHTNESS OF THE GAUGES WHEN THE HEADLIGHTS OR PARKING LIGHTS ARE ON.  THIS CONTROL HAS NO EFFECT WHEN THE HEADLIGHTS ARE SWITCHED TO DRL OFF OR AUTO (UNDER DAYLIGHT CONDITIONS).  IN OTHER WORDS, THERE IS NO METHOD OF BRIGHTENING THE GAUGES WITHOUT TURNING ON THE HEADLIGHTS IN THE DAY TIME.  AND EVEN THEN, THE GAUGES ARE NOT BRIGHT ENOUGH FOR ALL CONDITIONS.    PLEASE INVESTIGATE.  THE MANUFACTURER SHOULD BE REQUIRED TO CORRECT THIS DESIGN FLAW TO PROTECT THE SAFETY OF THE VEHICLE OCCUPANTS.",
        "vin": "5TDKZ3DC9HS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/25/2017",
        "dateOfIncident": "05/05/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010601,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SMELLED OF GAS FROM THE TIME I BOUGHT IT (NEW) AFTER IT WAS STARTED AND IT WAS DRIVEN FOR A FEW MILES. SITTING OVERNIGHT, THE SMELL WOULD DISSIPATE, BUT THE SAME THING HAPPENED EACH DAY -- STRONG GAS SMELL AFTER A FEW MILES OF DRIVING . COLDER WEATHER, THE SMELL WAS MORE PRONOUNCED. DEALER DIDN'T SEE ANY DRIPPING GAS, SO SENT ME HOME TWICE WITHOUT REPAIRS BEING DONE. AFTER THEY KEPT IT OVERNIGHT, THEY SMELLED THE SMELL IN THE MORNING AND ONLY THEN DECIDED TO CALL TOYOTA WHO SAID THERE HAS BEEN A FEW PROBLEMS WITH INJECTOR SEALS. IT WAS REPAIRED AND IS FINE NOW. MY DAUGHTER'S FRIEND HAD THE SAME 2017 SIENNA AND IT CAUGHT FIRE ON THE HIGHWAY AND EXPLODED --- MY GUESS IS THAT THERE IS A VERY SERIOUS ISSUE HERE THAT NEEDS TO BE ADDRESSED.",
        "vin": "5TDDZ3DC9HS"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/21/2017",
        "dateOfIncident": "07/15/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006682,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT A 2017 SIENNA AWD ON 7/15 FROM VENTURA TOYOTA . ALTHOUGH THE SALESMAN THERE WAS CONFUSED WHETHER IT HAD A SPARE TIRE, MY BEEF IS WITH THE MANUFACTURER WHO DOESN'T SHOW THE LACK OF A SPARE IN THEIR SALES BROCHURE. THEY STATE THAT THEY HAVE RUN FLAT TIRES AND THEY HAVE NO ROOM FOR A SPARE TIRE. THE TIRES THEY PROVIDE ON THIS NEW VAN ARE BRIDGESTONE TURANZA EL400-02 . THESE TIRES ARE REPORTED TO HAVE A TREAD MILEAGE LIMIT OF ABOUT 15,000 MILES AND HAVE NO WARRANTY ON TREAD.   I WOULD NOT HAVE BOUGHT THE VAN IF I KNEW IT DIDN'T HAVE A SPARE TIRE OR THAT I COULD NOT BUY AND USE A DONUT TIRE, IF NECESSARY.  TOYOTA HEADQUARTERS INFORMED ME THAT USING A DONUT SPARE OR CHANGING TO CONVENTIONAL TIRES WOULD VOID THE WARRANTY ON ANY PART THEY FELT IT AFFECTED. AFTER TALKING TO A FEW TIRE DEALERS I FIND THE TIRES THEY USE HAVE BEEN A PROBLEM AND HAS SINCE BEEN REPLACED WITH BRIDGESTONE DRIVEGUARD WHICH DOES HAVE A TREAD WARRANTY. I'VE REQUESTED A CREDIT FOR THESE TIRES FROM TOYOTA HEADQUARTERS AND HAVE BEEN REJECTED. TOYOTA HAS NOT INFORMED PROSPECTIVE BUYERS OF THIS FLAW OR HAVE THEY REPLACED THESE TIRES THAT DON'T MEET TREAD EXPECTATIONS.",
        "vin": "5TDDZ3DC2HS"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/20/2017",
        "dateOfIncident": "07/16/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006495,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 TOYOTA SIENNA. THE CONTACT STATED THAT WHILE THE ACCELERATOR PEDAL WAS DEPRESSED, THE VEHICLE FAILED TO RESPOND. IN ADDITION, THE VEHICLE WAS SHIFTED INTO PARK THEN INTO THE DRIVE POSITION AND RESTARTED THE VEHICLE BUT STILL THE VEHICLE FAILED TO RESPOND. THE CONTACT MENTIONED THE ACCELERATOR PEDAL WAS DEPRESSED WITH FORCE AND THE VEHICLE STARTED TO OPERATE HOWEVER, AN ABNORMAL GRINDING NOISE WAS COMING FROM UNDERNEATH THE VEHICLE. THE VEHICLE WAS TOWED TO A BILL FOX TOYOTA AT 755 S ROCHESTER RD, ROCHESTER HILLS, MI 48307 WHERE THE FAILURE WAS UNDETERMINED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THAT APPROXIMATE FAILURE MILEAGE WAS 2,873.",
        "vin": "5TDDZ3DC0HS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/07/2017",
        "dateOfIncident": "02/07/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993746,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "A FEW WEEKS AFTER WE PURCHASED OUR BRAND-NEW TOYOTA SIENNA, THE BLIND SPOT RECOGNITION TECHNOLOGY STOPPED WORKING.  WHEN I TOOK THE SIENNA TO A TOYOTA SERVICE CENTER, A SERVICE ADVISOR SHOWED ME THAT OUR SIENNA HAD BEEN SIDE-SWIPED, UNBEKNOWNST TO ME, AND THAT IT WAS THAT EXTERIOR DAMAGE THAT COMPROMISED THE BLIND SPOT RECOGNITION TECHNOLOGY.  WHEN I ARRIVED AT THE TOYOTA SERVICE CENTER, A SERVICE ADVISOR INSPECTED THE EXTERIOR OF THE VEHICLE TO NOTE ANY PREEXISTING DAMAGE, AND EVEN THAT SERVICE ADVISOR DIDN'T NOTICE THE DAMAGE (THIS IS HOW MINOR THE EXTERIOR DAMAGE IS: THE PERSON WHOSE JOB IT IS TO INSPECT THE EXTERIOR OF VEHICLES DIDN'T NOTICE THE SCRATCH THAT APPARENTLY KNOCKED OUT AN ENTIRE SAFETY FEATURE).  IT SEEMS THAT THE BLIND SPOT RECOGNITION TECHNOLOGY WAS BUILT TO BE EXTREMELY VULNERABLE.  EXTERIOR PHYSICAL DAMAGE THAT IS BARELY VISIBLE TO THE NAKED EYE WAS ENOUGH TO MAKE THE ENTIRE BLIND SPOT RECOGNITION TECHNOLOGY BREAK COMPLETELY.  WHY ISN'T THIS FEATURE BETTER PROTECTED?  FURTHERMORE, THOUGH ONLY ONE COMPONENT OF THE SYSTEM IS COMPROMISED, THE ENTIRE SYSTEM IS UNUSABLE.",
        "vin": "5TDDZ3DC7HS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/05/2017",
        "dateOfIncident": "04/05/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970814,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LEFT REAR WINDOW SHATTERED WHILE AT A STOP LIGHT, NOTHING HIT THE WINDOW OR ANYTHING BUT IT SHATTERED. THE VEHICLE WAS STATIONARY, RUNNING AND STOPPED AT A STOP LIGHT WAITING TO TURN. I HAVE REASON TO BELIEVE THE AIR COMPRESSOR IN THE WINDOW HAD TOO MUCH PRESSURE AND EXPLODED. AT HIS TIME THE VEHICLES HAS NOT BEEN ASSESSED FURTHER .",
        "vin": "5TDYZ3DC1HS"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/01/2017",
        "dateOfIncident": "11/30/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10969881,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SPEEDOMETER IS NOT LIGHTED DURING DAYLIGHT UNLESS THE HEADLIGHTS OR DRIVING LIGHTS ARE ON.  THIS MAKES IT VERY DIFFICULT TO DETERMINE YOUR VELOCITY.  IF YOU SPEND TOO MUCH TIME TRYING TO SEE THE SPEEDOMETER IT IS A SAFETY HAZARD.  IT IS ALSO A HAZARD NOT KNOWING IF YOU ARE DRIVING TOO FAST OR TOO SLOWLY.    THE SPEEDOMETER WAS LIGHTED ON MY 2008 SIENNA LE.  THE SPEEDOMETER IS LIGHTED ON THE 2017 SIENNA XLE.   TO INTRODUCE SUCH A SAFETY HAZARD ON THE LOWER PRICE MODEL SEEMS REALLY INAPPROPRIATE.",
        "vin": "5TDKZ3DC5HS"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "03/30/2017",
        "dateOfIncident": "02/16/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10969642,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2016 SIENNA WHICH WE PURCHASED LAST MAY ACCELERATED ON IT'S OWN ON 2/16/2017 GOING THROUGH OUR SOUTH OUTSIDE WALL AND MASTER BATHROOM OF OUR HOUSE. MY HUSBAND LEFT THE VAN IN THE DRIVEWAY, UNLOADED THE GROCERIES, THEN GOT BACK INTO THE VAN, STARTED IT, PUT HIS FOOT ON THE BRAKE, SHIFTED TO DRIVE AND WITH HIS FOOT ON THE BRAKE THE VAN ACCELERATED INTO THE THE GARAGE. WE HAVE AN EXTENDED GARAGE WHICH HAD AN OFFICE AREA AND IT PROCEEDED TO PUSH THE OAK DESK THROUGH THE SOUTH EAST OUTSIDE WALL AND MASTER BATH. AS IT CONTINUED TO ACCELERATE AND BURN RUBBER ON OUR FINISHED GARAGE FLOOR,  WITH HIS FOOT STILL ON THE BRAKE SLAMMED IT INTO REVERSE. THE SIENNA SHOT OUT OF THE GARAGE, HEADED DOWN OUR DRIVE, INTO OUR LAWN AND OVER OUR WINTER SNOW STAKES. KNOWING IT WAS NOT STOPPING AND THE BRAKES WERE NOT WORKING OTHER THAN LETTING HIM PUT THE CAR INTO GEAR, HE ONCE AGAIN SLAMMED IT INTO DRIVE. THE SIENNA SHOT INTO THE GARAGE A SECOND TIME, HITTING THE S. E. WALL AND YET AGAIN CONTINUED TO BURN RUBBER ON OUR FLOOR AS IT PUSHED THE DESK FURTHER THOUGH THE WALL. ONCE AGAIN, COMPLETELY BESIDE HIMSELF MY HUSBAND SLAMMED IT INTO REVERSE AND WHEN OUTSIDE IT FINALLY STOPPED AFTER HE STOMPED ON THE BREAKS WITH ALL HIS MIGHT! THE AIR BAG DID NOT DEPLOY NOR DID THE BRAKES EVERY BEGIN TO WORK TO SLOW IT DOWN. WE WILL NEVER DRIVE THIS VEHICLE AGAIN AND IT IS BEING STORED AT CARLSON TOYOTA UNTIL WE KNOW WHAT TOYOTA HEADQUARTERS INTENDS TO DO ABOUT THIS PROBLEM. WE ALSO NEED TO KNOW WHAT WE ARE TO DO BEINGS OUR SIENNA WAS PAID FOR AND NOW IT IS WORTHLESS TO US.",
        "vin": "5TDKK3DC5GS"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/13/2017",
        "dateOfIncident": "03/13/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10960438,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A SAFETY DESIGN FLAW IN THIS VEHICLE.  THE DASHBOARD INSTRUMENT LIGHTS WILL NOT LIGHT UP IN THE DAYTIME MAKING IT VERY DIFFICULT TO READ THE SPEEDOMETER AND OTHER INSTRUMENTS RESULTING IN DISTRACTED DRIVING.   TOYOTA REFUSES TO CORRECT THIS DESIGN FLAW.",
        "vin": "5TDKZ3DC7HS"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/15/2017",
        "dateOfIncident": "02/12/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954898,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FRIDAY, 2/10/17, OUR 5 MONTH OLD SIENNA WAS DRIVEN INTO OUR SECURE GARAGE AND PARKED.  NOTHING WAS OUT OF THE ORDINARY.  ON SUNDAY, 2/12/17, THE VAN WAS FOUND WITH THE RIGHT SIDE REAR GLASS EXPLODED ON THE GROUND AND INSIDE THE VEHICLE.  THE VAN HAD NOT BEEN TOUCHED BY ANYONE.  I HAVE HOME SECURITY CAMERA FOOTAGE CONFIRMING THAT THE GLASS WAS INTACT WHEN PARKED AND THAT NOBODY OTHER THAN MYSELF HAD SET FOOT IN THE GARAGE DURING THE TIME IN QUESTION.    ONLY BY CHANCE HAD I POSITIONED OUR CHILDREN'S CAR SEATS TO THE LEFT SIDE OF THE BENCH SEAT AND THE SEATS WERE NOT OCCUPIED AT THE TIME THE GLASS FAILED.  OTHERWISE I WOULD HAVE BEEN REMOVING GLASS FRAGMENTS FROM MY KID'S LAP, FACE, EARS, EYES  MOUTH, ETC..  I FEEL VERY LUCKY BUT HAVE LITTLE CONFIDENCE THAT THIS WILL NOT HAPPEN AGAIN.      SO FAR, THE TOYOTA DEALERSHIP WHERE THE SIENNA WAS PURCHASED HAS BEEN UNWILLING TO COVER THIS UNDER WARRANTY OR ACKNOWLEDGE THIS IS A MANUFACTURER OR INSTALLATION FLAW BUT THEY ARE WILLING TO FIX IT IF I PAY THEM $790.",
        "vin": "5TDYZ3DC6HS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/13/2017",
        "dateOfIncident": "01/10/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954287,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "NAVIGATION SYSTEM  THE INSTALLED NAVIGATION SYSTEM ON TOYOTA SIENNA MODELS DOES NOT INDICATE THE DESTINATION SIDE OF THE ROAD.  IN OTHER WORDS, THERE IS AN AUDIO INDICATION \"YOU HAVE REACHED YOUR DESIGNATION\" BUT IT DOES NOT INDICATE WHICH SIDE OF THE ROAD IT IS.    THIS IS A REAL SERIOUS SAFETY RISK -- SUDDENLY THE DRIVER HAS TO TRY TO CHANGE LANES, SLOWING DOWN, TO TRY AND FIND THE DESTINATION, THEREBY RISKING BEING REAR-ENDED WHILE TRYING TO MANEUVER OUT OF THE CURRENT LANE.  ALL NAVIGATION SYSTEMS SHOULD BE REQUIRED TO STATE THIS INFORMATION.  EVEN HAND-HELD GPS SYSTEMS GIVE THIS VITAL INFORMATION.  TOYOTA HQ SAID THERE IS NO PLAN ON FIXING THIS PROBLEM.",
        "vin": "5TDYZ3DC3HS"
    },
    {
        "components": "VISIBILITY,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "01/27/2017",
        "dateOfIncident": "01/12/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10948030,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 TOYOTA SIENNA. WHILE DRIVING, THE WINDSHIELD RESEMBLED A MAGNIFYING GLASS APPROXIMATELY SIX TO EIGHT INCHES ABOVE THE DASHBOARD. THE ISSUE CAUSED THE DRIVER TO EXPERIENCE DIZZINESS AND HEADACHES WHILE DRIVING. IN ADDITION, WHILE DRIVING APPROXIMATELY 65 MPH, THE REAR DRIVER SIDE DOOR OPENED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE WINDSHIELD HAD A THIRD DIMENSIONAL MAGNIFYING GLASS, WHICH WAS A MANUFACTURER'S DEFECT THAT COULD NOT BE RECTIFIED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 1,800.",
        "vin": "5TDXZ3DC6HS"
    }
]