[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/29/2021",
        "dateOfIncident": "03/09/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405346,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SEQUOIA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "LOWER FUEL PUMP FAILS AT HIGH SPEED OR IN COLD WEATHER I WAS TOLD BY TOYOTA SERVICE.",
        "vin": "5TDJW5G1XHS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/22/2021",
        "dateOfIncident": "03/21/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404355,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SEQUOIA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SHOOK AT 50 MILES PER HOUR AND ABOVE,  CHECK ENGINE AND 4 LO LIGHTS FLASHED.  TOOK TO MECHANIC AND WAS TOLD FUEL PUMP NEEDS REPLACING.  TOYOTA ADVISED THAT MY VIN WAS NOT PART OF THEIR CURRENT RECALL.",
        "vin": "5TDBW5G15HS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/21/2020",
        "dateOfIncident": "11/20/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375684,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SEQUOIA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SPONTANEOUSLY SHATTERING SUNROOF. THE SUNROOF SPONTANEOUSLY SHATTERED WHILE I WAS DRIVING.",
        "vin": "5TDDY5G10HS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/05/2020",
        "dateOfIncident": "11/22/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316285,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SEQUOIA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TRAVELING ON THE FREEWAY AT 65-70MPH THERE IS A WHISTLING OR METAL TO METAL SOUND THAT HAPPENS ON THE LEFT SIDE OF THE CAR. I CAN'T TELL IF IT'S IN THE WINDSHIELD OR THE FRAME AREA.   ALSO THERE IS A CONSTANT SQUEAK ON THE RIGHT CORNER OF THE WINDSHIELD  AT THE DASHBOARD",
        "vin": "5TDZY5G10HS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/07/2019",
        "dateOfIncident": "04/30/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205971,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SEQUOIA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 TOYOTA SEQUOIA. THE CONTACT STATED THAT WHEN THE VEHICLE WAS POWERED OFF, THE ENGINE CONTINUED TO RUN. THERE WAS NO WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO PALMER'S TOYOTA SUPERSTORE (LOCATED AT 470 SCHILLINGER RD, MOBILE, AL 36695, (251) 639-0800) WHERE THE CONTACT WAS INFORMED THAT A LOW BATTERY WAS CAUSING THE FAILURE. THE CONTACT INFORMED THE DEALER THAT HE HAD JUST CHARGED THE BATTERY BEFORE BRINGING IT TO THE DEALER BECAUSE THE FAILURE CAUSED IT TO DRAIN. THE VEHICLE WAS NOT REPAIRED AND THE FAILURE RECURRED. THE VEHICLE WAS NOT TAKEN BACK TO THE DEALER. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 52,000.",
        "vin": "3MYDLBYV3HY"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "11/17/2018",
        "dateOfIncident": "07/12/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11152216,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SEQUOIA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JULY 12, 2017, I HAD BACKED UP MY 2017 TOYOTA SEQUOIA TO A FAMILY MEMBER'S HOUSE AND THEN PUT THE VEHICLE IN PARK, BUT LEFT IT RUNNING. MY THREE CHILDREN REMAINED INSIDE THE VEHICLE, SEATED AND BUCKLED. I EXITED THE VEHICLE TO WALK TO THE BACK AND PUT A BOX IN THE BACK AND WHEN I TURNED AROUND, THE VEHICLE HAD SUDDENLY ACCELERATED AND WAS SPEEDING AWAY. THE VEHICLE STRUCK A SMALL SECTION OF TREES ON THE RIGHT SIDE, WHICH POPPED THE FRONT PASSENGER DOOR OPEN. THE VEHICLE THEN CONTINUED ON UNTIL IT RAN THROUGH TWO FENCES AND INTO THE WOODS BEHIND THE NEIGHBOR'S HOUSE, WHERE IT STRUCK OTHER TREES AND CAME TO A STOP. UPON CATCHING UP WITH THE VEHICLE, THE ENGINE SOUNDED AS THOUGH IT WAS STILL REVVING AND WAS DIGGING RUTS INTO THE GROUND. I OPENED THE DRIVER'S DOOR AND FOUND THE GEAR SHIFT JUST SLIGHTLY OUT OF PARK, WHICH IS NOT WHERE I LEFT IT. I HAD TO FORCEFULLY PUT IT BACK INTO PARK BY HITTING IT AND THEN TURNED THE KEY OFF. THE MOTOR WOUND DOWN WITH A HIGH PITCHED WHINING NOISE. I THEN UNBUCKLED ALL THREE OF MY CHILDREN (AGES 11, 9, AND 5) AND GOT THEM OUT OF THE VEHICLE. THE VEHICLE WAS HEAVILY DAMAGED IN THE FRONT END AND PASSENGER SIDE BUT NO AIRBAGS DEPLOYED. THERE HAD BEEN TWO OTHER INSTANCES OF TROUBLE WITH THIS VEHICLE PREVIOUSLY THAT TOYOTA HAD STATED THEY COULDN'T FIGURE OUT WHAT THE PROBLEM WAS. THE FIRST WAS APPROX 2 WEEKS AFTER PURCHASE WHERE IT WOULD LOSE POWER WHILE DRIVING AND THEN SUDDENLY GET IT BACK AND SURGE. THE SECOND OCCURRED IN MARCH 2018 AND THE VEHICLE WOULD SUDDENLY DECELERATE WHILE ON CRUISE CONTROL, EVEN WHEN THERE WERE NO VEHICLES IN FRONT, AND THEN SUDDENLY REACCELERATE. NEITHER TIME TOYOTA COULD PINPOINT A CAUSE OR FIX FOR EITHER BUT THE VEHICLE SUDDENLY WORKED AFTER THEY CHECKED IT OUT. THE EDR REPORT COLLECTED BY TOYOTA CONTAINED A LARGE AMOUNT OF INCORRECT DATA, SUCH AS THE VEHICLE ROLLING OVER WHEN IT DID NOT AND OTHER INFO.",
        "vin": "5TDYY5G11HS"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/20/2018",
        "dateOfIncident": "01/31/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073761,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SEQUOIA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 TOYOTA SEQUOIA. WHILE DEPRESSING THE ACCELERATOR PEDAL, THE VEHICLE FAILED TO ACCELERATE. THE VEHICLE WAS TAKEN TO PRIORITY TOYOTA CHESAPEAKE (1800 GREENBRIER PKWY, CHESAPEAKE, VA 23320) WHERE IT WAS DIAGNOSED THAT RODENTS CHEWED HOLES THROUGH THE WIRING THAT WAS LUBRICATED WITH PEANUT OIL. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VIN WAS UNKNOWN. THE APPROXIMATE FAILURE MILEAGE WAS 6,200.",
        "vin": ""
    }
]