[
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/02/2020",
        "dateOfIncident": "09/02/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11352864,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 TOYOTA YARIS. THE CONTACT STATED THAT WHILE HER DAUGHTER WAS DRIVING, AND STOPPED AT A STOP SIGN, THE VEHICLE WAS REAR-ENDED BY THE VEHICLE BEHIND HER WHICH CAUSED HER VEHICLE TO REAR-END THE VEHICLE AHEAD OF HER. THE VEHICLE WAS DAMAGED AT THE REAR AND THE FRONT, AND WAS TOWED TO A TOW YARD. THE INSURANCE COMPANY WAS YET TO MAKE A FINAL DECISION ON WHETHER THE VEHICLE WAS A TOTAL LOSS. THE AIR BAGS DID NOT DEPLOY. THE DRIVER HIT THE STEERING WHEEL AND SUSTAINED KNEE AND FACE INJURIES THAT REQUIRED MEDICAL ATTENTION.  A POLICE REPORT WAS FILED. THE CONTACT CALLED THE MATTHEWS MOTORS WILMINGTON DEALER (5723 MARKET ST, WILMINGTON, NC 28405) AND WAS TOLD THAT THE INSURANCE COMPANY WOULD BE RESPONSIBLE FOR THE VEHICLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 65,000. THE VIN WAS NOT PROVIDED.",
        "vin": "VNKKTUD34HA"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/09/2019",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230330,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE HAS 21K MILES 2017 BOUGHT NEW AND THE FRONT ROTORS NEED TO BE REPLACED.  I DRIVE LOCAL, AND I AM BEING TOLD HARD STOPS ON BRAKES WILL OVERHEAT THE ROTORS. I DO NOT DRIVE AT 90MPH THEN JAM ON THE BRAKES. I DO NOT DRIVE AT HIGHWAY SPEEDS, CANNOT DRIVE AFTER DUSK. I BELIEVE THE ROTORS ARE DEFECTIVE.  I NOTICE WHEN I DRIVE 10 MILES AND BACK THE ROTORS ARE TO HOT TO TOUCH, THEY ARE OVERHEATING. I CALLED TOYOTA USA AND THEY WILL DO NOTHING FOR ME.  I SHOULD NOT BE REPLACING ROTORS AT 21K MILES. I HAD A 2008 YARIS AND DROVE THAT CAR FOR 5.5 YEARS AND I NEVER REPLACED ROTORS.",
        "vin": "3MYDLBYV2HY"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/07/2019",
        "dateOfIncident": "07/07/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229927,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FIXD SENSOR PICKED UP A B1660 AIRBAG CODE, SEAT DRIVER FRONT UP CIRCUIT OPEN ERROR CODE. BUT MY VIN SAYS THERE ARE NO UNREPAIRED RECALLS.",
        "vin": "VNKKTUD3XHA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/06/2019",
        "dateOfIncident": "05/02/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205886,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 TOYOTA YARIS. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V319000 (AIR BAGS). THE CONTACT STATED THAT FRANK TOYOTA (LOCATED AT 2400 NATIONAL CITY BLVD, NATIONAL CITY, CA 91950, (866) 308-9461) EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND STATED THAT THE PART WAS NOT AVAILABLE FOR THE REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE VIN WAS INVALID.",
        "vin": "VNNKTUD39HA"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/30/2019",
        "dateOfIncident": "04/25/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204667,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 TOYOTA YARIS. AFTER THE VEHICLE WAS STARTED AND SHIFTED INTO GEAR, IT STALLED. THE VEHICLE WAS RESTARTED, PLACED INTO DRIVE, AND THEN STALLED AGAIN. THE VEHICLE WAS TAKEN TO RICK HENDRICK TOYOTA OF FAYETTEVILLE (LOCATED AT 1969 SKIBO RD, FAYETTEVILLE, NC 28314, (910) 498-0110) TO BE DIAGNOSED, BUT THE MECHANIC WAS UNABLE TO RETRIEVE A FAULT CODE OR DUPLICATE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 14,800.",
        "vin": "3MYDLBYV0HY"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "04/10/2019",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195379,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN MOTION ON A CITY STREET, AND INVOLVED IN A COLLISION IN WHICH MY FORWARD COLLISION WARNING SYSTEM AND AUTOMATIC EMERGENCY BREAKING DID NOT ACTIVATE.",
        "vin": "3MYDLBYV7HY"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/27/2019",
        "dateOfIncident": "07/23/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11182735,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 TOYOTA YARIS. WHILE THE VEHICLE WAS IDLING AT A TRAFFIC LIGHT, THE AIR BAG DEPLOYED WITHOUT IMPACT OR WARNING. THE CONTACT ACCELERATED AND CRASHED INTO THE REAR OF ANOTHER VEHICLE. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT SUSTAINED UNKNOWN INJURIES AND MEDICAL ATTENTION WAS RECEIVED. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO AN INDEPENDENT LOT. THE LOCAL DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS CONTACTED AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 12,000.",
        "vin": "3MYDLBYV5HY"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/20/2019",
        "dateOfIncident": "01/05/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171017,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SHUTS ON AND OFF, OFF AND ON WHEN STARTING OR WHILE DRIVING.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/08/2018",
        "dateOfIncident": "11/10/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11156977,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY BOUGHT THE CAR FROM THE DEALER AND I TOOK IT BACK TO THEN 4 TIMES FOR THE SAME ISSUE AND THEY SAY IT IS NORMAL. SO MY ISSUE IS WHEN I'M AT A LIGHT AND I'M IN DRIVE OR REVERSE YOU CAN SEE THE RPM JUMP AROUND TO ABOUT 400 TO 700 AND THE CAR STARTS TO VIBRATE SHAKING THE CAR. THE CAR ONLY HAS 23,XXX MILES ON IT.",
        "vin": "3MYDLBYV2HY"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/03/2018",
        "dateOfIncident": "10/03/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133190,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2017",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Toyo Tire Holdings of Americas, Inc.",
                "productMake": "TOYO",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "THE EXACT TIRES/CAR I HAVE WERE NOT LISTED.  THEY ARE: 2017 TOYOTA YARIS IA  TOYO PROXES A27 TIRES    TODAY I WAS DRIVING MY CAR ON SURFACE STREETS. I WAS STOPPED AT A RED LIGHT AND A WARNING CAME ON THAT SAID I HAD LOW TIRE PRESSURE. I PULLED OFF TO THE SIDE OF THE ROAD AT THE NEXT BLOCK TO CHECK MY TIRE PRESSURE AND DISCOVERED MY TIRE WAS COMPLETELY SHREDDED. I HAD ONLY DRIVEN 2 MILES FROM WHERE I HAD STARTED AND MY TIRES WERE FINE WHEN I LEFT.     THIS PARTICULAR PROBLEM HAS OCCURRED TWICE. ONCE ON AUGUST 1ST, 2018 AS I PARKED ON A RESIDENTIAL STREET (THE LOW PRESSURE LIGHT DIDN'T EVEN COME ON AT THIS TIME) AND THE SECOND TIME TODAY, OCTOBER 3RD, 2018. BOTH TIMES I HAVE HAD TO REPLACE THE TIRE BECAUSE IT IS COMPLETELY SHREDDED. I HAVE NEVER SEEN A TIRE EXPLODE LIKE THIS AND I HAVE SEEN IT HAPPEN TWICE OVER THE COURSE OF TWO MONTHS IN A 16 MONTH OLD CAR WITH ONLY 20K MILES ON IT. I HAD A 200K MILE 2002 HONDA AND WHILE IT HAD FLATS ONCE EVERY 5-6 YEARS MAYBE, I NEVER HAD A TIRE EXPLODE LIKE THIS AND I DRIVE LESS NOW THAN I DID WITH MY HONDA. THERE IS CLEARLY SOMETHING WRONG WITH THESE TIRES THAT MAKES THEM SO SUSCEPTIBLE TO SHREDDING LIKE THAT. IT MAKES ME VERY SCARED TO CONTINUE DRIVING. I WORRY THE NEXT TIME THIS HAPPENS I WILL BE ON A FREEWAY OR NOT SOMEWHERE EASY TO PULL OVER TO THE SIDE OF THE ROAD.",
        "vin": "3MYDLBYV1HY"
    },
    {
        "components": "SUSPENSION,VEHICLE SPEED CONTROL,WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/07/2018",
        "dateOfIncident": "06/23/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110026,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR DOES NOT LIKE THE ACCELERATE, WHEN PUSHING THE GAS YOU HAVE TO PUT IT ALL THE WAY TO THE FLOOR AND IT TAKES ABOUT 15 SECONDS TO ACTUALLY ACCELERATE.   AT 40,000 MILES THE REAR SHOCKS WENT OUT, AND THE LEFT REAR TIRE WORE DOWN AND IS BULGING.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/23/2018",
        "dateOfIncident": "10/15/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064397,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER SEVERAL CALLS TO TOYOTA AND SEVERAL DAYS OF REPAIR THEY HAVE YET TO FIX THE ISSUE WITH THE TOYOTA YARIS HAVING THE TIRE SIGNAL TURNING ON NOT ONLY IS IT A WASTE OF MONEY BECAUSE IT TURNS ON EVERY OTHER DAY OR SO AT RANDOM TIMES AND WE HAVE TO TAKE IT AND PAY TO TAKE IT TO GET IT FIXED AGAIN BUT IT ALSO IS A SAFETY HAZARD BECAUSE IT'S HIGHER COULD REALLY BE LOW AND I JUST THINK IT'S MESSING UP AND I GET A FLAT TIRE AND BE STRANDED ON THE SIDE OF THE ROAD FOR HOURS. OR THE TIRE COULD BLOW OUT AND CAUSE ME TO HAVE A WRECK AND I COULD INJURE MYSELF OR THE OTHER PEOPLE IN THE CAR",
        "vin": "3MYDLBYV8HY"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/27/2017",
        "dateOfIncident": "06/23/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11048812,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE HAS BEEN MANY TIMES THAT WHEN I NEEDED THE CAR TO ACCELERATE IT WOULDN'T, NEARLY CAUSING AN ACCIDENT SEVERAL TIMES. WHAT USUALLY HAPPENS IS I WILL COME UP TO A CORNER TO MAKE A TURN AND INSTEAD OF STOPPING I ACCELERATE TO AVOID ONCOMING TRAFFIC ONLY TO HAVE THE CAR HESITATE . SOMETIMES I HAVE HAD TO PUSH THE ACCELERATOR PEDDLE TO THE FLOOR AND EVEN THEN IT TAKES SOME TIME FOR THE CAR TO MOVE FASTER. ALSO I HAVE FOUND THAT IN TRAFFIC I WILL NEED TO ACCELERATE TO AVOID A COLLISION ONLY TO FIND THE CAR DOES NOT DOWNSHIFT AND SEEMINGLY HESITATING. NOW NOT EVERY TIME DOES THIS HAPPEN, BUT IT HAPPENS SPORADICALLY.  THIS DANGEROUS, AND I ASKED THE DEALER TO CHECK OUT THE TRANSMISSION, WHICH THEY DID BUT THEY FOUND NOTHING. IT WAS ON JULY 19, 2017 THAT I TOOK THE CAR TO THE DEALER, LOMBARD TOYOTA CUSTOMER #103445, INVOICE #382304.",
        "vin": "3MYDLBYV9HY"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/16/2017",
        "dateOfIncident": "08/08/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015788,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 TOYOTA YARIS. WHILE MERGING ONTO THE EXPRESSWAY AT APPROXIMATELY 25 MPH, THE VEHICLE DID NOT ACCELERATE AND ALMOST CAUSED A CRASH. THE ACCELERATOR PEDAL WAS DEPRESSED ALL THE WAY DOWN TO THE FLOORBOARD. AFTER APPROXIMATELY 30 SECONDS, THE VEHICLE FINALLY ACCELERATED. THE CONTACT STATED THAT THE VEHICLE ONLY EXHIBITED THE FAILURE WHEN TRAVELING ON AN INCLINE. THE VEHICLE WAS TAKEN TO THE DEALER (COUNTRY TOYOTA IN WESTPORT, CONNECTICUT) WHERE IT WAS DIAGNOSED THAT THE VEHICLE WAS PERFORMING ACCORDING TO STANDARDS. THE FAILURE OCCURRED THREE TIMES IN TWO MONTHS. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED CASE NUMBER: 1708151519. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 8,431.",
        "vin": "3MYDLBYV3HY"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/23/2017",
        "dateOfIncident": "02/08/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10956582,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MANUAL TRANSMISSION SHUDDER.  CLUTCH AND FLYWHEEL WAS CHANGED AT 535 MILES.  20 MILES LATER SAME ISSUES BUT ONLY AT FIRST FROM A DEAD STOP.  NOW AT 2100 MILES THE CAR HAS THE SHUDDER IN 5/6 GEARS AS WELL  BETWEEN 59MPH TO 72.  ALSO MANUAL GEAR LEVER STARTED TO DEVELOP 1/4 INCH PLAY SIDE TO SIDE.  ITS HARD TO PUT IN FIRST/SECOND AT TIMES DUE TO PLAY.",
        "vin": ""
    }
]