[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/29/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385443,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "BEETLE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 VOLKSWAGEN BEETLE. WHILE THE VEHICLE WAS PARKED, THE CONTACT WAS UNABLE TO REMOVE THE KEY FROM THE IGNITION. THE CONTACT HAD TO TURN THE STEERING WHEEL SEVERAL TIMES IN ORDER TO REMOVE THE KEY FROM THE IGNITION. THE CONTACT STATED THAT THE FAILURE PERSISTED. THE CONTACT TOOK THE VEHICLE TO SCHUMACHER VOLKSWAGEN OF WEST PALM BEACH (3001 OKEECHOBEE BLVD, WEST PALM BEACH, FL 33409) HOWEVER, THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE SERVICE MANAGER STATED THAT THE IGNITION NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 26,000.",
        "vin": "3VW517AT3HM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/22/2020",
        "dateOfIncident": "02/21/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310737,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "BEETLE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER WINDOW REGULATOR WENT BAD.  NOT COVERED UNDER WARRANTY NOW. HAD DRIVER SIDE REPLACED LAST YEAR AND WARRANTY COVERED IT. 1500 MILES OVER WARRANTY NOW",
        "vin": "3VW517AT1HM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/12/2019",
        "dateOfIncident": "11/11/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279476,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "BEETLE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "NHTSA: 19V615  NOVEMBER 11, 2019, I MADE AN APPOINTMENT TO GET THIS RECALL 37M2-MICRO SWITCH ON MY 2017 VW BEETLE, WHEN I ARRIVED, I WAS TOLD THEY DID NOT HAVE THE PARTS TO FIX THIS RECALL.  I AM TRYING TO SELL MY CAR AND IT IS NOT PRUDENT TO TRY TO SELL A VEHICLE WITH AN OPEN RECALL ON IT.    I WAS FIRST NOTIFIED OF THIS RECALL IN AUGUST 2019 AND WE ARE NOW IN NOVEMBER 2019 AND ACCORDING TO WHAT I AM TOLD THERE IS STILL NO FIX FOR THIS RECALL.  MY QUESTION IS 'WHAT IS THE HOLD UP'?  ARE YOU WAITING FOR SOMEONE TO HAVE A SERIOUS ACCIDENT BECAUSE IF YOU ARE, THERE WILL CERTAINLY BE LAWSUITS AGAINST VW FOR NEGLIGENCE?  I DON'T UNDERSTAND HOW YOU CAN SEND OUT A RECALL AND 3 MONTHS LATER STILL NOT HAVE THE DEALERSHIPS HAVE WHAT THEY NEED TO GET THIS REPAIRED.  YOU ARE DEFINITELY LEAVING YOURSELVES OPEN FOR SOME SERIOUS PROBLEMS, SO MAY I SUGGEST THAT YOU GET THIS SITUATION TAKEN CARE OF ASAP.  THANK YOU FOR YOUR PROMPT ATTENTION TO THIS MATTER!",
        "vin": "3VWF17AT9HM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/06/2019",
        "dateOfIncident": "10/01/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194325,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "BEETLE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRICAL MOTOR RUNNING NOISE IN REAR AREA OF VEHICLE AFTER ENGINE SHUTDOWN AND KEY REMOVAL. OCCURS EVERY TIME VEHICLE IS DRIVEN IN RAIN CONDITIONS--REGARDLESS OF SEVERITY OF RAIN. THE NOISE REMAINS FOR UP TP 15 MINUTES AFTER SHUTDOWN AND KEY REMOVAL AND OCCURS ONLY IN WET CONDITIONS. FIRST TIME THERE WAS AN ACRID ODOR AT THE TIME OF THE NOISE -- APPEARS TO HAVE CEASED SUBSEQUENTLY BUT THE \"RUNNING\" NOISE REMAINS. ONLY WHEN DRIVEN IN THE RAIN. VEHICLE APPEARS TO BE NORMAL IN ALL ASPECTS WHEN DRIVING IN DRY CONDITIONS. HAVE HAD AUTHORIZED VW DEALER INSPECT WITH NO RESULTS. IT IS IMPORTANT TO NOTE, REGARDLESS, THAT THIS OCCURS EVERY TIME IT RAINS. THE ONLY MOTOR I CAN THINK OF IN THE REAR AREA IS THE FUEL PUMP AND HAVE NO IDEA WHY THIS OCCURS. SITUATION HAS BEEN WITH THE CAR SINCE ORIGINAL PURCHASE IN OCTOBER 2017.",
        "vin": "3VWF17AT1HM"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/31/2018",
        "dateOfIncident": "08/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144504,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "BEETLE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 VOLKSWAGEN BEETLE. THE CONTACT STATED THAT THE AIR BAG LIGHT ILLUMINATED SEVERAL TIMES BUT WAS OFF WHEN A PASSENGER WAS IN THE FRONT PASSENGER SEAT. THE VEHICLE HAD NOT BEEN INSPECTED AND DIAGNOSED BY A DEALER YET  TO DETERMINE IF THEY MAY BE ABLE TO CHECK THE DTC TO DETERMINE A REMEDY TO REPAIR THE VEHICLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE MANUFACTURER WAS CONTACTED, HAD NOT ISSUED ANY TSB AND NO RECALL CAMPAIGNS FOR THE AIR BAG SYSTEM AND THE CONTACT WAS UNCERTAIN IF THE VEHICLE MAY BE REPAIRED WITH A PERMANENT REMEDY. THE APPROXIMATE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "3VWS17AT0HM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/17/2018",
        "dateOfIncident": "09/03/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129857,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "BEETLE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WEATHER CONDITIONS: RAIN. AFTER RELATIVELY SHORT DRIVE GARAGED VEHICLE AND TURNED ENGINE OFF. VERY NOTICEABLE BURNING ODOR APPEARS TO COME FROM ENGINE COMPARTMENT. LOUD MOTOR NOISE COMING FROM REAR AREA (ELECTRICAL MOTOR NOISE NOT ENGINE/FAN NOISE) WHICH CONTINUED FOR APPROXIMATELY THIRTY MINUTES. I AM AWARE OF THE FUEL PUMP RUNNING FOR A SECOND OR TWO WHEN I FIRST OPEN THE DRIVERS DOOR UNDER NORMAL CONDITIONS. THIS IS A QUIET HUM, HARDLY NOTICEABLE, AND NOT AN ISSUE. THE NOISE ADDRESSED ABOVE IS QUITE LOUD AND ABNORMAL ( ALMOST LIKE A BEARING RUNNING DRY). WEEK LATER ' SAME WEATHER CONDITIONS ' RAIN. RAN VEHICLE ON SHORT SHOPPING TRIP AND, AGAIN, UPON GARAGING: SAME SYMPTOMS. TOOK VEHICLE TO AUTHORIZED VW DEALERSHIP. THEIR ANALYSIS: UNABLE TO FIND ANYTHING WRONG. VEHICLE WAS DRY AT THE TIME AND UNDERSTAND THEY COULD NOT FIX ANYTHING THAT DOES NOT OCCUR WHILE THEY ARE CHECKING. VERY NERVOUS BECAUSE THIS PROBLEM APPEARS LIMITED TO RAIN/WATER ENCROACHMENT SOMEWHERE IN/ON THE VEHICLE DURING INCLEMENT OPERATIONS. VEHICLE APPEARS TO FUNCTION NORMALLY DURING OPERATIONS IN RAINY WEATHER'PROBLEM NOTICEABLE ONLY WHEN GARAGED AND TURNED OFF.",
        "vin": "3VWF17AT1HM"
    }
]