[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/25/2017",
        "dateOfIncident": "07/22/2017",
        "fire": false,
        "manufacturer": "Jayco, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010481,
        "products": [
            {
                "manufacturer": "Jayco, Inc.",
                "productMake": "TRAVEL TRAILER",
                "productModel": "SEISMIC",
                "productYear": "2017",
                "type": "Vehicle"
            },
            {
                "manufacturer": "CARLISLE TIRE & RUBBER CO",
                "productMake": "CARLISLE",
                "productModel": "RADIAL TRAIL",
                "productYear": "9999",
                "size": "205/75R15",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 DODGE 3500 HITCHED WITH A 2017 PACIFIC COAST POWERLITE 3213 (NA). THE TRAILER WAS EQUIPPED WITH CASTLE ROCK RADIAL ST TIRES, SIZE: P235/80R/16 (NA). WHILE FUELING THE VEHICLE, AN EYEWITNESS OBSERVED AND INFORMED THE CONTACT THAT THE REAR DRIVER SIDE TIRE HAD A BUBBLE. THE CONTACT CALLED ROADSIDE ASSISTANCE (EMERGENCY ROAD SERVICE IN ELOY, ARIZONA) WHO DIAGNOSED THAT THE TIRES WERE IMPROPERLY MOUNTED. AS A RESULT, AIR ENTERED THE TIRE AND CAUSED BEADS TO FORM. IN ADDITION, THE STEEL CORD SEPARATED. THE TIRE WAS REPLACED WITH A SPARE TIRE. THE EMERGENCY ROAD ASSISTANCE REPRESENTATIVE ALSO OBSERVED THAT THE SAME FAILURE WAS OCCURRING WITH THE FRONT DRIVER SIDE TIRE AND STATED THAT THE REAR PASSENGER AND FRONT AND REAR TIRES HAD CRACKS ON THE SIDEWALLS. ALL FOUR TIRES NEEDED TO BE REPLACED. THE MANUFACTURER WAS CONTACTED TWICE. THE CONTACT LEFT A VOICE MESSAGE ASKING FOR A RETURN CALL; HOWEVER, HE WAS UNABLE TO REACH ANYONE AND THE EMAIL ADDRESS WAS NO LONGER VALID. THE CONTACT ALSO LEFT A VOICE MESSAGE WITH THE DEALER (SUNSET RV, 1606 51ST AVE E, FIFE, WA, 98424). THE APPROXIMATE FAILURE MILEAGE FOR THE TIRES AND TRAILER WAS 4,000.",
        "vin": "5UYHN3523HR"
    }
]