[
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/14/2022",
        "dateOfIncident": "03/13/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456585,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "When trying to accelerate after braking the vehicle has a MASSIVE hesitation where it just sits there doing nothing literally for a solid second. Not only being very frustrating it's IMO very dangerous. If I'm at a yield and then need to merge quickly, if I'm getting on a highway from a parking lot, if I'm trying to switch lanes in traffic, etc etc the vehicle just bogs down and does nothing for that 1-2 seconds.  Drive the vehicle normally, apply the brakes and then right away take your foot off the brake and accelerate. You don't have to mash the accelerator, even with light to moderate pressure you will notice that lag where the vehicle is just sitting there with zero power. If you do accelerate moderately or hard after a second or 2 of doing nothing it will just completely jerk into motion. Does the same thing in all modes, it's actually worse in Sport and Sport+ mode because you get more power after the hesitation  After braking moderately hard from 40mph to 15mph because someone cut in front. Then I changed lanes and had to accelerate because that other lane was going quite a bit faster. Hit the gas and nothing for what seemed like the longest 1.5 seconds until the thrust came back online  Pattern:   From Stop --> Accelerate  for about approx 20 MPH -->Release the gas pedal and immediately apply the gas pedal.  Another pattern:  Travel in about 40 MPH, apply the brakes to a speed below 20 MPH and apply gas pedal.  Consulted with the dealer  multiple times and they think this is normal for 2018 MDXes. But it is indeed a safety concern. The dealer said they applied TSB 20-015 TCM update and it still has not resolved the problem.   THIS IS A HUGE SECURTY ISSUE and DANGER HAZZARD.  The issue happens every day.  Below reported date is the latest occurrence.",
        "vin": "5J8YD4H92JL"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/02/2022",
        "dateOfIncident": "02/22/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454811,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Acura MDX. The contact stated while driving 10 mph and making a left turn, the steering wheel was hard to turn and it was shaking. The contact took the vehicle to the dealer but the failure could not be duplicated. The vehicle was not repaired. The manufacturer was not notified of the failure. The failure mileage was 49,000.",
        "vin": "5j8yd4h83jl"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/25/2022",
        "dateOfIncident": "02/20/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454031,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "My vehicle has similar behaviors to the most recent investigation that is happening with the investigation of the Honda Accord and CRV noted in this article: https://static.nhtsa.gov/odi/inv/2022/INOA-PE22003-5540.PDF. On a handful of times while driving on the freeway, my car has unexpectedly decelerated when passing another vehicle, or on a curve the adaptive cruise control slows the vehicle down. On one occasion, the car suddenly applied the brakes and slowed us down at least 10mph. In any of these instances, I have not had anyone following, but could have caused issues if there was.",
        "vin": "5J8YD4H53JL"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/16/2022",
        "dateOfIncident": "09/15/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452260,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "When the car accelerator pedal is pressed, from either a stop or slowly rolling from a stop, there is no response from the vehicle, no transmission downshift, no sounds - it just sits as if the car is off for 1-3 seconds and THEN accelerates/lunges.  This happens everyday, intermittently throughout depending on where we are driving and the number of stops/turns but it is repeatable.  This is a safety concern when attempting to turn left when there is oncoming traffic.  I have reported this to the dealership of purchase 3-4 times and have been told there is nothing wrong with the vehicle.",
        "vin": "5j8yd3h58jl"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/02/2022",
        "dateOfIncident": "02/01/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449853,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Brake light is not working properly, I was pulled over with a warning",
        "vin": "5j8yd3h34jl"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/13/2022",
        "dateOfIncident": "01/09/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447404,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "When driving at highway speeds, intermittently and unpredictably, the throttle control will become unresponsive and RPMs will drop to minimum levels.  This causes the vehicle to rapidly decelerate, creating an incredibly dangerous situation.  When this occurs, the gas pedal becomes unresponsive and has no control over the RPMs or speed of the vehicle. This has happened approximately 6 times and each time has resulted in trailing vehicles to have to perform evasive maneuvers to avoid hitting our car from behind.  We have brought the car in to an Acura service center on 2 occasions with no resolution, even though the service advisor has stated that she has received this complaint on numerous occasions from owners of this model and year vehicle.",
        "vin": "5j8yd3h5xjl"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/20/2021",
        "dateOfIncident": "12/20/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444479,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Car miss shifts especially in the 25 to 40 mph range.  Sometimes hesitates when taking off.  Also stays in one gear and will not upshift when entering the Freeway.    Very dangerous.   I found numerous complaints on the web in reference to these problems, but still no recall???  Have told the dealership about these problems with every service, but they said that there is nothing wrong.",
        "vin": "5J8YD3H57JL"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "12/06/2021",
        "dateOfIncident": "11/15/2021",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442765,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "In San Diego on 11/15/2021, my daughter side swiped a parked vehicle in residential area driving about 30 miles. No airbags deployed. A minute later the car stopped and would not start and started to have smoke and flames come from under hood and through inside windshield and dash. My daughter was able to get out and take her 3 year old son out of his carseat and run for their lives as the car completely became engulfed in flames.Thank God they made it out alive. Police and Fire department showed up. Car was a total loss, everything was burnt. One day the Acura MDX fires will take someone's life. Called Hoehn Acura in Carlsbad Ca and sent service manager Skip about 12 pictures of the completely burnt vehicle. He never returned my calls after leaving several messages. Also left message with general manager and no return call. They don’t care. They only appear interested when you are buying the vehicle. I did file a claim with Acura corporate office and still no word from them either. I have read many cases about the MDX going up in flames for no reason, even in the driveway or drive in your neighborhood. Not sure why they have not recalled this or tried to solve the issue. I am asking for someone to look into this as this is not an isolated incident before lives are lost. Once I get police report I will also send you pictures as well. Thank you.",
        "vin": "5J8YD3H55JL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/22/2021",
        "dateOfIncident": "12/12/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418149,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "This is the exact problem I am experiencing:  https://carbuzz.com/news/some-acura-rdx-and-mdx-owners-have-a-troubling-problem  https://www.carcomplaints.com/news/2020/acura-mdx-and-rdx-acceleration-problems-lawsuit.shtml  https://www.wirtzlaw.com/2020/04/19/defects-in-2016-2017-2018-2019-and-2020-acura-mdx-and-rdx-cause-acceleration-problems-are-subject-to-california-lemon-laws/#:~:text=Model%20years%202016%2C%202017%2C%202018%2C%202019%2C%20and%202020,neutral%2C%20and%20engines%20that%20stall.  Transmission slip: sudden hesitation on acceleration, sudden deceleration then acceleration on low speed, 'hiccup' on transmission shifting   The issue happened since day one I leased the car. At the first oil change service, I reported to the dealership. The dealer performed transmission check and told me everything was 'normal'. However the issue has become persistent and more obvious - it now happens every time I drive.  I now feel the sudden acceleration, and decelerationI makes it very dangerous to drive.",
        "vin": "5J8YD4H35JL"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/27/2021",
        "dateOfIncident": "01/27/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390353,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MULTIPLE TIMES I HAVE BEEN TRAVELING ON THE HIGHWAY AND MY CAR WOULD SUDDENLY DECREASE IN SPEED AND STALL OUT. I WOULD GO FROM 75MPH TO 45MPH VERY QUICKLY. IT WOULD THEN SUDDENLY ACCELERATE AGAIN AND GO BACK TO NORMAL. THIS IS EXTREMELY DANGEROUS AND COULD LEAD TO A DEADLY ACCIDENT.",
        "vin": "5J8YD4H51JL"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/31/2020",
        "dateOfIncident": "08/30/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352291,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TICKING NOISES COMING FROM ENGINE. CONFIRMED WITH DEALER ACURA IS LOOKING INTO THIS. I'M ALSO EXPERIENCING BRIEF LOSS OF POWER DEALER STATES THIS IS ASSOCIATED WITH ENGINE.",
        "vin": "5J8YD3H39JL"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/22/2020",
        "dateOfIncident": "07/21/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340992,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN A STATE ROAD.  NO VEHICLES OR OVERPASSES WERE NEARBY. SUDDENLY MY SUNROOF SHATTERED.",
        "vin": "5J8YD4H34JL"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/22/2020",
        "dateOfIncident": "03/01/2020",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318948,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE WAS PARKED UNDER MY CAR PORT IMMEDIATELY AFTER RETURNING FROM THE GROCERY STORE. AS I WAS UNLOADING THE CAR I SAW AND SMELLED SMOKE WHICH THEN ERUPTED INTO A FIRE COMING FROM THE ENGINE COMPARTMENT. WE CALLED 911 AND WHEN THE FD ARRIVED THE CAR WAS TOTALLY ENGULFED AS WAS MY BUILDING. SUSPECT FUEL LINE LEAK. INSURANCE COMPANY INVESTIGATING. FD SAYS ACURA MDX WAS CAUSE OF FIRE. DANGEROUS SITUATION AS NO PRIOR INDICATORS FROM VEHICLE, RECALLS, ETC.. PHOTOS AVAILABLE IF NEEDED. IF GONE UNNOTICED, ENTIRE STRUCTURE COULD HAVE BEEN LOST.",
        "vin": "5J8YD3H54JL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/02/2019",
        "dateOfIncident": "12/02/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286505,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "EARLY THIS MORNING I WAS CLEANING SNOW ON THE ROOF OF MY CAR WITH A SNOW BRUSH. WHEN I FINISHED I PROCEED TO SEAT IN THE DRIVER SEAT TO DRIVE OFF TO WORK AND I DIDN'T REALIZE I HAD GLASS ON MY SEAT AND I SAT ON IT. I LOOKED UP AND NOTICED MY SUNROOF GLASS WAS SHATTERED WITH A HOLE IN THE MIDDLE OF THE GLASS. THE OUTSIDE TEMPERATURE WAS IN THE HIGH 20'S AND I USED THE SAME SNOW REMOVAL BRUSH ON THE SAME CAR LAST YEAR!",
        "vin": "5J84D4H32JL"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/24/2019",
        "dateOfIncident": "09/24/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257600,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MERGING ONTO A 6 LANE HIGHWAY, SPECIFICALLY THE 3 NORTHBOUND LANES, THE COLLISION MITIGATION BRAKING SYSTEM ACTIVATED SUDDENLY. I WAS MOVING FROM THE RIGHT LANE TO THE MIDDLE LANE ACCELERATING AS NEEDED TO MAINTAIN THE APPROPRIATE SPEED WITH THE MIDDLE LANE. AS I BEGAN TO EASE OFF THE ACCELERATOR, THE CMBS SLAMMED ON THE BRAKES. SPEED WENT FROM 60 TO 25MPH ON A CONGESTED HIGHWAY AT RUSH HOUR. THE CAR BEHIND ME SWERVED TO AVOID. I FRANTICALLY STOMPED ON THE GAS PEDAL TO TRY TO KEEP GOING, EVENTUALLY THE CAR STOPPED BRAKING AND I CONTINUED. THE CAR IN FRONT OF ME WAS A FEW HUNDRED FEET AWAY AND NOT BRAKING AT THE TIME THIS HAPPENED.   TIME OF DAY WAS JUST BEFORE SUNRISE.",
        "vin": "5J8YD4H56JL"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/24/2019",
        "dateOfIncident": "09/23/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257621,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "6 MONTHS AFTER DELIVERY OF MY VEHICLE I STATED NOTICING A JERKING WHEN MY TRANSMISSION SHIFTS. I HAVE TAKEN MY VEHICLE TO THE DEALER INDICATING MY CONCERN. EACH TIME THE DEALERS SAID THE COULD NOT DUPLICATE. THE PROBLEM CONTINUES. THE SECOND ISSUE HAS TO DO WITH MY BRAKES . ON 9/23/2019 MY BRAKES STARTED EMITTING A LOUD PERSISTENT SQUEAK. I AM SCHEDULING AN APPOINTMENT WITH MY DEALER. MY VEHICLE IS A LITTLE MORE THAN A YEAR OLD AND IT SEEMS TO ME THAT AT 30,000 MILES CONSTITUTE PREMATURE BRAKE WARE.",
        "vin": "5J8YD4H54JL"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/23/2019",
        "dateOfIncident": "09/21/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257574,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING ABOUT 35-40 MPH APPROACHING A SIDE STREET TO THE RIGHT.  THE CAR IN FRONT OF ME SLOWED TO TURN RIGHT. THE 'BRAKE' LIGHT FLASHED AS IT TYPICALLY DOES. I SLOWED BUT DID NOT STOP SINCE THE CAR IN FRONT OF ME WAS CONTINUING IT'S TURN AND MOVING AWAY FROM ME. THERE WAS A CAR AT THE STOP SIGN ON THE SIDE STREET WAITING TO TURN ONTO THE ROAD I WAS TRAVELING. AS THE CAR IN FRONT OF ME WAS COMPLETING ITS TURN MY CARS BRAKING SYSTEM ENGAGED AND BROUGHT THE VEHICLE TO A COMPLETE STOP IN FRONT OF THE CAR ON THE SIDE STREET WITH NO VEHICLES IN FRONT OF ME. THE DEALER SAYS THERE ARE NO ERRORS RECORDED ON THE COMPUTER SYSTEM AND THEY COULD NOT DUPLICATE WHAT HAPPENED.",
        "vin": "5J8YD3H36JL"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/21/2019",
        "dateOfIncident": "09/24/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256980,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A PROBLEM WITH THE PASSENGER FRONT WINDSHIELD. IT'S BLURRY ALONG THE EDGE AND HARD TO LOOK OUT ESPECIALLY TO CHECK FOR ON COMING TRAFFIC FROM THE RIGHT SIDE. IT IS A HAZARD TO DRIVE AND SEE PROPERLY OUT THAT WINDOW.",
        "vin": "5J8YD3H37JL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/08/2019",
        "dateOfIncident": "06/27/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230117,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM HAVING CONTINUAL ISSUES WITH THE INFOTAINMENT SYSTEM (RADIO, AIR CONDITIONING, NAVIGATION, ETC.).  THE ISSUES HAVE CONTINUED TO WORSEN OVER TIME DURING MY SHORT TIME OF OWNERSHIP.      THE ISSUES INCLUDE, THE ENTIRE OPERATING SYSTEM FREEZING, THE NAVIGATION SCREEN NOT ALTERNATING BETWEEN DAYTIME AND NIGHTTIME BACKGROUNDS (WHICH CAUSES VISION ISSUES IN THE EVENINGS - IT IS CURRENTLY STUCK ON DAY WHICH IS BRIGHT), THE BACK-UP CAMERA STAYING ON WHILE DRIVING THE VEHICLE FORWARD (THIS INCLUDES ALMOST UP TO 2 MILES AT ONE POINT), THE SYSTEM COMPLETELY TURNING OFF WHILE DRIVING AND NOT TURNING BACK ON, AND THE SYSTEM TRYING TO REBOOK CONITNUOUSLY WHILE DRIVING MULTIPLE TIMES AND NOT ABLE TO REBOOT.  THERE HAVE NOW BEEN TWO TIMES WHERE I NEED TO PULL OFF THE ROAD, TURN THE CAR OFF, AND TURN IT BACK ON TO GET THE INFOTAINMENT SYSTEM BACK ON AND TO BE ABLE TO FUNCTION.      I HAVE BEEN TOLD BY THE DEALERSHIP AND ACURA CLIENT RELATIONS I WOULD STILL HAVE TO WAIT FOR THE OTA.  NO OTHER OPTIONS OR RESOLUTIONS ARE AVAILABLE OR BEING OFFERED.  I HAVE MADE REQUESTS TO THE DEALERSHIP AND DIRECTLY TO ACURA CLIENT RELATIONS TO HAVE THE SYSTEM REPLACED AS IT HAS BECOME A SAFETY ISSUE.  ACURA CLIENT RELATIONS STATED THEY WOULD NOT OFFER THAT AS AN OPTION.  WHILE MY CAR WAS BEING LOOKED AT PREVIOUSLY, I WAS GIVEN ANOTHER ACURA MDX ON TWO OCCASSIONS AND DID NOT HAVE THE SAME ISSUES I AM EXPERIENCING WITH THE MDX THAT I OWN.  I ASKED TO BE ESCALATED TO THE NEXT LEVEL OF LEADERSHIP AND I WAS INFORMED THAT EVEN IF MY ESCALATION REQUEST WERE TO BE REVIEWED, THE MANAGER HAS THE RIGHT WHETHER OR NOT THEY WOULD RESPOND.  THIS WAS INAPPROPRIATE AS IT IS DISCOURAGING CONSUMERS IN TRYING HAVE THEIR CONCERNS HEARD.  AT THIS POINT, AMERICAN HONDA MOTOR CO. D/B/A ACURA C/O ACURA IS NOW AVOIDING CONSUMERS TRYING TO GET THESE ISSUES RESOLVED.",
        "vin": "5J8YD3H55JL"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/28/2019",
        "dateOfIncident": "06/28/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228314,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT WINDSHIELD IS DISTORTED ON THE RIGHT AND LEFT SIDE. THE DISTORTION MAKES IT HARD TO SEE THINGS CLEARLY AND MAKES ME FEEL DIZZY WHEN DRIVING. IT'S LIKE LOOKING THROUGH AN HOURGLASS. THERE HAVE BEEN SEVERAL TIMES I HAVE HAD DIFFICULTY PARKING BECAUSE OF THIS ISSUE. I ALMOST HIT A CAR IN A PARKING LOT BECAUSE OF IT.",
        "vin": "5J8YD3H85JL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/10/2019",
        "dateOfIncident": "01/22/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11175994,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ISSUE 1:  ======  VEHICLE IS IN PARKED POSITION IN DRIVE WAY AND WAS LOCKED. THE SIDE VIEW MIRRORS ARE SET TO CLOSE UPON HITTING THE LOCK BUTTON. DURING COLD WEATHER THE SIDE VIEW MIRRORS AND THE DRIVER SIDE WINDOW GLASS FROZE (THE MIRRORS WONT OPEN UP, THE DRIVER SIDE WINDOW GLASS DOES NOT ROLL DOWN). UPON SEVERAL INSTANCES WHEN THIS IS ISSUE IS OBSERVED THERE IS NO VISIBLE SNOW/FROST OUTSIDE (THE OUTSIDE OF THE CAR IS DRY). I AM ASSUMING THE WATER THAT GOT COLLECTED MAY BE OVERNIGHT OR PREVIOUS DAY RAIN/SNOW IS GETTING FROZEN IN THE SHELLS OF THE SIDE VIEW MIRROR, AND THE SEAMS OF THE WINDOW GLASS PANE.. UNFORTUNATELY AND THERE IS NO WAY TO  ROLL THE WINDOW MANUALLY OR OPEN THE MIRRORS MANUALLY. HAD TO WAIT FOR FEW HOURS BEFORE THE MIRRORS COULD ACTUALLY OPEN UP AND THE GLASS DOOR WOULD START ROLLING DOWN.     ISSUE 2:  ======  THE PHONE IS ASSOCIATED TO THE CAR AS A PAIRED BLUETOOTH DEVICE, AS WELL AS AN ANDROID PHONE. WHEN PLAYING SONGS VIA PHONE VIA BLUETOOTH IN CAR, THE BLUETOOTH CONNECTION WOULD NOT RESUME AFTER YOU STOP THE CAR EXIT THE CAR, LOCK THE CAR  (WHILE THE SONGS ARE BEING PLAYED) AND COME BACK AFTER SOME TIME UNLOCK THE CAR AND RESTART THE CAR. I HAVE TO STOP AND RESTART THE BLUETOOTH ON MY PHONE FOR THE ACURA TO RECOGNIZE MY PHONE AS A MEDIA PLAYER, HOWEVER THE CAR RECOGNIZE MY PHONE AS A PHONE FOR MAKING CALLS ETC.. THIS HAPPENS TO PHONE AS A MEDIA PLAYER ONLY...       ISSUE 2:  ======  WHEN TWO DRIVERS ARE USING THE CAR, THE NEED FOR READJUSTMENT OF THE REAR VIEW MIRROR ONCE A DAY CAUSES THE MIRROR TO BREAK LOOSE.",
        "vin": "5J8YD4H51JL"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/03/2019",
        "dateOfIncident": "02/03/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173846,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD LEAK IN MY PASSENGER SIDE REAR TIRE. WHEN CHANGING I NOTICED THE SPARE IS ATTACHED TO THE UNDER CARRIAGE OF MY VEHICLE. I THINK THIS POSES A SAFETY HAZARD BECAUSE OVER TIME BECAUSE OF WEATHER THE HARDWARE THAT ANCHORS THE TIRE COULD FAIL. IF THAT HAPPENS THE TIRE COULD COME LOSE CAUSING AN ACCIDENT. ACURA NEED TO REASSSES THE PLACEMENT OF THEIR SPARE TIRE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/22/2019",
        "dateOfIncident": "01/04/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171427,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "NINE DIFFERENT ELECTRICAL FAILURES IN TWENTY SEVEN WEEKS ON A NEW 2018 ACURA MDX TECHNOLOGY PACKAGE. THAT'S ONE FAILURE EVERY THREE WEEKS. SIX PROBLEMS HAVE OCCURRED ONE TIME, THREE PROBLEMS ARE STILL INTERMITTENT, THE MOST CONCERNING IS THE HEATED SEAT FEATURE. THE CIRCUIT CLOSES WITHOUT ACTIVATION. OCCASIONALLY WHEN THE VEHICLE IS STARTED, THE LED INDICATOR LIGHTS ARE ON. SEVERAL TIMES IT HAS AFFECTED THE DRIVERS SEAT, ONCE THE PASSENGER SEAT, AND ONCE BOTH SEATS. ONCE THE VEHICLE WAS PUT IN REVERSE, THE REAR CAMERA ACTIVATED AND CONTINUED TO WORK AS I DROVE FORWARD TO MY DESTINATION. ONCE I WALKED PASSED THE VEHICLE WITH THE WIRELESS REMOTE IN MY POCKET AND THE VEHICLE UNLOCKED ITSELF WITHOUT TOUCHING THE DOOR. ANOTHER TIME BOTH SIDE MIRRORS TILTED DOWN REGARDLESS OF WHERE THE MIRROR SWITCH WAS ON THE DRIVER DOOR. SEVERAL TIMES THE RADIO WOULD NOT ACTIVATE WHEN THE ON/OFF BUTTON WAS PRESSED. SEVERAL PROBLEMS WITH THE HANDS FREE LINK SYSTEM. I PRESSED THE TALK BUTTON IT SAYS NO DEVICE FOUND. PRESS TALK BUTTON, GIVE PHONE COMMAND IT SAYS NO DEVICE PAIRED. . PRESS TALK BUTTON, GIVE PHONE COMMAND, DISPLAY SHOWS CALL HISTORY . PRESS TALK BUTTON AND GIVE PHONE COMMAND, THEN CALL B%##% ,VOICE CONTINUALLY SAYS PARDON. TURN BACK WIPER ON AND BACK OFF, WIPER CONTINUED TO WORK FOR ABOUT TWO MINUTES.  I PARKED THE VEHICLE WITH THE ELECTRIC PARKING BRAKE ON, WHEN I STARTED VEHICLE LATER, MESSAGE IN DISPLAY READ,TROUBLE WITH ELECTRIC PARKING BRAKE TAKE TO DEALERSHIP. SERVICE DEPARTMENT SAYS NO CODE FOUND.",
        "vin": "5J8YDEH53JL"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/12/2019",
        "dateOfIncident": "01/09/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166667,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CRUISE CONTROL ENGAGES AND THE CAR TAKES OFF FROM A DEAD STAND STILL WHEN RESUME BUTTON IS BUMPED. IT IS MY UNDERSTANDING CRUISE CONTROL SHOULD NOT ENGAGE FROM A STANDSTILL OR SLOW SPEED. I DISCOVERED THIS AFTER THE DEALER SERVICED THE CAR AND THE TECH HAD TURNED ON THE CRUISE THE RESUME BUTTON PERTRUDES OUT FROM THE STEARING WHEEL AND AS I WAS COASTING THROUGH A TURN ON THE DEALERS LOT THE CAR LAUNCHED FORWARD I TOOK MY FOOT OFF THE GAS PEDDLE BUT IT CONTINUED TO EXCEL. I TOOK THE CAR RIGHT BACK TO THE SERVICE DEPARTMENT AND WAS TOLD I MUST HAVE BUMPED THE 'RESUME' BUTTON WHILE TURNING AND THATS WHAT CAUSED IT TO UNEXPECTEDLY EXCEL. I ASKED, IT ENGAGES AT A VIRTUAL 4-5 MPH CRAWL? EVEN WHEN NO PREVIOUS SPEED HAS BEEN ENTERED SINCE THE CAR WAS STARTED? THE SERVICE WRITER STOPPED THE CAR, TOOK HIS FOOT OFF THE BRAKE AND HE DEMONSTRATED HOW I MUST HAVE BUMPED THE RESUME AS I WAS TURNING. HE BUMPED THE RESUME AND THE CAR LAUNCHED OFF ON ITS OWN FROM A COMPLETE STANDSTILL. HE SAID IT WAS A NORMAL ACURA TRAIT BUT SHOULDNT EXCEED 25-30 MPH. HE SAID HE HAD A SUBARA THAT DOES THE SAME THING. HE SAID CUSTOMERS FREQUENTLY COMPLAIN ABOUT IT BEING A SAFETY HAZARD AND HE SUGGESTED WE JUST BE SURE THE CRUISE MASTER CONTROL IS TURNED OFF EVERY TIME WE START THE CAR. I TRIED THIS WITH ALL MY OTHER VEHICLES AND NONE OF THEM EVEN ENGAGED CRUISE UNDER 25 MPH. THIS IS IN MY OPINION A VERY SERIOUS UNEXPECTED EXCELLING PROBLEM THAT SHOULD BE ADDRESSED",
        "vin": "5J8YD4H58JL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/07/2019",
        "dateOfIncident": "12/12/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165559,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL: REVIEW CAMERA REMAINS ON WHEN I SHIFT FROM REVERSE TO DRIVE.  CONSEQUENTLY, I AM DRIVING LOOKING AT THE ROAD BEHIND ME ON THE SCREEN.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/07/2019",
        "dateOfIncident": "12/12/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165565,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL: CORRECTION FOR COMPLAINT #11164408.  REAR VIEW CAMERA REMAINS IN THE REVERSE POSITION WHEN I SHIFT FROM REVERSE TO DRIVE.  CONSEQUENTLY, I AM DRIVING WITH A VIEW OF THE ROAD BEHIND ME.  THIS HAS HAPPEN THREE TIMES.  I REPORTED THIS TO ACURA OF PEORA, AZ.  THEY KEPT MY CAR FOR A DAY BUT DIDN'T RESOLVE THE PROBLEM.  I WAS TOLD THEY WERE CONTACTING ACURA HEADQUARTERS AND WOULD GET BACK TO ME BECAUSE THEY COULDN'T REPLACE A $3000 SYSTEM WITHOUT APPROVAL FROM ACURA HEADQUARTERS.",
        "vin": "5J8YD3H56JL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/19/2018",
        "dateOfIncident": "12/19/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162514,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS STATION FUEL GAS NOZZLE STUCKED/STICKING IN CAPLESS GAS TANK FILLER",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/23/2018",
        "dateOfIncident": "10/23/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142278,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BACKUP CAMERA STAYED ON EVEN WHEN THE VEHICLE WAS IN FORWARD MOTION - THE CONTINUOUS REAR VIEW ON DISPLAY SCREEN WAS A DRIVING DISTRACTION WHILE DISABLING OTHER FEATURES.",
        "vin": "5J8YD3H55JL"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/21/2018",
        "dateOfIncident": "08/17/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141645,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT PASSENGER MISALIGNMENT ALLOWING RAIN WATER TO SEEP INSIDE THE VEHICLE.  THIS WAS A NEW VEHICLE PURCHASE.  IT WAS ONLY DISCOVERABLE WHEN A FRONT SEAT PASSENGER WAS RIDING IN THE NEW VEHICLE WHILE IT WAS RAINING.  THE LEAK WAS ONGOING FOR AN UNSPECIFIED TIME, FROM THE TIME THE VEHICLE LEFT THE MANUFACTURER, HONDA UNTIL THE TIME THE DEALERSHIP TOOK DELIVERY OF THE VEHICLE, RADLEY ACURA, FALLS CHURCH, VA.  HONDA NORTH AMERICA HAS ADMITTED THAT IT WAS A FACTORY DEFECT AND DO NOT NOT WANT TO DO A BUY BACK.  HONDA CLAIMS THE REPAIRS FORM LEAKS ENTERING A VEHICLE FOR AN UNSPECIFIED PERIOD CORRECT MOISTURE ENTERING A VEHICLE FOR AN UNSPECIFIED PERIOD. HONDA DOES NOT PROVIDE AN EXPLANATION ON HOW THE MOISTURE WILL IMPACT THE ELECTRONICS IN THE VEHICLE OR CORRECT MOLD GROWTH.  HONDA NOR THE DEALER HAVE BEEN COOPERATIVE OR RESPONSIVE TO THE CONCERNS OF THE BUYER.  WHEN THE NEW VEHICLE WAS DELIVERED, IT HAD APPROXIMATELY 20 MILES ON IT.  THE PURCHASE PRICE OF THE VEHICLE WAS $42,000.  BUYERS MADE A DOWN PAYMENT OF $24,000.  RADLEY ACURA IS IN POSSESSION OF THE VEHICLE. HONDA & RADLEY HAVE NOT BEEN RESPONSIVE AND FEEL THAT THE PURCHASERS DO NOT HAVE AN ALTERNATIVE BUT TO ACCEPT A DEFECTIVE NEW VEHICLE THAT LEAKS WHEN IT RAINS.  RADLEY CLAIMS THEY HAVE CORRECTED THE MISALIGNED PASSENGER DOOR.  PURCHASERS HAVE NO CONFIDENCE IN THE VEHICLE BECAUSE OF SAFETY CONCERNS.  HOW HAS THE MOISTER AFFECTED THE ELECTRICAL SYSTEM?  HONDA HAS ADMITTED THAT IT WAS A MANUFACTURERS DEFECT THAT CAUSE THIS PROBLEM.  THERE IS NO DISPUTE THAT WATER AND MOISTURE ENTERED INTO THE VEHICLE FOR AN UNSPECIFIED TIME.  BUYERS EXPECTED TO PURCHASE A NEW VEHICLE WHERE WATER MOISTURE & RAIN WATER HAD NOT BEEN ENTERING A NEW VEHICLE FOR AN UNDETERMINABLE TIME.",
        "vin": "2HNYD28227H"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/13/2018",
        "dateOfIncident": "03/29/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129399,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE VEHICLE NEW, IN LATE MARCH 2018; I BELIEVE WE TOOK DELIVERY ON MARCH 29, 2018.  WE HAVE HAD AN ONGOING ISSUE WITH THE MEMORY POSITIONING OF THE STEERING WHEEL. OUR VEHICLE HAS THE ADVANCED PACKAGE.  INTERMITTENTLY, THE SEAT WILL GO TO THE MEMORIZED POSITION, BUT THE STEERING WHEEL WILL STAY IN THE POSITION FOR EXITING THE VEHICLE.  THAT POSITION IS IN THE HIGHEST POSITION THE STEERING WHEEL CAN BE PLACED IN.      WE HAVE HAD THE VEHICLE AT BAKERSFIELD ACURA FOUR SEPARATE TIMES TO CORRECT THE ISSUE.  BAKERSFIELD ACURA HAS BEEN UNABLE TO DUPLICATE THE ISSUE WHILE THE VEHICLE IS AT THEIR FACILITY.  THEIR SERVICE WRITER, OMAR, ACTUALLY WITNESSED THE MALFUNCTION WHEN I DROPPED THE VEHICLE ON JULY 16, 2018.       I HAVE FILED A COMPLAINT WITH ACURA CLIENT RELATIONS, CASE NUMBER 08936387.  ACURA REFUSES TO DO ANYTHING ABOUT THE ISSUE.  I HAVE EXPLAINED THAT THIS IS A VERY SERIOUS SAFETY ISSUE.  WHEN THE STEERING WHEEL STAYS IN THE HIGHEST POSITION, IT IS VERY DIFFICULT TO SEE OVER THE STEERING WHEEL, BLOCKING OUR VISION OF THE ROAD.  MY WIFE AND I JUST GET IN THE VEHICLE, START IT UP AND TAKE OFF.  NORMALLY, IT IS NOT UNTIL WE ARE DRIVING THAT WE NOTICE THE ISSUE.  AT THAT POINT, WE ARE FUMBLING AROUND TRYING TO LOCATE THE LEVER TO MANUALLY ADJUST THE STEERING WHEEL.  AT 65 MPH ON THE FREEWAY, THAT IS VERY DISTRACTING AND DANGEROUS.  A SPLIT SECOND OF DISTRACTED DRIVING CAN CAUSE A VERY SERIOUS ACCIDENT.      TIFFANY AT ACURA CLIENT RELATIONS, AND DAVID, THE SERVICE MANAGER AT BAKERSFIELD ACURA HAVE BOTH ADMITTED THAT THEY ARE AWARE OF THE PROBLEM, BUT CONTEND IT ONLY HAPPENS WHEN BOTH DRIVER ONE AND DRIVER TWO KEYS ARE PRESENT.  APPARENTLY, THEY HAVE NO INTENTION OF CORRECTING THE MALFUNCTION.  TO BE CLEAR, IT HAPPENS WHEN ONLY ONE KEY IS PRESENT AS WELL AS WHEN BOTH KEYS ARE PRESENT.",
        "vin": "5J8YD7H78JL"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/13/2018",
        "dateOfIncident": "09/13/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129431,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWNHILL A CAR APPROX 1000 FEET AHEAD OF ME WAS SLOWING DOWN TO TURN RIGHT WHILE THE CAR WAS STILL TURNING BUT COMPLETELY OUT OF THE INTERSECTION THE AUTOMATIC BRAKES CAME ON AND CAME TO A COMPLETE STOP. THE CAR THAT TURNED RIGHT WAS DOWN THE STREET IT HAD TURNED ON COMPLETELY OUT OF SENSOR RANGE AND THE AUTOMATIC BRAKES WOULD NOT LET OFF, WHEN TRYING TO ACCELERATE IT GOT STUCK IN GEAR BUT WOULD NOT BUDGE. LIKE WHEN YOU DONT SHIFT A GEAR FOR TOO LONG IN A STICK SHIFT CAR. FINALLY THE BRAKES LET OFF AND I WAS ABLE TO DRIVE BUT FURTHER DOWN THE SAME HILL THE AUTOMATIC BRAKES DID THE SAME THING AGAIN WHILE TRYING TO ACCELERATE TO CHANGE LANES, THERE WAS NOT A SINGLE CAR INFRONT OF ME AT THIS POINT AND NO REASON FOR THE AUTOMATIC BRAKES TO DO THIS. BOTH INCIDENTS ALMOST CAUSED ME TO BE REAR ENDED.",
        "vin": "5J8YD4H53JL"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/13/2018",
        "dateOfIncident": "09/13/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129434,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER SWITCHING TO DRIVE FROM REVERSE THE NAV DISPLAY WOULD NOT SWITCH BACK FROM THE BACK UP CAMERA WHILE DRIVING AHEAD, WHEN A CAR WOULD BE ANYWHERE NEAR MINE ON THE ROAD, STILL IN DRIVE, WHETHER IDLE AT A STOP LIGHT OR IN MOTION ON THE STREET, THE BACK UP SENSORS THAT RESPOND TO PASSING CARS DID NOT BEEP. I TRIED PRESSING THE BACK BUTTON, NAV BUTTON, SETTINGS BUTTON & TURNING THE CAR ON/OFF ALL FAILING TO FIX THE PROBLEM. THE CAMERA REMAINED ON EVEN WHILE IN PARK ONCE I ARRIVED HOME.",
        "vin": "5J8YD4H53JL"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/19/2018",
        "dateOfIncident": "01/01/1965",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120933,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "[XXX]  INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'  *PM",
        "vin": "3C6UR5GL9FG"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/02/2018",
        "dateOfIncident": "05/29/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099303,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTER FAILED WITH AUTO START/STOP WHILE STOPPED IN TRAFFIC. SINCE ENGINE WOULDN'T START, CAR SHIFTED TO PARK AUTOMATICALLY AND CAN NOT SHIFT TO NEUTRAL WITH THE ENGINE OFF AND UNABLE TO START. THE BATTERY WAS FINE AND COULD GO INTO AUX MODE, BUT STILL WON'T SHIFT TO NEUTRAL. ASIDE FROM QUALITY ISSUES RELATED TO STARTER, SIGNIFICANT SAFETY DESIGN FLAW.",
        "vin": "5J8YD4H80JL"
    },
    {
        "components": "STEERING,WHEELS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/25/2018",
        "dateOfIncident": "03/11/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089994,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AT APPROXIMATELY 500 MILES ON THE ODOMETER, THE STEERING WHEEL BEGAN VIBRATING WHEN TRAVELING BETWEEN 58-62 MPH. STEERING WHEEL VIBRATED WITH AND WITHOUT BRAKING.    AT APPROXIMATELY 1,000 MILES, STEERING WHEEL BEGAN VIBRATING VIOLENTLY WHEN TRAVELING BETWEEN 58-62 MPH. STEERING WHEEL VIBRATED WITH AND WITHOUT BRAKING. DEALERSHIP ROTATED TIRES. MODERATE STEERING WHEEL VIBRATION STILL REMAINED WHEN BRAKING BETWEEN 58-62 MPH.    AT APPROXIMATELY 2,400 MILES, STEERING WHEEL BEGAN VIBRATING VIOLENTLY AGAIN WHEN BRAKING BETWEEN 58-62 MPH. THE DEALERSHIP REPLACED FRONT ROTORS AND ROTATED TIRES.    AT APPROXIMATELY 3,000 MILES, STEERING WHEEL BEGAN VIBRATING VIOLENTLY AGAIN WHEN BRAKING BETWEEN 55-65 MPH.",
        "vin": "5J8YD4H59JL"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "03/28/2018",
        "dateOfIncident": "03/20/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11081739,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED ACURA MDX IN JANUARY OF 2018 SO IT IS NOW 3 MONTHS. I BELIEVE THERE IS SOMETHING SIGNIFICANTLY WRONG WITH ITS AUTOMATIC BRAKING SYSTEM. I WAS DRIVING DOWN A HILL ON A RESIDENTAL, FAST PACED ROAD, WITH A GUARDRAIL TO MY RIGHT SIDE AND ANOTHER CAR PASSING ME ON THE LEFT SIDE. WE BOTH WE TRAVELING AT THE SPEED LIMIT OF 40 MILES PER HOUR WHEN ALL OF A SUDDEN MY CAR'S BRAKES WENT ON, CAUSING ME TO SWERVE INTO THE GUARDRAIL. FROM THERE, I WAS THROWN INTO ONCOMING TRAFFIC CAUSING A COLLISON. I BELIEVE THE SYSTEM BECAME CONFUSED AND STEPPED ON THE BRAKES WHEN IT DETECTED THE OTHER VEHICLE ACCELERATING TOWARDS ME.",
        "vin": "5J8YD4H57JL"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/08/2017",
        "dateOfIncident": "12/01/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11053511,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2018 ACURA MDX HAS WINDSHIELD DISTORTIONS AFFECTING VISIBILITY AND CAN LEAD TO DIZZINESS RESULTING FROM VISUAL VERTIGO.   IMAGES SEEN THROUGH THE OUTER EDGE OF THE WINDSHIELD ARE DISTORTED. STRAIGHT LINES (ROAD BARRIERS, LINES ON THE STREET, FENCES, CURBS, ETC) APPEAR BENT/CURVED. OBJECTS ALSO QUICKLY MAGNIFY AND THEN REVERT TO NORMAL SIZE CAUSING BLURRYINESS AS WELL AS AFFECTING THE ABILITY TO DETERMINE ACCURACY OF OBJECT PLACEMENT AROUND YOU WHEN DRIVING.   THE WINDSHIELD IS A DANGEROUS SAFETY HAZARD PUTTING DRIVERS AT RISK FOR ACCIDENTS.   AFTER JUST DRIVING IT JUST A FEW MILES, I BEGAN TO NOTICE DIZZINESS AND RESULTING NAUSEA FROM OBJECT DISTORTIONS. I ATTEMPTED TO NOT LOOK OUT THAT PORTION OF THE WINDSHIELD AND FOCUSED LOOKING STRAIGHT WERE OBJECTS WERE CLEAR AND ACCURATE TO SIZE/SHAPE. BUT FOR SAFETY REASONS IT IS IMPOSSIBLE TO NEGLECT A LARGE PORTION OF THE VISUAL FIELD WHEN OPERATING MOTOR VEHICLE.",
        "vin": "5J8YD4H50JL"
    }
]