[
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/23/2021",
        "dateOfIncident": "08/21/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430067,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "During the recent rainfall the front passenger side suffered a massive water leak, causing that side of the cabin to flood possibly causing water damage as well. This happened while the car was stationary and also while in motion. This also cause electrical failure to multiple components of the car including the infotainment system, headlights, indicators, engine stop/go among others.",
        "vin": "ZASFAKAN7j7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/18/2021",
        "dateOfIncident": "05/06/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417558,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I orchard my car used, but still under warranty.  Within a week it has shut down with a service engine error.  I was told it was the power control module (PCM) both times.  There's no logical reason,  I know of for a car with only 40K miles on it to have an engine failure such as the  PCM. Both times both dealerships stated that the game was coming from the solenoids and having a misfire caused by the PCM.",
        "vin": "ZASFAKPN6J7"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/13/2021",
        "dateOfIncident": "03/10/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402820,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL GAUGE INSIDE THE CAR SHOWS WRONG READINGS AND YOU CAN RUN OUT OF FUEL",
        "vin": "ZASFAKBN7J7"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/25/2021",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397943,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 ALFA ROMEO STELVIO. THE CONTACT STATED THAT OCCASIONALLY THE VEHICLE SUDDENLY LOSS MOTIVE POWER AND FAILED TO ACCELERATE. THE FAILURE OCCURRED INTERMITTENTLY HOWEVER, THE FAILURE MOSTLY OCCURRED WHILE STARTING THE VEHICLE. THE CONTACT STATED THAT HE LEARNED OF A KNOWN ISSUE WITH THE DIRECT INJECTION WITHIN THE ENGINE. THE CONTACT CONTACTED FULLERTON ALFA ROMEO (1034 US-22, SOMERVILLE, NJ 08876, (877)463-1821) WHO STATED THAT THE MECHANIC WAS UNABLE TO IDENTIFY THE CAUSE OF THE FAILURE. THE DEALER WAS UNABLE TO DUPLICATE THE FAILURE AND CLEARED SOME UNKNOWN DIAGNOSTIC TROUBLE CODES. THE FAILURE PERSISTED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND OPENED A CASE. THE MANUFACTURER RECOMMENDED THAT A COMPLAINT BE FILED WITH NHTSA. THE APPROXIMATE FAILURE MILEAGE WAS 20,000.",
        "vin": "ZASFAKANXJ7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/17/2021",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396594,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ALFA ROMEO USA IS IN MY OPINION HIDING A CONSTANT PROBLEM THEY HAVE WITH STELVIOS. THE OIL TURBO LINE HAS A FAULTY ORING AND LEAKS OIL ONTO ENGINE WHICH CAUSES SMOKE THAT CAN NOT BE HEALTHY TO BREATHE IN. I HAVE TALKED TO SEVERA ALFA DEALERS IN SERVICE DEPTS AND THEY CONFIRM TO ME THAT THEY HAVE FIXED NUMEROUS STELVIOS WITH THIS PROBLEM. THIS SHOULD BE A NATIONAL RECALL FOR REPAIR AT NO COST TO THE CONSUMER. I TUSUALLY HAPPENS CLOSE TO WARRANTIES EXPIRATION NEAR 50K MILES OR SHORTLY AFTER.",
        "vin": "ZASFAKNNXJ7"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/12/2021",
        "dateOfIncident": "01/09/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395879,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS A ISSUE WITH MY VEHICLE TURNING ON FINE THEN ONCE I GOT DOWN THE ROAD IT STARTED TO NOT GO IT COMPLETELY STOPPED IN MID DRIVE ON ME AND THE ENGINE LIGHT AND OIL LIGHT GOING CRAZY. IT STARTED SOUNDING BAD THIS HAS HAPPENED 3 TIMES IT SHOULDN'T BE HAPPENING ON A 2018 THAT'S BEEN UP TO DATE ON MAINTENANCE. I TAKE THE CARE HOME PARK IT FOR A DAY THEN NEVER DAY CRANK IT UP IT CRANKS RIGHT UP AS IF IT DID NOTHING THE DAY BEFORE SOUNDS NORMAL RUNS FINE NO LIGHTS ON AT ALL BUT IT DID THIS 3 TIMES IN 3 MONTHS. SOMETHING IS DEFINITELY MALFUNCTIONING. I ALSO GOT IN A ALFA ROMEO GROUP AND 75 PERCENT OF THE PEOPLE HAS HAD THE SAME ISSUE WITH THEIR VEHICLE RATHER IT BE THE CAR OR SUV OR YEAR THEY ALL HAD THE SAME ENGINE TYPE.",
        "vin": "ZASFAKAN4J7"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/24/2020",
        "dateOfIncident": "10/22/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366179,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ON A HIWAY, WITH CRUSE ON, STOPPED FOR A RED LIGHT. WHILE STOPPED  THE ENGINE SHUT OFF. I PUSHED THE  STOP-START DISABLE BUTTION.  THE CAR  ACCLERATED INTO THE INTERSACTION BEFORE  I  BRAKED IT TO A STOP. LUCKELY THERE WAS NO ONE INFRONT OF ME AND NO CROSS TRAFFIC OR  WE WOULD HAVE WRECKED. THE CAR THEN WENT BACK TO IDLE AND HAS BEEN FINE SINCE.",
        "vin": "ZASFAKBN3J7"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/21/2020",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365495,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WON'T GET UP TO SPEED LIKE IT POST TO. IT TAKES FOREVER FOR THE CAR TO GET UP TO 30MPHS. THEY SAY IT'S A OIL SENSOR PROBLEM.",
        "vin": "ZASFAKPN2JB"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/01/2020",
        "dateOfIncident": "03/15/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362190,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 ALFA ROMEO STELVIO. THE CONTACT STATED THAT THE VEHICLE HAD BEEN TO THE DEALER FIVE TIMES SINCE IT WAS PURCHASED. THE CONTACT STATED THAT THE VEHICLE FAILED TO ACCELERATE OVER 40 MPH AND FREQUENTLY WENT INTO LIMP MODE. THE CONTACT STATED THAT THE ELECTRONIC THROTTLE CONTROL AND CHECK ENGINE WARNING LIGHTS WERE ILLUMINATED. THE VEHICLE WAS TAKEN TO THE FULLERTON ALFA ROMEO DEALER LOCATED AT 1034 US-22, SOMERVILLE, NJ 08876, WHERE IT WAS DIAGNOSED THAT THE TURBO CHARGER NEEDED TO BE REPLACED. THE PART WAS REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND OFFERED TO RETURN THE VEHICLE BACK TO THE DEALER. THE CONTACT WAS NOT SATISFIED AND REQUESTED A TRADE, WHICH THE MANUFACTURER REJECTED. THE CONTACT STATED THAT THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 30,500.",
        "vin": "ZASFAKNN7J7"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/15/2020",
        "dateOfIncident": "06/11/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339475,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN THE HIGHWAY, AROUND 65 - 70 MPH MY PANORAMIC SUNROOF EXPLODED.",
        "vin": "ZASFAKNN7J7"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/04/2020",
        "dateOfIncident": "05/30/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327199,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "21,000 MILES MAY 2 2020 WHILE EXITING MY NEIGHBORHOOD, ELECTRONICS FAILED AGAIN AND THE CAR WOULD NOT ACCELERATE ANYMORE; I WAS STUCK IN THE MIDDLE OF A HEAVILY TRAFFICKED US HIGHWAY, WITH THE RISK TO BE HIT BY OTHER CARS. THE CAR WENT INTO THE NORMAL DRIVE MODE AND I WAS NOT ABLE TO SWITCH TO ECONOMIC OR DYNAMIC DRIVING MODE ANYMORE, CAR WOULD NOT RUN OVER 40MPH. ALL KIND OF WARNINGS STARTED SHOWING UP ON THE DASHBOARD. I HAD TO STOP/START THE CAR A FEW TIMES, AND IT RESUMED FUNCTIONING.    CURRENT MAJOR FAILURE-30/05/2020, CANNOT SAY THE CAR MILEAGE BECAUSE THE DASHBOARD SCREEN TOTALLY BLACKED OUT, 2020.   ALL CUSTOMIZED CONTROLS SETTINGS WENT BACK ON FACTORY SETTINGS AND THE CENTER DASHBOARD ON THE DRIVER SIDE IS COMPLETELY BLACKED OUT. CAR IS BLOCKED IN NORMAL DRIVING MODE WITHOUT THE POSSIBILITY TO SWITCH TO DYNAMIC OR ECONOMIC MODE. ESC WARNING IS ACTIVATED ON THE DASHBOARD.  *TR",
        "vin": "ZASFAKAN2J7"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/22/2020",
        "dateOfIncident": "10/03/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321911,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR HAS BEEN IN THE SERVICE DEPARTMENT MORE THAN 8 TIMES WITH CRACKED RADIATOR, ELECTRICAL PROBLEMS AND RECALLS. IT HAS COME TO A DEAD STOP ON MAJOR HIGHWAY AND ALMOST KILLED US",
        "vin": "ZASFAKAN1J7"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/08/2020",
        "dateOfIncident": "02/09/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316818,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH ONLY 11,000 MILES THE VEHICLE HAS RECEIVED FOUR MAJOR REPAIRS, TWO INCIDENTS COULD HAVE RESULTED IN AN ACCIDENT.  1. BLIND SPOT MONITORING SYSTEM; ONE DAY IN REPAIR SHOP  2. NO RADIO OR NAVIGATION SYSTEM; ONE DAY IN REPAIR SHOP  3. SEIZING-UP OR LOCKING OFF RIGHT-REAR BRAKE PAD THAT GRINDER INTO BRAKE ROTOR.  THIS MADE STEERING DIFFICULT. VEHICLE WAS IN REPAIR SHOP FOR ONE WEEK.   4. MALFUNCTION OF START & STOP SYSTEM,  AND ELECTRONIC THROTTLE CONTROL WHILE DRIVING IN RUSH HOUR INTERSTATE TRAFFIC; NEARLY DISABLING VEHICLE INTRAFFIC. SPEED LIMITED WAS REDUCED TO 25MPH IN A 65MPH HIGHWAY. CAR WAS DISABLED FOR A FEW HOURS BUT ERRORS MYSTERIOUSLY WENT AWAY. DURING THIS EVENT WE DISCOVERED THE ALFA ROMEO IN OUR RESIDENCE CLOSED WITH NO NOTIFICATION. IF VEHICLE REMAINED DISABLED THE NEXT OPTION WILL BE TOO TOW THE VEHICLE TO OMAHA,  NE.",
        "vin": "ZASFAKPN4J7"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/09/2020",
        "dateOfIncident": "12/16/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307971,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MAY 9, 2018, THE VEHICLE UNDERWENT THE RECALL #U36/NHTSA18V-205 TO SEAL THE POTENTIAL WATER INTRUSION THAT WOULD AFFECT THE BODY CONTROL MODULE. HOWEVER, ON DECEMBER 16, 2019, A NOTICEABLE AMOUNT OF WATER WAS LOCATED ON THE PASSENGER FLOOR BOARD AND AFTER DRIVING FOR 20 MINUTES ON THE FREEWAY AT 65 MPH, WE EXPERIENCED WHAT WE FOUND OUT TO BE LATER WATER INTRUSION THAT AFFECTED THE BODY CONTROL MODULE. AS RECALL #U36 DESCRIBES WE EXPERIENCED THE FOLLOWING ISSUES: 1) THE TURN SIGNALS SPONTANEOUSLY ENGAGED AS WELL AS DID NOT ENGAGE WHEN REQUESTED, 2) THE FAN DID NOT OPERATE, 3) THE PASSENGER SIDE FRONT AND REAR DOORS WOULD LOCK/UNLOCK RANDOMLY, 4) A WARNING SYMBOL DISPLAYING ON THE DASH INDICATING THAT THE PROXIMITY SENSORS ARE NOT FUNCTIONING, 5) A WARNING SYMBOL DISPLAYING ON THE DASH INDICATING THAT THE PARKING BRAKE WAS NOT ENGAGING WHILE DRIVING WITHOUT PROMPT FROM THE DRIVER, 6) THE HEADLIGHTS WERE RAPIDLY ALTERNATING FROM HIGH BEAMS TO LOW BEAMS, 7) COMPLETE LOSS OF HEADLIGHT FUNCTION DURING HOURS OF DARKNESS. BASED OFF OF THE AFOREMENTIONED INCIDENT, IT APPEARS THAT EITHER: 1) THE RECALL WAS NEVER PERFORMED ON MAY 9, 2018 AS INDICATED ON THE SCANNED INVOICES OR 2) THE RECALL THAT WAS PERFORMED ON MAY 9, 2018 WAS NOT PROPERLY COMPLETED.   ON JANUARY 3, 2020, THE DEALERSHIP CONSIDERED THE VEHICLE FIXED BY ONLY REPLACING THE BCM. THE DEALERSHIP FAILED TO IDENTIFY THE LOCATION OF WHERE THE WATER ENTERED THE VEHICLE CABIN. THEREFORE, THEY FAILED TO FIX THE UNDERLYING PROBLEM THAT CAUSED THE DAMAGE TO THE BCM AND FUTURE DAMAGE CAN BE EXPECTED TO OCCUR FROM WATER ENTERING THE VEHICLE CABIN.",
        "vin": "ZASFAKNN0JT"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/17/2019",
        "dateOfIncident": "12/14/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289619,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ALPHA ROMERO WHEN DRIVING IN HEAVY TRAFFIC AT HIGHWAY SPEEDS, ACCELERATING AND BRAKING OCCUR TOGETHER AND OFTEN, THE ENGINE WILL CUT OFF AND ALL SYSTEMS BECOME  INOPERABLE.   STOP/START SYSTEM FAILURE SYMBOL APPEARS ON SCREEN.  THIS WILL OCCUR WHEN STOP/START SYSTEM DESPITE HAVING DISENGAGED BY PRESSING BUTTON ON DASHBOARD.  IT TAKES SEVERAL SECONDS FOR THE ENGINE TO COME BACK ON.  DURING THIS INTERVAL, THE CAR CAN NOT BE CONTROLLED. CAR IS MOVING BUT CAN;T BE CONTROLLED BY DRIVER.   ALPHA ROMEO CUSTOMER CENTER IS AWARE OF PROBLEM BUT SAYS THERE IS NO FIX AVAILABLE AT THIS ALTHOUGH THEY HAVE KNOWN ABOUT IT FOR SOME TIME.   IN MY OPINION IS THIS AN EXTREMELY DANGEROUS SITUATION AND AN IMMEDIATE RECALL IS NEEDED TO PREVENT SERIOUS INJURY/DAMAGE.   RECALL IS NECESSARY TO FIT THIS PROBLEM IMMEDIATELY.  THIS HAS HAPPENED MORE THAN ONCE.",
        "vin": "ZASFAKBN9J7"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/05/2019",
        "dateOfIncident": "05/09/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287114,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE'S A PROBLEM CALLED ETC ERROR. IT HAS HAPPENED 5 TIMES SINCE 9500 MILEAGE. AND NOW CAR HAS 15900 MILEAGE. EVERY TIME IT HAPPENED WHEN I WAS ON HIGHWAY TRYING TO ACCELARATE. WHEN THAT PROBLEM OCCURED, I SUDDENLY LOST POWER AND HAD TO PULL OVER IN THE MIDDLE OF TRAFFIC. THEN I NEEDED TO SHUT DOWN THE ENGINE AND RESTARTED, AFTER THIS ACTION POWER WAS BACK ON WITH ENGINE CHECK LIGHT ON, TOO. AND CAR WAS DRIVEABLE WITH AUTO START/STOP AND REMOTE START UNAVAILABLE. I WENT TO DEALSHIPS 3 TIMES. FIRST DEALSHIP CAN'T NOT LOCATE THE PROBLEM AND JUST RESET COMPUTER. SECOND DEALSHIP FOUND ONE PROBLEM AND REPLACED A PART. BUT AFTER A COUPLE THOUSANDS OF MILES, THE PROBLEM HAPPENED AGAIN.  I HAVE TWO VIDEOS, BUT THEY ARE TOO BIG TO UPLOAD.",
        "vin": "ZASFAKNN8J7"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "10/11/2019",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267958,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 ALFA ROMEO STELVIO. THE CONTACT SATED THAT THE FORWARD COLLISION DETECTION SYSTEM FAILED. WHILE DRIVING OVER A BRIDGE, THE AUTOMATIC BRAKING SYSTEM ENGAGED INDEPENDENTLY WITH NO HAZARD AHEAD. THE CONTACT ALSO STATED THAT THE ADAPTIVE CRUISE CONTROL DETECTION SYSTEM ACTIVATED INCORRECTLY. THE SYSTEM DETECTED A VEHICLE ON THE PASSENGER SIDE AND ENGAGED THE BRAKING SYSTEM AS IF THE VEHICLE WERE IN FRONT OF THE CONTACT'S VEHICLE. THE CONTACT STATED THAT THE FAILURES OCCURRED INTERMITTENTLY. THE VEHICLE WAS TAKEN TO THOMPSON MASERATI ALFA ROMEO (303 SWAMP ROAD, DOYLES TOWN, PA 18901, (215)348-0056) TO BE DIAGNOSED, BUT NO ERROR CODES COULD BE FOUND. THE DEALER REALIGNED THE SENSORS, BUT THE FAILURE WAS NOT CORRECTED. THE MANUFACTURER WAS CONTACTED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 11,500.",
        "vin": "ZASFAKEV3J7"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "06/25/2019",
        "dateOfIncident": "06/25/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222521,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING SOUTH BOUND ON THE 605 IN STOP AND GO TRAFFIC. VEHICLE IN FRONT OF ME BROKE AND AS I ENGAGED IN THE  BRAKE IT BECAME UNRESPONSIVE AND SPED UP AFTER I ENGAGED THEM. CAUSING MY VEHICLE TO COLLIDE WITH TWO OTHER VEHICLES",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/16/2019",
        "dateOfIncident": "05/16/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208131,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN A STRAIGHT ROAD (THANK GOODNESS), NO TRAFFIC CLOSE BY, NO OVERPASS AND GOING ABOUT 45MPH. I HEARD WHAT SOUNDED LIKE A SHOT GUN IN MY CAR. I HEARD AIR AND LOOKED UP AND MY SUN ROOF WAS BUSTED. NO WAY ANYTHING HIT IT. I WAS ON TOP OF A BRIDGE WITH NO WALKWAY AND A RIVER ABOUT 5 STORIES UNDERNEATH. I WAS SCARED TO DEATH AND MY POOR DOG IN THE BACK IS STILL TRAUMATIZED. I PULLED OVER AND THE SUNROOF WAS BUSTED ALL AROUND THE EDGES AND A BIG HOLE IN THE MIDDLE PROTRUDING OUT TOWARD THE SKY (NOT INWARD LIKE SOMETHING HIT IT). YOU CAN SEE FROM THE PHOTOS. HAD ROADSIDE SERVICE TOW IT 1HR 45 MINS TO THE DEALERSHIP. OF COURSE THEY ARE SAYING THAT IT IS AN INSURANCE THING AND THERE IS NOTHING THEY CAN DO ABOUT IT.  THEY AREN'T EVEN ACKNOWLEDGING THE FACT THAT THIS HAPPENS. THEY ARE SAYING THAT THEY HAVE NEVER HEARD OF SOMETHING LIKE THIS HAPPENING. THERE IS A ALFA ROMEO FORUM AND I SAW 4 DIFFERENT INSTANCES IN THAT ONE FORUM JUST TODAY.  THE PICTURES ALL LOOK LIKE MINE WITH THE EDGES OF THE SUNROOF ALL BROKEN AND A BIG HOLE IN THE MIDDLE PROTRUDING OUT. IF I HADN'T OF HAD THE SUNSHADE DOWN, THEN GLASS WOULD HAVE RAINED DOWN ON ME AND I THINK I WOULD HAVE WRECKED. RIGHT NOW OUR INSURANCE ISN'T EVEN WANTING TO GIVE US A RENTAL B/C THEY SAY IT IS A MANUFACTURER DEFECT AND THEY NEED TO PAY FOR IT. I SAW THAT THERE IS A CLASS ACTION LAWSUIT ON HYUNDAI DUE TO THE SAME ISSUES.  HOW CAN THE US NOT HAVE BETTER REGULATIONS THAT THIS. IF I WEREN'T GOING SLOW ON A PERFECTLY STRAIGHT ROAD, AS SCARED AS THAT SHOTGUN SOUND MADE ME, I CAN TOTALLY SEE HAVING AN ACCIDENT. THIS IS A SERIOUS PROBLEM THAT NEEDS ADDRESSING OR A WARNING TO THE PUBLIC THAT THE SUNROOFS ARE NOT SAFE.",
        "vin": "ZASFAKNN1J7"
    },
    {
        "components": "WHEELS",
        "crash": true,
        "dateComplaintFiled": "03/03/2019",
        "dateOfIncident": "02/24/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11183764,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "IT IS DISGUSTING THAT AUTO MANUFACTURERS DON'T GIVE A SPARE OR RUN FLATS ON A CAR TODAY. I WAS ON I95 WITH MY FAMILY WHEN MY NEW ONE DAY OLD CAR HAD BLOWOUT AT 10PM AT NIGHT. ALFA ROADSIDE TOOK 6 HOURS TO FIND US. THIS IS SAFETY ISSUE BECAUSE I WAS STUCK SIDE OF THE BLACK DARKEN HIGHWAY WITHOUT SPARE. THE SEMI TRUCK PASSING 12 INCHES AWAY FROM MY CAR DOING 80+ MPH. HOW IS IT IN 2019 MANUFACTURERS CAN SELL A CAR WITHOUT A SPARE OR EVEN FLARES. THE WORST PART ALFA OFFER SPARE AS OPTION BUT SINCE MY CAR CAME WITHOUT IT I CAN'T ORDER A SPARE NO WHERE. ALFA DON'T OFFER TO SENT A SPARE AFTERMARKET. TIRE RACK TOLD ME THAT THEY DON'T HAVE OR ARE AVAILABLE SPARES THAT FIT MY ALFA STELVIO. A SPARE TIRE KIT WEIGH 20 LBS AND HOW MUCH GAS CAN A PERSON SAVE. I WAS TOLD IT IS MPG THING. I AM IN THE DOGHOUSE WITH MY FAMILY AND I HAVE TO BUY ANOTHER FULL SIZE WHEEL AND TIRE TO USED AS MY SPARE. THE CAR HAS 20 INCH WHEELS AND TAKES UP 1/2 TRUNK SPACE. IF I PUT ON ANOTHER ALFA SMALLER RIM LIKE 18 TO SAVE SPACE I WAS TOLD BY MANUFACTURERS MY WARRANTY IS VOID!  I HAVING MY COUSIN IN ITALY SENT ME A DONUT SPARE FOR EMERGENCY. THE SPARE IS FROM ALFA ROMEO STELVIO TI MADE IN ITALY WHEEL THAT HAS SPARES INCLUDED AND SELL AFTERMARKET. THE DEALER SAYS IF I USED I LOSE MY WARRANTY. SAFETY ISSUES BEING STRUCK ON I95 WITHOUT A SPARE. HOW CAN NHTSA MAKE MANUFACTURERS GET AWAY WITH THIS IN 2019. SPARES ARE MORE IMPORTANT THAN ANY OTHER SAFETY FEATURES",
        "vin": "ZASFAKBNXJ7"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/18/2019",
        "dateOfIncident": "02/16/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180842,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO,    I BOUGHT AN ALFA ROMEO STELVIO 2018 ON DECEMBER 31ST 2018, PRE-OWNED WITH 4800 MILES. AT 7900 MILES THE BRAKES WARNING CAME UP, I TOOK THE CAR AT THE ALFA ROMEO DEALERSHIP. THEY REPLACED THE REAR BRAKE PADS AND ROTORS, THEY ALSO MADE ME PAY FOR IT SAYING IT WASN'T UNDER WARRANTY, WHICH I DON'T UNDERSTAND BECAUSE ALFA ROMEO WARRANTY FOR THE BRAKES SERVICE IS UP TO  12,000 MILES OR 1 YEAR ( THE CAR NOW HAS 8100 MILES).    WHILE AT THE DEALERSHIP THEY ALSO DID EARLIER THE 12 MONTHS SERVICE. AFTER SCANNING THE ENTIRE SYSTEM I'VE BEEN TOLD THAT THE CAR WAS IN GREAT SHAPE.     I PICKED UP THE CAR FROM THE DEALERSHIP, AND I WAS DRIVING BACK HOME, AFTER DRIVING ABOUT 60 MILES, THE ENTIRE ELECTRONIC STARTED TO ACT REALLY WEIRD, I WAS GETTING COUNTLESS WARNINGS ON THE DASHBOARD, THE TURN LIGHTS STOPPED WORKING, ALL LIGHTS AROUND THE CAR STARTED RANDOMLY FLASHING, THE CAR STOPPED ACCELERATING, AC SYSTEM STOPPED WORKING THE WINDOWS GOT FOGGY I COULDN'T SEE ANYTHING, I WAS ON THE HIGHWAY RUNNING 60/70 MILES/HOUR, ALMOST GOT INTO AN ACCIDENT WHILE TRYING TO PULL THE CAR OVER ON THE SIDE OF THE ROAD.    THIS IS A BIG SAFETY/RELIABILITY   CONCERN OF MINE, THE CAR TOTALLY STALLED WHILE RUNNING AT 60/70  MILES/HOUR ON A HIGHWAY, PUTTING MY SAFETY/LIFE AT BIG RISK.    THE CAR IS CURRENTLY BACK TO THE DEALERSHIP. I'M SERIOUSLY THINKING TO HAVE THE CAR REPLACED OR REIMBURSED.    IS THERE ANY KIND OF ACTION I CAN TAKE WITH ALFA ROMEO USA TO HAVE THE CAR REPLACED/REIMBURSED?      BEST REGARDS,  *TR",
        "vin": "ZASFAKAN2J7"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/04/2018",
        "dateOfIncident": "11/20/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11156045,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "11/10/18 PICKED UP NEW CAR FROM THE DEALER  11/12, 11/13,11/14, 11/15, 11/19 CAR STARTED & HAD NO ISSUES.  11/20/18 CAR DID NOT START, ENGINE LIGHT INDICATOR IS ON. HAD ROAD SIDE ASSISTANCE BOOST BATTERY. UNSUCCESSFUL. CAR TOWED BACK TO DEALER 0N 11/21/18  11/23 CAR RETURNED, DROVE CAR 11/26/18 WITHOUT ISSUES.  11/27/18 CAR DID NOT START, ENGINE LIGHT & OIL LIGHT INDICATOR ON, CAR TOWED BACK TO DEALER.  12/4/18 CAR RETURNED TO ME AND WORKING. DROVE CAR ABOUT 10-15 MILES, WHILE DRIVING I NOTICED THE ENGINE LIGHT INDICATOR WAS ON WHILE DRIVING. CALLED DEALER WHILE IN CAR,  AND DEALER INSTRUCTED TO RETURN CAR SAME DAY. I DID NOT STOP OR TURN OFF THE CAR UNTIL  I ARRIVED AT THE DEALER ( SAME DAY) I DROVE UP TO SERVICE DEALER PARKING LOT AND TURNED OFF THE CAR.  WHILE WAITING,AT DEALER THE STAFF INFORMED THAT THE CAR DID NOT START, AND THEY HAD TO PUSH THE CAR INSIDE OF THE SERVICE AREA. AS OF THIS REPORT, I DO NOT HAVE A WORKING CAR.",
        "vin": "ZASFAKRN5J7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/13/2018",
        "dateOfIncident": "09/21/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151205,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEPTEMBER 21, 2018 WHOLE COOLER ENGINE FLUID WAS FLUSHED INSIDE IN THE PASSENGER SIDE CAR. THE CAR WAS PURCHASED ON 09-19-2018. THE RECALL HAD BEEN SEEN SINCE 09-14-2018. THE CAR WAS SOLD  TO US  WITH A SAFETY RECALL WITH SAME VIN NUMBER",
        "vin": "ZASFAKEV9J7"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/25/2018",
        "dateOfIncident": "08/12/2018",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131138,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER FUELING UP THE FUEL TANK, THE VEHICLE WAS DRIVEN ON THE HIGHWAY AND SMOKE BEGAN TO EMIT OUT FROM THE VEHICLE'S HOOD. THE DRIVER WAS NOT ALERTED THERE WAS ANY ISSUE FROM THE VEHICLE'S DASHBOARD INDICATOR/WARNING LIGHTS. THE DRIVER PULLED OVER ON THE HIGHWAY SHOULDER AND THE VEHICLE WAS ON FIRE UNTIL THE FIRE/POLICE DEPARTMENT ARRIVED ON SCENE. *DT  UPDATED 10/22/18*JB",
        "vin": "ZASFAKAN3J7"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/17/2018",
        "dateOfIncident": "09/08/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129952,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT MY ALFA ROMEO STELVIO IN NOVEMBER 2017 AND LESS THAN A YEAR, IT GOT TOO MANY PROBLEMS, SOME OF WHICH ARE SERIOUS N GOOD HELP FROM DEALERS.  PROBLEMS:  1.FROM MONTHS, I WAS GETTING ALL LIGHTS OUT INDICATIONS WHERE ALL LIGHTS WORK, WHEN I PUT INDICATOR ON IT GIVES ANNOYING SOUND IN CAR. (THIS HAPPENS WHILE VEHICLE IS IN MOTION & STATIONARY)  2.WHEN IT RAINS OUTSIDE, WATER LEAKAGE IN CAR NEAR FRONT SIDE PASSENGER LEGS ' (THIS HAPPENS WHILE VEHICLE IS IN MOTION & STATIONARY)  3.VOLUME IN CAR RAISES AND HIT MAX AUTOMATICALLY. (THIS HAPPENS WHILE VEHICLE IS IN MOTION)  4.IF I TURN OFF CAR AND GET DOWN WHILE I WAS ON CALL, STILL MEDIA DOES NOT GO OFF UNLESS I MANUALLY DISCONNECT MY PHONE FROM CAR BLUETOOTH.  5.PARKING BREAK GETS AUTO RELEASE WHEN I PRESS ON ACCELERATOR.  6.ONE MORE HUGE STUPID ISSUE FROM ALFA ROMEO. WHILE I WAS DRIVING, I GOT INDICATOR SAYING ENGINE ON/OFF BUTTON NOT AVAILABLE AND WAS HONKING BY ITSELF AND THAT TOO WHEN I WAS DRIVING. WHEN I PULLED OVER FROM TRAFFIC & TURN OFF VEHICLE THEN IT GOES INTO PANIC MODE. THIS IS SO STUPID N SERIOUS. (THIS HAPPENS WHILE VEHICLE IS IN MOTION & STATIONARY)  IMPORTANT NOTE: I UNDERSTAND MOST OF THE ABOVE STATED ISSUES WERE PART OF RECALLS (U34 & U36). STRANGE THING IS WHEN I CHECKED WITH DEALER & ALFA ROMEO PREMIUM CARE, AS PER DOCUMENTATION THE RECALL FIXES WERE DONE ON MY CAR. WHICH MEANS THE RECALL FIXES WERE NOT GOOD ENOUGH TO FIX THE ISSUES, WHICH CAUSED FOR RECALL AND AS STATED BY THE NATIONAL HIGHWAY TRAFFIC SAFETY ADMINISTRATION (NHTSA) THESE ISSUES WILL INCREASE THE RISK OF A CRASH.  SUCH A DISAPPOINTMENT WITH MOST RATED MOTOR TREND OF THE YEAR ALFA ROMEO.  AM JUST GIVING RECENT DATE WHEN HAPPENED, BUT THIS IS HAPPENING FROM LONG AND NOT PROPER SUPPORT FROM DEALER TO FIX IT. WHEN LAST TIME IT HAPPENED I WENT TO DEALER AND LEFT CAR WITH THEM. VISIBILTY WIPER/OTHER PARTS AFFECTED TOO.",
        "vin": "ZASFAKPN5J7"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "08/07/2018",
        "dateOfIncident": "08/07/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118270,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FORWARD COLLISION WARNING SYSTEM ACTIVATED FOR NO REASON. AS I WAS STARTING TO ACCELERATE FROM A TRAFFIC LIGHT ON A CITY STREET IT CAME ON SUDDENLY AND RAPIDLY DECELERATED THE VEHICLE. LUCKILY NO ONE WAS BEHIND ME.",
        "vin": "ZASFAKEV2J7"
    },
    {
        "components": "PARKING BRAKE,POWER TRAIN,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/30/2018",
        "dateOfIncident": "07/30/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114684,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE I WAS DRIVING 15 MPH ON A PRIVATE ROAD, I SUDDENLY LOST POWER STEERING AND POWER BRAKES.  I MANAGED TO BRING THE CAR TO A STOP, BUT I COULDN'T ENGAGE THE PARKING BRAKE, SHIFT OUT OF DRIVE, OR TURN THE CAR OFF.  THE ELECTRONIC SHIFTER, ELECTRONIC PARKING BRAKE, AND ELECTRONIC STARTER WERE ALL UNRESPONSIVE.  I SAW NUMEROUS WARNING MESSAGES ON THE DASHBOARD. ONE OF THEM SAID \"SERVICE SHIFTER.  CONTINUE IN D. DO NOT SHIFT OR TURN ENGINE OFF\", BUT IT DIDN'T TELL ME WHAT I COULD DO TO RETURN THE CAR TO A SAFE STATE.  I KEPT MY FOOT ON THE BRAKE AND CALLED ROADSIDE ASSISTANCE.  I ASKED THEM WHAT MY OPTIONS WERE, AND THEY TOLD ME THAT I COULD WAIT UNTIL THE CAR RUNS OUT OF GAS.  I'M NOT SURE WHAT I DID, BUT I EVENTUALLY GOT THE CARE TO SHUT OFF, BUT IT STAYED IN NEUTRAL, SO I STILL COULDN'T TAKE MY FOOT OFF OF THE BRAKE.  EVENTUALLY A TOW TRUCK ARRIVED AND GOT THE CAR IN TO PARK BY ENTERING THE CARGO AREA BY CLIMBING THROUGH THE BACK SEAT,DISCONNECTING THE BATTERY, AND RECONNECTING IT.",
        "vin": "ZASFAKNN7J7"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/08/2018",
        "dateOfIncident": "07/07/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110074,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DEPRESSED BRAKE CAME TO A STOP THEN ENGINE REVVED UP AND CAR TOOK OFF WHILE FOOT ON BRAKE HAD TO ENGAGE CAR INTO PARK TO GET IT INTO STOP VERY DANGEROUS THIS HAS HAPPENED SEVERAL TIMES REPORTED TO DEALERSHIP AGAIN  SECOND TIME I'VE REPORTED TO NHTSA CAR NOT SAFE TO DRIVE",
        "vin": "ZASFAKAN4J7"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/20/2018",
        "dateOfIncident": "06/15/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102730,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SOMETIMES WHEN BRAKES ARE INITIATED THE ENGINE ACCELERATES AND SPEEDS UP",
        "vin": "ZASFAKAN4J7"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/17/2018",
        "dateOfIncident": "04/15/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11088728,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY 2018 STELVIO IN DEC 2017. I THOUGHT IT WAS ODD THE CAR NEEDED A SOFTWARE UPDATE ONLY ABOUT THREE DAYS AFTER HAVING IT - NOW AFTER RESEARCHING I'VE LEARNED MANY PEOPLE HAVE BROUGHT THEIR NEW ALFA ROMEOS IN FOR \"SOFTWARE UPDATES\" RELATED TO ALL THE SENSORS AND ELECTRICAL SYSTEMS. MY CAR CURRENTLY HAS ABOUT 5K MILES ON IT AND IN THOSE MILES I HAVE EXPERIENCED ON ABOUT 3 OR 4 OCCASIONS A WARNING MESSAGE ON MY DISPLAY THAT READS \"GEAR SELECTOR MALFUNCTION\" OR \"AUTOMATIC TRANSMISSION FAILURE\". THE MESSAGE ALSO TELLS ME FOR BOTH ISSUES NOT TO SHIFT OUT OF \"DRIVE\". AFTER ABOUT 10 SECONDS THE ERROR WENT AWAY. I THOUGHT IT WAS A FLUKE BECAUSE DURING THAT MOMENT I NEVER FELT ANY DIFFERENCE OR EXPERIENCED ANYTHING STRANGE. HOWEVER, I WAS IN A COLLISION WITH A STATIONARY OBJECT (A METAL BARRIER POLE IN A PARKING LOT). I PUT THE VEHICLE IN REVERSE, THE VEHICLE INDICATED IT WAS IN REVERSE AND THE REAR CAMERA DISPLAYED ALONG WITH THE OVERHEAD PICTURE OF THE VEHICLE WITH THE SENSOR LAYOUT. I PROCEEDED TO BACK UP BY PUSHING THE THROTTLE AND THE VEHICLE LAUNCHED FORWARD WITH A HUGE AMOUNT OF FORCE. I STRUCK THE POLE. NO ONE WAS INJURED. NO PROPERTY DAMAGE OTHER THAN TO MY VEHICLE. INITIAL ASSESSMENT IS METAL BUMPER REPLACEMENT, RADIATOR AND COOLING. BUT AIRBAGS NEVER DEPLOYED.  HOWEVER THE SENSORS NEVER INDICATED I WAS NEAR AN OBJECT EITHER WHILE I WAS CLEARLY IN REVERSE. AFTER RESEARCH I FOUND THERE HAVE BEEN A SLEW OF ELECTRICAL ISSUES AS ALFAS ARE DRIVE BY WIRE AND USE SENSORS AND SOFTWARE TO RUN THE VEHICLE AND PEOPLE ARE REPORTING BAD BATTERIES WHICH ARE CAUSING FAULTS. I BELIEVE MY FAULT HAS TO DO WITH A BAD BATTERY WITH LOW VOLTAGE AND MY SENSORS AND SOFTWARE ARE NOT UP TO DATE WHICH I SHOULD BE NOTIFIED ABOUT. I'VE FILED AN INSURANCE CLAIM HOWEVER I WOULD LIKE ESCALATE THIS INCIDENT TO DETERMINE THE CAUSE FOR MYSELF AND OTHERS AND TO PREVENT FUTURE OCCURRENCES.",
        "vin": "ZASFAKNN9J7"
    }
]