[
    {
        "components": "EXTERIOR LIGHTING,STRUCTURE,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "09/16/2018",
        "dateOfIncident": "09/16/2018",
        "fire": false,
        "manufacturer": "Airstream, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129780,
        "products": [
            {
                "manufacturer": "Airstream, Inc.",
                "productMake": "AIRSTREAM",
                "productModel": "INTERNATIONAL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "LOOK AT WHAT I REPORTED TO THE 110TH PRECINCT OF THE NYPD THIS AFTERNOON IN REGO PARK, NYC THERE. WOW. WHEW, I NEVER REALIZED THIS HERE, BUT I KNEW A PART OF THE LIE EB THERE B/T JUNCTION BLVD AND 97 ST THERE WAS BLOCKED OFF WITH TWO LANES THERE CAUSING ME TO USE ANOTHER SIDE ROAD THERE BECAUSE A WESTERN EXPRESS TRACTOR TRAILER THERE TRIED TO GO INTO AN UNDERGROUND MALL PARKING LOT. I WENT TO MONTESSORI ELEMENTARY SCHOOL IN THAT AREA AND THEY PUT A MALL THERE IN THAT SPOT IN REGO PARK, NYC ON JUNCTION BL AND THE LIE SERVICE RD EB THERE AND THE TRACTOR TRAILER COULD NOT MAKE IT UNDER THE UNDERGROUND PARKING LOT THERE CAUSING THE LIE EB SERVICE ROAD B/T JUNCTION BL AND 97 ST THERE TO BE BLOCKED OFF THERE. WHEWWW. YES, IS IT ALLOWED UNDER US DOT THERE AND LIKE FHWA FOR TRACTOR TRAILERS TO LIKE GO INTO LIKE UNDERGROUND PARKING LOTS THERE WHERE THEY CAN TRY TO SQUEEZE THEIR TRUCK INTO AN UNDERGROUND PARKING LOT THERE??? OR IS THAT A VIOLATION OF NYS DMV RULES AND US DOT RULES THERE TO TRY TO SQUEEZE A TRACTOR TRAILER OF WESTERN EXPRESS UNDER TO GET INTO AN UNDERGROUND PARKING LOT LIKE I REPORTED TO THE NYPD 110 THERE TODAY AROUND 4 PM ON SUNDAY??? WAS THE TRACTOR TRAILER OF WESTERN EXPRESS IN VIOLATION IN REGO PARK, NYC THERE OR NO??? DANGEROUS ACT THERE. I KNOW WITH THE SOUTHERN ST PARKWAY THEY DO NOT ALLOW BUSES ON THE PARKWAY DUE TO LOW BRIDGES THERE.",
        "vin": ""
    }
]