[
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/28/2022",
        "dateOfIncident": "11/26/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449278,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The headlight assemblies are poorly designed and accumulate moisture. The water condenses on the inside of the headlight housing reducing lighting output. In sub zero temperatures the condensation freezes, further reducing light output. The reduced light output reduces the amount of usable light illuminating the roadway. The water/ice can also produce reflections/glare which may impair oncoming drivers' vision. The dealer has inspected the headlight but refuses to replace it under their factory warranty.",
        "vin": "5J8TB4H72JL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/21/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425838,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Acura RDX. The contact stated that the vehicle intermittently hesitated while depressing the accelerator pedal. The failure also recurred while switching lanes or passing other vehicles. The contact also stated that the vehicle would lunge forward soon after hesitation without warning. The contact had taken the vehicle to a dealer where they were unable to duplicate the failure. The manufacturer was not notified of the failure. The vehicle was not repaired. The failure mileage was approximately 34,700.",
        "vin": "5j8tb4h52jl"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "06/28/2021",
        "dateOfIncident": "06/24/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422538,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Automatic emergency braking would not release…this occurred in the rain…it caused the vehicle to hydroplane, spin out, and hit a barricade.",
        "vin": "5j8tb3h76jl"
    },
    {
        "components": "SEATS",
        "crash": true,
        "dateComplaintFiled": "06/15/2021",
        "dateOfIncident": "04/22/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11420981,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "1. I suffered a seatback failure in my 2018 Acura RDX when I was rear-ended at a high speed. The car is currently with my insurance company but I'm sure it's available for inspection. 2. The seatback failure made a big enough gap between my seat and seatbelt for me to slip completely under my seatbelt. I landed on the backseat floor after I smacked my head on the side rear airbag. I have multiple injuries from the seatback failure and my children would have been hurt from this failure had they been in the car with me. 3. N/A 4. The vehicle was totaled. The insurance adjuster said all seats \"had shifted\". I asked if that was another word for \"broken\". He said \"yes\".  5. No warnings appeared. The car was in perfect working order.",
        "vin": "5j8tb4h77jl"
    },
    {
        "components": "STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "04/27/2020",
        "dateOfIncident": "04/25/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11322456,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE WAS PARKED, RUNNING AND UNOCCUPIED ON THE STREET. MY WIFE ENTERED FROM THE PASSENGER SIDE REACHING IN TO RETRIEVE SOMETHING FROM THE CENTER CONSOLE. SHE PRESSED THE START/STOP ENGINE BUTTON TO SHUT OFF THE VEHICLE. THE CAR STARTED ROLLING BACKWARDS DOWN A HILL, KNOCKING MY WIFE TO THE GROUND CAUSING INJURY. CAR CONTINUED TO ROLL UNTIL IT STRUCK A TREE.",
        "vin": "5J8TB4H30JL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/16/2020",
        "dateOfIncident": "01/16/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299945,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 ACURA RDX. THE CONTACT STATED THAT WATER ENTERED THE HEADLAMPS OF THE VEHICLE DUE TO A STRESS FRACTURE. THE CONTACT STATED THAT AFTER EXAMINATION IT WAS DETERMINED THAT NO IMPACT HAD OCCURRED TO CAUSE THE FRACTURE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC AND THE HEADLAMPS WERE REPLACED HOWEVER THE FAILURE RECURRED. THE CONTACT STATED THAT THE DRIVER'S SIDE REAR TURN LAMP INDICATOR BLINKED AT AN EXCESSIVE RATE DUE TO A SIMILAR FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 25,000.",
        "vin": "5J8TB4H78JL"
    },
    {
        "components": "SEATS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/19/2019",
        "dateOfIncident": "07/21/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190046,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON ACQUIRING THE VEHICLE, I IMMEDIATELY NOTICED THAT THE CAR MAKES ME SICK. THE ISSUE WAS WITH THE STRONG FUMES CAUSED BY ARTIFICIAL LEATHER. ON FEW OCCASIONS I FELT SO DIZZY THAT I WAS UNABLE TO DRIVE, AS IT WOULD BE UNSAFE. AT LEAST ONE MORE PERSON ALSO FELT SICK IN THIS CAR. OBVIOUSLY, WHEN A VEHICLE MAKES A PERSON SICK, IT IS A SAFETY ISSUE. THE DRIVER CANNOT PROPERLY OPERATE THE VEHICLE.   ALL CONVECTIONAL METHODS, SUCH AS VENTILATION AND DEEP CLEANING, DID NOT IMPROVE THE TOXIC FUMES.    I CONTACTED ACURA WITH NO AVAIL. THEY OPENED A CASE # 08920583. THE CASE MANAGER APRIL STATED THAT THE NUMBER OF PEOPLE WHO MAY GET SICK FROM THIS MATERIAL WAS VERY SMALL AND THEREFORE ACURA WAS NOT GOING TO MITIGATE THE PROBLEM. ACURA IS APPARENTLY AWARE THAT THERE ARE SOME PEOPLE, WHO MAY BECOME SICK WHILE DRIVING THEIR VEHICLES.",
        "vin": "5J8TB4H34JL"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/07/2019",
        "dateOfIncident": "01/22/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11175016,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "A WESTBOUND DISTRACTED DRIVER SWERVED INTO MY LANE AT A HIGH RATE OF SPEED AND MY AUTOMATIC BRAKING SYSTEM SLOWED ME TO THE POINT THAT I COULD NOT GET OUT OF THE WAY OF THE ONCOMING VEHICLE CAUSING MY VEHICLE TO ROLL OVER FOLLOWING IMPACT (SEE ATTACHED HSMV CRASH REPORT NUMBER 87263383).",
        "vin": "5J8TB4H33JL"
    },
    {
        "components": "STRUCTURE,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/21/2019",
        "dateOfIncident": "01/10/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171119,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE HAD THIS CAR A YEAR.  WITHING 6 MONTHS SHIFTER WOULD NOT SHIFT BACK TO PARK AND COULDNT TURN CAR OFF.  DEALER FOUND ACORNS JAMMED IN TRANSMISSION SOMEWHERE FELT TO BE DUE TO SQUIRRELS OR OTHER RODENTS.  THIS MONTH EMISSONS LIGHT CAME ON.  FOUND FUEL LINE LEAKING DUE TO ANIMALS CHEWING ON IT.  NOT COVERED UNDER WARRANTY.  $1100 TO FIX.  I FEEL THE ENGINE HOUSING IS NOT WELL SEALED ALLOWING THIS TO HAPPEN  HAVE NEVER HAD THIS ISSUE WITH ANY OTHER CARS WHICH HAVE BEEN PARKED IN SAME PLACE FOR LONG PERIODS OF TIME.  FEEL IT SHOULD BE FIXED UNDER WARRANTY TO PREVENT IT FROM HAPPENING AGAIN. VEHICLE SITS OUTSIDE DRIVEN TWICE A WEEK.",
        "vin": "5J8TB3H58JL"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/30/2018",
        "dateOfIncident": "12/30/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164132,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TODAY (12/30/18) OUR BRAND NEW 2018 ACURA RDX'S SUNROOF EXPLODED WHILE DRIVING ( STRAIGHT ROAD, NORMAL HIGHWAY SPEED, EXCELLENT WEATHER CONDITIONS AND LIGHT TO NO SUNDAY MORNING TRAFFIC). THE SOUND WAS A LOUD AND INTENSE POP OVERHEAD......THE GLASS SUNROOF WAS COMPLETELY SHATTERED. WE IMMEDIATELY CLOSED THE HEADLINER ROOF SHADE TO PROTECT US. WITHIN A MINUTE OR SO THE GLASS STARTED TO BREAK APART AND HIT THE HIGHWAY. WE GOT OFF THE HIGHWAY AS SOON AS WE COULD. THEN GOT OUT TO ACCESS THE DAMAGE. NO SIGN OF ANY EXTERNAL IMPACT! WE THOUGHT IT HAD TO BE A FREAK ENGINEERING DEFECT IN THE GLASS. WE EXPECT ACURA TO TELL US THAT \"THEY HAVE NEVER HEARD OF SUCH A THING BEFORE\" WHEN WE BRING THE CAR IN TO THE DEALERSHIP IN THE MORNING. WE'LL SEE HOW HONEST THEY ACTUALLY ARE.  NOW I KNOW WE ARE NOT THE FIRST THIS HAS EVER HAPPENED TO! THANKFULLY ONLY A LITTLE BLOOD LOSS CLEANING OUT THE GLASS FROM THE ROOF. CALL IT LUCK? THE SCARE ALONE COULD GIVE YOU A HEART ATTACK!",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/29/2018",
        "dateOfIncident": "08/28/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11143782,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MY GAS CAP WARNING LIGHT KEPT GOING ON IN SPITE OF MY LOOSENING IT AND TIGHTENING IT AND THEN MY EMISSION SYSTEM LIGHT CAME ON, I BROUGHT THE CAR TO THE DEALER. THEY FOUND THAT THERE WAS A LEAK IN THE CONNECTION BETWEEN THE FILLER PIPE AND THE GAS TANK. BOTH HAD TO BE REPLACED ON A CAR WITH 3,037 MILES ON IT. IN THE PROCESS, I WAS GIVEN FALSE INFORMATION ABOUT THE WORK THAT WAS DONE, WHICH I DID NOT DISCOVER UNTIL A SECOND INCIDENT IN WHICH THE REAR PROPELLOR SHAFT CAME LOOSE FORCED THEM TO EXPLAIN WHAT HAPPENED.",
        "vin": "5J8TB4H79JL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/29/2018",
        "dateOfIncident": "10/17/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11143796,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS RELATED TO COMPLAINT #11143782. TWO MONTHS AFTER MY GAS TANK WAS REPLACED DUE TO A FAULTY CONNECTION BETWEEN IT AND THE FILLER PIPE, THE BOLTS HOLDING THE REAR PROPELLOR SHAFT CAME LOOSE AS I WAS DRIVING ON A BUSY CITY STREET, MAKING THE CAR UNDRIVABLE. AT THAT TIME, MY CAR HAD 3761 MILES ON IT. THE CAR HAD TO BE FLATBED TOWED TO THE ACURA DEALER, WHERE I WAS TOLD THAT THE BOLTS HAD \"BACKED OUT AND THE SHAFT WAS RUBBING ON SAFETY HOLDERS.\" THE BOLTS WERE REPLACED WITH OEZM BOLTS WITH LOC-TITE.",
        "vin": "5J8TB4H79JL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/17/2018",
        "dateOfIncident": "10/15/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141033,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING NORTHBOUND ON I-17 IN PHOENIX, APPROXIMATELY 70-75 MPH WITH LIMITED TRAFFIC.  THE SUNROOF EXPLODED.  ACURA REFUSED TO REPAIR THE FAULTY SUNROOF AND I WAS REFERRED TO INSURANCE.",
        "vin": "5J8TB3H73JL"
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/24/2018",
        "dateOfIncident": "02/10/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131086,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE VEHICLE IN DEC 2017. SINCE DEC 2017, THE VEHICLE HAS BEEN IN THE SERVICE CENTER AT THE DEALER 3 TIMES FOR A TOTAL OF 2.5 MONTHS DUE TO SOUNDS WITH THE STEERING COLUMN - SPECIFICALLY THE LOCATION OF THE DRIVER AIRBAG WITHIN THE STEERING COLUMN UNDER THE HORN. THE SOUND WAS IDENTITIED WITHIN THE FIRST 2,000 MILES OF BEING A NEW VEHICLE. THE SOUND BECOMES PRONOUNCED WHEN THE STEERING WHEEL IS ROTATED 180 DEGREES AND FEELS LIKE IT IS PULLING ON AN ITEM UNDER THE PLASTIC COVER ABOVE THE AIRBAG. THE AIRBAG WAS REMOVED FROM THE STEERING COLUMN AND WHEN THE AIRBAG WAS MOVED AROUND, THERE WAS A SOUND SIMILAR TO THE SOUND FROM THE STEERING WHEEL WHEN TURNED. THE ACURA TECH TEAM HAS BEEN INFORMED. THIS SOUND WAS EVIDENCED TO BE IN ACURA MODEL YEARS 2017 AND 2018. THE SOUND IN THE STEERING COLUMN/AIRBAG LOCATION BECOMES EVEN MORE PRONOUNCED AS MORE MILES ARE PUT ON THE VEHICLE. ACURA WILL NOT INVESTIGATE FURTHER AS THE MODEL HAS BEEN REDESIGNED AND THEY DO NOT WANT TO BE INVOLVED IN ADDITIONAL RECALLS. I HAVE DRIVEN NUMEROUS OTHER ACURA LOANER VEHICLES AND NO OTHER ACURA VEHICLES HAVE MADE THIS SOUND IN THE STEERING COLUMN/AIR BAG.  THE SOUND STARTS TO OCCUR AFTER THE STEERING COLUMN HAS BEEN ROTATED TO THE LEFT OR RIGHT 180 DEGREES - SUCH AS GOING UP OR DOWN A PARKING RAMP. ONCE THE SOUND HAS STARTED, IT PERSISTS AND CONRINUES TO GET LOUDER OVER TIME. I HAVE ONLY 7800 MILES ON MY VEHICLE, BUT THE SOUND WAS ALSO RECORDED IN VEHICLES WITH OVER 20,000 MILES. I FEEL THIS SOUND COULD BE THE AIRBAG BEING CAUGHT IN THE ROTATION OF THE STEERING COLUMN. THE CONCERN IS THE AIRBAG WILL ARTIFICIALLY DEPLOY AFTER USE, AS THE SOUND BEING HEARD IS COMPARABLE TO A BAG BEING TWISTED OR AN ELEMENT WITHIN THE STEERING COLUMN RUBBING AGAINST ANOTHER ITEM.",
        "vin": "5J8TB4H78JL"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/16/2018",
        "dateOfIncident": "10/10/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120380,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE CORNERING THE CAR STALLS/HESITATES WITH NO POWER.  OCCURS AT LOW SPEED.HAS OCCURRED NUMEROUS TIMES ON CITY STREET SINCE PURCHASE OCT.5,2017. DEALERSHIP COULD NOT SIMULATE BUT FAILED TO DO ANY TESTING ?",
        "vin": "5J8TB3H70JL"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/16/2018",
        "dateOfIncident": "07/16/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111644,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS PULLING IN TO A PARKING SPACE AT WORK, MILDLY STEPPED ON GAS AS I PULLED IN AND PLACED FOOT ON BRAKE TO STOP CAR WHEN I PARK BUT THE CAR ACCELERATED ON ITS OWN, TIRES SCREECHED AND CAR WENT OVER CURB AND ALMOST RAN INTO TREE.  SEE PICTURE ATTACHED.  I SLAMMED ON THE BRAKES AND THE CAR STOPPED.  THE SOUND FROM THE INSIDE SEEMED I DAMAGED MY BUMPER FOR SURE BUT WHEN I INSPECTED, NO DAMAGE TO THE CAR (AT LEASE VISIBLY).  BUT SURE IS SCARY TO DRIVE THE CAR NOW.  I LEASED THE CAR ABOUT A MONTH AGO AND I CONTACTED THE DEALER VIA PHONE AND ON EMAIL AWAITING RESPONSE.",
        "vin": "5J8TB3HJLO1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/12/2018",
        "dateOfIncident": "06/17/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11111014,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 ACURA RDX. WHILE THE VEHICLE WAS IDLING AND PARKED ON AN INCLINE, THE CONTACT EXITED THE VEHICLE, OPENED THE TAILGATE, AND THE ALARM SOUNDED. THE CONTACT WALKED OVER TO THE DRIVER'S SIDE DOOR, WHICH WAS AJAR, BUT THE VEHICLE BEGAN TO ROLL AND KNOCKED THE CONTACT OVER. THE VEHICLE STOPPED WHEN IT WAS ON LEVEL GROUND. THE CONTACT SUSTAINED INJURIES TO THE RIBS AND A FRACTURED PELVIS, WHICH REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO THE LOCAL DEALER (PRIME ACURA, 395 PROVIDENCE HIGHWAY, WESTWOOD, MA 02090, (508) 921-1900), BUT THEY WERE UNABLE TO DUPLICATE THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED AND REQUESTED TO INSPECT THE VEHICLE. THE FAILURE MILEAGE WAS 6,000.",
        "vin": "5J8TB4H36JL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/03/2018",
        "dateOfIncident": "03/26/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083108,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 ACURA RDX. WHILE THE VEHICLE WAS PARKED, RODENTS ENTERED THE ENGINE COMPARTMENT AND CHEWED ON THE BATTERY CABLE AND SEVERAL WIRING HARNESSES LOCATED UNDER THE HOOD OF THE VEHICLE. THE VEHICLE WAS TAKEN TO ACURA OF OCEAN (909 NJ-35, OCEAN TOWNSHIP, NJ 07712, (732) 776-5200) WHERE IT WAS DIAGNOSED THAT THE AFFECTED WIRES NEEDED TO BE REPLACED. THE VEHICLE WAS CURRENTLY BEING REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 3,000.",
        "vin": "5J8TB4H50JL"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/18/2018",
        "dateOfIncident": "01/16/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063617,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ANOTHER DRIVE ADVISED US THE BRAKES LIGHTS WERE NOT FUNCTIONING. DEALERS TOLD US THAT THE UNIT CAME WITHOUT A RELAY POWER FOR THE BREAK LIGHTS AND PICK ONE FROM ANOTHER CAR TO MAKE THE REPLACEMENT.",
        "vin": "5J8TB3H36JL"
    }
]