[
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/18/2019",
        "dateOfIncident": "12/17/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289976,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CRANK HUB WILL BE PRONE TO SPIN AND THEREFORE WILL DESTROY ENGINE WHICH WILL REQUIRE A FULL ENGINE REPLACEMENT.  *TR",
        "vin": "WBS8M9C58J5"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/04/2019",
        "dateOfIncident": "03/30/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193822,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO, I HAVE A 2018 BMW M3 THAT IS ABOUT 12 MONTHS OLD. THERE WAS A SIRIUS XM (SATELLITE RADIO) TRIAL PERIOD OF 1 YEAR, AND NOW THAT IT IS ABOUT TO EXPIRE, THERE IS AN ADVERTISEMENT IN MY NAVIGATION WINDOW THAT COMES UP EVERY TIME I TURN ON THE CAR, THAT HAS TO BE CLEARED VIA PRESSING \"OK\" OR ELSE IT DOESN'T GO AWAY.    THE SAFETY CONCERN IS THAT IF I TURN ON THE CAR AND GO INTO REVERSE, THE REVERSE CAMERA WILL SHOW BUT GETS INTERRUPTED BY THE SIRIUS XM ADVERTISEMENT, AND DOESN'T COME BACK UNTIL THE ADVERTISEMENT TO RENEW IS MANUALLY CLEARED OUT.    I ALMOST REVERSED OVER A PEDESTRIAN IN A PARKING LOT WHEN THIS HAPPENED THE FIRST TIME.     I HAVE SPOKEN TO BMW AND SIRIUS AND BOTH PARTIES POINT FINGERS AT THE OTHER SIDE, ALTHOUGH THE PROBLEM IS DEFINITELY A BMW PROBLEM. CHECK THIS FORUM FOR MORE INFORMATION ON THIS -     HTTPS://F80.BIMMERPOST.COM/FORUMS/SHOWTHREAD.PHP?T=1450130    THE WORST PART ABOUT THIS IS THAT BMW IS SAYING THIS IS NOT A WARRANTY-COVERED ISSUE AND THAT I NEED TO PAY MY BMW SERVICE SHOP $188 TO HAVE THEM \"DIAGNOSE\" THE PROBLEM.    THEY NEED TO ADDRESS THIS ISSUE IMMEDIATELY. I BELIEVE THE IMPETUS FOR THIS \"HOTFIX\" CAN BE FROM AN AGENCY SUCH AS YOURSELF.    THANK YOU.",
        "vin": "WBS8M9C57J5"
    }
]