[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/17/2021",
        "dateOfIncident": "03/16/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403480,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE'S REAR LIFTGATE HAS OPENED RANDOMLY SEVERAL TIMES WITHOUT NOTICE OR WITHOUT INPUT FROM THE USER. THE FIRST INCIDENT WAS WHEN BACKING OUT OF A PARKING SPOT, THE REAR LIFTGATE OPENED SUDDENLY. THIS IS CONCERNING BECAUSE IT WAS A BUSY PARKING LOT AND OUR DOG WAS IN THE CAR AND BEGAN TO JUMP OUT OF THE VEHICLE AND COULD HAVE JUMPED INTO MOVING TRAFFIC. ANOTHER INCIDENT OCCURRED IN OUR DRIVEWAY WHERE THE VEHICLE WAS PARKED AND UNLOCKED AND UNOCCUPIED. WE NOTICED THAT THE HATCH HAD OPENED BY ITSELF AT SOME POINT WITHOUT ANY INPUT FROM ANYONE. I DO NOT WANT TO WAIT FOR AN ADDITIONAL INCIDENT TO OCCUR WHICH COULD LEAD TO THE INJURY OR DEATH OF AN OCCUPANT, HUMAN OR OTHERWISE. OUR VEHICLE IS OUTFITTED WITH A FACTOR TOW HITCH SO WE BELIEVE THAT THE CAR DOES NOT HAVE THE CAPABILITY OF HANDS-FREE LIFTGATE OPENING WITH A 'KICK' MOTION. WE DO NOT KNOW IF THE SENSORS FOR THIS FEATURE ARE STILL INSTALLED BUT DISABLED AND/OR IF THEY BECAME ENABLED BY MISTAKE THROUGH A SOFTWARE UPDATE AT THE DEALERSHIP.",
        "vin": "5UXTS3C51J0"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/13/2021",
        "dateOfIncident": "01/13/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387846,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING  AT 60 MPH THE ELECTRONIC DASHBOARD COMPLETELY SHUT OFF. IT  RESTARTED ITSELF AFTER SOME  30 SECONDS. WHEN IT REAPPEARS IT DOES NOT  SHOW CORRECT SPEED, IT STARTS AT 0 AND WORKS ITS WAY UP TO THE CORRECT SPEED. I HAVE BEEN UNABLE TO GET A PICTURE OF THE DASHBOARD AS IT HAS HAPPENED WHILE DRIVING AT SPEEDS THIS CAR HAD PREVIOUS DASHBOARD PROBLEMS WITH THE DASH SLIDING TO THE LEFT. THIS WAS BROUGHT TO THE DEALER FOR CORRECTION. THIS IS DIFFERENT. IT IS A  MOMENTARY COMPLETE DASH FAILURE.",
        "vin": "5UXTR9C59JL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/27/2020",
        "dateOfIncident": "10/23/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366680,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DIGITAL IMAGE OF SPEEDOMETER AND TACHOMETER NEEDLES SHIFTED TO THE LEFT MAKING IT IMPOSSIBLE TO ACCURATELY READ THE SPEED OF THE VEHICLE.  CONSISTENT WHEN VEHICLE STATIONARY OR IN MOTION; NEEDLE POSITION WOULD CHANGE WHILE IN MOTION AND CHANGING SPEEDS BUT MAJORITY OF \"NEEDLE\" NOT VISIBLE.  DID NOT RESET AFTER RESTARTING THE VEHICLE SEVERAL TIMES.  DID RESET AFTER A FEW DAYS.",
        "vin": "5UXTR9C53JL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/26/2020",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351328,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 BMW X3. THE CONTACT STATED THAT WHILE HER HUSBAND WAS DRIVING AT 80 MPH, THE COOLANT LEVEL LOW, DRIVE AT A MODERATE SPEED WARNING MESSAGE HAD APPEARED ON HER INSTRUMENT PANEL. THE CONTACT'S HUSBAND CONTINUED TO DRIVE AT A MODERATE SPEED AS ADVISED, SOON AFTER, THE PULL OVER, STOP THE CAR WARNING MESSAGE ALSO ILLUMINATED ON THE INSTRUMENT PANEL AND HER HUSBAND PROCEEDED AS ADVISED. DUE TO THE FAILURE, THE CONTACT'S HUSBAND HAD THE VEHICLE TOWED TO THE AUTOMASTER BMW (3328 SHELBURNE RD #3, SHELBURNE, VT 05482). THE DEALER INFORMED THE CONTACT THAT THEY DISCOVERED A COOLANT LEAK AND THAT A PART NEEDED TO BE ORDERED TO REPAIR THE VEHICLE. PRIOR TO THE FAILURE, THE CONTACT STATED THAT THE SAME COOLANT LEVEL WARNING MESSAGE HAD APPEARED ON THE INSTRUMENT PANEL. THE CONTACT HAD TWICE TAKEN THE VEHICLE TO SOUTH SHORE BMW(1040 HINGHAM ST, ROCKLAND, MA 02370) WHERE THEY NEVER DISCOVERED A COOLANT LEAK AND WOULD TOP OFF HER COOLANT LEVELS EACH TIME SHE VISITED THE DEALER FOR THE SAME MATTER. THE DEALER WAS THEN NOTIFIED AGAIN OF THE LATEST FAILURE AND THE CONTACT WAS INFORMED THAT THE FAILURE WAS DUE TO NORMAL VEHICLE OPERATION, THEY OFFERED NO FURTHER ASSISTANCE WITH THE FAILURE.  THE VEHICLE REMAINED IN THE POSSESSION OF THE AUTOMASTER BMW(3328 SHELBURNE RD #3, SHELBURNE, VT 05482) AND HAD YET TO BE REPAIRED. THE MANUFACTURER HAD YET TO BE NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 6,000.",
        "vin": "5UXTS3C52J0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/01/2020",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323000,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF \"EXPLODED\" WHILE DRIVING CAUSING GLASS TO FLY EVERYWHERE.",
        "vin": "5UXTR9C52JL"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/27/2020",
        "dateOfIncident": "05/15/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319429,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 BMW X3. THE CONTACT STATED WHILE DRIVING AT 65-70 MPH, THE VEHICLE BECAME UNSTABLE. THE CONTACT STATED THAT SEVERAL UNKNOWN WARNING LIGHTS WERE ILLUMINATED. THE CONTACT REDUCED THE VEHICLE SPEED AND REGAINED CONTROL OF THE VEHICLE. THE VEHICLE WAS TAKEN TO WIDE WORLD OF CARS BMW LOCATED AT (125 NY-59, SPRING VALLEY, NY 10977) TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE FAILURE WAS DUE TO TIRE TREADWEAR. THE TIRES WERE NOT REPLACED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 14,000.",
        "vin": "5UXTR9C54JL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/20/2020",
        "dateOfIncident": "08/31/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318853,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUNK OPENS RANDOMLY BOTH WHILE PARKED AND MOVING.  SOMETIMES WHILE DRIVING AT LOW SPEEDS.  I OFTEN FIND THE TRUNK OPEN IN THE PARKING LOT AFTER LOCKING IT.      ALSO, THE ALARM WILL GO OFF WHILE DRIVING.",
        "vin": "5UXTR9C5XJL"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/22/2019",
        "dateOfIncident": "12/22/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290747,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS PARKING WHEN I TOTALLY LOST CONTROL OF MY CAR. I COULD NOT STEER IT AND I COULD NOT BREAK. I WENT LEFT WHILE I WAS ATTEMPTING  TO BRAKE BUT I HAD NO BRAKES. I ATTEMPTED TO GO STRAIGHT AND HIT ONE PARKED CAR. THEN I WENT RIGHT AND DAMAGED ANOTHER CAR THEN THE CAR HIT A 3 CAR. THEN THE CAR STOPPED. I RECEIVE A BMW ASSIST MESSAGE REGARDING HAVING AN ACCIDENT THEN THE SCREEN WENT DEAD.  I WAS PARKING MY CAR. FEW WEEKS BEFORE I RECEIVED THE FOLLOWING MESSAGE: CHASSIS STABILIZATION PROBLEMS.   YOU CAN CONTINUE DRIVING BUT TAKE YOUR CAR TO THE DEALER ( SOMETHING LIKE THAT). I STOPPED THE CAR AND  THE MESSAGE WENT AWAY. NEVER CAME BACK. SO I WAS PLANNING TO TALK ABOUT IT TO THE DEALER WHEN GOING FOR THE NEXT APPOINTMENT.  I WAS PARKING IN A PLACE I KNOW VERY WELL,  HISPITAL PARKING.",
        "vin": "5UXTR9C53JL"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/17/2019",
        "dateOfIncident": "07/17/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232794,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "UNCOMMANDED OPENING OF THE REAR HATCH WHILE THE VEHICLE WAS IN MOTION. THIS HAS HAPPENED ON FOUR OCCASIONS. THE FIRST TIME WAS ON MD ROUTE 29 NEAR THE ROUTE 175 INTERSECTION. THE SECOND WAS ON GOSHEN VIEW DR GAITHERSBURG MD. THE THIRD AND FOURTH WERE ON GOSHEN RD, GAITHERSBURG MD.",
        "vin": "5UXTS3C52J0"
    },
    {
        "components": "ELECTRICAL SYSTEM,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "06/04/2019",
        "dateOfIncident": "03/01/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217855,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 BMW X3. WHILE REVERSING THE VEHICLE, THE REARVIEW CAMERA SPONTANEOUSLY BLACKED OUT INTERMITTENTLY. THE FAILURE RECURRED FOUR TIMES. THE VEHICLE WAS TAKEN TO ADVANTAGE BMW CLEAR LAKE (400 GULF FWY S, LEAGUE CITY, TX 77573, (281) 557-7000) WHERE THEY INFORMED THE CONTACT THAT THE SOFTWARE WAS UPDATED. THE VEHICLE WAS REPAIRED; HOWEVER, THE FAILURE PERSISTED. THE VEHICLE WAS TAKEN BACK TO THE SAME DEALER WHERE IT WAS DIAGNOSED THAT THE CAMERA NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED; HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 20,600.",
        "vin": "5UXTR9C56JL"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "04/19/2019",
        "dateOfIncident": "07/28/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11202592,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BMW 2018 X3 STEERING WHEEL ***WENT OUT OF CONTROL*** FOR UNKNOWN REASON AND TOOK OVER MY DRIVING ON HWY 84 WHEN I WAS GOING ABOUT 62 MILES, IT GEARED TO LEFT ON ITS OWN.  THE CAR EVENTUALLY HIT CENTER DIVIDER DURING THE COURSE OF TRYING TO AVOID OTHERWISE POSSIBLY SEVERE COLLISION. X3 ENTIRE LEFT SIDE DAMAGED, CALLED 911, CAR TOWED.   CONTACTED BMW NA AND LOCAL DEALER IN FREMONT CALIFORNIA, CAR TESTED, REPORTED BACK WITH NO PROBLEM. BMW OFFERED NO EXPLANATION OF WHY IT HAPPENED. NOR DID ANY REMEDY OFFERED FOR CAR DAMAGE, ESTIMATED REPAIR COST OF $13000, ASIDE FROM STRESS CAUSED AFTER SUCH A TRAUMATIZING INCIDENT.  THE BLACK BOX WHICH SUPPOSED TO RECORD CAR ACTUAL STATUS, BMW REPLIED FOUND NO ERROR CODE.  I BELIEVE THERE WERE MANUFACTURE DEFECTS BECAUSE THE X3 WENT THRU ONE RECALL AND THEN TRUNK POP OPENED ON ITS OWN, SENT IN AGAIN FOR SERVICE TO REPAIR.  SOON AFTER, THE STEERING WHEEL WENT OUT OF CONTROL. IT'S SUCH AN OBVIOUS SAFETY ISSUE THAT PEOPLE MIGHT LOSE LIFES ON IT.  IT'S BEEN OVER 9 MONTHS AND TILL NOW, WE STILL DON'T KNOW HOW IT HAPPENED AND WHAT'D TRIGGER IT TO LOSE CONTROL IN THE FUTURE. IT'S DIFFICULT FOR AN INDIVIDUAL TO OBTAIN JUSTICE FROM SUCH A BIG CORPORATION. GRATEFUL THAT I'M ALIVE AND HAVE A CHANCE TO FILE THIS COMPLAINT SO THIS INCIDENT HAS A CHANCE TO BE NOTICED OR BE FURTHER INVESTIGATED.",
        "vin": "5UXTR9C50JL"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "04/08/2019",
        "dateOfIncident": "04/08/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194745,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 BMW X3. WHILE DRIVING 70 MPH, THE DRIVER'S DOOR OPENED AND ALL THE WARNING INDICATORS ILLUMINATED ON THE INSTRUMENT PANEL. THE CONTACT ATTEMPTED TO HOLD THE DOOR CLOSED WHILE THE VEHICLE WAS IN MOTION. THE CONTACT PULLED THE VEHICLE OVER TO THE SHOULDER OF THE ROAD AND ATTEMPTED TO CLOSE THE DOOR. AFTER TURNING THE VEHICLE OFF AND BACK ON, THE DOOR SHUT. THE DEALER (BMW OF MAMARONECK, 236 W BOSTON POST RD, MAMARONECK, NY 10543, (914) 908-5088) WAS CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 15,000.",
        "vin": "5UXTR9C59JL"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/05/2019",
        "dateOfIncident": "12/24/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165428,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING EAST BOUND THROUGH AN ALLEY IN ORDER TO MAKE A RIGHT TURN ONTO A SOUTH-NORTH RUNNING CITY  STREET.  BRAKE WAS FIRST APPLIED APPROXIMATELY TWO-CAR LENGTH (DISTANCE WISE) BEFORE THE INTERSECTION.  I NOTICED THE VEHICLE WAS ACTING FUNNY:  INSTEAD OF SLOWLY COMING  TO A STOP, IT PICKED UP SPEED.   I FELT AS IF SOMETHING WAS DISENGAGED AND THE CAR WAS FLYING OFF WITHOUT GRAVITY.   I HIT  THE BRAKE AGAIN AS THE CAR WAS DASHING INTO THE INTERSECTION. THE VEHICLE WAS AGAIN ACCELERATED ON ITS OWN, COMPLETELY  OUT OF CONTROL.  AT THAT MOMENT A TRASH TRUCK WAS TRAVELING SOUTH BOUND.  BOTH THE DRIVER AND THE PASSENGER IN THE TRASH TRUCK WERE LOOKING AT ME IN DISBELIEF (THAT MY VEHICLE WAS DASHING OUT INTO THE MAIN ROAD).  WE WERE  EYEBALLED AT EACH OTHER, APPROXIMATELY AT  AN 45 DEGREE ANGLE, FOR SEVERAL SECONDS, BEFORE THE TWO CARS WERE COLLIDED.   THE OUTCOME COULD HAVE BEEN FETAL IF THE TIME AND ANGLES OF THE COLLISION WERE OFF BY A SPLIT OF SECOND.  MY VEHICLE WAS TOTALED THOUGH.",
        "vin": "5UXTR9C59JL"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/21/2018",
        "dateOfIncident": "11/18/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11153096,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS MAKING A 10 MINUTE DRIVE, ON A HIGHWAY ABOUT 30 MINUTES BEFORE DARK, IT  JUST STARTED TO SNOW.  SUDDENLY ALL OF THE FRONT SENSORS STARTED TO FLASH \"TROUBLE\" ON THE DASH.  I CHECKED THE FRONT OF THE CAR AND ICE HAD FORMED OVER THE SENSORS AND HEADLIGHTS. THAT RENDERED THE CAR UNSAFE TO DRIVE IN THE DARK SINCE THE HEADLIGHTS COULD NOT SHINE THROUGH THE ICE.  AS FOR THE DISTANCE SENSORS, I GUESS THAT IS A DESIGH FLAW AS A FUNCTION OF HOW SNOW PASSES OVER THE SENSORS.    I BELIEVE THAT THE LED HEADLIGHTS DO NOT GENERATE ENOUGH HEAT TO PREVENT ICE FROM FORMING ON THE LENS OF THE HEADLIGHTS.",
        "vin": "5UXTR9C59JL"
    },
    {
        "components": "STEERING,AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/09/2018",
        "dateOfIncident": "03/01/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150446,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 BMW X3 M40I: UPON START UP THE VEHICLE DISPLAYS A WARNING 'SEATBELT RESTRAINT SYSTEM MALFUNCTION.' THE CAR THE ENTERS A LIMP MODE AND SAYS TO DRIVE TO THE NEAREST BMW SERVICE CENTER AND THAT SOME SAFETY FEATURES ARE UNAVAILABLE. POWER ASSIST STEERING NO LONGER WORKS, AND THE VEHICLE DEFAULTS TO 4WD MODE. ADDITIONALLY, IT FURTHER STATES AIRBAG FUNCTIONALITY IS LIMITED, AND CRASH AVOIDANCE IS UNAVAILABLE, BUT THAT DRIVING IS STILL POSSIBLE! WHAT'S DISTURBING IS THAT I DISCOVERED THAT MANY OTHER LATE MODEL BMW OWNERS ARE REPORTING THIS SAME ISSUE. THE FEW THAT HAVE HAD IT RESOLVED SAID IT'S A SENSOR FAILURE IN ONE OF THE FRONT SEATS. THIS SENSOR IS TIED TO THE RESTRAINT SYSTEM AND THE AIRBAG. BMW SERVICE CENTER HAS ATTEMPTED TO FIX THIS MALFUNCTION ON MY X3 ON THREE SEPARATE OCCASIONS WITHOUT SUCCESS. I AM WORRIED THAT MY AIRBAGS OR SEATBELT WILL FAIL IN A COLLISION.",
        "vin": "5UXTS3C51J0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/13/2018",
        "dateOfIncident": "04/17/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11140153,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE IS EQUIPPED WITH BLUE TOOTH, THUS IT IS SUPPOSED TO BE HAND-FREE TO HANDLE SMARTPHONE CALL OR TEXT WHILE DRIVING. THIS BLUE TOOTH WORKED PROPERLY FOR PREVIOUS YEARS MODELS, AND EVEN 2018 SAME MODEL BUT WITH THE OPTION BEING SLIGHTLY DIFFERENT THAN MINE, SUCH AS, THE ONE EQUIPPED WITH WIRELESS PHONE CHARGER. FOR MY VEHICLE, IT DOES NOT NOTIFY WHILE BLUE TOOTH CONNECTED WHEN NEW TEXT COMES. I COMPLAINED TO BMW NORTH AMERICA. THEY ADMITTED THAT IT WAS A FIRMWARE BUG, BUT DID NOT COMMIT TO UPDATE FIRMWARE TO FIX THE THE BUG. THIS BUG COULD SIDE TRACK THE DRIVER IF HE TRIES TO CHECK THE MESSAGE WHILE DRIVING SINCE HE KNOWS THE TEXT MESSAGE NOTIFICATION IN THE VEHICLE IS NOT WORKING.",
        "vin": "5UXTR9C52JL"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/12/2018",
        "dateOfIncident": "08/15/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139914,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AT BETWEEN 52 MPH AND SAY 60 MPH STEERING WHEEL BUZZES AND SHAKES. SEEMS TO BE SOMETHING WITH LANE DEPART SYSTEM EVEN WHEN SHUT OFF. EXCESSIVE FRONT PASS TIRE WEAR ALSO. NO FIX FROM DEALER YET?",
        "vin": "5UXTS3C51J0"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/13/2018",
        "dateOfIncident": "07/13/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119677,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 BMW X3. THE CONTACT STATED THAT THE SPEEDOMETER DISPLAYED THE INCORRECT SPEED. THE DEALER (GAULT AUTO SPORT BMW, 2311 NORTH ST, ENDICOTT, NY 13760, (607) 748-9875) INFORMED THE CONTACT THAT THERE WAS NO REMEDY FOR THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 5,900.",
        "vin": "5UXTS3C54J0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/18/2018",
        "dateOfIncident": "05/01/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096725,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BLIND SPOT DETECTION DOES NOT WORK ON THE PASSENGER SIDE. WHEN PASSING A VEHICULE  THAT IS IN THE RIGHT LANE THE DETECTION LIGHT IN THE PASSENGER MIRROR ONLY COMES ON ABOUT 30-40 % OF THE TIME. EVEN WHEN PASSING A LARGE TRUCK.  THIS MEANS YOU DO NOT HAVE KNOWLEDGE OF THE LOCATION OF A VEHICULE AS IT PASSES INTO YOUR BLIND SPOT OR WHEN AMPLE SPACE IN AVAILABLE TO RETURN TO THE RIGHT LANE AFTER PASSING. ALSO IF A VEHICULE APPROACHES FROM BEHIND ON YOUR PASSENGER SIDE YOU ARE NOT AWARE IT'S IN YOUR BIND SPOT.  MY DEALER IN CHARLOTTESVILLE VA. STATED THAT   SEVERAL MORE OWNERS HAVE COMPLAINED ABOUT THIS BUT NO FIX IS AVAILABLE. I CALLED BMW USA AND EXPRESSED MY CONCERN THAT SOME ONE WAS GOING TO GET HURT AND IF THAT HAD NOT ALREADY HAPPENED. \"ALEX\" SAID THEY WOULD LOOK INTO IT BUT PROMISED NOTHING.  ( THIS IS A COSTLY OPTION ON THE CAR AND IT DOES NOT WORK)",
        "vin": "5UTXTS3C51J"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/09/2018",
        "dateOfIncident": "02/03/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11071958,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS MOVING AND WHEN I TRIED TO STOP BECAUSE THE CAR IN FRONT OF ME STOPPED. MY CAR HAD A BRAKE FAILURE AND CAUSED AN ACCIDENT.  ABS AND/OR THE COLLUSION DETERRENT SYSTEM ENGAGED TO AVOID THIS ACCIDENT.",
        "vin": "5UXTR9C57JL"
    }
]