[
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/19/2022",
        "dateOfIncident": "01/18/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448073,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LACROSSE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "When I tried to stop at the traffic light, the car suddenly accelerated and went forward. At that time, the car brake was engaged.  On the same day; When I tried to go forward at the traffic light, the car suddenly accelerated. The dealer service center said, \"We cannot find any issue with the transmission.\"",
        "vin": "1G4ZP5SZXJU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/27/2020",
        "dateOfIncident": "07/20/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302016,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LACROSSE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 BUICK LACROSSE. CONSUMER WRITES IN REGARDS TO VEHICLE SHUTTING OFF SUDDENLY. *LD    THE CONSUMER STATED THE BATTERY WAS REPLACED, BUT THE FAILURE RECURRED. THE DEALER UPDATED THE SOFTWARE , BUT COULD NOT GUARANTEE THE FAILURE WOULD NOT RECUR. *JS",
        "vin": "1G4ZS5SS3JU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/26/2019",
        "dateOfIncident": "09/23/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258360,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LACROSSE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A NOTICE FROM GM THAT MY VEHICLE WITH THE ELECTRICAL CONNECTION TO THE ACCELERATOR PEDAL WHICH COULD CAUSE A A REDUCED POWER AND ACCELERATION CONDITION.  HOWEVER, THIS IS NOT A RECALL AND I SHOULD NOT SEEK A REPAIR UNTIL I HAVE EVIDENCE THAT MY VEHICLE HAS THIS PROBLEM.  THIS SOUNDS LIKE A SERIOUS SAFETY RISK TO ME.  IF THIS CONDITION OCCURS WHEN I AM MERGING INTO TRAFFIC ON AN INTERSTATE, IT COULD CAUSE A SERIOUS ACCIDENT.  APPARENTLY OWNERS ARE SUPPOSED TO WAIT FOR SUCH AN OCCURRENCE IN ORDER TO GATHER EVIDENCE OF A NEED FOR A REPAIR.  I WANT GM TO TELL ME IF MY VEHICLE HAS THIS DEFECT IN ADVANCE AND, IF SO, REPAIR IT BEFORE THE DISASTER OCCURS.",
        "vin": "1G4ZP5SS2JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/10/2018",
        "dateOfIncident": "01/02/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11160527,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LACROSSE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "IF STOPPED UPHILL AND THE AUTO STOP ACTIVATES, WHEN YOU RELEASE THE BRAKE THE CAR CAN ROLL BACK, AND THE WAY PEOPLE STOP ON TOP OF YOU THESE DAYS YOUR CAR CAN ROLL BACK INTO THEM AND YOU HAVE TO REPAIR THEIR CAR. PLUS IT ACTUALLY TAKES MORE GAS THAN MY V8  2016 GMC SIERRA THAT DOESN'T STOP WHEN TRAVELING FROM MY FUELING LOCATION TO MY HOME, PER THE CARS OWN COMPUTER SYSTEM",
        "vin": "1G4ZR5SS9JU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/10/2018",
        "dateOfIncident": "10/05/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139466,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LACROSSE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I SENT THIS EMAIL TO THE SURVEY FOR RANDY MARION DEALERSHIP ON STATESVILLE RD HERE IN HUNTERSVILLE NC. AGAIN I DO NOT WANT THE VEHICLE BACK AS IT IS TOO MUCH RISK FOR ME, MY FAMILY AND MY WORK. IT PUT ME IN A DANGEROUS SITUATION FROM BEING STUCK IN THE STREET AND DEALING WITH AN ANGRY PASSENGER. WE MUST GET THIS RESOLVED IMMEDIATELY. I AM LOSING MONEY. I NEED A DEPENDABLE VEHICLE.     THE SALES PART WENT AS EXPECTED. A LOT OF SMILES AND VERY ENGAGED IN CONVERSATION. THE SALES GUY MIKE WAS VERY NICE. NO PRESSURE. THE PROBLEM IS AFTER THE CARE WAS SIGNED FOR. AFTER THE EXCITEMENT OF GETTING A BRAND NEW VEHICLE I REALIZED I PAID TOO MUCH AND DIDN'T UNDERSTAND ALL THE CHARGES THAT JACKED THE TOTAL UP SO FAR. HOWEVER THAT'S NOT MY ISSUE. MY ISSUE IS THE BRAND NEW CAR IS SHUTTING OFF IN THE MIDDLE OF THE STREET. IT GOES COMPLETELY DEAD. LEAVING ME STRANDED. IT HAPPENED THREE TIMES ON 10/5. THE BRAND NEW VEHICLE IS PPUTTING ME IN A DANGEROUS SITUATION FOR ME, MY FAMILY AND MY CLIENTS. SO I'M NOW LOSING INCOME AND IT ALSO CAUSED ME TO HAVE A BAD CUSTOMER SERVICE EXPERIENCE WITH A CLIENT WHICH EFFECTS MY PROFESSIONAL REPUTATION. THE PROBLEM WITH THE VEHICLE IS MAJOR AND A SERIOUS SAFETY ISSUE. YOUR SERVICE TEAM IS WORKING WITH GMC ENGINEERS TO FIGURE OUT HOW TO FIX THE PROBLEM, HOWEVER I DO NOT WANT THIS VEHICLE. YOUR SALES MANAGER STEVE SAYS THIS IS UP TO GMC TO DETERMINE IF A VEHICLE CAN BE EXCHANGED OR NOT. THIS IS COMPLETELY UNACCEPTABLE FOR ME. I WORK TOO HARD AND A LOT OF PEOPLE DEPEND ON ME.",
        "vin": "1G4ZP5SS7JU"
    }
]