[
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/28/2022",
        "dateOfIncident": "03/15/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458742,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "After auto stop/ start system engages messages on dash appear “ service brake assist”, “service steering assist”, “service parking brake”, “service stibilitrac”,  Failure at 55,400 miles  Dealership found a loss communication error to the muddles due to low battery voltage. Fix: replaced battery at 55,436 miles Battery has been replaced 3 times in 4 years starting at 18, 500 miles, then at 32,562 miles, now at 55,436 miles due to the same issue with the auto stop start operation. Car is out of warranty as of 58,300 miles or October 2022",
        "vin": "3GNAXWEX2JS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/27/2022",
        "dateOfIncident": "12/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458539,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I have a 2018 Chevrolet Equinox LT AWD that has trouble shifting gears when going uphill and the car sounds like it's struggling. Lately I've had a similar issue going downhill where the RPM meter shoots up and (I'm guessing) won't shift gear. Makes a horrible sound and feels like I'm breaking the car!! Any advice? Could it be a transmission fluid issue? Also, my driver's seat moves about, side to side, over bumps, etc. Any input on how to proceed to get this fixed? I have also had the following service lights pop up on my center display screen from time to time recently: service side detection system and service park assist system.",
        "vin": "2GNAXSEVXJ6"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "02/23/2022",
        "dateOfIncident": "11/21/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11453623,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Chevrolet Equinox. The contact stated that after parking in the driveway and switching the shifter to the park position the driver exited and moments later the vehicle erroneously rolled backward down the driveway. The driver attempted to get back into the moving vehicle and fell causing the vehicle to roll over the driver's body and crash into a tree. During the incident, the contact experienced an injured hip which required medical treatment. The vehicle was towed to a local body shop for repair. The manufacturer was notified of the incident and a manufacturer's engineer examined the vehicle but no problem was found. The cause of the failure was not determined. The contact was informed that the vehicle was not included in the NHTSA Campaign Number: 17v516000(Power train). The contact indicated that the vehicle had experienced the same failure listed in the recalls. The failure mileage was 42,000.",
        "vin": "2gNAXSEV3J6"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/09/2022",
        "dateOfIncident": "02/05/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451237,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Service Brake Assist warning. Same issue as NHTSA campaign number 20V603 and GM recall N202300860 but no active recalls on this VIN.",
        "vin": "2GNAXTEXXJ6"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/09/2022",
        "dateOfIncident": "01/31/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451262,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The issue was the leak from the fuel filter. There was no any errors/messages on the dashboard. I am not sure when this leak has started. I assume it started in the end of January. I had a long trip to Canada. The car was parked at snow covered driveway near my house. And I have discovered strange stains on the snow under the car. I have made the pictures of the stains. This stained snow smelled as a fuel. The fuel leak was pretty bad. When I looked under the car it was dripping about 1-2 drops per second. Also the leak was very close to the exhaust pipe (maybe 1-2 inches) that could be very hot and theoretically could ignite a fire. As soon as I discovered the leak, the car was taken to the nearest CHEVY dealer Highland GM in Aurora, ON, Canada. They diagnosed the issue and fixed it on February 1st.   In order to fix the leak the fuel filter was replaced.",
        "vin": "3GNAXUEU3JL"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/05/2022",
        "dateOfIncident": "12/18/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450605,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "We were driving at night I had turned on the overhead cabin light and when I turned on the overhead cabin light so my wife could hand food to our are sun and behind us the At the same time that I push the button the sunshade started to go and so I let it go but then it got jammed and it started to crank so I pushed the button in it started to go and reverse and then it like Jim in it aint like you know the motor growing sound and like there's a big shatter we thought that it was the glass from the moon roof shuttering turned out it was just like the plastic piece it was like holding the shade in place and so And so then to get that repaired they had to take the roof off take the rails out to get to the little plastic piece to call that plastic piece an external trim fastener so if it was an internal fastener it would be covered if it was because it was a fascinary if it was because it was a fascinator if it was because it's trim I don't know what trim you have to pull a roof off and pull rails out to it to find but that is why they didn't call it cover it",
        "vin": "3GNAXTEX5JS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/20/2022",
        "dateOfIncident": "12/28/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448168,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I own a 2018 Chevy Equinox.  The brakes have now failed 3 times.  Dealership confirmed each time it was an issue with the brake vacuum pump.  The Equinox has not been included in a recall, yet there are clearly safety issues.  GM had numerous cars recalled for this exact same reason.  There is a serious safety issue here.  I am now without a car again because of a third brake vacuum pump failure.  I have not been able to get any assistance from GM or my local Chevy dealership.  I now am faced with a bill for repair for almost $2000.  It is ridiculous to think that such a serious safety issue would exist and the industry will not acknowledge that it goes far beyond the vehicles they have already recalled.  I wonder how many more accidents will happen before this is corrected.  To be honest, when I do get my vehicle back I’m not sure I will drive it.  When you lose your breaks 3 times it’s very difficult to trust.  I would like to see this corrected and the Equinox needs to be added.  My car has 128,000 miles on it at the time of the third failure.  The other two failures were at approximately 60,000 miles and 92,000 miles. Thank you.",
        "vin": "2GNAXJEV4J6"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/14/2022",
        "dateOfIncident": "10/10/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447517,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "When I lift my foot off brake the car Stop/Start feature engage causing lurching jerks forward or roll backwardson hill I fear the roll back on inclines praying vehicles are to close behind and rolling backwards into another vehicle, censors lights take turns coming on each time I lift my foot off the brake pedal. All of the following, service brake assist, service stabilittrak, park brake released, service hill start assist action not working, car locks unlock and relock by themselves. I have had these issues since. These issues have been occurring since around 16,000 miles and keep getting worst everyday. GM claim not to have a fix for these issues. They offered a few thousand to buy back the vehicle claiming drastic depreciation for milage and wear. At that time owed over $25,000 balance for the vehicle. No one stood to benefit but the lemon law attorneys.They did not consider the milage when these issues started and this is my only source of transportation to use which I told the lemon law attorneys. The lemon law attorneys were going to charge their fee from me if GM refused to pay their fees. I told them I felt in my best interest I should wait for GM's recall for this vehicle as I'm sure I wasn't the only consumer that was having these same issues. My problem is my vehicle is becoming dangerous to drive due to the rolling back and, jerking of the steering wheel, engine cutting off, locks unlocking and relocking and unstable steering. These issues were hit and miss now happens every time I drive which is daily. These issues started 2020. Last correspondence with GM they still claim they did not know how to fix these issues. I question why they are making  vehicles and are not able to fix these issues. I have given my family a list of these issues because they create a safety hazard and in case I, a passenger or someone in another vehicle is injured or killed due to GM's negligence, lack of concern and greed.",
        "vin": "2GNAXTEX1J6"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/09/2022",
        "dateOfIncident": "01/02/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446781,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Winter 2020/2021 I had to replace my exhaust manifold and now winter 2021/2022 I am having issues with my turbo/super charger but same code of P0299 for both incidents. Wondering what is going on with my vehicle. I bought it at 42,000 miles and now has 88,000 on it",
        "vin": "3GNAXSEV8JS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/31/2021",
        "dateOfIncident": "12/30/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445748,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "While attempting to apply the brakes to slow down a message appeared on the instrument panel that said Service Brake Assist..  My safety was put at risk by not having proper breaking. The problen was addressed at a gm dealer and I was told there are no recalls for this type of problem for my vehicle.",
        "vin": "2GNAXSEV4J6"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/25/2021",
        "dateOfIncident": "08/12/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444942,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "engine problems",
        "vin": "2gnaxjev2j6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/08/2021",
        "dateOfIncident": "11/18/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443113,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "On approximately 11/18/21 3:30 pm I drove my car and the engine just died. Busy street. It took me 30 minutes to restart and pull safely into the first parking lot I could get to. every time I went to start vehicle it would take 3-4 minutes each time, I had to turn car completely to stop  the car from trying to start. When it finally started it would only go 10 feet before the engine stopped running. I had to have my car towed to the dealership. On 12/8/21 the dealership called me and said the the pump which is inside the engine failed and that the engine would have to be replaced for $8,500.00 HELP!",
        "vin": "3GNAXJEV0JL"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/08/2021",
        "dateOfIncident": "12/08/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443106,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The power booster brake assist vacuum pump, without any warning, failed while exiting the freeway. My wife couldn't stop the vehicle. Replaced unit for $750.00. Now Fine SCARED the crap out of her. Approximately 84,000 miles. This is a sealed unit. I am a highly skilled machinist and I have made braking components for auto and aircraft and disassembled and reassembled for evaluation to determine cause and to remedy problem. What happened? DEFECTIVE PARTS OR POOR DESIGN. I request all replaced damaged parts so I have the part here. I did my research and have seen this is an ongoing problem with GMC and yet NO recall. HELP!",
        "vin": "3GNAXJEV0JL"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/28/2021",
        "dateOfIncident": "11/28/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441863,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "1.  The brake component that failed was the vacuum pump.  It has been repaired and is not available for inspection. 2.  I lost braking ability(the ability to brake normally) on a major interstate in Georgia while driving 74 mph.  By stomping on the brakes with full body weight, I was able to drop back in traffic, eventually find an exit to pull off the road. 3.  The service report from the dealership that fixed it stated, \"Customer states the vehicle has very limited brakes.  You have to apply brake pedal extremely hard to stop.....Customer concern verified.  No brake vacuum present.\" 4.  Do not know. 5.  Right before the incident occurred a light signaling something about the brakes came on.  That was wile the car was moving at 74 mph.",
        "vin": "3GNAXJEVXJS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/23/2021",
        "dateOfIncident": "11/22/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441415,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "For about a month the Traction Control Light comes on, the Service Brakes Assist Light comes on, the Alternator Symbol comes on. Yesterday, Monday, November 22, 2021, the vehicle stopped while driving on the street and it required a jump to get it started again.  It has been very slow when starting back when at the red/green light. Very sluggish to slow motion to get speed. The system was showing low oil percentage at 53% but oil was changed three months ago and is not due for change until January, 2022 at 47281 miles.  Current mileage is 45740/50. Took car back to Art Moran last Friday to have system reset since it had not been done at the time of oil change.  Please respond ASAP.  My father is 80+ and he was very frightened when the car stopped on him.",
        "vin": "2GNAXJEV7J6"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/01/2021",
        "dateOfIncident": "07/30/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438988,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving on an interstate I had to brake suddenly and the brakes were extremely difficult to engage. I was able to get to the shoulder and down shift the transmission in order to stop.  The vehilces brake booster had failed. There were no warning lights to inform me. Fortunately, I had a repair warranty to fix the brake booster. However, I feel this may be a problem that GM should be made aware of.",
        "vin": "2GNAXREV2J6"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/29/2021",
        "dateOfIncident": "10/24/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438665,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving the traction and stability lights came on along with the ESC service light. Also my Lane assist stopped working. It stayed on for at Least 30 mins until I turned off the car and restarted.  Stopped at the closest garage and they checked the battery and used a scan tool to identify that it had a fault code U0121 Lost Communication with Anti-lock Brake System Module.",
        "vin": "2GNAXSEV6J6"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/21/2021",
        "dateOfIncident": "10/12/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437634,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Chevrolet Equinox. The contact stated that while driving the vehicle began to sputter with the traction control and check engine warning lights illuminated. The vehicle was taken to the local dealer who diagnosed that the high-pressure fuel pump was faulty and needed to be replaced. The vehicle was repaired. The manufacturer was not notified of the failure. The contact was informed that the vehicle was not included in the NHTSA Campaign Number: 18V358000 (Fuel System, Gasoline). The contact indicated that the vehicle had experienced the failure listed in the recall. The failure mileage was 41,400.",
        "vin": "2GNAXNEX1J6"
    },
    {
        "components": "POWER TRAIN,SEAT BELTS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/18/2021",
        "dateOfIncident": "11/29/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437266,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Was heading to run some errands and when I parked my car I try to release my seat belt buckle and it was not releasing. So I had a knife and I tried wiggling it so the buckle would release and it did not so I was frustrated and broke the seatbelt for driver as well as my rear seat belt. My transmission has been acting weird since 2019 and it happen every morning when it starts running my car shakes for a little then it would run fine. And for brakes my brakes would hesitate and shake as is braking.",
        "vin": "2GNAXJEV5J6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/06/2021",
        "dateOfIncident": "09/09/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435661,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The ac went out on the 2018 equinox and the dealership replaced and ac line citing it was the wrong line and a bolt from the fan shroud rubbed a hole in the line. I have the pictures the dealership took prior to repairs. the hose and we line it up with the bolt on the fan shroud and we do not see how the bolt would rub the hose. It has to be a factory defect.",
        "vin": "2GNAXHEV6J6"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/02/2021",
        "dateOfIncident": "06/22/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435241,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The electronic parking brake unexpectedly and automatically engaged while I was driving.    The car would jerk and instantly slow down.  It didn't matter if I was on a freeway going 55 mph or on a side street going 20 mph.  In the course of 24 hours, it got worse and worse.  It was extremely dangerous, because I would slow and / or stop unexpectedly in front of cars behind me.   I could disengage it with the button, but in just a matter of minutes it would engage again.  Finally, I could not disengage it anymore, and I had to park it on the side of the road and get it towed.  This was a car rented from Hertz in New Orleans, Louisiana.",
        "vin": "2GNAXSEVXJ6"
    },
    {
        "components": "EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/07/2021",
        "dateOfIncident": "12/28/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428176,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "After being in a severe accident w/ another 2018 equinox I purchased a used 2018 equinox  w/ 10k miles on it . saved my life 1x - i was happy with the car.   In Dec 2019 my front passenger headlight went out.   Still under warranty I had the dealer replace the bulb.    In late December 2020 my front passenger headlight went out again.   I was told it was over $400 to fix. This was \"replacing the lightbulb\".    I decided to purchase my own lightbulb from a reputable source.    The problem is not the lightbulb but instead the ballast or the wiring.    I have NEVER had to replace a lightbulb in any of my cars before let alone 2 in two years.     Chevy told me that I was out of luck because I was 2 weeks after the bulb under warranty was replaced... REALLY?    So now I am without a front headlight and not willing to pay to have this repaired since it is obviously a manufacturers defect.    Chevy has NOT been helpful and neither has my local dealership.    My safety is being put at risk because I can not see 1/2 of the road with 1 headlight.  Cars can only see 1/2 of my car oncoming.   There have been no warning lights etc.",
        "vin": "3gnaxsev6js"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/02/2021",
        "dateOfIncident": "07/30/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427504,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving 55 mph heading to a friends for the weekend with another one of my friends and my dog.  It started raining and it was scaring my dog to see the rain drops on the sunroof so I closed the shade.  About 15 minutes later there was a  loud constant sound almost like a warning so I looked at my dash, radio ect to see what was going on and about 3-5 minutes after the loud constant whining sound started there was a loud boom!! sounded like a bomb or gunshot. I pulled over and got out to look and found a hole in my sunroof.  By looking at it you can totally see that the pressure or blast was from the inside as the glass on the sunroof was pushed outward.  I took this to a GM dealer and the service manager was rude and kept saying it was from something in the roadway which it was NOT!! The road was clear and it was still light out.  Besides what was that sound from then??? This is unsafe and the outcome could have turned out way worse.",
        "vin": "2GNAXSEVXJ6"
    },
    {
        "components": "STEERING,POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/26/2021",
        "dateOfIncident": "07/09/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426448,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "62 k Miles car completely shut down and power steering became useless making it extremely hard to even move out of traffic.    There were no warning lights  Car has always been fully serviced at dealership.   Vac pump failed causing camshaft to break , bending pistons   New engine required.  Car at dealership going into 3 weeks now",
        "vin": "2gnaxmev2j6"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/19/2021",
        "dateOfIncident": "07/09/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425526,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Chevrolet Equinox. The contact stated while driving at an undisclosed speed, the accelerator pedal was depressed however, the vehicle failed to respond. The check engine warning light was illuminated. The emission testing message was displayed. Additionally, the vehicle was shaking. The vehicle was towed to the local dealer to be diagnosed. The contact was informed that the fuel pump was leaking fuel into the oil causing the vehicle to stall. The vehicle was repaired however, the failure recurred. The manufacturer was not notified of the failure. The contact stated that the failure was like NHTSA campaign number: 20V668000 (Power Train). The failure mileage was 80,000.",
        "vin": "3GNAXJEV5JS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/12/2021",
        "dateOfIncident": "07/12/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424517,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Panoramic Sunroof buckled and shattered. (thank goodness we weren't driving it at the time). Police were notified as we weren't sure if it was vandalism but seeing the way the frame buckled and the glass concave it's a defect",
        "vin": "3GNAXJEV2JS"
    },
    {
        "components": "VISIBILITY,SEATS",
        "crash": false,
        "dateComplaintFiled": "07/07/2021",
        "dateOfIncident": "07/04/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423765,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Chevrolet Equinox. The contact stated that the driver’s and passenger’s side front seats were designed to be too low which caused a blind spot on the front passenger’s side when the contact was in the front driver’s seat. The contact drove over a flower bed at the park due to the front passenger’s side blind spot visibility issue. The manufacturer was made aware of the failure but provided no assistance. The approximate failure mileage was 20,000.",
        "vin": "3GNAXREV5JL"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/26/2021",
        "dateOfIncident": "05/26/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418610,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Dealership stated that it is an internal failure of the vacuum pump. Have had the Vacuum pump fail 2 times since I got it and now it just occurred for the 3rd time.  Had it replaced by a dealership both times before and will be bringing it back there this afternoon.  No warning light.   Brakes just stop working while driving.  They feel very hard and barely stop the car. Have to use the emergency brake to stop the car.  First and second time it happened I was going about 45-50 mph, coming up to the red light and had no brakes.  No previous issue or warning. This time I was in a parking lot so not that fast but had no brakes all of a sudden again.",
        "vin": "3gnaxjev3jl"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/24/2021",
        "dateOfIncident": "05/21/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418276,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I waa getting off the highway on an exit ramp and my brake pedal started vibrating. Then I could not  depress the brake pedal, it wouldn't budge. It was as hard as a rock. I then lost my breaks and almost had a major accident. I swerved and ended up on the grass shoulder near the woods. Then  the “Service Brake Assist” message came on the dashboard, and the engine light came on. It was the most scariest experience I have encountered and now I no longer want to own this car. I had it towed to Apple Cheverolet in York Pa.",
        "vin": "2GNAXHEV7J6"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "04/03/2021",
        "dateOfIncident": "03/11/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406239,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SIDE POWER SEAT WOULD INTERMITTENTLY AND WITHOUT WARNING SLIDE SUDDENLY FORWARD AND CONTINUE TO DO SO EVEN AFTER THE POWER SEAT WAS REVERSED.  IN SOME INSTANCES THE SEAT WASHED PUSHED SO FAR FORWARD I COULD NOT CONTINUE SAFELY AND WAS FORCED TO PULL OFF THE ROAD. USUALLY AFTER A SHORT WAIT I COULD CONTINUE DRIVING. THE PROBLEM OCCURRED IN A NUMBER OF DIFFERENT DRIVING SITUATIONS, HIGHWAYS, CITY STREETS AND INTERSTATE HIGHWAYS. I FOUND AT LEAST 5 BULLETINS ISSUED BY GM REGARDING THE SPECIFIC PROBLEM DESCRIBED THE BULLETIN NUMBER IS PIT5608D.  THE BULLETINS WERE ISSUED BETWEEN 2018 AND 2021.",
        "vin": "2GNAXMEV8J6"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/17/2021",
        "dateOfIncident": "12/30/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403578,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ACCELERATING IT WILL CREATE A HARD SHIFT OR NOT FULLY ENGAGE INTO 2ND OR 3RD GEAR. ALSO, WHEN AUTO STOP/START ENGAGES IT JOLTS THE CAR WHEN STOPPED.",
        "vin": "3GNAXJEV2JS"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/10/2021",
        "dateOfIncident": "03/08/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400169,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET EQUINOX. THE CONTACT STATED THAT THE DEFROSTER WAS EMITTING AN ABNORMAL ODOR AND SHE WAS HIGHLY ALLERGIC TO MOLD WHICH CAUSED HER CONGESTION. THE DEALER WAS NOT INFORMED OF THE FAILURE. THE MANUFACTURER WAS INFORMED OF THE ISSUE AND INFORMED THE CONTACT TO CONTACT NHTSA SINCE THERE WAS NO RECALL RELATED TO THE DEFROSTER. THE FAILURE MILEAGE WAS 30,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/06/2021",
        "dateOfIncident": "03/02/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399453,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TWICE IN TWO YEARS MY VEHICLE HAS EXPERIENCED A PROBLEM WITH THE DIFFERENTIAL.  THE FIRST TIME, THE VEHICLE WAS BRAND NEW.  THIS TIME IT HAS ABOUT 5300 MILES ON IT.  IT MAKES A NOISE WHILE DRIVING IT.  IT SOUNDS KIND OF LIKE A SMALL PLANE IS FLYING BEHINDS YOU. IT DOESN'T MATTER WHERE YOU ARE DRIVING, HIGHWAY, SMALL TOWN DRIVING, ETC. AND IT DOESN'T MATTER IF YOU ARE IN ALL WHEEL DRIVE OR NOT.",
        "vin": "2GNAXVEV5J6"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/03/2021",
        "dateOfIncident": "02/26/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399042,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN USING THE BLUETOOTH/HANDSFREE WITH MY PHONE WHILE DRIVING OR STATIONARY, THE RADIO UNIT WITH DIAL OUT A CALL, BUT WHEN THE PERSON ON THE OTHER END PICKS UP THAT PERSON CAN NOT HEAR ME. THE PERSON WILL SAY HELLO SEVERAL TIMES BEFORE HANGING UP. THIS COULD BE AN ISSUE IF I HAD AN ACCIDENT AND COULDN'T GET AHOLD OF SOMEONE TO TALK TO IMMEDIATELY. THE VEHICLE IS OUTSIDE OF THE BUMPER TO BUMPER WARRANTY 3 YEARS/36000 MILES.",
        "vin": "2GNAXREV2J6"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/01/2021",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398547,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER GOING THROUGH A CAR WASH OR DRIVING IN A HEAVY RAIN, THE VEHICLE DOOR LOCKS PERIODICALLY NO LONGER FUNCTION. DOOR LOCK/UNLOCK FUNCTION CANNOT BE USED EITHER WITH THE KEY FOB OR WITH DIRECT PRESS OF THE LOCK/UNLOCK BUTTON ON THE INTERIOR OF THE VEHICLE. AT ONE POINT HAD TO CLIMB OUT THE BACK OF THE VEHICLE. IF YOU ARE OUTSIDE OF THE VEHICLE, THE ONLY WAY TO UNLOCK THE VEHICLE IS TO REMOVE THE COVER FROM THE DOOR LOCK AND USE THE EMBEDDED KEY IN THE KEY FOB.    ISSUE WILL LAST ANYWHERE FROM 1 HOUR TO 24 HOURS AFTER THE CAR GETS WET.    HUGE SAFETY CONCERN IF THERE WERE EVER TO BE AN ISSUE ARISING WHERE YOU HAD TO EXIT THE VEHICLE IN AN EMERGENCY.    TOOK THE VEHICLE TO THE DEALER AND THEY WERE UNABLE TO DUPLICATE THE PROBLEM. I HAVE VIDEO OF THE ISSUE OCCURRING.",
        "vin": "3GNAXJEV0JL"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/14/2021",
        "dateOfIncident": "02/14/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396176,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN MOTION DRIVING ON RT 73 HEADED NORTH IN A STRAIT DRIVING DIRECTION.   BREAK PEDAL WOULD NOT GO DOWN. STUCK IN UP POSITION ENABLING THE VEHICLE TO STOP.",
        "vin": "3GNAXJEV2JS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/08/2021",
        "dateOfIncident": "02/05/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395282,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT WAS SPEAKING ON BEHALF OF HIS DAUGHTER WHO OWNS A 2018 CHEVROLET EQUINOX. THE CONTACTS DAUGHTER WAS APPROACHING AN INTERSECTION AT LOW SPEEDS, WHEN THE BRAKE PEDAL FAILED TO ENGAGED PROPERLY AND TRAVELED TO THE FLOOR CAUSING THE CONTACT TO CRASH INTO THE REAR OF THE VEHICLE IN FRONT. NO INJURIES WERE SUSTAINED. NO MEDICAL ATTENTION WAS REQUIRED. NO POLICE REPORT WAS FILED. THE CONTACTS DAUGHTER MANAGED TO DRIVE THE VEHICLE TO HER RESIDENCE. THE VEHICLE WAS TAKEN TO THE DEALER PRIORITY CHEVROLET (1495 S MILITARY HWY, CHESAPEAKE, VA 23320 757) 424-1811) WHERE IT WAS PENDING A DIAGNOSTIC TEST. THE VEHICLE SUSTAINED DAMAGES TO THE FRONT GRILL AND BUMPER. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND A CASE NUMBER WAS PROVIDED. NHTSA CAMPAIGN NUMBER: 18V576000 (SERVICE BRAKES, HYDRAULIC) WAS MENTIONED AS A POSSIBLE SOLUTION TO THE FAILURE HOWEVER, THE VIN WAS NOT INCLUDED. THE FAILURE MILEAGE WAS APPROXIMATELY 61,000. *DT*JB",
        "vin": "2GNAXJEV9J6"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/04/2021",
        "dateOfIncident": "01/30/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394620,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WIPERS ON THIS CAR HAVE NEVER BEEN RIGHT. I HAD THEM LOOKED AT OCT 2018. NOW THEY STOPPED WORKING COMPLETELY.  IF YOU GOOGLE IT, MANY PEOPLE HAVE HAD THE SAME ISSUE SINCE 2000.  THIS SHOULD BE A RECALL!",
        "vin": "2GNAXREV1J6"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/26/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390074,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG SERVICE LIGHT GOES ON WHEN FRONT PASSENGER BUCKLES UP,  IF PASSENGER UNBUCKLES LIGHT DISAPPEARS, IT HAPPENS WHILE DRIVING, PARKED, BACKING UP, ALL SPEED, ALL WEATHER CONDITIONS, ANY ROADS.  IT LOOKS THE SEATBELT ACTIVATE THAT SERVICE LIGHT .     I BOUGHT THE CAR USED 11/28/20 AND STILL HAVE  DMV WARRANTY 60 DAYS, HOWEVER STEPHEN AUTOMALL CENTRE, BRISTOL CT DOESN'T HONOR THE WARRANTY!",
        "vin": "2GNAXSEV1J6"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/19/2021",
        "dateOfIncident": "01/18/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388786,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINGE LIGHT KEEPS COMING ON. CODE SAYS DEALER SPECIFIC, WENT TO GO TO DEALER, LIGHT WENT OFF. TWO WEEKS LATER, LIGHT COMES BACK ON FOR A FEW DAYS, GOES BACK OFF. HAD THE DIESEL SYSTEM CLEANED BY DEALER, LIGHT STILL COMES ON AND OFF. CAR HAS 42K MILES, EXPERTLY MAINTAINED. DEALER WANTS $135 TO DIAGNOSE THE PROBLEM THAT THEIR OWN DOCUMENTS SAY THERE IS NO SOLUTION FOR. ON STAR DIAGNOSES FOUND NOTHING WRONG WITH THE VEHICLE AND DIDN'T EVEN SHOW THE 'CHECK ENGINE LIGHT' AS BEING ON. SIMILAR REPORTS FROM OTHERS ONLINE INVOLVING THE 1.6L DIESEL. NO PERFORMANCE ISSUES WITH THE LIGHT ON, BUT CHEVROLET SHOULD BE ABLE TO FIX THE ISSUE - EVEN IF THE CAR IS OUT OF WARRANTY. A TWO YEAR OLD CAR SHOULDN'T BE HAVING RANDOM CHECK ENGINE LIGHT ISSUES.",
        "vin": "3GNAXXEU6JS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/12/2021",
        "dateOfIncident": "01/11/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387747,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING IN STOP/GO TRAFFIC - ABOUT 35-40 MPH.  WENT TO HIT THE BRAKES AND THE BRAKE PAD WOULDN'T MOVE. I PUMPED AND NOTHING HAPPENED. NO LIGHTS/WARNINGS ON THE DASH, AND THE CAR HAD FUNCTIONED FINE PRIOR TO THEN. I HAD TO THROW THE CAR TO NEUTRAL, TRY TO VEER INTO ANOTHER LANE, THEN PULL EMERGENCY BRAKE TO KEEP FROM HITTING ANOTHER CAR.  WARNING THEN CAME ACROSS THE DASH SAYING \"BRAKE ASSIST SERVICE NEEDED\" (OR SOMETHING TO THAT EFFECT).  THE CAR IS NOW AT THE DEALERSHIP- WAS TOLD THAT THE VACUMN PUMP FAILED, THE GEAR INSIDE BROKE APART AND THE PIECES HAVE BEEN TAKEN INTO THE ENGINE, SO THEY HAVE TO REPLACE THE PUMP AND GET THE PIECES OUT OF THE ENGINE.  NO ABS WARNING PRIOR, NO OTHER ENGINE TROUBLE OR OTHER WARNING LIGHTS PRIOR TO THIS HAPPENING.  86K MILES, 2018 EQUINOX.",
        "vin": "3GNAXHEV4JS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/10/2021",
        "dateOfIncident": "01/06/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387419,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES FAILED FOLLOWING A VACUUM PUMP FAILURE WHILE DRIVING AT FASTER SPEEDS ON A  BUSY CITY STREET (45MPH). \"REDUCED ENGINE POWER\" WAS DISPLAYED AND WHEN I APPLIED THE BRAKES, THE PEDAL FELT SOLID AND DID NOT DEPRESS. USING THE NEUTRAL GEAR AND PARKING BRAKE I WAS ABLE TO STOP THE CAR.  THIS COULD HAVE BEEN A FATAL FAILURE IN A DIFFERENT SCENARIO WITH A LESSER DRIVER",
        "vin": "3GNAXJEVXJS"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/08/2021",
        "dateOfIncident": "01/04/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387232,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MESSAGE: I OWN A 2018 CHEVROLET EQUINOX, 4 CYLINDER WITH ELECTRONIC STEERING, THE VEHICLE HAS APPROX 27500 MILES RECORDED.   WHILE DRIVING I SENSED A SLIGHT DELAY IN THE STEERING, IT APPEARS TO BE ONLY A MILLISECOND DELAY AND DOES NOT HAPPEN ALL THE TIME. IN ADDITION THERE ARE TIMES WHEN THE VEHICLE SEEMS TO WONDER LEFT OR RIGHT WHEN STEERING WHEEL IS NOT HELD FIRMLY. I REPORTED THE ISSUE TO BLAIZE ALEXANDER PHILLIPSBURG PA SERVICE MGR. AND ASKED IF THERE WAS A REPORTED ISSUE WITH THE STEERING.  THEIR RESPONSE WAS NO.  BUT SUGGESTED TO SCHEDULE AN APT.  AFTER ARRIVING HOME I SEARCHED THE ISSUES ON THE INTERNET AND FOUND SEVERAL REPORTS OF STEERING PROBLEMS WITH 2018 CHEVROLET EQUINOX CAUSING NEAR MISS ACCIDENTS DUE TO THE ELECTRONIC CONTROL FAILURES.  AFTER CONSULT WITH INDEPENDENT GM CERTIFIED TECHNICIAN IT WAS LEARNED THAT THERE ARE SIGNIFICANT ISSUES WITH ELECTRONIC STEERING.  THE VEHICLE WAS INSPECTED BY THE DEALER THIS DAY, THE RESULTS OF THE INSPECTION WAS THEY COULD NOT DUPLICATE THE PROBLEM AS ALL PARAMETERS WERE WITHIN SPEC. THIS CONDITION SO FAR HAS BEEN SPORADIC IN NATURE,HOWEVER DUE TO THE SERIOUSNESS OF POTENTIAL HAZARDS DESERVES MORE ATTENTION DIRECTED TO IT.",
        "vin": "2GNAXSEVXJ6"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/05/2021",
        "dateOfIncident": "10/04/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11386715,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED THAT MY LEGS KEPT HURTING ME AND DID NOT KNOW WHERE IT WAS COMING FROM. IT FELT LIKE I COULDN'T WALK FOR ABOUT A MONTH. AFTER NOT DRIVING FOR THREE DAYS I FOUND OUT THAT CAUSE OF THE PAIN  COMING FROM MY 2018 EQUINOX DRIVERS SEAT. I PUT A PILLOW IN THE DRIVER SEAT AND THE PAIN WENT AWAY. IT IS NOT SAFE TO DRIVE WITH THE PILLOW BECAUSE IT IS ALWAYS SLIDING AND MY FOOT KEEPS SLIDING OFF THE PEDALS.  GM NEED TO DO SOMETHING ABOUT THIS BECAUSE THEY ALREADY KNOW ABOUT THIS PROBLEM WITH THE SEATS. GM SHOULD HAVE REPLACEMENT SEAT FOR THESE VEHICLES INSTEAD OF  DOING NOTHING ABOUT IT. PLEASE HELP. [XXX]    REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *CC",
        "vin": "2GNAXREV7JG"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/04/2021",
        "dateOfIncident": "10/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386353,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR WINDSHIELD WIPER STOPPED WORKING TWO YEARS AFTER PURCHASING THE VEHICLE.",
        "vin": "2GNAXSEV0J6"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/04/2021",
        "dateOfIncident": "11/21/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386355,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A DEMO WITH 7,000 MILES ON IT IN MAY 2018.  41,000 THE SUNROOF AND SHADE STOPPED WORKING.  42,500 CHECK ENGINE LIGHT CAME ON FOR ELECTRICAL ISSUES.  CHEVY WAS NO HELP BECAUSE MY WARRANTY ENDED AT 39,000.",
        "vin": "2GNAXSEV3J6"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/31/2020",
        "dateOfIncident": "11/04/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385951,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR STARTED GOING INTO AUTO STOP AND WOULD NOT GO FORWARD ONE THE BRAKE WAS RELEASED ON THE HIGHWAY OR AT STOP SIGNS. THIS CAUSED US TO ALMOST HAVE A WRECK BECAUSE THE CAR WOULDN'T GO WHEN IT NEEDED TO WHEN PULLING OUT ONTO A ROAD WHEN IT WAS CLEAR TO GO. IT CREATED A TIME LAG THAT COULD CAUSE AN ACCIDENT.WE ALSO ALMOST ROLLED INTO THE CAR BEHIND US WHILE STOPED AT AN INTERSECTION ON A HILL THAT ENTERED A HIGHWAY. WE TOOK THE CAR TO THE DEALERSHIP. THE FIRST TIME THEY CHARGED US FOR DIAGNOSTIC AND ONLY CLEARED THE CODE. THE CHECK ENGINE LIGHT CAME ON IMMEDIATELY WHEN WE PICKED IT UP. THEN THEY CHANGED A SENSOR, AND WE HAD TO BRING IT BACK. THEN THEY REBUILT THE TRANSMISSION. WE HAVE TO BRING IT BACK THE SAME DAY. THEN THEY REPLACED THE TORQUE CONVERTER. WE JUST PICKED IT UP TODAY.",
        "vin": "2GNAXSEV0J6"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/16/2020",
        "dateOfIncident": "12/08/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383853,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE AND I NOTICED THIS PAST WEEK THAT OUR 2018 CHEVY EQUINOX WILL ACCELERATE ALL ON ITS OWN WITHOUT DRIVER INPUT.  WE FEEL THIS INCREASE IN SPEED WITHOUT INPUT IS DANGEROUS.  WE HAVE AN APPOINTMENT AT THE DEALER IN ANCHORAGE, ALASKA THAT SOLD US THE VEHICLE.",
        "vin": "3GNAXTEXXJS"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/05/2020",
        "dateOfIncident": "12/05/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378038,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SAT 12/05/2020, 0745 HRS.  WEATHER: SNOW/SLUSH  LOCATION ROUTE1 S/B NORTH ATTLEBORO, MA  PROBLEM: WIPERS STOPPED WORKING WHILE DRIVING :  WHILE DRIVING TO MERGE ONTO I-295 S, WIPER STOPPED WORKING FOR NO APPARENT REASON, I QUICKLY MADE EMERGENCY STOP RESULTED IN FRONT PASSENGER TIRE GOT BLOWN DUE TO HITTING THE CURB SIDEWAY,  THANK GOD I WAS GOING BELOW SPEED LIMIT OR OTHERWISE.  I WAS LEFT STRANDED TILL EMERGENCY RESPONDERS GOT THERE AND TOWED MY VEHICLE,   I CONSIDER THAT SAFETY ISSUE AND I THANK GOD AND RESPONDERS FOR THEIR HELP  I RESEARCHED THE PROBLEM AND I FOUND RECALL FOR OLDER MODELS BUT NOT FOR THIS YEAR OR VIN!",
        "vin": "2GNAXSEV1J6"
    },
    {
        "components": "PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "11/30/2020",
        "dateOfIncident": "02/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377191,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET EQUINOX. THE CONTACT STATED WHILE STARTING THE VEHICLE, THE PARKING BRAKE SEIZED IN THE ACTIVATED POSITION. THE CONTACT STATED THAT THE PARKING BRAKE WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS NOT DRIVABLE. THE VEHICLE WAS TOWED TO BERGER CHEVROLET (2525 28TH ST SE, GRAND RAPIDS, MI 49512; (616) 949-5200), WHERE THE VEHICLE WAS DIAGNOSED AND THE CONTACT WAS INFORMED THAT THE PARKING BRAKE CABLE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED HOWEVER, THE FAILURE RECURRED. THE VEHICLE WAS TAKEN TO JOE HOLLAND CHEVROLET (210 MACCORKLE AVE SW, SOUTH CHARLESTON, WV 25303; (304) 744-1561) TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE REAR BRAKE ASSEMBLY NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 28,000.",
        "vin": "2GNAXSEV1J6"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/04/2020",
        "dateOfIncident": "11/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372960,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLES ELECTRONIC STABILITY CONTROL AND ANTILOCK BRAKE SYSTEMS RANDOMLY GIVE OFF SERVICE SIGNAL FOR THE STABILITRAK, HILL START ASSIST, AND BRAKE ASSIST.  THIS CAUSES MY DOORS TO UNLOCK AND LOCK WHILE HE CAR IS IN MOTION AND GIVES SERVICE ENGINE LIGHTS.  THIS MOSTLY HAPPENS WHEN THE VEHICLE HAS BEEN STARTED VIA REMOTE OR CHEVROLET APP BUT RECENTLY, IT IS HAPPENING DAILY WHEN THE VEHICLE GOES TO AUTO STOP AND CONTINUES AS THE VEHICLE RESTARTS FOR DRIVING ON CITY STREETS.",
        "vin": "2GNAXNEX3J6"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/22/2020",
        "dateOfIncident": "10/17/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365854,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DATE OF INCIDENT: 10/17/2020. CHECK BATTERY LIGHT CAME ON AND THE VEHICLE'S ALERT MESSAGE INDICATED THE CAR WAS IN 'BATTERY SAVING MODE'. NO PREVIOUS INDICATORS HAD APPEARED TO INFORM THAT THERE WAS A BATTERY ISSUE. A SHORT WHILE LATER, ALL POWER TO THE VEHICLE STOPPED WHILE DRIVER WAS ON A HIGHWAY. THE ALTERNATOR IN THE VEHICLE WENT OUT. THIS HAS HAPPENED TO ENOUGH VEHICLES WITH THIS ALTERNATOR MODEL THAT ALL PARTS STORES IN DULUTH, MN AND SUPERIOR, WI WERE OUT OF PARTS. ADDITIONALLY, THE MANUFACTURER HAS ALSO BEEN OUT OF STOCK WITH THIS ALTERNATOR, INDICATING THAT THERE IS A FLAW WITH THIS PART. WITH SUCH LITTLE (AND INACCURATE) WARNING, THIS WAS AN INCREDIBLY DANGEROUS SITUATION TO BE IN.",
        "vin": "3GNAXVEV4JS"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/08/2020",
        "dateOfIncident": "10/06/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363326,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKUP CAMERA FREEZES INTERMITTENTLY ON START UP",
        "vin": "2GNAXSEV6J6"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/07/2020",
        "dateOfIncident": "10/06/2020",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363156,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS INVOLVED IN A FRONT END COLLISION. NO OTHER PASSENGERS BESIDES DRIVER OF VEHICLE WAS IN CAR. THE DRIVERS AIRBAG DEPLOYED, BUT UPON EXITING THE VEHICLE THE PASSENGER SEAT HAD CAUGHT FIRE DUE TO A MALFUNCTIONING AIRBAG.",
        "vin": "3GNAXTEX1JS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/03/2020",
        "dateOfIncident": "09/29/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362523,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE INTERSTATE AT THE 70 MPH SPEED LIMIT, I ATTEMPT TO SLOW DOWN AND COULD NOT WITHOUT UTILIZING MY EMERGENCY BRAKE. I ENDED UP TAKING MY CAR TO THE NEAREST DEALERSHIP AND HAD TO GET A NEW VACUUM PUMP AND PRESSURE SENSOR. I IMMEDIATELY LOOKED UP THE ISSUE AND SAW THAT THERE HAD BEEN MULTIPLE COMPLAINTS OF THIS ISSUE. I HAD TO PAY IN ORDER TO RECEIVE MY VEHICLE BACK, BUT THIS TYPE OF ISSUE SHOULD NOT RELY ON A CONSUMER. MY VEHICLE IS ONLY 2 YEARS OLD AND I'VE BEEN THE ONLY OWNER. THIS WAS A VERY DANGEROUS INCIDENT, AS I ALSO HAD MY WIFE AND 2 YOUNG CHILDREN IN THE VEHICLE.",
        "vin": "3GNAXJEV7JL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/21/2020",
        "dateOfIncident": "02/26/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360261,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "1. ON 31JAN2018, I PURCHASED A NEW CHEVROLET EQUINOX PREMIER FROM SCENIC CHEVROLET IN WEST UNION, SOUTH CAROLINA.  2. IN MID-FEBRUARY 2018 ON A 5-6 HOUR TRIP, TRAVELING ON INTERSTATE 95. MY WIFE AND I COULD NOT HEAR OURSELVES AND COULD NOT CONVERSE AS THE NOISE WAS OBNOXIOUSLY LOUD, A CONSTANT GROWL.  WE BOTH DEVELOPED HEADACHES ABOUT 4 HOURS INTO THE TRIP.    3. THE EQUINOX WAS TAKEN TO VADEN CHEVROLET IN SAVANNAH, GA  WITH THE COMPLAINT AND INFORMATION ABOVE. VADEN SERVICE  PERSONNEL EXAMINED THE VEHICLE AND 'FOUND NOTHING OUT OF THE ORDINARY'.  4. IN MARCH, 2018, I OBTAINED A DECIBEL(DB) METER, FOR SOUND MEASUREMENT. WITH THIS METER, I WAS ABLE TO MEASURE SOUND EXPOSURE LEVEL(SEL) .  5. SHORTLY THEREAFTER, WHILE ON ANOTHER ROAD TRIP, AGAIN ON INTERSTATE 95, I WAS ABLE TO MEASURE THE NOISE LEVEL.  IT FLUCTUATED BETWEEN 81 AND 85 DECIBELS, 'A' SCALE (DBA). NIOSH  & OSHA WOULD RECOMMEND LIMITING THE 8 HOUR EXPOSURE TO LESS THAN 85 DBA. AND REQUIRE   6. WITH ANOTHER TRIP TO VADEN, THEY EXAMINED THE EQUINOX AGAIN USING A FREQUENCY METER.  MY EQUINOX WAS DRIVEN IN COMPARISON TO ANOTHER ANALOGOUS EQUINOX. VADEN INFORME THEM D ME THEY BOTH SOUNDED THE SAME AND THE FREQUENCY WAS QUITE SIMILAR. I WAS UNABLE TO CONVINCE THAT FREQUENCY HAD NOTHING TO DO WITH AMPLITUDE.  I WAS TOLD THAT IS THE WAY GENERAL MOTORS ENGINEERS DESIGNED THE VEHICLE.  7. LATER IN MARCH 2018,  I INSULATED THE VEHICLE DOORS, FRONT AND REAR FENDERS, AND BACK HATCH WITH SOUND PROOFING MATERIAL AT MY EXPENSE. THE DECIBEL RATING DECREASED TO 78-82 DECIBELS AT 60MPH ON THE INTERSTATE 95.  MY WIFE AND I HAD TO SHOUT AT EACH OTHER TO ENGAGE IN CONVERSATION.   8. FROM THE STANDPOINT OF HEARING CONVERSATION, THIS VEHICLE IS QUITE DISMAL. VADEN CHEVROLET IN CONJUNCTION WITH GMC HAS MADE NO EFFORT TO REMEDY THE SITUATION.  PLEASE SEE ATTACHMENT.     THANK YOU.  RESPECTFULLY,  W.L.BOHACH  LT.COLONEL USMC(RET)",
        "vin": "3GNAXXEU9JL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/16/2020",
        "dateOfIncident": "09/16/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355332,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE OIL PLUG IS WEAK AND DAMAGED",
        "vin": "3GNAXXEU2JL"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "09/15/2020",
        "dateOfIncident": "09/14/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355242,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN MOTION, SEAT STARTED TO MOVE BACKWARDS. SIDE MIRRORS STARTED TO MOVE AS WELL MAKING DIFFICULT TO DRIVE. I COULDN'T REACH PEDALS AT ONE POINT AND COULDN'T SEE BLIND SPOT. I HAD TO RE ARRANGE THE SEAT AND SIDE MIRROR POSITION WHILE DRIVING SINCE I WAS DRIVING IN A HIGHWAY. THE SEAT SETTINGS DOESN'T WORK AS WELL.",
        "vin": "2GNAXMEV6J6"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/11/2020",
        "dateOfIncident": "09/04/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354409,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A COUNTY HIGHWAY, THE SERVICE BRAKE ASSIST LIGHT APPEARED.  UPON BRAKING, BRAKES WERE EXTREMELY HARD (LIKE PUSHING ON A BRICK) TO STOP.  AFTER ATTEMPTING TO BRAKE SEVERAL TIMES AND FINALLY GETTING STOPPED, I TURNED OFF THE VEHICLE.  UPON ATTEMPTING TO RESTART, CAR FAILED TO START.  TOWED FROM HOLSTEIN IOWA TO MILFORD, IOWA LATE ON A FRIDAY.  NEXT MORNING, DEALER IN SPIRIT LAKE IOWA WAS CONTACTED.  A 2ND TOW TO THE DEALER HAPPENED ON SATURDAY.  DEALER BRIEFLY LOOKED AT IT AND STATED IT WAS A CAMSHAFT ACTUATOR OR SENSOR AND THEY WOULD GET TO IT AFTER THE HOLIDAY WEEKEND.  THE GAVE ME A RENTAL TO GET HOME (5 HRS SOUTH) HOWEVER, I AM STILL PAYING ON A UHAUL TRAILER RENTAL AS THE RENTAL VAN DID NOT HAVE TOWING CAPABILITIES.  TOW 1 WAS $250 AND TOW 2 WAS $125.  RENTAL IS $50 PER DAY.  PARTS/LABOR IS EXPECTED TO BE A LITTLE OVER $2200 PLUS THE VAN RENTAL, PLUS THE UHAUL TRAILER EXTRA DAYS RENTAL, PLUS THE GAS TO GO BACK AND GET THE VEHICLE AND BRING IT HOME WITH THE UHAUL TRAILER.  DEALER WAS ADVISED BY ME TO LOOK AT THE VACUUM PUMP ON TUE A.M.  TUE P.M. DEALER CALLED BACK.  VERIFIED VACUUM PUMP ISSUE AND STATED IT WAS DEFECTIVE AND THAT IT DISINTEGRATED.  IT WAS ALSO SITTING ON THE FRONT DUAL OVERHEAD EXHAUST AND THAT WAS ATTACHED TO THE CAMSHAFT EXHAUST.  BOTH OF THOSE BROKE AWAY AS WELL.  NEED TO REPLACE THOSE AND THE TIMING CHAIN WITH AN OIL CHANGE TO ENSURE NO METAL REMAINS IN THE ENGINE.  GM/CHEVY SHOULD BE FIXING THIS AT NO COST PLUS PAYING FOR THE TOWING CHARGES, EXTRA RENTALS, AND GAS.  NOT HAVING BRAKES IS A MAJOR SAFETY ISSUE AND PUTTING MY LIFE, MY FAMILY'S LIFE AND THE LIFE OF PEOPLE ON THE ROAD AROUND US IS NOT WHAT I CONSIDER A GOOD PRODUCT.  PHOTOS FROM THE DEALER WILL BE ASKED FOR, ESPECIALLY THE VACUUM PUMP.  I WILL PROMPTLY FORWARD BILLS AS SOON AS THEY ARRIVE.",
        "vin": "3GNAXHEV6JL"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/08/2020",
        "dateOfIncident": "09/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353812,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "10/2019 - WHILE DRIVING ON HIGHWAY, COMING INTO A CONSTRUCTION ZONE, I WENT TO SLOW DOWN. WHEN I PUSHED MY BRAKES TO SLOW DOWN, THEY WERE VERY HARD AND WAS UNABLE TO PUSH THEM DOWN. ENDED UP HAVING TO DRIVE OFF THE SIDE OF THE ROAD TO AVOID COLLISION. VACCUM PUMP FAILED WHICH CAUSED A FAILURE IN MY BRAKE ASSIST SYSTEM. IT WAS FIXED UNDER WARRANTY.  9/2020 - DRIVING ON THE HIGHWAY AND WENT TO SLOW DOWN WHEN THE SAME THING HAPPENED AGAIN AND I WAS UNABLE TO SLOW DOWN. AGAIN HAD TO DRIVE OFF THE SIDE OF THE ROAD TO AVOID COLLISION. THIS TIME WHEN THE VACUUM PUMP FAILED, IT BROKE A GEAR CAUSING METAL PIECES TO BE SUCKED IN THE ENGINE AND NOW MY ENGINE IS NEEDING REPLACED.     THIS IS A COMMON PROBLEM WITH THIS CAR BASED ON THE RESEARCH I HAVE DONE BUT MY VIN IS NOT INCLUDED IN RECALL. I FEEL THIS IS VERY DANGEROUS TO HAPPEN TWICE IN LESS THAN A YEAR WHILE TRAVELING HIGH SPEEDS AND BEING UNABLE TO STOP. I HAVE 2 YOUNG CHILDREN THAT I NO LONGER FEEL SAFE PUTTING IN THIS VEHICLE",
        "vin": "2GNAXHEV1J6"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/06/2020",
        "dateOfIncident": "09/05/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353376,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IDLING OR AT A STOPPED LIGHT MY CAR JERKS WHEN I AM SITTING AT A RED LIGHT. IT HAS DONE THIS 4 OR 5 TIMES SINCE I PURCHASED THIS CAR. NO ONE KNOWS WHAT'S WRONG. I THINK THEY ARE WAITING UNTIL MY CAR IS OUT OF  WARRANTY BEFORE THEY ADDRESS IT.",
        "vin": "2GNAXJEVXJ6"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/29/2020",
        "dateOfIncident": "08/29/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351976,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD BECOMES FOGGY EASILY WHEN TEMPERATURE OUTSIDE CHANGES (TOO COLD) BECOMES DIFFICULT TO KEEP IT CLEAR",
        "vin": "2GNAXJEV1J6"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/18/2020",
        "dateOfIncident": "08/18/2020",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350086,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN THE ROAD THE CAR STARTED TO SMOKE UNDER THE HOOD AREA AND ALL I COULD SMELL WAS BURNED PLASTIC. PULLED OVER AND GOT OUT. NOT EVEN A MINUTE LATER THE CAR BURST INTO FLAMES.",
        "vin": "2GNAXSEV7J6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/14/2020",
        "dateOfIncident": "08/14/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349320,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS PARKED IN THE DRIVEWAY.  WITHOUT WARNING THE REAR WINDSHIELD GLASS SHATTERED COMPLETELY.  THERE WERE NO CRACKS, OR CHIPS.",
        "vin": "2GNAXSEV9J6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/13/2020",
        "dateOfIncident": "06/05/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349041,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUNSHADE IN THE EQUINOX 2018 PREMIER EDITION HAS AN OBVIOUS ISSUE THAT NO ONE WANTS TO ADDRESS. IT HAS BROKEN FOR THE SECOND TIME WHILE I AM DRIVING AND SENT PLASTIC PIECES FLYING AND I ALMOST CRASHED THE CAR!",
        "vin": "2GNAXVEV216"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/06/2020",
        "dateOfIncident": "02/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343792,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUNROOF OPENED TWICE BY ITSELF , ONE IT SAT FOR AWHILE I GOT IT CLOSED AND IT HAS NEVER OPENED AGAIN. NO POWER AS IF THE FUSE IS BLOWN NOW.",
        "vin": "3GNAXJEV9JS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/27/2020",
        "dateOfIncident": "07/26/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341616,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET EQUINOX. THE CONTACT STATED THAT WHILE DRIVING AT AN UNDISCLOSED SPEED, THE BRAKE PEDAL WAS DEPRESSED BUT WAS FIRM CAUSING THE BRAKING DISTANCE TO BE EXTENDED. THE SERVICE BRAKE ASSIST WARNING LIGHT WAS ILLUMINATED. RADLEY CHEVROLET (3670 JEFFERSON DAVIS HWY, FREDERICKSBURG, VA 22408, (540)898-4000) WAS CONTACTED AND INFORMED OF THE FAILURE. THE CONTACT WAS REFERRED TO THE MANUFACTURER FOR ASSISTANCE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS 54,000.",
        "vin": "3GNAXJEV7JS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/23/2020",
        "dateOfIncident": "07/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341147,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "9 MONTHS AGA, COMPLETE BRAKE FAILURE WHILE DRIVING ON THE HIGHWAY.  DASH SAID SERVICE BRAKE ASSIST.  TURNER CHEVROLET IN CROSBY, TX  REPLACED THE VACUUM PUMP MAKING THE BRAKES WORK.  NOW WE HAD THE SAME ISSUE AGAIN WHILE DRIVING ON THE HIGHWAY AT HIGHWAY SPEEDS.  IN BOTH CASES, WE INSTANTLY LOST ALL BRAKING, BUT WERE ABLE TO SLOW DOWN BY LETTING OFF THE ACCELERATOR AND HAD ENOUGH DISTANCE TO SLOW DOWN.",
        "vin": "2GNAXHEV4J6"
    },
    {
        "components": "WHEELS",
        "crash": true,
        "dateComplaintFiled": "06/29/2020",
        "dateOfIncident": "06/29/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11331523,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN INTERSTATE HEARD A LOUD BANG DRIVER FRONT .FRONT OF THE VEHICLE DROPPED TO THE GROUND AND VEHICLE STARTED TO ROLL 6 TIMES UPON FURTHER INSPECTION BY POLICE AND MECHANIC FRONT RIM EXPLODED AND DETACHED FROM VEHICLE LUG NUTS ARE THERE AND CENTER OF RIM IS THERE TIRES ARE ALL NEW BUT RIM WAS GONE",
        "vin": "3GNAXREVXJL"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/22/2020",
        "dateOfIncident": "05/07/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329950,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 CHEVROLET EQUINOX. CONSUMER WRITES IN REGARDS TO EXCESSIVE TIRE WEAR. *LD    THE CONSUMER STATED 3 OF THE 4 HANKOOK TIRES WEAR BADLY WORN. THE CONSUMER REQUESTED TO HAVE THE TIRES REPLACED. *JS",
        "vin": "2GNAXWEX0J6"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/27/2020",
        "dateOfIncident": "02/12/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326163,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I NEED TO ACCELERATE TO PASS A VEHICLE OR SPEED UP FROM A OFF OR ON RAMP, ENGINE LIGHT, ABS LIGHT, CHECK ESC LIGHT, ALL COME ON AND CRUISE CONTROL IS NOT ABLE TO BE USED. ENGINE HAS TO BE SHUT DOWN. TRANSMISSION IS SLIPPING AS WELL.  *TR",
        "vin": "3GNAXSEV3JS"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "05/15/2020",
        "dateOfIncident": "05/13/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324727,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING TO WORK ONE MORNING. WHEN I GOT INTO A CAR ACCIDENT AND HIT A CAR ALMOST HEAD ON. AS MY TRAFFIC LIGHT TURNED RED I STARTED TO BREAK BUT MY BRAKES LOCKED UP ON ME. WHICH FELT LIKE A BRICK. I TRIED TO PUMP THE BRAKES BUT IT WOULD NOT PUMP IT JUST STAYED VERY HARD LIKE A BRICK. I START TO SLIDE WHILE NOT REALLY REDUCING SPEED I TURNED MY STEERING WHEEL A LITTLE BIT TRYING TO AVOID THE ON COMING TRAFFIC WHEN MY STEERING WHEEL LOCKED AS WELL CAUSING ME SLIDE RIGHT INTO A CAR.  *TR",
        "vin": "3GNAXMEV4JL"
    },
    {
        "components": "ELECTRICAL SYSTEM,WHEELS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/02/2020",
        "dateOfIncident": "07/28/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323025,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS VEHICLE I JUNE 28TH OF 2018. I HAVE HAD TO TAKE IT INTO THE SHOP AT LEAST THREE TIMES WITH COMPLAINTS OF SQUEAKING FROM BRAKES MIRROR ALERT PROBLEMS TRUNK STICKING AND THE SUSPENSION HAS GOTTEN WORSE SINCE I FIRST STARTED DRIVING IT I'M NOTICING IT. EVERY TIME I COMPLAIN THEY TELL ME NOTHING IS WRONG EXCEPT FOR AT THE BEGINNING OF MY LEASE IT HAD TO BE TAKEN IN FOR REPAIRS. I WAS TOLD THAT THE BRAKES SQUEAKING IS NOT A SAFETY ISSUE AND IT WAS RECOMMEND TO CHANGE MY BRAKE PADS AND IN THE SAME CONVERSATION WAS TOLD THAT MY BRAKES WERE FINE. I SPOKE TO THE MANAGER AT BALISE CHEVY BECAUSE I FELT LIKE THIS VEICHELE WAS A LEMON. I ASKED IF THERE WAS ANYTHING THEY COULD DO BECAUSE I DID NOT HAVE TIME TO KEEP TAKING THIS BRAND NEW VEICHELE BECAUSE IT WAS A LEASE SO THEY DID NOTHING. BALISE CHEVY IN WARWICK SHOULD HAVE NOTES OF COMPLAINTS. I ALSO TOOK THE VEHICLE TO HURD AUTO MALL IN JOHNSTON. THERE WAS A SLOW LEAK IN ONE OF MY TIRES AND BALISE COULD NOT FIND THE LEAK SO I WAS TOLD IF IT HAPPENS AGAIN THEY WOULD SUBMERGE THE TIRE AND CHECK THAT WAY. THEY SENT ME HOME THE TIRE CONTINUED TO LEAK AIR MY LAST OIL CHANGE WAS DONE AT HURD AUTOMALL IN JOHNSTON WHERE THEY DID AN OIL CHANGE FOUND THE TIRE LEAK NO PROBLEM AND FIXED IT.",
        "vin": "2GNAXSEV9J6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/10/2020",
        "dateOfIncident": "04/08/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320800,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE DEALERSHIP DID GENERAL SERVICE ON 04/08/2020 AND REPORTED THAT ALL 4 TIRES WERE NEAR 2/32\" WITH ONLY 12,580 MILES ON THE VEHICLE.  DEALER STATED THERE WAS A MICHELIN RECALL FOR THESE TIRES. I COULD NOT FIND ONE LISTED, THE TIRES INVOLVED ARE MICHELIN LTX 225/60R 18 100H           DOT B5 14 016X 2317.",
        "vin": "3GNAXXEU1JS"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/27/2020",
        "dateOfIncident": "04/26/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319456,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Michelin North America, Inc.",
                "productMake": "MICHELIN",
                "productModel": "LTX M/S2",
                "productYear": "9999",
                "size": "LT275/65R20",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET EQUINOX EQUIPPED WITH MICHELINE TIRES, TIRE LINE: PREMIERE LTX TIRES, TIRE SIZE: 225/65/R17 N/A, DOT NUMBER UNAVAILABLE. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN TO MORAN CHEVROLET CLINTON TWP LOCATED AT (35500 GRATIOT AVE, CLINTON TWP, MI 48035, (866) 774-3206) FOR ROUTINE MAINTENANCE AND THE CONTACT WAS INFORMED THAT THE TIRES WERE WORN AND NEEDED TO BE REPLACED. THE TIRES WERE NOT REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE WHO REFERRED THE CONTACT TO GO TO THE DEALERSHIP. THE TIRES WERE ORIGINAL EQUIPMENT. THE APPROXIMATE FAILURE MILEAGE ON BOTH THE VEHICLE AND THE TIRES WERE 15,800.",
        "vin": "2GNAXJEV8J6"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/22/2020",
        "dateOfIncident": "03/19/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318966,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR LITERALLY DIED OUT. ALL  OF A SUDDEN THE RPMS WENT UP HIGH AND IT STARTED TO SPUTTER.  AT ONE POINT HAD TO PUSH FOOT ALL THE WAY DOWN ON GAS PEDDLE",
        "vin": "3GNAXVEV3JL"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/13/2020",
        "dateOfIncident": "02/28/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317938,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK CAR TO DEALER FOR ROUTINE OIL CHANGE AND SERVICE, I REPORTED TO THEM A VERY FREQUENT PROBLEM WITH CAR HESITATING TO ACCELERATE ANDJERKS AT SPEED BETWEEN 40 AND 50 MPH   ALSO PASSSENGER CAN FEEL THIS RIDING IN THE BACK SEAT. TOOK TO DEALER THEY SAID NOTHING SHOWED ON COMPUTER BUT GM HAS SOFTWARE ISSUE.  FOR THE PRICE OF CARS  FEEL THAT THIS IS NOT ACCEPTABLE  PERFORMANCE TO HAVE TO DRIVE AN OTHERWISE NICE   CAR   I NOTICES SEVERAL OTHER SIMILAR COMPLAINT ON THIS WEBSITE",
        "vin": "3GNAXSEV2JS"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/12/2020",
        "dateOfIncident": "03/10/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317720,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE TIRE WEAR, 17,700 MILES, TREAD DEPTH ACCORDING TO LEASE INSPECTION REPORT DEPTH 2.5/32. TIRES WERE ROTATED 2X. BRAND OF TIRE IS MICHELIN 225//65/17 PREMIER LTX.    WAS TOLD BY LEASE COMPANY INSPECTOR TIRES ARE NOT SAFE.    DOT M3 3T 02VX 4817",
        "vin": "2GNAXJEV4J6"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/10/2020",
        "dateOfIncident": "02/04/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317240,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD STOPPED AT A STOPLIGHT.  WHEN THE LIGHT TURNED GREEN DEPRESSED ACCELERATOR.  THE CAR MOVED FORWARD BUT DID NOT PROCESS THROUGH THE GEARS STAYING IN FIRST GEAR ONLY.  PULLED OVER AND PUT THE VEHICLE IN PARK AND THEN IT WORKED FINE.  A FEW DAYS LATER I WAS STOPPED AT A STOP SIGN MAKING A LEFT TURN ACROSS A BUSY HIGHWAY.  WENT TO ACCELERATE AND THE VEHICLE DID NOT RESPOND.  IT WAS AS IF INSTEAD OF SHIFTING INTO 1ST GEAR IT SOMEHOW SHIFTED INTO 3RD WHICH LEFT ME WITH NO ACCELERATION AS I PULLED OUT TO MAKE A LEFT ACROSS TRAFFIC.  I IMMEDIATELY TO THE VEHICLE TO THE DEALER ON 2/4/2020 BUT DEALER SERVICE GARAGE DID NOT FIND ANY PROBLEM.  FILED A CLAIM #9-5847192733 WITH THE MANUFACTURER BUT THEY SAID THAT IF THE DEALER COULD NOT FIND ANYTHING THEN THERE WAS NOTHING THEY COULD DO.  I REVIEWED WITH THEM THE DEALER STATED THAT THEY COULD ONLY PERFORM THE WORK THE MANUFACTURED ALLOWED THEM TO WHICH WAS TO CHECK THE BATTERY CABLES TO MAKE SURE THEY WERE TIGHT.",
        "vin": "2GNAXTEXXJ6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/08/2020",
        "dateOfIncident": "02/24/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316912,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HESITATES AND AT TIMES DOES NOT ACCELERATE WHEN THE ACCELERATOR IS DEPRESSED, PRIMARILY NOTED IN COLD WEATHER CONDITIONS.  HESITATIONS HAVE OCCURRED ON SEVERAL OCCASIONS BUT THERE HAVE BEEN TWO OCCASIONS WHEN ATTEMPTING TO MERGE INTO ONCOMING TRAFFIC, THE VEHICLE DID NOT RESPOND TO ACCELERATOR INPUT, ONCE OCCURRING FROM A STATIONARY POSITION AND ONE TIME OCCURRING WHEN DRIVING APPROXIMATELY 30 MILES PER HOUR WITH BOTH INCIDENTS OCCURRING ON CITY STREETS WITH A POSTED SPEED LIMIT OF 40 MILES PER HOUR.  THE VEHICLE HAS BEEN TAKEN TO THE DEALERSHIP ON SEVERAL OCCASIONS AND THE DEFECT APPARENTLY IS WITH THE CHARGE AIR COOLER.",
        "vin": "2GNAXJEV3J6"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/02/2020",
        "dateOfIncident": "01/17/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315566,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT'S PARENTS OWNS A 2018 CHEVROLET EQUINOX. THE CONTACT STATED THAT ON MULTIPLE OCCASIONS, THE VEHICLE FAILED TO START WITHOUT WARNING. THE VEHICLE WAS TOWED TO JEFF GORDON CHEVROLET (228 S COLLEGE RD, WILMINGTON, NC 28403) WHERE IT WAS DIAGNOSED WITH A DEFECTIVE COMPUTER SYSTEM AND REPAIRED. THE VEHICLE WAS REPAIRED HOWEVER, THE FAILURE RECURRED. THE VEHICLE WAS THEN TOWED TO WESTGATE CHEVROLET OF BURGAW (1320 US-117, ST HELENA, NC 28425) TO BE DIAGNOSED.  THE CONTACT WAS INFORMED THAT THE COMPUTER SYSTEM NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER HAD NOT BEEN NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "3GNAXHEVXJL"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/23/2020",
        "dateOfIncident": "02/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310920,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER IS LEAKING INTO THE SPARE TIRE WELL.",
        "vin": "3GNAXMEV1JL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/20/2020",
        "dateOfIncident": "02/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310438,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON I-95 IN PALM BEACH COUNTY FLORIDA, IN HEAVY TRAFFIC, I CAME TO A STOP AND THE CAR AUTOMATICALLY SHUT OFF. THIS IS WHAT IS SUPPOSED TO HAPPEN. HOWEVER, WHEN I TOOK MY FOOT OFF THE BRAKE THE CAR DID NOT RESTART. WHEN THAT HAPPENED THE ENTIRE CAR WENT DEAD. I COULD NOT TURN ON THE HAZZARD SIGNAL, I COULD NOT LOCK OR UNLOCK THE DOORS, ONSTAR WOULD NOT WORK. I PUT THE CAR IN PARK AND TRIED TO RESTART THE CAR. NOTHING AT ALL HAPPENED. I THEN TRIED TO PUT THE CAR IN NEUTRAL, BUT IT WOULD NOT SHIFT TO NEUTRAL. I THEN TRIED ONSTAR AGAIN, BUT EVEN THOUGH THE GREEN LIGHT WAS ON, NOTHING HAPPENED. I GOT OUT OF THE CAR SO THAT IF IT GOT HIT, I WOULD NOT BE HURT. THE CAR WAS IN THE RIGHT DRIVING LANE OF AN EXTREMELY BUSY HIGHWAY AND I COULD NOT GET IT OFF THE ROAD.",
        "vin": "2GNAXHEV6J6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/07/2020",
        "dateOfIncident": "02/04/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307683,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN COMING TO A STOP ENGINE CONSTANTLY SHUTS OFF",
        "vin": "2GNAXSEV4J6"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/05/2020",
        "dateOfIncident": "04/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307285,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET EQUINOX. WHILE DRIVING AT 25 MPH, THE CONTACT WAS COMING TO A STOP. THE CONTACT STATED WHILE DEPRESSING ON BRAKE PEDAL THE VEHICLE WOULD JERK FORWARD WITH NO WARNING LIGHTS. THE CONTACT TOOK THE VEHICLE TO A DEALER (JOE FIRMENT CHEVROLET INC.,37995 CHESTER RD, AVON, OH 44011) WHERE THE VEHICLE WAS NOT DIAGNOSED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 12,000.",
        "vin": "3GNAXMEV1JL"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/29/2020",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302762,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET EQUINOX. THE CONTACT STATED THAT ON SEVERAL OCCASIONS WHILE STOPPED THE FUEL SAVING SYSTEM ACTIVATED AND SHUT THE ENGINE OFF BUT WHEN THE DRIVER LIFTED OFF THE BRAKE PEDAL THE VEHICLE FAILED TO RESUME OPERATION AS DESIGNED. AFTER RESTARTING THE VEHICLE, THE VEHICLE OPERATED AS INTENDED. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER CAMINO REAL CHEVROLET (2401 S. ATLANTIC BLVD, MONTEREY PARK CA.) WHO WAS UNABLE TO DUPLICATE THE FAILURE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 20,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/27/2020",
        "dateOfIncident": "01/17/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302206,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE HIGHWAY AND I GOT AN ERROR SAYING ENGINE POWER REDUCED, AND MY ENGINE CUT OUT, AND THEN RIGHT AFTER, I GOT AN ERROR SAYING BRAKE ASSIST ON, AND MY BRAKES FELT LIKE A BRICK WHEN I TRIED TO PUSH THEM. I MADE IT TO THE EMERGENCY LANE ON THE HWY, AND PUSHED MY BRAKES REALLY HARD AND THEN PUT THE PARKING BRAKE ON. AFTER GETTING IT TOWED TO THE CLOSEST DEALERSHIP, THE SERVICE ADVISOR TOLD ME THIS IS A KNOWN ISSUE WITH EQUINOXS WITH MY ENGINE TYPE, WHERE THE VACUUM PUMP GOES OUT, AND THEN THE GEAR RUNNING IT BRAKES, AND THEN THE METAL FROM THAT GEAR GOT SUCKED UP INTO MY ENGINE. THAT VACUUM PUMP CONNECTS TO BOTH MY BRAKES AND MY ENGINE, WHICH IS WHY I LOST BOTH AT THE SAME TIME WITH NO PRIOR WARNINGS OR ANY INDICATION ANYTHING COULD BE WRONG BEFORE IT HAPPENED. MY ENGINE IS NOW COMPLETELY BLOWN WITH NO WARNING. IT'S A KNOWN ISSUE WITH THE FACTORY PART, AND THEY ASSURED ME IT HAD NOTHING TO DO WITH MAINTENANCE OR ANYTHING, SOME OF THE VACUUM PUMPS THEY USED ARE JUST BAD. THERE ARE NO OPEN RECALLS ON MY VIN. THIS COULD HAVE BEEN VERY BAD. I LOST MY BRAKES AND MY ENGINE GOING HIGHWAY SPEEDS ON A BRIDGE. I WAS JUST LUCKY ENOUGH TO BE ABLE TO MAKE IT TO THE EMERGENCY LANE AND STOP WITHOUT GETTING HIT OR HITTING ANYONE ELSE.",
        "vin": "3GNAXJEV4JL"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/26/2020",
        "dateOfIncident": "10/07/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302110,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ALMOST IN A ROLLOVER ACCIDENT ON OCT 7, 2019. I WAS TRAVELLING ON STATE HIGHWAYS FROM AUBURN, PA TO HERSHEY, PA AT APPRX 930AM. ROADS WERE DAMP/WET BUT RAIN HAD STOPPED. SINCE I PURCHASED MY VEHICLE, I HAD ALWAYS ENGAGED ALL SAFETY FEATURES INCLUDING LANE KEEP ASSIST (LKA), COLLISION ALERTS, ETC. THIS WAS MAIN REASON I UPGRADED FROM MY 2014 EQUINOX. ON RT 183, HEADING UP A WINDING MOUNTAIN ROAD, I ALMOST LOST CONTROL SEVERAL TIMES, DESPITE DRIVING WELL UNDER SPEED LIMIT. **NOTE: MY BF AND I HAD PREVIOUSLY COMPLAINED TO DEALER, AND EVEN HAD IT IN FOR SERVICE, BC WE BOTH FELT CAR PULLED TO THE RIGHT ON ITS OWN. WE ARE BOTH EXTREMELY SAFE, EXPERIENCED, NON-DISTRACTED DRIVERS AND THOUGHT SOMETHING WAS QUITE ODD/OFF. DEALER FOUND NOTHING. CLOSER TO HERSHEY, I WAS COMING AROUND A BEND IN THE ROAD ON I BELIEVE RT 743 WHEN SUDDENLY MY CAR PULLED ME SEVERELY TO THE RIGHT AND ALMOST OVER AN EMBANKMENT, WHICH WOULD HAVE LED TO A ROLLOVER CRASH AND POTENTIAL SERIOUS INJURY OR DEATH. BY THE GRACE OF GOD, AND GREAT DRIVING, I JUST MISSED A STONE WALL, AND MY ?1/4 MILE SWERVING SKID BACK AND FORTH PING-PONGED ME ALL OVER THE ROADWAY, BARELY AVOIDING MAILBOXES, FENCES, AND A HOUSE. LUCKILY ONCOMING TRAFFIC DID NOT APPEAR UNTIL I STRAIGHTENED OUT OF MY SKID. I CALLED THE DEALER AND SAID \"MY CAR JUST TRIED TO KILL ME.\" AFTER RESEARCH, THEY CALLED ME BACK AND SAID TO TURN OFF THE LKA. I HAVE, AND CAR NO LONGER PULLS TO THE RIGHT, EVER. I READ THE MANUAL, AND BURIED AROUND PAGE 254 IS A SMALL BLACK BOX WARNING THAT SAYS TO DISENGAGE LKA ON WET, CURVING ROADS OR COLLISIONS MAY OCCUR. REALLY???? PEOPLE CAN DIE, AND THE WARNING IS BURIED ON PAGE 254??? I HAVE TALKED TO OTHER NEWER CAR OWNERS WHO HAVE HAD SIMILAR EXPERIENCES IN OTHER CARS/BRANDS. I THINK THESE \"SAFETY FEATURES\" ARE A DOUBLE EDGE SWORD AND NEED FURTHER RESEARCH. I ALMOST DIED.",
        "vin": "3GNAXWEXXJL"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/16/2020",
        "dateOfIncident": "12/23/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299784,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING APPROXIMATELY 65 MPH ON THE STATE HIGHWAY, THE CARE BEGAN TO SLOW DOWN IN SPEED CLOSE TO 30 MPH WHICH WAS A HAZARD ON THE HIGHWAY AT THAT TIME OF DAY. I PRESSED ON THE GAS TO INCREASE SPEED, BUT NOTHING HAPPENED. I FEARED BEING HIT FROM BEHIND SO I SAFELY COASTED TO THE OFF RAMP, THEN IT JERKED, AS IF RE-STARTING THE ENGINE. I FEARED FOR MY LIFE AND THAT OF MY CHILD.",
        "vin": "3GNAXJEV8JS"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/04/2020",
        "dateOfIncident": "01/04/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297165,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE NAVIGATION SCREEN IS WAY TOO BRIGHT AT NIGHT, MAKING DRIVING DIFFICULT AND DISTRACTING. WHEN THE CAR IS STARTED AT NIGHT THE BRIGHTNESS IS NORMAL BUT AFTER USING REVERSE IT BRIGHTENS TO DAYTIME LEVEL AND CANNOT BE CHANGED WITHOUT DIMMING THE DASHBOARD LIGHTS CONSIDERABLY. MANY OTHER 2018 EQUINOX OWNERS HAVE REPORTED THE SAME PROBLEM ON VARIOUS WEB FORUMS.",
        "vin": "2GNAXSEV7J6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/01/2020",
        "dateOfIncident": "05/29/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11292445,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE PICKING UP THIS VEHICLE ON 5/29/18 I HAVE NOTICED (OCCASIONALLY) THAT THERE IS A \"GRAB OR PULL\" ON THE STEERING WHEEL.  THE ALIGNMENT APPEARS TO BE OKAY, AND WHEN I HAD THE OIL CHANGED I WAS TOLD I HAD TO MAKE AN APPOINTMENT TO HAVE THIS CHECKED.  I WAS ALSO ADVISED THAT I NEEDED A NEW SET OF TIRES!  THIS WAS CONCERNING TO ME AS I HAD JUST PURCHASED THIS VEHICLE.  WHEN THE TIRES WERE REPLACED, I WAS INFORMED THAT THE ALIGNMENT WAS OKAY.  I AGAIN MENTIONED THE \"GRAB/PULL\" SITUATION AND WAS TOLD IT MIGHT HAVE BEEN THE TIRES.  AFTER DRIVING THIS VEHICLE, AND HAVING TWO OTHER PEOPLE DRIVE THE SAME, THE SITUATION STILL EXISTS.  WE HAVE ALL DRIVEN OTHER CARS OVER THE SAME ROADS AND HAVE NOT HAD THE SAME RESULTS.  I AM WONDERING IF THIS COULD BE A FAULTY SENSOR?  I HAVE NOTICED THIS GOING STRAIGHT ON A HIGHWAY.",
        "vin": "2GNAXVEV5J6"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/31/2019",
        "dateOfIncident": "12/19/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11292216,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST FINSHED MY SECOND YEAR INTO MY 3 YEAR 2018 CHEVY EQUINOX LEASE AND FOR THE LAST MONTH OR SO THE SERVICE BRAKE ASSIST HAS APPEARED  AND DISSAPEARED DOZENS OF TIMES WHEN STARTING THE VEHICLE AND WHILE DRIVING AS WELL AS THE CHECK ENGINE LIGHT HAS COME ON AND OFF FOR THE LAST FEW WEEKS. ORGINALLY MAD AN APPOINTMENT BUT THE DEALER SHIP CANCLLED IT AND THEN MY CAR SUDDENLY HAD REDUCED POWER THE  DIED IN THE MIDDLE OF THE ROAD AS I WAS DRIVING ON THE ROAD. NOT A HIGHWAY. GOT IT TOWED TO THE DEALER AND THE SAY A VACUM PUMP SEIZED? NOW ARE SAYING THERE IS METAL IN THE ENGINE AMD THEY DONT KNOW WHY. TRYING TO GET ME TO PAY FOR COST. HAVE TAKEN CAR OF VEHCHILE AND DONE THE REQUIRED MATINENCE. THIS SHOULD NOT BE HAPPENING ON A 2 YEAR OLD CAR WITH ON 32000 MILES. VERY CONCERNED THERE IS SOMETHING DEFECTED WITH THE CAR. AS NUMEROUS VEHICLES HAVE BEEN RECALLED FOR SIMILAR ISSUES TO MINE BY GM.",
        "vin": "3GNAXSEV8JS"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/11/2019",
        "dateOfIncident": "12/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288441,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SUDDENLY POWERED DOWN WHILE ON THE EXPRESSWAY IN MORNING TRAFFIC, CAUSING THE VEHICLE TO SHAKE AND SLOW TO AN UNSAFE SPEED.  I EASED OFF THE EXPRESSWAY TO GET OUT OF THE WAY OF BIG TRUCKS, ETC., AND WAS SCARED TO TURN OFF THE EXIT FOR FEAR THAT IT WOULD STALL AGAIN AND I WOULD BE HIT BY ONCOMING TRAFFIC.  THIS IS THE 3RD TIME THIS HAS HAPPENED, EACH TIME THEY REPLACE SOMETHING ELSE.  YOU NEED TO FORCE CHEVROLET TO MAKE A RECALL ON THESE UNSAFE VEHICLES!",
        "vin": "2GNAXJEV8J6"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/26/2019",
        "dateOfIncident": "11/20/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282560,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I STALLED OUT IN THE MIDDLE OF DRIVING, THE CHECK ENGINE LIGHT CAME ON AND THEN A MESSAGE SAYING THE ENGINE POWER WAS LOW. THE CAR WOULD NOT START OR GO INTO NEUTRAL HOWEVER I WAS ABLE TO PUT THE HAZARD LIGHTS ON AS WELL AS THE RADIO AND ON-STAR.  THE TOW TRUCK DRIVER GOT IT STARTED IN LOW GEAR TO GET IT ON THE TOW TRUCK, BUT IT DIDN'T START AGAIN. I WAS ON A CITY STREET IN RUSH HOUR, GOING LESS THAN 15 MPH.   I JUST GOT MY VEHICLE BACK FROM SERVICE AT THE MIRAK.COM DEALERSHIP IN ARLINGTON, MA, AND APPARENTLY THE ISSUE WAS: \"CAUSED BY: PERFORM SCAN TOOL TEST. THE TECH \"EXTRACT CODES WITH SCAN TOOLS\". I WAS TOLD THAT IT \"JUST NEEDED A SOFTWARE UPDATE\". THE VEHICLE DID NOT PROVIDE ANY ALERTS PRIOR TO THE INCIDENT OR SHOW ANY SIGNS OF AN ISSUE, SO THIS IS VERY ALARMING AND A SIGNIFICANT SAFETY CONCERN.",
        "vin": "3GNAXSEV0JS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/29/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11276931,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET EQUINOX. WHILE DRIVING 40 MPH, THE BRAKE PEDAL TRAVELED TO THE FLOORBOARD WHEN IT WAS DEPRESSED. THE CONTACT'S VEHICLE FAILED TO STOP AND CRASHED INTO TWO VEHICLES. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT SUSTAINED BURNS TO THE ARMS AND HANDS, BUT MEDICAL ATTENTION WAS NOT PROVIDED. THE AIR BAGS DEPLOYED. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHO REFERRED THE CONTACT TO THE LOCAL DEALER. THE CONTACT STATED THAT THE FAILURE RECURRED THIRTY DAYS LATER. THE VEHICLE WAS TOWED TO MATTHEWS-HARGREAVES CHEVROLET (2000 TWELVE MILE RD, ROYAL OAK, MI 48067, (866) 275-2746), BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS CONTACTED AND PROVIDED CASE NUMBER: [XXX]. THE FAILURE MILEAGE WAS UNKNOWN. *LN    ('PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).')*JB*JB",
        "vin": "3GNAXKEX3JL"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/26/2019",
        "dateOfIncident": "10/22/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271213,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT EQUINOX IN MARCH 2018 EQUIPPED WITH 4 HANKOOK TIRES. SHORTLY AFTER PURCHASE, THE HANKOOK TIRES BEGAN TO LOSE AIR PRESSURE. IN JANUARY OF 2019, I TOOK THE CAR IN FOR THE ANNUAL STATE INSPECTION AND TOLD THE MECHANIC THE RIGHT REAR TIRE LOST MUCH MORE AIR PRESSURE THAN THE OTHER TIRES. THE MECHANIC SAID THERE WAS A SCREW IN IT.  IT WAS PATCHED.THE TIRE WAS ROTATED FROM BACK TO FRONT. THE TIRES WERE STILL LOSING PRESSURE .ON OCTOBER 22, 2019, WHILE PARKED AT MY HOME, THE RIGHT FRONT HAD 5LBS AND THE RIGHT REAR HAD 6LBS OF PRESSURE. I PUT AIR IN THE TIRES, THE RIGHT REAR TOOK THE AIR, BUT THE RIGHT FRONT WOULD NOT. I HAD THE CAR TOWED IN ON OCTOBER 24, 2019 TO THE DEALER, PRIORITY CHEVROLET IN CHESAPEAKE, VA AND THEY HAD TO PUT 2 GOODYEAR TIRES ON TO REPLACE THE HANKOOK ONES BECAUSE THE HANKOOK TIRES HAD BEEN DISCONTINUED. MY CONCERN IS THE THAT THE 2 REMAINING HANKOOK TIRES MIGHT GO FLAT WHILE DRIVING.",
        "vin": "2GNAXVEV6J6"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/22/2019",
        "dateOfIncident": "10/20/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270329,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ROUGHLY 38K MILES ON VEHICLE, WENT ON A ROAD TRIP AND ABOUT 80 MILES INTO THE TRIP, WAS SLOWING DOWN FOR TRAFFIC AND BREAKS WENT OUT, THE MASTER CYLINDER. IT WAS INCREDIBLY HARD TO PRESS DOWN ON THE BREAKS TAKING ALL MY EFFORT TO STOP THE CAR.",
        "vin": "3GNAXREV5JS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/17/2019",
        "dateOfIncident": "10/17/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269244,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SIDE DOOR WINDOW SHATTERED.  I HAD JUST ENTERED THE HIGHWAY AND THE WINDOW SHATTERED. I DIDN'T FIND AN OBJECT IN THE CAR THAT COULD HAVE CAUSED IT.",
        "vin": "2GNAXHEV9J6"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/30/2019",
        "dateOfIncident": "09/27/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11259023,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES GRABS,MAKES LOUD SCRUBBING NOISE WHEN APPLIED TO SLOW DOWN,STOP,OR TURN.SOUND LIKE RIGHT FRONT END RODS GOING TO BREAK, AND FEELS LIKE BRAKES SLIPPING, AND NOT WANTING TO STOP AT TIMES.",
        "vin": "3GNAXJEV4JL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/30/2019",
        "dateOfIncident": "09/27/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11259041,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HESITATED TO MOVE WHEN GAS APPLIED WHEN TAKING OFF FROM STOPLIGHT.IT MADE A QUICK JERKING  FORWARD, AND BACKWARD MOVEMENT AS IF TO GO, OR SHUT DOWN,THEN TOOK OFF. POSSIBLELY RELATED TO POWERTRAIN?  .",
        "vin": "3GNAXJEV4JL"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/24/2019",
        "dateOfIncident": "09/23/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257793,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE KEYLESS START ON MY 2018 EQUINOX. PULLED OUT OF PARKING LOT AT 5PM ONTO MAJOR ATLANTA STREET AND CAR SHUT OFF. RESTARTED IT AND IT SHUT OFF AS SOON AS I PRESSED THE GAS PEDAL. REPEATED THIS FOUR TIMES UNTIL I REALIZED THAT PRESSING THE GAS PEDAL WAS CAUSING IT TO POWER DOWN. RESTARTED IT AGAIN, LEFT IT IN DRIVE,  AND COASTED INTO A PARKING LOT AND PARKED IT. HAD IT TOWED TO DEALERSHIP. TOW TRUCK DRIVER SAID HE'S BEEN TOWING A LOT OF NEWER EQUINOXES BECAUSE THEY LOSE POWER. EXTREMELY DANGEROUS AND FRIGHTENING. THERE'S NO RECALL, BUT ANOTHER WEBSITE SAID THERE ARE ENOUGH COMPLAINTS THAT IT NEEDS TO BE ADDRESSED.",
        "vin": "2GNAXHEV2J6"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,SEATS",
        "crash": false,
        "dateComplaintFiled": "09/11/2019",
        "dateOfIncident": "05/24/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254827,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD WAS NOT PROPERLY SEALED FROM THE MANUFACTURE. WHILE DRIVING ON THE INTERSTATE, SEATS AND MIRRORS RANDOMLY MOVED. AT ONE POINT THE SEAT WAS SO CLOSE TO THE STEERING WHEEL, CAUSING HUSBAND'S STOMACH TO TOUCH THE WHEEL. THUS CAUSING THE INABILITY TO TURN AND CONTROL THE STEERING OF VEHICLE. MIRRORS MOVED RANDOMLY OUT OF POSITION, CAUSING INABILITY TO SEE BLIND SPOTS WHILE DRIVING ON THE INTERSTATE. I PURCHASED THIS CAR ON 5-15. THIS FIRST INCIDENT OCCURRED 5-24. THE SECOND INCIDENT HAPPENED 6-10 AGAIN WHILE DRIVING. THE RAIN INSIDE THE UNSEALED WINDSHIELD CAUSED CORROSION ON ELECTRICAL WIRING AND CONNECTIONS. THERE IS CORROSION ALSO INSIDE THE BODY. THIS BRAND NEW VEHICLE IS RUSTING FROM THE INSIDE OUT. THERE WILL ALWAYS BE ISSUES WITH THIS CAR EITHER ELECTRICAL OR BODY.",
        "vin": "3GNAXXEU5JS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/03/2019",
        "dateOfIncident": "08/31/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252918,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING 70+MPH ON A FREEWAY AND I WENT TO SLOW DOWN FOR A SPEED LIMIT CHANGE FOR ROAD CONSTRUCTION. I COULDN'T PUSH DOWN ON THE BRAKES!! THANKFULLY THERE WASN'T ANYONE IN FRONT OF ME! I WAS ABLE TO PUT ON MY HAZARD LIGHTS AND COAST WHILE PUSHING AS HARD AS I COULD ON THE BRAKES. I MADE IN TO AN OFF RAMP AND WAS ABLE TO SLOW DOWN ENOUGH TO STOP AND THROW IT IN PARK AND E-BRAKE IT. THIS COULD HAVE ENDED VERY BADLY! I FOUND THAT THERE IS AN OPEN INVESTIGATION ON THE VACCUM PUMP, BUT NO OFFICIAL RECALL... (WHICH IS WHAT MINE TURNED OUT TO BE) I HOPE THEY ARE NOT WAITING FOR FATALITIES!!",
        "vin": "2GNAXWEX2J6"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/07/2019",
        "dateOfIncident": "07/26/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242272,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT.  SHUT DOWN 5 TIMES. ERRATIC DELAYED STALLING AT IDLE OR SPEED. BUCKING. NOT ABLE TO SHIFT GEARS. BUCKS STALLS TURNS BACK ON. CAR WAS ON HIGHWAY, ON CITY STREET, MERGING WITH TRAFFIC. MADE DRIVING DIFFICULT INCREDIBLY DANGEROUS.  HARSH SHIFTS. MISFIRE AND HESITATION. LAST 10 MONTHS.",
        "vin": "3GNAXHEV9JS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/02/2019",
        "dateOfIncident": "02/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241243,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I AM IN STOP AND GO TRAFFIC I GET A STRONG CHEMICAL SMELL IN MY AIR CONDITIONER. I TOOK IT TO MY DEALER SEVERAL TIMES AND THEY \"COULD NOT SMELL IT\" . MY EYES WATER,AND I GET A HEADACHE IF I DRIVE FOR ANY LENGTH OF TIME I HAVE TO PUT MY WINDOWS DOWN. TWO TECH DID SAY THEY SMELLED IT FAINTLY. I GAVE UP TAKING IT IN BUT I DO STILL HAVE THE PROBLEM. I ONLY HAVE ABOUT 18000 MILES ON IT AND DRIVE MOSTLY SHORT TRIPS.",
        "vin": "3GNAXJEV1JS"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/17/2019",
        "dateOfIncident": "07/16/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232777,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TWO OCCASIONS MY TRANSMISSION WOULDN'T ENGAGE WHEN I SHIFTED IT FROM \"PARK\" TO \"DRIVE.\"  MY CAR STARTED ROLLING LIKE IT WAS IN NEUTRAL.  I SLAMMED ON MY BRAKES AND AFTER ABOUT 3 - 5 SECONDS THE TRANSMISSION ENGAGED AND I WAS ABLE TO ACCELERATE AS NORMAL.",
        "vin": "3GNAXTEX1JL"
    },
    {
        "components": "EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/10/2019",
        "dateOfIncident": "02/09/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230836,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "USING NAVIGATION WITH PHONE THROUGH INFOTAINMENT DISPLAY CAN SWITCH TO BLINDING BRIGHTNESS AT NIGHT.  USING PHONE NAVIGATION (BOTH GOOGLE MAPS AND WAZE) AT NIGHT   WILL START WITH NORMAL BRIGHTNESS WHICH CAN BE CONTROLLED BY THE DIMMING KNOB.  IF A PHONE CALL OR TEXT IS RECEIVED THE DISPLAY GOES TO FULL BRIGHTNESS AND CANNOT BE DIMMED   THIS CAUSED ME TO SWERVE OFF OF THE ROAD IT WAS SO BLINDING     THE CONDITION CAN ALSO BE SIMULATED BY ENGAGING THE BACKUP CAMERA AT NIGHT   THIS WAS REPORTED TO MY DEALER OVER A YEAR AGO   IN THE CASE OF THE PHONE CALL THE VEHICLE WAS MOVING     THIS PROBLEM HAS BEEN MENTIONED ON MULTIPLE FORUMS  SO I BELIEVE THIS IS RELATED TO THE SOFTWARE AND NOT AN ISOLATED INCIDENT",
        "vin": "2GNAXSEVXJ6"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/29/2019",
        "dateOfIncident": "05/23/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210622,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET EQUINOX. WHILE DRIVING 65 MPH, THE PASSENGER SIDE WINDSHIELD EXPLODED WITHOUT WARNING OR AN IMPACT. THERE WERE NO INJURIES. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS NOTIFIED AND DID NOT ASSIST. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS 21,000.",
        "vin": "3GNAXJEV4JS"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/24/2019",
        "dateOfIncident": "05/22/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209682,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE ARE 2 PROBLEMS WHICH ARE INTERRELATED  1)  WHEN STOPPED AT A STOP LIGHT THE VEHICLE DOES NOT REPOND WHEN THE GAS IS APPLIED TO MOVE FORWARD WHEN THE LIGHT TURNS GREEN.  THEN, THE VEHICLE SUDDENLY LURCHES INTO GEAR.  2)  THE \"D\" FOR DRIVE ON THE DASHBOARD FLASHES INDICATING AN ERROR CODE HAS BEEN WRITTEN TO THE TRANSMISSION CONTROL MODULE.  WHEN I TOOK MY VEHICLE IN FOR REPAIR BECAUSE THIS WAS HAPPENING THE DEALERSHIP TOLD ME THAT THERE WAS NO ERROR CODE ON THE TRANSMISSION CONTROL MODULE SO THEY DO NOT HAVE A WAY TO DIAGNOIS WHAT IS HAPPENING AND THAT THIS IS A KNOWN PROBLEM AND WERE ADVISED BY THE MANUFACTURER TO NOT MAKE ANY REPAIRS BECAUSE THAT MAY NOT SOLVE THE PROBLEM.  THE DEALERSHIP INDICATED THE MANUFACTURER FELT THIS MAY BE DUE TO A SOFTWARE PROBLEM AND MAY NEED TO COMPLETE A SOFTWARE UPDATE AT SOME FUTURE POINT IN TIME. HOWEVER, I'VE SEEN POSTS FROM OTHER CHEVY EQUINOX OWNERS WITH MODELS DATING BACK TO 2014 WITH THIS SAME HESITANCY AND JERKING ISSUE.",
        "vin": "2GNAXTEXXJ6"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/06/2019",
        "dateOfIncident": "05/06/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205740,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM DRIVING DOWN THE HIGHWAY WHEN I GET A WARNING SAYING SERVICE BRAKES.  I WENT TO HIT MY BRAKES AND I HAD NONE AT ALL! I ALMOST HIT A CAR BECAUSE IT WAS GETTING OFF THE RAMP AND HIT ITS BRAKES.  I HAD TO GO OVER TO THE SIDE OF THE ROAD TO KEEP FROM HITTING IT.  I FOUND OUT THAT THE BRAKE VACUUM PUMP WENT OUT.  I KNOW THAT GM IS DOING A INVESTIGATION ON THIS.  MY CAR IS NOW AT THE DEALERSHIP GETTING REPAIRED.  I DON'T WANT THIS TO HAPPEN TO SOMEONE ELSE.  I HAD NO WARNING AT ALL THAT MY BRAKES WAS NOT GOING TO WORK. THANK GOD I WAS ABLE TO GET STOPPED WITHOUT BEING IN A ACCIDENT.  THIS IS A BIG SAFETY HAZARD!!!!!",
        "vin": "2GNAXJEV5J6"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/26/2019",
        "dateOfIncident": "04/23/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204033,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN HAVING ISSUES WITH THE TIRES , AT FIRST I HAD A SCREW IN THE BACK PASSENGER TIRE . THE DEALERSHIP DID FIX THAT, THEN I HAD TO TAKE THE VEHICLE BACK BECAUSE THE SAME TIRE KEPT LOOSING AIR THEN IT WAS THE VALVE STEM, NOW THE TIRE ON THE BACK PASSENGER SIDE IS SHOWING THAT IT IS LOW AND I HAVE HAD TO GO TO THE DEALERSHIP, THEY ARE GIVING ME GRIEF ABOUT THESE [XXX] TIRES ! I DON'T KNOW IF IT IS SOMETHING GOING ON WITH THE SENSORS OR IF THEY JUST NEED TO GO ON AND REPLACE THESE TIRES SINCE I AM ON THE NEW TIRES FOR LIFE PROGRAM BUT EVERY TIME I HAVE TO GO TO THE DEALERSHIP I END UP WITH ATTITUDE FROM THEM AND A MIGRAINE FROM HAVING TO DEAL WITH SOME SMART [XXX] THAT IS TELLING ME THAT I CAN'T GET A NEW TIRE UNTIL THEY DETERMINE THAT I CAN OR IF IT IS A SENSOR ISSUE I'M GONNA HAVE TO PAY FOR IT!  NO SIR !!! THIS VEHICLE IS BRAND [XXX] NEW !!!  I WILL GET A LAWYER AND I WILL SEE CHEVROLET DEALERSHIP AND WHOMEVER IN COURT AND Y'ALL CAN BUY THIS CRAP CAR BACK!  EITHER FIX THIS ISSUE OR WE CAN DO THIS ANOTHER WAY    PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "2GNAXHEV6J6"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/22/2019",
        "dateOfIncident": "04/11/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11202816,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 EQUINOX ALL WHEEL DRIVE TIRES, MICHELIN PREMIER LTX M&S, SIZE, 225/60R18 100H TPC BSW. ALL 4 TIRES ARE DOWN TO 1/32\" TREAD DEPTH AT 16482 MILES. VEHICLE SERVICED 3 TIMES BY CHEVROLET DEALER FOR OIL CHANGE AND TIRES ROTATED TWICE. TIRES KEPT AT RECOMMENDED TIRE PRESSURE OF 35 PSI. TIRE RATED BY MANUFACTURER FOR 60,000 MILES. TIRES EVENLY WORN ACROSS TREAD SURFACES. CHEVROLET DECLINED WARRANTY CLAIM STATING TIRE WEAR IS A TIRE MANUFACTURER'S ISSUE. DEALER CONTACTED MICHELIN REPRESENTATIVE WHO STATES THAT THERE IS A RECALL ON THE SAME TIRE WITH EITHER A 16\" OR 17\" RIM SIZE BUT NOT 18\". DEALER RELAYED THAT MICHELIN WOULD REPLACE THE TIRES WITH SAME IDENTICAL MODEL HOWEVER I WOULD BE RESPONSIBLE FOR 25% OF TIRE RETAIL COST AS WELL AS ALL TAXES, MOUNTING AND BALANCING TOTALING OVER $300.00. THIS DOES NOT SEEM RIGHT AS I AM SURE THAT THE 18\" TIRES WILL ALSO EVENTUALLY BE INCLUDED IN THIS RECALL.",
        "vin": "3GNAXTEX7JS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/22/2019",
        "dateOfIncident": "02/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11202820,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET EQUINOX. WHILE AT A STOP LIGHT, THE BRAKE PEDAL WAS APPLIED AND THE ENGINE SHUT OFF. ADDITIONALLY,  WHEN THE BRAKE PEDAL WAS RELEASED, THE VEHICLE HESITATED TO RESTART AND THE AUTO STOP WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO KOCOUREK CHEVROLET (1500 MORNING GLORY LN, WAUSAU, WI 54401, (715) 359-7200) WHERE IT WAS DETERMINED THAT THE VEHICLE WAS WORKING AS DESIGNED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS APPROXIMATELY 15,400.",
        "vin": "3GNAXVEV2JS"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/22/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11202901,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET EQUINOX. WHILE DRIVING 70 MPH, THE SUN ROOF SHADE CLIP FRACTURED. THE CONTACT SUSTAINED INJURIES TO THE FACE, WHICH DID NOT REQUIRE MEDICAL ATTENTION. THERE WERE NO WARNING INDICATORS ILLUMINATED. ON THREE OCCASIONS, THE VEHICLE WAS TAKEN TO RANDY MARION CHEVROLET BUICK CADILLAC (220 W PLAZA DR, MOORESVILLE, NC, (866) 906-8109)  WHERE IT WAS DIAGNOSED THAT THE SHADE CLIPS NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 17,500.",
        "vin": "3GNAXMEV1JS"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/12/2019",
        "dateOfIncident": "04/12/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195880,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I TURNED ON MY CAR AND THE ENGINE LIGHT WAS ON TOOK IT TO THE DEAL THEY POKED THE GAS TANK FLAP AND RESET THE LIGHT SENSOR AND FOR NOW IT'S OFF. THE RADIO MEDIA SCREEN KEEP FREEZING ON BACK UP CAMERA.",
        "vin": "3GNAXJEV9JL"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/02/2019",
        "dateOfIncident": "01/09/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193355,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET EQUINOX. WHILE DRIVING, THE VEHICLE STALLED AND THE STABILITRAK WARNING INDICATOR ILLUMINATED. ALSO, THE CRUISE CONTROL FAILED. THE CONTACT COASTED THE VEHICLE TO THE SIDE OF THE ROAD AND POWERED OFF THE ENGINE. THE VEHICLE WAS RESTARTED AND WAS DRIVEN TO THE CONTACT'S RESIDENCE. THE CONTACT CALLED JEFF PERRY BUICK GMC (LOCATED AT 1421 37TH ST, PERU, IL 61354, (815) 410-4168) AND SCHEDULED A DIAGNOSTIC APPOINTMENT. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 13,000.",
        "vin": "3GNAXMEV7JL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/26/2019",
        "dateOfIncident": "03/22/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191574,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL LEAK NOTED ON GROUND AFTER BEING DRIVEN.  STARTED OUT BEING SMALL DROPS BUT GRADUALLY WORSENED.  DEALERSHIP STATED \"WELD AROUND OIL PAN WAS NOT PROPERLY SEALED\"",
        "vin": "3GNAXHEV8JS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/20/2019",
        "dateOfIncident": "03/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190163,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VIBRATION IN DASH THE MORE YOU PUSH ON THE ACCELERATOR THE LOUDER THE VIBRATION GETS WHILE DRIVING OR MOVING",
        "vin": "2GNAXHEV3J6"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/15/2019",
        "dateOfIncident": "03/14/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187170,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING IN PARKING LOT AND VEHICLE SHUT DOWN UNEXPECTEDLY. IT WOULD NOT RESTART. CONTACTED GM ROADSIDE ASSISTANCE TO TOW VEHICLE. AFTER ABOUT AND HOUR AND A HALF OF WAITING FOR A TOW I TRIED TO START MY VEHICLE AGAIN AND IT DID START. THE CHECK ENGINE LIGHT WAS IN. I WAS ABLE TO DRIVE THE VEHICLE TO THE DEALERSHIP. THE VEHICLE WAS AT THE DEALERSHIP OVERNIGHT. WHEN I PICKED UP THE VEHICLE I WAS TOLD THERE WAS A PROBLEM WITH THE VEHICLE COMPUTER AND THEY FIXED IT.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/09/2019",
        "dateOfIncident": "03/09/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185535,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AUTO STOP IS ANNOYING AND I FEEL DANGEROUS.  THERE IS A HESITATION AND A LURCH WHEN PULLING OUT IN TRAFFIC.  I NEVER WOULD HAVE BOUGHT THIS IF I KNEW IT.  NEVER AGAIN WILL I BUY ANYTHING LIKE THIS.",
        "vin": "3GNAXSEV4JL"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/08/2019",
        "dateOfIncident": "03/07/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185051,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY CAR THROUGH A AUTOMATIC CAR WASH AND AFTER LEAVING THE CAR WASH..MY DOORS WOULD NOT UNLOCK.  I HAD TO CRAWL OUT THROUGH THE BACK OF THE VEHICLE TO GET OUT.  THE CAR WOULD NOT UNLOCK UNTIL THE NEXT DAY.  I WENT THROUGH THE CAR WASH AT 4PM AND AT 630AM THE NEXT DAY, IT FINALLY UNLOCKED.  THIS IS THE SECOND TIME THIS HAS HAPPENED AND THIS HAS ALSO HAPPENED TO MY DAUGHTERS 2018 EQUINOX AS WELL.  THIS IS A HUGE PROBLEM.  WHAT IF HER OR I WAS IN AN ACCIDENT....",
        "vin": "3GNAXJEV3JL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/07/2019",
        "dateOfIncident": "09/04/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184935,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET EQUINOX. THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR REMAINED ILLUMINATED WHILE DRIVING. THE CONTACT WAS CONCERNED THAT THE AIR BAG MIGHT DEPLOY. THE VEHICLE WAS TAKEN TO AUTONATION CHEVROLET GILBERT (LOCATED AT 3215 S AUTO WAY, GILBERT, AZ 85297, (480) 359-2264) TO BE DIAGNOSED, BUT A FAILURE CODE COULD NOT BE RETRIEVED. THE CONTACT WAS INFORMED THAT THE VEHICLE WAS SAFE TO DRIVE. THE CONTACT STATED THAT THE FAILURE RECURRED NUMEROUS TIMES. THE VEHICLE WAS TAKEN BACK TO AUTONATION CHEVROLET ON SEVERAL OCCASIONS FOR THE AIR BAG WARNING INDICATOR FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND PROVIDED A CASE NUMBER. THE APPROXIMATE FAILURE MILEAGE WAS 3,050.",
        "vin": "3GNAXHEV8JL"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/25/2019",
        "dateOfIncident": "02/12/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182389,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TPMS SYSTEM:. WE HAVE A 2018 CHEVROLET EQUINOX. THRU   ON STAR WE GET A \"LOW PRESSURE\" TIRE WARNING EVERY FEW   WEEKS. AND THE WARNING TAKES OVER THE SPEED GAGE WHICH  HAS BEEN A PROBLEM. AIR IS ADDED WHERE INDICATED BUT  WE WILL GET ANOTHER NOTICE IN A WEEK  LATER. NOW LATELY AROUND   FEBRUARY 5TH, 2019, THE CAR WAS TAKEN TO THE DEALER. TIRES   CHECKED. THEY SAID THAT NOTHING WAS WRONG EXCEPT FOR TOO MUCH  AIR.  THEY RESET THE COMPUTER. 7 DAYS LATER AROUND FEBRUARY  12TH, 2019, WE GOT ANOTHER WARNING. AGAIN IT BLOCKS  THE SPEED MONITOR AND IT WON'T LET YOU RESET IT.  THE WEEK OF FEBRUARY 19TH, 2019, I CONTACTED THE  DEALER AGAIN. CONCERN THAT IT COULD BE A SENSOR.  THEY FINALLY  CALLED BACK TODAY-2-25-2019. PATRICK FROM SERRA   CHEVROLET TRIED TO DOWN PLAY THE SENSOR NEEDING TO BE   REPLACED. HE PUT MORE EMPHASIS ON THE WEATHER. BUT WE KEEP   EXPLAINING THAT IT HAPPENS IN SPRING TO WINTER.  SERRA CHEVROLET-SOUTHFIELD IS WHERE WE LEASED THIS VEHICLE.  CONCERN: 1. WITH THIS CONTINUING TO HAPPEN WE WILL NEVER   KNOW WHEN WE COULD GET A TIRE BLOW OUT. 2. NOT BEING ABLE  TO SEE THE SPEED MONITOR OFF AND ON IS ALSO VERY DANGEROUS.  AND IT WON'T ALLOW US TO RESET IT.  WE WANT ALL 2018 EQUINOX TO BE CHECKED. THE SENSORS IN THE 2018  EQUINOX MUST BE CHECKED AND BE REPLACED. WE NEED SOME   SUPPORT FROM THE MANUFACTURER/GM.****ALSO CHECK, DELAY IN ACCELERATION  AFTER THAT GAS PAUSE IN THE ENGINE. THANK YOU. AND BE BLESSED.   [XXX]  INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'  *PM",
        "vin": "3GNAXJEVXJL"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/22/2019",
        "dateOfIncident": "12/04/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11175474,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 CHEVROLET EQUINOX. CONSUMER WRITES IN REGARD TO FAULTY RADIO SCREEN THAT BLACKS OUT AT NIGHT AND DOES NOT COME BACK ON.  * AS  *TR",
        "vin": "3GNAXSEV1JL"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/30/2019",
        "dateOfIncident": "07/18/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173092,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES ON THE 2018 EQUINOX ARE TOO SENSITIVE, WHEN APPLIED THEY CAUSE OCCUPANTS TO LUNGE FORWARD.WE THOUGHT THEY WOULD WEAR IN BUT AFTER SEVERAL THOUSANDS OF MILES THEY ARE STILL THE SAME.WE TALKED TO DEALERSHIP, MCDANIELS AND SERVICE MANAGER ABOUT THIS BUT THEY SAID IT'S LIKE THE OTHER EQUINOX. CALLED GM CUSTOMER CARE AND CORPORATE OFFICE BUT THEY DIDN'T CARE TO FOLLOW UP.     TECHNICIAN SAID YES THEY HAVE TO BE CAREFUL DRIVING THEM WHEN SERVICING BECAUSE OF BRAKES.THERE IS NO FREEPLAY AND THEY AGGRESSIVELY ENGAGE WITH THE VERY SLIGHTEST TOUCH. IT IS NOT GOOD TO TOUCH BRAKES TO DISENGAGE THE CRUISE CONTROL BECAUSE IT JERKS THE CAR IMMEDIATELY.  IT SEEMS THERE SHOULD BE A MANUFACTURING STANDARD FOR BRAKES. THE DEALERSHIP AND GM IGNORE ANY QUESTION AND CANNOT PROVIDE TECHNICAL DETAIL OR WHETHER IF IT IS WITHIN STANDARD OR NOT.      IT SEEMS PETTY TO COMPLAIN ABOUT BRAKES WORKING \"TOO GOOD\" BUT IT REALLY IS A PROBLEM AND HURTS MY WIFES NECK WHEN BRAKING. IF YOU ONLY DRIVE THE EQUINOX YOU COULD GET USED TO IT AND ADJUST YOUR PRESSURE. THE PROBLEM IS WE HAVE A COUPLE OTHER GM VEHICLES AND IN THE OTHERS THERE IS FREEPLAY ON THE BRAKE PEDAL AND THE BRAKES DO NOT GRAB IMMEDIATELY LIKE THE EQUINOX. EVEN MY C6 CORVETTE AND A NEWER SILVERADO WHOSE BRAKES WORK WELL. THEY NEVER GRAB WITH THE SLIGHTEST TOUCH.. SWITCHING BETWEEN VEHICLES CAUSES A SAFETY PROBLEM. WHEN GOING TO THE EQUINOX FROM ANOTHER CAR IT IS EASY TO CAUSE SEVERE LUNGING. THE BIGGER PROBLEM IS GOING TO ANOTHER VEHICLE WHERE YOU THEN TO LIGHTLY TOUCH THE BRAKES AND NOTHING HAPPENS, THIS DELAY COULD CAUSE AN ACCIDENT.        IT SEEMS THERE SHOULD BE A STANDARD FOR BRAKES AND THIS COULD CAUSE AN ACCIDENT. THIS IS AN IMPORTANT ISSUE AND I DON'T SEE WHY GM IS IGNORING IT.. NHTSA SHOULD SET THIS STANDARD AND INSURE MAKERS VEHICLES COMPLY.",
        "vin": "3GNAXJEV5JS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/30/2019",
        "dateOfIncident": "08/10/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173095,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT CONSTANT SPEED AND RPM OIL PRESSURE GOES FROM 30PSI TO 70PSI. IT DOESN'T SEEM LIKE HIGH OIL PRESSURE IS AS BIG A PROBLEM AS LOW PRESSURE. MY OTHER CARS DO NOT DO THIS AS OIL PRESSURE GOES UP WITH RPM SO I ASKED MCDANIELS SERVICE TECHNICIAN AND SERVICE MANAGER IF THIS WAS NORMAL. TECHNICIAN SAID HE COULDN'T REPEAT IT BUT IT DOES IT ALL THE TIME. I ASKED IF THIS WAS NORMAL AND THEY BOTH WEREN'T SURE.         IN OCTOBER THE SERVICE MANAGER SAID HE WOULD CHECK AND GET BACK WITH ME BUT AS OF JAN 30, 2019 I HAVE NO RESPONSE. I HAVE CALLED A FEW TIMES BUT NO CALL BACK. I CALLED GM CUSTOMER CARE AND CORPORATE OFFICE. THEY SAID THEY WOULD FOLLOW UP BUT WHEN I CALLED BACK IN JANUARY THEY JUST SAID I HAVE TO TAKE IT TO THE DEALER AGAIN.        ACTUALLAY I'M NOT SURE THIS IS NORMAL OR NOT ON THE 1.5T EQUINOX. IT MAY BE NORMAL, MAYBE GM HAS A VARIABLE PRESSURE PUMP TO ADD PRESSURE FOR VARIABLE VALVE TIMING. THE PROBLEM IS THE TECHNICIANS, SERVICE MANAGER AND CUSTOMER CARE HAVE NOT BEEN ABLE TO TELL ME THIS. THEY SHOULD KNOW OR BE ABLE TO GET AN ANSWER FOR THEIR CUSTOMERS ON TECHNICAL QUESTIONS. CARS ARE MORE TECHNICAL TODAY AND THE TECHNICIANS AND CUSTOMER SUPPORT SHOULD BE MORE TECHNICAL TO ADDRESS THESE ISSUES.       REGARDLESS THEY SHOULD BE ABLE TO ANSWER CUSTOMERS QUESTIONS IN A TIMELY MANOR AND TELL CUSTOMERS IF THEY HAVE A PROBLEM OR NOT.  THREE MONTHS IS TOO LONG TO WAIT FOR ANSWER, IT SEEMS AS THOUGH ANY ISSUE IS STALLED OR DELAYED TO TRY TO WAIT UNTILL THE CUSTOMER GIVES UP OR THE WARRANTY EXPIRES. I'M GLAD THIS IS JUST A MINOR ISSSUE -I HOPE.",
        "vin": "3GNAXJEV5JS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/24/2019",
        "dateOfIncident": "01/20/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171922,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS PARKED ON A GRADE. THE VEHICLE WAS ON WITH GEAR IN PARK POSITION, WITHOUT THE PARK BRAKE ENGAGED, WHEN THE VEHICLE UNINTENTIONALLY ROLLED-AWAY. THE VEHICLE ROLLED OUT OF CONTROL HITTING ANOTHER PARKED VEHICLE AND FIXED OBJECT.",
        "vin": "2GNAXHEV5J6"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/24/2019",
        "dateOfIncident": "10/31/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171975,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "KINHOOK TIRES.  THIS VEHICLE WAS DELIVERED TO ME WITH THESE TIRES,  EVERY TIME THAT I DRIVE THE CAR AFTER IT HAS SAT OVERNIGHT  IT BUMPS FOR THE FIRST QUARTER MILE.  THS IS A PREMIERE VEHICLE SUPPOSEDLY. I HAVE COMPLAINED TO GM BUT WAS TOLD THEY MET GM  MOTRS  SPECS.",
        "vin": "2GNAXNEX9J6"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/23/2019",
        "dateOfIncident": "01/16/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171713,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Michelin North America, Inc.",
                "productMake": "MICHELIN",
                "productModel": "LTX M/S2",
                "productYear": "9999",
                "size": "225/75/16",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET EQUINOX EQUIPPED WITH MICHELIN TOTAL PERFORMANCE TIRES, SIZE 225/60/R18 (NA). THE CONTACT STATED THAT THE REAR TIRES WERE WORN AND CAUSED A BUMPY RIDE WHILE DRIVING. THE FAILURE CAUSED THE VEHICLE TO DRIVE OFF THE ROAD OCCASIONALLY. THE VEHICLE WAS TAKEN TO KLEME SALES INC. (125-129 N 2ND AVE, STRATFORD, WI 54484, (715) 407-4179) WHERE A MECHANIC TEST DROVE THE VEHICLE AND INFORMED THE CONTACT THAT THE TIRES WERE FINE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE VEHICLE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DID NOT ASSIST. THE VEHICLE FAILURE MILEAGE WAS 16,450. THE TIRE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "3GNAXTEX8JS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/21/2019",
        "dateOfIncident": "01/12/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171222,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON FREEWAY SUNROOF OF PANORAMIC ROOF SHATTERED AND GLASS FELL INTO CAR. THIS WAS NOT CAUSED BY AN ACCIDENT WITH ANY VEHICLE.  I WAS NEVER HIT BY ANY OBJECT TO CAUSE SUNROOF TO SHATTER.  WEATHER CONDITIONS WERE DRY, COOL, AND CLOUDY.",
        "vin": "2GNAXMEV6J6"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/16/2019",
        "dateOfIncident": "01/14/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170291,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ACCELERATING FROM A STOP (AS IN TURNING FROM A STOP SIGN INTO A LANE WITH ONCOMING TRAFFIC) TO MERGE INTO FLOW OF TRAFFIC THE AUTOMATIC TRANSMISSION SHIFTS UP NORMALLY BUT THEN SUDDENLY DOWNSHIFTS INTO FIRST GEAR CAUSING RAPID DECELERATION CREATING A SITUATION THAT MAY CAUSE SOMEONE TO HIT THE REAR OF MY VEHICLE.  THIS HAS HAPPENED 5 TIMES SO FAR.  AFTER THE FIRST TIME THERE WAS ALSO A CHECK ENGINE CODE AND THE DEALER REPLACED A TRANSMISSION SENSOR.  SINCE THE 1ST TIME (WITH JUST OVER 100 MILES ON THE BRAND NEW CAR) IT HAPPENED 3 MORE TIMES WITHOUT THE CHECK ENGINE LIGHT AND AFTER SHUTDOWN AND RESTARTED IT WOULD OPERATE NORMALLY.  THE 5TH TIME (2 DAYS AGO) IT HAPPENED AGAIN ALMOST CAUSING AN ACCIDENT WITH ANOTHER VEHICLE AND THE CHECK ENGINE LIGHT STAYED ON, I WENT SLOWLY STRAIGHT 2 THE DEALER (1 MILE AWAY AT THE TIME).    IT IS STILL AT THE DEALER.  THIS HAS ALL BEEN ON CITY STREETS.  WHEN THIS OCCURS I TIED THE MANUAL FUNCTION ON THE SHIFTER AND IT STILL WOULDN'T SHIFT",
        "vin": "2GNAXTEX6J6"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/15/2019",
        "dateOfIncident": "11/25/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11170139,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET EQUINOX. WHILE DRIVING 50 MPH, ANOTHER VEHICLE CRASHED INTO THE DRIVER'S DOOR OF THE CONTACT'S VEHICLE. THE AIR BAGS DID NOT DEPLOY. THE CONTACT SUSTAINED NECK PAINS AND THE PASSENGER SUSTAINED A SEVERE CONCUSSION AND A BROKEN RIGHT ELBOW. BOTH OCCUPANTS RECEIVED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC TO BE DIAGNOSED AND \"NO SYSTEM MALFUNCTION\" APPEARED. THE VEHICLE WAS CURRENTLY BEING REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND AN APPOINTMENT WAS SCHEDULED WITH AN INDEPENDENT MECHANIC. THE FAILURE MILEAGE WAS 19,000.",
        "vin": "2GNAXNEX4J6"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/06/2019",
        "dateOfIncident": "01/06/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165485,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MUFFLER LEAK AT BOTH ENDS !!!!",
        "vin": ""
    },
    {
        "components": "STEERING,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "01/04/2019",
        "dateOfIncident": "01/04/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165295,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, WHEN TRYING TO CENTER THE CAR IN THE LANE I AM DRIVING IN, THE STEERING WHEEL STICKS.  IT IS FOR JUST A SPILT SECOND BUT NONETHELESS, IT IS STICKING.   ALSO, THE CAR DETECTION LIGHT ON THE DRIVERS SIDE MIRROR (CAR IN YOUR BLIND SPOT) STAYS ON.    ALSO GET A MESSAGE THAT SAYS \"SERVICE SIDE DETECTION SYSTEM\"  DEALER SAYS NO ERROR SHOWS UP FOR THEM.",
        "vin": "2GNAXJEV2J6"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/03/2019",
        "dateOfIncident": "10/26/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164742,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE DRIVING ON I-75 AT 70MPH.  WE HEARD A LOUD NOISE AND PULLED OVER ON THE SIDE OF THE HIGHWAY.  GOT OUT AND DISCOVERED THAT THE REAR PANEL ABOVE THE BUMPER ON THE DRIVER SAD HAD TORN OFF.  WE DID NOT HIT ANYTHING AND WE BELIEVE IT JUST BLEW OFF THE CAR.  WE FILED AN ALLEGATION WITH GM AND WERE DENIED.  ON THE PHONE THE CUSTOMER SERVICE PERSON SAID THAT WE WERE DENIED DUE TO PRIOR BUMPER DAMAGE.  THERE WAS NO PRIOR DAMAGE AND GM WILL NOT PUT IT IN WRITING WHY THEY DENIED OUR CLAIM.  ALSO THEY WILL NOT GIVE US A COPY OF THEIR REPORT OR THE INDEPENDENT INVESTIGATION REPORT SAYING THAT IT IS PRIVATE.  WE WERE LUCKY THAT THE PART DID NOT HIT ANYBODY BEHIND US AS THAT COULD HAVE BEEN DISASTROUS.  NOBODY ELSE PULLED OVER BEHIND US, SO WE HAVE NO WITNESS AS TO WHAT HAPPENED.",
        "vin": "2GNAXJEV6J6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "12/24/2018",
        "dateOfIncident": "04/05/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 4,
        "odiNumber": 11163296,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING TO WORK ON,A TWO LANED HIGHWAY AND SUDDENLY I JUST HEAR AN EXPLPSION. THE SOUND OF WHAT I FOUND WAS A HEAD ON COLLISION MY CAR WENT INTO OMCOMING TRAFFIC. THE ENGINE AND TRANSMISSION WERE NOT IN THE VEHICLE AT THE SCENE OF THE ACCIDENT. I BROKE MY PELVIS AMD THE SEAT BELT CUT ME OPEN. I LOST CONSCIOUSNESS AND HAVE A SLIGHT BRAIN INJURY. I WAS TRAVELING AT 55 MPH. RIGHT BEFORE THE EXPLPSION SOUND MY CAR VEARED TO THE RIGHT AND I HEARD THE ROAD SAFETY BUMPS. I CORRECTED MYSELF AS I ALWAYS WOULD AND NEXT THING I KNOW IM IN A SEVERE HEAD ON COLLISION LUCKY TO BE ALIVE. TRANSMISSIOMS AND ENGINES DONT JUST FLY OUT DURING AN ACCIDENT EXCEPT AT VERY HIGH SPEEDS... I BELIEVE THE CAR WAS DEFECTIVE AS I DID NOT DRIVE IN FRONT OF ANOTHER VEHICLE HEAD ON.",
        "vin": "3GNAXJEV2JL"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/17/2018",
        "dateOfIncident": "11/17/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11162131,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 37 YR OLD SON WHO WAS VISITING FROM OUT OF TOWN FOR THE HOLIDAYS WAS DRIVING ON OUR LOCAL INTERSTATE WHEN HE HEARD  A LOUD NOISE IN THE FRONT END AND WHAT HE THOUGHT WAS THE DRIVERS SIDE. HE KNEW HE DID NOT HIT ANYTHING IN THE ROAD OR POTHOLE. THE NEXT THING HE KNEW HE WAS QUICKLY SLIDING TO A STOP. HE DID NOT KNOW WHAT HAPPENED. HE PULLED ONTO THE SHOULDER OF THE ROAD AND SAW THE LEFT FRONT TIRE WAS MISSING, BUT OBSERVED THAT THE FIVE LUG NUTS AND THE CENTER PART OF THE ALUMINUM ALLOY CAST RIM WERE STILL TIGHT AND INTACT ON THE HUB. TWO NEW YORK STATE POLICE RESPONDED AND RETRIEVED THE TIRE, RUBBER STILL FULLY IN TACT, NO BLOW OUT, NO DAMAGE, BUT THE ENTIRE INNER RIM HAD DISINTEGRATED WAS MISSING. THE ONLY PART OF THE RIM LEFT WAS THE CIRCLE AREA THAT THE TIRE HUGS, BASICALLY THE LIP AREA. ALL THE CENTER MASS, SPOKES WERE GONE. LUG NUTS WERE TIGHT..TROOPER SAID IN HIS 28 YRS HE NEVER SAW ANYTHING LIKE THIS AND WROTE IN HIS ACCIDENT REPORT AS CAUSE OF ACCIDENT \"FAULTY EQUIPMENT FAILURE\". THE VEHICLE STRUCK NOTHING PRIOR, DURING, OVER AFTER THIS EVENT. HAD MY WIFE BEEN DRIVING, SHE PROBABLY WOULD HAVE PANICKED OR WORSE. THIS COULD HAVE EASILY BECOME A MULTI CAR PILEUP WITH INJURIES AND OR FATALITIES. HAVING AN AUTOMOTIVE BACKGROUND AND EXPERIENCE AND UNDERSTANDING BUILDING MY FIRST CAR ENGINE AT AGE 15 YRS OLD IT IS MY BELIEF THAT THIS WAS A FAULTY RIM BASED ON IMPURITIES IN ITS CASTING PROCESS OR A POSSIBLE STRESS CRACK. HAD THIS BEEN BILLET MACHINED ALUMINUM INSTEAD OF CAST ALUMINUM/ALLOY THIS EVENT WOULD NEVER HAD HAPPENED. MY CONCERN IS PUBLIC SAFETY IN REGARDS TO THIS FAILURE, NOT KNOWING IF THIS IS AN ISOLATED INCIDENT OR ARE THERE  MILLIONS OF CARS OUT THERE THAT THIS COULD HAPPEN TO, WHICH I KNOW GM WOULD TRY TO SWEEP UNDER THE RUG AS IT WOULD COST MILLIONS OF DOLLARS FOR RECALLS TO REFIT CARS WITH NEWER SAFER RIMS. I HAVE SEVERAL PHOTOS/VIDEO. THANK YOU",
        "vin": "2GNAXJEV6J6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/03/2018",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11155560,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET EQUINOX. WHEN THE AIR CONDITIONING WAS BEING OPERATED, WHITE SHINY DEBRIS CAME OUT OF THE AIR VENTS INSIDE THE VEHICLE. THE VEHICLE WAS TAKEN TO BOMMARITO CHEVROLET SOUTH (6127 S LINDBERGH BLVD, ST. LOUIS, MO 63123, (314) 487-9800) WHERE THE CONTACT WAS INFORMED THAT THE DEBRIS COULD BE FROM THE OUTSIDE ENVIRONMENT. THE VEHICLE WAS NOT REPAIRED. THE CONTACT MENTIONED THAT THE WHITE FLAKES WERE TESTED BY A COMPANY CALLED ANALYTICS CORPORATION WHO INFORMED THE CONTACT THAT THE WHITE FLAKES WAS COMBINED WITH DIFFERENT METALS, WHICH WERE CONSIDERED HAZARDOUS. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 1,500. *DT  CONSUMER STATED THE DEALERSHIP TOOK THE 2015 EQUINOX  AND TRADED IT IN FOR 2018 EQUINOX BUT CONSUMER HAD THE SAME PROBLEM WITH THE NEW VEHICLE POSSIBLE TOXINS.*JB",
        "vin": "3GNAXHEV9JL"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/28/2018",
        "dateOfIncident": "11/27/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154629,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WILL NOT SHIFT OUT OF FIRST GEAR. GOES UP TO 5000+RPMS AND WILL ONLY GO ABOUT 25 MPH. THEN IT WILL RANDOMLY ACCELERATE WITHOUT YOU HAVING ANY CONTROL OF THE SPEED. CHECK ENGINE LIGHT CAME ON AND THE GEAR INDICATOR D FLASHED. DEALERSHIP CLEARED THE CODE AND COULD NOT REPLICATE THE ACTIONS. WE DROVE THE CAR ABOUT 30 MILES  AND IT HAPPENED AGAIN WITHOUT THE CHECK ENGINE LIGHT COMING ON. WE VIDEOED WHAT HAPPENED. DEALERSHIP COULD NOT REPLICATE AGAIN BUT STILL ARE WORKING ON IT. THEY HAVE CALLED CHEVY IN TEXAS AND THERE MAY BE AN ONGOING TRANSMISSION ISSUE WITH THIS MODEL. GM TECH ASSIST SITED SIMILAR ISSUES HAVING DEBRIS IN TRANSMISSION VALVE BODY. DEBRIS WILL CLEAR AND GET TRAPPED IN FILTER AS DESIGNED.  THIS OCCURRED DRIVING ON A COMBINATION OF HIGHWAY, CITY STREETS,AND COUNTRY ROADS. VEHICLE HAS 5100 MILES TO DATE.",
        "vin": "3GNAXSEV6JL"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/16/2018",
        "dateOfIncident": "11/16/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152060,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER THE FIRST SNOW, DRIVING WITH MY NEW EQUINOX THE SLUSH BUILT UP INSIDE THE WHEEL-WELLS AND AFFECTED THE DRIVING. MY CAR SHIMMIED WHILE DRIVING AT ANY SPEED, AND I HAVE TO STOP AND CHOP OUT THE ICE AROUND THE TIRES AND SPRING ABOVE THE TIRE, WHICH IS VERY CLOSE TO THE TIRE. IT SEEMS TO BE THE \"FABRIC\" THAT THE WHEEL-WELL IS MADE FROM. I HAVE NEVER HAD THIS HAPPEN ON ANY OTHER SUV I HAVE DRIVEN IN WINTER. NOW THAT I HAVE OWNED IT A WHILE AND TODAY IS THE FIRST REAL SNOW OF FALL, IT IS CONTINUING TO DO THIS. I CALLED THE DEALER TODAY AND THEY SAID THAT ALL DAY TODAY THEY HAVE BEEN DEALING WITH CUSTOMERS AND THIS ISSUE.",
        "vin": "3GNAXTEX1JS"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/19/2018",
        "dateOfIncident": "04/20/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141520,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER INFORMATION CLUSTER DIC GOES BLANK AND FLICKERS ON AND OFF INTERMITTENTLY WHILE THE VEHICLE IS IN OPERATION. THIS IS A OCCURRENCE THAT HAPPENS FREQUENTLY WHEN THE VEHICLE IS IN OPERATION AND AT IDLE/STOP.",
        "vin": "2GNACMEV4J6"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/13/2018",
        "dateOfIncident": "02/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11140183,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "GMCACUPDATE@GM.COM  MAY 25, 2018, 8:42 AM  TO ME    EMAIL ID# T1EM01CAC (DO NOT DELETE/ALTER THIS LINE)  ==================================================    DEAR JOEY,  THANK YOU FOR CALLING CHEVROLET WITH REGARD TO YOUR 2018 CHEVROLET EQUINOX.      FOR YOUR REFERENCE, YOUR CASE NUMBER FROM OUR CONVERSATION TODAY IS 8-4188760340.    I APPRECIATE THE OPPORTUNITY TO ASSIST YOU.    CHEVROLET CUSTOMER ASSISTANCE    CHEVROLET HAS DONE NOTHING TO FIX THIS ISSUE. I HAVE RUN OUT OF GAS BECAUSE YOU CANNOT TRUST THE FUEL GAUGE. IT WILL NORMALLY TAKE 10 GALLONS TO FILL A TANK THAT HOLDS 15 GALLONS AND IT SHOWS EMPTY.",
        "vin": "2GNAXMEV7J6"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/08/2018",
        "dateOfIncident": "08/24/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11139055,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS INVOLVED IN COLLISION OF THE REAR END AND FRONT END ....AIR BAGS SMOKED BUT DID NOT DEPLOY. VEHICLE WAS STOPPED WHEN REAR ENDED AND THEN HIT STATIONARY CAR IN FRONT WHILE TRAVELING ON CITY STREET",
        "vin": "3GNAXSEV5JL"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/01/2018",
        "dateOfIncident": "08/21/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132774,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CURRENT LOCKED-IN WALL-MOUNTED SHOULDER SAFETY STRAPS ARE VERY UNCOMFORTABLE AND POSSIBLY DANGEROUS FOR A SHORT PERSON. PREVIOUSLY WE OWNED A 2012 EQUINOX, AND BEING UNDER 5'2\" TALL, I USED THE WALL-MOUNTED SHOULDER STRAP \"SLIDER\" ADJUSTMENT TO COMFORTABLY ADJUST THE SEAT BELT HEIGHT IN BOTH THE DRIVER AND FRONT PASSENGER SEATS.  WE NOW OWN A 2018 EQUINOX, AND IT NO LONGER HAS THE \"SLIDER\" HEIGHT ADJUSTMENT (WALL-MOUNTED).  IT ONLY HAS THE LOCKED-IN SHOULDER STRAP.  THE SHOULDER STRAP RESTS AGAINST THE SIDE OF MY NECK, AND FEELS AS IF IT IS RUBBING OR CUTTING INTO MY NECK. NOW, INSTEAD OF THE SHOULDER STRAP HEIGHT BEING ADJUSTABLE, THE PASSENGER SEAT HEIGHT IS ADJUSTABLE (THE DRIVER SEAT HEIGHT PREVIOUSLY WAS ADJUSTABLE). WHILE THE ADDITIONAL VISIBILITY IS HELPFUL, THE SHOULDER STRAP STILL FEEL AS IF IT  IS RUBBING OR CUTTING INTO MY NECK. TO ALLEVIATE THE PROBLEM, WHEN I AM DRIVING (USING BOTH HANDS, AS I ALWAYS DO), THIS IS NOT POSSIBLE, SO I TRY TO WEAR A SHIRT WITH A COLLAR TO TUCK THE STRAP UNDER. THIS IS NOT MUCH BETTER.  WHEN I AM A PASSENGER, I EITHER HOLD THE SHOULDER STRAP WITH MY HAND, OR PUT MY FOREARM UNDER THE SHOULDER STRAP, BUT STILL KEEP THE STRAP OVER MY SHOULDER. WHILE I MAY RISK A BROKEN HAND OR ARM WITH THESE METHODS, IT IS PREFERABLE TO RISKING A POSSIBLE BROKEN NECK.",
        "vin": "2GNAXJEV2J6"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/24/2018",
        "dateOfIncident": "01/20/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130981,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING AT NIGHT, IF YOU PUT THE CAR IN REVERSE THEN PUT IT BACK INTO  DRIVE THE RADIO DISPLAY IS REAL BRIGHT, LIGHT IS IN DAYTIME MODE. AS LONG AS YOU DON'T PUT IT IN REVERSE THE DISPLAY IN IN NIGHT MODE. THE LIGHT IS REAL ANNOYING WHEN DRIVING AT NIGHT.THE DEALER SAID THERE IS NOTHING THEY CAN DO ABOUT IT. GM TECH SAY I WILL HAVE TO LIVE WITH IT. IT IS LIKE SOMEONE SHINING A LIGHT IN YOUR EYES. WOULD LIKE TO SEE IF SOMETHING CAN BE DONE ABOUT IT. THEY SAID ALL 2018 EQUINOX WITH 7 INCH SCREEN IS THAT WAY",
        "vin": "2GNAXJEU3J6"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/21/2018",
        "dateOfIncident": "09/21/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130696,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET EQUINOX. WHILE THE VEHICLE WAS STATIONARY, THE FUEL LINE FAILED. IN ADDITION, THE VEHICLE STALLED WITHOUT WARNING WHILE DRIVING VARIOUS SPEEDS. IMMEDIATELY AFTER, AN EXCESSIVE AMOUNT OF FUEL SPILLED ONTO THE GROUND FROM THE VEHICLE. A DEALER WAS NOT MADE AWARE OF THE FAILURE. GENERAL MOTORS ROADSIDE ASSISTANCE WAS CONTACTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 4,000.",
        "vin": "2GNAXSEV7J6"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/20/2018",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130414,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET EQUINOX. THE CONTACT STATED THAT THE VEHICLE ACCELERATED ON ITS OWN WHILE DRIVING VARIOUS SPEEDS AND WHEN THE BRAKE PEDAL WAS CONSTANTLY APPLIED. THE VEHICLE WAS TAKEN TO HOSELTON CHEVROLET (909 FAIRPORT RD, EAST ROCHESTER, NY 14445, 585-662-2800) MORE THAN TWICE FOR DIAGNOSTIC TESTING, BUT THE FAILURE COULD NOT BE DUPLICATED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND INDICATED THAT A TECHNICIAN WOULD BE SENT FOR FURTHER TESTING; HOWEVER, THE CONTACT HAD NOT RECEIVED A FOLLOW- UP RESPONSE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS NOT AVAILABLE. *TT  UPDATED 11/28/18*JB",
        "vin": "3GNAXTEX3JS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/17/2018",
        "dateOfIncident": "09/10/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129924,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AT CERTAIN TIMES THERE IS A SLIGHT SURGE.  IT OCCURS MOST OFTEN AFTER THE VEHICLE HAS BEEN IN A STOPPED MODE.  WHEN THE FOOT IS REMOVED FROM THE BRAKE, BUT BEFORE THE ACCELATOR PEDAL IS TOUCHED, THERE IS A SLIGHT SURGE WHICH IS NOT NORMAL OR SAFE.  OCCASIONALLY, IT ALSO OCCURS WHILE THE VEHICLE IS IN THE HIGHEST GEAR.",
        "vin": "3GNAXJEV4JL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/17/2018",
        "dateOfIncident": "09/14/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129936,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET EQUINOX. THE CONTACT STATED THAT THE LOW BATTERY INDICATOR ILLUMINATED, AND THE VEHICLE STALLED AND FAILED TO START. ADDITIONALLY, THE VEHICLE FAILED TO SHIFT OUT OF PARK. ROADSIDE SERVICE CHANGED THE BATTERY AND THE VEHICLE OPERATED AS DESIGNED. THE CONTACT CALLED THE LOCAL DEALER (BOB STEELE CHEVROLET, 2800 FLORIDA 520, COCOA, FL 32926, (321) 355-3489) AND WAS INFORMED THAT THEY WOULD CALL HIM BACK. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS CONTACTED AND REFERRED THE CONTACT TO THE LOCAL DEALER. THE FAILURE MILEAGE WAS 1,000.",
        "vin": "3GNAXMEV9JL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/13/2018",
        "dateOfIncident": "09/10/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129255,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SHUT OFF AND INSTANTLY STARTED AGAIN SIMULTANEOUSLY WHILE VEHICLE WAS STOPPED AT A DRIVE THROUGH AT A RESTAURANT.",
        "vin": "2GNAXKEX4J6"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/20/2018",
        "dateOfIncident": "05/21/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121035,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 EQUINOX PREMIER SUNROOF GAVE OUT ON ME 5 WEEKS AFTER PURCHASING BRAND NEW.  GM HAS HAD MY CAR FOR 3 MONTHS AND HAS NOT FOUND A FIX.  IT DOESN'T MATTER IF THE CAR WAS STATIONARY OR MOTION. THE SUNROOF AND THE PRIVACY SCREEN WILL STOP OPENING/CLOSING. THEY HAVE REPLACED ALL THE WIRES AND THE ENTIRE SUNROOF AND NEW MOTORS AND IT STILL DOESNT WORK.  GM CUSTOMER CARE IS NOT WORKING WITH ME AND SAYS THAT BASICALLY THEY WON'T HAVE A TIME WHEN I WILL GET MY CAR BACK.   THEY AREN'T HELPING ME WITH A TRADE IN EITHER. THE DEALERSHIP IS HELPING ME (BRAVO AT LAS CRUCES NM).  BUT GM THEMSELVES AREN'T TAKING ANY RESPONSIBILITY WHEN IT SOLELY IS THEIR RESPONSIBILITY.  I HAVE HEARD OF ATLEAST 8 OTHER CASES ONLINE WITH THE SAME ISSUE.  SOME WERE FIXED WITH A COMPUTER REBOOT BUT MINE CANNOT GET FIXED WHATSOEVER.",
        "vin": "3GNAXWEX8JL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/09/2018",
        "dateOfIncident": "05/31/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118779,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET EQUINOX. THE CONTACT NOTICED AN ABNORMAL ODOR WHEN THE AIR CONDITIONER WAS OPERATED. THE CONTACT WAS CONCERNED THAT IT COULD BE A CHEMICAL ODOR. THE VEHICLE WAS TAKEN TO CAVALLARO-NEUBAUER CHEVROLET (3740 NY-104, WILLIAMSON, NY 14589, (315) 791-4206) WHERE IT WAS DIAGNOSED THAT THE COOLING ELEMENT WAS BEING BURNED OFF AND THE VEHICLE WAS OPERATING AS INTENDED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT STATED THAT THE FAILURE WAS INTERMITTENT. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 2,000. *TT  CONSUMER STATED HE SPOKE WITHA SUPERVISOR AT GM SHELIA AUG 29TH, 2018 1-866-790-5600 EXT 5921743. AFTER SHE WAS SUPPOSED TO CALL ME THE WEEK BEFORE, SAID SHE HAS SO MANY THINGS TO LOOK AT, THAT'S WHY SHE TOOK SO LONG GETTING BACK TO CONSUMER. ALSO, SAID SHE WOULD TRY TO FIX THE PROBLEM FOR SURE AND GET BACK TO CONSUMER ON AUG 31ST,2018, NEVER CALLED. ALSO TALKED TO DEALERSHIP AND WAS TOLD TO RIDE IT OUT THROUGH THE WINTER, IT WILL BE DEALT WITH NEXT SUMMER. AT THIS POINT NEVER BUY A CHEVY AGAIN. STILL SMELLS BAD UPDATED 10/15/18*JB",
        "vin": "2GNAXSEV3J6"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/20/2018",
        "dateOfIncident": "07/09/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112738,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SEAT BELTS ARE DESIGNED SUCH THAT A SHORTER PERSON MUST WEAR THE BELT ACROSS THEIR NECK WHEN BUCKLED IN.  THE ADJUSTMENT TO RAISE AND LOWER THE SEATBELT FROM THE WALL OF THE VEHICLE IS NO LONGER INCLUDED IN THE VEHICLE.  I BELIEVE THIS HAS BECOME A SAFETY ISSUE FOR THE SHORTER DRIVER (INCLUDING STUDENT DRIVERS).  IF AN INCIDENT WERE TO OCCUR THAT REQUIRED THE SEATBELT, I BELIEVE ADDITIONAL INJURY COULD RESULT TO THE NECK AND POSSIBLY SEVERE THAT OTHERWISE WOULDN'T OCCUR WITH PROPERLY FIT SEATBELTS.",
        "vin": "3GNAXXEU5JL"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/16/2018",
        "dateOfIncident": "05/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111529,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET EQUINOX. WHILE DRIVING APPROXIMATELY 75 MPH, THE \"REDUCE POWER\" WARNING MESSAGE SUDDENLY DISPLAYED AS THE SPEED DECREASED TO 35 MPH. THE VEHICLE WAS TAKEN TO DAVE HALL INC. CHEVROLET BUICK (2589 S. VAN DYKE RD, MARLETTE, MI) FOR DIAGNOSTIC TESTING AND REPAIRS, BUT THE CONTACT DID NOT KNOW THE SPECIFICS OF EITHER. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 11,000.",
        "vin": "3GNAXMEV2JL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/16/2018",
        "dateOfIncident": "07/16/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111805,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "LESS THEN 10,000 MILES IN THE CAR AND THE CHECK ENGINE LIGHT HAS COME ON. THERE HAD NOT BEEN AN ISSUE WITH IT AT ALL UNTIL TODAY WHEN I STARTED MY CAR AFTER WORK.",
        "vin": "3GNAXSEV5JS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/13/2018",
        "dateOfIncident": "10/07/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111281,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT REAR DOOR WILL NOT OPEN FROM INSIDE OR OUTSIDE DUE TO DEFECTIVE LATCH. THE ORIGINAL LATCH, THE FIRST REPLACEMENT LATCH AND THE SECOND REPLACEMENT LATCH DO NOT ALLOW PASSENGER TO EXIT THE VEHICLE AS THE DOOR IS STUCK SHUT. THIS IS DANGEROUS IS SOMEONE NEEDS TO EXIT THE VEHICLE QUICKLY. LOCAL CHEVY DEALERSHIP WILL REPLACE THE SECOND LATCH THIS MONTH (JULY 2018). THE PROBLEM HAPPENS WHEN THE CAR IS STATIONARY.",
        "vin": "3GNAXJEV1JL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/12/2018",
        "dateOfIncident": "08/15/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111613,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING THE VEHICLE AT SPEEDS ABOVE  APPROX 25 MPH WITH THE REAR WINDOWS OPEN, THERE STARTS A VERY LOUD CONSTANT NOISE ALONG WITH THE ROOF PANEL VIBRATION THAT CAUSES A DISTRATING NAUSEA AND HEADACHE, AND VOICE MODULATION WHEN CONVERSING WITH PASSENGERS. YOU ARE FORCED TO RAISE THE WINDOWS TO PREVENT HEADACHE. IF ONLY ONE WINDOW IS OPEN THE NOISE IS STILL PRESENT BUT TO A LESSER AMOUNT.  DEALER SERVICE ACKNOWLEGES BUT CLAIMS NOTHING CAN BE DONE ABOUT IT.",
        "vin": "2GNAXJEV1J6"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/27/2018",
        "dateOfIncident": "06/08/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11104283,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET EQUINOX. WHILE DRIVING 35 MPH, ANOTHER VEHICLE DROVE THROUGH A TRAFFIC LIGHT AND CRASHED INTO THE SIDE OF THE CONTACT'S VEHICLE. THE CONTACT STATED THAT THE AIR BAGS FAILED TO DEPLOY. A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED INJURIES TO THE BACK, WHICH REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS TOWED AN INDEPENDENT MECHANIC TO BE REPAIRED. RED WING CHEVROLET BUICK CADILLAC (2500 US-61, RED WING, MN 55066, (651) 388-4777) WAS INFORMED OF THE FAILURE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 9,500.",
        "vin": "2GNAXJEV8J6"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/07/2018",
        "dateOfIncident": "05/30/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11100461,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL -CAR ENGINE LIGHT IS COMING ON NOW ON 3 SEPARATE OCCASIONS ONCE ON HIGHWAY ONCE IN. SIDE STREET AND THEN IN AFTER JUST STARTING CAR . HAS BEEN SERVICE NOW ALL 3 TIMES AND EMU SYSTEM WAS FULLY REPLACED . IT WILL GO INTO SAFETY MODE AND THERE IS A VERY STRONG SMELL OF GAS. THE ENGINE THEN RUNS HIGH AND CAR LOCKS UP. THE CAR IS FEELS LIKE IT IS STRESSING AT EVEN 35 MILES BEFORE THE ENGINE LIGHT APPEARS. I HAVE SERVICE PAPERWORK FROM THE FIRST TWO SERVICES AND PICTURES OF THE CAR IN SAFETY MODE. IT IS CURRENTLY IN THE SERVICE DEPARTMENT AGAIN FOR THE 3RD TIME NOW. PURCHASE THE CAR ONLY 5 MONTHS AGO . ONSTAR PICKED UP ON HIGHWAY 5.30.18 , PICKED UP FROM SERVICE THEN ON 6.2.2018, HAD CAR FOR 2 HOURS CAR WENT BACK INTO SERVICE SAME DAY 6.2.2018 BACK TO DEALERSHIP, PICKED BACKUP 6.5.2018 AND THEN BACK IN DEALERSHIP 6.6.2018 FOR ON GOING ISSUES AND STILL THERE WITH NO RESOLUTION AT THIS POINT",
        "vin": "2GNAXWEX0J6"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/21/2018",
        "dateOfIncident": "12/21/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097055,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY VEHICLE OCT 31,2017 AND WITH IN THE FIRST TWO MONTHS THE CHECK ENGINE LIGHT CAME ON AT 1,400 MILES. I TOOK MY VEHICLE INTO THE DEALERSHIP IT WAS PURCHASED FROM IMMEDIATELY AND WAS TOLD NOTHING WAS MECHANICALLY WRONG AND IT WAS OKAY TO CONTINUE DRIVING WITH THE LIGHT ON. IT EVENTUALLY WENT OUT ON ITS OWN JUST TO COME BACK ON A MONTH LATER, I AGAIN TOOK IT TO THE DEALERSHIP THIS TIME TO BE TOLD I NEEDED A NEW VACUUM BRAKE BOOSTER PIPE. AFTER THE PART WAS REPLACED THE DEALERSHIP THEN TOLD ME I NEEDED TO HAVE THE BRAKE BOOSTER PRESSURE SENSOR REPLACED. THREE DAYS AFTER THE SENSOR WAS REPLACED THE CHECK ENGINE LIGHT WAS BACK ON AT THIS POINT THE DEALERSHIP HAD NO MORE ANSWERS AND WAS REPORTING MY ISSUE TO GM AND HAVING ONE OF THEIR TECHNICIANS LOOK AT MY VEHICLE. I BROUGHT MY VEHICLE BACK IN FOR A FOURTH TIME BECAUSE THE LIGHT CONTINUES TO TURN OFF AND ON INTERMITTENTLY AND DUE TO MY KNOWLEDGE OF THE LEMON LAWS ON A BRAND NEW VEHICLE GM IS NOW INTERESTED IN PURCHASING MY VEHICLE BACK AND TO THIS DAY THE TRANSACTION HASN'T HAPPENED BECAUSE I FEEL AS THOUGH I AM BEING PENALIZED FOR THEIR ERROR. THE LIGHT STILL GOES OFF AND ON AND I'VE NOW HAD THE VEHICLE FOR SEVEN MONTHS AND THERE STILL ISN'T AN ANSWER AS TO WHY.",
        "vin": "2GNAXVEV1J6"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/17/2018",
        "dateOfIncident": "02/02/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096457,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FLEET CONSISTS OF 40 2018 EQUINOX I HAVE HAD TO PUT TIRES ONTO 26 WITH UNDER 20K MILES, HAVE HAD 7 ALIGNMENTS CHECKED AND ALL WERE OFF, BAD ON THE BACK. AS MUCH AS .38DEG TOE 1.3DEG CAMBER. ALL ISSUES SEEM TO BE IN THE REAR END.",
        "vin": "3GNAXTEX0JS"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/17/2018",
        "dateOfIncident": "04/30/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096536,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR TIRES WEARING OUT AT 15000 MILES, HAD CAR ALIGNED REAR RIGHT TOE 0.13IN  TOTAL TOE ON REAR 0.17",
        "vin": "3GNAXTE8JS5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/17/2018",
        "dateOfIncident": "04/24/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096538,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRES WEARING QUICKLY, AFTER GETTING AN ALIGNMENT BOTH REAR TIRES WERE OUT, RIGHT TOE IN OVER .015IN, AND LEFT REAR CAMBER IN 1.3IN",
        "vin": "3GNAXTEXXJS"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/14/2018",
        "dateOfIncident": "05/03/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093677,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT WINDSHIELD STARTING A CENTER LINE CRACK.",
        "vin": "2GNAXKEX6J6"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/05/2018",
        "dateOfIncident": "05/04/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092055,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 7 INCH INFOTAINMENT SCREEN DOES NOT RESPOND TO THE LIGHT DIMMER DIAL, REMAINING AT FULL, BLINDING DAYTIME BRIGHTNESS EVEN AT NIGHT. THE SCREEN CAN BE TURNED OFF BY SCROLLING THROUGH MENUS, A HAZARD WHILE DRIVING, HOWEVER IT HAS TO BE DONE BECAUSE ANY ADJUSTMENT TO THE HEATER CONTROLS, RADIO, PHONE, ON STAR OR BACK UP CAMERA TURNS THE DISPLAY BACK ON. GENERAL MOTORS KNOWS ABOUT THIS PROBLEM BUT ALL THEY HAVE DONE IS PUT A 'SERVICE NOTE' IN THE SYSTEM STATING THAT THE INFOTAINMENT DISPLAY IN CERTAIN 2018 EQUINOX MODELS MAY NOT RESPOND TO OR RESPOND VERY LITTLE TO THE INTERIOR LIGHT DIMMER OR THE AUTOMATED NIGHT SENSOR. THIS IS TOTALLY UNACCEPTABLE TO KNOW THE DISPLAYS AREN'T FUNCTIONING AS DETAILED IN THE OWNERS MANUAL AND DO NOTHING. THE VEHICLE IS DANGEROUS TO DRIVE AT NIGHT WITH A 7 INCH LED SCREEN GLARING AT FULL BRIGHTNESS IN YOUR FACE!  I SPOKE TO A SECOND DEALER AND THEY SAID GM WILL NOT ISSUE A SOFTWARE UPDATE OR TSB TO FIX THE ISSUE UNTIL 'SIGNIFICANTLY MORE CUSTOMERS COMPLAIN ENOUGH TIMES TO HAVE DEALER SERVICE CALLS TO GM INITIATED.'",
        "vin": "3GNAXSEV2JS"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/21/2018",
        "dateOfIncident": "04/21/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11089254,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM NOT ABLE TO ADJUST THE HEIGHT IN WHICH MY SEAT BELT LAYS ON MY CHEST. I AM 5'3' AND USUALLY NEED TO ADJUST THE SEAT BELT HEIGHT IN THE VEHICLE. HOWEVER, WHEN I LEASED MY VEHICLE, I NOTICED THERE WAS NO WAY TO ADJUST THIS. WHEN I AM DRIVING, I HAVE ATTEMPTED TO RAISE THE HEIGHT OF MY SEAT, HOWEVER, MY KNEES BECOME TOO CLOSE TO THE STEERING WHEEL AND I AM THEN SITTING TOO HIGH IN THE VEHICLE TO HAVE GOOD VISION OF THE ROAD.  THIS EVENING, I WAS SITTING IN THE PASSENGER SEAT WHILE MY HUSBAND WAS DRIVING, HE HAD TO PUSH THE BRAKES VERY UPRIBPTLY AS DEER WERE IN OUR PATH AS HE WAS GOING APPROXIMATELY 45 MPH ON A RURAL ROAD AND THE SEATBELT LOCKED AND CUT INTO MY NECK. THIS WAS A PAINFUL EXPERIENCE THAT I CAN ONLY DESCRIBE AS A 'RUG BURN.' THE SEATBELT LEFT A RED MARK ON MY NECK, AND HOURS LATER, IS STILL VISIBLE. WHILE THE SEATBELT STOPPED ME FROM GOING FORWARD, IT STOPPED ME USING MY NECK, WHICH WAS PAINFUL. HAD I BEEN ABLE TO ADJUST THE HEIGHT OF THE SEATBELT, IT WOULD NOT HAVE RUBBED MY BARE NECK.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/15/2018",
        "dateOfIncident": "04/13/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11085138,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS GAUGE DOES NOT READ FULL WHEN FILLING UP. PUMP KICKS OFF AND CAN'T FILL ANYMORE. THIS IS AN ONGOING PROBLEM.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/27/2018",
        "dateOfIncident": "01/08/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081533,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE FUEL GAUGE DOES NOT ACCURATELY REGISTER THE AMOUNT OF FUEL IN FUEL TANK.  WILL NOT REGISTER \"FULL\" EVEN WHEN FUEL IS FLOWING OUT OF FILLER TUBE.  WHEN GAUGE BEGINS TO REGISTER \"EMPTY\" AND DISTANCE REMAINING APPROACHES \"0\", IT TAKE LESS THAN 10 GALLONS TO FILL THE 15 GALLON TANK.  THIS CREATES THE SITUATION WHERE THE DRIVER POTENTIALLY DRIVES THE VEHICLE ON REMAINING FUEL AND THEN RUNS OUT BECAUSE DRIVER IS UNABLE TO DETERMINE ACTUAL QUANTITY OF FUEL REMAINING.  THIS HAS POTENTIAL TO CREATE A HAZARDOUS SITUATION IF IT OCCURS ON A CONGESTED FREEWAY/INTERSTATE, OR A DIRE SITUATION IF IT OCCURS IN AN UNPOPULATED AREA REMOVED FROM AVAILABLE GAS STATIONS.  IT CREATES AN UNCERTAIN SITUATION HERE IN WEST TEXAS WHERE THERE ARE LARGE STRETCHES OF HIGHWAY BETWEEN COMMUNITIES.  CHEVROLET/GM HAS BEEN AWARE OF THE PROBLEM SINCE JULY 2017 AND HAS STATED THAT THE FUEL TANK MUST BE DROPPED AND FUEL SENSOR RESEATED OR REPLACED, YET THEY ARE DOING NOTHING TO ACT UPON THAT CORRECTIVE ACTION.  I HAVE OPENED TWO CUSTOMER CASES WITH CHEVROLET IN AN ATTEMPT TO RESOLVE, AND EACH TIME THE CASES ARE CLOSED WITH COMMENT THAT \"...ENGINEERS ARE WORKING....\"",
        "vin": "2GNAXNEXXJ6"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/23/2018",
        "dateOfIncident": "03/22/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081035,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN  PARKING THE CAR IN THE PARKING LOT, I TURNED THE CAR OFF WITH MY FOOT ON THE BRAKE,  DIDN'T NOTICE I HAD NOT PUT CAR IN PARK AND WHEN I TOOK MY FOOT OFF THE BRAKE IT ROLLED BACKWARDS.  I QUICKLY PUT MY FOOT ON THE BRAKE AND  PUT  THE CAR IN PARK.  THANKFULLY I WAS IN AN AREA WHERE NO ONE WAS BEHIND ME.  I WAS SHOCKED THAT THE TRANSMISSION DISENGAGES WHEN THE ENGINE IS TURNED OFF.  I WAS TOLD  BY THE DEALER THAT THIS IS A NORMAL.  AFTER LOOKING AT RECALLS ON PREVIOUS MODELS, I SAW A RECALL FOR A SIMILAR PROBLEM ON SOME 2015-2017 CHEVROLET VEHICLES.    WHEN IT FIRST HAPPENED I THOUGHT I IMAGINED IT.  SO I TRIED IT YESTERDAY IN THE DRIVEWAY AND SURE ENOUGH IF THE CAR ISN'T IN PARK AND YOU TURN THE ENGINE OFF THE CAR WILL ROLL.",
        "vin": "2GNAXSEV7J6"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/23/2018",
        "dateOfIncident": "03/23/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081116,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY PURCHASED A VEHICLE AT FELDMAN CHEVROLET IN NEW HUDSON MI ( LOCATED AT 30400 LYON CENTER DRIVE E, NEW HUDSON< MI 48165 : 248-573-0321 )  I PURCHASED A 2018 CHEVY EQUINOX  ( VIN [XXX] ) THE WEEK OF THANKSGIVING 2017   I WAS DRIVING THE VEHICLE ON  THURSDAY 2/15/2018 WHEN MY SOLID STATE CHECK ENGINE LIGHT ILLUMINATED. I IMMEDIATE HIT THE ONSTAR AND THEY GAVE ME A CODE OF P3055 AND TOLD ME TO TAKE TO THE DEALER WITHIN 7 DAYS. . I WAS TOLD IT WAS A ' VOLTAGE COMMUNICATION ' ISSUE AND THAT I SHOULD BE ALL SET, IT WAS RESOLVED.  THE FOLLOWING  2/21/2018, WHILE OUT AT LUNCH DURING MY WORK DAY, THE SOLID STATE CHECK ENGINE LINE ILLUMINATED YET A 2ND TIME. THIS TIME THEY SAID MY VEHICLE NEEDED A NEW ' ENGINE CONTROL MODULE ' - THAT WAS REPAIRED, APPROX. 2 WEEKS LATER, MY \" SERVICE ESC BRAKE/ TRACTION CONTROL CAME ON\"  AND WOULD NOT GO OFF, THEY HAD THE VEHICLE A WEEK AND DETERMINED IT WAS A GROUND SHORT. HERE IT IS 3/23/2018 AND A 4TH TIME MY CAR IS AT THE DEALER, ESC/ TRACTION CONTROL AGAIN. 4 TIMES IN 5 WEEKS MY VEHICLE HAS NOW BEEN IN TO THE DEALERSHIP, AT 8,000 MILES .RIDICULOUS- ALL OF THIS HAPPENED WHILE DRIVING.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "3GNAXJEV8JS"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/22/2018",
        "dateOfIncident": "02/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080880,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2018 CHEVY EQUINOX WITH THE 1.5L TURBO ENGINE FAILS TO SHIFT INTO 6TH GEAR WHEN THE AMBIENT TEMPERATURE IS BELOW 14 DEGREES FAHRENHEIT. I HAVE BROUGHT THE CAR BACK TO THE DEALER SEVERAL TIMES FOR THIS PROBLEM. THE FIRST RESPONSE I GOT WAS \"THIS IS NORMAL FOR THIS VEHICLE, JUST DRIVE IT AS NORMAL\". WHERE I LIVE THE TEMPERATURE IS VERY OFTEN BELOW 14 DEGREES IN JANUARY AND FEBRUARY. DRIVING AT HWY SPEEDS, THE ENGINE IS OFTEN RUNNING 3400 RPM OR HIGHER LOCKED IN 5TH GEAR. I HAVE DRIVEN THOUSANDS OF MILES THIS WINTER IN THIS CONDITION. THIS IS NOT NORMAL TO ME, AND THE INCREASED FUEL CONSUMPTION, ENGINE NOISE AND WEAR ON THE VEHICLE ARE NOT ACCEPTABLE TO ME. IN ADDITION I WAS TOLD BY DEALER SERVICE, THAT 6TH GEAR WOULD RETURN AS SOON AS THE TEMPERATURE ROSE ABOVE 14 DEGREES. IT DID NOT RETURN UNTIL THE TEMPERATURE WAS ABOVE 32 DEGREES. ANOTHER TRIP BACK TO THE DEALER, AND THEY REPLACED THE \"CHARGED AIR COOLER\". THIS WORKED ONLY UNTIL THE TEMPERATURE DROPPED BELOW 14 DEGREES AGAIN. OBVIOUSLY THIS IS NOT A FIX. I HAD FILED AN ONLINE COMPLAINT WITH GM, AND WAS SHORTLY UPGRADED TO A \"SENIOR CUSTOMER SERVICE CONSULTANT\". THIS CONSULTANT AIDED IN THE REPLACEMENT OF THE COOLER, BUT NEVER FOLLOWED UP WITH ME. WHEN I CALLED BACK TO TELL THEM THE PROBLEM WAS NOT FIXED, I WAS TOLD MY CASE WAS CLOSED. GREAT SERVICE THERE GM. CLOSE THE COMPLAINT WITHOUT EVEN TALKING TO THE CONSUMER. MY TAKE ON THIS AFTER THE LAST 2 MONTHS OF ISSUES, IS THAT GM KNEW ABOUT THIS PROBLEM BEFORE THE VEHICLE WAS RELEASED. THE TRANSMISSION IS PROGRAMMED NOT TO SHIFT INTO TOP GEAR BELOW 14 DEGREES AS AN INEPT ATTEMPT TO PREVENT CONDENSATION FROM FREEZING IN THE \"CHARGED AIR COOLER\". EVEN THOUGH GM KNEW THIS BEFORE THEY SOLD THE VEHICLE IN NORTHERN CLIMATES, THEY DID NOT INFORM THE BUYERS OF THIS PROBLEM. THIS WILL POTENTIALLY AFFECT ALL GM VEHICLES WITH EITHER THE 1.4 OR 1.5L GAS ENGINE AND 6 SPD. TRANNNY.",
        "vin": "3GNAXVEVXJS"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/19/2018",
        "dateOfIncident": "03/15/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080102,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 EQUINOX LCD SCREEN GETS STUCK IN BRIGHT MODE. UPON INITIATION OF THE BACKUP CAMERA THE LCD STAYS BRIGHT FOR AS LONG AS THE VEHICLE IS RUNNING. NIGHTTIME DRIVING IS EXTREMELY UNCOMFORTABLE. IF THE RADIO IS RESET (HOLD DOWN HOME AND FAST FORWARD, OR TURNING OFF VEHICLE FOR THE PERIOD OF TIME IT TAKES TO COMPLETELY SHUT DOWN RADIO) IT WILL STAY IN THE PROPER DIM SETTING UNTIL THE BACKUP CAMERA IS INITIATED AGAIN. I HAVE TESTED THIS ON SEVERAL 2018 EQUINOX CARS AND FOUND THIS TO BE A MALFUNCTION. MUST VIEW PROBLEM AT NIGHT TO SEE HAZARD. I HAD A SERVICE CALL TO MARK PORTER CHEVROLET, POMEROY, OH, AND THEY ACKNOWLEDGED THE PROBLEM AND INSTRUCTED ME TO WAIT FOR A FIX FROM CHEVROLET ITSELF.",
        "vin": ""
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "03/12/2018",
        "dateOfIncident": "03/10/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11078811,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL, I WAS TURNING INTO THE LEFT TURN LANE, WHEN I APPLIED THE BRAKES THE BRAKE PEDDLE WAS LOCKED AND I COULD NOT APPLY PRESSURE TO STOP.  I CONTINUED TO APPLY PRESSURE TO THE BRAKE, BUT IT CONTINUED TO BE LOCKED.  WHEN I HIT THE CAR IN FRONT OF ME THE AIRBAGS DID NOT INFLATE.  WHEN THE CAR STOPPED THE BRAKES CONTINUED TO BE LOCKED.  WHEN THE OFFICERS ARRIVED THEY LOOKED AT THE BRAKE PEDDLE AND THEY WERE STILL LOCKED IN PLACE.",
        "vin": "2GNAXHEVXJ6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "03/08/2018",
        "dateOfIncident": "01/06/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076833,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "1)  FCA - FORWARD COLLISION AVOIDANCE DOES NOT WORK PROPERLY.  THIS ALLOWED OUR VEHICLE TO STRIKE ANOTHER VEHICLE IN THE REAR.  IT INTERMITTENTLY WILL GIVE WARNING OF BEING CLOSE TO  CARS IN FRONT OF IT.  IN THE ACCIDENT THERE WAS NO WARNING FROM THE FCA  2)  FAB - FORWARD AUTOMATIC BRAKING FAILED TO WORK - IT DID NOT ENGAGE WHEN OUR VEHICLE STRUCK A CAR IN FRONT OF IT.  OUR VEHICLE WAS TRAVELING 7MPH  WHICH IS IN THE SPECIFIED RANGE PER THE OWNERS MANUAL.  3)  LDW - LANE DEPARTURE WARNING DOES NOT FUNCTION PROPERLY.  THIS SYSTEM DOES NOT WARN WHEN OUR VEHICLE CROSSES OVER A LANE MARKER LINE NOR DOES IT GIVE A GENTLE ASSIST TO THE STEERING WHEEL.    OUR VEHICLE WAS TAKEN TO DEALER, AND DEALER RAN DIAGNOSTICS AND TOOK FOR A TEST DRIVE.  THEY CLAIM THAT IT IS WITHIN FACTORY SPECIFICATION, BUT AGREED THE SYSTEMS DID NOT APPEAR TO WORK AS DESCRIBED IN THE OWNERS MANUAL OR AS ADVERTISED.    WE TOOK A NEW 2018 EQUINOX FOR A TEST DRIVE, ANF FOUND THE FCA AND THE LDW FAILED TO PERFORM PROPERLY THE SAME AS IN OUR VEHICLE.    THIS APPEARS TO BE A SYSTEMIC FAILURE IN 2018 CHEVROLET EQUINOX VEHICLES",
        "vin": "2GNAXWEXXJ6"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/08/2018",
        "dateOfIncident": "03/08/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076835,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WAS IDLING AND IN PARK ON A NO-GRADE (FLAT),PRIVATE ROAD PREPARING FOR SCHOOL DROP OFF. A FEW MINUTES LATER IN PREPARING TO DRIVE AWAY, MY FOOT WAS ON THE BRAKE PEDAL AS I MOVED THE CAR FROM PARK INTO DRIVE. IMMEDIATELY AFTER I TOOK MY FOOT OFF OF  THE BRAKE PEDAL, THE CAR BEGAN MOVING BACKWARDS AS IF I WAS ON A SIGNIFICANT HILL. I DON'T KNOW HOW FAR THE CAR WOULD HAVE CONTINUED TO MOVE BACKWARDS BECAUSE I QUICKLY PRESSED THE BRAKE PEDAL AGAIN TO STOP IT SO I DIDN'T ROLL INTO THE CAR BEHIND ME. I CONFIRMED THAT THE CAR WAS IN DRIVE AND PROCEEDED TO QUICKLY MOVE MY FOOT FROM THE BRAKE PEDAL TO THE GAS PEDAL TO ENSURE THAT I MOVED FORWARD (AS IF I WAS STOPPED ON A HILL). I HAVE BEEN USING THE CAR FOR THIS DROP OFF FOR MONTHS WITHOUT THIS PROBLEM OCCURRING PREVIOUSLY. THE CAR IS SCHEDULED TO BE EXAMINED BY THE DEALER TOMORROW.",
        "vin": "2GNAXTEXXJ6"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/08/2018",
        "dateOfIncident": "12/24/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076879,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET EQUINOX. THE CONTACT STATED THAT THE PART FOR A SEAT BELT RECALL WAS UNAVAILABLE. THE NHTSA CAMPAIGN NUMBER WAS NOT AVAILABLE. A DEALER WAS NOT CONTACTED. AN INDEPENDENT MECHANIC SERVICED THE VEHICLE, BUT COULD NOT REPAIR THE FAILURE FOR MONTHS. THE MANUFACTURER WAS CONTACTED. THE VIN AND FAILURE MILEAGE WERE NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/03/2018",
        "dateOfIncident": "02/12/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076077,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER LOCKS IN MY VEHICLE STOPPED WORKING.  THEY NO LONGER RESPONDED TO THE KEY FOB, INTERIOR LOCK BUTTONS, OR EXTERIOR HANDLE BUTTONS AND WOULD NOT ENGAGE OR DISENGAGE WHEN SHIFTING BETWEEN PARK AND DRIVE.  THE ONLY WAY TO UNLOCK THE DOORS WAS FROM THE INTERIOR USING THE DOOR HANDLES OR MANUALLY FROM THE DRIVER DOOR.  ADDITIONALLY, THERE IS NO MANUAL WAY TO LOCK THE FRONT PASSENGER DOOR, THUS LEAVING NO WAY FOR ME TO ACTUALLY LOCK MY VEHICLE FULLY WHILE IN THIS CONDITION.  THE DEALERSHIP LOOKED AT THE CAR AND SAID SOMETHING WAS WIRED INCORRECTLY.  IT HAS SINCE BEEN FIXED, BUT I FIND IT STRANGE THAT THE LOCKS WOULD ALL OF THE SUDDEN STOP WORKING AFTER A FEW MONTHS IF IT HAD BEEN WIRED INCORRECTLY STRAIGHT FROM THE FACTORY.",
        "vin": "3GNAXSEV4JL"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/27/2018",
        "dateOfIncident": "02/21/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075223,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRONIC STABILITY CONTROL SYSTEM KEEPS SHUTTING DOWN, TAKING THE ABS SYSTEM WITH IT.  THIS SEEMS TO HAPPEN PRIMARILY WHEN IT'S COLD OUTSIDE.  WHEN THIS HAPPENS THE VEHICLE DOESN'T HANDLE OR STOP AS IT SHOULD.  MULTIPLE REPAIR ATTEMPTS HAVE YIELDED NO CHANGE IN THE CONDITION.",
        "vin": "2GNAXTEX0J6"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/19/2018",
        "dateOfIncident": "01/29/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073587,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY CAR TO BE DINGHY TOWED. THAT MEANS THE CAR IS PULLED BEHIND A MOTORHOME WITH ALL 4 WHEELS ON THE GROUND.MY FIRST PROBLEM WAS THE BATTERY WAS DYING WHEN IT WAS BEING TOWED. MY NEXT PROBLEM WAS THAT THE BRAKES LOCKED UP WHEN IT WAS BEING TOWED CAUSING THE REAR TIRES TO BE GROUND DOWN PAST THE TREAD INTO THE BELT SECTION OF THE TIRES.IF ANOTHER MOTORIST HADN'T WARNED ME I WOULD HAVE HAD 2 BLOWOUTS IN THE NEXT MINUTE OR 2.WHEN I PULLED OVER I HAD A ABS WARNING ON MY CONTROL PANEL. I REPLACED THE REAR TIRES. I HAVE THE COMPUTER DIAGNOSTIC THAT SHOWS SEVERAL FAILURES INCLUDING ELECTRONIC BRAKE CONTROL MODULE,CONTROL MODULE POWER PLUS LOW VOLTAGES.THIS IS VERY UNSAFE AND I WOULD LIKE TO KNOW IF THIS CAR IS SAFE TO DINGHY TOW.",
        "vin": "2GNAXJEV2J6"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/16/2018",
        "dateOfIncident": "02/16/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073327,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "INVOLVED IN A REAR END COLLISION. MY VEHICLE REAR ENDED ANOTHER VEHICLE AND CAUSED FRONT END DAMAGE TO MINE. RECEIVED EMAIL FROM INSTEAD INDICATING A CRITICAL PROBLEM WITH THE AIR BAGS AND THEIR DEPLOYMENT. THE AIR BAGS NEVER WENT OFF UPON IMPACT BUT SMOKE CAME FROM THE SIDE AIRBAGS.",
        "vin": "2GNAXJEV4J6"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/15/2018",
        "dateOfIncident": "01/03/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073166,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2018 CHEVROLET EQUINOX HAS NOT BEEN SHIFTING INTO HIGH GEAR (6TH) FOR SEVERAL WEEKS NOW. I BROUGHT IT INTO A CHEVY DEALER NEAR ME, AND THEY INFORMED ME THAT THIS IS A NORMAL CONDITION FOR THIS VEHICLE, WHEN THE AMBIENT TEMPERATURE IS BELOW 14 DEGREES.. THE SERVICE MANAGER CITED A GM TSB #18-NA-035. THIS TSB INSTRUCTS THE DEALER TO INFORM THE OWNER THAT THE VEHICLE IS OPERATING NORMALLY, AND INSTRUCTS THE DEALER NOT TO ATTEMPT ANY REPAIRS.   THIS IS DEFINITELY NOT NORMAL VEHICLE OPERATION TO ME. AT HIGHWAYS SPEEDS THE ENGINE RPM IS RUNNING HIGH AND NOISIER THAN NORMAL. THE GAS MILEAGE HAS ALSO DROPPED BY 10% TO 15%. I WAS NOT INFORMED BY GM OR THE DEALER WHEN I BOUGHT THE VEHICLE THAT HIGH GEAR WOULD BE DISABLED IN NORMAL MINNESOTA WINTER TEMPERATURES. I BELIEVE GM MISLED BUYERS OF THIS VEHICLE BY NOT INFORMING THEM OF THIS VEHICLE DEFECT, WHICH THEY HAD TO KNOW ABOUT, BECAUSE THE VEHICLE WAS PROGRAMED TO DO THIS. ALSO ONCE THE TEMPERATURE DID GET ABOVE 14 DEGREES, THE VEHICLE STILL DID NOT SHIFT INTO 6TH GEAR. SEVERAL DAYS LATER WHEN THE TEMPERATURE WAS 36 DEGREES, THE TRANSMISSION FINALLY STARTED TO SHIFT NORMALLY. IF CHEVROLET DOES NOT HAVE A SUITABLE FIX FOR THIS I WILL REPORT THIS AS A \"LEMON LAW\" DEFECT IN MY VEHICLE.",
        "vin": "3GNAXVEVXJS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/17/2018",
        "dateOfIncident": "01/12/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063276,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE MY 2018 AWD EQUINOX 3 WEEKS AND 800 MILES. SERVICE BRAKE ASSIST DISPLAYS ON THE INFO-CENTER. BRAKES ARE CONSTANTLY GRINDING AND INCONSISTENT. SOMETIMES THE BRAKES ENGAGE HARD WITH NORMAL PRESSURE ON THE BRAKE PEDAL CAUSING THE CAR TO COME TO A SERIOUS AND UNEXPECTED ABRUPT STOP. THIS CAN CAUSE A REAR END COLLISION. OTHER TIMES IT FEELS LIKE THE CAR IS NOT GOING TO STOP AND IMMEDIATE AND ADDITIONAL PRESSURE MUST BE APPLIED. THERE IS NO DOUBT THAT THIS DEFECT WILL CAUSE ACCIDENTS. THE CAR WAS PRESENTED FOR SERVICE AT THE DEALERSHIP OF PURCHASE AND THEY WERE UNABLE TO DETERMINE WHY THE BRAKE ASSIST WAS MALFUNCTIONING. THEY ALSO CLAIMED THERE ARE NO SERVICE BULLETINS RELATED TO THIS ISSUE.",
        "vin": "2GNAXSEV7J6"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/06/2018",
        "dateOfIncident": "12/15/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11060943,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING TO WORK AND MY PANORAMIC SUNROOF EXPLODED. NOTHING HIT IT, NO ONE IN FRONT ON ME, NO ONE PASSED. ME AND NO ONE WAS BEHIND ME. IT SOUNDED LIKE A GUN SHOT AND THEN THE SUNROOF COMPLETELY SHATTERED. THE CAR DEALER THAT I BOUGHT IT FROM DID TAKE CARE OF ALL THE EXPENSES!  BUT AFTER ALL, IT WAS NOT MY FAULT AND I HAVE ONLY HAD THE CAR FOR 6 MONTHS. THIS IS VERY SCARY AND THANKFULLY I DID NOT GET CUT. I HAVE A NEW SUNROOF BUT I AM VERY AFRAID THAT IT IS GOING TO HAPPEN AGAIN",
        "vin": "2GNAXSEV4J6"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/30/2017",
        "dateOfIncident": "12/29/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057692,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2018 EQUINOX WITH 4800 MILES ON IT AND THE TRANSMISSION WENT OUT ON THE VEHICLE.   I WAS DRIVING THE VEHICLE THE ENGINE SERVICE LIGHT CAME ON THE ENGINE S RPM EXCELERATED AND THEN THE VEHICLE STOPPED EXCELERATING AND STARTED COASTING. I COASTED INTO A BUSINESS AND TRIED TO GO FORWARD AND BACKWARD AND THE VEHICLE WOULD NOT MOVE. THE VEHICLE WAS TOWED TO THE NEARBY  CHEV DEALER WHO CONDUCTED SOME TESTS AND IT WAS DETERMINED THE TRANSMISSION WAS OUT AND I WOULD TAKE ABOUT 10 DAYS TP GET ANOTHER ONE. WE WERE DRIVING FROM ILLINOIS TO FLORIDA  AND THE VEHICLE BROKE DOWN IN TENNESSEE.",
        "vin": "2GNAXJEV2J6"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/23/2017",
        "dateOfIncident": "11/17/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11056171,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER FILLING FUEL GAUGE READS 3/4 FULL. CAN NEVER BE SURE HOW MUCH GAS IS IN THE CAR. THE DEALER SAYS THIS PROBLEM AFFECTS ALL 2018 CHEVROLET EQUINOX'S AND GM TERRAINS AND THERE IS NO FIX.",
        "vin": "2GNAXJEV7J6"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/15/2017",
        "dateOfIncident": "08/23/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054895,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET EQUINOX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V516000 (POWER TRAIN). THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT RECEIVED THE RECALL NOTICE OVER FOUR MONTHS AGO. THE DEALER (REX CHEVROLET GMC, 805 S DES MOINES ST, ODEBOLT, IA 51458 (712) 668-2296) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE. THE MANUFACTURER WAS CONTACTED SEVERAL TIMES AND WAS UNABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2GNAXNEX0J6"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/09/2017",
        "dateOfIncident": "12/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11053645,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE INFOTAINMENT SYSTEM SCREEN IS EXTREMELY BRIGHT. ESPECIALLY IN CELL PHONE SCREEN PROJECTION MODE. NIGHT TIME DRIVING IS HINDERED. DIMMING IS AVAILABLE FROM THE INTERIOR LIGHTING DIMMING SWITCH. THIS SIMS DASH LIGHTING ALSO WHICH MAKES IT HARD TO SEE THE DASH. INFOTAINMENT SYSTEM IS STILL TOO BRIGHT WHEN DIMMED AT THE LOWEST SETTING.",
        "vin": ""
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/15/2017",
        "dateOfIncident": "10/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11046413,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE MIRROR CAMERA FLICKERS AND GOES BLACK.  TOOK IT TO DEALER ON OCTOBER 14, 2017 AND WAS INFORMED THAT A NEW MIRROR NEEDED TO BE ORDERED.  AS OF THIS WRITING, NOVEMBER 15, 2017 THE PART IS ON BACK ORDER AND THERE IS NO ESTIMATED TIME OF DELIVERY.  TO ME THIS IS A SERIOUS PROBLEM WHEN PARTS FOR A NEW CAR ARE NOT AVAILABLE AND A SAFETY PROBLEM SINCE THE CAMERA IS NOT FUNCTIONING.",
        "vin": "2GNAXVEV0J6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/06/2017",
        "dateOfIncident": "10/05/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11032088,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ABLE TO WALK IN FRONT OF MY EQUINOX, IN DRIVE, (UNKOWN TO ME) THINKING THAT THE CAR WAS IN PARK..  START BUTTON IS INVISIBLE WHEN STEERING WHEEL IS ALIGNED PROPERLY AND TO SMALL TO SEE, AND THE LIGHTS ON IT ARE TOO SMAIL.  EXTERIOR TURN SIGNAL NOT VISIBLE IN DAYLIGHT.  NO SUNSCREEN BANNER ACROSS FRONT WINDSHIELD",
        "vin": "2GNAXJEVXJ6"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "09/29/2017",
        "dateOfIncident": "08/24/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11030469,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET EQUINOX. WHILE THE VEHICLE WAS PARKED, IT INDEPENDENTLY ROLLED AWAY AND REAR ENDED ANOTHER VEHICLE. A POLICE REPORT WAS FILED AND THERE WERE NO INJURIES. C&O MOTORS (516 MACCORKLE AVE, ST ALBANS, WV) WAS CONTACTED AND STATED THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 17V516000(POWER TRAIN) AND ADVISED THE CONTACT TO USE THE EMERGENCY BRAKE WHEN PARKING THE VEHICLE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 700.... .UPDATED 11/16/17 *BF  CONSUMER STATED CORRECTION: MANUFACTURE HAS BEEN NOTIFIED OF THE FAILURE. CORRECTION: CONSUMERS HUSBAND OR HERSELF WAS NEVER TOLD TO SET THE EMERGENCY BRAKE. UPDATED 7/23/18*JB",
        "vin": "3GNAXREV9JS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/27/2017",
        "dateOfIncident": "08/08/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11019976,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE WAS SOLD AS HAVING A TOW PKG WITH THE CAPABILITY OF PULLING A 3500 LB TRAILER.  THERE IS NO BRAKE HARNESS AVAILABLE ON THIS CAR (A SEPARATE CAB BRAKE CONTROL IS A LEGAL REQUIREMENT IN EVERY STATE BASED ON TOW LOADS, MICHIGAN IS 3000 LBS.)  DEALERSHIP ACKNOWLEDGES THEY CAN'T LOCATE IT, WE HAVE A COMPLAINT FILED WITH GM  8-3144268897  I FEEL THIS IS DEFINITELY A SAFETY ISSUE WHICH COULD CAUSE A CRASH OR INJURY OR DEATH.  WE HAVE HAD MANY TRAILERS AND RECOGNIZE THAT THIS CAB BRAKE CONTROLLER IS A NECESSITY IN PULLING A TRAILER.  PEOPLE WHO HAVE NEVER PULLED A TRAILER BEFORE MIGHT NOT KNOW THIS'.ESPECIALLY IF THEY LISTEN TO THEIR SALESPERSON WHO TRIES TO TELL THEM THAT THEY DON'T NEED CAB BRAKES. (LIKE OUR SALESMAN TRIED TO TELL US)   OBVIOUSLY THIS ISSUE ISN'T LIMITED TO OUR VEHICLE....EVERYONE WHO BUYS THIS VEHICLE WITH THE INTENT OF PULLING A TRAILER OVER 1000 LBS (SOME STATE REQUIRE CAB BRAKES ON THIS WEIGHT) WILL ENCOUNTER THIS PROBLEM.    UPDATED 10/05/2017*JS",
        "vin": "2GNAXKEX7J6"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/29/2017",
        "dateOfIncident": "06/05/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002082,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING WITH TWO CHILDREN IN THE CAR PLUS MYSELF THE DRIVER ON THE FREEWAY STRAIGHT. THE VEHICLE STARTED PULLING TOWARDS THE RIGHT AND ALMOST CAUSING A COLLISION. THEN THE WARNING SCREEN STARTED BRINGING UP WARNINGS OF MULTIPLE ISSUES. THE VEHICLE WAS TAKEN IN IMMEDIATELY AND SO THEY TRIED TO DIAGNOSE THE ISSUES AND PUT 200+ MILES ON THE VEHICLE AND THE THE WARNINGS DID NOT COME BACK ON SO A FEW DAYS LATER THEY SAID THE VEHICLE IS FINE AND TO BE PICKED UP. WHILE DRIVING A WEEK LATER WITH THE KIDS IN THE VEHICLE THE CAR STARTED PULLING AND THE WARNINGS LIGHTS AND SCREEN WARNINGS SHOWED UP AGAIN AND WAS IMMEDIATELY TAKEN BACK IN AND THEY HAVE HAD THE VEHICLE SINCE. THEY ESCALATED THE ISSUES TO GM, THE PARTS ARE DEFECTIVE IS WHAT WAS TOLD AND THEY COULDN'T GIVE A ETA ON HOW SOON THEY COULD GET THE PARTS. THEY SAID THEY WOULD NEED TO GET THE PARTS DIRECTLY FROM THE ASSEMBLE LINE AND IT WAS OUT OF THEIR CONTROL. THE TECH FOUND THAT THE \"ELECTRICAL STEERING GEAR AND ELECTRICAL MODULE\" PRONGS WERE BENT AND BEING A BRAND NEW OF THE LINE VEHICLE THEY FOUND THE PRONGS WERE BENT AND THE ELECTRICAL STEERING GEAR AND ELECTRICAL MODULE WAS DEFECTIVE. GM WANTED THE PART BACK AND SINCE HAVE BEEN IN A RENTAL. WHEN IT WAS BROUGHT TO THEIR ATTENTION THIS IS A SAFETY ISSUES AND IT WAS A HAZARD THE SERVICE DEPT. REPRESENTATIVE WAS DEFENSIVE AND UNPROFESSIONAL AS WELL AS DEFENSIVE WHEN STATED THIS IS AN ISSUE OF SAFETY AND HAZARDOUS. ONCE THE CONCERN WAS BROUGHT UP THAT IT WAS UNCOMFORTABLE AND WE WANTED ANSWERS OF WHAT'S GOING TO HAPPEN AND WHAT ABOUT THE SAFETY OF THE KIDS WHILE DRIVING BEING UNCOMFORTABLE EVEN IF FIXED, HE HUNG UP. MY SPOUSE WENT IN TO TALK WITH THE MANGER AND THEY COULDN'T GIVE ANY INFO BUT TO CALL GM AND TAKE IT UP WITH THEM AND THAT THEY COULDN'T DO ANYTHING BUT ESCALATE THE ISSUE TO GM MANUFACTURER AND GAVE THE NUMBER TO MY SPOUSE AND CLOSED THE DOOR ON HIM.",
        "vin": "2GNAXMEV2J6"
    }
]