[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/14/2022",
        "dateOfIncident": "01/17/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456548,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "This Cruze is equipped with a manual 6 speed transmission.  The initial incident involved complete loss of the clutch with the clutch pedal sticking to the floor. This and the driver could not get the vehicle into gear.  The driver then reached down and pulled the clutch up from the flor and was able to resume some clutch function.  No Malfunction indicator or engine light was visible.  Dealer serviced the vehicle indicating a P08A8 code set after incident. Vehicle repair order/invoice 382676 Ewald Chevrolet Buick. 36833 E Wisconsin Avenue, Oconomowoc, WI 53066 262-567-5555.  When I picked the vehicle up, I couldn't leave with it because when I depressed the clutch pedal the clutch engaged/disengaged all the way depressed or at the floor.  The dealer replaced Part #55505687 PIPE, and 19353126 Fluid.   After driving the vehicle a few miles I called the dealer and asked them to open a case with Chevrolet because the clutch system did not feel the same.  Inconsistent engage/disengage point of the clutch.  While awaiting their return call I experienced a complete loss of clutch function again, similar to the original case pedal stuck to floor, and manually had to lift clutch pedal to regain some clutch function.  This happened while driving/shifting in traffic, after pulling up the clutch the engine light lit.  Returned it to dealer",
        "vin": "1G1BG5SE5J7"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/02/2022",
        "dateOfIncident": "01/03/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454890,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I got my vehicle through a local dealership in town, in July of 2020 and only a couple months later my problems started. The vehicle started to vibrate violently and almost jerk back and forth on its own whenever I would drive it. And whenever I did come to a complete stop and accelerate the vehicle would hesitate a bit, it felt like I would have to really force it in order to keep driving. That same feeling would occur whenever I would have to drive on the highway it felt like I was pushing really hard on the gas in order to move. Which lead to my stability track message to appear on the dash as well as the check engine light. Then finally one day while I was driving and making a right turn to exit a shopping center my vehicle just stopped out of nowhere. I was unable to drive I tried putting it in neutral and reversing but nothing worked. I couldn't even take my keys out the ignition or turn off the vehicle I was completely stuck casing traffic on a busy street until what felt like five minutes later, I was able to turn it on and off and drive home.    I then took my vehicle to the local Chevy dealership where they kept my car for a week even though no work was done to it. They wanted me to let them take apart my engine to determine what the problem was, and I was advised by multiple sources including my vehicle warranty to not let them do a tear down. The service consultant said they couldn't find a reason why my vehicle just stopped on me and blew it off as nothing.   I then took it to a local mechanic in town where they replaced my air filter, spark plugs, and did a mass air flow clean. However only days later my check engine light appeared again along with the message to service the stability track. The jerking, vibrating feeling is still present when I drive also now whenever I turn on my vehicle.",
        "vin": "1G1BE5SM8J7"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/30/2022",
        "dateOfIncident": "01/30/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449460,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I made a prior complaint with tracking number 11360154. This same problem has occurred again, approximately 22,000 miles after the car was repaired the first time. The clutch is broken again and it broke at highway speed almost causing me to have a severe accident.  THE CONSUMER STATED A LEAK OF THE HYDRAULIC FLUID CONTAMINATED  THE CLUTCH. THE FRICTION DISC AND PRESSURE PLATE NEEDED TO BE REPLACED.",
        "vin": "1g1bg5se6j7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/21/2022",
        "dateOfIncident": "12/18/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448403,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Engine performance dropped noticeably, tire pressure system alert lighted, and stability track turned off. Then within a short period of time, some 30 minutes, the engine warning light activity (steady). All of this happened shortly after the 3-year warranty expired although I was having some engine roughness a few days before three years. Made an appointment at the Chevy dealership and the issue was diagnosed to a misfire on cylinder #1. Apparently, the insulator around the center electrode of the spark plug separated and slipped down. After a bit of research and asking the dealer for Chevy TSB #PIP5657D, NHTSA TSB #10201263, I was startled to find this is a somewhat frequent-enough problem affecting a number of GM models using 1.4L engine as used in my Cruze. I had a forthright conversation with Chevy dealer that this was a warranty issue as my OnStar alerted me to an emissions system malfunction. I also called GM and ACDelco, the spark plug manufacturer, and they claimed nothing or no issues. This is a safety concern to me. Paid almost $400 to have four spark plugs replaced at 3-years and only 7,000 miles; ACDelco warrants the spark plugs for 7-years or 100,000 miles!. Unacceptable.",
        "vin": "3G1BE6SM8JS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/08/2021",
        "dateOfIncident": "12/08/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443027,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The radio stays on full bright after dimming the lights. Then when I stop at a red light and the car shuts off when I release the break my car jumps makes engine makes a it rev up like the switching of the gears or something. And when I am driving the speed limt and press the gas to speed up to pass a car the car does not go faster the RPM' only go up like I am going to blow the motor u.i do not know anything about the",
        "vin": "1G1BE5SM0J7"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/27/2021",
        "dateOfIncident": "11/26/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441792,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "ALL SEASON",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "The tires installed August 2020 were 205/55R16 from GoodYear. They were the All Season Assurance Tires. They had travelled about 10,000 miles since install. On November 26, on I 95 SB near mile marker 3 (near GA state line), tread flew past wife’s window and the TPMS system indicated pressure in the right front tire at 1. This sudden issue could have caused a crash or injury. The vehicle is currently at the shop that installed the tires and is being investigated.",
        "vin": "1G1BE5SM7J7"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": true,
        "dateComplaintFiled": "11/16/2021",
        "dateOfIncident": "11/12/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11440672,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owned a 2018 Chevrolet Cruze. The contact stated while driving approximately 68 mph when the contact crashed into a deer, the brake pedal was depressed however the vehicle continued to move forward. The contact stated that he had placed the vehicle in park but the vehicle continued to drive, the contact had to continuedly press the ignition button for the vehicle to turn off. The contact stated no warning lights were illuminated. The contact mentioned that the cruise control was activated at the time of the failure. The contact sustained scrapes on the arms but did not seek medical attention.  A police report was taken and the vehicle was towed to a local tow yard where it was diagnosed as destroyed. The manufacturer was not informed of the failure. The failure mileage was approximately 119,000. The VIN was not available.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/18/2021",
        "dateOfIncident": "10/17/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437251,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Side Pillars  are too thick it is hard to see oncoming traffic and almost caused an accident in so  many times.",
        "vin": "1g1be5smxj7"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/30/2021",
        "dateOfIncident": "09/24/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434962,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I was pulling out of a parking lot and all of a sudden my steering wheel locked up. I was able to move it but it took a lot of force to turn it. I was 1/2 a mile from my house so I attempted to make it. I almost ran off the road trying to turn left at a red light and when I turned on my street. I almost drove into my gutter at the end of my driveway too. The next day it worked again. I do not know if it was a one time glitch or something more serious.",
        "vin": "1G1BC5SM6J7"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/12/2021",
        "dateOfIncident": "08/02/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428901,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "My vehicle is available for inspection. As of now and luckily no one has been at risk including myself with my vehicle, I fear this will not be the case anytime soon.   I saw there was a recall for my year make and model of car that is not associated with my specific VIN number. I am aware that my car could be connected to the other vehicles and their VIN numbers that are associated with this recall. This could lead to a much better issue if and when we discover that there are other VIN numbers with the same year, make and model as mine.   I am getting my car checked tomorrow to get this confirmation.  There were no warning lamps that showed, but my car is now making consistent rattling, whooshing, and clacking noises associated with the engine. It is becoming so loud that my fear of it exploding has now become so high.",
        "vin": "1g1be5sm1j7"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/17/2021",
        "dateOfIncident": "02/15/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425248,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Noticed all 4 wheels are starting to rust on my 2018 Chevy Cruze. Owned many, many cars and have never had wheels rust. If this continues, over the years worried wheels will crack and accident will happen. I took car to Leader Automotive Service and they were aware of problem. Said they could coat each wheel for approximately $180.00.  Why is this my problem when the manufacturer of the wheel should replace defective wheels. Thank you for listening.",
        "vin": "1G1BC5SM4J7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/11/2021",
        "dateOfIncident": "06/11/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420611,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Auto Start-Stop failed. I was in heavy traffic in 90 degree heat with the air on max. Stopped at a light so engine turned off. When light turned green I pressed on the gas and my 2018 Chevy Cruz did not start!!  I could have gotten rear ended because I was holding up traffic on Telegraph Road in Taylor MI. I tried starting it and was flustered and scared. The dash said \"SHIFT TO PARK\". So I did and then it started. But that should not have happened. A different day on a freeway in heavy traffic there was a long delay one time before it started. That was scary also. But at least it started. Today, June 11, 2021, it did not start. Something has to be wrong. A car should not do that. Very dangerous situation. I wish I could turn off the auto stop where it stops the engine every time you come to a complete stop. I don't like it at all. Now the dealer has to keep it 4 days.  It is under warranty still. It only has 34,000 miles on it.",
        "vin": "1G1BE5SM7J7"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/28/2021",
        "dateOfIncident": "05/06/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418911,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving the car and the clutch was not engaging, went to the dealer and was advised to change the cylinder kit (GM part 24295457) and the pressure plate (GM part 55574768) and get charge almost 5k for the repair. The car has 50500 miles and has almost 3 years, the warranty is 5 years or 60000 miles, which I was in it. After I paid for the check up the dealer told me that is not part of the warranty. I did my research with my mechanic and said the cylinder kit was a manufacturer defect, and also was a recall on Europe with this type of car due to the type of the transmission (stick shift). Contact to GM headquarters and make a complaint, the answers from them as they contact the dealer and due to the car has an accident that was not reported they can not do anything with the repair. The accident was 2 years ago and the damage is only the body and does not involve the engine, powertrain, or even the frame of the car. In the resolution, they blame the accident for do not take a look or responsibility of their product.",
        "vin": "1G1BB5SM4J7"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/03/2021",
        "dateOfIncident": "04/02/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406192,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CLUTCH KEEPS STICKING TO THE FLOOR AND NOT DISENGAGING. PREVENTS THE CAR FROM GOING INTO A GEAR OR DISENGAGING A GEAR. THIS HAPPENED ON AN OFF RAMP FROM THE HIGHWAY61 ONTO HWY 47",
        "vin": "1G1BB5SMXJ7"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/14/2020",
        "dateOfIncident": "12/12/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383270,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I GO TO BRAKE AT A LIGHT, AND I RELEASE MY FOOT OF THE BREAK . AND MY CAR STALLED. I PUT INTO PARK. THAN PUT IT BACK IN DRIVE AND I TRIED TO ACCELERATE AND MY CAR DIDNT BUDGE... I HAD TO TURB MY CAR ON AND OFF FOR IT TO WORK AGAIN... THIS HAS BEEN HAPPENING",
        "vin": "1G1BE5SM7J7"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/14/2020",
        "dateOfIncident": "11/13/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374640,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MANUAL TRANSMISSION CAR.  CLUTCH PEDAL BEGAN ACTUATING MUCH POWER IN TRAVEL, EVENTUALLY THE PEDAL STICKS TO THE FLOOR. THIS PREVENTS THE SHIFTER FROM BEING TAKING INTO OR OUT OF GEAR IN NORMAL FASHION.  CAN EITHER LEAVE THE CAR STRANDED IN TRAFFIC OR HINDER EFFORTS TO STOP IN AN EMERGENT SITUATION.",
        "vin": "3G1BG6SE4JS"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/07/2020",
        "dateOfIncident": "10/24/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373539,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SON BOUGHT HIS CAR NOT EVEN HAPPEN IN A MONTH HE HIT A DEER HE SAID IT FELT WEIRD LIKE THE BRAKING SYSTEM WENT WEIRD NOT EVEN THINKING IT WENT TO AN AUTO BODY SHOP AND MY FATHER TOLD ME TO LOOK UP RECALLS AND IT WILL NOT LET ME LOOK IT UP IT'S IN THE VIN ISN'T RECOGNIZED BY GMC SO I'M CURIOUS ON WHAT'S GOING ON WITH HIS CAR IF THERE WAS ANY RECALLS OR IF IT WAS MECHANICAL ISSUE I'D LIKE PAUL TO THE SIDE BRAKES FOR A WEIRD IT WAS IN WAYNE COUNTY OHIO ON ROUTE 585 AT THE END OF OCTOBER 2020",
        "vin": "1G1BC55M4J7"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/27/2020",
        "dateOfIncident": "10/21/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366764,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE UNEXPECTEDLY STALLED WHEN BRAKING FOR NEIGHBORHOOD STOP SIGN. LOST POWER STEERING AND ENGINE POWER BUT DID NOT LOSE POWER TO GAUGES OR ACCESSORIES. NO CHECK ENGINE LIGHT OR OTHER WARNING LIGHTS OR MESSAGES ON DASH. PUT CAR IN PARK AND RESTARTED ENGINE. NORMAL START. TURNED ONTO MAJOR CITY STREET AND DROVE HALF MILE. STARTED BRAKING FOR TRAFFIC LIGHT BUT DIDN'T COME TO FULL STOP BECAUSE LIGHT TURNED GREEN. ENGINE STALLED AGAIN. SAME EXACT THING AND AGAIN NO WARNING LIGHTS ON DASH. FELT LIKE A SITTING DUCK AND VERY SCARED OF GETTING REAR-ENDED. LUCKILY NO ONE WAS BEHIND ME. TURNED ON EMERGENCY FLASHERS, PUT IN PARK, AND RESTARTED ENGINE. AGAIN STARTED NORMALLY. REMAINED IN RIGHT LANE AND WAS VERY FORTUNATE THAT I WORKED JUST DOWN THE STREET AND DIDN'T HAVE TO MAKE ANY ADDITIONAL STOPS ALONG THE WAY. PARKED CAR AND REFUSED TO DRIVE IT HOME THAT NIGHT BECAUSE I FELT THE VEHICLE WAS UNSAFE TO DRIVE. HAD CAR TOWED TO DEALERSHIP THE NEXT MORNING. WHEN I TRIED TO START VEHICLE TO MOVE IT INTO A TOWING POSITION, THE ENGINE TRIED TO START BUT STALLED WITHIN A FEW SECONDS. OCCURRED 4 TIMES IN A ROW. STILL NO WARNING LIGHTS ON DASH. UNABLE TO ACCOMPANY TOW COMPANY TO DEALERSHIP DUE TO COVID RESTRICTIONS, BUT CALLED DEALERSHIP AND TOLD THEM WHAT HAD HAPPENED. THEY DIAGNOSED IT AS A FAILED FUEL PUMP. THEY STILL HAVE THE CAR (4 BUSINESS DAYS LATER). THE CAR ONLY HAS 37,000 MILES ON IT (VERY LOW MILEAGE TO HAVE A FAILED FUEL PUMP). I NEVER LET IT GO BELOW 25% FULL TANK. IT'S A DIESEL, SO I CAN'T CONTROL FUEL QUALITY. THIS IS THE THIRD TIME I'VE HAD A FUEL SYSTEM ISSUE WITH THIS CAR IN THE TWO YEARS THAT I'VE OWNED IT (BOUGHT NEW) - VERY INCONVENIENT. OTHER TWO TIMES WERE ALSO FAILED FUEL PUMP OR FILTER, BUT WITH CORRESPONDING CHECK ENGINE LIGHTS AND/OR SYMPTOMS. THIS TIME WAS WITHOUT WARNING AND MADE ME FEEL VERY UNSAFE. I REALLY LOVE THIS CAR, BUT AM NOW SCARED TO DRIVE IT.",
        "vin": "3G1BH6SE1JS"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/21/2020",
        "dateOfIncident": "06/08/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365496,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TURNING MY VEHICLE IT WOULD MAKE LOUD CREAKING NOISES. THIS PROGRESSED TO MAKING LOUD CREAKING NOISES WHILE GOING OVER BUMPS, THROUGH DIPS, AND TURNS. IT WOULD HAPPEN AT ANY SPEED, BUT ESPECIALLY WHILE GOING SLOWLY THROUGH PARKING LOTS.THIS GOT MUCH WORSE OVER A SHORT PERIOD OF TIME. THE ENTIRE REAR AXEL THEN HAD TO BE REPLCED OR IT WOULD HAVE FAILED, ESPECIALLY SINCE THE ISSUES WAS RAPIDLY GETTING WORSE. I HAD TO PAY OUT OF POCKET ALMOST $1,800. NOW, IT HAS ONLY BEEN 3 MONTHS AND THIS ISSUE IS HAPPENING AGAIN.",
        "vin": "1G1BE5SM4J7"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/25/2020",
        "dateOfIncident": "05/12/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361086,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 15,000 MILES MY MANUAL TRANSMISSION BEGAN MAKING NOISES AT HIGHER RPMS UNDER LOADS. VIBRATIONS WERE FELT AT THE CLUTCH PEDAL WHEN SHIFTING. VIBRATIONS FELT THROUGHOUT THE VEHICLE WHEN ACCELERATING AT HIGHER ENGINE LOADS. THIS WAS AT BOTH HIGHWAY AND CITY DRIVING. THE DEALERSHIP INVESTIGATED AND FOUND THE CLUTCH ASSEMBLY AND THE FLYWHEEL HAD SOME KIND OF DAMAGE. ALL PARTS WERE REPLACED UNDER WARRANTY INCLUDING THE SLAVE CYLINDER WHICH HAS A HISTORY OF FAILING. THE SLAVE CYLINDER ALREADY HAS SEVERAL SERVICE BULLETINS AGAINST IT. THE LIST OF PARTS REPLACED ARE THE CLUTCH DISC, THROWOUT BEARING, PRESSURE PLATE, PILOT BEARING, FLYWHEEL AND SLAVE CYLINDER.",
        "vin": "1G1BG5SE3J7"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/25/2020",
        "dateOfIncident": "01/12/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361128,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH ONLY 12,100 MILES ON THE VEHICLE, THE DUAL MASS FLYWHEEL AND CLUTCH SUDDENLY FAILED UPON A FALSE START AND THEN MADE THE VEHICLE UNSAFE TO DRIVE. REPAIRS REQUIRED A NEW FLYWHEEL AND A CLUTCH HYDRAULIC COMPONENT REPLACEMENT.  THE FAILURE APPEARED TO HAPPEN QUICLY WITH THE FALSE START WHILE PARKED, BUT SUBSEQUENT DRIVING ON THE HIGHWAY THE CLUTCH WAS UNRELIABLE AND CAUSED AN UNSAFE CONDITION WHERE THE VEHICLE COULD STALL IN TRAFFIC. I WAS ABLE TO LIMP INTO THE DEALERSHIP FOR REPAIRS, BECAUSE IT WAS A SHORT DRIVE FROM WHERE THE FAILURE HAD OCCURED.",
        "vin": "1G1BG5SE0J7"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/21/2020",
        "dateOfIncident": "09/03/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360154,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING MY 2018 CHEVY CRUZE I HAD MULTIPLE INSTANCES WHERE THE CLUTCH PEDAL WOULD GO TO THE FLOOR AND NOT RELEASE, AND THE TRANSMISSION COULD NOT BE SHIFTED INTO GEAR. GENERAL MOTORS HAS A TECHNICAL SERVICE BULLETIN (TSB) ON THE ISSUE STATING THAT CONTAMINATION OF THE HYDRAULIC FLUID CAUSES THE ISSUE AND IT IS ONLY A WARRANTY REPLACEMENT FOR GASOLINE CARS (THE DIESEL MODELS ARE NOT COVERED BY THE WARRANTY IN THE TSB) IF THE CAR IS STILL WITHIN THE 5-YEAR, 60,000 MILE POWERTRAIN WARRANTY.    THIS IS THE SAME ISSUE THAT AFFECTS OPEL/VAUXHALL ASTRA CARS IN THE UK AND EUROPE AS THEY SHARE THE SAME PARTS (OPEL/VAUXHALL USED TO BE OWNED BY GM AND USED THE SAME POWERTRAIN). THE SAFETY RECALL IN EUROPE CONSISTED OF REPLACING SEVERAL TRANSMISSION AND BRAKE SYSTEM COMPONENTS AS THE BRAKES SHARE THE SAME HYDRAULIC RESERVOIR AS THE CLUTCH.    GM IS IGNORING THIS DANGEROUS PROBLEM IN THE USA AND REFUSING TO FIX THE ISSUE AS A PRODUCT RECALL. THEY HAVE IT AS A TSB THAT IS ONLY A WARRANTY REPAIR IF THE PROBLEM OCCURS BEFORE THE WARRANTY RUNS OUT ON THE AFFECTED CARS.  *JS",
        "vin": "1G1BG5SE6J7"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "08/25/2020",
        "dateOfIncident": "08/24/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351090,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "HUBBY WAS REAR ENDED BY A CAR GOING 45+ MILES AN HOUR, THE DRIVERS SIDE SEAT BELT DID NOT LOCK IT IS NOW LOCKED IN A FULLY EXTENDED POSITION.  AFTER IMPACT, HE SAID THERE WAS SMOKE IN THE CAR FROM WHAT LOOKED LIKE THE AIRBAG SHOULD HAVE INFLATED, BUT DID NOT. HE WAS ALMOST STOPPED FOR A RED LIGHT AND HIT FROM BEHIND.  THE SEAT BELT SHOULD HAVE LOCKED TIGHT AND IT DID NOT.",
        "vin": "1G1BC5SM9J7"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/01/2020",
        "dateOfIncident": "07/31/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342733,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HIT A DEER AT 50 MPH.  AIRBAGS DID NOT DEPLOY. SEE PICTURES OF DAMAGE TO VEHICLE.",
        "vin": "1G1BE5SM1J7"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/30/2020",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342443,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2018 CRUZE THAT I WAS DRIVING ON A 4 LANE HIGHWAY ON TOP OF A MOUNTAIN, THE BRAKES WENT OUT WITH ME AND MY 6 MONTH OLD IN CAR, I WAS ABLE TO GET TO SHOULDER, TOWED TO CHEVY, THEY SAID IT WAS A FAULTY BRAKE PUMP, AND CHARGED ME 500 TO FIX IT. THEN LESS THAN 2 WEEKS LATER, SAME MOUNTAIN, SAME THING, TOWED TO THE SAME CHEVY, THEY SAID THAT THE REPLACEMENT PUMP HAD EXPLODED AND IT WAS CAUSED BY ENGINE PISTON ISSUES, AND WANT 5 GRAND TO FIX IT. I BELIEVE THAT CHEVY BROKE THE CAR THE FIRST TIME AND BESIDES THE FACT, EXPLODING BRAKE PUMPS, 2 IN A ROW IS VERY SCARY. LUCKILY ME AND MY CHILD ARE STILL ALIVE TO BE COMPLAINING ABOUT IT, BUT WE SERIOUSLY CAME VERY CLOSE TO BEING KILLED BY THESE FAULTY BRAKES TWICE. I DON'T KNOW IF THEY LIED ABOUT THE REPAIR OR IF IT REALLY IS TWO EXPLODING BRAKE PUMPS IN A ROW, BUT EITHER WAY, THESE EXPLODING BRAKES PUMPS ARE GOING TO KILL SOMEONE AND IT WAS ALMOST ME AND MY 6 MONTH OLD BABY. THE CHEVROLET DEALER IS AUTO NATION IN VALENCIA CA.",
        "vin": "1G1BC5SM7J7"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/23/2020",
        "dateOfIncident": "07/12/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341104,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON THE FREEWAY AT 65 MPH AND MY BUMPER FLEW OFF.",
        "vin": "1G1BCSSM4J7"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/24/2020",
        "dateOfIncident": "06/11/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330625,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WILL NOT ACCELERATE AT TIMES CAUSING ME TO GIVE IT MORE GAS WHICH THEN CAUSE THE CAR TO REV UP TO A HIGH RPM   (4000-5000) AND THEN LURCH FORWARD. ALSO, AT TIMES WHILE TRYING TO MAINTAIN SPEED, MY CAR WILL JERK BACK AND FORTH UNTIL I GIVE IT MORE GAS SO IT UP SHIFTS. MY CAR IS UNDER FACTORY WARRANTY AND IT SEEMS THAT THE DEALERSHIP IS TRYING TO BRUSH IT OFF BECAUSE THE COMPUTER SAYS THERE IS NOTHING WRONG WHICH PROMPTED ME TO FILE A COMPLAINT WITH GM WHICH STILL INS'T RESOLVED.  *TR",
        "vin": "1G1BC5SM3J7"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/08/2020",
        "dateOfIncident": "06/07/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327722,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET CRUZE. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 30 MPH, THE VEHICLE LOSS POWER STEERING ASSIST. THE SERVICE POWER STEERING- DRIVE WITH CARE, AND SERVICE STABILI-TRAC WARNING LIGHTS WERE ILLUMINATED. THE CONTACT CALLED HAWK CHEVROLET OF JOLIET LOCATED AT: 2001 W JEFFERSON ST, JOLIET, IL 60435, (815)725-7110, AND WAS INFORMED TO SCHEDULE AN APPOINTMENT TO HAVE THE VEHICLE DIAGNOSED, WHICH WAS STILL PENDING. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 42,909.",
        "vin": "1G1BC5SM3J7"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/07/2020",
        "dateOfIncident": "06/06/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327631,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN EITHER ACCELERATING FROM A STOP OR WHILE ACTIVELY TRAVELING AT SPEED THE VEHICLE WILL DROP SPEED AND SHAKE TO THE POINT THAT YOU BELIEVE YOU MAY LOSE CONTROL OF THE VEHICLE AND/OR YOU MAY GET REAR-ENDED OR HIT BY ANOTHER VEHICLE. IT HAS HAPPENED WHILE TURNING FROM A STOPPED POSITION ONTO THE MAIN ROAD AND I WAS ALMOST KILLED BY BEING STRUCK BY A VEHICLE WHEN THE VEHICLE WOULD NOT ACCELERATE. THE SECOND MAJOR INCIDENT WAS WHEN I WAS TRAVELING AT 70 MPH ON THE EXPRESSWAY, THE VEHICLE SUDDENLY DECELERATED, THE STEERING WHEEL BEGAN SHAKING AND THE CAR WAS ALMOST UNABLE TO BE CONTROLLED.  THE FREEWAY INCIDENT TOOK PLACE 6/6/2020",
        "vin": "3G1BE6SM7JS"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/03/2020",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327047,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "7' MY LINK INFOTAINMENT SYSTEM IS TO BRIGHT AT NIGHT AND BLINDS DRIVERS AT NIGHT.  *TR",
        "vin": "1G1BE5SM3J7"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/28/2020",
        "dateOfIncident": "05/28/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326302,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN SHIFTING THE GEARBOX FROM PARK TO DRIVE OR FROM DRIVE TO PARK THE INFOTAINMENT SCREEN WILL GO TO MAXIMUM BRIGHTNESS AND CAN NOT BE DIMMED CAUSING GREATLY REDUCED VISION DURING NIGHT DRIVING SITUATIONS. IF YOU STOP IN REVERSE AND ALLOW THE REAR CAMERA TO ACTIVATE IT WILL WORK NORMALLY. DEALER REPORTS WORKING NORMALLY.  *TR",
        "vin": "3G1BE6SM2JS"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/09/2020",
        "dateOfIncident": "03/09/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317018,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS ISSUE APPLIES TO WHEN THE VEHICLE IS IN MOTION. THE BRAKE PEDAL HEIGHT IS SET TOO HIGH OFF THE FLOOR COMPARED TO THE ACCELERATOR PEDAL. WHEN DRIVING A CAR YOU SHOULD BE ABLE TO COMFORTABLY PIVOT BETWEEN GAS AND BRAKE PEDALS WHILE KEEPING YOUR HEEL ON THE FLOOR. WITH THE BRAKE PEDAL SET SO HIGH ON THIS CAR, I HAVE TO COMPLETELY TAKE MY FOOT OFF THE FLOOR AND MOVE MY WHOLE FOOT OVER TO APPLY THE BRAKE WHEN SWITCHING FROM THE ACCELERATOR TO THE BRAKE PEDAL. ALSO, BECAUSE OF THE PEDAL HEIGHT, MY FOOT GETS CAUGHT ON THE PEDAL CAUSING A DELAY IN APPLYING THE BRAKE. ALSO HAPPENS WHEN GOING FROM THE BRAKE PEDAL TO THE GAS PEDAL- THE FOOT CATCHES THE EDGE OF THE BRAKE PEDAL AND UNINTENTIONALLY APPLIES THE BRAKE WHEN TRYING TO APPLY THE GAS. THE CHEVROLET DEALERSHIP STATED THE BRAKE PEDAL HEIGHT CANNOT BE ADJUSTED. I BELIEVE THIS IS A SAFETY ISSUE AND NEEDS TO HE ADDRESSED.",
        "vin": "1G1BE5SM5J7"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/28/2020",
        "dateOfIncident": "01/25/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302608,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS 3 FEET FROM TURNING LEFT AT INTERSECTION LEFT LANE TURN (LIGHT HAD JUST TURNED GREEN) THROUGH A INTERSECTION, WHEN I NOTICED MY ENGINE WAS OFF. I ROLLED ACROSS THE INTERSECTION; ATTEMPTED TO RESTART THE CAR - CAR DIDN'T START. THE ELECTRICITY IN CAR WAS STILL ON AND NORMAL. COOLANT WAS AT NORMAL TEMP. ONLY RADIO WAS ON LOW VOLUME. NO DASHBOARD LIGHTS- NOR MESSAGES APPEARED. CAR WOULDN'T RESTART. WAS STUCK HALFWAY IN RIGHT (ONCOMING TRAFFIC) TURN LANE & HALF IN BUSINESS DRIVEWAY. PUT CAR IN PARK & TRIED TO TURN ON AGAIN. NOTHING. STEERING, BRAKES, LIGHTS AND DOORS WERE FUNCTIONAL. GOT HELP TO PUSH CAR IN A PARKING SPACE. TURNED OFF CAR COMPLETELY & ATTEMPTED TO TURN ON. CAR CRANKED & ALMOST STARTED. TRIED AGAIN - NOTHING. TURNED OFF & REMOVED KEYS TO GET OUT OF CAR TO LOOK UNDER HOOD. ALL LOOKED NORMAL. GOT BACK INSIDE CAR, ATTEMPTED TO START. IT CAME ON FOR 5 SECONDS THEN DIED. WAITED. NO DASHBOARD LIGHTS NOR ERROR MESSAGES. FINALLY GOT CAR TO CRANK AND IT STAYED ON. NO ERROR MESSAGES. WENT TROUGH CAR SCREEN AND VOLTAGE WAS NORMAL 13 +/- VOLTS; IDLE WAS NORMAL - DID NOT MOVE AROUND. LEFT BUSINESS WHEN MESSAGE SAID ABOUT HAVING ANTILOCK BREAKS CHECKED BUT HAS NOT APPEARED ON CAR SCREEN SINCE (DIDN'T PRESS BREAKS BEFORE IT DIED. I PREFER ENGINE BREAKING). RECEIVED EMAIL FROM ONSTAR THAT \"AN ISSUE WITH THE STABILITRAK STABILITY CONTROL SYSTEM IN YOUR 2018 CHEVROLET CRUZE HAS BEEN DETECTED. PLEASE SERVICE YOUR VEHICLE WITHIN 7 DAYS. & AN ISSUE WITH THE ANTILOCK BRAKING SYSTEM IN YOUR 2018 CHEVROLET CRUZE HAS BEEN DETECTED\". I WAS ALMOST HIT BY A TRUCK WHILE STUCK HALF WAY IN STREET. CALLED AND COMPLAINED TO GM. GM REP SAID I AM PAST WARRANTY BY 9,000 MILES (CAR IS 1.5 YRS OLD). THEY CANT HELP. TOLD ME TO GO TO DEALERSHIP. CALLED 4 DEALERSHIPS, NO TECHS ON SATURDAYS AND NO LOANERS SINCE OUT OF WARRANTY. NO ERROR CODES STILL. NO LIGHTS LIT UP. CAR IS ACTING NORMAL.",
        "vin": "1G1BC5SM4J7"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/24/2020",
        "dateOfIncident": "01/24/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301537,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I BACKED OUT OF MY ICY DRIVEWAY AND ONTO THE CLEAR, DRY ROAD. SET MY CRUISE CONTROL TO 48MPH AND AFTER ABOUT 30 SECONDS, MY TRACTION CONTROL AND SERVICE ENGINE LIGHTS CAME ON WITH AN ERROR MESSAGE THAT SAID \"SERVICE STABILITRAK\" AND MY CRUISE CONTROL TURNED OFF. I CLOSED THE STABILITRAK MESSAGE, THE TRACTION CONTROL LIGHT TURNED OFF AFTER ABOUT 30 SECONDS, AND THE SERVICE ENGINE LIGHT TURNED OFF SHORTLY AFTER. BUT MY CRUISE CONTROL STILL WONT ENGAGE. I'VE TURNED THE VEHICLE OFF AND ON AND IT STILL ISNT WORKING.  IT SEEMS THAT A LOT OF DIFFERENT GM VEHICLES HAVE EXPERIENCED THIS PROBLEM, AND THE DEALERSHIP HAS FIXED IT IN SEVERAL DIFFERENT WAYS. I READ ON A FORUM THAT SOMEONE HAD THE ISSUE AND THE GM DEALERSHIP SAID THERE WAS AN ISSUE WITH THE AMOUNT OF ETHANOL IN THE GASOLINE. I HAPPENED TO HAVE FILLED UP MY TANK THE NIGHT BEFORE WITH REGULAR UNLEADED FROM MY LOCAL SPEEDWAY. NOT SURE OF THAT COULD HAVE BEEN CONNECTED.",
        "vin": "1G1BE5SM3J7"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/22/2020",
        "dateOfIncident": "01/16/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301274,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 13,500 MILES THE VEHICLE HAD THIS PROBLEM, THE TIRES WEAR IN A BIZARRE WAY THAT WE HAD TO BY NEW TIRES, WAS SO HARD TO DRIVE AND THE WORST OF IT THE PROBLEM APPEAR WITHOUT WARNING .",
        "vin": "3G1BE6SMXJS"
    },
    {
        "components": "STEERING,AIR BAGS,WHEELS",
        "crash": true,
        "dateComplaintFiled": "01/06/2020",
        "dateOfIncident": "12/29/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11297324,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON I35 SOUTH BOUND JUST NORTH OF OSEOLA IA. AT 73 MILES AN HOUR SOMETHING CAME LOOSE ON LEFT FRONT CAR TOOK A HARD LEFT NO CONTROL CRASHING INTO CABLE BARRIER IN MEDIAN. 3 PEOPLE ON BOARD 2 FRONT 1 REAR. NONE CAN EXPLAIN WHAT HAPPENED IT HAPPENED SO FAST. LEFT FRONT WHEEL AND AXLE WERE NOT FOUND AT THE SEEN OF THE ACCIDENT LEFT FRONT WAS COMPLETELY GONE. ONLY 4 AIRBAGS OF THE 10 ON BOARD DEPLOYED. RECEIVED ONSTAR NOTIFICATIONS ON STABILITY CONTROL SYSTEM (STABILITRAK}, ANTILOCK BRAKING, ENGINE AND TRANSMISSION SYSTEM, AND FLAT DRIVERS SIDE REAR ALL AT THE SAME TIME.",
        "vin": "1G1BE5SM4J7"
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "12/20/2019",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290365,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET CRUZE. WHEN THE CONTACT ATTEMPTED TO LOCK THE VEHICLE, SHE WAS STILL ABLE TO LIFT THE TRUNK OF THE VEHICLE. THE VEHICLE WAS TAKEN TO SAPAUGH MOTORS (LOCATED AT 1435 MCNUTT ST, HERCULANEUM, MO 63048, 636-334-9048), BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 40,000. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/06/2019",
        "dateOfIncident": "10/18/2019",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278566,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELLING ON THE INTERSTATE AT ABOUT 50 MPH WHEN TRAFFIC CAME TO A SUDDEN STOP. I SLAMMED ON MY BRAKES IN PLENTY OF TIME, BUT I REAR-ENDED THE VAN IN FRONT OF ME. AT THE TIME I THOUGHT I MUST HAVE SKIDDED INTO THE VAN, BUT LOOKING AT THE COLLISION SITE LATER, THERE WERE NO TIRE MARKS.",
        "vin": "1G1BE5SM7J7"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/29/2019",
        "dateOfIncident": "10/28/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271745,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INVOLVED IN A REAR END COLLISION WITH ANOTHER VEHICLE WHEN APPROACHING AN INTERSECTION. RATE OF SPEED WAS 40 MPH, AND WHEN BRAKES WERE FIRMLY/HEAVILY APPLIED, THE VEHICLE DID NOT STOP, WHICH CAUSED ME TO REAR END THE VEHICLE IN FRONT OF ME.",
        "vin": "3G1BE6SM9JS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/30/2019",
        "dateOfIncident": "08/30/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252427,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS A TICKING NOISE COMING FROM THE ENGINE BAY. CURRENTLY AT A CHEVY DEALERSHIP, BUT NOISE HAS TEMPORARILY GONE AWAY. SEEMS THAT THEY CAN'T FIND THE ISSUE AT THE MOMENT BUT IT SEEMS THAT OTHER OLDER AND NEWER VEHICLES OF THEY SAME KIND AS MINE (CHEVY CRUZE 2018) 1.4L AUTOMATIC HAS HAD SIMILAR ISSUES WITH A TICKING NOISE COMING FROM THE ENGINE BAY AREA. THIS TICKING NOISE LASTED A WHOLE DAY BUT WENT AWAY THIS MORNING ONCE DRIVING THE CAR FOR ABOUT 10 MINUTES ON HIGHWAY.",
        "vin": "3G1BE6SMXJS"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/30/2019",
        "dateOfIncident": "08/19/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252432,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "IT STARTED AROUND THE 18TH OF THIS MONTH. WHEN I GO TO TURN MY CAR MAKING A POPPING SOUND... I TAKE IT INTO MY CHEVY DEALERSHIP THEY STATE ITS THE STEERING RACK.. THEY REPLACE MY STEERING GEAR AT N/C BECAUSE AT THAT TIME I WAS ABLE TO GET IT IN WARRANTY, WE ARE NOT ON MY THIRD VISIT NO LONGER UNDER GM WARRANTY DUE TO MILES  AND I STILL HEAR POPPING WHEN TURNING..",
        "vin": "1G1BE5SM2J7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/21/2019",
        "dateOfIncident": "07/18/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245474,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET CRUZE. THE CONTACT STATED THAT THE VEHICLE JERKED, LUNGED, AND LOST POWER WHILE THE ACCELERATOR PEDAL WAS DEPRESSED OR WHILE THE AIR CONDITIONING WAS ACTIVATED. THE FAILURE OCCURRED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO CHEVROLET OF PALATINE (151 E LAKE COOK RD, PALATINE, IL 60074, (847) 359-7700) WHERE IT WAS DIAGNOSED WITH TURBO LAG. THE ENGINE CONTROL MODULE WAS RESET AND THE VEHICLE WAS  NOT REPAIRED, THE PROBLEM NEVER STOPPED.  THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 5,148. *TT  THE MANUFACTURER HAS NOW BEEN NOTIFIED OF THE  FAILURE AS OF 8-21-19. I WAS ADVISED BY LU (A WOMAN), THAT A SENIOR ADVISER WOULD FOLLOW UP WITH  WITHIN 2 BUSINESS DAYS, AND I HAVE NOT HEARD FROM ANYONE AS OF YET. FYI I ENCOUNTERED SOMEONE  AT A GAS STATION THAT ADVISED ME THAT HE HAS THE SAME PROBLEM WITH HIS CAR (SAME MAKE & MODEL),  WHEN HIS AIR CONDITIONER IS ON. HE GAVE ME HIS CONTACT INFO: FERNANDO GARCIA - PH#: (773)949-0922.*JB",
        "vin": "1G1BC5SM9J7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/12/2019",
        "dateOfIncident": "08/09/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243403,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WENT TO STOP AND PEDAL GOT HARD TO PUSH DOWN THIS HAS HAPPENED ON 3 SEPARATE OCCASIONS THE FIRST TIME IT WAS UNDER WARRANTY THE 2ND TIME IT HAPPENED I HAD AMECHANIC FIX IT THE 3RD TIME I TOOK IT TO A CHEVROLET DEALER THIS SHOULDN'T HAPPEN TO A VEHICLE 15 MONTHS OLD",
        "vin": "3G1BE6SM1JS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/31/2019",
        "dateOfIncident": "07/03/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240848,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TIRE PRESSURE MONITOR SYSTEM IS MESSING UP ALL THE TIME. I WAS HEADED TO MY SISTER IN LAWS IN MARYLAND AND I WAS 2 HRS AWAY FROM HER HOUSE N 3 HOURS AWAY FROM MY HOUSE AND THE TIRE LIGHT CAME ON AND MY CAR SAID THAT MY TIRE PRESSURE WAS LOW. I WAS ON A BUSY HIGHWAY AND I FREAKED OUT BC I COULDN'T GET OVER TO FIX MY TIRE. I ENDED UP GETTING OVER AND FINDING OUT THAT MY TIRE WAS COMPLETELY FINE AND IT WAS JUST THE SYSTEM MESSING UP. I STARTED DRIVING AGAIN AND AS I WAS DRIVING MY CAR STARTED READING THAT THE TIRE PRESSURE WAS SLOWLY GOING BACK UP TO WERE IT'S SUPPOSED TO BE. EVER SINCE THEN THE TIRE PRESSURE MONITOR GOES OFF AND THEN GOES AWAY AFTER AWHILE.",
        "vin": "1G1BC5SM5J7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/23/2019",
        "dateOfIncident": "05/27/2019",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234215,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2018  CHEVROLET CRUZE. THE CONTACT STATED THAT WHILE DRIVING ABOUT 45 MPH, A POP NOISE WAS HEARD FROM THE REAR OF THE VEHICLE AND BLACK SMOKE SHOT OUT FROM THE FRONT PASSENGER'S SIDE AND IMMEDIATELY FOLLOWED BY FLAMES THAT QUICKLY COVERED THE ENTIRE VEHICLE. THERE WAS NO WARNING. BOTH POLICE AND FIRE REPORTS WERE FILED. THE FIRE DEPARTMENT EXTINGUISHED THE FIRE. THE VEHICLE WAS TOTALED AND TOWED TO A ROADRUNNER. THE CONTACT CALLED THE GERRY LANE CHEVROLET DEALER  (225-366-7962, LOCATED AT 6505 FLORIDA BLVD, BATON ROUGE, LA 70806) WHERE THE DEALER DENIED RESPONSIBILITY. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND LEFT THE MATTER UP TO THE INSURANCE COMPANY. THE FAILURE MILEAGE WAS APPROXIMATELY 3,600.",
        "vin": "1G1BC5SM9J7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/11/2019",
        "dateOfIncident": "06/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219316,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A DIESEL CRUZ. OF NO FAULT OF MY OWN, THE CAR MUST BE TAKEN TO THE DEALER TO HAVE A MANUAL REGENERATION OF THE EXHAUST PARTICULATE FILTER PERFORMED WITH 16K MILES ON THE CAR.",
        "vin": "1G1BG5SE8J7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/05/2019",
        "dateOfIncident": "05/16/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218191,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAD GREATLY REDUCED FUEL ECONOMY AND POWER. SHOULD NOT HAVE BEEN DRIVEN. CHEVY DID NOT RESPOND TO MULTIPLE ATTEMPTS TO GET RENTAL. THEY FORCED ME TO DRIVE A CAR THAT WAS NOT OPERATING AS DESIGNED EVEN THOUGH IT WAS UNDER THE BUMPER TO BUMPER WARRANTY AND THEY AGREED THE CAR HAD ISSUES. 2 WEEKS AFTER DRIVING IT THEY FIGURED OUT TURBO HAS A LEAK THAT THEY FIXED. 2 WEEKS I DROVE A CAR THAT SOUNDED LIKE A JET UPON ACCELERATING AND CHEVY DID NOTHING. DIDN'T EVEN OFFER A RENTAL.",
        "vin": "1G1BE5SM2J7"
    },
    {
        "components": "AIR BAGS,STRUCTURE,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "05/21/2019",
        "dateOfIncident": "05/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208966,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CRUZE WAS EVOLVED IN A FRONT END ACCIDENT THAT THE BRAKES OPERATION IS IN QUESTION",
        "vin": "3G1BD6SM4JS"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/24/2019",
        "dateOfIncident": "04/24/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203431,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "OWN A 2018 CHEVY CRUZE, PURCHASED OFF SHOWROOM FLOOR IN JULY 2018. SINCE THEN THE TIRES HAVE ALL BEEN REPLACED 3 TIMES DUE TO BLOW OUTS OR BULDGING. THAT IS 12 BRAND NEW TIRES IN LESS THAN A YEAR! WHEN RECEIVED A BLOW OUT THE CAR WAS IN MOTION. THE TYPE OF TIRES ARE HANKOOK VENTUS V2 205/50/R/17. THE DATE SPAN IS APPROXIMATELY JANUARY TO THE PRESENT.",
        "vin": ""
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": true,
        "dateComplaintFiled": "04/01/2019",
        "dateOfIncident": "10/05/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193176,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO/INFOTAINMENT SYSTEM DISPLAY GOES FULL BRIGHT EVEN DURING NIGHT AND CANNOT BE DIMMED AND DESTROYS THE DRIVERS NIGHT VISION AND CAN ONLY BE RESET BY STOPPING THE CAR AND CYCLING THROUGH REVERSE, TO ACTIVATE REVERSE CAMERA. ALSO, REVERSE CAMERA OPERATION PUTS SCREEN IN FULL BRIGHT, WHICH AT NIGHT MAKES THE DISPLAY TOO BRIGHT TO USE, AND DISTRACTING TO THE DRIVER TRYING TO SAFELY OPERATE THE CAR IN REVERSE AT NIGHT. THIS APPEARS TO BE A PROBLEM WITH ALL 2016-2018 CHEVROLET CRUZE WITH THE 7' MYLINK INFOTAINMENT SYSTEM AS CAN BE SEEN IN THE ACTIVE ONLINE FORUM DISCUSSION OF THIS ISSUE: HTTPS://WWW.CRUZETALK.COM/FORUM/393-GEN2-AUDIO-ELECTRONICS/223897-HOW-DIM-7-MYLINK-DISPLAY.HTML    GENERAL MOTORS FIX IS TO PUT THE CAR IN REVERSE FOR 13 SECONDS AFTER STOPPING AND BACK INTO DRIVE. THIS IS AFTER SIX MONTHS OF DEALING WITH THIS. [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TT",
        "vin": "1G1BE5SM9J7"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/30/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192601,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR FOGS THEN FROSTS UP . ALSS WHEN IT RAINS THE OUTER PART OF WINDOWS HAVE AN ADD FILM AND MAKE IT VERY HARD TO SEE AFTER THE WINDSHIELD WIPES THE RAIN OFF. VERY DANGEROUS CAR. I HAVE LOOKED AROUND AND ALL SEEM TO COMPLAIN ABOUT IT. HOW CAN THEY GET AWAY WITH THIS?",
        "vin": "3G1BE6SM3JS"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/23/2019",
        "dateOfIncident": "12/12/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191084,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO/INFOTAINMENT SYSTEM DISPLAY GOES FULL BRIGHT EVEN DURING NIGHT AND CANNOT BE DIMMED AND DESTROYS THE DRIVERS NIGHT VISION AND CAN ONLY BE RESET BY STOPPING THE CAR AND CYCLING THROUGH REVERSE, TO ACTIVATE REVERSE CAMERA.  ALSO, REVERSE CAMERA OPERATION PUTS SCREEN IN FULL BRIGHT, WHICH AT NIGHT MAKES THE DISPLAY TOO BRIGHT TO USE, AND DISTRACTING TO THE DRIVER TRYING TO SAFELY OPERATE THE CAR IN REVERSE AT NIGHT.  THIS APPEARS TO BE A PROBLEM WITH ALL 2016-2018 CHEVROLET CRUZE WITH THE 7' MYLINK INFOTAINMENT SYSTEM AS CAN BE SEEN IN THE ACTIVE ONLINE FORUM DISCUSSION OF THIS ISSUE: HTTPS://WWW.CRUZETALK.COM/FORUM/393-GEN2-AUDIO-ELECTRONICS/223897-HOW-DIM-7-MYLINK-DISPLAY.HTML",
        "vin": "1G1BG5SE0J7"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/23/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191086,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO/INFOTAINMENT SYSTEM DISPLAY GOES FULL BRIGHT EVEN DURING NIGHT AND CANNOT BE DIMMED AND DESTROYS THE DRIVERS NIGHT VISION AND CAN ONLY BE RESET BY STOPPING THE CAR AND CYCLING THROUGH REVERSE, TO ACTIVATE REVERSE CAMERA.  ALSO, REVERSE CAMERA OPERATION PUTS SCREEN IN FULL BRIGHT, WHICH AT NIGHT MAKES THE DISPLAY TOO BRIGHT TO USE, AND DISTRACTING TO THE DRIVER TRYING TO SAFELY OPERATE THE CAR IN REVERSE AT NIGHT.  THIS APPEARS TO BE A PROBLEM WITH ALL 2016-2018 CHEVROLET CRUZE WITH THE 7' MYLINK INFOTAINMENT SYSTEM AS CAN BE SEEN IN THE ACTIVE ONLINE FORUM DISCUSSION OF THIS ISSUE: HTTPS://WWW.CRUZETALK.COM/FORUM/393-GEN2-AUDIO-ELECTRONICS/223897-HOW-DIM-7-MYLINK-DISPLAY.HTML",
        "vin": "1G1BH5SE9J7"
    },
    {
        "components": "WHEELS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/15/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187169,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TAMAKA RECALL SQUEAKY NOISE COMING FROM FRONT LEFT AXLE WHEN DRIVING VEHICLE ON HIGHWAY OR CITY STREET. FRONT BREAKS LEAKING.",
        "vin": "1G1BC5SM4J7"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/09/2019",
        "dateOfIncident": "03/08/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185508,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE INTERSTATE AT 60MPH, WITHOUT WARNING THE ENGINE TURNED OFF. THE DASH WENT COMPLETELY DARK. NO POWER, NO STEERING. DRIFTED TO SHOULDER. PUT IN PARK, TURNED KEY TO OFF THEN ON. VEHICLE STARTED. (NO WARNING OR SERVICE CODES) REPLICATED AGAIN ABOUT 10 MINS LATER. ON CITY STREET TRAVELING 35 MPH WITHOUT WARNING DASH WENT DARK AND CAR SHUT OFF. SAME PROCEDURE TO START. (NO WARNING OR SERVICE CODES) UNKNOWN WHAT CAUSED MASSIVE FAILURE. NO INDICATORS.",
        "vin": "1G1BE5SM6J7"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/20/2019",
        "dateOfIncident": "01/29/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181271,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE THE VEHICLE SERVICE FOR THE 30,000 MILES FLUSH ON JANUARY 21,2019. ON JANUARY 29TH I WAS ON THE FREEWAY IN MORNING TRAFFIC  HEADING NORTH ON THE 110 WHEN AT 25 MILES I MADE A SUDDEN STOP DUE TO THE CAR IMFRONT OF ME. MY CAR DIDN'T STOP AND SLAMMED INTO THE CAR IN FRONT OF ME. MY CAR WAS REPORTED TO BE TWO DAYS LATER AS A TOTAL LOSS. I'M GRATEFUL MY KIDS, SISTER AND I WEREN'T INJURED. JUST DOESN'T MAKE SENSE AFTER JUST PAYING ALMOST $500 A WEEK BEFORE FOR SERVICING.",
        "vin": "1G1BC5SM6J7"
    },
    {
        "components": "EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/13/2019",
        "dateOfIncident": "01/12/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11179730,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER IS LEAKING INTO THE TRUNK. IT WAS SUPPOSEDLY REPAIRED ON 1/12/2019. I HAD TO RETURN ON 1/21/2019 BECAUSE WATER WAS STILL LEAKING INTO THE TRUNK. THEN AFTER APPARENTLY BEING FIXED AGAIN, I WAS FORCED TO RETURN ON 1/30/2019 WITH WATER STILL LEAKING INTO THE TRUNK, NOTHING WAS DONE (I HAVE PICTURES AND VIDEO OF SAID LEAK).",
        "vin": "1G1BESM8J72"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/25/2019",
        "dateOfIncident": "10/28/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 1,
        "numberOfInjuries": 1,
        "odiNumber": 11172201,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL AIRBAGS WERE DEPLOYED DURING THE ACCIDENT EXCEPT DRIVERS SIDE (STEERING WHEEL). THE VEHICLE WAS IN MOTION ON CITY STREET.",
        "vin": "1G1BC5SM5J7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/22/2019",
        "dateOfIncident": "11/14/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171354,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET CRUZE. THE CONTACT STATED THAT EACH TIME THE VEHICLE WENT THROUGH A CAR WASH, THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO QUIRK CHEVROLET OF PORTLAND (LOCATED AT 1000 BRIGHTON AVE, PORTLAND, ME 04102, (207) 420-8968) AND THE CONTACT WAS ADVISED TO DRIVE THE VEHICLE FAST ON THE HIGHWAY TO CLEAR THE FILTER, WHICH WOULD TURN OFF THE WARNING INDICATOR. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED CASE NUMBER: 94989017128. THE APPROXIMATE FAILURE MILEAGE WAS 9,900.",
        "vin": "3G1BG6SE8JS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/07/2018",
        "dateOfIncident": "11/30/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11156705,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS LEAVING WORK ON 11-30-18 @ 5P.M. STARTED DRIVING DOWN LA HARPE BLVD, LIKE I DO EVERYDAY AFTER WORK. IT WAS RAINING THAT AFTERNOON WHEN I WAS LEAVING WORK. I WENT THROUGH A SMALL PUDDLE OF WATER AND MY CAR COMPLETELY SHUTDOWN AND WOULD NOT GO ANYWHERE. I HAD IT TOWED TO CRAIN CHEVROLET WHERE THE VEHICLE WAS BOUGHT. THE GM CERTIFIED MECHANIC CALLED US HALF AN HOUR AFTER THEY OPENED SATURDAY MORNING AND SAID THAT THE ENGINE WAS SEIZED AND THE ONLY WAY HE FOUND THAT OUT WAS JUST STARTING THE VEHICLE UP  WITHOUT LOOKING @ THE VEHICLE FIRST. MY HUSBAND AND I WENT UP THERE SATURDAY AFTERNOON JUST TO ASK IF WE COULD TAKE A PEEK AT IT NONE OF THE VEHICLE WAS TAKEN APART AND HE WAS WRONG ON THREE DIFFERENT THINGS HE TOLD ME AND I WAS ABLE TO PROVE HIM WRONG ON THE SPOT HE JUST CHANGED TOPIC AND LOOK THE OTHER WAY I JUST THINK THERE'S SOMETHING FISHY GOING ON HERE. I BELIEVE IF THE PROPER DIAGNOSTICS WOULD HAVE BEEN DONE ON THE VEHICLE BEFORE HE JUST STARTED UP THE PROBLEM MAY HAVE BEEN FIXED BUT WITH GM CERTIFIED MACANIC JUST STARTING UP MY VEHICLE COULD HAVE FORCED EVEN MORE WATER INTO THE ENGINE AND PRETTY MUCH MADE IT DO WHAT IT DID. WE MADE A CLAIM ON DECEMBER 1ST WITH FARM BUREAU & MADE A CLAIM WITH THE GM SENIOR ADVISOR  ON THE SAME DATE. THE INSURANCE ADJUSTER JUST PRETTY MUCH WENT OUT THERE AND TOLD HIM TO JUST TEAR THE VEHICLE APART AND FIND OUT WHAT'S WRONG WITH IT DIDN'T ASK IF THAT'S WHAT WE WANT IT DONE OR NOT AND NOW ALL THE SUDDEN IT'S ALL TAKEN APART AND TOTALED OUT WE'RE STUCK WITH THE DEPRECIATION VALUE AND DEDUCTABLE AND NO VEHICLE. SENIOR ADVISOR FROM GM JUST GOT BACK TO US TODAY ON THE DEC. 4TH, DALEESA WAS SUPPOSED TO GET IN CONTACT WITH THE DEALERSHIP (CRAIN) AND FIGURE OUT WHAT WAS REALLY GOING ON WITH MY VEHICLE,  INSTEAD DALEESA NEGLECTED TO CONTACT ME OR MY HUSBAND. THERE WAS DIFFERENTLY SOME NEGLIGENT ACTION ON CRAIN'S SIDE AND GM.",
        "vin": "1G1BC5SM7J7"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/28/2018",
        "dateOfIncident": "11/28/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154606,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS BACKING OUT I PLACED MY FOOT ON THE GAS AS I GOT READY TO BREAK I PLACED MY FOOT ON THE BRAKE, BUT THAT'S WHEN MY FOOT SLIPPED OFF THE PEDAL AND BACKED INTO THE PERSON BEHIND ME.",
        "vin": "1G1BC5SM7J7"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/01/2018",
        "dateOfIncident": "10/18/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144757,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I LEASED A CRUZE AND WITH LESS THAN TWO WEEKS IN MY POSSESSION IT HAS BEEN MORE AT THE DEALER THAN WITH ME.  FIRST, THEY THOUGHT IT WAS A STRUT AND AFTER HAVING THE CAR FOR TWO DAYS THEY REPLACED THE AFFECTED PART.  A DAY AFTER GETTING THE CAR BACK, THE SAME CREAKING NOISE THAT WAS PREVIOUSLY APPARENT WAS STILL THERE AND GETTING WORSE.  THEY HAVE NOW HAD MY CAR FOR 4 DAYS AND REPORTED BACK TO ME THAT THE NOISE WAS IN THE SWAY BAR BUSHINGS AND THEY HAD TO REPLACE THE ENTIRE ASSEMBLY.  THIS DOES NOT HAPPEN ON A NEW CAR.  IT IS AMNAUFACTURING DEFECT AND THEY SHOULD RETURN IT TO GM AND GIVE ME A NEW CAR.",
        "vin": "1G1BE5SM1J7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/24/2018",
        "dateOfIncident": "10/24/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142351,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 DISPLAY BRIGHTNESS ISSUE    NIGHT TIME DRIVING THE DISPLAY IS WAY TO BRIGHT.  DIMMING LIGHTS WITH DIMMER SWITCH HAS NO RESULTS.  DISPLAY BRIGHTNESS IS SO DISTRACTING IT BLINDS OCCUPANTS OF THE VEHICLE.  CONTACTING CHEVROLET THEY DISPLAYED IGNORANCE OF THE PROBLEM. A SEARCH OF THE INTERNET PROVIDE MULTIPLE COMPLAINTS OF THIS PROBLEM ON SEVERAL MODEL IN ADDITION TO THE CRUISE",
        "vin": "1G1BE5SM7J7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/11/2018",
        "dateOfIncident": "08/12/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139600,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE COMPUTER SCREEN IN THE DASH STAYS AT FULL BRIGHTNESS AT NIGHT. THIS MAKES FOR A BLIND SPOT DRIVING AND VERY HARD TO PARK THE CAR ON THE STREET AS IT BLOCKS VIEW TO THE MIRROR ON RIGHT.",
        "vin": "1G1BC5SM6J7"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/17/2018",
        "dateOfIncident": "08/05/2018",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120610,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2018 CHEVY CRUZE THE OIL LIGHT CAME ON, THE ENGINE LOCKED UP, AND THE VEHICLE CAUGHT FIRE. THE DEALERSHIP SAID THAT IT WAS DUE TO A FUEL LINE SPRAYING FUEL ON THE ENGINE.",
        "vin": "1G1BC5SM0J7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/23/2018",
        "dateOfIncident": "11/29/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112952,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INTERIOR OF THE CAR HAS SEVERAL AREAS WITH CHROME TYPE OF MATERIAL FOR DECORATIONS. DURING DAYTIME DRIVING, THE SUN HITS IT AND BLINDS ME, SO IT PREVENTS ME FROM DRIVING SAFELY UNTIL SUNDOWN.",
        "vin": "3G1BH6SEXJS"
    }
]