[
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/13/2021",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407954,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SHUDDER. THIS IS A COMMON PROBLEM WITH THIS CAMARO. A LOT OF PEOPLE ONLINE ARE EXPERIENCING THE SAME THING. THE TRANSMISSION SHUDDERS WHEN DRIVING IT. EVEN AFTER SERVICING THE FLUID ETC... IT HAS TO BE THE WAY THEY DESIGNED THE TRANSMISSION.",
        "vin": "1G1FB3DX1J0"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/02/2021",
        "dateOfIncident": "03/20/2021",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406117,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CAMARO'S REAR COMPARTMENT FUSE BOX IS UNDER THE MAT IN THE TRUNK. SOMEHOW THE WATER GOES INSIDE THE TRUNK, WHICH IS EXPECTED BECAUSE THE TRUNK IS FOR STORAGE OR TRANSFER G THE GROCERY. SHORT CKT HAPPENS BECAUSE OF THAT. MOREOVER, THE TRUNK DOOR GETS OPEN WHILE DRIVING AND GETTING SMOKE AND GETTING 100% OF CHANCE OF FIRE IF I DON'T TAKE A NECESSARY STEP. I THINK IT IS A MANUFACTURING DEFECT AND VERY DANGEROUS FOR ANOTHER DRIVER TOO BECAUSE THE LOCATION OF THAT MODULE IS AT THE WRONG PLACE.",
        "vin": "1G1FB1RS4J0"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/08/2021",
        "dateOfIncident": "12/21/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395131,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET CAMARO. THE CONTACT STATED THAT ON SEVERAL OCCASIONS, THE VEHICLE WOULD NOT START. THE CONTACT STATED THAT THE INSTRUMENT PANEL AND ON-STAR SERVICE FAILED TO OPERATE AS DESIGNED. THE DOORS FAILED TO OPEN AND VARIOUS ELECTRICAL FAILURES OCCURRED REMOTELY. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER LINDSEY CHEVROLET LOCATED AT 15605 JEFFERSON DAVIS HWY, WOODBRIDGE, VA 22191, WHO WAS UNABLE TO DETERMINE THE CAUSE OF THE FAILURE. THE CONTACT INDICATED THAT THE VEHICLE HAD BEEN HACKED AND A POLICE REPORT WAS FILED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 67,000.*DT",
        "vin": "1G1FD1RS9J0"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/21/2021",
        "dateOfIncident": "01/18/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389176,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SIDE DOOR STARTED MAKING A KNOCKING NOISE AND THE WINDOW WOULD NOT SHUT ALL THE WAY.  THE DOORS WOULD START UNLOCKING ON THEIR OWN AND THE DRIVER WINDOW WOULD TRY  TO ROLL ALL THE WAY UP UNSUCCESSFULLY. THE CONTROL PANEL WOULD FLASH A NOTICE THAT THE DOOR WAS UNLOCKED AND THE INTERIOR LIGHTS STAYED ON WHILE DRIVING AND WHEN PARKED AND ENGINE TURNED OFF. ONE EVENT LASTED 45 SECONDS WHILE I WAS DRIVING ON THE INTERSTATE HIGHWAY AND ANOTHER EVENT WHILE I WAS SITTING AT MY LOCAL CHEVROLET SERVICE CENTER. THIS EVENT HAPPENED WHILE THE REMOTE KEY WAS SITTING ON THE DASH IN SERVICE CENTER ENVELOPE AND THE CAR WAS OFF. THE DOORS STARTED UNLOCKING AND LOCKING AND DRIVER WINDOW STARTED GOING UP AND DOWN. THEN ALL THE DOORS LOCKED WITH ME INSIDE OF THE CAR AND I COULD NOT OPEN THE DOOR TO GET OUT ALL WHILE THE INTERIOR LIGHTS STAYED ON. I RECORDED THE EVENTS AS THEY OCCURRED BUT THEY ARE IN ,MP4 FORMAT AND I AM UNABLE TO UPLOAD THEM.",
        "vin": "1G1FB1RS4J0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/21/2021",
        "dateOfIncident": "01/31/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389336,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION ISN'T CONTROLLED WELL. WHEN COMING TO A COMPLETE STOP THE TRANSMISSION TENDS TO SHIFT TO 1ST GEAR VIOLENTLY WHICH MAY CAUSE THE VEHICLE TO MOVE FORWARD AND HIT A CAR IN FRONT OF YOU. 2018 CAMARO 2.0",
        "vin": "1G1FB3DXXJ0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/20/2020",
        "dateOfIncident": "10/09/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384243,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CAME IN DUE TO AN EXHAUST RATTLE ISSUE ON MY VEHICLE. THE ISSUE WAS DUPLICATED BY THE DEALERSHIP, AND THEY INFORMED ME THAT THERE IS A LEAK IN THE EXHAUST SYSTEM THAT IS CAUSING THIS RATTLE NOISE. THE LEAK IS IN THE CENTER OF THE EXHAUST PIPE, UNDERNEATH THE CENTER CONSOLE. I WAS TOLD BY THE DEALERSHIP THAT THE VEHICLE IS SAFE TO OPERATE, HOWEVER THAT IS NOT MY EXPERIENCE. THERE IS EXCESSIVE NOISE COMING FROM THE EXHAUST CAUSING DISTURBANCE IN MY NEIGHBORHOOD, AND ALSO THE SMELL OF EXHAUST GAS IS AT TIMES APPARENT IN THE CABIN. THIS ISSUE HAS NOT BEEN RESOLVED FOR OVER 2 MONTHS NOW, WITH DEALERSHIP CONTINUING TO PUSH THE DELIVERY DATE OF THE PART ON A WEEKLY BASIS, WITHOUT PROVIDING ANY INTERIM SOLUTION TO ADDRESS THE PROBLEM UNTIL THE PART IS AVAILABLE.",
        "vin": "1G1FC1RS6J0"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/30/2020",
        "dateOfIncident": "03/30/2020",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377069,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET CAMARO. THE CONTACT STATED THAT AFTER PARKING, TURNING OFF THE VEHICLE, AND THEN EXITING THE VEHICLE, THE CONTACT BECAME AWARE OF SMOKE COMING FROM THE TRUNK OF THE VEHICLE. THE CONTACT WAS UNAWARE OF THE CAUSE OF THE SMOKE. THE CONTACT ATTEMPTED TO UNLOCK THE TRUNK OF THE VEHICLE HOWEVER, THE TRUNK FAILED TO UNLOCK. THE CONTACT STATED THAT AFTER A WHILE, THE SMOKE EVENTUALLY DISSIPATED. RICK HENDRICKS CHEVROLET OF ATLANTA (3277 SATELLITE BLVD, DULUTH, GA 30096, (678)497-4598) WAS CONTACTED AND THE CONTACT WAS ADVISED TO TOW THE VEHICLE TO THE DEALER TO BE DIAGNOSED. THE CONTACT WAS INFORMED BY THE SERVICE ADVISOR THAT THE FUSE BOX WAS COMPLETELY CORRODED DUE TO WATER INTRUSION INSIDE OF THE TRUNK OF THE VEHICLE IN NEAR PROXIMITY TO THE FUSE PANEL. THE CONTACT WAS INFORMED THAT THE FUSE BOX, WIRING HARNESS, AND A MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED HOWEVER, THREE MONTHS LATER THE SAME FAILURE RECURRED. THE VEHICLE WAS TAKEN BACK TO THE SAME DEALER HOWEVER, THERE WERE NO ADDITIONAL REPAIRS PERFORMED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 41,441.",
        "vin": "1G1FB1RXXJ0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/29/2020",
        "dateOfIncident": "11/26/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376919,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON OR ABOUT NOVEMBER 26, 2020, AT 1:30 AM  WHILE DRIVING ON I-30 WESTBOUND IN TEXARKANA, TX TRAVELING AT THE POSTED SPEED OF 75 MPH IN A 2018 CAMARO ZL1. THE TRANSMISSION BLEW OUT WHILE IN CRUISE CONTROL AND ALL SYSTEMS THAT TRANSMIT POWER FROM THE ENGINE OR PROPULSION DEVICE TO THE WHEELS WERE LOST AND THE VEHICLE HAD TO COAST ONTO THE EMERGENCY SHOULDER UNTIL IT CAME TO A COMPLETE STOP AWAY FROM ONCOMING TRAFFIC. I HAD CONTACTED CHEVY EMERGENCY ROADSIDE ASSISTANCE THROUGH THE VEHICLES ONSTAR AND THIS SERVICE WAS OF NO AVAIL. AS AN ALTERNATIVE I HAD TO UTILIZE TRIPLE A IN ORDER TO HAVE THE VEHICLE TOWED TO ORR CHEVROLET SERVICE DEPARTMENT TEXARKANA, TX  THIS VEHICLE SERIES HAS THE TR6060 TRANSMISSION IS FOR 6 SPEED MANUALS WHICH IS MANUFACTURED BY TREMEC CONTAINS DEVICES AND SYSTEMS THAT TRANSMIT POWER FROM THE ENGINE OR PROPULSION DEVICE TO THE WHEELS. THEREFORE, WHEN SHIFTING BETWEEN NEUTRAL, 1ST - 2ND  GEAR AND BACK TO  NEUTRAL ENCOUNTERED NUMEROUS EVENTS WHEREIN THE SHIFTING MECHANISM GRINDS AND/OR DROPS BACK INTO NEUTRAL WHILE THE VEHICLE IS IN MOTION, WITH NOTABLE FLUTTERING OF THE SHIFTER AND RUBBING OR FRICTION NOISE THIS IS ASSOCIATED WITH THE SYNCHRONIZERS. THE  THIS IS EXTREMELY DANGEROUS WHEN PULLING IN TRAFFIC AND OPERATING A VEHICLE IN THIS MANNER IS ONLY A MATTER OF TIME BEFORE A MAJOR ACCIDENT ENSUES.   CONSUMERS SIMILARLY COMPLAINED ABOUT THE DEFECT ON VARIOUS ONLINE FORUMS,  HTTPS://WWW.CAMARO5.COM/FORUMS/SHOWTHREAD.PHP?T=199040  HTTPS://WWW.CAMARO5.COM/FORUMS/SHOWTHREAD.PHP?T=261882&PAGE=2  HTTPS://WWW.CAMARO5.COM/FORUMS/SHOWTHREAD.PHP?P=4415830&POSTED=1#POST4415830  HTTPS://WWW.CAMARO5.COM/FORUMS/SHOWTHREAD.PHP?T=199533",
        "vin": "1G1FJ1R68J0"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/29/2020",
        "dateOfIncident": "10/11/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366973,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER SHIFTING INTO PARK THE DISPLAY SHOWS ACTION REQUIRED SHIFT TO PARK AND WILL NOT SHUTOFF THE IGNITION. (STATIONARY/PARKED)",
        "vin": "1G1FB3DX7J0"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/21/2020",
        "dateOfIncident": "08/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360361,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS TO DOCUMENT AND REPORT THAT I PURCHASED MY 2018 CHEVY CAMARILLO ON APRIL 15, 2020 WITH 18,000 MILES. MY CAR ACCIDENT OCCURRED ON AUGUST 20, 2020 AT APPROXIMATELY 6:15PM. IT WAS A CLEAR EVENING AS I WAS ON MY WAY HOME FROM WORK. I WAS STOPPED AT THE INTERSECTION, READY TO TURN RIGHT TO CATCH THE FREEWAY ENTRANCE. AS I PROCEEDED TO TURN RIGHT, FROM A TWO LANE RIGHT TURN LANE, I RELEASED MY FOOT FROM THE BRAKE AND BEGAN ATTEMPTING THE RIGHT HAND TURN. THE STEERING WHEEL BECAME DRASTICALLY HARDER AND ULTIMATELY IMPOSSIBLE TO TURN TO CONTROL CAUSING  ME TO HOP THE CENTER ISLE HITTING A CENTER DIVIDER. A CHP OFFICER PATROLLING THE AREA, WHO WITNESSED THE ACCIDENT, CONFIRMED I WAS NOT SPEEDING AS HE NOTED THERE WERE NO SIGNS OF TREAD MARKS TO SUGGESTS I WAS SPEEDING. ADDITIONALLY, NO ACCIDENT REPORT WAS TAKEN. BY PURE LUCK, I DID NOT HIT OR INJURE ANOTHER VEHICLE OR PROPERTY. I DID HOWEVER, SUSTAIN BRUISING FROM THE AIRBAGS DEPLOYING, BACK PAIN AND OTHER ACHES. I REVIEWED THE HISTORY OF THE CHEVY CAMERON'S TO CONFIRM THAT ALTHOUGH NOT A RECALL AT THE TIME OF MY ACCIDENT, I TRULY AND HIGHLY ENCOURAGE THAT THE 2018S ALSO BE LOOKED AT FOR THE SAME RECALLS ISSUED WITH THE 2016 AND 2017 RECALLS.",
        "vin": "1G1FB1RS1J0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/01/2020",
        "dateOfIncident": "08/24/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352463,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "RAN INTO A SMALL POTHOLE.  THE FRAME OF THE CAR BROKE CAUSING DIFFICULTIES WITH STEERING AND STABILITY. POOR DESIGN AND MATERIALS WILL NOT STAND NORMAL DRIVING CONDITIONS",
        "vin": "1G1FB1RS7J0"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/28/2020",
        "dateOfIncident": "08/25/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351753,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2018 CAMERO THAT I BOUGHT BRAND NEW. I KEEP UP MY SERVICE ON MY CAR. ONE DAY I NOTICED A SMOKEY SMELL WHEN I CRANK THE CAR. THE CAR STARTED TO HESITATE TO START AT TIMES. I TOOK THE CAR IN FOR SERVICE ABOUT 3 WEEKS AGO  AND SHOWED THEM THE ENGINE LIGHT SENSOR WAS ON AND TOLD THEM MY CAR WOULDN'T START FOR ABOUT 3 HOURS. THE SERVICE TECH TOLD ME IT WAS MY BATTERY. I REPLACED THE BATTERY AND THE CAR DROVE FINE BUT I STILL SMELLED FUMES WHEN I CRANK THE CAR AND SOMETIMES WHEN DRIVING IT ACTS LIKE IT WANTS TO SHUT OFF. ON 8/25/2020 MY CAR WOULDNT  START AGAIN. I HAD IT TOWED TO BOMIN CHEVROLET AND WAS TOLD THAT MY FUEL PUMP WENT OUT. I'M NOT UNDERSTANDING HOW A 2018 NEW CAR THAT'S NOT  TWO YEARS OLD FUEL PUMP GOES OUT.I RESEARCHED FOR RECALLS AND I NOTICED 11/21/2019 A RECALL WAS ISSUED FOR CHEVY CAMERO DUE TO FUEL PUMP ISSUES. PLEASE KNOW THAT IM NOT TRYING TO GET OUT OF PAYING FOR REPAIRS IF THAT'S NEED BE. I JUST WOULD LIKE AN INVESTIGATION PLEASE. I KNOW OF TWO OTHER FRIENDS THAT HAD THE SAME ISSUES WITH THEIR CAMERO. RIGHT NOW AT A TIME LIKE THIS DOING THIS PANDEMIC AND OUT OF WORK I CANT AFFORD TO PAY $1200 IN REPAIRS IF ITS A POSSIBLE DEFECT.  PLEASE HELP ME!",
        "vin": "1G1FB1RX8J0"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/09/2020",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338442,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET CAMARO. THE CONTACT STATED THAT WHILE DRIVING THE VEHICLE FAILED TO DRIVE IN A STRAIGHT LINE. THE CONTACT STATED THAT THE VEHICLE DRIFTED TO THE LEFT AND TO THE RIGHT CAUSING THE DRIVER TO OVER COMPENSATE WHILE STEERING. THE VEHICLE WAS TAKEN TO SEVERAL UNKNOWN DEALERS WHERE THE MECHANICS PERFORMED ALIGNMENTS AND TIRE ROTATIONS HOWEVER, THE FAILURE PERSISTED. THE MANUFACTURER WAS CONTACTED AND INFORMED OF THE FAILURE. THE CONTACT WAS INFORMED THAT THE VEHICLE WAS TRAMLINING WHICH WAS A NATURAL VEHICLE RESPONSE TO THE ROAD SURFACE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 18,000.",
        "vin": "1G1FB1RX3J0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/04/2020",
        "dateOfIncident": "06/09/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337486,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CONVERTIBLE TOP REAR WINDOW IS STARTING TO COME OUT. THE GLUE IS SEPARATING AND I HAVE SEEN 20 PLUS TOPS THAT ARE DOING THE SAME THING. THE DEALER SAYS THERE IS NO RECALL THE GLASS SHOP SAYS IT'S AN ABSOLUTE SAFETY HAZARD IT COULD BLOW OUT ON THE FREEWAY. THERE ARE PLENTY OF FORAMS TALKING ABOUT THIS ISSUE AS WELL. APPARENTLY THE TOP AND GLASS ARE ONE PIECE SO THE WHOLE TOP NEEDS TO BE REPLACED. THIS SHOULD BE A RECALL ISSUE AS IT IS SAFETY-RELATED. SOMEBODY COULD GET HURT IF THAT GLASS FLIES OUT ON THE FREEWAY",
        "vin": "1G1FB3DS4J0"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "06/29/2020",
        "dateOfIncident": "05/19/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11331383,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE CUTS OUT WHEN STARTING OUT IN 1ST GEAR. MANUAL TRANSMISSION. ENGINE STALLED EASILY. WAS REAR ENDED BECAUSE ENGINE CUT OUT WHEN STARTING FROM LIGHT AND TRUCK BEHIND ME DROVE INTO ME.",
        "vin": "1G1FJ1R61J0"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/29/2020",
        "dateOfIncident": "06/25/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331531,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING WHEN A LOSS OF POWER STEERING ALMOST CAUSED ME TO CRASH. IT MAKES IT VERY HARD TO TURN AND BECAUSE OF THE MILAGE THE DEALERSHIP WON'T COVER IT EVEN THOUGH IT'S HAVING THE SAME PROBLEMS AS THE RECALLED 2017 MODEL.  *TR",
        "vin": "1G1FE1R72J0"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/05/2020",
        "dateOfIncident": "06/04/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327371,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2018 CAMARO LT1 TURBO ON THE CITY IT WAS POURING REALLY BAD AND I WAS DRIVING CAREFULLY WHEN I FELT THE CAR PULLING TO THE SIDE A BIT BECAUSE THE ROAD WAS SLIPPERY AND THEN AS KEPT DRIVING A MESSAGE SAYING \"SERVICE POWER STEERING DRIVE WITH CARE\" POP UP. MY STEERING WHEEL IMMEDIATELY GOT HARD AND I HAD TO MAKE THE EFFORT TO TURN AND STOP AT A GAS STATION.  *TR",
        "vin": "1G1FA1RX5J0"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/20/2020",
        "dateOfIncident": "04/17/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11321739,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CHANGING LANES ON FREEWAY, CAR KICKED SIDEWAYS AND WE TRIED TO CORRECT THIS SLIDE.  CAR SEEMED TO ACCELERATE CAUSING US TO LEAVE THE HWY AND FLIP LANDING UPSIDE DOWN.",
        "vin": "1G1FJ3D61J0"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/23/2020",
        "dateOfIncident": "01/18/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11301502,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN THE FREEWAY AND THE DRIVER SIDE REAR TIRE LOCKS UP AND BRAKES BECOME HARD AS A ROCK, AND CAUSE ME TO SPIN OUT ON THE FREEWAY. RADIO CUT OFF AND FELT LIKE THE CAR WAS PICKING UP SPEED RATHER THEN SLOWING DOWN! ONSTAR THEN PROCEEDED TO TELL ME VIA EMAIL THERE IS AN ISSUE WITH MY ANTI BRAKING SYSTEM AND STABILITY TRAC SYSTEM AFTER THE CRASH.",
        "vin": "1G1FE1R74J0"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/24/2019",
        "dateOfIncident": "12/22/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291007,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CONVERTIBLE TOP REAR WINDOW DELAMINATES DUE TO FAULTY DESIGN AND/OR INSUFFICIENT BONDING OF GLASS TO FABRIC MATERIAL OF TOP. THIS HAS HAPPENED TO MY CAR TWICE WITHIN LESS THAN A YEAR. TOP WAS REPLACED ONCE AND NOW I NEED IT REPLACED AGAIN. GLASS COULD POTENTIALLY FALL INWARD TO INJURE A PASSENGER OR FALL OUT ONTO THE ROADWAY OR INTO A FOLLOWING VEHICLE. SO FAR GM'S SOLUTION HAS BEEN TO REPLACE THE CONVERTIBLE TOP WITH ANOTHER DEFECTIVE TOP.",
        "vin": "1G1FB3DS8J0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/15/2019",
        "dateOfIncident": "11/15/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280428,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "GRINDING SOUND COMING FROM THE REAR END,IT DOES IT WHILE TURNING WHEN THE CAR IS COLD OR SAT FOR A FEW HOURS, I'M WORRIED THAT IT'S GOING TO LOCK UP SOME DAY WHILE TRAVELING. I BOUGHT IT NEW AND THE NOISE STARTED AT ABOUT 4000 MILES, THEY CHANGED THE FLUID AND THE NOISE NEVER WENT AWAY, I TRY TO EXPLAIN IT WHEN I TAKE IT IN, BUT THEY'RE DRIVING IT AFTER IT'S WARMED UP , SO NO NOISES EVERY TIME, THANKS, AND I HEAR ABOUT THIS FROM OTHER OWNERS.",
        "vin": "1G1FF3D73J0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/09/2019",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279142,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON DOWNSHIFTING TO 2ND GEAR FROM 3RD GEAR IS VERY HARD , GRINDS AND POPS BACK IN NEUTRAL, AND FLUTTERING NOTICED ON THE SHIFTER WITH RUBBING OR FRICTION NOISE.",
        "vin": "1G1FE1R70J0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/27/2019",
        "dateOfIncident": "10/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271316,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS A DEFECTIVE TRANSMISSION HOUSING AND THE CAR IS HARD TO DOWNSHIFT OR UPSHIFT INTO 2ND GEAR. THE DEALERS ARE CALLING IT NORMAL. I HAVE MANUAL 6SPEED TRANSMISSION. WHEN I DOWNSHIFT, THE SHIFTING LIVER WILL EITHER POP RIGHT BACK UP INTO NUTERAL OR GRINDS.",
        "vin": "1G1FE1R70J0"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/15/2019",
        "dateOfIncident": "09/28/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268697,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "IF THE CAR IS NOT KEPT ON A CHARGING SYSTEM THE BATTERY CAN DRAIN WITHIN 48 HOURS - 2 WEEKS. WHEN I LEAVE THE CAR IN THE GARAGE WITH THE DOORS LOCKED FOR 48 HOURS THE BATTERY GOES DEAD. WHEN I LEAVE IT IN THE GARAGE FOR A WEEK UNLOCKED THE BATTERY IS DEAD. IT TOOK 45 MINUTES TO JUMP START IT.",
        "vin": "1G1FG1R79J0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/22/2019",
        "dateOfIncident": "07/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233871,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 2.0LITER TURBO HAS SHIFTING ISSUES I BELIEVE. IT IS VERY VIOLENT SHIFTING THROUGH GEARS WHEN FIRST START DRIVING AND SLOWING VEHICLE DOWN, AND SEEMS TO CAUSE LAG WHEN ACCELERATING IN EVERYDAY DRIVING.",
        "vin": "1G1FB1RX8J0"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/10/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206841,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE HAS BEEN AT KUNI CHEVROLET IN SACRAMENTO, CA SINCE 2/1/19 AND THEY HAVE BEEN UNABLE TO FIX THE PROBLEM, STABILITY CONTROL LIGHT ON, WHEN I DRIVE OVER A BUMP AT HIGHWAY SPEEDS IT CAUSED ME TO VEER ACROSS 2 LANES. THANKFULLY I DID NOT HIT ANOTHER CAR.",
        "vin": "1G1FB1RS2J0"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/22/2019",
        "dateOfIncident": "03/22/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190921,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHENEVER THE A/C IS RUNNING THE DEFROSTERS STAY OPEN AND BADLY FOG THE WINDSHIELD ON THE INSIDE...GM IS AWARE AND HAS FIXES THAT DO NOT WORK. I HAVE ATTEMPTED TO HAVE THE DEALER AND GM CORRECT IT (IT APPEARS TO BE EXTREMELY WIDESPREAD AS A PROBLEM)...GM RESPONDED THAT THE CAR FUNCTIONS AS IT WAS DESIGNED. I FIND IT DANGEROUS.",
        "vin": "1G1FH1R71J0"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/01/2019",
        "dateOfIncident": "02/16/2019",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183433,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE INTERSTATE, ABOUT 65 MPH, AND THE PHONE CHARGER CAUGHT FIRE AND EXPLODED.  I STOPPED THE CAR ON THE INTERSTATE TO EXTINGUISH THE FIRE ON MY PERSON.  THE CHARGER FELL UNDER THE PASSENGER SEAT, AND CAUGHT THE SEAT ON FIRE.  THE WHOLE CAR WAS CONSUMED BY THE TIME THE FIRE DEPARTMENT RESPONDED TO THE SCENE.",
        "vin": "1C3CDFCA1DD"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/22/2019",
        "dateOfIncident": "10/24/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11175471,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 CHEVY CAMARO. CONSUMER WRITES IN REGARDS TO DEFECTIVE RPM METER. *LD  *TR",
        "vin": "1G1FB1RSJ01"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/21/2018",
        "dateOfIncident": "08/21/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121332,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN USING THE WINDSHIELD DEFROSTER, INSTEAD OF CLEARING THE CONDENSATION, IT CREATES A VERY THICK AREA OF CONDENSATION ON THE INSIDE OF THE WINDSHIELD, REGARDLESS OF TEMPERATURE SETTING OR FAN SPEED. I HAVE TO CARRY A MICRO FIBER CLOTH TO CLEAR THIS CONDENSATION REPEATEDLY, EVEN WHILE DRIVING.",
        "vin": "1G1FG1R79J0"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/12/2018",
        "dateOfIncident": "12/28/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11078749,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS INVOLVED IN AN ACCIDENT 3 MONTHS AGO. GM DOES NOT MANUFACTURE REPLACEMENT CURTAIN AIRBAGS FOR THIS BRAND NEW VEHICLE. MY VEHICLE HAS BEEN SITTING AT REPAIR SHOP SINCE DECEMBER 28TH. ALL AIRBAGS WERE DEPLOYED AT TIME OF ACCIDENT. I HAVE NO RECOURSE, OTHER THAN TO TRY AND FIND USED AIRBAGS TO REPAIR MY CAR. APPARENTLY I ALSO HAVE TO SIGN A WAIVER TO HAVE MY CAR RELEASED FROM BODY SHOP. THIS IS UTTERLY UNACCEPTABLE THAT A HUGE MANUFACTURING COMPANY WOULD PRODUCE AN AUTO, AND NOT HAVE REPLACEMENT PARTS FOR IT. APPARENTLY THEY DO NOT HAVE A TIME FRAME FOR PRODUCTION. DO I HAVE ANY RECOURSE? THE VEHICLE WAS CUT OFF, AND SMASHED HEAD ON INTO A TREE ON A CITY STREET. MY CAR IS A CHEVROLET CAMARO ZL1.",
        "vin": "1G1FK1R61J0"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/08/2018",
        "dateOfIncident": "03/07/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076796,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAS STALLED NUMEROUS TIMES ATTEMPTING TO START FROM A STOP. VEHICLE HAS ALSO STALLED GOING UP DRIVEWAYS. ONLY WAY TO AVOID STALLING IS TO NOT APPLY THROTTLE OR RIDE THE CLUTCH WHICH IS GOING TO PREMATURELY WEAR SAID CLUTCH.",
        "vin": "1G1FJ1R68J0"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/12/2018",
        "dateOfIncident": "12/13/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062340,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS POWER ON TAKE OFF MANUAL TRANSMISSION",
        "vin": "1G1FJ1R62J0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/02/2017",
        "dateOfIncident": "08/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11042281,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE ZL1 TRIM PACKAGE, MANUAL TRANSMISSION CARS WHEN TAKING OFF FROM A STOP THE THE CARS TORQUE MANAGEMENT SYSTEM IS INCORRECTLY CONFIGURED AND SENSES WHEEL SLIP (EVIDENT ON THE ELSD SLIP GUAGE) AND CUTS ENGINE POWER AND CAUSES THE CAR TO BOG DOWN AND POTENTIALLY STALL. THIS IS ESPECIALLY DANGEROUS WHEN PULLING OUT INTO TRAFFIC AND IS A MATTER OF TIME BEFORE IT CAUSES AN ACCIDENT. THIS IS A KNOWN ISSUE AND DISCUSSED AT LENGTH ON NUMEROUS FORUMS. HERE IS A GOOD EXAMPLE.     HTTP://WWW.CAMARO6.COM/FORUMS/SHOWTHREAD.PHP?T=498180",
        "vin": "1G1FJ1R65J0"
    }
]