[
    {
        "components": "PARKING BRAKE,SEATS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/12/2021",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436408,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Chevrolet Sonic. The contact stated that operating the vehicle, the front driver side seat would erroneously slide forward causing the driver's knees to make contact with the dash panel. In addition, while driving at various speeds the vehicle had suddenly stalled. The vehicle was taken to the local dealer who diagnosed that the electronic control unit hardware was faulty. Also, the emergency brake cable was hanging low to the ground under the vehicle. The vehicle was not repaired. The local dealer was notified of the failures. The manufacturer was not contacted. The failure mileage was 28,000.",
        "vin": "1G1JB5FH8J4"
    },
    {
        "components": "ELECTRICAL SYSTEM,WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/03/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398829,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY RADIO TURNS OFF AND ON, ON ITS OWN. ALSO WHEN I HAVE MY BLUETOOTH TURNED ON FOR MY PHONE, IT GETS STUCK AFTER I HANG UP THE PHONE AFTER A CALL. I WAS DRIVING HOME FROM WORK ON A STATE ROAD.  MY RIGHT WHEEL BEARING WENT OUT AND I HAD TO REPLACE IT LAST YEAR.",
        "vin": "1G1JD5SH6J4"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/01/2020",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352415,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SEAT BELT DOES NOT CLIP OR WILL COME UNDONE AT ANY GIVEN TIME. I MADE THE DEALERSHIP AWARE OF THE CONCERN WHEN THE VEHICLE HAD APPROXIMATELY 39,000 MILES. THEY STATED THAT SINCE IT WAS OUT OF WARRANTY IT DID NOT QUALIFY FOR PRODUCTION DEFECT. THIS IS A SAFETY CONCERN THAT COULD ENDANGER THE LIFE OF A PERSON IF WEST BELT FAILS DURING A CRASH.",
        "vin": "1G1JD6SH6J4"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/05/2020",
        "dateOfIncident": "11/14/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316425,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TODAY I'M WRITING IN BEHALF OF CARITE OF OAKLAND PARK  I HAD A EMAIL CHAT WITH BRIAN MCCOY THE BRANCH OWNER OF THE COMPANY, I WAS TOLD BY HIM THAT THE CAR WAS PUT IN AS REPO STATUS, DUE TO ME GIVING THE CAR BACK. I FEEL MY LIFE WAS PUT IN DANGER NUMEROUS OF TIMES AND DUE TO THE NEGLIGENCE OF THE COMPANY I WAS NOT GIVEN A RELIABLE VEHICLE NOR WAS I TREATED AS A VALUED CUSTOMER...  GOOD DAY, I'VE MADE ALL ATTEMPTS REGARDING THIS SITUATION WITH CARITE I'M THE TIME ALLOWED.. I'M REQUESTING A FULL REFUND OF MY MONEY I'VE MADE IT CLEAR AND I DON'T WANT NOTHING ELSE FROM THESE PEOPLE AT THIS COMPANY. I'VE TOLD THE OWNER NOT TO HAVE THE CAR DELIVERED ON TODAY 2/8/20 HE STILL INSIST THE DRIVER GREG TO DO SO, I'VE REJECTED TO RECEIVE THE VEHICLE INSTEAD OF HONORING MY REQUEST I'M GETTING PHONE CALLS FROM OTHER PARTIES AT CARITE I GUESS TO RECONSIDER! NO, I WANT MY MONEY MY LIFE WILL NOT BE IN DANGER DUE TO THEY'RE NEGLIGENCE.. THANK YOU,THE ITEMS SUBMITTED ARE RECEIPTS OF PAYMENTS ALSO, THE DAY OF 1/20/20 I DROVE TO FORT LAUDERDALE ON THE ACCEPT ION OF GETTING THE AC REPAIRED AND THE WINDSHIELD. NOTHING TOOK PLACE FOR BEING THERE FOR 6 HOURS ONLY TO HEAD BACK HOME EXHAUSTED&#65533;&#65533; AND TO FINALLY GET 50 MILES HOME THE CAR STARTED TO BLOW WHITE EXHAUST FROM THE VENTS, I IMMEDIATELY CALLED CARITE AND SPOKE WITH KIM, WHO'S IN RESPONSIBLE FOR REPAIR AND MAINTENANCE. I TOLD HER WHAT WAS GOING ON AND THAT I'VE HAD ENOUGH. I GET HOME, WAKE UP THE NEXT DAY TO GO TO A DR APPOINTMENT ONLY FOR THE CAR TO NOT STAR! I LIFT THE HOOD SO MY NEIGHBOR COULD GIVE ME A JUMP AND THIS IS WHAT I FIND UNDER THE HOOD.. ( THE PLIERS NEXT TO THE BATTERY THAT WAS LEFT THERE AND I DROVE HOME WITH IT ON THE CAR THAT'S ALONE IT'S ENOUGH PUTS MY LIFE IN DANGER...",
        "vin": "1G1JG6SH6J4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/26/2019",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291401,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVING AN ISSUE WITH THE RADIO ITSELF, ITS WENT BLACK A FEW TIMES ON ME AS I WAS DRIVING. AND ALSO WHEN I WAS PARKED. NO RESPONSE ON IT AT ALL. IM AFRAID IF SOMETHING HAPPENS LIKE WHEN IM IN A WRECK AND WHEN I TRY TO CALL ONSTAR WHILE ITS NOT WORKING IM AFRAID OF IT NOT CONNECTING, AND ALSO IVE HAD ISSUES WITH THE WINDOW SWITCHES NOT ROLLING UP OR DOWN THE WINDOWS NO CLICKING NOISES WHEN I PUSH ON THE SWITCH ALL FOUR HAVE DONE IT, ACTING LIKE ITS NOT GETTING A ELECTRIC SIGNAL TO THE SWITCHES, WHAT I USUALLY DO WHEN THAT HAPPENS IS PULL THE CAR OVER TURN OFF THE IGINITION AND LET THE CAR SIT FOR 30 SECONDS THEN START THE CAR AND IT USUALLY WORKS. IVE ALSO CHECKED TO MAKE SURE THE SAFETY SWITCH AINT ON AND IT ISNT.",
        "vin": "1G1JD5SH5J4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/16/2019",
        "dateOfIncident": "09/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255556,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2018 CHEVROLET SONIC RADIO SCREEN WENT BLACK WITHOUT WARNING WHILE I WAS DRIVING. I LOST ALL FUNCTIONS THROUGH THE RADIO SCREEN. THIS HAPPENED A SECOND TIME IN ROUTE TO WORK WITHIN A FEW DAYS. I'M CONCERNED THAT THE RADIO MAY GO BLACK DURING AN EMERGENCY WHEN I NEED TO USE ON STAR.",
        "vin": "1G1JD5SG6J4"
    },
    {
        "components": "STEERING,WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/19/2019",
        "dateOfIncident": "01/31/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181140,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2018 SONIC IS NOT SAFE TO DRIVE IN THE SNOW. IT HAS NO TRACTION TO START FROM A STOPPED POSITION, NO TRACTION TO STOP AND NO ABILITY TO CONTROL STEERING OR TURNING.",
        "vin": "1G1JD5SH9J4"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/16/2018",
        "dateOfIncident": "11/16/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152052,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING NIGHT OPERATION, THE BACKLIGHT OF THE CENTER SCREEN IS SO BRIGHT IT CAUSES DIFFICULTY SEEING THE ROAD.  THE INSTRUMENT CLUSTER IS AT AN ACCEPTABLE LEVEL (AS ADJUSTED BY THE SWITCH TO THE LEFT OF THE STEERING WHEEL), BUT THE CENTER SCREEN IS STILL TOO BRIGHT.  A SIMPLE FLOATING SOFTWARE BUTTON ALLOWING A DISPLAY OFF FUNCTION WOULD ADDRESS ISSUE.  AS IT IS, THE DISPLAY OFF FUNCTION IS HIDDEN IN A SUBMENU REQUIRING INATTENTION TO THE ROAD TO ACTIVATE.  *TR",
        "vin": "1G1JC5SB4J4"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "11/14/2018",
        "dateOfIncident": "10/11/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151389,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DRIVER SEAT DROPS A LEVEL WHILE I DRIVE . VERY DANGEROUS AND HAZARDOUS.",
        "vin": "1G1JD6SG4J4"
    }
]