[
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/09/2022",
        "dateOfIncident": "08/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455861,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Chevrolet Silverado 2500. The contact received a notification for NHTSA Campaign Number: 21V496000 (Equipment) however, the part to do the recall repair was unavailable. The dealer had been notified of the issue and confirmed that parts were not yet available. The manufacturer was made aware of the issue. The contact stated that the manufacturer had exceeded a reasonable amount of time for the repair. The contact had not experienced a failure. VIN tool confirms parts not available.",
        "vin": "1gc1kwey0jf"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/12/2022",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447167,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Chevrolet Silverado 2500. The contact received notification of NHTSA Campaign Number:  21V496000 (Equipment) however, the part to do the recall repair was unavailable.   The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact stated that he was informed that due to the vehicle being located in Florida where the vehicle was not prone to cold weather, he would not be receiving the repairs as a priority. The contact had not experienced a failure. VIN tool confirms parts not available.",
        "vin": "1gc1kxey1jf"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/17/2021",
        "dateOfIncident": "07/08/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425264,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2018",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Ewr Volpe Acme Inc.",
                "productMake": "TBD",
                "productModel": "TBD",
                "productYear": "9999",
                "type": "Vehicle"
            }
        ],
        "summary": "Goodyear Wrangler SR-A (LT265/60R-20) Experienced sudden and hard steering wheel shake at 35mph. Belt separated in tires causing bulging on the outside half of the tread on Driver Side Rear Tire. Cupping apparent prior to separation on all 4 tires. Tires were properly inflated and were still maintaining proper PSI after belt separation.",
        "vin": "1GT12UEY8JF"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/18/2021",
        "dateOfIncident": "03/06/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403739,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET SILVERADO 2500. THE CONTACT STATED THAT WHILE AT A COMPLETE STOP WITH THE BRAKE PEDAL ENGAGED, THE CONTACT FELT THAT THE BRAKES WAS DISENGAGING, CAUSING THE VEHICLE TO START MOVING FORWARD. THE CONTACT DEPRESSED THE BRAKE PEDAL WITH EXTRA FORCE TO KEEP THE VEHICLE FROM MOVING FORWARD. THE CONTACT STATED THAT THE BRAKE FAILURE WAS EXPERIENCED ON SEVERAL OCCASIONS. THE VEHICLE WAS TAKEN TO RK CHEVROLET (2651 VIRGINIA BEACH BLVD, VIRGINIA BEACH, VA 23452, (757) 261-1661 TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE BRAKE MASTER CYLINDER WAS CONTAMINATED WITH POWER STEERING. THE VEHICLE WAS NOT REPAIRED. THE CONTACT ALSO WANTED IT NOTED THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 19V645000 (SERVICE BRAKES, HYDRAULIC) NOR 20V603000 (SERVICE BRAKES, HYDRAULIC). THE MANUFACTURER WAS CONTACTED AND INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS 84,200.",
        "vin": "1GC1KWEY5JF"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/19/2020",
        "dateOfIncident": "06/19/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329776,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VIBRATIONS AT 65-85 MPH. TRUCK SHAKES SO BAD IT'S UNSAFE TO DRIVE. *TR",
        "vin": "1GC1KVEY8JF"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/29/2020",
        "dateOfIncident": "03/18/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319681,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS NO PASSENGER SEAT BELT WARNING AUDIO OR VISUAL. THE DEALER SAID THAT THIS VEHICLE DOESN'T HAVE A SENSOR TO TELL IF SOMEONE IS IN THE SEAT OR NOT. BUT THEY \"ASSURED\" ME THAT THE PASSENGER AIR BAGS STILL WOULD WORK. EVEN THOUGH IT HAS BEEN SHOWN THAT AIR BAGS BY THEM SELVES ARE NOT AS EFFECTIVE. I READ THAT CHEVROLET OFFERED TO INSTALL AN ON OFF SWITCH FOR THE AIR BAGS, THE WRONG THING TO DO IN MY OPINION. THE SEAT BELT WARNING SYSTEM SHOULD BE A REQUIREMENT NOT AN OPTION.",
        "vin": "1GC1KWEY0JF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/25/2020",
        "dateOfIncident": "01/09/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311466,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET SILVERADO. THE CONTACT STATED THAT WHILE DRIVING AT UNDISCLOSED SPEEDS OR WHILE AT IDLE, THERE WAS AN ABNORMAL SOUND COMING FROM THE VEHICLE. THE VEHICLE WAS TAKEN TO MANKATO MOTORS LOCATED AT 1815 MADISON AVE, MANKATO, MN 56001, WHO INFORMED THAT CONTACT THAT THE SOUND WAS NORMAL WHILE THE VEHICLE WAS IN OPERATION. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 23,277.",
        "vin": "1GC1KVEG4JF"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/25/2020",
        "dateOfIncident": "02/25/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311544,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CHECK ENGINE LIGHT COMES ON AT 27600 MILES WHILE DRIVING  AND THIS NOT 1ST TIME THIS HAS HAPPEND .ONCE THE ENGINE LIGHT IS ON THE TRUCK THEN LOSES POWER DETUNNING THE VEHICLE CAUSING THE VEHICLES POWER TO NOT BE AS STRONG AS IF ENGINE IS IN LIMP MODE.AT 24000 MILE TRUCK WENT INTO SHOP FOR SAME ISSUE AND GM REPLACE ALL INJECTORS HOPING THIS WOULD BE THE FIX ..PRIOR TO 24000 MILES AT 23600 MILE 1 INJECTOR  WAS REPLACE .I HAVE NOW PLACED 3600 MILES DRIVEN BEFORE LIGHT DECIDED TO COME BACK ON WITH ALL INJECTORS REPLACED AND NOW CODES P1089 ,AND NOW MY TRUCK IS SHOW NUMBER OF CODES INCLUDING B1011 , B1325 AND U0164 BOTH THIS TRUCK WITH JUST SHY 21000 MILE AND START TO WONDER WHY LAST CUSTOMER MAY HAVE TRADED HIS SELF",
        "vin": "1GC1KWEY6JF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/11/2020",
        "dateOfIncident": "04/23/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308569,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET SILVERADO HD. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V328000 (ENGINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED AUTONATION CHEVROLET SPOKANE VALLEY 8500 E SPRAGUE AVE, SPOKANE VALLEY, WA 99212 509) 720-8905, BUT WAS NOT REPAIRED. THE CONTACT HAD NOT EXPERIENCE A FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "1GC1KVEY4JF"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/06/2020",
        "dateOfIncident": "02/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307402,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BRIGHTNESS LEVEL FOR THE CENTER CONSOLE DISPLAY (RADIO, CLIMATE CONTROLS) CANNOT BE DIMMED. WHEN ADJUSTING THE VOLUME, CHANGING AIRFLOW, TUNING RADIO ETC, A BANNER IS DISPLAYED ALONG THE TOP OF THE SCREEN THAT IS SO BRIGHT IT IS ALMOST BLINDING AT NIGHT. IT SIGNIFICANTLY IMPAIRS NIGHT VISION. THERE NEEDS TO BE A DIMMING OPTION. THE BANNER IS THE SAME BRIGHTNESS REGARDLESS OF SPEED OR TIME OF DAY. CHEVY 2500 SILVERADO WT.",
        "vin": "1GC2KUEG4JZ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/29/2020",
        "dateOfIncident": "01/29/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302839,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET SILVERADO 2500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V328000 (ENGINE) HOWEVER, THE PARTS TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. AN UNKNOWN DEALER WAS CONTACTED AND IT WAS CONFIRMED THAT THE PART FOR THE RECALL REPAIR WAS NOT YET AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT WAS ALSO INFORMED THAT VEHICLES IN COLD WEATHER STATES WERE BEING REPAIRED. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "1GC1KUEY4JF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/07/2019",
        "dateOfIncident": "07/31/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287658,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "GM REMOVED MY ENGINE BLOCK HEATER IN JULY.  IT IS NOW DECEMBER AND THE FORECASTS CALL FOR SINGLE DIGIT TEMPERATURES.  CONTACTED GM AND THE DEALERSHIP AND THEY HAVE NO IDEA WHEN I WILL GET THE NEW ENGINE BLOCK HEATER INSTALLED.",
        "vin": "1GC1KWEYXJF"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/26/2019",
        "dateOfIncident": "11/26/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282519,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED NOTICE IF RECALL FOR ENGINE BLOCK HEATER ISSUE. CONTACTED DEALER AND ADVISED PARTS NOT AVAILABLE UNTIL LATE SPRING. HE FURTHER STATED PARTS WERE RELEASED TO NORTH MIDWEST ONLY BECAUSE THESE ARE COLD STATES. I CURRENTLY RESIDE IN NORTHERN NEVADA WHICH IS ALSO A COLD CLIMATE. ISSUE IS NOT RESOLVED!",
        "vin": "1GC1KVEY9JF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/15/2019",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280310,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET SILVERADO 2500. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 19V328000 (ENGINE). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED SHEPHERD'S CHEVROLET BUICK (1520 E 9TH ST, ROCHESTER, IN 46975, (574) 223-2136) AND WAS INFORMED THAT THE PARTS WERE NOT AVAILABLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS CONTACTED AND DID NOT ASSIST. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE VIN WAS INVALID.",
        "vin": "1GC1KWEY8JF"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,SEATS",
        "crash": false,
        "dateComplaintFiled": "06/10/2019",
        "dateOfIncident": "04/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218907,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN EVER THE VEHICLE IS IN MOTION. PASSENGER SEAT DOES NOT HAVE THE REMINDER OR WARNING SYSTEM TO ALERT THE OCCUPANT TO BUCKLE UP SHOULD THEY FORGET. MY DEALER STATES THE PASSENGER AIR BAG SYSTEM IS ACTIVE FULL TIME HOWEVER IT IS ONLY MARGINALLY EFFECTIVE SHOULD THE PASSENGER FAIL TO SECURE THEIR SEAT BELT. ADDITIONALLY, THERE IS NO DASH INDICATOR SHOWING THE PASSENGER SEAT BELT BUCLKE/NO-BUCKLE STATUS AS SHOWN ON PAGE 86 OF THE 2018 SILVERADO OWNERS MANUAL WHICH DISCUSSES THE PASSENGER SENSING SYSTEM AND AIRBAG STATUS INDICATOR WHICH IS NOT PRESENT IN THIS LINE OF VEHICLES. PAGE 145 OF THE 2018 SILVERADO OWNERS MANUAL STATES THERE \"MAY\" BE A REMINDER LIGHT NEAR THE AIRBAG STATUS INDICATOR WHICH IS NOT INSTALLED ON THIS LINE OF VEHICLES. VIEWING SIMILAR VEHICLES, THIS CONDITION IS PRESENT IN A MINIMUM OF MODEL YEARS 2017 THROUGH 2020 CHEVROLET AND GMC 2500/3500 HD CREW CAB VEHICLES. CONTACTED GENERAL MOTORS CUSTOMER SERVICE ON 4/10/2018 & 4/24/2018 FILED GM CASE [XXX]. GM REP CALLED BACK 4/30/2018 AND THEIR SOLUTION WAS TO HAVE MY DEALERSHIP INSTALL AN AIRBAG ON/OFF SWITCH TO DISABLE THE AIRBAG. NOT A SUITABLE RESOLUTION TO THIS SAFETY ISSUE.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TT",
        "vin": "1GC1KWEY5JF"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/17/2019",
        "dateOfIncident": "05/07/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208187,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHEVROLET SILVERADO 2500. THE CONTACT RECEIVED A TEXT MESSAGE STATING THAT THERE WAS TRANSMISSION FAILURE. THE CONTACT STATED THAT THE VEHICLE WOULD DOWNSHIFT INDEPENDENTLY AND NOT EXCEED 35 MPH. ALSO, THE ENGINE RPMS REVVED AT A DANGEROUS LEVEL. OCEAN CITY CHEVROLET (2366 OCEAN HWY W, SHALLOTTE, NC 28459, (910) 364-9917) STATED THAT THE PART FOR THE REPAIR WOULD BE SHIPPED IN TWO DAYS; HOWEVER, THE CONTACT COULD STILL DRIVE THE VEHICLE SINCE THE FAILURE OCCURRED INTERMITTENTLY. THE PART THAT WAS REPLACED WAS A SENSOR TO THE TRANSMISSION TO AVOID THE SUDDEN DOWNSHIFTS. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 2,914.",
        "vin": "3GCUKREC0JG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/03/2019",
        "dateOfIncident": "05/03/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205552,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT  THIS TRUCK BRAND NEW IN SEPTEMBER 2018 AND HAVE BEEN HAVING PROBLEMS WITH THE TORQUE CONVERTER SINCE THE DAY WE BOUGHT IT.  IT  HAS FREQUENT MODERATED SHUDDERING AND OR LURCHING AT THE ACCELERATION SPEED OF ABOUT 30 MPH. ALMOST EVERYDAY AND SEVERAL TIMES PER DAY. I HAVE TAKEN IT TO THE DEALER SEVERAL TIMES, THEY SAY THERE IS A \"FLAW\" IN THE 2017-2018  TRUCKS BUT THERE IS NOT A FIX.  THEY SAY TO DRIVE THE TRUCK IN TOW HAUL AND THAT HELPS.  I DO NOT WANT TO DRIVE IN TOW HAUL, I FEEL IT IS HARD ON THE TRUCK TO DRIVE IN TOW HAUL ON A REGULAR BASIS. TOW HAUL IS SPECIFIC FOR TOWING. AND IT COMPROMISES THE FUEL ECONOMY.  I AM UNHAPPY THAT THERE IS A KNOWN PROBLEM BUT NO FIX WITH THE TORQUE CONVERTER.",
        "vin": "1GC1KWEY7JF"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/21/2019",
        "dateOfIncident": "10/08/2018",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181495,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MON OCT 8TH, 5PM, MY CHEVY SILVERADO 2500HD DIESEL TRUCK CAUGHT FIRE DRIVING DOWN A CITY ROAD(APPROXIMATELY 30MPH), WITH ME, MY 12YO DAUGHTER AND HER FRIEND IN IT. THE ENGINE DIED, AND I LOST POWER STEERING AND BRAKES. AFTER WRESTLING THE TRUCK TO THE SIDE FO THE ROAD, A PASSERBY DROVE BACKWARDS IN TRAFFIC TO ALERT ME THAT THE TRUCK WAS BURNING. IF NOT FOR HIM, WE MIGHT NOT HAVE GOTTEN OUT IN TIME. FLAMING FUEL WAS DRIPPING DOWN FROM IN THE CHASSIS, DRIVER SIDE, IN FRONT OF REAR WHEEL, APPROXIMATELY WHERE THE FUELING RECEPTACLE WAS. THE POOL OF BURNING FUEL ON THE GROUND COULD NOT BE EXTINGUISHED. A PASSERBY EMPTIED A 15LB FIRE EXTINGUISHER ONTO THE AREA, AND WAS NOT ABLE TO STOP THE FLAMING LEAKING FUEL. BY NOW, IT WAS LEAKING WITH THE INTENSITY OF A SMALL SHOWER HEAD. THE ENTIRE TRUCK BURNED TO THE GROUND RAPIDLY. THE TRUCK WAS TWO WEEKS OLD, WITH LESS THAN 1000 MILES. IT WAS UNMODIFIED.    GM, CHEVROLET, AND WESELOH CHEVROLET WERE UTTERLY UNCONCERNED, AND UNMOVED BY THIS DISASTER. THEY TREATED THE INCIDENT AS IF I HAD WRONGLY COMPLAINED THAT THE FLOOR MATS DIDN'T FIT CORRECTLY.    YOU CAN FIND A DETAILED DESCRIPTION OF WHAT HAPPENED HERE: HTTPS://BIT.LY/2XFBYEB",
        "vin": "1GC1KWEY5JF"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/16/2019",
        "dateOfIncident": "02/16/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11180552,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY TRUCK BRAND NEW.  I LOVE THIS TRUCK BUT I FEEL LIKE THERE MIGHT BE A PROBLEM OR SOMETHING GOING ON. MY VEHICLE WAS IN MOTION WHEN THIS STARTED.  I WAS DRIVING ON 02-16-2019 WITH MY BRAND NEW BABY GIRL JUST 7 WEEKS OLD WHEN SUDDENLY SOMETHING STARTED TO SMELL REALLY TOXIC AND IT FILLED THE ENTIRE TRUCK WITH WHAT SMELLED LIKE DIESEL FUMES.  SMELLS LIKE SOMEONE DUMPED 10 GALLONS OF FUEL INSIDE MY TRUCK.  THERE IS NO SAFE PLACE TO PULL OVER AND IT IS FREEZING OUTSIDE.  MY BABY IS SCREAMING AND GETTING EXPOSED TO THESE NITROGEN DIOXIDES IN LARGE AMOUNTS AND BREATHING IT IN. MY BABY'S CLOTHES AND BLANKETS SMELL LIKE FUEL, MY CLOTHES SMELL LIKE FUEL.  MY SEATS SMELL LIKE FUEL.  THE INSIDE OF MY TRUCK IS POISONING MY BEAUTIFUL DAUGHTER AND NOW I AM PANICKING BECAUSE THERE IS NO SAFE PLACE TO PULL OVER.  I DROVE FOR 20 MORE MINUTES BEFORE I FOUND A SAFE PLACE TO PULL OVER.  I CALLED A FRIEND TO COME GET MY BABY.  I CONTINUED TO DRIVE THE TRUCK HOME.  I THINK BABY IS OK BECAUSE I GOT HER OUT RIGHT AWAY.  I HAVE BEEN SICK EVER SINCE. MY HEAD HURTS AND I CAN NOT TALK RIGHT.  I DON'T FEEL GOOD.  I CALLED THE CUSTOMER SERVICE NUMBER 1 800 222 1020 AND THEY TOLD ME TO GO TO THE LOCAL DEALERSHIP FOR HELP.  WHEN I ARRIVED THEY TOLD ME THAT THEY COULD NOT HELP  ME BECAUSE IT WAS SATURDAY.  THEY LEFT ME STRANDED.  I HAVE ALWAYS LOVED CHEVY TRUCKS AND HAVE BEEN A LOYAL FAN AND LONG TIME CUSTOMER BUT THIS INCIDENT COULD HAVE KILLED MY DAUGHTER IF I HAD NOT BEEN SO CLOSE TO TOWN.  I WILL NEVER EVER FEEL SAFE IN THAT TRUCK AGAIN. EVEN IF CHEVY DOES FIX IT.  THIS WAS THE SCARIEST THING THAT HAS EVER HAPPENED TO ME.",
        "vin": "1GC1KWEY2JF"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/14/2019",
        "dateOfIncident": "01/31/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180113,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK WILL TO START IN COLDER WEATHER. DEALERSHIP TOLD ME DIESEL FUEL HAS FROZE.   SERVICE WRITER TOLD ME THAT THIS WAS THE FIFTH NEW DURMAX ENGINE THAT HAS HAD PROBLEMS AND SINCE THE REDESIGN OF FUEL PUMP THE ARE EXPERIENCING THIS .THERE IS NOTHING IN OWNERS MANUAL TELLING TO USE FUEL ADDITIVE OR WHEN. I WOULD LIKE TO NO IF THEY HAVE A FIX FOR THIS",
        "vin": "1GC1KWEY5JF"
    },
    {
        "components": "EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/13/2019",
        "dateOfIncident": "01/19/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11179826,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IN DRIVE ENTERING AN INCLINE THE ENGINE WILL LURCH TO A HIGHER GEAR.  ALSO WHEN DRIVING THE LIGHT IN THE FRONT PANEL WILL GO DARK.  CAN NOT READ SPEED, TACK, GAS LEVEL ALL BLACK.  ( FOR 30 SEC, 45 SEC THEN FOR AN HOUR AND A HALF) ALSO THE AIR-CONDITIONING WILL TURN ON AUTOMATICALLY WITHOUT ME TURNING IT ON AND NO INDICATOR IT IS ON.  THEN LATER THE AIR-CONDITIONING INDICATOR LIGHT WILL TURN ON .  STILL WITHOUT ME TURNING ON THE AIR-CONDITIONING. AT ALL TIMES TRUCK WAS IN MOTION ON STREET OR HIGHWAY.",
        "vin": "1GC1KVEY5JF"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/30/2018",
        "dateOfIncident": "01/27/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11082211,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE INTERMITTENTLY WILL NOT START.  DIC DISPLAYS SERVICE MESSAGES FOR POWER STEERING, STABILITRAK, AND TRAILERING.  WILL NOT START USING THE KEY OR REMOTELY USING GM APP OR WITH KEY FOB.  DEALER HAS ATTEMPTED TO FIX MULTIPLE TIMES AND CAN'T LOCATE THE PROBLEM.  GM REFUSES TO ACKNOWLEDGE THAT A PROBLEM EXISTS EVEN THOUGH I HAVE PROVIDED MULTIPLE VIDEOS DOCUMENTING THE NON-START CONDITION.  THIS HAS OCCURRED >6 TIMES IN 2 MONTHS.  EACH TIME UNDER DIFFERENT CONDITIONS - HOT VS COLD, AFTER A SHORT DRIVE AND AFTER A LONG DRIVE.  FIRST OCCURRED ON JAN 27, 2018 AND HAS HAPPENED APPROXIMATELY ONCE A WEEK SINCE THEN.",
        "vin": "1GC1KWEY2JF"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/31/2018",
        "dateOfIncident": "01/29/2018",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065989,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DIESEL L5P 2017-CURRENT. WHEN HAVING THE ENGINE BLOCK HEATER PLUGGED IN, I HAVE SEEN MULTIPLE TRUCKS BURN DOWN FROM HAVING A SHORT SOMEWHERE. I HAVE ALSO SEEN THE CORD FOR THE ENGINE BLOCK HEATER RUB AGAINST THE WIRING HARNESS AND RUB THE INSULATION OFF EXPOSING THE BARE WIRE. I BELIEVE WHEN THIS HAPPENS, AN ELECTRICAL ARCH JUMPS FROM THE WIRE TO GROUND A STARTING A FIRE. PLEASE INVESTIGATE ENGINE BLOCK HEATER CORD AND IT RUBBING AGAINST SHARP EDGES EXPOSING BARE WIRE.",
        "vin": ""
    }
]