[
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "03/23/2022",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458040,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Chrysler 300. The contact stated that the door panels on all four doors had started to independently separate from the door frame. She also stated that the center console had also began to separate. In addition, various electrical failures would occur while driving including the backup camera. The contact's boyfriend had taken the vehicle to an unknown dealer and was informed that there were no recalls on the vehicle. The manufacturer was also notified of the failure and she was given the same information as the dealer. The contact was then referred to the NHTSA for assistance. The vehicle had yet to be repaired. The failure mileage was unknown.",
        "vin": "2c3ccaag8jh"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/21/2022",
        "dateOfIncident": "03/21/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457700,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The vehicle's LCD screen has become delaminated which causes the control of the radio, air conditioning, navigation, and other features controlled by the \"radio\" portion of the car to become dysfunctional. The car will randomly beep, change air temperatures, start navigation, cause the loss of hands-free communication. This is a safety hazard as it causes the driver to be distracted in order to attend to the incessant beeping and issues related to AC/heat, navigation or radio (volume, etc.). This appears from Chrysler Forums to be an issue among a large group of Chrysler 300 Year Model 2018 owners.",
        "vin": "2C3CCAKG6JH"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/17/2022",
        "dateOfIncident": "11/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452484,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "My 2018 Chrysler 300 radio/infotainment/U connect system fails at the most inconvenient times. The screen will go black when backing causing the back-up camera to become inoperative, the system will drop phone calls, switch between radio stations, navigation will become inoperative. This has created some safety problems, especially when backing and using the navigation functions. It has also prevented me from using the hands free function when making and receiving phone calls. The touch screen started delaminating in November of 2021 and is progressively getting worse. Chrysler really needs to fix this problem before someone is injured.",
        "vin": "2C3CCAEG7JH"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/10/2022",
        "dateOfIncident": "08/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451340,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "My door panels are peeling away from the area where the trim and window meet on my driver side and passenger.  This is also causing problems with my door locking and it may also affect airbag deployment.  I feel that there needs to be a recall on these door panels, and they need to be installed properly.",
        "vin": "2C3CCAAG1JH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/17/2022",
        "dateOfIncident": "01/16/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447795,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The console monitor, which is part of the UConnect system, is experiencing a delamination of the screen. It started a few months ago at which time the problem was mainly cosmetic. The screen can be seen peeling away in the upper area.  For the past few weeks parts of the screen along the peeling line activates, as if someone was touching the screen. This happens sporadically, but is increasing in frequency. It has become extremely distracting while driving, as it suddenly changes audio inputs and channels. In navigation mode, it changes locations on the screen or tries to cancel my navigation.",
        "vin": "2C3CCAEG6JH"
    },
    {
        "components": "AIR BAGS,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/16/2022",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447649,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "UNKNOWN.  My door panels on all doors, aside from the drivers door are all warping away from the windows.  It has gotten so bad that my doors will not lock every time.  I have done a lot of research and apparently this is a safety issue b/c airbags have deployed unexpectedly, or have not deployed during accidents causing harm.   The fact that I am a single, female, traveling nurse and my doors will not lock at times is definitely NOT ok.  I took it to a shop when I had to get a scrape fixed and asked about the door panels.  They were the ones to tell me that this is such a huge problem with my make and model of car that they never are able to get parts in for months at a time, and even when they do it is the same parts that I have and people always come back with the same problem.  The fact that Dodge/Chrysler knows that this is an ongoing issue for their cars since 2014 and they refuse to fix the issue prior to putting them on the market is outrageous.   I paid almost $30,000 for this car with the expectations that it would be safe, look like it did when I first purchased it (as long as no accidents happened etc).  I am going to do whatever I can to make sure that this gets the attention it deserves b/c big cooperations like this should not be able to screw over their customers.  Especially when it puts our safety at risk.",
        "vin": "2c3CCAGG4JH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/06/2021",
        "dateOfIncident": "10/05/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442824,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Just recently purchased this used vehicle in August and the car has shut off a few times while driving. This is a safety issue. The check engine light does not come on at all.",
        "vin": "2C3CCAAG1JH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/24/2021",
        "dateOfIncident": "11/24/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441644,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The vehicle's LCD screen has become delaminated which causes the control of the radio, air conditioning, navigation, and other features controlled by the \"radio\" portion of the car to become dysfunctional. The car will randomly beep, change air temperatures, start navigation, make random phone calls, cause the loss of hands-free communication and turn on heated seats. The functionality of the backup camera is also dependent on this screen. This is a safety hazard as it causes the driver to be distracted in order to attend to the incessant beeping and issues related to AC/heat, navigation, telephone or radio (volume, random channel changing, etc.). This appears from Chrysler Forums to be an issue among a large group of Chrysler 300 Year Model 2018 owners. Chrysler will not replace just the screen. The only option given is replacement of the entire radio which costs $1200.",
        "vin": "2C3CCARGXJH"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/11/2021",
        "dateOfIncident": "11/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440148,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The vehicle's LCD screen has become delaminated which causes the control of the radio, air conditioning, navigation, and other features controlled by the \"radio\" portion of the car to become dysfunctional.  The car will randomly beep, change air temperatures, start navigation, cause the loss of hands-free communication.  This is a safety hazard as it causes the driver to be distracted in order to attend to the incessant beeping and issues related to AC/heat, navigation or radio (volume, etc.).  This appears from Chrysler Forums to be an issue among a large group of Chrysler 300 Year Model 2018 owners.  I am encouraging them to file a concern with your group and to ask for a recall of the car for this reason.",
        "vin": "2C3CCAEG7JH"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/22/2021",
        "dateOfIncident": "09/22/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433946,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns 2018 Chrysler 300. The contact stated that the inside door panel detached from the door frame. Additionally, the defroster failed to defrost the windshield. The vehicle was taken to the local dealer where it was diagnosed that the door panel needed to be replaced. The defroster was working as designed. The vehicle was not repaired. The manufacturer was notified of the failure and referred the contact to the dealer. The approximate failure mileage was 57,300.",
        "vin": "2C3CCABG8JH"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/05/2021",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431822,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The sunroof is leaking and water has ran into the radio causing the touchscreen to start going crazy and can not operate a lot of the functions it does. It ended up turning on defrost and fogging up the windshield and I ran into oncoming traffic. I have brought this to my dealer on multiple occasions and they will not repair said the car is out of warranty.it will also call people on the phone And trying to hang up have taken my eyes off the road and have had several close calls with it doing this.",
        "vin": "2c3ccabg4jh"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/24/2021",
        "dateOfIncident": "08/15/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430355,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "While I was driving the Uconnect infotainment system started touch inputting on the whole screen. It started changing the AC, the seat warmers, clock settings, phone, and just everything on the screen. I was very worried that something might happen since my little one was with me. I took it to the dealer. This seems very dangerous and I was shocked to find so many people online with the same problem and no recall on it. Screen seems like it has a bubble.",
        "vin": "2C3CCABGXJH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/10/2021",
        "dateOfIncident": "06/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428541,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Chrysler 300. The contact stated that the center console light would flash on and off while driving. The contact would restart the vehicle and the console would operate as designed however, the failure would return soon after restart. A dealer was not contacted. The manufacturer was not notified of the failure. The vehicle was not repaired. The failure mileage was approximately 20,000",
        "vin": "2c3ccagg1jh"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/30/2021",
        "dateOfIncident": "06/18/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423016,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Noticed water damage on rear driver side pillar had mechanic look found water comming in from sunroof track. the drain hose was still attached and unclogged water began to leak behind the rear grab handle and light. This seems to be a defect by manufacturer and have seen alot of the same complaints.i was worried the water could cause a short maybe fir behind headliner.",
        "vin": "2c3ccakg7jh"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/29/2021",
        "dateOfIncident": "04/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422843,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The radio, heat/AC unit, temperature moves up and down by itself, maps, etc...  Took my car to my local dealership for routine oil change. I inquired about why my radio was on a constant browse?  The technician explained that this has been a common issue with the Chrysler 300. Since then the issue has gotten worse. I feel if this is an issue that is happening in other Chrysler's maybe is should be fixed by Chrysler?  This is my second 300 I love my car but this issue in a 2018 300 S?  Help Please I did get an estimate from Myrtle Beach Chrysler Jeep  Jared Stickley Service Advisor  785 Jason Boulevard Myrtle Beach, SC 29577 843-448-1191  Estimate $1015.80 Part #z8396531AC  $810 Labor 1.0 $130 Tax & Shop Fee $1015.80",
        "vin": "2C3CCABGXJH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/17/2021",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417497,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONTACT OWNS A 2018 CHRYSLER 300. THE CONTACT STATED THAT WHILE SHIFTING FROM PARK TO REVERSE, THE VEHICLE JERKED AND SURGED WITHOUT WARNING. THE FAILURE ALSO OCCURRED WHILE DRIVING AT HIGHWAY SPEEDS. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER HOWEVER, THE MECHANIC WAS UNABLE TO DUPLICATE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 21,000.",
        "vin": "2C3CCAEG3JH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/28/2021",
        "dateOfIncident": "03/25/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405266,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "GPS LOST.",
        "vin": "2C3CCABG8JH"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/08/2021",
        "dateOfIncident": "02/18/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399682,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "A SOFTWARE UPDATE CAME ON MY SCREEN WHEN I DRIVING. I PUSHED THE UPDATE BUTTON ON THE SCREEN AND IT STARTED TO UPDATE IT STOPPED AT 44% AND THEN MY CAR BATTERY STARTED LOSING ITS CHARGE. AFTER A FEW DAYS THE BATTERY WAS DEAD AND HAD TO JUMP IT TO GET IT STARTED. I TOOK IT TO THE DEALER THEY SAID I WOULD HAVE TO PAY FOR IT. I CALLED UCONNECT THEY ASSIGNED ME A CASE NUMBER TO GIVE CHRYSLER WHERE MY CAR HAS BEEN FOR 5 DAYS.",
        "vin": "2C3CCAEG3JH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/05/2021",
        "dateOfIncident": "03/05/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399275,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE NAVIGATION SYSTEM SCREEN IS JUMPING ALL OVER THE PLACE AND CHANGING THINGS I HAVE NOT TOUCHED LIKE THE HEAT/AC, HEATED SEATS, STEREO, BLUETOOTH, AUX AND ANYTHING ELSE THAT IS CONTROLLED BY HE SCREEN. I HAVE NO WAY TO STOP IT. ALL OF THIS WHILE THE VEHICLE IS SITTIG STILL.",
        "vin": "2C3CCAEG2JH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/02/2021",
        "dateOfIncident": "03/02/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398685,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FACTORY INSTALLED NAVIGATION SYSTEM(DIGITAL/ANALOG INSTRUMENT CLUSTER) IS JUMPING ALL OVER THE PLACE. TURNING ON THINGS THAT I HAVE NOT TOUCHED. THE HEAT COMES ON THEN THEN THE AIR, THEN THE RADIO JUMPS FROM STATION TO STATION, THEN THE UCONNECT AND ANYTHING ELSE IT CAN CHANGING LIKE IT HAS GONE CRAZY. I CAN'T CONTROL ANY OF THE CONTROLS.",
        "vin": "2C3CCAAG7JH"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/24/2021",
        "dateOfIncident": "01/04/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389693,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE UCONNECT SCREEN THE PROTECT DELAMINATING IS BUBBLING AND EFFECTING THE SCREEN AND BACK UP CAMERA AND NAVIGATION.",
        "vin": "2C3CCAEG9JH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/11/2021",
        "dateOfIncident": "12/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387519,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TOP OF ALL MY DOOR PANELS ARE POPPING UP. ALSO, BACKUP CAMERA IS NOT WORKING...IT WAS STARTING TO TURN RED AND NOW IT IS BLACK AND SAYS CAMERA NOT DETECTED.",
        "vin": "2C3CCABT8JH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/09/2021",
        "dateOfIncident": "01/08/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387328,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IN MOTION THE BRAKES COME ON.  ON DASH BOARD IT SAID IN BOLD RED LETTERS [ !BRAKED ]  THEN  ONSTAR COME ON.  I DONT HAVE ONSTAR. THE CAR STOP IN MIDDLE OF ROAD.  WAS I HACK,",
        "vin": "2C3CCABGXJH"
    },
    {
        "components": "EXTERIOR LIGHTING,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "12/30/2020",
        "dateOfIncident": "12/19/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385634,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DEER STRIKE 68 MPH  FRONT DRIVERS SIDE BUMPER ,HOOD  BACK TO TIRE ALMOST TO WINDSHIELD, WAS ON 4 LANE ROAD AT 530 PM CST",
        "vin": "2C3CCAAG8JH"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/29/2020",
        "dateOfIncident": "11/27/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376965,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE FOUND THAT GOING AT LOWER SPEEDS, LIKE ACCELERATING FROM STOP, OR DRIVING THRU A PARKING LOT, THE TRANSMISSION JOLTS THE ENTIRE CAR. LIKE IT IS SLIPPING IN AND OUT OF GEAR. IT ALSO SEEMS TO SHIFT REALLY HARD IN TO SECOND GEAR, NOT ALL THE TIME BUT IS JUST GETTING WORSE. THE VEHICLE ONLY HAS 26000 MILES ON IT AND HAS BEEN SERVICED AT THE CORRECT INTERVALS.    ALSO ELECTRICAL ISSUES WITH PASSENGER SIDE WINDOW MOTOR, IT DOES NOT WANT TO ROLL UP. THIS HAS HAPPENED 4 OR 5 TIMES IN THE LAST 2 WEEKS. USB HOOK UP FOR OUR PHONE DOES NOT RECOGNIZE THE DEVICE, AFTER CHANGING TO A DIFFERENT PORT, STILL THE SAME RESULT.",
        "vin": "2C3CCARG2JH"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/29/2020",
        "dateOfIncident": "11/27/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376966,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD WIPERS TURN ON AND ONE SWIPE OF THE WINDSHIELD WHEN TURN SIGNAL APPLIED, THIS ISSUE IS DISTRACTING AND DANGEROUS WHEN MAKING A TURN, WHEN YOU DON'T EXPECT THEM TO COME ON.",
        "vin": "2C3CCARG2JH"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/24/2020",
        "dateOfIncident": "08/14/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376200,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "LIGHTS BLINKING IN THE CAR THE RADIO KEEPS MAKING NOISES SHAKING WHEN DRIVING THEY SAID IT WAS A POWER CONTROL MODULE",
        "vin": "2C3CCAEG5JH"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/05/2020",
        "dateOfIncident": "11/02/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373157,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE AIRBAG MESSAGE",
        "vin": "2C3CCAEG9JH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/16/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329158,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO SYSTEM IS NOT STABLE CONTINUOUSLY CHANGES WITHOUT TOUCHING THE SCREEN UCONNECT 8.4 OPERATION IS UNSTABLE.  *TR",
        "vin": "2C3CCABG9JH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/16/2020",
        "dateOfIncident": "12/29/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299760,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRICAL PROBLEM UNKNOWN",
        "vin": "2C3CCAEG3JH"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/11/2019",
        "dateOfIncident": "11/09/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279431,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING DOWN US HIGHWAY 19 AROUND 5:30PM 78 OUT AND I HEARD THIS LOUD BANG LIKE A SHOTGUN WENT OFF IN MY CAR. I THOUGHT SOMEONE HIT ME FROM THE REAR AND GLASS WAS EVERYWHERE. PULLED OVER AND TO FIND OUT MY PANORAMIC SUNROOF EXPLODED. THE SUNROOF WAS NOT OPEN. TOOK IT TO DODGE AND THEY SAID THAT THEY CAN'T DO NOTHING THAT I HAVE TO GO TO THREW MY INSURANCE COMPANY. CALLED DODGE DIRECT AND THEY SAID THE SAME THING. LOOKED ONLINE AND NOTICED A LOT OF THESE ARE HAVING PROBLEMS EVEN JEEPS CHRYSLER 300, NISSAN,MERCEDES. CAN'T BELIEVE THEY WOULD NOT FIX IT UNDER WARRANTY. KNOWING THIS ISSUE IS GETTING BIGGER.",
        "vin": "2C3CCABT4JH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/08/2019",
        "dateOfIncident": "11/08/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279081,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I CONTINUE TO SMELL GAS ON THE LEFT REAR SIDE OF THE CAR. CAR IS STATIONARY WHEN I SMELL GAS. I WASHED CAR ANY GAS TANK AND UNDER CAR THINKING I MAY HAVE WASTE GAS WHEN FUELING.  STILL SMELLED GAS AFTER I RETURNED HOME. WILL BE TAKING TO DEALERSHIP MONDAY. THIS HAS BEEN GOING ON FOR ABOUT TWO WEEKS.",
        "vin": "2C3CCAAGXJH"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "11/06/2019",
        "dateOfIncident": "09/17/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278386,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Hankook Tire & Technology Co., Ltd.",
                "productMake": "HANKOOK",
                "productModel": "OPTIMO H426",
                "productYear": "9999",
                "size": "255/45R20",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHRYSLER 300 EQUIPPED WITH HANCOCK OPTIMO TIRES, SIZE: 235/55R19 (NA). WHILE DRIVING, AN ABNORMAL CLUNKING NOISE WAS DETECTED AND THE VEHICLE SLID. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO STATED THAT THE TIRES NEEDED TO BE REPLACED. THE VEHICLE WAS TAKEN TO KOLOSSO CHRYSLER JEEP DODGE RAM (2701 W COLLEGE AVE, APPLETON, WI 54914, (920) 659-6064) WHERE IT WAS DIAGNOSED THAT THE STRUT AND STRUT MOUNT NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND DID NOT ASSIST. THE DOT NUMBER AND TIRE FAILURE MILEAGE WERE UNKNOWN. THE VIN WAS INVALID. THE VEHICLE FAILURE MILEAGE WAS 2,000.",
        "vin": "3002C3CCARG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/03/2019",
        "dateOfIncident": "09/10/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277816,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE OWNED A 2016 CHRYSLER 300 AND NOW A 2018, AND THE TRANSMISSIONS BOTH HAD ISSUES, BOTH CARS HAVE BEEN TAKEN TO DEALER 5 TIMES @ LUCAS-SMITH NEAR FESTUS MO. EITHER THEY DON'T HAVE THE SMARTS OR I NEED HELP GOING AND FIXING THIS CAR,,THIS THE REASON I TRADED FOR THE 2018,JUST HAVE A FACTORY REP CONTACT ME.,, THANKS",
        "vin": "2C3CCAAG2JH"
    },
    {
        "components": "WHEELS",
        "crash": true,
        "dateComplaintFiled": "10/31/2019",
        "dateOfIncident": "07/19/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11277407,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHRYSLER 300. WHILE DRIVING 5 MPH AND MAKING A LEFT TURN, THE FRONT PASSENGER SIDE WHEEL CONTINUED TO MOVE IN A STRAIGHT LINE. AS A RESULT, THE VEHICLE STRUCK A CURB. THE CONTACT'S DAUGHTER WAS SEATED IN THE REAR PASSENGER SEAT AND WAS NOT WEARING A SEAT BELT. HER DAUGHTER'S FACE STRUCK THE REAR PASSENGER SIDE WINDOW. MEDICAL ATTENTION WAS NOT RECEIVED. THE CONTACT STATED THAT AN UNKNOWN WARNING INDICATOR WAS ILLUMINATED. THE CONTACT PARKED THE VEHICLE ON THE SIDE OF THE ROAD BEFORE PROCEEDING TO HER DESTINATION. THE VEHICLE WAS TAKEN TO MAC HAIK DODGE CHRYSLER JEEP RAM (LOCATED AT 3207 S GENERAL BRUCE DR, TEMPLE, TX 76504, (254) 773-4556) WHERE IT WAS DIAGNOSED THAT THE FRONT PASSENGER WHEEL AND RIM NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. ON SEPTEMBER 28, 2019, WHILE DRIVING 35 MPH AND MAKING A LEFT TURN, THE FRONT PASSENGER WHEEL DETACHED FROM THE VEHICLE. AS A RESULT, THE CONTACT STRUCK A CURB. THE AIR BAGS DID NOT DEPLOY. THE PASSENGER SIDE BUMPER, FENDER, AND WHEEL WERE DAMAGED. THE CONTACT'S CHEST STRUCK THE STEERING WHEEL DUE TO THE IMPACT. THE CONTACT SOUGHT MEDICAL ATTENTION AT THE EMERGENCY ROOM FOR THE CHEST PAIN AND LOW BLOOD PRESSURE. A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS TOWED TO BODY SHOP. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 700.",
        "vin": "2C3CCAAG4JH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/28/2019",
        "dateOfIncident": "10/28/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271740,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 845RE TRANSMISSION IS CAUSING PROBLEMS OF GRINDING NOISES AND A HOWLING,AND FEEL OF GRINDING ON THE GAS PEDAL AT 40 MPH NO POWER AND THE CAR STUTTERS IN THE MORNING AT FIRST START IN DRIVE WHILE MOVING, I'VE HAD IT AT LUCAS SMITH IN FESTUS MO 3 TIMES AND CAN'T FIND WHAT'S GOING WRONG, THIS HAS HAPPEN IN MY 2016 CHRYSLER 300 AND NO SOLUTIONS WERE FOUND,,,IN MY RESEARCH OF THIS PROBLEM NO ONE ELSE HAS THIS PROBLEM BUT ME THAT'S STRANGE!! I OWN THE ONLY 2 CHRYSLER 300 WITH TRANSMISSIONS NOISES AND GRINDING,, PLEASE CONTACT ME SOON @ [XXX] BECAUSE THE CAR IS BACK IN SHOP TODAY OCT 28 2019.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "2C3CCAAG2JH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/25/2019",
        "dateOfIncident": "09/06/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258180,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CHRYSLER OPERATORS MANUAL/CHRYSLER.COM EXPLICITLY STATES THAT \"THE BLIND SPOT MONITORING (BSM) ZONE STARTS AT THE OUTSIDE REAR VIEW MIRROR AND EXTENDS APPROXIMATELY 20 FT (6 M) TO THE REAR OF THE VEHICLE.\"  NONE OF CHRYSLER'S MANUFACTURED VEHICLES MEETS THIS SAFETY SPECIFICATION. INSTEAD, THE BSM DETECTS A VEHICLE APPROACHING FROM EITHER SIDE LANE ONLY WHEN THE VEHICLE APPROACHES THE BSM  VEHICLE AFTER IT HAS REACHED THE BSM EQUIPPED VEHICLE'S REAR BUMPER, OR JUST 6 TO 7 FEET BEHIND THE REAR VIEW SIDE MIRRORS, INSTEAD OF THE PUBLISHED 20 FEET. THIS IS A SERIOUS SAFETY ISSUE THAT DOES NOT ALLOW ENOUGH TIME FOR THE DRIVER OF THE BSM EQUIPPED VEHICLE TO CHANGE LANES SAFELY. CHRYSLER IS ERRONEOUSLY STATING/PUBLISHING SPECIFICATIONS TO THE PURCHASERS OF THEIR SAFETYTEC PRODUCTS THAT CANNOT AND ARE NOT MET BY THE CURRENT MONITORING SENSORS. THE BSM SYSTEM IS PART OF CHRYSLER'S SAFETYTEC PLUS GROUP PACKAGE THAT HAS A MSRP VALUE OF $2995. I HAVE DRIVEN OTHER VEHICLES WITH THE CHRYSLER BSM PACKAGE AND NONE OF THE DRIVEN VEHICLES MEET CHRYSLER'S DESCRIPTION/ SPECIFICATIONS FOR THE BSM TO ALERT THE DRIVER OF AN ONCOMING PASSING VEHICLE. THE BSM SYSTEM DOES ALERT THROUGH TRIANGLE LIGHTS ON THE SIDE REAR VIEW MIRRORS AND AUDIBLY ALERTS THE DRIVER, BUT NOT UNTIL THE ONCOMING VEHICLE IS NEXT TO THE CAR EQUIPPED WITH THE BSM SAFETY. THE BSM ALERT COMES ON TOO LATE TO PREVENT AN ACCIDENT. THE BSM SYSTEM DOES NOT PERFORM AS DESCRIBED BY CHRYSLER PUBLICATION AND DEALER DESCRIPTION TO NEW CAR PURCHASERS. IN ADDITION, I DROVE JEEPS AND OTHER 300 VEHICLES EQUIPPED WITH BSM AND EACH OF THESE VEHICLES HAD THE SAME SAFETY CONCERNS. I MET WITH THE SUPERVISOR OF SERVICES AT MY CHRYSLER DEALERSHIP AND WE WENT FOR A TEST DRIVE. HE STATED THAT THE BSM IS MONITORING AND WORKING AS DESIGNED, BUT NOT AS EXPLICITLY SPECIFIED CHRYSLER IN CHRYSLER PUBLICATIONS AND OWNER AND OPERATING MANUALS.",
        "vin": "2C3CCAKG2JH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/08/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253989,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE PANELS ON ARE ALL FOUR DOORS ARE LIFTING",
        "vin": "2C3CCAEG3JH"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/22/2019",
        "dateOfIncident": "08/22/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245668,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT COMES ON, VEHICLE HAS NO POWER, CAN'T ACCELERATE.  SHOWS CODES P0340 P0365 U1428.  THIS IS THE SECOND TIME THIS HAS HAPPENED WITH THIS VEHICLE!  I WAS ON THE FREEWAY AND THE ACCELERATOR PEDAL IS TOTALLY UNRESPONSIVE. HOLDING IT TO THE FLOOR KEPT THE SPEED STEADY UNTIL I WAS ABLE TO PULL OFF THE SIDE OF THE ROAD.",
        "vin": "2C3CCAGG9JH"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/21/2019",
        "dateOfIncident": "08/21/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245432,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD WIPERS STARTED COMING ON WHILE USING THE TURN SIGNAL AT NIGHT WHILE DRIVING HOME.  THE VERY NEXT MORNING STARTED THE CAR AND THE WINDSHIELD WIPERS WOULD NOT TURN OFF. HAD TO PULL THE FUSE TO STOP.",
        "vin": "2C3CCABG3JH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/17/2019",
        "dateOfIncident": "09/21/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232720,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE SEVERAL 'BUGS' WITH STEREO/NAV/UCONNECT. RADIO PRESETS DISAPPEAR. NAV VOLUME DECREASES ON ITS OWN. BLUETOOTH USE INTERRUPTS NAV...MY LOCAL DEALER AND 'UCONNECT CASE MANAGER' TOLD ME MONTHS AGO THAT I NEED A NEW SYSTEM YET IT HASN'T BEEN APPROVED/ORDERED. VERY DISAPPOINTED WITH CHRYSLER CUSTOMER SERVICE.",
        "vin": "2C3CCAPT1JH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/20/2019",
        "dateOfIncident": "06/20/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221457,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRONIC STABILITY CONTROL WARNING LIGHT CAME ON.  THE VEHICLE WOULD NOT ACCELERATE EVEN WITH THE GAS PEDAL PUSHED TO THE FLOOR.  THIS IS VERY DANGEROUS!!!!  I WAS GOING 35 IN THE RAIN ON THE FREEWAY WHEN THIS OCCURRED. TRAFFIC STARTED TO SPEED UP AND I COULD COULD NOT ACCELERATE TO KEEP UP WITH TRAFFIC.  IT TOOK OVER A MILE TO GET UP TO SPEED.  IF SOMETHING SHOULD FAIL, IT SHOULD NOT MAKE THE CAR UNSAFE TO OPERATE.",
        "vin": "2C3CCAGG9JH"
    },
    {
        "components": "POWER TRAIN,WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/18/2019",
        "dateOfIncident": "06/02/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220967,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHRYSLER 300. WHILE ATTEMPTING TO REVERSE OUT OF A PARKING SPACE, THE CONTACT HEARD A LOUD SOUND  THAT ENDED IN A BOOM. AFTERWARDS, THE VEHICLE IDLED AND WOULD NOT ENGAGE IN DRIVE. AFTER MANY ATTEMPTS, THE VEHICLE SHIFTED INTO DRIVE AND WAS DRIVEN TO THE CONTACT'S RESIDENCE. THE FOLLOWING DAY, THE VEHICLE WAS TAKEN TO OURISMAN CHRYSLER (2406 CRAIN HWY, BOWIE, MD 20716) WHERE A NAIL WAS FOUND IN THE REAR PASSENGER TIRE. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 21,000.     THE CONSUMER STATED THE VEHICLE WAS PLACED IN DRIVE BUT, INSTEAD THE VEHICLE BEGAN REVERSING. *JS",
        "vin": "2C3CCAAG2JH"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/31/2019",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217204,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL",
        "vin": "2C3CCABG6JH"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/23/2019",
        "dateOfIncident": "05/16/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11209555,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2018 CHRYSLER 300. THE CONTACT STATED THAT WHILE DRIVING ABOUT 65 MPH, THE VEHICLE IN FRONT CRASHED INTO A STATIONARY VEHICLE, CAUSING THE CONTACT'S 'VEHICLE TO STOP ABRUPTLY AND WAS REAR ENDED BY THE VEHICLE BEHIND. AS A RESULT, THE VEHICLE THEN CRASHED INTO BOTH CRASHED VEHICLES IN FRONT. THE AIR BAGS DID NOT DEPLOY. THERE WAS NO WARNING LIGHT ILLUMINATED. THE CONTACT SUSTAINED INJURIES THAT REQUIRED MEDICAL ATTENTION. THE CONTACT'S VEHICLE WAS TOTALED AND WAS TOWED TO THE CONTACT'S RESIDENCE. A POLICE REPORT WAS FILED. THE CONTACT CALLED THE CLEAR LAKE CHRYSLER JEEP DODGE RAM (281-310-836, LOCATED AT 15711 GULF FWY, WEBSTER, TX 77598) AND WAS TOLD TO CALL THE INSURANCE COMPANY. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DID NOT DO ANYTHING. THE VIN WAS NOT PROVIDED. THE FAILURE MILEAGE WAS APPROXIMATELY 19,000. *DT  AUDIO ATTACHED. NO VIN AVAILABLE.*JB",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/26/2019",
        "dateOfIncident": "04/25/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203993,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ADAPTIVE CRUISE CONTROL FREQUENTLY FAILS TO WORK AS DESIGNED. VEHICLE WILL FREQUENTLY FAIL TO DETECT VEHICLES (IN ALL CONDITIONS, AND ALL DIFFERENT TYPES OF VEHICLES) IN FRONT OF IT AND NOT ONLY FAIL TO SLOW OR STOP, BUT INSTEAD ACCELERATES. THIS HAS REQUIRED MANUAL BRAKING MULTIPLE TIMES TO TRY AND STOP IN TIME. ADDITIONALLY THE ADAPTIVE CRUISE FAILS TO RECOGNIZE CARS IN ITS LANE AND WILL RANDOMLY PANIC BRAKE WHEN THERE IS NO VEHICLE IN THE LANE, IT APPEARS PICKING UP A VEHICLE IN THE NEXT LANE OVER. THIS OCCURS ON STRAIGHT ROADS AS WELL AS CURVED, WITH FLAT AS WELL AS VARIED ELEVATION.  LASTLY, VEHICLE THREW 3 CODES FOR TRANSMISSION SENSORS AS WELL AS EGR (U0402, U0402PD, AND P1DD2) WHILE CASUALLY DRIVING. THIS CAUSED THE CHECK ENGINE LIGHT TO COME ON AS WELL AS VEHICLE TO GO INTO LIMP MODE. THIS CAUSED A DANGEROUS INCIDENT WHILE TRYING TO PASS A VEHICLE. VEHICLE IS IN SHOP FOR ISSUE ON 4/26.",
        "vin": "2C3CCAGG6JH"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/12/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195921,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHRYSLER 300. WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE HESITATED TO ACCELERATE AND THEN LUNGED FORWARD. THE FAILURE OCCURRED INTERMITTENTLY AND THE AUTOMATIC BRAKE WARNING INDICATOR ILLUMINATED. SOUTHFIELD CHRYSLER DODGE JEEP RAM (28100 TELEGRAPH RD, SOUTHFIELD, MI 48034, (248) 331-9937)  DIAGNOSED AND REPAIRED THE VEHICLE. THE CONTACT STATED THAT THE REPAIR SPECIFICS WERE UNKNOWN. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 95,000. *BF*JB",
        "vin": "2C3CCABG3JH"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/30/2019",
        "dateOfIncident": "03/28/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192660,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ADAPTIVE CRUISE CONTROL HAS BEEN MALFUNCTION SINCE I BOUGHT THE CAR.  IT'S BEEN IN THE SHOP THREE OR MORE TIMES FOR IT.  2 DAY AGO I RECORD ON MY IPHONE AS THE CAR STARTED SLOWING DOWN DUE TO A STOPPED CAR AHEAD OF ME AND THEN SUDDENLY STARTED SPEEDING UP WHILE THE CAR IN FROM WAS STILL STOPPED DUE TO A RED LIGHT.  I DON'T HAVE PICTURES BUT I DO HAVE A SMALL VIDEO.  PLEASE LET ME KNOW IF I CAN UPLOAD THAT SOMEWHERE FOR YOU TO VIEW.  ALSO MY RADIO RESET TO ALL THE DEFAULT STATION WHEN I TURN THE CAR OFF.  THE DEALER REPLACE THE SENSOR OR CAMERA THAT TRACKS THE ACC, BUT I'M STILL HAVE THE TROUBLE.  ON THE SAME DAY I WAS DRIVING IN MY NEIGHBORHOOD AND I SET MY ACC TO 35.  I AIMED THE CAR TOWARDS A PARKED CAR, AND THE ACC DID NOT SLOW DOWN THE CAR, DID NOT FLASH THE BRAKE ALARM, OR DID ANYTHING.  I HAD TO SWERVE TO AVOID A SWERVE TO AVOID A COLLISION.  AGAIN I HAVE THE VIDEOS.",
        "vin": "2C3CCAPT5JH"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/04/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183937,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "EAGLE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHRYSLER 300 EQUIPPED WITH GOODYEAR EAGLE TIRES, SIZE: 245/45Z/R20 (NA). WHILE THE VEHICLE WAS UNDERGOING AN OIL CHANGE AT DERROW CHRYSLER DODGE JEEP RAM OF DEFIANCE (419-782-7373, LOCATED AT 20390 COUNTY RD 424, DEFIANCE, OH 43512), IT WAS DIAGNOSED THAT THE FRONT PASSENGER TIRE WAS SPLIT AND THE THREAD ON THE OTHER THREE TIRES WERE COMPLETELY WORN. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE TIRES WERE NOT REPLACED. THE VEHICLE AND TIRE FAILURE MILEAGE WAS 75,500.",
        "vin": "2C3CCABG5JH"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/11/2019",
        "dateOfIncident": "02/07/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11176161,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD THE CAR TO THE DEALER TWICE FOR THIS SAME ISSUE AND IT'S BACK AGAIN. THEY SAID IT WAS SOMETHING THAT WAS NOT DONE CORRECTLY WHEN THEY CAN WAS MADE. SAY IT A PROBLEM WITH THE WIRING HARNESS, THE REPAIRED IT LAST TIME AND I FEE IT SHOULD HAVE BEEN REPLACED AND NOT JUST MAKE AN ATTEMPT TO REPAIR. I PURCHASED THE CAN BRAND NEW AND EXPECTED THEM TO STAY BY THEIR PRODUCT AND REPLACE ANY PROBLEM PARTS THAT ARE FOUND. NOW I HAVE TO TAKE OFF TIME FROM WORK AGAIN TO HAVE THIS ISSUE ADDRESSED. THE CAR CAN BE PARKED AND THE DAY TIME RUNNING LIGHT WITH COME ON AND GO OFF AT WILL. THE FRONT PARKING SENSOR WILL STOP WORKING OUT OF THE BLUE BECAUSE I GET AN ERROR MESSAGE ON THE DASH. THEN IT WILL JUST START WORKING AGAIN. SAME WITH THE FRONT RIGHT FOG-LIGHT DOES THE SAME THING COME ON AND GOES OUT AT WILL...",
        "vin": "2C3CCABT9JH"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/10/2019",
        "dateOfIncident": "02/09/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11175992,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS VEHICLE ON 02/09/2019 AND AS I WAS DRIVING AT NIGHT THE FRONT HEADLIGHTS STARTED TO GET WET DUE INSIDE THE FRONT LIGHTS. THE FRONT RIGHT HEADLIGHT THEN STOPPED WORKING.  TO ME THIS IS SERIOUS UNSAFE ISSUE.",
        "vin": "2C3CCABG9JH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/21/2018",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11153153,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED 2018 CHRYSLER 300 TOURING IN APRIL.14.2018 I HAVE LESS THAN 5K SO FAR THIS'S SECONDARY USE,IT WAS SUMMER WHEN I BOUGHT IT,WHEN IT'S START GETTING COLD IN OHIO ABOUT MONTH AGO I NOTICED THAT THE TRANSMISSION SLIPPING SO HARD ON LOW GEARS 1ST,2ND AND THE 3RD TILL 4TH GEAR . I'M A MECHANIC I'M WORKING FOR HONDA IN MARYSVILL PLANT SO I'M REALLY GOOD ON HOW TO TO FIGURE OUT WHAT'S GOING ON IN ANY VEHICLE THIS'S MY JOB,SO I START TRACKING THE TEMPERATURE FOR THE TRANSMISSION AFTER 2 WEEKS WATCHING THAT I NOTICED THE TEMPERATURE WHEN I START THE VEHICLE WILL BE ABOUT 35-40 F AND WHEN I LEAVE THE CAR TO WARM UP FOR AT LEAST 5-10 MINUTES THE TEMPERATURE IT'S NOT GONNA BE OVER 70F AND THIS'S COMPLETELY BAD ON THE TRANSMISSION AND THE CLUTCHS AND I HAVE THE EVIDENCE FOR THAT. THIS PROBLEM SHOULD BE TAKING CARE OF AS SOON AS POSSIBLE.  THANK YOU",
        "vin": "2C3CCAAG0JH"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/20/2018",
        "dateOfIncident": "11/07/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11152893,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL AIRBAG DID NOT DEPLOY AT 70 MPH SPEED AND IMPACT. CAR WAS IN MOTION ON HIGHWAY UNTIL IT RAN OFF THE ROAD INTO AN EMBANKMENT. *DT *JB",
        "vin": "2C3CCAAGXJH"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/19/2018",
        "dateOfIncident": "11/18/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11152541,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHRYSLER 300. WHILE DRIVING 55 MPH, THE CONTACT'S VEHICLE WAS CUT OFF BY ANOTHER VEHICLE. THE CONTACT SWERVED OFF THE ROAD AND CRASHED INTO TWO TREES. THE AIR BAGS FAILED TO DEPLOY. THE DRIVER AND PASSENGER SUSTAINED UNKNOWN INJURES THAT REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED WITH THE STATE POLICE. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC. THE LOCAL DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 4,000. *DT*JB",
        "vin": "2C3CCAAG6JH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/14/2018",
        "dateOfIncident": "11/14/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151397,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SPEED-SENSITIVE POWER STEERING APPEARS TO BIND AT APPROXIMATELY 50 MPH WHEN MERGING ONTO HIGHWAY OFFRAMP. DELICATELY APPLYING FORCE TOWARD DESIRED DIRECTION WILL REENGAGE STEERING BUT CARE MUST BE TAKEN NOT TO OVERCOMPENSATE AND FORCE IMMEDIATELY RELEASED IN ORDER TO MAKE OR CONTINUE DESIRED TURN.",
        "vin": "2C3CCAGG4JH"
    },
    {
        "components": "SERVICE BRAKES,BACK OVER PREVENTION",
        "crash": true,
        "dateComplaintFiled": "09/20/2018",
        "dateOfIncident": "09/04/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11130300,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHRYSLER 300. WHILE DRIVING 35 MPH, THE CONTACT DEPRESSED THE BRAKE PEDAL AND THE ABS MALFUNCTIONED AND THE BRAKE PEDAL PULSATED. AS A RESULT, THE CONTACT CRASHED INTO THE REAR OF ANOTHER VEHICLE. PRIOR TO THE CRASH, THE BACK-UP CAMERA FAILED AND IT WAS DIFFICULT TO START THE VEHICLE. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO A COLLISION CENTER. THE CONTACT SUSTAINED A MINOR INJURY TO THE SHIN BONE FROM THE AIR BAG DEPLOYMENT. MEDICAL ATTENTION WAS NOT RECEIVED. THE CONTACT STATED THAT A CHRYSLER REPRESENTATIVE INSPECTED THE VEHICLE'S DATA RECORDER, BUT WAS UNABLE TO RETRIEVE A FAILURE REPORT. NAPLES DODGE CHRYSLER JEEP RAM (LOCATED AT 6381 AIRPORT-PULLING RD, NAPLES, FL 34109, (239) 594-2100) WAS CONTACTED, BUT THERE WAS NO RESPONSE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND ISSUED CASE NUMBER: CAIR35003857. THE APPROXIMATE FAILURE MILEAGE WAS 290.",
        "vin": "2C3CCAAG1JH"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/15/2018",
        "dateOfIncident": "07/01/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120136,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 CHRYSLER 300. WHEN THE CONTACT PLACED THE VEHICLE IN DRIVE GEAR, IT ROLLED BACKWARDS WHILE THE BRAKE PEDAL WAS DEPRESSED. THE VEHICLE WAS TAKEN TO MAC HAIK DODGE CHRYSLER JEEP RAM (3207 S GENERAL BRUCE DR, TEMPLE, TX 76504, 254-773-4556) WHERE IT WAS DIAGNOSED, BUT THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE DEALER STATED THAT THE VEHICLE WAS NEW; THEREFORE, THE TRANSMISSION COULD NOT BE THE SOURCE OF THE FAILURE. THE MANUFACTURER WAS NOTIFIED AND ADVISED THAT THE TRANSMISSION BE REPAIRED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 5,400.",
        "vin": "2C3CCAAG4JH"
    }
]