[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/20/2019",
        "dateOfIncident": "08/15/2019",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245359,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "DYNAMAX",
                "productModel": "ISATA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED THIS MOTORHOME ON 8/12/19. THE LEVELING SYSTEM WAS NOT WORKING SO UPON CRAWLING UNDERNEATH TO FIND OUT WHAT WAS LEAKING WE DISCOVERED A COUPLING IN THE MODIFIED BRAKE LINE LEAKING. WE CHECKED THE BRAKE FLUID AND HALF WAS GONE. WE CONTACTED DYNAMAX WHO CLAIMED IT WAS CHRYSLERS RESPONSIBILITY. WE TOOK IT TO CHRYSLER AND THEY INFORMED US IT WAS MODIFIED AND NOT THEY'RE RESPONSIBILITY. WE THEN FOUND A STICKER THAT SAID IT HAD BEEN MODIFIED BY MOR/RYDE. WE CALLED THEM AND THEY DID NOT KNOW. WE AGAIN CALLED DYNAMAX AGAIN AFTER 3 DAYS OF RUN AROUND AND THEY FINALLY CALLED MOR/RYDE TO CONFIRM THAT THEY HAD MODIFIED THE BRAKE LINES. OUR BRAND NEW MOTORHOME IS SITTING AT THE CHRYSLER DEALER WHO AT THIS POINT IS REFUSING TO DO ANY FURTHER WORK ON IT DUE TO THE MODIFICATION. WHAT DO WE DO NOW? THE VEHICLE WAS PARKED WHEN WE FOUND THE LEAK BUT WE HAD JUST DRIVEN IT OVER 300 MILES TO GET HOME. THE LEAK WAS CAUSED BY MOR/RYDE EXTENDING THE BRAKE LINE USING A COUPLING WHICH IT WHERE THE VERY BAD LEAK IS.*DT*DT  *AS",
        "vin": "3C7WRNDL3JG"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/08/2019",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230260,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "DYNAMAX",
                "productModel": "ISATA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS A 2018 MERCEDES BENZ SPRINTER-BASED 24 FT MOTORHOME.  IT WAS STATIONARY WITH ENGINE OFF.  WHEN ROTATING THE DRIVER'S SWIVEL SEAT 180 DEGREES (WHICH IT IS DESIGNED TO DO), UNDERSEAT WIRING WAS SEVERED DUE TO IMPROPER WIRE ROUTING BY THE \"UPFITTER\" (DYNAMAX CORP), THUS CAUSING AN INSTRUMENT PANEL WARNING OF \"SRS FAULT; PROCEED IMMEDIATELY TO REPAIR FACILITY\".  THIS ANALYSIS WAS MADE BY MERCEDES BENZ OF KANSAS CITY SERVICE DEPARTMENT WHERE A REPAIR WAS PERFORMED.  MERCEDES BENZ REFUSED COVERAGE UNDER THE CHASSIS WARRANTY SO I PAID THE REPAIR COST OUT OF POCKET ($388.90).  I SUBSEQUENTLY WROTE A LETTER TO DYNAMAX REQUESTING REIMBURSEMENT.  SEE ATTACHED PDF INCLUDING MB SERVICE INVOICE AND PAYMENT RECEIPT.  I RECEIVED NO RESPONSE FROM DYNAMAX FOR TWO MONTHS.  UPON FOLLOWING UP WITH DYNAMAX BY PHONE ON 7/8/2019, I WAS TOLD THE REIMBURSEMENT REQUEST WAS DENIED BECAUSE I WAS NOT THE ORIGINAL PURCHASER OF THE VEHICLE AND THEREFORE NOT COVERED UNDER THEIR WARRANTY.   REGARDLESS OF THEIR WARRANTY POLICY, I BELIEVE AN INOPERATIVE AIRBAG SYSTEM CAUSED BY A MANUFACTURING DEFECT CONSTITUTES A SERIOUS SAFETY HAZARD, THE REPAIR COST OF WHICH SHOULD BE BORNE BY THE MANUFACTURER, NOT THE CONSUMER.",
        "vin": "WDAPF4CC2H9"
    }
]