[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/04/2022",
        "dateOfIncident": "12/23/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459531,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The defects that cause coolant to leak into the engine cylinders, causing significant damage and, in some cases, complete engine failure. I have an invoice of over 2100.00 that did not repair the damage. My mechanic spoke to Ford dealership and they said they were aware of the problem and explained the issue to him.  He sent me several estimates and so did Ford stating I need a new engine that would cost and estimated amount of $8200-$12,000.00.  After the engine light came on. everytime I took it to get fixed, \"cylinders\" the engive light would go out temporarily and then I went to pull out of my home and was almost hit because my car would not go.  it just kept stuttering. (best way I can describe it)  my son and i were cussed out by the woman thinking I just purposely stopped in the middle of the road.   There are several class action lawsuits against Ford over this matter since 2020.  I called them and they refused to help me but told me to get another estimate from a Ford Delearship that would cost me an additional 500 plus.  I am a single mom and owe almost 16,000.00 on this and cannot afford to get a new engine.  My heart breaks that I a cannot travel to see my elderly parents and grandparents.  In order to drive around town, I have to put several bottles of coolant in it a week.  while my car was in the shop my son missed the bus and had to walk home 3 mile in the winter months.  I hope that you can help us.",
        "vin": "1FMCU0GD6JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/02/2022",
        "dateOfIncident": "03/31/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459316,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I drove 2 minutes down the road and my dashboard told me \"autostart is disabled turn off the car and restart the car\". after pulling over on the side of the road cause my car had to die while I was driving. I tried to restart my car and nothing working it was cranking but wouldn't start. I had to get my car towed to my local shop. My mechanic is saying there is zero compression and my engine is blown, my engine has a little over 60k. I get oil changes every time it is needed. my coolant is leaking but shows no trace of where the coolant is going. Please help!",
        "vin": "1fmcu9hd2ju"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/31/2022",
        "dateOfIncident": "03/30/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459180,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The engine of my 2018 Ford Escape failed while driving, indicating it was overheating and to pull over and turn off the vehicle immediately. I could feel a loss of response of the engine while I was driving accompanied by shuddering and an odd noise. This happened within 3 minutes of leaving my house on a cold day, traveling about 1/4 mile. Fortunately, I was on a back road with a low speed limit and could pull over to the shoulder safely. However, had this been on a highway I may have had major safety issues with loss of acceleration and ability to safely move my vehicle to the side of the road. The problem was confirmed by an independent auto shop as well as the dealership by inspection where antifreeze was found to leak into the engine block and cause engine failure. This was noted as a service bulletin by the dealer, but never as a recall nor was it shared with car owners. My vehicle has only ~43000 miles on it. The check engine light to my vehicle turned on a few weeks prior to the engine failure. A diagnostic check by a service provider indicated a cylinder misfire caused by worn out spark plugs or ignition coils and repair was not urgent. This was also 1 week after I had my car inspected by the dealer for a tune up, oil change, and general check where I was told everything looked normal. The check engine light went off for periods of time before coming back on and there was a slightly rougher idle to the vehicle, but no obvious warning signs indicating engine contamination with antifreeze and imminent failure. I was told a compression test of the engine could have helped spot the problem before engine failure, but this was not confirmed by the car dealer.",
        "vin": "1FMCU9HD7JU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/25/2022",
        "dateOfIncident": "03/10/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458337,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Ford Escape. The contact stated while driving approximately 30 MPH and attempting to depress the brake pedal, the pedal went to the floorboard. The coasted to the side of the road while pumping the brake pedal until the vehicle came to a stop. The vehicle was then driven to the local dealer and diagnosed with a faulty brake master cylinder. The vehicle was repaired. The contact was concerned about having to pay out of pocket for the repair. The manufacturer was contacted and notified of the failure; and referred the contact to the NHTSA for assistance. The approximate failure mileage was 23,000.",
        "vin": "1FMCU9HD0JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/23/2022",
        "dateOfIncident": "03/11/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458068,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Engine requires replacement. Vehicle is presently located at Century Ford in Mount Airy, Md. The vehicle is scheduled to be picked up and repalced by Element Fleet. The engine cost replacement was estimated at $5.500.00.  The vehicle slowed down severely, loss of horsepower on major 70 MPH highway near Hagerstown, Md. I was driving normally when the vehicle slowed and the Enigine Light was Flashing On and Off most of the 30 minute drive to the local repair shop. I was concerned about my safety from all traffic especially tractor trailers. I thought the vehicle might completely shut off.   I was then instructed by the company Element Fleet management to take the vehicle to a Ford dealer. The local repair shop said the vehicle needed the engine replaced. The Ford Dealer also said the engine needed replacement. The mileage was 87, 376. Regular maintenance and proper driving was applied at all times. I received the vehicle with about 61,000 miles from another co-worker in May 2021.",
        "vin": "1FMCU0GD0JU"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "03/17/2022",
        "dateOfIncident": "11/09/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457164,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Ford Escape. The contact stated that after arriving to her destination and attempting to open the liftgate, the contact was unable to open the tailgate. There was no warning light illuminated. Additionally, the contact stated that the Auto START/STOP feature did not have a fail-safe feature which prevented the tailgate from operating as designed. The vehicle was not diagnosed or repaired. Neither the manufacturer nor the dealer was notified of the failure. The approximate failure mileage was 12,830.",
        "vin": "1FMCU0GD2JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/15/2022",
        "dateOfIncident": "03/10/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456788,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Started sputtering. Engine light popped on. Sputtering.  Stalling. Heating up  upon diagnoses. Coolant leaked onto engine.",
        "vin": "1FMCU0J95JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/25/2022",
        "dateOfIncident": "02/14/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454096,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Ford Escape. The contact stated that while operating the vehicle, the engine overheated, causing the vehicle to stall. The vehicle was towed to the local dealer who diagnosed that the engine head gasket failed and the engine short block needed to be replaced. The vehicle was not yet repaired. The manufacturer was notified of the failure but no assistance was offered. The failure mileage was 75,683.",
        "vin": "1FMCU9GD8JU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/23/2022",
        "dateOfIncident": "02/22/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453671,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving home after leaving car at my daughter's house. Very cold last night and it was left outside. Steering was a bit tight on the ride home. Then a light came on the dash...and the steering virtually locked up. Extremely hard to turn or maneuver. I am 6'3\" and 260lbs..and had this been my wife driving who knows what would happened.  Put it in garage this morning. Went out about 15 minutes ago...no change. Big red sign on the dash instrument panel reading \"Steering loss. Stop safely\".  Major safety issue had some else been driving.",
        "vin": "1FMCU9GD9JU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/06/2022",
        "dateOfIncident": "02/04/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450649,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Door would not unlock when hand is placed on door handle with key fob nearby.  Had to use keypad on door.   Happens intermittently Also horn beeps by itself Driver seat memory wasn’t automatically activated All intermittently",
        "vin": "1fmcu9j95ju"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/25/2022",
        "dateOfIncident": "01/23/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448830,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Ford Escape. The contact stated that the vehicle failed to start. The check engine warning light and the oil warning light were illuminated. The vehicle was towed to an independent mechanic who was unable to diagnose the vehicle and referred the contact the dealer. The vehicle was towed to the dealer who diagnosed that the engine short block needed to be replaced. The dealer also advised the contact that she would be responsible for the cost of the repair since the VIN was not included in an unknown Technical Service Bulletin. The manufacturer was notified of the failure and a case was opened. The manufacturer also referred the contact to NHTSA for assistance. The vehicle was not repaired. The failure mileage was approximately 80,000.",
        "vin": "1FMCU0GD2JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/20/2022",
        "dateOfIncident": "01/11/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448139,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I have a 2018 Ford Escape purchased brand new off the lot.. Now less than 3 years and 66000 miles later my check engine light comes on.. I took my car to a trusted mechanic who advised of a bad spark plug.  A day after the repair, driving less 15 miles the check engine light came back on. After further inspection the mechanic advised I should take it to the Ford dealership. The diagnosis at the Ford dealership showed a blown head gasket and that I would need to replace the entire engine. The Ford service agent said the damage was caused by coolant leaking into the oil.  He said the cost of the repair is estimated at $10000 (which is more than I owe on the car).    With so many similar issues this is definitely a defect of the engine in the Escape. This issue should be immediately investigated, recalled, and repaired by Ford as it is clearly not a consumer caused issue.  I'm sharing a pic of the spark plug that has been corroded due to the coolant leaking into the oil which has destroyed my engine.  Please help us!",
        "vin": "1FMCU0GD4JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/13/2022",
        "dateOfIncident": "01/11/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447372,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Ford Escape. The contact stated that while driving approximately 60 MPH, the coolant was mixing with the oil. The check engine warning light was illuminated. The vehicle was taken to the local dealer where it was determined that the engine needed to be replaced. The vehicle was not repaired. The manufacturer was notified however, no further assistance was provided. The failure mileage was approximately 15,000. Consumer stated vehicle was serviced and repaired on December 2, 2021. Levittown Ford replaced the engine due to the coolant mixing with the oil.",
        "vin": "1FMCU9HD7JU"
    },
    {
        "components": "POWER TRAIN,SEATS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/07/2022",
        "dateOfIncident": "01/07/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446564,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Have taken my 2018 Escape S several times to Dealership where purchased for whirling winning noise from front end of vehicle and mechanic claimed could not hear noise now have clicking sound happening and expressing loose cv axel. .  Headlights have started to peel Dealership shop staff claimed could not see damage or p R peeling. And front drivers seat lower upper back makes a popping sound  and gives with any pressure to area. Dealership claims can not feel or hear.",
        "vin": "1FMCU0F70JU"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/07/2022",
        "dateOfIncident": "01/07/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446598,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Had vehicle at the dealership for standard oil change and tire rotation.  Service member included a note that says \"Replace 12 swollen lug nuts next visit.\"  This seems like a dangerous situation to me and Ford Motor dealer should have automatically replaced them.",
        "vin": "1FMCU9HD3JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/30/2021",
        "dateOfIncident": "12/30/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445533,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 Ford Escape engine with just 22,000 Miles on it needs to be completely replaced for leaking coolant. Was told it could have given up on me at any moment while driving.",
        "vin": "1FMCU9GD8JU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/29/2021",
        "dateOfIncident": "09/15/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445398,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "3 different times when I put on the brakes, they just went all the way to the floor without stopping.  This happened in a parking lot, exiting my driveway and going down a hill.  All 3 times I had just started the car & was only going 5 miles per hour.  These incidents occurred randomly, not on the same week.",
        "vin": "1fmcu9HD5JU"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/15/2021",
        "dateOfIncident": "12/15/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443930,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Ford Escape. The contact stated that while driving at 55 MPH, the vehicle felt like it had a flat tire or low tire pressure. Upon inspection, the contact noticed the rear passenger's side strut had detached and was sticking up inside of the trunk. The vehicle was taken to three independent mechanics and diagnosed that the rear passenger's side strut was faulty, or the vehicle might have been previously totaled in a collision. The vehicle was not repaired. The dealer was made aware of the failure and informed the contact that there was no recall associated with the VIN and that the vehicle was out of warranty. The manufacturer was not made aware of the failure. The failure mileage was approximately 85,000.",
        "vin": "1fmcu0f7xju"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/15/2021",
        "dateOfIncident": "12/02/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443940,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "My 2018 Ford escape has a blown engine. My check engine light came on and I brought the car to the dealer. The Service rep advised me I need an appointment to have the car checked. I advised him that the check engine light came on and It might be a serious problem and I’m not driving the car. Ford took the car 14 days ago I’m awaiting an answer on the status.  The engine was blown due to oil mixing with coolant through the cylinder. A quick Google check of the 2018 Ford escape has many complaints similar to mine. I called Fords Main office inquired if there was any recalls or any problems and they told me there was no recalls and no problems. This is a serious problem if somebody disregards the check engine light and the motor Ceased they could be a rear end collision. I observed on Car websites that people have complained of the similar problems and Ford does nothing about it. How can these dealers get away with not advising owners of possible serious the physical injury or death caused by defective parts that they are well aware of?  I believe this needs checking into further by governmental agencies and force Ford to repair the engines and extend the warranties on those bad motors they’re aware of. My brother drives a Ford escape at work the car has three engines in it and it only has 48,000 miles. The same problem with my car happened with all three of those of the motors. It’s a shame Ford could get away with us. Ford is repairing the car right now after me insisting to them that I wasn’t leaving with the check engine light on. When the service manager advised me the motor was shot he also told me my free oil changes would not be honored any longer although I have it in writing. These dealers get away with it because they know you’re not gonna go to arbitration over a couple oil changes but they get away with it. The problem with the 1.5 eco-boost Ford motor should immediately be recalled and repaired the warranty.extended  Sincerely yours,  [XXX]  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "1FMCU9HD7JU"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/01/2021",
        "dateOfIncident": "06/22/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442373,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "UNKNOWN The vehicle is only three years old is kept up with on a regular basis with the maintenance and is now having issues with a leaking evap system which has been an ongoing issue with a lot of Ford vehicles. I was notified by a mechanic that inspected my vehicle that the vehicle is not safe to drive and is like a ticking time bomb.",
        "vin": "1FMCU0GD0JU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "11/25/2021",
        "dateOfIncident": "11/19/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441686,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I was stopped for an accident on I70 E in St Louis County.  While stopped a 2015 Mazda hit me in the rear. He hit me so hard that the the seat broke and I went all the way back to the back seat. He then pushed me into the stopped Tahoe in front of me. I went forward and hit the steering wheel. None of the airbags deployed. Component malfunction would be air bag system and seat. I feel that if I had one of my grand kids in the back they may have been crushed. As far as I know the problem has not been confirmed by anyone. The car was checked by insurance company and totaled. There were no warnings or warning lamps. I have pictures that can be emailed or texted, I can't get them in here.",
        "vin": "1FMCU0HD4JU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/18/2021",
        "dateOfIncident": "11/14/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440919,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Ford Escape. The contact stated that while driving at 15 MPH, the vehicle jerked and revved loudly, then lost motive power. The vehicle was towed to the dealer. The dealer diagnosed that the transmission fluid pump was faulty, causing the transmission failure. The transmission fluid pump needed to be replaced. The vehicle was not repaired and remained at the dealer. The manufacturer was made are of the failure and referred the contact to file a complaint with NHTSA. The failure mileage was 114,000.",
        "vin": "1fmcu9gd8ju"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/15/2021",
        "dateOfIncident": "11/09/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440534,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "FIRESTONE",
                "productModel": "FIREHAWK GT",
                "productYear": "9999",
                "size": "235/50R18 97H",
                "type": "Tire"
            }
        ],
        "summary": "A set of four (4) tires were purchased on 09/07/2021. The cars mileage was 30,389 at time of purchase. On 11/09/2021, I discovered two dollar size bulges on the sidewall outside of the front passenger tire. These bulges were protruding about 3/4 of an inch. I reported the defect to Firestone and on 11/15/21, the tire was replaced and remaining three were examined with no defects found. The mileage on the car when defect was found was 33,558.  My concern is that if I had not discovered this defect, a possible front tire \"blow-out\" may have occurred and because my vehicle is an SUV, a \"ROLLOVER\" at highway speeds if likely.  I am reporting this in the event that Firestone fails to make proper reports & notifications.",
        "vin": "1FMCU9J97JU"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/11/2021",
        "dateOfIncident": "11/11/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440167,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Lug nuts swelled and were replaced at my expense by a Ford dealership. There were no warning messages. Problem found at routine tire rotation.",
        "vin": "1FMCU9HD6JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/01/2021",
        "dateOfIncident": "10/29/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438966,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "There is coolant going into our spark plug coils.  We filled up the coolant, because the engine light came on and the temperature went directly to Hot after a 7 minute drive.  Checked the coolant, it was very low.  Filled it up to the max mark - had a mechanic look at it today and now as soon as you start it, you can hear the 1st and 2nd spark plug misfiring.   The exhaust has a smell that you can detect coolant.  There is coolant pooling in the coils.",
        "vin": "1fmcu0hd5ju"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/15/2021",
        "dateOfIncident": "10/14/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436881,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Got a flat tire.  The lug wrench that came with the vehicle was too small.  I tried a lug wrench that had four sizes.  Three were too small and one was too big.  I had to call a tow.  The driver had a lot of tools and tried to change the tire.  He wasn't able to, so I had to get it to a tire shop.  When I called in advance, they asked if it was a Ford.  They informed me that there was a defect with their lug nuts that causes moisture and dirt to get in between two layers and the result is swelling.  I had them replace all twenty lug nuts.  A simple 5 minute tire change turned into a 4 hour ordeal and added expense.",
        "vin": "1FMCU0HD5JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/30/2021",
        "dateOfIncident": "09/30/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435064,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "P0302 code is showing that coolant is leaking into the engine through cylinder 2. Dealer looked at our vehicle and we will need a completely new engine. Regular maintenance has been done on this vehicle.",
        "vin": "1FMCU9GD8JU"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/27/2021",
        "dateOfIncident": "09/16/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434471,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Ford Escape. The contact stated that the check engine warning light was illuminated. The vehicle was taken to the local dealer where it was diagnosed that there was a coolant leak and an engine replacement was needed. The vehicle was not repaired.  The manufacturer was notified however, no further assistance was provided. The failure mileage was 61,000",
        "vin": "1FMDU9GD4JU"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/27/2021",
        "dateOfIncident": "08/20/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434514,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The dealer has determined that engine coolant is leaking into the motor.  This is a 2018 model with 24,500 miles.  I understand that a number of Ford vehicles with the same engine design have been recalled because this is a safety issue, and I am afraid to drive the vehicle.",
        "vin": "1FMCU9HDXJU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/17/2021",
        "dateOfIncident": "09/11/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433353,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Approximately one week ago, our car began running rough and the check engine light came on. We took it to one independent service center who ran a diagnostic check that showed a cylinder 4 misfire. We took it to a separate ISC who performed a more robust diagnostic per the Ford outlined TSB 19-2346 and found coolant in cylinder 4 as well as loss of pressure in cooling system. Mileage of the vehicle is 25,398 miles and the vehicle is covered under Ford powertrain warranty; however, Ford customer service refused to support the diagnosis of the two separate ISCs. They informed us that they would only accept a diagnosis from a Ford dealership, but no appointments with dealerships were available in the near future. Upon further investigation, we discovered that this is a common and known issue for at least 5 separate models of Ford vehicles since 2015 and requires an entire replacement of the long block engine assembly. Despite that, Ford advised us they would be unable to help us without a dealer diagnostic whenever that became available. So while waiting for this supposed service to determine an already known issue in a month, my family must risk their lives with an engine that has coolant leaking into it if we want to be able to function outside of our home. Ford Motor Company is risking the lives of thousands with these engines, but since there is no recall we are left with no support.The ISCs and our other warranty companies cannot help due to the existing Ford powertrain warranty, but Ford refuses to acknowledge the issue.",
        "vin": "1FMCU9J93JU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/14/2021",
        "dateOfIncident": "09/14/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432994,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "While on the interstate, engine suddenly cut out. I was coasting and nothing else on the highway during rush hour. I got an alert the \"auto start/ stop shift to park, then restart the engine\" I pulled over and the engine would not restart.",
        "vin": "1FMCU0GD7JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/12/2021",
        "dateOfIncident": "09/10/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432675,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "My daughter was driving the car approx 40 mph on a busy road.  Warning Notification:  \"Transmission, put in park\".  She slowed down then the car stalls.  Eventually turned the car off then restarted the car and it seemed to reset and drive OK again. Taking car into dealership tomorrow.  49K miles on the car and in good working order....other than this.",
        "vin": "1FMCU0GD7JU"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/11/2021",
        "dateOfIncident": "08/31/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432580,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Was given inspection sheet on car after brought into Auto Fair Ford for Oil Change and they were suppose to do a front end alignment. Person came to me hand paper work work to me and said I was all set. Left to go on a trip with car and did not look at paper work until a week later. On from it talked about replacing rear trailing arm bushings and dog bone control arms the car only has about 39,000 miles on it. In look up on sites had noticed on past escapes that they had a recall on this same items. My car is a 2018 Ford Escape. First of all the Ford place I brought the car to should have told me about the problem right away verbally. The trailing arm needs to be looked at on these cars",
        "vin": "1FMCU9GD5JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/24/2021",
        "dateOfIncident": "07/02/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430249,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Greetings, Thank you for taking the time to read my email.  I am without transportation.  I started experiencing engine coolant fluid leaking into my cylinder side lenders on May 18, 2021. I had the cylinder repaired.  Since that date my car continued to overheat.  I took my car to approximately 4 mechanics and I was told they did not see any leaks.  The four different mechanics could find anything wrong with my car. Due to financial challenges during this pandemic my mother moved in with my two children and myself.  We have experienced some challenges however I continued to pay my car payment on time. My car continued to overheat so I only used it to for necessities.  I did a lot of research on my car attempting to determine what was going on and eventually on July 2, 2021, I found out my 2018 Ford Escape had been recalled and there was a big class action lawsuit that had been filed against Ford Motor Company over its EcoBoost engine taken in cars produced from 2013 to 2019 it alleges engine coolant is leaking into cylinders this is in addition to an Arkansas lawsuit already filed that includes both owners and lessees of both Ford and Lincoln cars and trucks with EcoBoost engines and alleges the defects results in the engine tendency to overheat cell and catch on fire second period. I was told I was not the original owner and I missed the cut off date.",
        "vin": "1FMCU0GD3JU"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "08/12/2021",
        "dateOfIncident": "08/05/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428870,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 Ford Escape SE 4WD with only 15,000 miles experienced a APIM failure resulting in a $1,000+ repair -- only two months outside of 3yr/30,000 mile warranty. Screen went black resulting in radio, navigation, rear view camera and other controls being inoperable. Ford dealer diagnoses APIM failure and recommended replacement. No other solution presented or consideration paid to the relative low-mileage. I have read about other APIM failures and subsequent recalls and would recommend investigating. Thank you.",
        "vin": "1FMCU9GD7JU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/04/2021",
        "dateOfIncident": "08/04/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427729,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Ford Escape. The contact stated while approaching an intersection and attempting to depress the brake pedal, the brake pedal extended to the floor and failed to stop in a reasonable amount of time. There was no warning light illuminated. The contact also stated that there was an abnormal sound while the vehicle was idling back to her residence. The vehicle was not diagnosed or repaired. A dealer was not contacted. The manufacturer had not been informed of the failure. The failure mileage was approximately 19,000.",
        "vin": "1FMCU0HD2JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/29/2021",
        "dateOfIncident": "07/20/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427072,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "When I start my car it blows smoke from the exhaust. I took it to a repair shop and the gave me a TSB on the problem. I have learned since that this is a common issue but is not deemed a recall. This issue is definitely a safety issue and I need Ford to repair my car at no cost to me. If my engine blows in traffic this could lead to serious injury or death to me or to others. It is a 19-2375 bulletin.",
        "vin": "1FMCU9HD0JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/28/2021",
        "dateOfIncident": "07/02/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426778,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "My 2018 Ford Escape Titanium 2.0L Ecoboost motor needs a complete replacement due to a manufacturer defect. The car presented with an engine misfire code of P0303 on July 2, 2021 and again on July 8, 2021.  Upon inspection of the engine from Ford, it was determined that there was coolant leaking into the cylinder bores resulting in needing a complete engine replacement.  I was informed that the more the vehicle is driven the more it would put the driver and passengers at risk because eventually the motor would seize while driving.  Ford has refused to take responsibility in repairing this manufacturer defect which puts me and any passengers at risk of bodily harm.",
        "vin": "1FMCU9J90JU"
    },
    {
        "components": "STEERING,SUSPENSION,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/06/2021",
        "dateOfIncident": "06/27/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423598,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "You may want to investigate this. I own a 2018 Ford Escape which I purchased new.  Two week ago the left rear passenger window was broken out. As I was in Idaho at the time, and had to drive back to Washington State, I drove the car down the highway at 55 MPH with the sunroof open and all other windows closed. No problem. I then closed the sunroof and the car shook violently to the point I thought the back door might be ripped off. We seldom open the back windows so I never experienced this before but it could cause an accident.",
        "vin": "1FMCU9HD5JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/18/2021",
        "dateOfIncident": "05/24/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421408,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Engine coolant is leaking into my cylinder due to leaky cylinder head seal and issues with the engine block. Engine is at risk to overheat, fail, and catch on fire. This damage is the result of a known issue that Ford has filed an FSA for. I was never notified of the FSA and now the damage is done.",
        "vin": "1fmcu9gd0ju"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/01/2021",
        "dateOfIncident": "06/30/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419204,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Black mold on my cabin air filter. There appears to be a design defect with my 2018 escape (4 cyl) that does not allow the ac condenser to properly drain. This causes the cabin air filter to become water logged, which leads to the growth of black mold, which leads to the black mold being released into the cabin. Black mold in the cabin is definitely a safety issue. Each time I bring the problem to the local dealer they say all they can do is charge me another $50 to replace the cabin air filter.",
        "vin": "1FMCU0J95JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/22/2021",
        "dateOfIncident": "05/22/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418171,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle accelerated uncontrollably, cruise control was never turned on,  brakes had to be applied, otherwise car would continue to accelerate uncontrollably.  Finally came to safe place to park, put vehicle transmission in PARK, engine RPMs revved to 7000 rpms.  Engine was immediately turned off.  There was never anything caught on accelerator.",
        "vin": "1fmcu9gd8ju"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/21/2021",
        "dateOfIncident": "04/29/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418039,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Coolant fluid leaking into #3 cylinder",
        "vin": "1FMCU0GD4JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/12/2021",
        "dateOfIncident": "04/28/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416306,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 04/28/2021 MY REMOTE START ON MY 2018 FORD ESCAPE TITANIUM 2.0L, WITH ONLY 21,833 MILES ON IT, DID NOT WORK AND DID NOT START MY VEHICLE. I GOT IN, STARTED MY VEHICLE USING THE PUSH BUTTON START, AT WHICH POINT MY VEHICLE BEGAN TO SHAKE AND THE CHECK ENGINE LIGHT CAME ON WITH NO OTHER INFORMATION. THE FORD PASS APP INDICATED 'MALFUNCTION INDICATOR LAMP-REGULATORY' WITH NO OTHER DETAILS. I IMMEDIATELY CALLED MY LOCAL DEALER, BELL FORD BUT THEY COULD NOT GET ME IN FOR SERVICE UNTIL MID-JUNE. I THEN CALLED THE DEALER WHERE I BOUGHT MY CAR, FULLERTON FORD AND GOT AN APPOINTMENT FOR TODAY 05/12/21. I BROUGHT MY VEHICLE IN THIS MORNING AND AFTER 20-30 MINUTES MY SERVICE ADVISOR CAME TO ME AND SAID THE COOLANT WAS LEAKING INTO THE ENGINE AND THAT THE ENGINE NEEDS TO BE COMPLETELY REPLACED. THEY PROVIDED ME WITH A LOANER CAR AND TOLD ME THEY WILL CONTACT ME WHEN THE NEW ENGINE IS INSTALLED, WHICH COULD TAKE LONGER THAN A WEEK.",
        "vin": "1FMCU9J96JU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/06/2021",
        "dateOfIncident": "04/23/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415440,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I PUT IN A COMPLAINT #11414950 AND HAVE NOT RECEIVED A RESPONSE. PLEASE UPDATE ME.",
        "vin": "1FMCU9GD5JU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/05/2021",
        "dateOfIncident": "03/16/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415853,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 FORD ESCAPE. CONSUMER WRITES REGARDING ISSUE WITH TRANSMISSION. *LD      THE CONSUMER STATED THE VEHICLE WAS TAKEN TO A DEALER  (MASSEY FORD) WHO ADVISED THE VEHICLE CODED P2701 AND WOULD NEED TO REPLACE THE TRANSMISSION. THE CONSUMER RECEIVED A SECOND OPINION (KENT PARSONS FORD) STATING THE SPARK PLUGS NEEDED TO BE REPLACED. THE SPARK WAS REPLACED. THE CONSUMER WAS INFORMED THE NEXT DAY THE TRANSMISSION WENT OUT. THE CONSUMER TRADED THE VEHICLE INTO MASSEY FORD. KENT PARSONS FORD WAS RELUCTANT TO RELEASE THE VEHICLE AS THE BILL WAS NOT PAID FOR THE SPARK PLUG REPAIR. THE MANUFACTURER WAS NOTIFIED BUT, DID NOT OFFER ANY ASSISTANCE. *JS",
        "vin": "1FMCU0F7XJU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/05/2021",
        "dateOfIncident": "04/22/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415334,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAD ENGINE REPLACED JANUARY 2020 FOR ENGINE FAILURE.  APRIL 2021 RECEIVED MESSAGE STATING ENGINE FAULT,  BROUGHT TO THE DEALERSHIP AND WAS TOLD COOLANT WAS LEAKING, NOT RELATED TO THE ENGINE REPLACEMENT AND REPAIRS WOULD BE $1400",
        "vin": "1FMCU0HD7JU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/03/2021",
        "dateOfIncident": "04/23/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414950,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2018 FORD ESCAPE WITH 13,967 MILES .BROUGHT IT IN FOR AN OIL CHANGE AND WAS TOLD MY REAR BRAKES AND ROTORS WERE TOTALLY BAD.HAD IT SERVICED LAST YEAR AND ONLY TRAVELED 7,000 MILES.I WANT TO KNOW IF THERE HAS BEEN A PROBLEM REPORTED ABOUT THESE REAR BRAKES.AS EVERY MECHANIC I'VE TALKED TO CAN'T BELIEVE THIS COULD HAPPEN. I TALKED TO THE NATIONAL HIGHWAY TRAFFIC SAFETY ADMINISTRATION AND HE SAID TO ASK IF THIS HAS BEEN REPORTED TO YOU.",
        "vin": "1FMCU9GD5JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/30/2021",
        "dateOfIncident": "04/24/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414643,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 FORD ESCAPE. THE CONTACT STATED UPON STARTING THE VEHICLE, THE VEHICLE WOULD SHUDDER WITH THE CHECK ENGINE WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO WALDORF FORD, INC. (2440 CRAIN HWY, WALDORF, MD 20601) WHERE IT WAS DIAGNOSED WITH COOLANT LEAKING INTO THE ENGINE. THE CONTACT WAS INFORMED THAT THE HEAD GASKET NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE AND STATED THAT SHE WOULD RECEIVE A CALLBACK. THE FAILURE MILEAGE WAS APPROXIMATELY 83,344.",
        "vin": "1FMCU0GDXJU"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/23/2021",
        "dateOfIncident": "04/12/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413486,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEEL BEARING FAILURE",
        "vin": "1FMCU0GD0JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/19/2021",
        "dateOfIncident": "04/05/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11412874,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "COOLANT LEAKED INTO THE ENGINE.  TOOK 2018 FORD ESCAPE SE 4X4 TO DEALERSHIP AND WAS TOLD AN ENGINE BLOCK AND OTHER PARTS NEED TO BE REPLACED.  ONLY HAD 34,500 MILES.",
        "vin": "1FMCU9GD3JU"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/18/2021",
        "dateOfIncident": "04/03/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408686,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "COMING DOWN THE FREEWAY IN NEVADA, IT BEGAN TO FEEL LIKE WE RAN OVER SOMETHING IN THE ROAD OVER AND OVER. THERE WAS A SHAKING IN THE STEERING/WHEELS SO FELT LIKE IT KEEP HITTING BUMPS IN THE ROAD. IT PROGRESSIVELY GOT WORSE. WE FINALLY REALIZED THAT IT MAY BE THE TRACTION CONTROL SYSTEM. WHEN IT WAS TURNED OFF, IT BEGAN TO CORRECT. BUT IT TURNED ITSELF BACK ON BY ITSELF.",
        "vin": "1FMCU9694JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/29/2021",
        "dateOfIncident": "09/30/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405447,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "JUNE 2018 PURCHASED BRAND NEW FROM THE LOCAL DEALER.  SEPTEMBER 2019 BROUGHT TO DEALERSHIP FOR ENGINE TROUBLE.  ENGINE NEEDS TO BE REPLACED.  REPEATED CALLS - WAITING ON PARTS, YOU ARE NEXT, WAITING ON ENGINE FROM FORD.  FINALLY PICKED UP ON DECEMBER 19, 2019 (3 MONTHS!).  TOWED TO DEALERSHIP ON 12/20/19.  QUICK CONNECT HOSE INSTALLED WRONG.  SPRING 2020 TOWED AGAIN TO DEALERSHIP, NOT STARTING.  GROUND CABLE,  OCTOBER 2020 FLY WHEEL NEEDED  TO BE REPLACED, AGAIN TROUBLE GETTING THE PART.  JANUARY 27, 2021 OXYGEN SENSOR, TROUBLE GETTING THE PART.  MARCH 9, 2021 AGAIN BACK TO DEALERSHIP FOR ENGINE TROUBLE.  AGAIN, THE ENGINE NEEDS TO BE REPLACED.  IS 28,000MILES THE NEW ACCEPTABLE STANDARD FOR AN ENGINE TO LAST?  WE ARE GOING ON ENGINE NUMBER THREE.  DEFINITELY AN ENGINE DEFECT!",
        "vin": "1FMCU9GDXJU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/24/2021",
        "dateOfIncident": "03/17/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404763,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION IS GOING BAD. THE TRANSMISSION STARTED MAKING NOISE AND STUTTERING. IT WAS STATIONARY WHEN IT WAS FIRST NOTICED. AS SOON AS I TURNED THE CAR ON AND SWITCHED GEARS THE TRANSMISSION STARTED WITH A WHIRRING NOISE. TOOK IT TO A GARAGE AND THEY TOLD ME IT IS THE TRANSMISSION PUMP. WHICH IS A KNOWN ISSUE WITH THESE VEHICLES.",
        "vin": "1FMCU9GD4JU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/14/2021",
        "dateOfIncident": "03/11/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402853,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2018 FORD ESCAPE LOST THE TRANSMISSION ON 24/27 ALBEMARLE ROAD. I WAS TAKING MY SON FOR DOCTORS CHECKUP. I WAS LUCKY THERE WAS SO MUCH TRAFFIC ON MY WAY. SOMEONE COULD HAVE HIT OUR VEHICLE FROM THE REAR. I MANAGED TO PULL OFF TO THE ROAD. THIS WOULD HAVE COSTED OUR LIFE'S HAS SOMEONE HIT US FROM THE REAM.",
        "vin": "1FMCU9GD4JU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/09/2021",
        "dateOfIncident": "03/08/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400038,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING WITH MY DAUGHTER WHEN MY 2018 FORD ESCAPE SHOOK HARD AND TRANSMISSION OR WARNING LIGHT POPPED ON. WE SWERVED TO THE SIDE OF THE ROAD. I PUSHED IT A BLOCK BACK TO MY HOUSE. I NOTIFIED FORD AND THEY TOWED IT TO WALT SWEENEY ON GLENWAY IN CINCINNATI. WALT SWEENEY DIDN'T WANT TO GIVE ME A LOANER CAR BECAUSE THEIR POLICY IS TO LOOK AT THE VEHICLE BEFORE LOANING ONE OF THEIRS OUT. I WENT TO ENTERPRISE RENTAL WHERE I WOULD HAVE TO PAY OVER 400. FOR A CAR FOR TWO DAYS. I DON'T EVEN HAVE A TICKET ON RECORD. I CALLED FORD AND TOLD THEM I BOUGHT THE CAR NEW AND HAVE BEEN THE ONLY OWNER. IT HAS 47000 MILES ON IT. THERE IS NO WAY THE TRANSMISSION WENT BAD BECAUSE IF ME. IT IS A CLOSED UNIT. FORD SAID THERE WAS NO WAY THEY COULD PAY ENTERPRISE FOR A RENTAL. THE ONLY WOULD PAY ME BACK. I COULDN'T AFFORD THE RENTAL CAR THEN AND CAN'T NOW. THIS POLICY IS FOR THE POORER PERSON WHO CAN'T AFFORD A RENTAL, SO FORD DOESN'T HAVE TO PAY THEM BACK. I'M DISGUSTED BY FORD TAKING ADVANTAGE OF PEOPLE WHO NEED THE MOST HELP. I CALLED FORD OVER AND OVER AND NO MATTER WHO I TALKED TO I WAS TOLD TOO BAD. I WALKED THE HALF MILE TO SWEENEY AND BROKE DOWN CRYING. THEY WERE KIND ENOUGH TO DO THE RIGHT AND LEGAL THING WHEN FORD REFUSED  THE BOTTOM LINE IS THAT FORD SOLD A FAULTY NEW VEHICLE, IT BROKE DOWN AND THEY REFUSED TO GET ME A RENTAL CAR UNLESS I HAD OVER 400. TO RENT THE CAR. THIS DOESN'T INCLUDE IF IT WAS MORE THEN 2 DAYS. SWEENEY, NOTIFIED ME THAT MY CAR NEEDS A TOTAL TRANSMISSION OVERHAUL AND A TORQUE CONVERTER REPLACED. SO NOW THEY ARE OFFERING A RENTAL AFTER I COULD HAVE LOST MY JOB, BUT YET AGAIN IT IS 300 DOWN AND I HAVE TO WAIT FOR A PART BACK. THERE ARE REPORTS ALL OVER THE INTERNET ABOUT FAULTY TRANSMISSIONS IN THIS YEAR FORD.I CAME AFFORD A MONTH OF RENTAL PAYMENTS, LET ALONE A WEEK",
        "vin": "1FMCU0F78JU"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/03/2021",
        "dateOfIncident": "01/20/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398830,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "COOLENT LEAKAGE INTO ENGINE BLOCK.",
        "vin": "1FMCU0GD7JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/02/2021",
        "dateOfIncident": "02/22/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398754,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A NEW 2018 FORD ESCAPE IN 2018. ON FEBRUARY 22, 2021, MY ESCAPE, WITH ONLY 32,264 MILES, WHILE DRIVING AT NIGHT, A DASH INDICATOR LIGHT CAME ON, HIGH TEMPERATURE PULL OVER IMMEDIATELY. I CONTACTED JC. LEWIS FORD IN SAVANNAH, GA AND WAS TOLD TO HAVE THE CAR TOWED TO THEIR DEALERSHIP, WHICH IS WHERE I HAD PURCHASED THE CAR. SERVICE DEPARTMENT SAID IT HAD NO COOLANT AND WOULD NEED TO KEEP THE CAR UNTIL END OF WEEK, SAID THEY HAD NO LOANER CARS AVAILABLE. FOUR DAYS GO BY, NO WORD, CALLED SERVICE DEPARTMENT, AGAIN TOLD NO COOLANT. MY HUSBAND DEMANDED A LOANER DUE TO THE FACT THIS IS THE SECOND CAR THEY SOLD TO US WITH KNOWN PROBLEMS. WE PURCHASED A 2014 FOCUS IN 2014, ENGINE PROBLEMS IN 2018 AT 62,000 WHICH FORD DENIED OUR CLAIM TO COVER THE $9000 REPAIR SO WE ENDED UP PURCHASING THE ESCAPE. ON MONDAY, MARCH 1,2021, JC LEWIS FINALLY PROVIDED A LOANER CAR AND LATER THAT SAME DAY SAID THE ESCAPE NEEDS A NEW ENGINE. I TOLD THE SERVICE DEPARTMENT NO WARNING LIGHTS HAD EVER COME ON ABOUT LOW COOLANT AND PRIOR TO HAVING THE CAR TOWED I RAN A SYSTEM CHECK ON THE ENGINE AND IT STATED ALL SYSTEMS NORMAL WHICH I TOOK A PHOTO.   THIS VEHICLE SHOULD BE RECALLED AND I SHOULD NOT HAVE TO BE CONCERNED THAT THE NEXT ENGINE THEY PUT IN WILL DO THE SAME THING AND WILL BE AT MY EXPENSE SINCE MOST LIKELY THE WARRANTY WILL NOT BE IN EFFECT. I'VE READ MANY ESCAPE OWNERS THAT HAD REPLACEMENT ENGINES FAILED ALSO.",
        "vin": "1FMCU0HD3JU"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/17/2021",
        "dateOfIncident": "02/17/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396651,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPLAINT REAR WINDOW SHATTER OF 2018 FORD ESCAPE:  REAR WINDOW GLASS SHATTERED ON LIFTGATE PANEL DOOR, (UNKNOWN REASON) TWICE SINCE BOUGHT FROM FORD DEALERSHIP, FEBRUARY 2020.  GLASS SHATTERED ON 11/28/20 (WAS REPLACED) AND AGAIN, ON 2/17/21.  CAR WAS PARKED AND UNDISTURBED IN MY DRIVE WAY, BOTH OCCURRENCES. NOTHING AROUND IT OR IN IT TO POSSIBLY CAUSE ANY SHATTERING.  THERE MUST BE SOME SORT OF ISSUE GOING ON WITH THE GLASS OR INTERIOR CABIN PRESSURE TO THE GLASS OF THIS MODEL, FORD DEFECT??   BRAND NEW WINDOW INSTALLED ON 11/28/20, AND 2 1/2 MONTHS LATER, SAME TYPE OF SHATTER TO WINDOW, WHEN CLOSED MY CAR DOOR, HEARD THE NOISE OF GLASS SHATTERING, MOST ALL OF IT ALL CAVED IN AND FELL INTO THE CAR IN TINY PIECES, JUST LIKE THE FIRST OCCURRENCE.",
        "vin": "1FMCU0GD3JU"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/17/2021",
        "dateOfIncident": "02/17/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396655,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPLAINT REAR WINDOW SHATTER OF 2018 FORD ESCAPE:  REAR WINDOW GLASS SHATTERED ON LIFTGATE PANEL DOOR, (UNKNOWN REASON) TWICE SINCE BOUGHT FROM FORD DEALERSHIP, FEBRUARY 2020.  GLASS SHATTERED ON 11/28/20 (WAS REPLACED) AND AGAIN, ON 2/17/21.  CAR WAS PARKED AND UNDISTURBED IN MY DRIVE WAY, BOTH OCCURRENCES. NOTHING AROUND IT OR IN IT TO POSSIBLY CAUSE ANY SHATTERING.  THERE MUST BE SOME SORT OF ISSUE GOING ON WITH THE GLASS OR INTERIOR CABIN PRESSURE TO THE GLASS OF THIS MODEL, FORD DEFECT POSSIBLY??   BRAND NEW WINDOW INSTALLED ON 11/28/20, AND 2 1/2 MONTHS LATER, SAME TYPE OF SHATTER TO WINDOW, WHEN CLOSED MY CAR DOOR, HEARD THE NOISE OF GLASS SHATTERING, MOST ALL OF IT ALL CAVED IN AND FELL INTO THE CAR IN TINY PIECES, JUST LIKE THE FIRST OCCURRENCE.",
        "vin": "1FMCU0GD3JU"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/17/2021",
        "dateOfIncident": "11/28/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396656,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 FORD ESCAPE. THE CONTACT STATED THAT WHILE PARKED, THE REAR WINDOW FRACTURED FROM TOP TO BOTTOM AND LEFT TO RIGHT. THE REAR WINDOW THEN SHATTERED WITHOUT IMPACT NEAR THE LIFTGATE. THE CONTACT STATED THAT THERE WERE NO SIGNS OF AN IMPACT TO THE WINDOW. THE FAILURE HAD OCCURRED TWICE. THE CONTACT TOOK THE VEHICLE AND HAD THE GLASS REPLACED BY A CERTIFIED GLASS COMPANY THROUGH THE INSURANCE THE FIRST TIME THE FAILURE OCCURRED. THE SECOND TIME THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 30,000.",
        "vin": "1FMCU0GD3JU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/14/2021",
        "dateOfIncident": "02/12/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396142,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STEERING STIFF AND DOES NOT UNLOCK AFTER STARTING. MUST WORK MOVING STEERING WHEEL FORCE ABLE TO UNLOCK TO DRIVE. ALSO MAKES NOISE WHEN DRIVING AND TURNING THE WHEEL. I THOUGHT IT WAS A LOW BATTERY TAKING/CONSERVING POWER; HOWEVER UPON TAKING TO FORD DEALERSHIP IT WAS DIAGNOSED THAT MY RACK AND PINION NEEDS REPLACED. MY 2018 FORD ESCAPE HAS APPROXIMATELY 46,000 MILES AND IS OUT OF WARRANTY. THE FORD TECHNICIAN INDICATED THIS WAS AN UNUSUAL REPAIR DUE TO THEY USUALLY DON'T SEE THIS REPAIR ON VEHICLES THAT HAVE LOW MILEAGE AND IT'S ABOUT 100,000 MILES LESS THAN HE USUALLY SEES. IT IS A DRIVING HAZARD AND COULD HAVE WENT OUT COMPLETELY WHILE I WAS DRIVING. SO DISAPPOINTED AND FEEL THERE IS A DEFINITE FACTORY-PROBLEM. I BOUGHT THIS VEHICLE NEW.",
        "vin": "1FMCU9GD2JU"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/09/2021",
        "dateOfIncident": "02/06/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395351,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR SEAT BELT BUCKLE (DRIVER SIDE) IS NOT HOLDING THE BELT, DAMAGED",
        "vin": "1FMCU0GD6JU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/09/2021",
        "dateOfIncident": "12/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395441,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SYNC SYSTEM STOPPED WORKING. I WAS TOLD IT WAS THE APIM MODULE. THE VEHICLE HAS TO BE DRIVEN FOR QUITE SOME TIME (UNTIL IT WARMS UP?) WHEN THE CAR IS TURNED OFF AND BACK ON THE SYNC SYSTEM MIGHT START WORKING.",
        "vin": "1FMCU9GD9JU"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/09/2021",
        "dateOfIncident": "06/03/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395485,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK VEHICLE IN FOLLOWING A RECALL NOTICE FOR CONTROLLER MODULE. TWO MONTHS LATER THE CHECK ENGINE LIGHT CAME ON. TOOK VEHICLE BACK AND IT RESULTED IN A COOLANT LEAK INTO THE CYLINDER. THE BLOCK WAS WARPED AND NEEDED TO BE REPLACED, AS WELL AS A NEW FLYWHEEL AND HEAD GASKET. SIX MONTHS LATER, THE VEHICLE SHIFTED HARD AND THEN STOPPED BEING ABLE TO MOVE. THIS RESULTED IN A SECOND FLYWHEEL BEING INSTALLED ALONG WITH A NEW TRANSMISSION PUMP, SEALS, AND TORQUE CONVERTER. STILL DOES NOT RUN CORRECTLY AND THE AUTOMATIC SHUT OFF DOES NOT WORK. VEHICLE HAS HAD A SINGLE OWNER AND LESS THAN 35,000 MILES ON IT. BELIEF IS THAT THESE PROBLEMS ARE A RESULT OF A POORLY DESIGNED ENGINE AND THE ORIGINAL RECALL.",
        "vin": "1FMCU0HD3JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/04/2021",
        "dateOfIncident": "01/31/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394647,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 FORD ESCAPE. THE CONTACT STATED THAT THE CHECK ENGINE WARNING LIGHT WAS ILLUMINATED. THE CONTACT TOOK THE VEHICLE TO LOCAL MECHANIC WHO RESET THE WARNING LIGHT AND STATED THERE WAS NO ISSUE WITH THE VEHICLE. AFTER CHANGING THE COIL THE FAILURE PERSISTED. WHILE DRIVING 40 MPH THE VEHICLE STALLED AND SHUT-OFF IN THE ROAD. THE CONTACT RESTARTED THE VEHICLE AND DROVE THE VEHICLE HIS RESIDENCE. THE CONTACT HAD THE VEHICLE TOWED TO THE LOCAL DEALER GREAT LAKES FORD OF MUSKEGON (2469 E. APPLE AVE, MUSKEGON, MI 49442) TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT COOLANT WAS LEAKING INTO THE ENGINE BLOCK AND THE ENGINE NEEDED TO BE REPLACED OR REPAIRED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 95,000.",
        "vin": "1FMCU9GD9JU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/21/2021",
        "dateOfIncident": "01/20/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389205,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AT THE 32,000 MILE ROUTINE SERVICE THE REAR BRAKE ROTORS AND PADS HAD TO BE REPLACED FOR, IMHO, PREMATURE WEAR.  BOTH REAR ROTORS WERE DEEPLY SCORED ON THEIR OUTSIDE FACES, WHILE THE OUTSIDE PADS WERE WORN DOWN THEIR WEAR SLOTS AND THE INSIDE PADS WERE HARDLY WORN AT ALL.  THE SERVICE MANAGER SAID THIS WAS NORMAL WEAR AND TEAR AND BLAMED THE UNEVEN WEAR ON DIRTY PAD SLIDE PINS.  HE COULDN'T ACCOUNT FOR THE DEEP SCORING.  MY EXPERIENCE OVER 6 DECADES OF VEHICLES IS THAT PADS SHOULD LAST 40,000 MILES AND ROTORS 100,000 MILES OR MORE.",
        "vin": "1FMCU9HD5JU"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/18/2021",
        "dateOfIncident": "01/18/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388742,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 26,000 MILES HAD A FULL ENGINE REPAIR DUE COOLANT ISSUE. FORD HAD MY CAR FOR 3 MONTHS. LESS THAN A FEW DAYS AFTER GETTING IT BACK HAD A FRONT CRANK SEAL LEAK DUE A DEFECTIVE PART. 3 MONTHS LATER CAR IS NOW THROWING HIGH TEMP/ENGINE FAULT CODES AND GOING INTO LIMP MODE. DEALER STATES ITS A DEFECTIVE RADIATOR. HAD THAT REPLACED THEN 4 DAYS LATER CAR WENT INTO HIGH TEMP/LIMP MODE AGAIN. WAITING TO HEAR WHAT'S WRONG NOW WITH THIS CAR. ALL THESE ISSUES HAVE HAPPENED WHILE DRIVING ON HIGHWAYS.",
        "vin": "1FMCU9GD0JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/10/2021",
        "dateOfIncident": "01/08/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387353,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT A USED 2018 ESCAPE 1.5L IN JUNE 2019. JAN 5 I WENT TO CRANK IT AND IT WAA PUTTERING. WAS LOW ON GAS AND ON AN INCLINE SO THOUGHT THAT WAA THE PROBLEM. GOT GAS AND WAS FINE THE NEXT FINE. BUT THE 8TH...WENT IT CRANKED IT I HEARD WATER SLOSHING.  LOOKED UP SOME STUFF AND HAD SOME MECHANIC FRIENDS LOOK AT IT AND TOLD ME IT WAS A BLOWN HEAD GASKET  COOLANT WAS LOW. SO WENT TO ADD NORE AND IT SMELLS LUKE GAS. AND MY EXHAUST SMELLS LIKE ANTIFREEZE. WAS TOLD THAT THIS IS SOMETHING WITH THIS YEAR MODEL.   SO NOW I HAVE IT IN THE SHOP HOPING IT GETS FIXED SOON. APPARENTLY THIS NEEDS TO BE RECALLED.  I HAVE 55465 MILES ON IT.",
        "vin": "1FMCU0GD1JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/05/2021",
        "dateOfIncident": "01/04/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386571,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED THIS VEHICLE NEW 1DEC 2018. I BROUGHT THIS VEHICLE IN FOR SMELLING COOLANT AFTER DRIVING. VEHICLE HAS 11134 MILES. DEALER TOLD ME THAT I HAD A LEAK IN THE NUMBER 3 CYLINDER AND IT NEEDED A SMALL BLOCK REPLACEMENT. DEALER LEFT ME STRANDED AT DEALERSHIP AND 50 MILES FROM HOME. THEY DID OFFER ME A RENTAL VEHICLE WHICH I DECLINED. VEHICLE IS STILL ON BUMPER TO BUMPER WARRANTY. DEALER CANNOT GIVE ME TIME FRAME FOR ENGINE REPLACEMENT. ONE OF THE WORST CAR EXPERIENCES I HAVE EVER HAD. WISH THEY WOULD TAKE VEHICLE BACK AND I CAN PURCHASE SOMETHING MORE RELIABLE OTHER THAN FORD.",
        "vin": "1FMCU9GD1JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/29/2020",
        "dateOfIncident": "11/29/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385375,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS LOSING COOLANT AT 43,000 MILES I FILLED IT TO THE MAX AT 47,000 IT IS BELOW THE MINIMUM THIS IS A KNOWN ISSUE WITH THE ESCAPES BUT NO RECALL FOR MINE",
        "vin": "1FMCU9HD7JU"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/26/2020",
        "dateOfIncident": "12/20/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384976,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DEC.20,2020, MY CAR PARK IN MY DRIVE WAY, START UP AND THE ENGINE RUNNING VERY ROUGH AND DISPLAY HAS A CODE FLASHING ( ENGINE ).  TECH INFO ME THAT NUMBER 4 PLUG MISFIRE, ADD COOLANT, RESET CODE PO316 AND PO304.  TECH SAID THAT THERE IS A TSB20-2100 ?",
        "vin": "1FMCU9HDXJU"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/23/2020",
        "dateOfIncident": "12/14/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384658,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN MOTIION (TAKING OFF AND DURING DRIVE) THE CAR 'CUTS BACK' AND DOESN'T PICK UP SPEED CAUSING DRIVER OF VEHICLE TO COMPLETELY PRESS THE GAS PEDAL TO INCREASE SPEED(ONLY SOMEWHAT GRADUALLY AFTER ANOTHER CUTBACK).  THIS HAPPENS WHILE TRAVELING ON HIGHWAYS AND ON CITY STREETS OR COUNTRY ROADS.  IN ADDITION, WHEN PUTTING CAR IN REVERSE (TO PARK OR PULL OUT OF PARKING SPACE) THE CAR EITHER TURNS OFF OR DOESN'T MOVE BACK WHEN PRESSING THE GAS PEDAL.",
        "vin": "1FMCU9G93JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/17/2020",
        "dateOfIncident": "12/08/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383998,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SECOND SERVICE AT FORD DEALERSHIP AFTER \"CHECK ENGINE\" LIGHT DISPLAYED.  COOLANT STATES AS IT NEEDS TO BE FILLED.  WAS TOLD BY SERVICE MANAGER ENGINE NEEDS TO BE REPLACED DUE TO DAMAGE CAUSED BY STRUCTURAL PROBLEM WHERE COOLANT LEAKS INTO ENGINE.  VEHICLE HAS 18000 MILES AND SERVICED APPROPRIATELY.  CHECK ENGINE LIGHT APPEARED WHEN IN MOTION.  WAS TOLD BY SERVICE MANAGER THIS IS A KNOWN PROBLEM WITH 2018 ESCAPES.",
        "vin": "1FMCU9HD4JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/09/2020",
        "dateOfIncident": "11/30/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378687,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BROUGHT MY VEHICLE IN ON JULY 13TH, 2020 (55,785 MILES) DUE TO A RECALL NOTICE I RECEIVED. THE RECALL WAS FOR A POWERTRAIN REPROGRAMMING DUE TO COOLANT LEAKING INTO THE CYLINDER BORES. REPROGRAMMING WAS PERFORMED ALONG WITH AN OIL CHANGE. ON NOVEMBER 30, 2020 (CLOSE TO 66K MILES) MY CHECK ENGINE CAME ON. TOOK IT TO AUTO ZONE SO THEY COULD READ THE CODE. IT WAS SHOWING MISFIRING ON CYLINDER 3. ON  DECEMBER 1ST, I TOOK IT TO MARJENHOFF TRANSMISSIONS (FAMILY FRIEND). HE HOOKED IT UP TO RUN DIAGNOSTICS AND IT SHOWED THAT CYLINDER 3 HAD MISFIRED OVER 100 TIMES. ALSO, MY COOLANT WAS SUPER LOW. I PICKED IT UP DECEMBER 3RD AND WAS TOLD TO KEEP AN EYE ON MY COOLANT LEVEL UNTIL I GET IT TO THE DEALERSHIP ON DECEMBER 7TH. ENDED UP HAVE TO TOP OFF MY COOLANT ON THE 5TH. DROPPED IT OFF AT AUTONATION FORD ON THE 7TH TO HAVE THEM RUN DIAGNOSTICS ON WHAT I STATED WAS HAPPENING. RESULTS DID END UP COMING BACK THAT THE EXACT PROBLEMS THAT WERE STATED IN THE RECALL IS WHAT WAS HAPPENING WITH MY VEHICLE. I WAS TOLD THAT I WOULD NEED MY SHORT BLOCK REPLACED. SINCE I WAS NO LONGER UNDER POWERTRAIN WARRANTY THEY WOULD NOT BE ABLE TO COVER THE COST. SHE THEN TOLD ME THAT SHE REACHED OUT TO FORD TO SEE IF THEY WOULD COVER THE COST IN FULL OR OFFER AN AMOUNT TOWARDS THE REPAIR. IT'S DECEMBER 9TH AND IM WAITING TO HEAR BACK. I FEEL THAT I AM NOT RESPONSIBLE FOR THIS REPAIR EVEN THOUGH I AM OUT OF WARRANTY DUE TO IT BEING A FACTORY DEFECT. THIS SHOULD HAVE NOTHING TO DO WITH WARRANTY.",
        "vin": "1FMCU9GD0JU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/23/2020",
        "dateOfIncident": "11/20/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11375960,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD A HEAD ON COLLISION AND THE AIR BAGS DIDN'T DEFLATE.",
        "vin": "1FMCU0F79JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/11/2020",
        "dateOfIncident": "09/02/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363770,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 FORD ESCAPE HAS 10,000 MILES ON IT. MY COOLANT IS BACKING UP INTO MY ENGINE. CALLED THE DEALERSHIP ON SEPTEMBER 2ND, 2020. THEY STATED THIS IS A COMMON PROBLEM. IT'S NOW OCTOBER 11TH, 2020 AND THEY STILL DON'T HAVE MY CAR IN. THEY STATED THEY DON'T HAVE ANY LOANER CARS TO GIVE OUT. THEY WILL NEED MY CAR FOR A MINIMUM OF 3 WEEKS. WHY ARE THEY ABLE TO SELL CARS WITH BAD ENGINES.",
        "vin": "1FMCU0HD7JU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/08/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363427,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 FORD ESCAPE. THE CONTACT STATED THAT AFTER PARKING THE VEHICLE ON AN INCLINE OR A DECLINE, TRANSMISSION FLUID LEAKED FROM THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE TRANSAXLE WAS DEFECTIVE. THE TRANSAXLE WAS REPLACED HOWEVER, THE FAILURE PERSISTED. THE LOCAL DEALER DCH FORD OF THOUSAND OAKS LOCATED AT 3810 THOUSAND OAKS BLVD, WESTLAKE VILLAGE, CA 91362 AND THE MANUFACTURER WERE NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 50,000.",
        "vin": "1FMCU0F7XJU"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/02/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362340,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 FORD ESCAPE PURCHASED NEW FROM DEALERSHIP IN FEBRUARY OF 2018, ON A STRAIGHT AWAY FELT LIKE THE ENGINE PULLING ITSELF BACK THEN FLASHED AUTO START/STOP PUT IN P AND RESTART. LOST ALL ENGINE POWER ON A BUSY HIGHWAY. COASTED TO A PARKING LOT. ENGINE WOULD NOT STOP. NO CODES WERE SHOWING. NO CHECK ENGINE LIGHTS. HAS HAD OIL CHANGED EVERY 5K TO 5500 MILES. ALL MAINTENANCE PER MANUAL COMPLETED WHEN DUE. ENGINE NEEDING REPLACED AT 81K MILES.",
        "vin": "1FMCU9GD2JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/22/2020",
        "dateOfIncident": "04/09/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360592,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE FAILURE AT 10K COOLANT LEAKING INTO CYLINDER WALL. LOOK ONLINE AND ALL I SEE IS 2018 AND 2019 FORD ESCAPE 1.5 TURBO COOLANT LEAK ENGINE FAILURE..FORD NEEDS TO OWN THIS AND THIS NEEDS A RECALL.",
        "vin": "1FMCU9HD4JU"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/01/2020",
        "dateOfIncident": "08/30/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352548,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "RECURRENT PROBLEMS WITH COOLANT LEAKING.  ENGINE REPLACED ONCE, NOW LEAKING AGAIN. RECURRENT PROBLEMS WITH THE SPARK PLUGS. CHECK ENGINE LIGHT IS ON, CAR SHAKES WHEN DRIVING, UNABLE TO DRIVE WITH AIR-CONDITIONING ON",
        "vin": "1FMCU9GD1JU"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/27/2020",
        "dateOfIncident": "05/20/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351494,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 62,000 MILES TRANSMISSION HAD TO BE REPLACED AT MY EXPENSE   NOW AT 75,000MILES MISFIRE ON CYLINDER 3 CODE P0203 STILL WAITING TO BE FIXED  THEN OVER HEAT WARNING LIGHT WOULD COME ON AND THEN GO OFF WHILE DRIVING",
        "vin": "1FMCU9GD3JU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "08/20/2020",
        "dateOfIncident": "08/13/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11350489,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 FORD ESCAPE. THE CONTACT STATED WHILE HIS WIFE PARKED THE VEHICLE INTO A UPHILL DRIVEWAY, WHEN EXITING THE VEHICLE IT BEGAN TO ROLL DOWN THE DRIVEWAY HILL. THE CONTACT STATED THE WIFE DID NOT HAVE THE EMERGENCY BRAKES ACTIVATED AND THE GEAR WAS IN PARK. THE CONTACT STATED THE VEHICLE CRASHED INTO A TREE ACROSS THE STREET WHILE HIS GRANDCHILD WAS STILL SEATED ON A CAR SEAT AT THE REAR PASSENGER SIDE.  AIR BAGS DID NOT DEPLOY. THE CONTACT STATED HIS WIFE HAD SUSTAINED INJURIES ON BOTH KNEES AND WAS TAKEN TO THE HOSPITAL AND SOUGHT MEDICAL ATTENTION. A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS NOT DRIVABLE. THE VEHICLE WAS TOWED TO BODY SHOP TO HAVE THE COSMETIC REPAIRS.  THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED AS OF YET. A DEALER WAS NOT CONTACTED. THE MANUFACTURER HAD NOT BEEN INFORMED OF FAILURE. THE FAILURE MILEAGE WAS 57,000. THE VIN WAS NOT  AVAILABLE.",
        "vin": "1FMCU9GD1JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/19/2020",
        "dateOfIncident": "08/18/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350291,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WENT IN FOR RECALL OF POWERTRAIN CONTROL MODULE SOFTWARE TWEAK FIELD SERVICE ACTION # 19B37, THEY RAN AN ADD'L TEST AND NOW ARE REPLACING THE ENGINE NEXT WEEK. I MEAN, THANK YOU AND ALL, BUT THE CAR HAS BEEN FINE -- THERE GOES MY RESALE VALUE.",
        "vin": "1FMCU9HD7JU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/11/2020",
        "dateOfIncident": "08/10/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348631,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DIFFICULTY STARTING.  STATIONARY",
        "vin": "1FMCU9G92JU"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/11/2020",
        "dateOfIncident": "08/10/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348689,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE LONG BLOCK WAS REPLACED, FOLLOWED BY A FRONT MAIN SEAL FAILURE AND REPLACEMENT. AFTER PICKING UP VEHICLE FROM SERVICE, AFTER ABOUT 1000 MILES THE ENGINE LOST OIL A 3RD TIME AND CAR WENT INTO \"LIMP MODE\" AND GAVE A CEL.",
        "vin": "1FMCU9GD8JU"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/07/2020",
        "dateOfIncident": "08/06/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343881,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 FORD ESCAPE. THE CONTACT STATED WHILE HIS WIFE WAS AT A STAND STILL AT A GAS STATION, THE TIRE PRESSURE WARNING LIGHT ILLUMINATED. THE DRIVER CONTINUED TO DRIVE TO HER WORK AREA. THE DRIVER PARKED THE VEHICLE AND WHEN EXITING SHE HEARD A LOUD NOISE AND SAW THE REAR DRIVER'S SIDE TIRE HAD A PIECE OF METAL INSERTED. THE DRIVER CALLED AAA AND THEY WERE UNABLE TO CHANGE THE TIRE DUE TO THE LUG NUTS. THE CONTACT STATED AAA HAD TO CALL A THIRD PARTY TO ASSIST WITH CHANGING THE TIRE. THE VEHICLE WAS TAKEN TO LOCAL DEALER MULLINAX FORD OF CENTRAL FLORIDA LOCATED AT 1551 E SEMORAN BLVD, APOPKA, FL 32703, (407) 890-0557, WHERE IT WAS DIAGNOSED WITH NEEDING LUG NUTS TO BE REPLACED. THE VEHICLE HAD NOT BEEN REPAIRED AS OF YET. THE MANUFACTURER HAD NOT BEEN INFORMED OF FAILURE. THE FAILURE MILEAGE WAS 49,002.",
        "vin": "1FMCU0GD6JU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/07/2020",
        "dateOfIncident": "08/06/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343898,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ONE DAY AFTER WORK, THE AC SUDDENLY STOPPED WORKING. UPON RETURNING HOME, WE NOTICED A BURNING RUBBER SMELL. WE TOOK THE VEHICLE TO THE DEALERSHIP, FROM WHICH WE HAD PURCHASED THE VEHICLE FROM 4 MONTHS PRIOR. THEY LOOKED AT THE VEHICLE, AND DIAGNOSED THAT THE AC COMPRESSOR HAD LOCKED UP, AND THE BURNING RUBBER SMELL WAS FROM THE BELT. THEY THEN QUOTED US ROUGHLY $3500-$3600 TO FIX THE ISSUE, IN THAT IT WOULD INCLUDE THE ENTIRE AC COMPRESSOR KIT, CONDENSOR, AND AN AC FLUSH. IT IS A 2018, BUT WE WERE PAST THE FORD 36K WARRANTY PERIOD, SO WE DECIDED TO CALL AROUND TO OTHER SHOPS/MECHANICS. WE FINALLY DECIDED TO TAKE IT TO A MECHANIC WHOM HAD PREVIOUSLY DONE WORK FOR US, AND WE TRUSTED. PRIOR TO EVEN TAKING THE VEHICLE TO HIM, THE OTHER INDIVIDUALS WE CALLED WERE SHOCKED TO HEAR WE HAD AN AC COMPRESSOR ISSUE, ON SUCH A RECENT MODEL. HE WAS SURPRISED, AND COMES TO FIND OUT THAT THE SYSTEM IS ESSENTIALLY PROPRIETARY, SO THAT IT'S DIFFICULT TO EVEN ACQUIRE THE PARTS/FLUID REQUIRED TO WORK ON IT OUTSIDE OF A FORD DEALERSHIP. WHICH MORE SO, WE BELIEVE, POINTS TO THE FACT THAT THIS SHOULD HAVE NOT HAPPENED ON A 2018 VEHICLE. THE MECHANIC CONCLUDED THAT THE ISSUE IS THAT THE AC COMPRESSOR LOCKED UP, AND SAID IT SHOULD NOT HAVE HAPPENED ON A VEHICLE WITH ONLY 48K MILES AND A RECENT MODEL.",
        "vin": "1FMCU0J97JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/06/2020",
        "dateOfIncident": "03/27/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343798,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED OUR ESCAPE (NEW) FROM THE DEALER IN MARCH 2018. IN MARCH OF 2019, OUR CHECK ENGINE LIGHT KICKED ON (ENGINE HAD JUST OVER 12,000 MILES ON IT). CODE READER INDICATED A MISFIRE. WE TOOK IT TO THE DEALER AND THEY TOLD US THAT COOLANT WAS FOUND IN THE #2 CYLINDER AND THAT THE ENGINE NEEDED TO BE REPLACED. ENGINE WAS REPLACED UNDER WARRANTY AT NO COST TO US. IN JULY 2020, OUR ESCAPE STARTED EXHIBITING THE SAME PROBLEMS (ROUGH STARTS, LOW COOLANT IN OVERFLOW RESERVOIR). WE TOOK IT TO THE DEALER (THIS TIME THE CHECK ENGINE LIGHT DIDN'T KICK ON), AND THEY TOLD US COOLANT INTRUSION HAD HAPPENED AGAIN AND THAT THE ENGINE NEEDED TO BE REPLACED AS WELL AS THE TURBO CHARGER. ENGINE WAS REPLACED UNDER WARRANTY AT NO COST TO US. ENGINE HAD JUST OVER 24,000 MILES ON IT.",
        "vin": "1FMCU9HD1JU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/03/2020",
        "dateOfIncident": "02/20/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342977,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MOST OF THE TIME THAT I START THE VEHICLE IT MAKES A SQUEALING SOUND, IT ONLY LASTS AS LONG AS I AM IN PARK OR IF I AM IN REVERSE. ONCE I PUT THE VEHICLE INTO DRIVE THE SOUND STOPS. I HAVE TAKEN THE VEHICLE INTO THE DEALERSHIP ON MORE THAN ONE OCCASION AND I HAVE EVEN RECORDED THE SOUND BUT I HAVE BEEN TOLD THAT THERE IS NO NOISE. ANOTHER ISSUE THAT I HAVE HAD IS A FOUL ODOR COMING FROM THE VENTS. IT ORIGINALLY STARTED DURING THE WINTER MONTHS, THEN CONTINUED THROUGH THE SUMMER. THIS HAPPENS EVERY TIME THAT I TURN ON THE HEATER AND SOMETIMES WHEN I TURN ON THE AC. I HAVE TAKEN IT TO THE DEALERSHIP AND ONE MECHANIC DID SMELL IT BUT THEY COULDN'T FIND ANYTHING WRONG WITH IT SO THEY PUT A CHERRY SCENT IN IT AND GAVE IT BACK TO ME. IF I NEED THE HEATER ON I HAVE TO DRIVE AROUND WITH A WINDOW OPEN TO KEEP FROM SMELLING THE BAD ODOR OF BURNT HAIR/HARSH CHEMICAL. BOTH OF THESE HAPPEN WHILE THE VEHICLE IS STATIONARY AND IN MOTION. I DROPPED MY CAR OFF ON 2/20/20",
        "vin": "1FMCU0GD9JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/03/2020",
        "dateOfIncident": "07/09/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343096,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 62,000 THE ENGINE FAULT LIGHT CAME ON. I TOOK IT TO THE DEALERSHIP AND WAS TOLD IT WAS LEAKING COOLANT INTO THE CYLINDER HEAD AND I NEEDED A NEW ENGINE. MY CAR WAS JUST AT THE DEALERSHIP 3 WEEKS PRIOR WITH NO ISSUES NOTES. I TAKE MY CAR IN FOR WORK EVERY 3 MONTHS. WHEN I WAS TOLD I NEEDED A NEW ENGINE, I WAS TOLD THIS WAS A KNOWN PROBLEM WITH THE ENGINE.",
        "vin": "1FMCU9GD2JU"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/28/2020",
        "dateOfIncident": "06/11/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341798,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE FAILURE DUE TO COOLANT INTRUSION INTO THE NO. 2 CYLINDER RESULTED IN A COMPLETE ENGINE REPLACEMENT.  AFTER TAKING 5 WEEKS TO REPAIR I PICKED UP THE VEHICLE ONLY TO HAVE THE TRANSMISSION FAIL AFTER DRIVING A COUPLE OF HUNDRED MILES.",
        "vin": "1FMCU0GDXJU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/28/2020",
        "dateOfIncident": "07/22/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341963,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE OPERATING VEHICLE, GET OVERHEAT WARNING ON INFO CENTER. PARK VEHICLE WITHIN 5 MINUTES. CHECK LEVEL NEXT DAY, NO COOLANT IN RESERVOIR. ADD ALMOST ONE GALLON OF PREMIX COOLANT. NO SIGN OF COOLANT LEAK. TWENTY MINUTES LATER CHECK ENGINE LIGHT COME ON. CONTACT LOCAL DEALER, MADE APPOINTMENT NEARLY A WEEK LATER. IN THAT TIME CHECK ENGINE LIGHT CAME ON AND SECURED ONE MORE TIME. DIAGNOSTIC COMPUTER AT DEALERSHIP, TOLD THEM TO REPLACE SHORT BLOCK.",
        "vin": "1FMCU9GD0JU"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/20/2020",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340150,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 FORD ESCAPE. CONSUMER WRITES IN REGARDS TO DEFECTIVE TIRES ON VEHICLES. *LD    THE  CONSUMER STATED THAT THE TIRES FAILED AND IT DID NOT APPEAR TO BE BY FAULT OF THE TIRE MANUFACTURER, BUT THE VEHICLE MANUFACTURER. THE VEHICLE MANUFACTURER STATED THAT THE TIRES WERE NOT COVERED UNDER WARRANTY. THE CONSUMER STATED THAT THE ELECTRONICS IN THE VEHICLE WOULD NOT POWER OFF, DRAINING THE BATTERY. THE VEHICLE OVER-HEATED AND WENT INTO LIMP MODE; THE ENGINE WAS REPLACED.",
        "vin": "1FMCU9J95JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/15/2020",
        "dateOfIncident": "06/13/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339514,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD 2.0L ECOBOOST - COOLANT IN CYLINDERS, WHITE EXHAUST SMOKE AND ILLUMINATED MIL.    PURCHASED 2018 2.0 TITANIUM FEB 2018.  MARCH 2019, AT 29,000 MILES THE ENGINE FAILED , COOLANT IN CYLINDERS. WARRANTY WORK WAS PERFORMED UNDER TSB 19-2208 BY FORD DEALERSHIP. GREENWAY FORD ORLANDO.  JUNE 2020 ,AT 62,000 MILES THE SAME REPAIRED ENGINE FAILED, COOLANT IN CYLINDERS. ENGINE TO BE REPAIRED UNDER TSB 19-2346 AT THE OWNER'S EXPENSE OF $8388 AT THE SAME FORD DEALERSHIP    FORD KNOWS THERE ARE DESIGN DEFECTS IN THIS 2.0 ECOBOOST ENGINE. PROOF OF THAT IS THE SUPERSEDED TSB FROM JUST CHANGING THE CYLINDER HEAD ( TSB19-2208) TO CHANGING THE LONG BLOCK ( TSB 19-2346) .    FORD DECLINED TWICE TO WARRANTY THE SECOND REPAIR AS THE VEHICLE WAS 2500 MILES OVER THE NEW CAR WARRANTY. ZERO SUPPORT. FORD WOULD NOT EVEN WARRANTY THE FIRST REPAIR WORK AFTER FAILING 14 MONTHS LATER.",
        "vin": "1FMCU9J9XJU"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/29/2020",
        "dateOfIncident": "06/12/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331489,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS STOPPED ON A SIDE STREET WAITING ON TRAFFIC SO I COULD PULL OUT ONTO THE MAIN ROAD. THERE WAS A BREAK IN TRAFFIC AND WHEN THE BREAK CAME I PRESSED ON GAS PEDDLE CAR TOO OFF THEN STOPPED PULLING CAR. I'M SITTING IN MIDDLE OF A MAIN STREET THAT IS VERY BUSY AND THE CAR WOULD NOT MOVE, TRANSMISSION JUST SPINNING MOTOR RACING AND CARS HEAD TOWARDS ME AT HIGH RATES OF SPEED. AFTER POLICE SHOW UP HELP ME OUT A BIT. I TRY GOING AGAIN AND AFTER BOUT 45 MIN OR SO. CAR STARTED FINE TOOK OFF NORMALLY GOT ON TO INTERSTATE AND NOW TRANSMISSION IS SLIPPING, JUMPING JURKING. TRIED REPORTING TO FORD, BUT THEY SAY MY VIN # BELONGS TO A DIFFERENT YEAR TO CALL BACK WITH RIGHT INFO. EVERY I HAVE SAYS 1 YEAR FORD HAS ANOTHER.",
        "vin": "1FMCU0F79JU"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/28/2020",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331328,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 FORD ESCAPE SE ACQUIRED ON 09/2018. AT 17000 MILES, IN 08/2019, AND DRIVING ON THE HIGHWAY, VEHICLE STARTED TO DISPLAY THE FOLLOWING MESSAGES: \"HILL START ASSIST WARNING\" \"POWERTRAIN MALFUNCTION/REDUCED POWER\" \"MALFUNCTION INDICATOR LAMP - REGULATORY\" \"ANTILOCK BRAKE FAULT\" \"RESTRAINTS INDICATOR LAMP WARNING\" \"ENGINE FAULT - SERVICE NOW\". PULLED OVER, SHUT DOWN VEHICLE, RESTARTED VEHICLE AND CONTINUED DRIVING. ABOUT 10 MILES LATER, ALL DASHBOARD INDICATOR LIGHTS TURNED ON AND COMPLETE LOSS OF ALL INSTRUMENTS (TACHOMETER, SPEEDOMETER, TEMPERATURE, MILEAGE, ETC.) AND A/C. BROUGHT IT INTO DEALERSHIP TWO DAYS LATER (EARLIEST AVAILABLE TIME) AND THEY CLAIMED IT WAS THE RESULT OF A BAD BODY CONTROL MODULE (BCM) AND REPLACED IT UNDER WARRANTY. TWO AND HALF WEEKS LATER, VEHICLE DID THE SAME THING WHILE ON THE HIGHWAY. BROUGHT IT INTO SAME DEALERSHIP AND IT WAS DETERMINED THAT IT WAS A BAD ABS MODULE AND THAT WAS REPLACED UNDER WARRANTY. IN 06/2020, WHILE DRIVING ON THE HIGHWAY THE VEHICLE EXHIBIT THE SAME BEHAVIOR AS THE PREVIOUS TWO TIMES. SHUT DOWN VEHICLE ON THE SIDE OF THE HIGHWAY AND IT WOULD NOT RESTART. AFTER 45 MINUTES VEHICLE RESTARTED AND TOOK IT TO NEAREST DEALERSHIP. THEY ACKNOWLEDGED THERE WERE ERROR/FAULT CODES, CLEARED THEM AND TEST DROVE FROM IT FOR 20 MILES AND COULD NOT FIND ANYTHING. CURRENTLY WAITING ON FORD CORPORATE TO GET VEHICLE TO A DEALERSHIP THAT CAN RESOLVE THE PROBLEM.",
        "vin": "1FMCU9GD2JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/25/2020",
        "dateOfIncident": "06/23/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330932,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "COOLANT IS LEAKING INTO THE CYLINDERS OF THIS 1.5L ENGINE AND THE BLOCK MUST BE REPLACED.  *TR",
        "vin": "1FMCU0HD5JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/20/2020",
        "dateOfIncident": "05/27/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329821,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY ENGINE LIGHT WENT ON MAY 27,2020:  WE TOOK IT TO THE DEALER MAY 28,2020.  THEY HAD TO CHECK A PRESSURE READING AND WOULDN'T KNOW THE RESULTS UNTIL MAY 29; 2020.  THIS CAR HAS 29,491 MILES AND WE BOUGHT IT NEW.  ON MAY 29 WE WERE TOLD WE WOULD NEED A NEW ENGINE.  THEY DID PROVIDE A LOANER AND DID NOT KNOW HOW LONG IT WOULD TAKE TO REPAIR.  UPON PICK UP WE DROVE IT SEVERAL BLOCKS AND THE ENGINE LIGHT CAME ON AGAIN AND WE WERE TOLD IT WAS A 'SENSITIVE' CLAMP AND WE WOULD HAVE TO WATCH IT.  *TR",
        "vin": "1FMCU9GD4JU"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/11/2020",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328328,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 FORD ESCAPE. THE CONTACT STATED THAT WHILE DRIVING AT AN UNDISCLOSED SPEED, THE VEHICLE HESITATED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO MCCARTHY FORD (11400 S PULASKI RD, CHICAGO, IL 60655, 773-239-7900) TO BE DIAGNOSED. THE CONTACT STATED THAT AN UNKNOWN REPAIR WAS PERFORMED HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE CONTACT WAS INFORMED TO HAVE THE VEHICLE TAKEN TO ANOTHER DEALER TO BE DIAGNOSED AND REPAIRED. THE TRANSMISSION WAS REPAIRED BY THE OTHER DEALER HOWEVER, THE FAILURE RECURRED. THE FAILURE MILEAGE WAS 7,000.",
        "vin": "1FMCU0F70JU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/10/2020",
        "dateOfIncident": "05/06/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328237,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2018 STARTED JERKING UPON DECELERATION AND AT ABOUT 40 MPH.  I TOOK IT TO THE FORD DEALER FROM WHICH IT WAS PURCHASED, AS IT IS STILL UNDER WARRANTY.  THERE WAS A TRANSMISSION PROBLEM.  FORD AUTHORIZED ONLY A REPAIR.  *TR    WE ALSO OWN A 2014 FORD ESCAPE WHOSE TRANSMISSION QUIT WHILE OUR 2018 WAS IN THE GARAGE FOR SERVICE.  IT IS MORE THAN COINCIDENCE THAT THEY BOTH HAVE THE EXACT SAME TRANSMISSION!  THEY ARE FAULTY AND NEED RECALLED!",
        "vin": "1FMCU9GD3JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/27/2020",
        "dateOfIncident": "05/15/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326201,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "APPROX MAY 1ST MY CHECK ENGINE LIGHT CAME ON. I PROCEEDED TO THE NEAREST AUTO STORE AND CHECKED THE CODE. AT THAT TIME I PURCHASED AIR FILTERS AS WELL AND WENT HOME AND INSTALLED THE AIR FILTERS AND CHECKED ALL THE FLUIDS. LIGHT WENT OFF. MAY 15TH LIGHT COMES ON. I AM AN HOUR AWAY FROM THE DEALERSHIP SO I MAKE AN APPT TO BRING MY CAR TO THE LOCAL MECHANIC TO MAKE SURE AM SAFE TO DRIVE THIS AT ALL. BEFORE LEAVING MY HOUSE IN THE MAIL IS A LETTER FROM FORD STATING MY VEHICLE IS AT RISK OF HAVING COOLANT INTRUDE INTO THE ENGINE CYLINDER BORES. I CALL THE DEALERSHIP RIGHT THEN 5/15 AND GET A APPT FOR FIRST THING MONDAY AND AM TOLD THE ENGINE LIGHT IS NOT BLINKING YOUR FINE TO DRIVE.  THAT EVENING MY HIGH TEMP LIGHT/PULL OVER LIGHT COMES ON.  I WAIT AN HOUR AND GET HOME. THE NEXT MORNING I TRY TO START THE CAR AND CHECK AND SEE IF I CAN DRIVE IT OR WILL NEED A TOW TRUCK TO GET IT TO THE DEALERSHIP. HIGH TEMP LIGHT COMES ON AGAIN. I CHECK THE ENGINE AND FIND IN LESS THAN APPROX. 7 DAYS THE COOLANT IS EMPTY. I GET THE CAR TO THE MONDAY 8 AM APPT....FRIDAY THE 22ND THEY TELL ME YES THIS IS WHAT HAPPENED AND IT A KNOWN PROBLEM BUT IT WILL COST YOU 6K TO REPLACE THE SHORT BLOCK. IT IS NOW AT THE DEALERSHIP GETTING THE ENGINE REPLACED. I CALLED SEVERAL MECHANICS TO TRY AND GET QUOTES AND THEY SAID THEY WOULD NOT TOUCH THIS BECAUSE THEY ALL KNOW THIS IS A FORD PROBLEM WITH THIS ENGINE.*DT*JB",
        "vin": "1FMCU9GD3JU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/13/2020",
        "dateOfIncident": "05/08/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324388,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL SCHEDULED MAINTENANCE COMPLETED FOR THE VEHICLE ON TIME, AND ALWAYS SERVICED AT A FORD SERVICE DEPARTMENT. ALL RECALLS COMPLETED. NO ACCIDENTS WITH THIS VEHICLE. HAD ISSUES WITH VIBRATIONS COMING FROM FRONT PASSENGER SIDE OF THE VEHICLE CAUSING THE ENTIRE VEHICLE TO SHAKE. THE ISSUE WAS RESOLVED UNDER WARRANTY BY A FORD SERVICE DEPARTMENT BY REPLACING THE HALF SHAFT. THREE MONTHS LATER, WHILE DRIVING ABOUT 30 MPH, I RECEIVED AN ALERT ON MY VEHICLE SAYING, \"POWERTRAIN MALFUNCTION / REDUCED POWER\" AND \"MALFUNCTION INDICATOR LAMP - REGULATORY\". THERE WAS NO WARNING PRIOR TO THIS INCIDENT. THE CAR DROVE FINE, AND I DID NOT HAVE ANY ISSUES.ON THE WAY TO GETTING THE VEHICLE TO BE INSPECTED AT THE SERVICE CENTER, THE CAR WOULD NOT GO OVER 70 MPH AND I COULD  HEAR THE CAR RUNNING VERY LOUDLY (LIKE A ROARING SOUND). I GOT OFF OF THE HIGHWAY, AND TOOK CITY ROADS AS A PRECAUTION TO GET TO THE SERVICE CENTER. AT EVERY STOP LIGHT, THE VEHICLE WAS OBNOXIOUSLY LOUD. ONCE I MADE IT TO TAKE VEHICLE BACK TO THE FORD SERVICE CENTER, AND THEY ARE NOW SAYING THE TRANSMISSION ON THE VEHICLE NEEDS TO BE REPLACED. THE VEHICLE IS NO LONGER UNDER WARRANTY, AND I AM EXPECTED TO PAY FOR REPAIRS. THIS SEEMS TO BE A DEFECTIVE TRANSMISSION, AND FORD IS NOT WILLING TO HELP. THE VEHICLE DOES NOT EVEN HAVE 100K MILES. MY VEHICLE WAS NOT IN THE VEHICLES RECALLED FOR TRANSMISSION SERVICES.  *TR",
        "vin": "1FMCU0HD1JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/23/2020",
        "dateOfIncident": "03/16/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322007,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MILEAGE 18,895. ENGINE WAS SHUDDERING AFTER STARTING MORNINGS AND THEN WHILE DRIVING SLOWLY IN REVERSE AND FORWARD. SHUDDERING SUBSIDED AFTER DRIVING A SHORT TIME AT LOW SPEED. THIS OCCURRED 2-3 TIMES. ONE WEEK LATER ENGINE LIGHT WENT ON, BROUGHT IMMEDIATELY TO DEALER.  THEY KEPT THE CAR FOR 3 WEEKS. REPLACED V BELT AND CRANK PULLEY. ENGINE LIGHT CONCERN P0302, NO COOLANT IN JUG COOLANT ON #2 NEC TO PERFORM TSB 20-2100. REMOVED ENGINE, TORE DOWN, BUILT UP SHORT BLOCK PUT IN CAR, FLUIDS FILLED AND CHECKED, ROAD TEST OK. ADDITIONALLY, THEY DID AN AC REPAIR AS THE AC WAS BLOWING WARM. TO MY KNOWLEDGE THERE IS NO OFFICIAL RECALL FOR THIS ENGINE FAULT AS I WASN'T NOTIFIED, NOR FOUND EVIDENCE OF IT ON THE INTERNET, HOWEVER AT THE DEALER THEY SAID THERE WAS A RECALL. THE VEHICLE WAS REPAIRED UNDER WARRANTY AND AT NO COST TO ME. I WAS PROVIDED A FREE LOANER VEHICLE THE ENTIRE TIME.",
        "vin": "1FMCU9HD4JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/30/2020",
        "dateOfIncident": "03/26/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319764,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED NOTICE FROM FORD THAT IT MAY BE POSSIBLE FOR COOLANT TO INTRUDE INTO THE CYLINDER BORES. THEIR SOLUTION IS \"CUSTOMER SATISFACTION PROGRAM 19B37,\" WHICH PRESCRIBES THE REPROGRAMMING OF THE POWERTRAIN CONTROL MODULE. THE LETTER NOTES THAT IF I PAID FOR REPAIRS INVOLVING THE ENGINE BLOCK ASSEMBLY AND/OR HEAD GASKET BEFORE THE DATE OF THIS LETTER (JAN. 2020) I AM ENTITLED TO A REFUND. I HAVE NOT YET HAD A PROBLEM. MY CONCERN IS THAT THE ONLY WAY TO REDUCE STRESS ON THE CYLINDER HEAD IS TO REDUCE ENGINE HORSEPOWER/TORQUE. I PURCHASED THE 4 WHEEL DRIVE MODEL WITH TOWING PACKAGE. WON'T THE REDUCTION IN POWER INVALIDATE THE TOW RATING? THE DEALER TOLD ME THIS IS A \"SAFETY RECALL.\" YOU HAVE NO RECORD OF FORD INITIATING A RECALL. CAN ANYONE ASSURE ME THAT IF I AUTHORIZE THE SOFTWARE MANIPULATION THAT I WILL STILL HAVE A REASONABLY SAFE VEHICLE CAPABLE OF TOWING 2000 POUNDS? OR, HAS FORD DECIDED NOT TO REPLACE THE DEFECTIVE PART AND PUT THE LIABILITY ON ME DRIVE AN UNSAFE VEHICLE AND SAVE THEM THE EXPENSE OF A RECALL?  ALSO, IT SEEMS TO ME THAT CHANGING THE VEHICLE'S ORIGINAL SPECS WOULD ALTER THE VEHICLE'S FUEL MILEAGE AND EMISSIONS CERTIFICATIONS.",
        "vin": "1FMCU9HD4JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/19/2020",
        "dateOfIncident": "03/14/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318667,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK THE 2018 ESCAPE TO THE DEALERSHIP FOR REGULAR OIL CHANGE AND COOLANT CHECK AND ASKED THE DEALERSHIP TO FIND OUT WHY MY ENGINE LIGHT WAS ON.  I WAS 223 MILE OVER MY 60,000 WARRANTEE.  THE REPRESENTATIVE SAID THERE WAS ANTIFREEZE IN WITH MY PISTON AND THAT I NEEDED A NEW ENGINE.  COME TO FIND OUT FROM THE MECHANIC, HE HAD 30 OTHER CARS IN FRONT OF ME TO WITH THE SAME PROBLEM.  HE TOLD ME THAT I WOULD NEED TO CALL CUSTOMER SERVICE TO GET IT TAKEN CARE OF.  HE ALSO TOLD ME THAT I NEED TO FILE A CLASS ACTION LAW SUIT AGAINST FORD IF THEY WOULDN'T HELP ME WITH THE 223 MILES OVER MY WARRANTEE IF THEY WONT HELP ME.  I NEED THE CAR FOR WORK AND GETTING CHILDREN TO AND FROM SCHOOL.  THEY SAID IT WOULD TAKE A MONTH TO GET IT FIXED.  FORD IS WATCHING THIS PROBLEM BUT NEED TO MAKE GOOD OF THIS.  FORD NEED TO MAKE A RECALL DUE TO ALL THE PROBLEMS WITH THIS MODEL. ALL THE REGULAR MAINTENANCE HAS BEEN THROUGH FORD DEALERSHIP.",
        "vin": "1FMCU9GD1JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/03/2020",
        "dateOfIncident": "01/27/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315897,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT WAS ON. TOOK RECALLED VEHICLE INTO COMPANY TO GET A NEW ENGINE REPLACED. THERE WAS A RECALL FOR COOLANT LEAKING INTO THE ENGINE. AFTER 2WEEKS I GOT THE VEHICLE BACK AND I KEPT SMELLING A STRONG BURNING ODOR SMELL COMING THROUGH THE VENTS. I IMMEDIATELY CALLED THE COMPANY TO RETURN THE VEHICLE FOR INSPECTION. AS OF RIGHT NOW, THEY STILL HAVE MY VEHICLE AS I'M DRIVING A RENTAL CAR.",
        "vin": "1FMCU9HD5JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/28/2020",
        "dateOfIncident": "02/28/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11312176,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THROTTLE ACTUATOR STUCK ISSUE.  VEHICLE STARTED SHAKING WHILE IN MOTION AND STALLED, THE  VEHICLE SHUT DOWN AND WOULD NOT START.  CHECK ENGINE LIGHT CAME ON.",
        "vin": "1FMCU0F78JU"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/06/2020",
        "dateOfIncident": "02/02/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307471,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD NOTICED COOLANT DEPLETING FINALLY GOT RECALL. DEALER REPROGRAMS NOW ENGINE IS JUST REVVING AND LOOSES ALL POWER TO POWERTRAIN IN MULTIPLE SITUATION-3 FROM STOP, 4 WHILE GOING HIGHWAY SPEED WITH CONSTANT SPEED PRIOR EACH TIME THE ENGINE REV'S UP WHILE GIVING NO POWER. THEN WILL SPONTANEOUSLY RESOLVE WITHIN ABOUT 50FT THEN SEEMS FINE. I HAVE VIDEO OF THE CAR DOING THIS WHILE I WAS ATTEMPTING TO GET ON THE HIGHWAY. WE LOOKED AT OIL AND THERE IS MILK LOOKING RESIDUE. THE LOOSING POWER HAS ONLY HAPPENED SINCE REPROGRAM FOR RECALL AND NOW THE CAM SHAFT & HIGH PRESSURE FUEL PUMP ARE DESTROYED PER DEALER THIS IS MY ISSUE NOT RECALL RELATED. AGAIN THESE PROBLEMS HAVE ONLY STARTED WITHIN A WEEK OF THE RECALL REPROGRAMMING OF THE VEHICLE",
        "vin": "1FMCU9GD9JU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/16/2020",
        "dateOfIncident": "01/16/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299990,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BACK WINDOW ON THE HATCH IS SHATTERING. THE WINDOW FIRST HAD DONE SIZE CRACK IN IT. IT THEN WAS CRACKLING AND AFTER HOURS THE WHOLE WINDOW IS SMALL PIECES. IT WAS JUST SITTING IN MY DRIVEWAY. IT BLEW THE SIDE PANEL OFF.",
        "vin": "1FMCU0HD9JU"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/07/2020",
        "dateOfIncident": "12/31/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297534,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY CAR IT BEGAN TO ACCELERATE ON ITS ON, I WAS ABLE TO CONTROL THE SPEED BY PUSHING ON THE BRAKES, THE INSTANT I REMOVED MY FOOT OF THE BREAK THE CAR ACCELERATED ON ITS OWN AGAIN. I FOUND AN AREA TO PARK, TURNED OFF THE CAR. I RESTARTED THE CAR TO DRIVE HOME THE CAR AGAIN ACCELERATED ON ITS OWN, I PARKED IT IN A OPEN LOT , TURNED THE CAR OFF. WHEN I STARTED THE CAR THE ENGINE MADE A LOUD RUBBING SOUND. AT THIS POINT I HAD MY CAR TOWED FOR SERVICE.",
        "vin": "1FMCU9GD1JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/02/2020",
        "dateOfIncident": "10/16/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11292541,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING TO TOWN 16 OCT.18-CHECK ENGINE LIGHT CAME AND I TOOK THE CAR TO DEALER. CODE WAS 1136 AND I WAS TOLD THE LONG BLOCK WOULD NEED TO BE REPLACED. WORK WAS DONE AND CAR RETURNED 22 OCT.18.",
        "vin": "1FMCU9GD1JU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/01/2020",
        "dateOfIncident": "12/25/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11292425,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT 2018 FORD ESCAPE WITH 6K MILES ON IT. AFTER ONE WEEK \"STEERING ASSIST FAULT SERVICE REQUIRED\" MESSAGE APPEARS AND GOES ON DISPLAY PANEL DURING START AND AFTER PUTTING IN DRIVE MODE. THE STEERING GET LOCKED. VEHICLE WAS IN MOTION.   BELOW DESCRIPTION FORM FORSCAN DIAGNOSTIC PROGRAM:   CODE: C102D - HIGH FRICTION INSIDE POWER STEERING    STATUS:    - DTC PRESENT AT TIME OF REQUEST   - MALFUNCTION INDICATOR LAMP IS ON FOR THIS DTC    MODULE: POWER STEERING CONTROL MODULE     FREEZE FRAME :  -GLOBTIM: 32582214 SEC - GLOBAL REAL TIME  -TOTDIST: 5950.0 KM - TOTAL DISTANCE  -MOD_SUP_V: 12.25 VOLT - MODULE SUPPLY VOLTAGE  -OUTTMP: 2 C - EXTERNAL TEMPERATURE FROM SENSOR  -PWR_MODE_KEY: RUNNING  - POWER MODE KEY STATE  -PWR_MODE_QF: POWER MODE OK  - POWER MODE QUALITY FACTOR  -SSHFT_TQ_S2: -1.9 NM - STEERING SHAFT TORQUE SENSOR #2  -MOD_SUP_V: 12.40 VOLT - MODULE SUPPLY VOLTAGE  -PSCM_INT_TEMP: 17 C - PSCM INTERNAL TEMPERATURE  -VSS: 30.0 MIL/H - VEHICLE SPEED    THIS PROBLEM APPLIES TO MANY OTHER CARS BELOW LINKS TO PAGES DESCRIBING THE PROBLEM:  HTTPS://WWW.FORDESCAPE.ORG/THREADS/STEERING-ASSIST-FAULT.17578/PAGE-2#POST-979554    NOTICE: CAR IS ALLREADY EXPORTED TO EUROPE   PROBLEM IS NOT SOLVED BY FORD THAT IS WHY I FILLED THIS FORM.",
        "vin": "1FMCU9GDXJU"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "12/29/2019",
        "dateOfIncident": "12/26/2019",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 4,
        "odiNumber": 11291920,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON DECEMBER 26, 2019, ANOTHER OTHER VEHICLE HIT THIS 2018 FORD ESCAPE, SPINNING IT INTO ANOTHER VEHICLE. THIS ESCAPE CAUGHT ON FIRE AND WAS TOTALLY DESTROYED. ALL INVOLVED VEHICLES (ALL FORDS) WERE IN MOTION TRAVELING ABOUT 50 MPH. THIS ESCAPE WAS TRAVELING NORTH ON ROUTE 122 NEAR BURNT CHIMNEY, VA. THE OTHER TWO FORDS WERE   TRAVELING SOUTH ON THIS TWO LANE ROAD.",
        "vin": "1FMCU9HD4JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/26/2019",
        "dateOfIncident": "10/29/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291240,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE OVERHEAT LIGHT WOULD COME ON IMMEDIATELY UPON STARTING THE ENGINE AND WOULD REMAIN ON.  CAR STALLED SEVERAL TIMES BUT I WAS ABLE TO START IT UP AGAIN AFTER A FEW MINUTES AND IT DROVE FINE.  FINALLY, THE CAR COMPLETELY STALLED AND HAD TO BE TOWED TO A FORD DEALERSHIP.  THE VEHICLE IS STILL UNDER WARRANTY BUT IT NEEDED A NEW ENGINE SHORT BLOCK AS THERE WAS A CRACK IN THE SHORT BLOCK, CAUSING COOLANT TO LEAK INTO THE CYLINDERS.  THIS VEHICLE HAD 25,000 WHEN THIS OCCURRED AND HAD BEEN LEASED (NEW) FOR LESS THAN 1 YEAR.  DEALERSHIP WAS BACKLOGGED WITH ENGINE REPAIRS ON FORD ESCAPES FROM VARIOUS MODEL YEARS.  THE DEALERSHIP LISTED THE REPAIR THE PROBLEM AS \"CYLINDER DECK SURFACE IMPERFECTION.\"  MY VEHICLE WAS IN SERVICE FROM OCTOBER 29, 2019 TO DEC 16, 2019.",
        "vin": "1FMCU9HD8JU"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/16/2019",
        "dateOfIncident": "12/05/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289254,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MARCH 3, 2018, WE PURCHASED A 2018 FORD ESCAPE FROM DUVAL FORD IN JACKSONVILLE, FL.  SOON AFTER THE PURCHASE, WE EXPERIENCED ISSUES WITH THE CAR STALLING AND JERKING WHEN APPLYING GAS.  ALTHOUGH THE SITUATION ONLY OCCURS ON OCCASION, IT IS A DANGEROUS PROBLEM WHEN ACCELERATING INTO TRAFFIC.  THE MAIN TIME THIS HAS HAPPENED IS DURING LONG TRIPS.  WITH OUR TRAVEL SCHEDULE AND FAMILY OUT OF TOWN, WE NEED A RELIABLE VEHICLE TO SAFELY TRANSPORT US TO WHATEVER LOCATION WE CHOSE.    WE CALLED TO REPORT THE ISSUE AND TRIED SOME OF THE TROUBLE SHOOTING EFFORTS EXPLAINED TO US VIA PHONE.  THE ISSUE PERSISTED; THEREFORE, ON MAY 8, 2018 WE RETURNED THE VEHICLE TO THE SERVICE DEPARTMENT EXPLAINING DETAILS OF THE STRUGGLES PREVIOUSLY MENTIONED. WE ASKED THEM TO CHECK THE FUEL INJECTOR AND OTHER ENGINE MISFIRES.  TWO DAYS LATER, THEY RETURNED THE CAR STATING THERE WERE NO ISSUES FOUND.  THIS PROCESS HAS CONTINUED SEVERAL TIMES FROM APRIL 2018 UNTIL TODAY. OUR LAST ATTEMPT TO ALLOW DUVAL FORD SERVICE DEPARTMENT TO REPAIR THE ISSUE, WAS ON DECEMBER 5, 2019.  WE TOOK THE CAR INTO THE SHOP, REPORTED IN DETAIL ABOUT THE ON-GOING ISSUE AND ASKED FOR THE OIL TO BE CHANGED. THE SERVICE DEPARTMENT HAD THE VEHICLE FOR 9 DAYS, DROVE IT 31 MILES, AND REPORTED THAT NO ISSUES WERE FOUND. DURING THE 9-DAY STAY, WE CALLED TO ASK ABOUT THE STATUS OF THE VEHICLE, ONLY TO BE TOLD THAT IT WAS BEING WORKED ON.  ON SATURDAY, DECEMBER 14, 2019, AFTER A 9-DAY STAY IN THE SERVICE DEPARTMENT PARKING LOT, WE WENT TO RETRIEVE OUR VEHICLE ONLY TO FIND THAT THE OIL HAD NOT BEEN CHANGED AND NO ISSUE WAS RESOLVED WITH THE PROBLEM WE REPORTED.",
        "vin": "1FMCU0F7XJU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/10/2019",
        "dateOfIncident": "12/09/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288283,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "LEAK FROM ROOF BY REAR VIEW  MIRROR SATURATING INSIDE OF CAR AND CONSOLE  WHEN RAINING. CAR WAS STATIONARY AT TIME.",
        "vin": "1FMCU9HD8JU"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/26/2019",
        "dateOfIncident": "11/11/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282578,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS PURCHASED IN MAR/APR 2019 WITH 3000 MI. THE VEHICLE HAD ALL REGULAR MAINTENANCE CHECKS PRIOR TO THE 11/11/19 INCIDENT. THERE WERE NO VEHICLE ALERTS REGARDING COOLANT OR ENGINE OVERHEATING PRIOR TO THIS INCIDENT.    AT 17349MI, THE VEHICLE WAS PARKED AFTER A 35MIN DRIVE ON THE TOLLWAY. THE VEHICLE HAD ONE COOLANT/HOT ENGINE WARNING AFTER THE VEHICLE HAD BEEN PARKED FOR 2.5HRS IN SUB-ZERO WEATHER. I TURNED OFF AND THEN ON AGAIN 5 MIN LATER. THIS TIME THE ENGINE SHUT ITSELF OFF IMMEDIATELY FOLLOWING THE KEY TURN.THE VEHICLE'S ENGINE \"LOCKED UP\" AND IS AT THE DEALERSHIP AWAITING REPAIR. I HAVE BEEN TOLD THIS REPAIR COULD TAKE 4-6 WEEKS BECAUSE ENGINES ARE ON BACK ORDER AND GENERALLY TAKE UP TO TWO WEEKS TO INSTALL. THE DEALERSHIP ALSO STATES THAT THERE WAS NO WAY THAT THIS REPAIR WOULD HAVE BEEN FOUND IN PREVIOUS MAINTENANCE CHECKS.",
        "vin": "1FMCU0GD4JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/20/2019",
        "dateOfIncident": "11/09/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281444,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR BEGAN TO SHUTTER AND FELT AS IF IT WAS LOSING POWER.  THE ENGINE LIGHT DID COME ON AND I TRIED TO GET TO THE SHOULDER OF THE HIGHWAY, BUT THE ENGINE LIGHT TURNED OFF AND THE CAR BEGAN TO FUNCTION AS NORMAL.  I MADE AN APPOINTMENT THE NEXT BUSINESS DAY WITH NO CONCERNS FROM THE SERVICE REP STATING IT WAS MOST LIKELY FROM THE WEATHER CHANGE AND SCHEDULED ME IN FOR 5 DAYS LATER. I CONTINUED DRIVING THE CAR WITH NO KNOWN PROBLEMS OR IDENTIFYING LIGHTS THAT A PROBLEM EXISTS. AFTER ABOUT 5-7 HRS AFTER DROPPING OFF I WAS TOLD BY THE SERVICE REP THAT THE 1.5 ECHO BOOST ENGINE IS LOSING COOLANT THROUGH THE MOTOR AND THE SHORT BLOCK IS TO BE REPLACED. AS WELL AS STATING THAT THIS PROBLEM IS ON AN INTERNAL WATCH LIST FROM FORD. I HAVE HIGH CONCERNS THAT I CONTINUED TO DRIVE MY 18-MONTH-OLD CAR (PURCHASED NEW IN MAY 2018) WITH MY CHILDREN AS WELL AS TO/FROM WORK WITHOUT THE ENGINE LIGHT OR ANY KNOWN IDENTIFIER THAT A PROBLEM CONTINUED.  MY MAIN DRIVING EVERYDAY CONSIST OF HIGHWAY DRIVING AND THIS PROBLEM COULD OF CAUSED A BAD MISHAP NOT ONLY FOR MY FAMILY, BUT ANYONE AROUND ME ON THE HIGHWAY.",
        "vin": "1FMCU9HDXJU"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "11/12/2019",
        "dateOfIncident": "11/06/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279548,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED THE VEHICLE ON LEVEL GROUND, VEHICLE WAS IN PARK, EMERGENCY BRAKE WAS NOT ON, FORGOT SOMETHING IN HOME, GOT OUT OF VEHICLE & PROCEED TOWARDS HOME BUT BEFORE I GOT THERE BACKED UP & HIT HOME, ENGINE THEN STALLED, RESTARTED ENGINE & MOVED VEHICLE BACK TO ORIGINAL POSITION, I THEN TRIED TO REPLICATE EVENTS, VEHICLE DID NOT MOVE, PUT VEHICLE IN PARK, VEHICLE REMAINED STATIONARY, PUT VEHICLE IN REVERSE & VEHICLE IMMEDIATELY BEGAN TO MOVE. MY WIFE WAS IN THE VEHICLE &  REPORTED THAT VEHICLE DID NOT MOVE UNTIL I WAS COMPLETELY OUT OF VEHICLE & PROCEEDING TO HOME WITH MY BACK TURNED.",
        "vin": "1FMCU9J96JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/04/2019",
        "dateOfIncident": "10/16/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278101,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT HAS REPEATEDLY TURNED ON. EVERY TIME, THE DEALER HAS \"RESET THE COMPUTER\" AND SENT ME ON MY WAY. LAST WEEK, THEY TOLD ME THE ENGINE HAD TO BE REPLACED AND I WOULD BE WITHOUT MY CAR FOR CLOSE TO 30 DAYS. THEY SAID THERE IS A PROBLEM WITH COOLANT LEAKING INTO THE PISTONS. THE SERVICE REP AT THE DEALER TOLD ME THIS WAS AN ISSUE ON ALL 1.5 ECOBOOST ENGINES. HE ALSO TOLD US NOT TO REPORT ANYTHING AND REFUSE ANY OFFERS FROM FORD AND JUST BRING THE CAR IN FOR REPAIR.    THIS SEEMS LIKE ANOTHER FORD COVER UP LIKE THEY HAD WITH THEIR 2014 FOCUS MODEL AND THE FAULTY TRANSMISSION (A VEHICLE I ALSO HAD, AND CURRENTLY HAS A CLASS ACTION LAWSUIT). FORD HAS REPEATEDLY BEEN SHADY ABOUT HOW THEIR VEHICLES PERFORM AND REFUSE TO DO ANYTHING ABOUT IT UNTIL SOMEONE SUES THEM. THE FACT THAT THEIR SERVICE DEPARTMENT KNOWS EXACTLY WHATS GOING ON (THEY HAVE 56 LOANER CARS FOR CUSTOMERS WITH REPAIRS, AND ALL 56 VEHICLES WERE ALREADY GIVEN OUT WHEN I HAD MY PROBLEM) IS RIDICULOUS, AND IT SAYS ALOT THAT THEY STILL REFUSE TO ADMIT THEY DESIGNED A GARBAGE ENGINE.",
        "vin": "1FMCU0HD2JU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/18/2019",
        "dateOfIncident": "11/08/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269347,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING NEXT TO A TRAIN, THE PRE-COLLISION ASSIST WILL ENGAGE AND SLAM ON THE BRAKES EVEN WITH NO OTHER CARS IN THE AREA.  THIS HAPPENS DAILY WHILE DRIVING ON THE HIGHWAY (75MPH+) GOING STRAIGHT. IT HAPPENS WITH OR WITHOUT OTHER CARS IN THE AREA.  THIS HAS BEEN GOING ON FOR AS LONG AS WE HAVE OWNED THE CAR.",
        "vin": "1FMCU9HDXJU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/09/2019",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267557,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED THAT THE CAR SOUNDED ROUGH WHEN STARTING FOR A WHILE.  DRIVING AROUND 60MPH THE CAR ALL OF A SUDDEN JARRED/ CHUGGED WHICH WAS QUITE ALARMING.   EVERY TIME I PUSHED THE ACCELERATOR, THE CAR CHUGGED. IT REMINDED ME OF DRIVING A MANUAL CAR WHEN YOU AREN'T IN THE CORRECT GEAR.  AT FIRST, I THOUGHT THAT IT MIGHT BE A TRANSMISSION ISSUE.  IT WAS NOT.. THE CAR HAS BEEN AT THE DEALER FOR ABOUT 6 WEEKS.  THEY TOLD US THAT COOLANT IS GETTING INTO THE ENGINE.  NOT SURE IF THE RECALL IS GOING TO HAPPEN, BUT IT SOUNDS AS IF THERE IS A SIGNIFICANT NUMBER OF PEOPLE WITH THE SAME ISSUE.",
        "vin": "1FMCU9GD0JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/08/2019",
        "dateOfIncident": "10/04/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267174,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER SEVERAL MONTHS OF ENGINE BACKFIRES, ROUGH STARTS AND IDLING AND CHECK ENGINE LIGHTS THEY ARE FINALLY REPLACING MY ENGINE DUE TO ISSUES WITH COOLANT GETTING INTO THE ENGINE.  THE LAST INCIDENT HAPPENED WHEN THE CAR WAS MOVING AND COULD HAVE BEEN SERIOUS SITUATION.  WHEN IT WAS TAKEN TO THE DEALERSHIP THEY WOULD NOT ALLOW ME TO DRIVE IT FURTHER.",
        "vin": "1FMCU0HDXJU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/04/2019",
        "dateOfIncident": "08/22/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266169,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FORD ESCAPE 2018 WITH 10,000 MILES, I WAS DRIVING AND ALL OF A SUDDEN THE CAR STARTING VIBRATING AND I HAD TO DRIVE 15 MILES PER HOUR TO THE DEALERSHIP. THE SERVICE DEPARTMENT PUT IT ON THE COMPUTER AND DETERMINED THE PISTON HAD CAUSED THE ENGINE TO BE BLOWN. THIS WAS THE FIRST OF SEPTEMBER AND I HAVE NOT RECEIVED A DATE FOR THE REPAIR BEING DONE. THE PARTS DEPARTMENT SAYS THEY KEEP EMAILING FORD AND ARE NOT RECEIVING ANY DATE ON PARTS BEING SENT. THE CAR IS COVERED BY WARRANTY AND FORD IS PAYING FOR RENTAL BUT I WOULD LIKE TO KNOW STATUS ON REPAIR AND IF IT WILL HAPPEN AGAIN. IF SO WHAT CAN I DO TO GETTING A NEW CAR?",
        "vin": "1FMCU9GD8JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/02/2019",
        "dateOfIncident": "07/31/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265591,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BETWEEN THE PERIOD OF JULY AND AUG '18 THE VEHICLE EXHIBITED THE FOLLOWING:    LURCHING FORWARD WHILE IN-MOTION (CITY DRIVING) - ON MORE THAN ONE OCCASION  RATTLING LIKE NOISE ON START-UP  NOISE WHEN BACKING UP  RESISTANCE WHILE REVERSING    I ATTEMPTED TO BRING IT IN, 8/1, AND WAS TOLD THERE WERE NO ISSUES FOUND  I RETURNED ON 8/13 AND THE VEHICLE HAS BEEN IN FOR REPAIR SINCE AS THEY CONTINUE TO FIND NEW ISSUES (ORIGINAL ISSUE: SHORT ENGINE BLOCK REPLACEMENT)    I HAVE DONE RESEARCH AND THERE ARE MANY 2018 FORD ESCAPES WITH THIS SAME ISSUE.  THIS CAR IS UNSAFE TO DRIVE.    PLEASE NOTE, THE CAR WAS ALSO IN JUNE - JULY '18 FOR HEAD GASKET LEAK.",
        "vin": "1FMCU9GD9JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/02/2019",
        "dateOfIncident": "09/13/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265742,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AT BETWEEN 18000 AND 19000 MILES CAR DEVELOPED COOLANT LEAK AND HAS BEEN AT THE RIVERSIDE DEALERSHIP SINCE 9/13/19 AND UNKNOWN TIME TO GET REPLACEMENT PARTS AND NEW ENGINE FROM FORD.",
        "vin": "1FMCU0GD3JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/30/2019",
        "dateOfIncident": "09/26/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258989,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 FORD ESCAPE. WHILE THE CONTACT'S WIFE WAS DRIVING AT AN UNKNOWN SPEED, SHE HEARD FLUID MOVING IN AN UNKNOWN PART OF THE VEHICLE AND THE CHECK ENGINE INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO JIM SHORKEY FORD (412-379-6465, LOCATED AT 1234 LONG RUN RD, WHITE OAK, PA 15131) WHERE A SPARK PLUG WAS REPLACED. THE TECHNICIAN ALSO SEALED THE DISTRIBUTOR TO STOP FURTHER LEAKAGE, BUT THE FAILURE RECURRED WITHIN 48 HOURS. THE VEHICLE WAS TAKEN BACK TO THE SAME DEALER WHERE THE TECHNICIAN DIAGNOSED THAT THE ENGINE NEEDED TO BE REPLACED. THE CONTACT WAS INFORMED THAT THE VEHICLE WOULD NOT BE READY UNTIL DECEMBER DUE TO WORK LOAD (BACKLOG). THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 20,000.",
        "vin": "1FMCU9HD8JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/24/2019",
        "dateOfIncident": "06/26/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257682,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2018 FORD ESCAPE USED IN APR OF 2019.  IT WAS COSMETICALLY GREAT AND HAD AROUND 25,000 MILES ON IT.  IN JUNE OF 2019, THE CHECK ENGINE LIGHT CAME ON.  I TOOK IT TO THE LOCAL FORD DEALER, WHERE I WAS TOLD THAT IT WAS AN ENGINE MISFIRE ON THE #2 PISTON.  THEN WAS TOLD THAT COOLANT HAD LEAKED INTO THE ENGINE AND NOW I WILL REQUIRE THE LONG BLOCK TO BE REPLACED.  IT WAS ALSO NOTED THAT THIS IS A COMMON PROBLEM THAT FORD IS AWARE OF, BUT THEY HAVE NOT ISSUED A RECALL.  AFTER FURTHER RESEARCH ONLINE, I'VE DISCOVERED THAT MANY PEOPLE ARE EXPERIENCING THE SAME ISSUES:  COOLANT LEAKING INTO THE ENGINE AND IT HAVING TO BE REPLACED.    IT IS NOW SEPT. 24TH AND I STILL DO NOT HAVE MY CAR.  I WAS TOLD THE REASON THAT IT IS TAKING SO LONG IS THAT A LOT OF THE PARTS ARE ON BACK ORDER.    THIS REPAIR IS COVERED UNDER MY WARRANTY, SO MY COMPLAINT ISN'T  BECAUSE THIS IS TAKING TOO LONG TO GET MY CAR BACK.  MY COMPLAINT IS THAT THIS IS NOT A RECALL BY FORD.  IT IS A KNOWN AND DOCUMENTED PROBLEM, BUT FORD IS NOT ACTING.  IT IS SO MUCH OF A PROBLEM THAT MY VEHICLE HAS BEEN WITH THE DEALER FOR 3 MONTHS BECAUSE THE PARTS ARE ON BACKORDER AND I STILL DON'T HAVE A TIMETABLE OF WHEN I CAN EXPECT THE REPAIRS TO BE DONE.    ALSO, MY WIFE HAS BEEN IN CONTACT WITH REGIONAL FORD REGARDING THIS AND THEY ARE NOT PROVIDING MUCH SUPPORT/INFORMATION ON THE MATTER.",
        "vin": "1FMCU9GD1JU"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/20/2019",
        "dateOfIncident": "09/19/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256799,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TRYING TO CHANGE A FLAT TIRE IT WAS DETERMINED THAT THE LUG NUT WRENCH WOULD NOT FIT.  THE TOW TRUCK DRIVER, AND LATER THE FORD DEALER SERVICE DEPARTMENT, CONFIRMED THAT FORD HAS AN ISSUE WITH LUG NUTS \"SWELLING' WHICH RENDERS YOUR FACTORY ISSUED WRENCH UNUSABLE.  THIS IS A KNOWN PROBLEM TO FORD YET THEY WILL DO NOTHING ABOUT IT.",
        "vin": "1FMCU9HD2JU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/10/2019",
        "dateOfIncident": "07/14/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254561,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SUNDAY, JULY 14, 2019, OUR 2018 FORD ESCAPE LOST POWER STEERING WHILE TRAVELING 60 MPH ON INTERSTATE 5 NEAR SEATTLE. WE WERE ABLE TO PULL OFF THE INTERSTATE AND TURN THE VEHICLE OFF. THE VEHICLE WAS STILL UNDER ORIGINAL WARRANTY. AFTER RESTARTING THE VEHICLE, THE POWER STEERING FAILURE LIGHT TURNED OFF AND POWER STEERING  WAS RESTORED.  WE CONTACTED THE DEALER THE NEXT DAY AND THEY ADVISED IT WAS SAFE TO CONTINUE DRIVING THE VEHICLE UNTIL THEY COULD SCHEDULE AN APPOINTMENT  - TEN DAYS LATER. THE DEALER CLAIMED IT FOUND NO CODES INDICATING A PROBLEM.  ON SEPTEMBER 9, 2019, OUR ESCAPE LOST ALL POWER STEERING AGAIN WITHOUT ANY WARNING LIGHTS COMING ON.  WE CANNOT RESTORE THE POWER STEERING BY TURNING THE VEHICLE OFF AND RESTARTING. THE VEHICLE IS. NOW AT THE DEALERSHIP, BUT THE DEALER AND FORD CUSTOMER SUPPORT HAVE BOTH SAID BECAUSE OUR MILEAGE IS NOW OVER THE ORIGINAL WARRANTY, THEY WILL NOT COVER THE REPAIRS NECESSARY TO CORRECT THE COMPLETE LOSS OF POWER STEERING.",
        "vin": "1FMCU0F75JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/22/2019",
        "dateOfIncident": "06/18/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245851,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY 2018 FORD ESCAPE WITH 28500 MILES INTO THE DEALERSHIP ON 5/6/19 DUE TO A COOLANT LEAK. AT THAT TIME, THEY REPLACED THE OIL COOLER ASY. ON 6/18/19 WITH 30700 MILES, IT WAS BACK IN FOR THE SAME ISSUE AND DEEMED UNSAFE TO DRIVE.  IT HAS BEEN SITTING AT THE DEALERSHIP  TORN APART FOR OVER 2 MONTHS NOW DUE TO BACKORDERED PARTS. FIRST IT WAS THE ENGINE, THEN A GASKET, AND JUST THIS WEEK ANOTHER PART!    AFTER ONE MONTH OF WAITING, I CALLED FORD MOTOR CO AND REPORTED A CLAIM. SINCE THEN, EVERY WEEK I AM PASSED ON TO ANOTHER PERSON WITH NO ANSWERS FOR ME. EACH ONE SAYS THEY WILL GET BACK TO ME IN 24HRS OR WITHIN A WEEK WHETHER THEY HAVE ANY NEW INFORMATION OR NOT AND THOSE HAVE ALL BEEN BROKEN PROMISES. I'VE BEEN TOLD MY VEHICLE DOES NOT QUALIFY FOR A BUY BACK PROGRAM WITH NO REASON GIVEN. WHEN ASKED FOR A REASON, I HAVE BEEN TOLD TO REFERENCE MY STATES LEMON LAW GUIDELINES.  THE CUSTOMER SERVICE REGARDING THIS ISSUE HAS BEEN ABSOLUTELY TERRIBLE.",
        "vin": "1FMCU9GDXJU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/15/2019",
        "dateOfIncident": "08/12/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244079,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEM STARTED WHEN THE ENGINE WAS RUNNING ROUGH OCCASIONALLY.  ESPECIALLY WHEN STARTING.  ALMOST STALLED.  THEN THE CAR STARTED OVER HEATING OCCASSIONALLY.  FINALLY THE CHECK ENGINE LIGHT CAME ON.  HAD THE CODE CHECKED.  MISFIRE IN CYCLINDER 1.  ALSO WHEN IT OVERHEATED WE CHECKED THE COOLANT, THE RESEVOR WAS EMPTY.  WE ADDED THE PROPER AMOUNT OF COOLANT.  2 DAYS LATER IT WAS EMPTY.  BUT NO SIGN OF LEAK.  TOOK TO DEALER AND THEY SAID THERE IS A MANUFACTUR DEFECT WHERE THERE IS A CRACK BY THE CYCLINDERS AND COOLANT IS LEAKING INTO THE OIL.  NEEDED A NEW ENGINE.",
        "vin": "1FMCU9GD1JU"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/13/2019",
        "dateOfIncident": "08/13/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243763,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LIGHTS DO NOT ILLUMINATE WHEN ADAPTIVE CRUISE CONTROL APPLIES THEM; BRAKE LIGHTS DO FUNCTION NORMALLY ON MANUAL BRAKING. THE APPARENT DESIGN FLAW OF BRAKE LIGHTS FAILING TO ILLUMINATE WHEN ADAPTIVE CRUISE CONTROL APPLIES THE BRAKES VIOLATES THE SAFETY PRINCIPLE OF BRAKE LIGHTING ALTOGETHER. SUCH A DESIGN SHOULD NOT BE ALLOWED ON THE ROAD AS IT COULD LEAD TO INCREASED COLLISIONS UNDER CERTAIN CONDITIONS. THIS CONDITION IS OBSERVED TO HAPPEN CONSISTENTLY.",
        "vin": "1FMCU9J93JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/05/2019",
        "dateOfIncident": "07/02/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241773,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 HEAD GASKET  AT 23000 MILES WAS TOLD IN THE SHOP AT SHEZZY FORD  THAT  THEY HAD THREE MORE IN THE SHOP FOR THE SAME THING. THAT THERE WAS A PROBLEM WITH THEM. CAR BE DRIVEN ON INTERSTATE CHECK ENGINE CAME ON THE PULLED CODES MISFIRE COLD START. LOSE OF POWER",
        "vin": "1FMCU9GD4JU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/31/2019",
        "dateOfIncident": "06/18/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240823,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 FORD ESCAPE TITANIUM PROBLEM HAS OCCURRED 2 TIMES WITHIN ONE MONTH. BOTH TIMES FORD DEALERSHIP STATED THEY COULD NOT DUPLICATE PROBLEM.WHEN TRYING TO START CAR. THERE IS NO POWER WHATS SO EVER. ONCE IN MY DRIVEWAY AND 2ND TIME AT A RESTAURANT. CAR WAS STATIONARY BOTH TIMES. TRIED JUMPING CAR BUT NO LUCK. CALLED ROADSIDE ASSIST TO TAKE TO FORD DEALERSHIP. THIS TO ME IS A SAFETY ISSUE AS OTHER PEOPLE'S COMPLAINTS INDICATE LOSS OF POWER WHILE DRIVING AND HAVING NO CONTROL OVER CAR. I'VE OWNED THE CAR 4 MONTHS. THE FIRST INCIDENT INCLUDED NO POWER BUT ALSO THE STOP/START FEATURE WOULD FAIL TO RESTART THE MOTOR AFTER BEING STOPPING FOR A STOP SIGN OR A RED LIGHT. THIS HAPPENED AT LEAST 35 TIMES WITHIN 4 MONTHS...SECONDLY THE REAR HATCH WOULD NOT LOCK PROPERLY AND THE USB PORTS WOULD NOT CHARGE MY IPHONE. THE DEALER INDICATED THE BATTERY SHOWED A FAILURE AND REPLACED BATTERY, BUT STOP/START FEATURE CONTINUES TO FAIL. THIS VEHICLE IS STILL UNDER FACTORY WARRANTY.",
        "vin": "1FMCU0J94JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/31/2019",
        "dateOfIncident": "08/25/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240970,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A BRAND NEW 2018 FORD ESCAPE IN JANUARY OF 2018 FOR WHICH I PAID IN FULL.ON 8-25-18 THE CHECK ENGINE WARNING APPEARED ON MY DASH WHILE DRIVING ON AN EXPRESSWAY.I TOOK IT IN FOR SERVICE AND WAS INFORMED THAT IT NEEDS A NEW ENGINE DUE TO AN INTERNAL OIL LEAK WHICH WARPED THE CYLINDER HEAD. I DIDN'T GET MY CAR BACK UNTIL 9-22-18.ON MARCH 2, 2019 I HAD TO PULL OFF TO THE SIDE OF THE ROAD WHILE DRIVING ON A CITY STREET  BECAUSE I HEARD A VERY LOUD NOISE AND THERE WAS A DISTINCT ODOR OF BURNT RUBBER.THE CAR WAS TOWED TO THE DEALERSHIP AND WAS THERE FOR FIVE DAYS.THE DIAGNOSIS: BAD WIRES, BAD TRANSFER CASE AND FRONT DRIVE SHAFT LEAKING GREASE. AN ISSUE WITH THE 4WHEEL DRIVE SYSTEM.ON MAY 22, 2019 THE CHECK ENGINE LIGHT CAME UP ONCE AGAIN.THIS TIME: A CRACKED SPARK PLUG WHICH CAME WITH THE NEW ENGINE INSTALLED IN AUGUST 2018. ON JULY 11, 2019 DRIVING ON THE EXPRESSWAY, WARNING APPEARED ON MY DASH \"ENGINE TOO HOT\". IT WAS LATE EVENING, AFTER SERVICE HOURS.THEREFORE I DROVE IT THERE THE FOLLOWING MORNING TO BE TOLD THAT I NEED TO LEAVE IT, BUT THEY DON'T  HAVE A LOANER CAR FOR ME. I HAD TO DRIVE OFF IN MY CAR BECAUSE OF MY RESPONSIBILITIES AND COULD NOT BE WITHOUT A VEHICLE. WAS FORCED TO DRIVE WITH MY WINDOWS OPEN (OBVIOUSLY COULDN'T USE AC). MY FIRST OPPORTUNITY TO RETURN TO THE SERVICE DEPARTMENT WAS ON 7-15-19. I COMPLAINED TO THE MANAGER REGARDING THE SITUATION WHEN I INITIALLY CAME IN A FEW DAYS AGO.HE ASSURED ME HE WILL HAVE A LOANER VEHICLE FOR ME.TODAY, ON 7-31 I FINALLY RECEIVED A VOICE MESSAGE FROM THE MANAGER (ONLY BECAUSE I INITIATED THIS BY CALLING AND LEAVING HIM A MESSAGE EARLIER INQUIRING ABOUT MY VEHICLE AN WONDERING WHY I HAVEN'T HEARD ANYTHING).THE INFORMATION I RECEIVED WAS THAT MY CAR NEEDS AN ENGINE REPLACEMENT  (AGAIN).PARTS HAVE BEEN ORDERED BUT ARE ON BACKORDER. THEY WILL KEEP ME UP TO DATE.I WILL NEVER FEEL SAFE IN THIS VEHICLE!",
        "vin": "1FMCU9GD7JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/10/2019",
        "dateOfIncident": "06/14/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230785,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 FORD ESCAPE. THE CONTACT STATED THAT THE CHECK ENGINE INDICATOR ILLUMINATED WHEN THE VEHICLE WAS STARTED AND THE VEHICLE HESITATED. THE VEHICLE WAS TAKEN TO FREDERICK FORD (302-629-4553, LOCATED AT 26905 SUSSEX HWY, SEAFORD, DE 19973) WHERE IT WAS DIAGNOSED THAT CYLINDER NUMBER THREE MISFIRED (CODES: PO316 AND PO303). THE TECHNICIAN ALSO STATED THAT CYLINDERS THREE AND FOUR OPERATED AS DESIGNED. THE FAILURE RECURRED. THE VEHICLE WAS TAKEN BACK TO THE SAME DEALER WHERE A MISFIRE ON CYLINDER NUMBER THREE WAS DIAGNOSED AGAIN. THE VEHICLE WAS SCHEDULED FOR A FUEL INJECTOR REPLACEMENT. THE FAILURE RECURRED AND THE VEHICLE WAS TAKEN BACK TO THE SAME DEALER WHO DIAGNOSED THAT THE ENGINE TEMPERATURE WAS APPROXIMATELY 130 DEGREES. THE MANUFACTURER WAS MADE AWARE OF THE FAILURES. AFTER CONSULTATION WITH THE DEALER, THE CONTACT WAS INFORMED TO RETURN THE VEHICLE TO THE SELLER (PITTSVILLE FORD, 877-760-5870, LOCATED AT 34690 OLD OCEAN CITY RD, PITTSVILLE, MD 21850) FOR A BUY BACK. THE VEHICLE WAS TAKEN BACK TO THE SELLER AND THE CONTACT WAS INFORMED THAT THE ENGINE MAY NEED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED OR REPLACED. THE CONTACT WAS PROVIDED A LOANER VEHICLE BY THE SELLER. THE FAILURE MILEAGE WAS 18,620.",
        "vin": "1FMCU0GD1JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/26/2019",
        "dateOfIncident": "11/14/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222633,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 FORD ESCAPE WITH AROUND 10,000 MILES STARTED HAVING ENGINE TROUBLE WHILE DRIVING ON THE HIGHWAY. ENGINE LIGHT CAME ON AND WAS TAKEN DIRECTLY TO A FORD DEALERSHIP TO DIAGNOSE THE ISSUE. THEY STATED THAT COOLANT IS LEAKING INTO THE CYLINDERS.  THEY DID A COOLANT PRESSURE SYSTEM TEST AND REPLACED A SPARK PLUG. AFTER RECEIVING THE VEHICLE BACK AND ONLY DRIVING ABOUT 300 MILES, THE SAME ISSUE HAPPENED AND THE CHECK ENGINE LIGHT CAME BACK ON. TOOK BACK TO THE DEALERSHIP FOR REPAIR. THIS TIME THEY REPLACED THE HEAD GASKET ON ONE SIDE ONLY. AFTER RECEIVING THE VEHICLE BACK AND DRIVING IT FOR ABOUT 1,500 MILES, THE SAME ISSUE HAPPENED AND THE CHECK ENGINE LIGHT CAME ON AGAIN. TOOK BACK TO DEALERSHIP ON 4/3/19 AND AS OF TODAY, 6/26/19, IT STILL REMAINS IN THE SHOP. THEY HAVE BEEN TRYING TO REPLACE THE ENTIRE ENGINE BUT ARE HAVING DIFFICULTY FOR SOME REASON. THIS ENGINE IS FAULTY AND COULD CAUSE A FIRE IF THE PROBLEM CONTINUES TO REMAIN. FORD CORPORATE HAS BEEN NO HELP IN RESOLVING THIS OR PROVIDING USEFUL SOLUTIONS AND ANSWERS. THE VEHICLE HAS BEEN IN THE SHOP FOR OVER 100 DAYS.",
        "vin": "1FMCU9GD4JU"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/16/2019",
        "dateOfIncident": "04/26/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220494,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 ESCAPE PURCHASED MARCH 2018. APRIL 2018 AFTER DRIVING ON HIGHWAY WHILE DECELERATING DOWN OFF RAMP THE FOLLOWING WARNING MESSAGES BEGAN FLASHING: HILL START ASSIST UNAVAILABLE, STEERING ASSIST NOT OPERATIONAL, AND 911 ASSIST NOT OPERATIONAL. THIS HAPPENED SEVERAL TIMES UNTIL DEALER WAS ABLE TO GET VEHICLE INTO SERVICE SCHEDULE. DURING MALFUNCTION VEHICLE WOULD BECOME HARD TO TURN. REPAIR ORDER OPENED 4-26-18 DURING DIAGNOSTIC 28 CODES WERE FOUND IN MEMORY. BCM REPLACED VEHICLE RETURNED ON 05-03-18. AUGUST 2018 SAME PROBLEMS STARTED AGAIN, IN ADDITION TO SEATBELT MINDER LIGHT ILLUMINATING WHILE ALL PASSENGERS WERE BUCKLED, AND AIRBAG LIGHT. VOICE COMMAND SYSTEM SPOKE PROCEED TO DEALERSHIP FOR SERVICE IMMEDIATELY. REPAIR ORDER OPENED 2ND TIME 08-29-18. DEALER SERVICE DEPARTMENT UNABLE TO REPAIR VEHICLE IN TIMELY MANNER THROUGH SEVERAL ATTEMPTS. COMPLAINT TO FORD HEADQUARTERS CUSTOMER SERVICE DEPARTMENT OPENED ON 10-18-18 AS VEHICLE WAS STILL NOT FULLY REPAIRED AT THAT TIME. VEHICLE WAS RETURNED TO ME LATE OCTOBER, DEALER HAD VEHICLE IN SERVICE DEPARTMENT NEARLY 3 MONTHS. MULTIPLE POWER MODULES REPLACED, WIRE HARNESS REMOVED FROM VEHICLE AND MULTIPLE WIRE CAPS REPAIRED/REPLACED. JUNE 2019 SAME EXACT PROBLEMS STARTED AGAIN, SAME WARNING CODES AND LIGHTS AS THE FIRST FEW TIMES ONLY NOW THEY HAPPEN AT RANDOM. VEHICLE MILEAGE JUST OVER 13,000. THIS IS THE 3RD TIME IN 14 MONTHS THAT THE SAME ELECTRICAL ISSUES HAVE OCCURRED. CURRENTLY AWAITING SERVICE APPOINTMENT AT THIS TIME.",
        "vin": "1FMCU0F74JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/05/2019",
        "dateOfIncident": "06/04/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218019,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT THE VEHICLE BACK IN LATE JANUARY EARLY FEBRUARY OF 2019. IN APRIL, THE CHECK ENGINE LIGHT CAME ON FOR A CYLINDER 3. BROUGHT THE CAR TO GET FIXED ON 4/25 A WEEK AFTER THE CHECK ENGINE LIGHT CAME BACK ON IN WHICH THE FORD DEALERSHIP WAS SURPRISED DUE TO THE FACT THAT 6 CYLINDERS AND SENSORS WERE FIXED. I WAS GIVING THE VEHICLE BACK WITH THE CHECK ENGINE LIGHT STILL ON AND MEMORIAL DAY WEEKEND CAME ALONG AND THEY STATED THAT THE CAR NOW NEEDS A NEW ENGINE AND DIDNT WANT TO PROVIDE A LOANER VEHICLE EVEN THO ITS COVERED UNDER WARRANTY. 6/4/2019 I WAS LEFT STRANDED WITH THE CAR OVERHEATING AND ENGINE SEIZED UP.",
        "vin": "1FMCU9GD9JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/29/2019",
        "dateOfIncident": "05/29/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210726,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH ONLY 18,000 MILES ON MY CAR, THE CHECK ENGINE LIGHT CAME ON AND IT OVERHEATED. THE DEALERSHIP MISDIAGNOSED THE PROBLEM AFTER HAVING THE VEHICLE FOR 2 WEEKS. WITHIN A DAY OF ME HAVING IT BACK, THE SAME THING HAPPENED AGAIN. THIS TIME, THE DEALERSHIP HAD THE VEHICLE FOR OVER 2 MONTHS BECAUSE PARTS TO REBUILD THE ENGINE WERE ON BACKORDER. ONCE I RECEIVED THE VEHICLE BACK, IT NEVER DROVE THE SAME BUT I LIVED WITH IT. HERE I AM 3 MONTHS LATER AND THE CHECK ENGINE LIGHT IS ON AGAIN! FORD SHOULD BE ASHAMED. WILL NEVER PURCHASE ANOTHER FORD AGAIN IN MY LIFE.",
        "vin": "1FMCU9GD9JU"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/28/2019",
        "dateOfIncident": "05/27/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210424,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 FORD ESCAPE. WHILE DRIVING APPROXIMATELY 65 MPH, AN EXPLOSIVE NOISE WAS HEARD COMING FROM THE VEHICLE. THE VEHICLE WAS PULLED OVER TO THE SIDE OF THE ROAD AND THE CONTACT NOTICED THAT THE SUN ROOF EXPLODED WITHOUT WARNING OR AN IMPACT. THERE WERE NO INJURIES. THE VEHICLE WAS TAKEN TO ROBINSON BROTHERS FORD (225-293-8900, LOCATED AT 11455 AIRLINE HWY, BATON ROUGE, LA 70816) WHERE IT WAS STATED THAT THE FAILURE WAS AN UNKNOWN ISSUE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROPRIATELY 24,900.  *TR",
        "vin": "1FMCU0J94JU"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/27/2019",
        "dateOfIncident": "04/07/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210149,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I LEASED MY FIRST NEW CAR ON JANUARY 29, 2018. STARTING IN APRIL OF 2019 MY VEHICLE HAS FAILED TO START ON NUMEROUS OCCASIONS.  I TOOK IT TO THE DEALERSHIP WHERE I BOUGHT IAT AND THEY CANNOT REPLICATE THE ISSUE.  IT WON'T START WHEN THE VEHICLE IS STATIONARY.  YESTERDAY IT HAPPENED WHEN I PUT THE TRANSMISSION IN REVERSE (SOMETHING NEW).  AFTER PUTTING THE CAR IN REVERSE, IT STOPPED AND THE DISPLAY SAID \"TRANSMISSION NOT IN PARK\".  THIS HAPPENED AGAIN TODAY. IT HAS STALLED AND REFUSED TO START IN MY GARAGE, ON A CITY STREET AND IN A PARKING LOT.  IT IS VERY SCARY - ESPECIALLY WHEN I HAD MY TWO GRANDCHILDREN WITH ME.",
        "vin": "1FMCU9GD0JU"
    },
    {
        "components": "SUSPENSION,WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/24/2019",
        "dateOfIncident": "05/13/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209811,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON LATE EVENING OF MAY13, 2019 I WAS DRIVING MY FORD ESCAPE (ODOMETER IS AT 1368 MILES) ON EXCELLENT ROAD CONDITIONS ALONG SIDE ONE VEHICLE WITH NO OTHER TRAFFIC. WE JUST PASSED UNDER TRAFFIC SIGNAL WITH ESTIMATED SPEED AT 10-15MPH. WITHOUT WARNING THE LEFT FRONT WHEEL BUCKLED UNDER THE FRAME. THE SOUND WAS FRIGHTENING AND SO LOUD THAT THE DRIVER NEXT TO ME HEARD THE INCIDENT AND TURNED AROUND AT THE NEXT LIGHT TO COME BACK AND CHECK ON ME. I SKIDDED IN MY TRAVEL LANE FOR APPROXIMATELY 15FEET.THERE WAS NO COLLISION, NOR IMPACT WITH ROAD MEDIAN NOR DID I COME IN CONTACT WITH ANY DEBRIS / POTHOLES ON ROAD. IMMEDIATELY THE ENGINE SHUT OFF WHICH IS ONE OF THE WONDERFUL SAFETY FEATURES WHICH HELPED BASE MY DECISION ON PURCHASING OF MY ESCAPE. THE DAMAGE CAUSED DIFFICULTY TO OPEN DRIVERS SIDE DOOR,THE TIRE SEPARATED FROM RIM IN ADDITION TO THE UNDER CARRIAGE DAMAGE. I FOUND SIMILAR INCIDENTS ON THE FORD RECALL SITE. THERE WAS NO POLICE REPORT FILED , YET I HAVE A CLAIM IN WITH MY INSURANCE COMPANY.$500 DEDUCTIBLE UNPLANNED EXPENSE.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/18/2019",
        "dateOfIncident": "05/12/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208382,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE AND ACCELERATOR DID NOT WORK AFTER A SUDDEN STOP ON THE SIGNAL LIGHT (ON A SLOP, ENTRANCE OF A HIGHWAY). AFTER THE STOP , MY CAR STARTED ROLLLING BACKWARD, NEITHER BRAKE OR ACCELERATOR COULD STOP THE BACKWARD ROLLING. I HAVE TO USE THE EMERGENCY BRAKE TO STOP THE CAR TO AVOID CRASH WITH THE CAR BEHIND ME. THIS IS THE SECOND TIME. LAST TIME I WAS ON THE ENTRANCE OF A HIGHWAY, ABOUT TO ACCELERATE, BUT SUDDENLY THE CAR LOST ITS POWER, THE ACCELERATOR DIDN'T WORK. BUT THAT TIME BRAKE WAS WORKING.",
        "vin": "1FMCU0F76JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/14/2019",
        "dateOfIncident": "08/15/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207414,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 FORD ESCAPE. THE CONTACT STATED THAT A NUMBER #1 CYLINDER HEAD WAS BLOWN ON THE ENGINE FROM BEING OVERHEATED. THE CHECK ENGINE WARNING LIGHT ILLUMINATED. THE DEALER SHEEHY FORD OF ASHLAND (11450 WASHINGTON HWY, ASHLAND, VA 23005 (804) 242-0391) CHANGED THE COIL AND THE CHECK ENGINE WARNING LIGHT UNILLUMINATED. THE VEHICLE HESITATED WHEN THE CONTACT DEPRESSED ON THE ACCELERATOR PEDAL AND THE CHECK ENGINE WARNING LIGHT ILLUMINATED. IN ADDITION, THE CONTACT SMELLED ANTIFREEZE WHEN SHE WAS DRIVING. THE CONTACT TOOK THE VEHICLE BACK TO THE DEALER AGAIN AND THEY NOTICED THE COOLANT WAS LOW AND WAS LEAKING INTO THE ENGINE THUS CRACKING THE CYLINDER. THE DEALER STATED THAT THEY WOULD CONTACT THE MANUFACTURER BEFORE THEY WILL REPAIR THE VEHICLE. THE FAILURE MILEAGE WAS 18,000.",
        "vin": "1FMCU9HD5JU"
    },
    {
        "components": "STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/07/2019",
        "dateOfIncident": "04/29/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206063,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH 10 MONTHS OF OWNERSHIP AND APPROXIMATELY 13,000 MILES THE HEAD GASKET BLEW AT THE NUMBER 1 CYLINDER CAUSING COOLANT TO BURN IN THE ENGINE AND OIL TO BE RELEASED INTO THE INTAKE AND EXHAUST SYSTEMS. ADDITIONALLY, THERE IS A BODY RATTLE ON THE RIGHT SIDE OF THE VEHICLE SOMEWHERE NEAR THE REAR PASSENGER DOOR. REPAIR SHOP IS UNABLE TO LOCATE THE SOURCE OF THE NOISE.",
        "vin": "1FMCU9HD9JU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/22/2019",
        "dateOfIncident": "04/22/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11202869,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING TO WORK THIS MORNING AND A STRONG SMELL OF BURNING PLASTIC/RUBBER FILLED THE CABIN. I DID MAKE IT TO WORK AND HAD SEVERAL COWORKERS SIT IN THE VEHICLE TO MAKE SURE I WAS NOT IMAGING AN ODOR. ALSO LIFTED THE HOOD TO CHECK ENGINE FOR ANY MELTING HOSES ETC AND DID NOT SEE ANYTHING. I TOOK THE VEHICLE IN THAT MORNING, THE SERVICE MANAGER AND TECHNICIAN DID A CHECK AND DID NOT NOTICE A SMELL AND TOLD ME THAT THE SMELL WAS THE LEATHER SEAT COVERS THAT I INSTALLED...    I INSTALLED THE FAKE LEATHER SEAT COVERS OVER TWO MONTHS AGO. I DO KNOW WHAT BURNT RUBBER VS PLEATHER SMELL LIKE. SERVICE PERSON KEPT ASKING IF I HAD LEFT A PHONE PLUGGED INTO THE VEHICLE, AFTER HE ASKED ME THAT I ASKED HIM HAD THERE BEEN OVERHEATING CONCERNS. I WAS TOLD NO, JUST SEEMS STRANGE THING TO ASK IF PHONE JACKS WERE NOT A ISSUE. SO, I AM MAKING A NOTE OF THIS ELECTRICAL ISSUE AND HOPE THAT THIS WILL NOT TURN INTO A PROBLEM.",
        "vin": "1FMCU9J97JU"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/05/2019",
        "dateOfIncident": "03/28/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194120,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR ALLECRATES AT A FAST SPEED BY IT'S SELF, I HAVE TAKEN TO THE SHOP 3 TIMES AND THEY CAN'T FIND ANY CODES, THEY TRIED TO SAY IT WAS MY FLOOR MATS, WELL THOSE HAVE BEEN REPLACED AND ONCE AGAIN MY CAR IS ACCELERATING WITHOUT MY FOOT ON THE ACTUAL GAS , WHEN IT DOES THAT MY ENGINE MAKES A LOUD NOISE WHICH THE SERVICE MANAGER SAID WAS FROM HIGH RPM'S",
        "vin": "1FMCU0GDXJU"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/25/2019",
        "dateOfIncident": "03/14/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191479,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD (FORD #2215 CARLEX ACOUSTIC) CRACKED UNDER NORMAL DRIVING CONDITIONS ON HIGHWAY.  2 WINDSHIELDS REPLACED/REPAIRED IN 2 WEEKS.",
        "vin": "1FMCU0GD0JU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/13/2019",
        "dateOfIncident": "11/11/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185250,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 FORD ESCAPE. CONSUMER WRITES IN REGARDS TO DEFECTIVE DRIVE SHAFT. *LD  *TR",
        "vin": "1FMCU9J95JU"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/04/2019",
        "dateOfIncident": "01/09/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184200,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS NO ILLUMINATION ON THE GEAR SHIFTER (PRNDL) WHEN THE LIGHTS ARE ON OR OFF. EVERY VEHICLE I HAVE HAD, HAS HAD THE ILLUMINATED GEAR SHIFTER. I HAVE READ REPORTS THAT SAID FORD DID NOT INCLUDE THIS FEATURE IN CERTAIN TRIM LEVELS, AND THE ILLUMINATION IS IN THE INSTRUMENT CLUSTER NOW. I FEEL THIS IS A SAFETY CONCERN ESPECIALLY FOR PEOPLE WHO DRIVE AT NIGHT OR LEAVE EARLY IN THE MORNING. I AM A FORD OWNER AND FORMER FORD CERTIFIED MASTER TECHNICIAN AND I CANNOT GET A STRAIGHT ANSWER FROM ANYONE AT THIS POINT.  I DO NOT HAVE DOCUMENTATION AT THIS TIME OF THIS CONCERN EXCEPT THE VEHICLE HAS BEEN IN THE DEALERSHIP FOR THIS CONCERN. IF NEEDED I CAN TAKE PICTURES AND DOWNLOAD THEM. THANK YOU.",
        "vin": "1FMCU9GD7JU"
    },
    {
        "components": "ENGINE",
        "crash": true,
        "dateComplaintFiled": "02/18/2019",
        "dateOfIncident": "07/23/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11180975,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING IN A ROTARY OUR CAR WAS STRUCK VIOLENTLY BY A VEHICLE ON THE LEFT TRYING TO MAKE AN INCORRECT EXIT. THE IMPACT WAS HARD ENOUGH TO CAUSE THE ENGINE TO STOP OPERATING RESULTING IN A TOTAL LOSS OF STEERING LAND BRAKING. BECAUSE OF NO POWER, THE STEERING DID NOT RESPOND NOR DID THE BRAKES. THE DAMAGE TO THE CAR WAS PRIMARILY COSMETIC AND LITTLE MECHANICAL DAMAGE.   THE AIRBAGS DID NOT DEPLOY AND IF THE CAR HAD REMAINED IN CONTROL IT COULD HAVE BEEN STOPPED BEFORE IT PROCEEDED INTO THE ONCOMING LAND CAUSING DAMAGE TO THIS VEHICLE AND THE ONE THAT WAS HIT. IF THERE IS SOME TYPE OF DEVICE TO TURN AN ENGINE OFF WHEN HIT WITH ALL OF OUR POWER STEERING AND BRAKES THIS IS A PROBLEM WHEN THE VEHICLE IS STILL OPERABLE.",
        "vin": "1FMCU9GD6JU"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/16/2019",
        "dateOfIncident": "01/15/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170295,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 FORD ESCAPE. WHILE MAKING A RIGHT TURN AT APPROXIMATELY 5 MPH, THE VEHICLE INDEPENDENTLY ACCELERATED. ADDITIONALLY, WHILE THE VEHICLE WAS REVERSING, IT INDEPENDENTLY ACCELERATED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. KELLY FORD (776 MAGNOLIA AVE, MELBOURNE, FL 32935, (321) 216-2042) WAS CONTACTED AND A DIAGNOSTIC APPOINTMENT WAS SCHEDULED. THE FAILURE RECURRED TWICE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 4,000.",
        "vin": "1FMCU0GD3JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/19/2018",
        "dateOfIncident": "12/08/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162473,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE CYLINDER#2 COOLANT LEAK ON 2018 FORD ESCAPE WITH ONLY 7,865 MILES ON IT AND ALMOST CAUSED A CRASH ON THE FREEWAY. HAD PROBLEMS FOR WEEKS ROUGH IDLING, STALL WARNING CODE P0302 AND THEN IT STARTED TO OVERHEAT FOR 10-15 SECONDS DAILY. ONCE IT OVERHEATED IT WOULD ALWAYS THROTTLE BACK MY ENGINE. CASE IN POINT I WAS GOING 70MPH WHEN IT OVERHEATED AND IT DECELERATED TO 20MPH IN LESS THAN 10 SECONDS AND COULDN'T ACCELERATE TO GET OUT OF THE OTHER CARS WAY GOING 70 PLUS MPH SWERVING AROUND ME TO PULL OVER AND ALMOST GOT INTO A CRASH ON THE 4 LANE FREEWAY NOT GOOD. FINALLY TOOK IT IN WITH IT OVERHEATED TWICE ON THE WAY TO THE DEALERSHIP. AFTER DAYS OF TEARDOWN THE DEALERSHIP SAID I NEEDED A NEW ENGINE DUE TO A COOLANT LEAK INTO THE #2 CYLINDER CAUSED MAJOR DAMAGE BEYOND ECONOMICAL REPAIR PER THEIR CHECKLIST. THE DEALERSHIP TRIED TO GET A SHOT BLOCK ENGINE BUT WENT BACKORDER NONE AVAILABLE IN THE SYSTEM DUE TO THE HIGH DEMAND FOR THIS ENGINE. HAD TO GET FORD TO APPROVE A LONG BLOCK THEY COULD GET LOCALLY. NOW WAITING ON THE REPLACEMENT ENGINE TO ARRIVE AND BE INSTALLED 11 DAYS LATER. I SEE FROM OTHERS THIS IS A KNOWN PROBLEM ON THIS NEW VEHICLE WITH 1 IN 5 ENGINES NEEDING FULL ENGINE REPLACEMENT AT THE 5000-7000 MILES MARK. ASSUMING THEY USE THE SAME OEM ENGINE THIS WILL COME BACK IN ANOTHER 5-7K MILES. I HAVE LOST ALL CONFIDENCE IN THE VEHICLE TO STAY DRIVABLE AND SAFE TO DRIVE FOR MORE THAN A FEW MONTHS..",
        "vin": "1FMCU0HD8JU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/19/2018",
        "dateOfIncident": "12/15/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162510,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS BEING TO ACCELERATE AFTER STOPPING AT A STOP SIGN, WHEN THE STEERING FROZE THEN VIOLENTLY TURNED TO THE RIGHT.  WHEN THE STEERING TURNED TO THE RIGHT I INADVERTENTLY PRESSED ON THE ACCELERATOR PEDAL SPEEDING UP SLIGHTLY TO APPROXIMATELY 15 MPH.  DURING THE SPLIT SECOND THAT THIS HAPPENED I WAS ABLE TO WRESTLE THE VEHICLE BACK TOWARDS THE ROAD BARELY MISSING A TELEPHONE POLE, BUT I DID STRIKE THE GUY WIRES THAT SUPPORT THE POLE.  THIS CAUSED ABOUT $800 IN DAMAGE TO THE VEHICLE AND NO DEFECT COULD BE FOUND BY THE SERVICE STATION.  WHEN THE STEERING DID GO OUT IT WAS THE MOST DIFFICULT THING TO STEER THAT I HAVE EVER DRIVEN INCLUDING OLD LARGE TRUCK WITH NO POWER STEERING.",
        "vin": "1FMCU9GD6JU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/18/2018",
        "dateOfIncident": "12/18/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11160428,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 FORD ESCAPE. CONSUMER WRITES IN REGARDS TO A RUMBLE NOISE WHILE TRAVELING AT 45-50 MPH. *LD    THE CONSUMER STATED THE DEALER ADVISED THE RUMBLE WAS A CHARACTERISTIC OF THE VEHICLE. *JS",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/14/2018",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161299,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING THE VEHICLE AFTER A COLD NIGHT OR NOT BEING USED THE TRANSMISSION LAGGS SHIFTING BETWEEN 2-3 GEAR USUALLY ON SURFACE STREETS THERE IS A 3-5 SECOND DELAY IN ACCELERATION WHICH HAS ALMOST RESULTED IN TWO COLLISIONS FROM BEHIND. I TOOK IT TO THE DEALER WHICH YEILDED NO PROBLEMS FOUND. THE VEHICLE WAS PURCHASED BRAND NEW AND HAS LESS THAN 4000 MILES.",
        "vin": "1FMCU9GD0JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/12/2018",
        "dateOfIncident": "09/20/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161018,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 FORD ESCAPE. WHILE DRIVING 40 MPH, THE CHECK ENGINE WARNING INDICATOR ILLUMINATED AND AN ABNORMAL SOUND WAS HEARD. THE CONTACT CALLED METRO FORD CHICAGO AT (773) 776-7600 (LOCATED AT 6455 S WESTERN AVE, CHICAGO, IL 60636) AND WAS INFORMED TO SCHEDULE AN APPOINTMENT. THE VEHICLE WAS TAKEN BACK TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE OIL WAS UNCOVERED AND SPILLED ALL OVER THE ENGINE, WHICH CAUSED THE ENGINE TO FAIL. THE ENGINE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 1,200.",
        "vin": "1FMCU9HD2JU"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": true,
        "dateComplaintFiled": "12/10/2018",
        "dateOfIncident": "11/28/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11160538,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING HOME 11-28-18 5:40PM PST WHEN MY VEHICLE SUDDENLY SWERVED HARD TO THE RIGHT; I HAD NO CONTROL, & IT CAUSED ME TO HIT A PARKED UNOCCUPIED CAR.  THERE WAS NO WARNING.  I HAD NOT HIT ANY OBJECT NOR POTHOLE.  VEHICLE IS 6 MONTHS OLD.  SUSPENSION GAVE WAY.  PARTS OF SUSPENSION WERE LAYING ON THE STREET.  RIGHT FRONT WHEEL WAS AT A 90 DEGREE ANGLE DUE TO SUSPENSION FAILING.   MY HUSBAND WAS IN THE CAR WITH ME.   I WAS DRIVING 15 MPH.    I HAVE PHOTOS; 2 ARE ATTACHED TO THIS FORM.   I HAVE FILED A CLAIM WITH MY INSURANCE COMPANY BUT I AM UNABLE TO ATTACH THAT DOCUMENT.  NO POLICE REPORT.",
        "vin": "1FMCU0HD8JU"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/19/2018",
        "dateOfIncident": "10/30/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152488,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WARNING LIGHTS INTERMITTENTLY COME ON IN APRIL 2018. MOSTLY CHECK ENGINE FOR SEVERAL MONTHS. TOOK TO AUTO ZONE GOT A READ OUT FOR SENSOR. BUT AAA REPAIR SHOP WOULDN'T USE THEIR REPORT AND WHEN I TOOK IT TO THEM, LIGHT WASN'T ON. SO THEY DIDN'T LOOK AT IT. WAS GONE OUT OF TOWN 6 MONTHS. LIGHT OFF AND ON. RANDOMLY. OCT 2018, HEADING CROSS COUNTRY BACK HOME TO AZ. LIGHTS STARTED COMING ON MORE OFTEN. MORE LIGHTS, ABS, SKID, SEAT BELT, WITHIN THE WEEK, VERY RANDOM OFF AND ON. THEN MORE LIGHTS WOULD COME ON. AUTO ZONE AGAIN GAVE ME A SENSOR REPORT, O2 AND FUEL. WHILE WAITING IN BANK LINE,, WHOLE PANEL OF LIGHTS CAME ON. ACTED STALED, BUT WAS RUNNING, COULD PUSH GAS AND RUN, BUT COULDN'T STEER, BABIED TO A PARKING SPOT, EVEN THE MILEAGE ODOMETER WENT TO SLASH MARKS AND NO NUMBERS. I TOOK A PHOTO. TURNED CAR OFF AND WAITED TO TRY TO CALL FOR ASSISTANCE. BUT AFTER FEW MINUTES, WORKED FINE. THAT NEXT WEEK, I WAS DRIVING ON FREEWAY AND IT DID THE EXACT SAME THING, WHOLE PANEL CAME ON, DASHES FOR NUMBERS AND NO STEERING> SCARED TO DEATH. STILL COULD PUSH GAS AND BRAKED, FEW SECONDS FELT LIKE MINUTES. LIGHTS WENT OUT AND CAR DROVE FINE. LEFT AT A MECHANIC AND HE CHANGED OXYGEN SENSOR, DIAGNOSED THE STALLING, CHECK ENGINE LIGHT BACK ON AND OTHER CODES. R/R OXYGEN SENSOR, AIR/FUEL SYSTEM SERVICE FLUSH, AND COMPUTER / PROGRAMMING UPDATE. RAN ME $568.70. LIGHTS STILL RANDOMLY COME ON, BRAKE ABS, SKID, AND THE PARKING BRAKE LIGHT COMES ON. I PARKED THE CAR AND BOUGHT A NEW ONE. WHERE CAN I TAKE IT. I NEED TO SELL IT TO HELP PAY FOR OTHER CAR, BUT DON'T WANT SOMEONE TO GET HURT WHILE DRIVING THIS ONE. I LOOKED UP KBB AND SAW 3 RECALLS ON ONE WAS PCSM SENSOR AND WHEN I CALLED FORD DEALER, HE SAID NO RECALLS FOR IT. PLEASE HELP. I'M DESPERATE.",
        "vin": "1FMCU03188K"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "10/20/2018",
        "dateOfIncident": "10/17/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141528,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I DROVE MY 2018 FORD ESCAPE INTO MY DRIVEWAY WHICH IS ON A SLIGHT HILL.  I OPENED THE GARAGE DOOR.  I PUT THE CAR IN PARK AND LEFT THE ENGINE RUNNING TO CHECK OUT SOMETHING IN OUR YARD.  I WALKED ACROSS MY SMALL YARD AND THEN HEARD A VERY LOUD BANG.  I TURNED AROUND AND THE CAR WAS NO WHERE IN SIGHT.  I THEN REALIZED IT HAD DRIVEN ITSELF INTO THE GARAGE.  IT RAN INTO MY BICYCLE, A CAR RACK AND SOME PLASTIC CABINETS.  LUCKILY THERE IS ONLY A SMALL DENT AND SCRATCH ON THE FRONT OF THE CAR AND NO ONE WAS HIT.  THIS COULD HAVE BEEN A VERY SERIOUS ACCIDENT.  I AM NOW AFRAID TO DRIVE THE CAR AGAIN AND DON'T FEEL SAFE IN IT.  I TOOK IT IMMEDIATELY TO THE DEALER, BUT THEY SAID THEY COULDN'T FIND ANYTHING WRONG.",
        "vin": "1FMCU0F73JU"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "09/09/2018",
        "dateOfIncident": "09/09/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11128379,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WENT TO STOP ON WET ROAD TRACTION CONTROL KICKED IN WHEELS LOCKED UP CAUSING ME NOT BE ABLE TO GUIDE MYSELF OFF THE ROAD FROM HITTING CAR IT FRONT SLIDE THE WHOLE CAR SHUT DOWN DOORS LOCKED CAUSING ME TO NOT BE ABLE TO GET OUT HAD TO KICK THE DOOR OPEN AND MY PHONE WAS HOOKED UP TO THE BLUETOOTH AND NO COPS WERE CONTACTED LIKE I WAS TOLD IT WOULD BE! IT FELT LIKE MY CAR WAS A ROBOT AND SHUT COMPLETELY DOWN AND I COULD NOT DO ANYTHING AFTER HITTING MY BRAKES IT WAS LIKE HAVING NO TIRES FROM THAT POINT ON AND MY CAR ONLY HAD 9,000 MILES ON IT!",
        "vin": "1FMCU9GD8JU"
    },
    {
        "components": "ENGINE",
        "crash": true,
        "dateComplaintFiled": "09/07/2018",
        "dateOfIncident": "09/03/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128106,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 FORD ESCAPE. THE CONTACT STATED THAT THE VEHICLE EXPERIENCED A LOSS OF ENGINE POWER. AS A RESULT, THE CONTACT EXPERIENCED A COLLISION WITH A TREE. A POLICE REPORT WAS NOT FILED. THE FAILURE OCCURRED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO LUGOFF FORD (LOCATED AT 979 US-1, LUGOFF, SC), BUT THE FAILURE COULD NOT BE DUPLICATED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND DID NOT ASSIST. THE CONTACT WAS ADVISED NOT TO OPERATE A VEHICLE WITH LESS THAN A QUARTER TANK OF FUEL. THERE WERE NO INJURIES. THE FAILURE MILEAGE WAS APPROXIMATELY 7,000. *TT  CONSUMER STATED CAR WAS REPAIRED 12/03/18*JB",
        "vin": "1FMCU0HD6JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/31/2018",
        "dateOfIncident": "08/30/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123635,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "NEW VEHICLE AND ENGINE OVERHEATING AT 25K",
        "vin": "1FMCU9GD6JU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/14/2018",
        "dateOfIncident": "06/05/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11119904,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I BELIEVE MY WIFE AND I EXPERIENCED WHAT IS KNOW AS PARK TO REVERSE.  OUR CAR WAS IN OUR DRIVEWAY AND MY WIFE PUT IT INTO PARK, LEFT THE CAR RUNNING AND GOT OUT AS I WAS GONG TO PUT IT IN THE GARAGE; (I WAS IN THE PASSANGER SEAT AT THE TIME) A DELAY OF SEVERAL SECONDS OCCURRED AND THEN THE CAR STARTED TO MOVE IN REVERSE HITTING MY WIFE AND KNOCKING HER DOWN DRAGGING HER ON THE DRIVEWAY; NEXT THE CAR WAS IN THE MIDDLE OF OUR STREET WITH ME IN THE PASSENGER SEAT STILL MOVING SIDEWAY AND BACKWARDS SLAMMING INTO OUR NEIGHBORS FENCE ACROSS THE STREET.  FORD MOTOR CO HAS INSPECTED THE VEHICLE AT THE DEALER STATING THERE IS NOTHING WRONG WITH THE TRANSMISSION.  THEY HAVE DENIED MY CLAIM FOR THE INJURIES AND MEDICAL BILLS MY WIFE HAS AS A RESULT OF THE ACCIDENT.  THE OFFICE OF GENERAL COUNSEL AT FORD MOTOR CO. REFUSES TO PROVIDE ME WITH A COPY OF THE ENGINEERS REPORT WHO INSPECTED THE CAR.  THEY STATE; \"THERE IS NO WRITTEN REPORT\"!  HOW IS THAT POSSIBLE?  BECAUSE WE HAVE NO ATTORNEY THEY ARE TREATING US WITH THE MIDDLE DIDGET.  PLEASE HELP AND THE PUBLIC SHOULD BE AWARE OF THIS POTENTIAL SAFEY ISSUE WITH THE 2018 FORD ESCAPE WITH THE 6SPEED AUTOMATIC TRANSIMISSION",
        "vin": "1FMCU9J93JU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/07/2018",
        "dateOfIncident": "07/31/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118314,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERIOR DOOR HANDLE FELL APART.",
        "vin": "1FMCU9GD7JU"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/02/2018",
        "dateOfIncident": "05/31/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115292,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "GETTING TERRIBLE GAS MILEAGE ONLY ABOUT 17 MILES TO THE GALLON, HAD 60 MILES ON CAR WHEN LEASED AND THEY TOLD ME TO WAIT TILL I HAD A 1000 MILES NOW HAVE 2000 MILES AND STILL GETTING LOUSY MILEAGE.  ALSO, STOP/START DOES NOT SEEM TO BE WORKING.  ALSO KICK PLATE ON BACK DOESN'T WORK WELL. WELL, NOW TRY TO TAKE IT IN.",
        "vin": "1FMCU9J92JU"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/30/2018",
        "dateOfIncident": "06/20/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114533,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RIGHT REAR SEAT BELT HAS NEVER WORKED. IT HAS BEEN LOCKED SINCE I BOUGHT THE VEHICLE. I FOUND OUT ABOUT IT A FEW WEEKS AFTE I PURCHASED THE VEHICLE WHEN MY GREAT GRANDDAUGHTER GOT IN THE BACK SEAT AND IT DIDN'T WORK. I TOOK IT BACK TO THE DEALER AND THEY TOLD ME THEY WOULD ORDER A NEW ONE. THAT WAS SEVERAL WEEKS AGO AND I HAVEN'T HEARD ANYTHING FROM THEM, SO I CALLED THEM THIS MORNING BECAUSE I WANT TO MAKE A TRIP NEXT WEEK AND PEOPLE WILL BE IN MY BACK SEAT. THEY ACTED LIKE THEY DIDN'T KNOW WHAT I WAS TALKING ABOUT. I ALWAYS TALK WITH THE SAME TWO PEOPLE.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/25/2018",
        "dateOfIncident": "07/16/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11113565,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 FORD ESCAPE. WHILE DRIVING APPROXIMATELY 10 MPH, THE REAR LIFTGATE OPENED AND A SUITCASE FELL OUT OF THE VEHICLE ONTO THE ROAD. THE CONTACT PULLED OVER TO THE SIDE OF THE ROAD AND WENT TO RETRIEVE THE SUITCASE FROM THE ROAD. WHEN ATTEMPTING TO PUT THE SUITCASE BACK INSIDE THE VEHICLE'S REAR AREA, THE HATCH STARTED TO CLOSE ON THE CONTACT'S HEAD AND DID NOT STOP. THE CONTACT HAD TO USE BOTH HANDS TO HOLD THE HATCH OPEN. THE CONTACT HAD TO GO TO THE URGENT CARE FACILITY AND WAS DIAGNOSED WITH A CONCUSSION. THE CONTACT WAS TREATED AND RELEASED. THE VEHICLE WAS TAKEN TO THE DEALER (DAVIDSON FORD OF CLAY, 3690 NY-31, LIVERPOOL, NEW YORK, (315) 860-009), BUT THE FAILURE COULD NOT BE DUPLICATED. THE DEALER STATED THAT THE CONTACT'S FOOT MUST HAVE BEEN TO CLOSE TO THE REAR FOOT SENSOR, WHICH CAUSED THE HATCH TO CLOSE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 6,709.",
        "vin": "1FMCU9J94JU"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/18/2018",
        "dateOfIncident": "07/16/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112250,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DIVING DOWN 8 MILE RD IN FARMINGTON HILLS, MI AT APPROXIMATELY 35 MILES PER HOUR, MY VISTA ROOF EXPLODED. THE GLASS DID NOT FALL ON ME BECAUSE I HAD THE SHADE PULLED AT THE TIME.",
        "vin": "1FMCU9HD4JU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/11/2018",
        "dateOfIncident": "07/11/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110885,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER HAVING INTERMITTENT PROBLEMS WITH THE REMOTE START NOT WORKING, I ATTEMPTED TO START THE VEHICLE FROM THE FORD PASS APP WHILE MY CAR WAS PARKED IN AN UNCOVERED LOT, WHICH DID NOT START. I STARTED REMOTELY FROM THE KEY FOB AND LOADED MY INFANTS CAR SEAT INTO THE CAR, PUT MY BAG IN THE CAR, AND SHUT THE DOOR. AFTER CLOSING THE DOOR, I HEARD THE LOCKS CLICK, AND THE ENGINE SHUT OFF. I WAS LOCKED OUT OF MY CAR WITH MY KEYS AND BABY LOCKED IN AND THE ENGINE OFF. I WAS ABLE TO UNLOCK THE CAR FROM THE APP BECAUSE MY PHONE WAS IN MY POCKET WHEN I SHUT THE DOOR, BUT OTHERWISE, WOULD HAVE TRAPPED MY NEWBORN IN A HOT CAR WITH NO WAY TO UNLOCK.",
        "vin": "1FMCU0J90JU"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/28/2018",
        "dateOfIncident": "05/23/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104604,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED NOV 2017- ON MAY 23RD, 2018 MY CHECK ENGINE LIGHT CAME ON. I CONTACTED SERVICES AT THE FORD DEALER THE FOLLOWING MORNING.  I WAS AT THE DEALER FIRST THING TUESDAY MORNING DUE TO THE HOLIDAY WEEKEND, WHERE THEY RAN DIAGNOSTICS ON MY VEHICLE. I WAS INFORMED THAT IT NEEDED A NEW ENGINE. THE ENGINE COOLANT HAD MIXED WITH OIL AND WAS IN THE 2ND COMPRESSION CYLINDAR AND A BULLETIN THAT THIS WAS THE STEPS TO BE TAKEN TO RECTIFY THE SITUATION.  THE ENGINE WAS REPLACED WITH THE SAME ENGINE MODEL AS THE ORIGINAL WITH NO MODIFICATION THAT RECTIFY THE MANUFACTURE DEFECT  I WAS INFORMED THEIR STATISTICS INDICATE THAT 1 IN 5 OF THESE VEHICLES ARE RETURNING FOR A SECOND NEW ENGINE  ON JUNE 12TH, I GOT THE CALL THAT MY ENGINE HAD BEEN REPLACED AND IT WAS READY FOR PICK UP.  I DROVE IT HOME THAT EVENING AS WELL AS,  TO AND FROM WORK WEDNESDAY, THURSDAY AND FRIDAY.  THREE DAYS IS ALL IT TOOK AT ABOUT 25 MILES A DAY, FRIDAY NIGHT ON MY WAY HOME FROM WORK THE CAR STARTED SHAKING ON A BUSY SECTION OF THE HIGHWAY, (93SB BETWEEN 293 AND EXIT 5) WHERE THERE IS CONSTRUCTION AND LITTLE TO NO PULL OFF POINTS, MY SPEED DROPS DOWN TO 20MILES PER HOUR AND WHEN I TRIED TO ACCELERATE THAT ENGINE JUST RACED. I ALMOST GET HIT AS TWO CARS SWERVE TO MISS ME AT HIGH SPEEDS, THANKFUL THEY WERE AWAKE AT THE WHEEL DURING RUSH HOUR. I MANAGED TO GET OFF THE NEXT EXIT AND PULL INTO A PARKING LOT. SHUT OFF THE VEHICLE.  I'M 2 MILES FROM HOME AND AFTER WAITING FOR THE TRAFFIC TO DROP A BIT FROM PEOPLE TRYING TO GET HOME I TAKE THE BACK ROADS AT 20MPH THE REST OF THE WAY HOME. THE CARS ENGINE WOULD RACE WHEN I STOPPED AND SLOWLY ACCELERATE TO 20 SHAKING ALONG THE WAY. SERVICES STATED THE COMPUTER NEEDED TO BE REPLACED ON MONDAY MORNING.   THIS DOES NOT QUALIFY FOR LEMON LAW DUE TO BEING OUT OF THE VEHICLE FOR UNDER 30 BUSINESS DAYS HOWEVER, THIS IS A SIGNIFICANT SAFETY ISSUE THAT NEEDS ATTENTION.",
        "vin": "1FMCU9GD5JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/14/2018",
        "dateOfIncident": "06/06/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101854,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2018 FORD ESCAPE ENGINE LIGHT CAME ON. I TOOK IT TO THE DEALERSHIP TO HAVE IT CHECKED. THEY PUT A MACHINE ON IT AND SAID YOU NEED A NEW ENGINE. I WENT TO SEE MY SALESMAN AND HE WAS NOT IN. I CALLED THE NEXT DAY AND TOLD HIM ABOUT MY ESCAPE. I TOLD HIM I WOULD NOT FEEL SAFE IN IT NOW. HE SAID THERE WAS NOTHING THEY COULD DO. I CALLED FORD MOTOR COMPANY AND THEY STARTED A CASE FILE ON IT. FORD SAID THAT I NEED TO PICK UP MY ESCAPE WHEN IT IS READY AND DRIVE IT FOR AT LEAST 5 DAYS, AGAIN I TOLD THEM I DIDN'T FEEL SAFE. THE CASE WORKER SAID THAT IS HOW THEY DO THINGS. I AM SCHEDULED TO PICK IT UP TODAY THURSDAY. JUNE 14, 2018 BY 8:00 PM. I HAVE ONLY MADE 5 PAYMENTS ON THE ESCAPE. I WOULD LIKE TO CHANGE MY OUT MY LEASE. THE DEALERSHIP SAID IT WOULD COST ME A LOT OF MONEY TO DO THAT. THE REASONS I GET LEASED CARS BECAUSE THEY ARE NEW AND SHOULDN'T NEED TO BE AT SERVICE AFTER THE FIRST 5 MONTHS OF DRIVING IT.",
        "vin": "1FMCU0GD5JU"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "05/16/2018",
        "dateOfIncident": "04/30/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096357,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT THE VEHICLE ON THE 24TH OF APRIL 2018. HAD A COLLISION WITH ANOTHER VEHICLE TRAVELING THE SPEED LIMIT OF 60 MILES AN HOUR. I REAR ENDED THE OTHER VEHICLE AFTER THE BRAKES LOCKED UP AND I DID NOT STOP. THE AIRBAGS ALSO DID NOT DEPLOY. THE ENTIRE FRONT END OF THE VEHICLE WAS PUSHED IN DUE TO THE COLLISION. IT WAS JUST CONSIDERED A TOTAL LOSS AND NOW I DON'T HAVE A VEHICLE BECAUSE OF FAULTY MANUFACTURING.",
        "vin": "1FMCU0F71JU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/15/2018",
        "dateOfIncident": "05/13/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093920,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 FORD ESCAPE. WHILE DRIVING 60 MPH, THE INSTRUMENT PANEL GAUGES ILLUMINATED AND THEN DIMMED. THE FAILURE PREVENTED THE CONTACT FROM READING THE SPEEDOMETER. THE VEHICLE WAS TAKEN TO METRO FORD OKLAHOMA CITY (2800 INTERSTATE 44 SERVICE ROAD, OKLAHOMA CITY, OK 73112) WHERE IT WAS DIAGNOSED, BUT THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 200.",
        "vin": "1FMCU0GD4JU"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/11/2018",
        "dateOfIncident": "05/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093294,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BACK ELECTRIC TAILGATE DOES NOT CLOSE COMPLETELY. THIS IS INDICATED BY THE HORN DOUBLE HONKING WHEN LOCKING THE VEHICLE. HOWEVER, THERE IS NO INDICATOR ON THE DASH WHEN THE CAR IS ON THAT THIS IS NOT FULLY LATCHED. I BELIEVE THIS COULD LEAD TO EXHAUST IN THE CABIN, ESPECIALLY IF IDLING.",
        "vin": "1FMCU0HDXJU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/18/2018",
        "dateOfIncident": "03/17/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11088921,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT A BRAND NEW 2018 FORD ESCAPE. TOOK IT BACK TO THE DEALER BECAUSE I FOUND THAT ALL THE SPINDLES WERE RUSTED. FORD SAID THIS IS NORMAL.  BROUGHT IT TO AN INDEPENDENT MECHANIC-CARTEC IN TULSA, OK. THEY FOUND RUST NOT ONLY ON THE SPINDLES, BUT THE DRIVESHAFT, AND CV AXLES.  THEY PUT THE PICTURES ON A URL  HTTP://2UN.ME/2IL56. I AM WORRIED THESE RUSTED PARTS WILL EVENTUALLY RUST ALL THE WAY AND CAUSE THE WHEELS TO COME OFF, CAUSING AN ACCIDENT IF LEFT UNTREATED.",
        "vin": "1FMCU9GD1JU"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/11/2018",
        "dateOfIncident": "01/09/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062210,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 FORD ESCAPE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V803000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. LARRY H. MILLER FORD LINCOLN DRAPER (11442 LONE PEAK PKWY, DRAPER, UT) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": ""
    }
]