[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/29/2022",
        "dateOfIncident": "03/28/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458856,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Hankook Tire & Technology Co., Ltd.",
                "productMake": "HANKOOK",
                "productModel": "DYNAPRO HP2",
                "productYear": "9999",
                "size": "245/60/R18 105H",
                "type": "Tire"
            }
        ],
        "summary": "Clear day at 5pm. Traveling at 65mph on highway when my rear passenger tire suddenly went flat. There was no debris in the road prior to this. After changing the tire I noticed that the inside sidewall had blown out. The tire size is 245/60R18 105H.  Dynapro HP2",
        "vin": "2fmpk3j90jb"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/24/2022",
        "dateOfIncident": "09/24/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458208,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Ford Edge. The contact stated while driving under 25 MPH, the front, side and rear sensors Forward Collision Avoidance warning lights illuminated on the center display; however, the vehicle speed was not affected. The contact stated there were no objects or other vehicles around the vehicle during the failure. The contact stated that the failure had been reoccurring while driving below 25 MPH. The dealer was notified of the failure and informed the contact that he would be responsible for the diagnostic fee. The vehicle was not diagnosed or repaired. The manufacturer was not notified of the failure. The failure mileage was approximately 33,000.",
        "vin": "2FMPK4K94JB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/22/2022",
        "dateOfIncident": "03/22/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457846,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Engine light came on. Car was driving fine. We are under 100m out of the 60k mi warranty. Coolant in the engine & engine needs needs replaced.",
        "vin": "2FMPK4K92JB"
    },
    {
        "components": "UNKNOWN OR OTHER,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/11/2022",
        "dateOfIncident": "02/24/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456366,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Floor board got flooded with water!    The back seam that is in the roof is faulty.  The seam is above opening when lift gate is up ( not the seal around the gate). Front, midde and compartment with the spare was drenched.   Water ran down the pillars ( nose was angled up). Ford refused to give any assistance.   My concern is all the electrical components can be dangerous and the possibility of mold on the inside.   Our 3/36 warranty has expired  4,000 miles ago and out on the time by around 6 mos.  We have owned the ford less than a year and it has a clean history report.  This is a part that should seal the roof.   We have never touched it and until pointed out, wasn't aware of it.    Other owners should be aware of this.     What other damages can not be seen?",
        "vin": "2fmpk4j84jb"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/10/2022",
        "dateOfIncident": "03/07/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456234,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Check engine light on and kept loosing coolant. Code read as misfire in cylinder 2. Changed spark plugs and light still on. On the way to the dealership to to get it looked at, the engine blew. Bought the SUV in April of 2020. Now I am stuck with a vehicle with 20,000 left to pay on and no money to replace the engine. The SUV only has 63,000 miles on it.",
        "vin": "2FMPK3G96JB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/28/2022",
        "dateOfIncident": "01/26/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454516,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 Ford Edge Titanium. Approximately 90000 miles on car and experiencing an engine misfire on cylinder 3. Dealer says antifreeze (which has recently been losing coolant on a constant basis) is leaking into the cylinder causing the misfire. Claims only fix currently is to replace engine at a substantial cost to me.  I have read a few Ford forums for the 2.0 Liter engine and find this to be a symptomatic problem that Ford is not repairing in good faith due to a manufacturing issue.",
        "vin": "2fmpk3k9xjb"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/23/2022",
        "dateOfIncident": "01/06/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453633,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FLYWHEEL/FLEXPLATE IS CRACKED AND CURRENTLY AT DEALERSHIP FOR REPAIRS i CAN RETRIEVE IF NEEDED. THIS IS ONLY NOTICEABLE DURING DRIVING AND CAN CAUSE THE ENGINE TO STOP WITHOUT NOTICE. THIS IS DANGEROUS IF IN MOVING TRAFFIC. THIS PROBLEM HAS BEEN CONFIRMED WITH DEALERSHIP IN LINE TB19-2236. THE DAMAGED COMPONENT HAS ONLY BEEN AT THE DELAERSHIP TO DATE, UNSURE IF OTHERS WILL INSPECT. THERE WERE NO WARNING LIGHTS, ALERTS OR ANYTHING MINUS THE RATTLING THAT STARTED APPROXIMATELY 30 DAYS AGO. Ford is aware of the issue and has it documented for my model year and will not cover the extensive repair costs nor respond to the other claims similar to mine.",
        "vin": "2fmpk3g92jb"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/06/2022",
        "dateOfIncident": "02/02/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11450696,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The rear hatch, yes it's available for inspection. It closed on me while trying to get items out of the back of the SUV. I opened the hatch from the drivers control panel leaving the car running in park, then tried to get items out of the back. While I was under the hatch it closed on me. I was unable to stop it from coming down on my back/shoulder despite pushing back against it with my arms against the floor. I ultimately had to jump into the back of the vehicle where the hatch closed on my foot and locked. I tried to open it again using the push button on the outside of the hatch, it closed again, I was unable to stop it from closing and locking again while trying to lift it from the outside. It did this four times in a row. The only \"unusual\" thing was that this was during an ice storm.  I have tried to reproduce it several times since with no luck, also there are no freezing temperatures now.  No, I have not taken it to a dealership yet but will this week. I do not know if there were warning lights since I was in the back of the vehicle, but it did sound the tone that you hear when the lid is closing by its own power luckily which alerted me that it was closing. This has never happened, it closed with force four times, and I was unable to stop it",
        "vin": "2FMPK4AP2JB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/02/2022",
        "dateOfIncident": "01/29/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450017,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Ford Edge. The contact stated while driving 10-15 MPH and attempting to accelerate, the vehicle loss motive power. There were no warning lights illuminated. Additionally, while driving the vehicle failed to move and revved up. The vehicle was restarted and worked as designed. The vehicle was taken to an independent mechanic who was unable to duplicate the failure. There were no DTC codes. The contact called the local dealer, but the vehicle was not diagnosed or repaired. The manufacturer was notified of the failure and referred the contact to the NHTSA for assistance. The approximate failure mileage was 28,000.",
        "vin": "2FMPK3G91JB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/01/2022",
        "dateOfIncident": "02/01/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449808,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "We took our 2018 Ford Edge with 63000 miles in for oil change and brake line recall to Koucerek Ford in Wausau, Wi..  We notified them that it seems to be losing antifreeze since December.  They called and informed us that the coolant is leaking into cylinders 2 and 3 and we need a new motor at a cost of $6200.00.  I called Ford customer care and was denied any compensation because it was 3000 miles beyond the warranty.",
        "vin": "2fmpk4j98jb"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "01/26/2022",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449026,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Passenger doors freezes closed when snow and ice build up on the lower door mud guards. Available for inspection. Rear passengers have to crawl out of front doors during winter weather conditions. The problem hasn't been reproduced as of yet to the dealer but has been reported to the dealer. The dealer confirmed the problem a manufacturing flaw. No safety warning lights for the problem. Problem noticed January 2020.",
        "vin": "2FMPK4J95JB"
    },
    {
        "components": "VISIBILITY,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/20/2022",
        "dateOfIncident": "01/20/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448295,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "My wife was driving home from work when she said she heard what sounded like a gun shot! She was very very alarmed by it!! When she got home found that the panoramic sunroof exploded! I will take it to the dealer  tomorrow!",
        "vin": "2FMPK4AP3JB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/27/2021",
        "dateOfIncident": "12/20/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445171,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Engine light came on with a P0303 code denoting a cylinder misfire.  Dealer say engine needs to be replaced.  I researched this online and this is happening to hundreds of people who purchased a 2017 - 2018 Ford Edge with a 2.0 ECO Boost engine.",
        "vin": "2fmpk4j95jb"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/12/2021",
        "dateOfIncident": "12/11/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443550,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The headlights are so dim that the vehicle is almost unsafe to drive at night time. This is especially true while driving in rain or snow at night. I have different strengths of headlights nothing helps. My family is at the point of not wanting to ride anywhere with me in the vehicle at night time. This past weekend it was raining when we left family and driving 20 miles in rain and night on low beam my girlfriend said she will never ride again at night. We live in an area where deer and other animals are often near the road at night time. This 2018 Ford Edge has even me a military veteran almost too scared to drive the vehicle at night time!! PLEASE HELP make Ford remedy this problem before people die!!! There seems to be some sort of opaque lens in front of the low beam headlight bulb and it seems to make is so the low beam is unable to give the vehicle any good lighting on low beam at night time.",
        "vin": "2FMPK4J80JB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/08/2021",
        "dateOfIncident": "05/17/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439723,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I purchased the Ford Edge 09/28/2019 from  Apple Ford Lynchburg VA,  I noticed a ticking noise when crank up the SUV, around June the engine light came on and the vehicle shut off while driving down the road. I took it back to Apple Ford and they checked it and said that the motor had to be replaced. I took it to another mechanic and was told that the motor needed to be replaced. Apple Ford Manager John advised me that he would see if Ford Motors would replace and get back with me, he never did. I went over again to see him he told me the  same thing but never called back. I called the owner and he said that he was going to call Ford Motor to see if they can help me out. Help Me they need to replace it. The owner advised me that a few of the vehicles had a cooling problem running hot. The other mechanic completed a Diagnostics p316 and P1285 and pressure test was recommended. The pressurized test cooling system found coolant in cyclinder walls after test.After performing pressure test 5 hrs.per TBS 192346 found that applied pressure dropped 7psi. Removed spark plugs found evidence of coolant in cyclinders. According to Owner's right a vehicle must not be more than 10 years old and is eligible for the vehicle to be repaired with no cost to the owner. According to www.fordproblems.com/flexplate-rattle for 2015-2018 Edge and carcomplaints.com rattling noise caused by a defective engine flexplate and that a class-action lawsuit wants Ford to properly recall the flexplates. states that owners have had flexplates replaced only a matter of time before they crack again.if unattended the plates a can shatter and cause a host of other problems such as knocking noise when engine shifts into gear, unsetting vibrations, loss of power at high speeds, vehicle won't be able to transfer engine power into transmission. Another thing while driving up hills the engine light would come on and go off after pulling the hill and couldn't drive no faster that 55 miles or light come back on.",
        "vin": "2FMPK4K92JB"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/08/2021",
        "dateOfIncident": "11/08/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439768,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The rear roof glass spontaneously started cracking in a large area.",
        "vin": "2fmpk3k88jb"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/05/2021",
        "dateOfIncident": "11/03/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439511,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Ford Edge. The contact stated while driving approximately 45 MPH, the check engine warning light illuminated. The vehicle was taken to a local dealer where it was diagnosed with needing an engine to be replaced. The vehicle was not repaired. The manufacturer was informed of the failure and advised the contact to take the vehicle to a dealer. The failure mileage was approximately 72,000.",
        "vin": "2FMPK3K96JB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/02/2021",
        "dateOfIncident": "10/04/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439042,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving on the freeway in California, the drivers side visor came lose and hit me in the face and blocked my vision and almost caused an accident at 70 mph. The visor remained attached by the visor light wire. this happened on 10/4/21.",
        "vin": "2FMPK3J88JB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/20/2021",
        "dateOfIncident": "10/20/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437557,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The turn signal randomly loses its tick-tock sound even when the turn signal is active. It happened since I own this brand new car.",
        "vin": "2fmpk4g91jb"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/22/2021",
        "dateOfIncident": "09/08/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433944,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Ford Edge. The contact stated while driving 35 MPH, the contact heard a clicking noise coming from the engine compartment which resulted in the vehicle losing power. The contact stated no warning light was illuminated. The vehicle was able to be pulled over but was not restarted. The vehicle was towed to a local mechanic where it was diagnosed with needing the torque converter replaced. The vehicle was repaired but recall was not covered. Upon investigation, the contact associated the failure with NHTSA Campaign Number: 18V390000 (Power Train) however, the VIN was not included. The manufacturer was informed of the failure and informed the contact that the VIN was not included. The failure mileage was approximately 80,000.",
        "vin": "2FMPK4J93JB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/21/2021",
        "dateOfIncident": "09/21/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433787,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Ford Edge. The contact stated that while his wife was driving at an undisclosed speed, the engine overheating warning light was illuminated. The vehicle was taken to the dealer and diagnosed with coolant leaking into the cylinders and that the vehicle needed an engine replacement. The vehicle was not repaired and remained at the dealer. The manufacturer was not made aware of the failure. The contact related the failure to a TSB 19-2346. The failure mileage was approximately 107,000.",
        "vin": "2fmpk3k93jb"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/10/2021",
        "dateOfIncident": "09/10/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432533,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "There is an engine defect causing coolant to leak into cylinders on my 2018 Ford edge titanium ecoboost 2.0l turbocharged engine. This is a known safety problem and there have been many lawsuits regarding this issue. I have contacted Ford Corporate and they are only recommending to replace the long block instead of replacing the entire engine. There is potential to have damage to the cylinder heads, piston rods and other crucial parts in the engine which make me feel very unsafe about its future reliability when \"only replacing the long block\" which really seems like putting a band aid on the problem. They are not willing to spend the time or money to ensure that the vehicle is safe and the problem is properly diagnosed and resolved. This is alarming as it seems they are trying to cut corners in order to save money. Many people have had this problem and I heard from my private mechanic that they do so many 2.0l ecoboost a week at the dealership because of this exact same problem. I think the NTHSA should look into an engine recall.   I also have had an open recall on the front brake lines needing to be replaced due to possible failure for over 1 year and Ford has dragged their feet.  Please look into my specific case if possible.  [XXX]  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "2FMPK4K99JB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/08/2021",
        "dateOfIncident": "09/04/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11432124,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The power lift gate on the back of my vehicle will unexpectedly shut or quickly drop closed.  On multiple occasions I was removing items from the back of my vehicle when this happened, and I was struck by the lift gate causing injury.  The first time I brought this to the dealer’s attention was July 2019.  They were unable to replicate the problem.  This week, while once again removing items from the back of my car, the lift gate shut suddenly, this time crushing and cutting my wrist.  My wrist immediately bruised and began bleeding.  This was incredibly painful and days later is still not healed.  This is a problem that is well documented by other Ford Edge owners in online forums, but that the dealer has still failed to acknowledge.",
        "vin": "2FMPK4J86JB"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/07/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431987,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Ford Edge. The contact received notification of NHTSA Campaign Number: 20V469000 (Service Brakes, Service Brakes, Hydraulic) however, the part to do the recall repair was not available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The local dealer and Lindsay Ford (11250 Veirs Mill Rd, Wheaton, MD 20902) were made aware of the issue and informed the contact that parts were not yet available. The contact attempted to contact the manufacturer but was not able to speak to a representative. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "2fmpk4k91jb"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/06/2021",
        "dateOfIncident": "06/17/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428070,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Ford Edge. The contact stated that the antifreeze in the vehicle would leak into the cylinders which would result in misfires and the vehicle shaking on a cold start. The contact stated that the check engine and coolant overheating warning lights and messages were displayed on the instrument panel. The vehicle was diagnosed but was not yet repaired. The manufacturer was informed of the failure. The manufacturer informed the contact that the repair parts were on backorder. The failure mileage was approximately 74,000.",
        "vin": "2FMPK4K97JB"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "08/03/2021",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427601,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Ford Edge. The contact stated that while passengers were walking behind the vehicle, the back over prevention system failed to activate. The vehicle was taken to the local dealer to be diagnosed. The contact was informed that the audio unit needed to be replaced. The vehicle was repaired however, the failure recurred. The vehicle was taken to another local dealer Bergstrom Ford Lincoln of the Fox Valley (525 S Green Bay Rd, Neenah, WI 54956, (800) 404-1138) but vehicle was not diagnosed or repaired. The manufacturer was contacted and informed of the failure. The contact was referred to NHTSA for assistance. The failure mileage was 11,000.",
        "vin": "2FMPK4J95JB"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/01/2021",
        "dateOfIncident": "07/30/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427378,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Moisture in rear tail lights and rear reflector on tailgate. Moisture is excessive and Causing streaks and puddles to form in tail lights. Water and Moisture blocks and distorts light from brake lights and tail lights lowering visibility of these lights which could result in accident.",
        "vin": "2FMPK4K86JB"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/29/2021",
        "dateOfIncident": "07/27/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427004,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Ford Edge. The contact stated while driving approximately 50-55 mph, the contact heard a loud explosion. The contact pulled over and checked outside of the vehicle but did not see any damage. The contact restarted the vehicle and started driving and heard wind inside the cabin of the vehicle. The contact pulled over and inspected the vehicle and became aware that the sunroof glass had shattered. There was no impact to the sunroof that could have caused the sunroof to shatter. The dealer was made aware of the failure and provided the contact an estimate for the repair. The vehicle was not repaired. The manufacturer was not made aware of the failure. The failure mileage was approximately 68,000. The VIN was unavailable.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/22/2021",
        "dateOfIncident": "06/16/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426049,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "One morning got in SUV for work. The SUV was hesitant about cracking as if starter was going so I thought, also had a small knocking/ticking noise after turning again it cranked. After a few days the engine light came on and wouldn't go off. Took the vehicle to the dealership to check and I was told that I needed an engine .  The dealership found that cyclinder 2 miss fire nad traced and found coolant in cyclinder. I took the vehicle to a second shop for a second opinion thinking this can't be I only had it for a year and a few months. Second auto shop said same thing your vehicle need a motor. The second shop performed a pressure test found that after applied pressure dropped 7 psi Removed spark plugs and found evidence of coolant in cylinders.",
        "vin": "2FMPK4K92JB"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/13/2021",
        "dateOfIncident": "04/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424577,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Ford Edge. The contact received notification of NHTSA Campaign Number: 20V469000 (Service Brakes, Service Brakes, Hydraulic) however, the part to do the recall repair was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The dealer was made aware of the recall and informed the contact that parts were not yet available. The contact had not experienced a failure. The manufacturer was not made aware of the issue. Parts distribution disconnect.",
        "vin": "2FMPK4AP8JB"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/12/2021",
        "dateOfIncident": "07/05/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424466,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Ford Edge. The contact stated that the front passenger’s side tire experienced a blowout. While attempting to use the lug tool provided with the vehicle, the lug tool failed to fit the lug nuts. The contact called a tow company to assist with replacing the tire with the spare tire. The contact took the vehicle to the local dealer and was informed that the lug nuts were swollen. The vehicle was not repaired but was pending repairs. The manufacturer had been informed of the failure. The failure mileage was approximately 48,000.",
        "vin": "2FMPK4K93JB"
    },
    {
        "components": "PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "07/09/2021",
        "dateOfIncident": "07/07/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424078,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The parking brake flashed a message that it had limited function. Then the message said the parking brake was on. I pulled to the side of the road and then could not release the parking brake or operate the vehicle.",
        "vin": "2FMPK4J98JB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/03/2021",
        "dateOfIncident": "06/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423316,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The steering wheel will click softly and act like it skipped a tooth on a gear. I am told I could lose steering control all together and its possible to just lock up as I'm driving which could lead to an accident or worse. Estimated repairs are from $2300.00 to $ 3000.00 + taxes. From research it appears this has been a problem across multiple models of Ford products from the time this system was initially installed back in 2008.",
        "vin": "2FMPK4K97JB"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/26/2021",
        "dateOfIncident": "03/30/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422448,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Repeated 'misfire in cylinder 2' error code - from what i've seen online, this may mean that coolant is leaking into the engine block and can cause total engine failure. about 77,000 miles currently. Will be taking to dealership in a couple days, as it's a repeated issue and the dealership staff member we talked to said i shouldn't be driving the car, which we just bought in March 2021 from a used car Ford dealership.",
        "vin": "2FMPK3G9XJB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/24/2021",
        "dateOfIncident": "06/24/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422123,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "10162071 Manufacturer Communication Number: TSB 19-2208 Summary Some 2015-2018 Edge and 2017-2019 Fusion/MKZ/Escape/MKC vehicles equipped with a 2.0L EcoBoost engine may exhibit a low coolant level, white exhaust smoke and/or a runs rough condition with or without an illuminated malfunction indicator lamp (MIL). Diagnostic trouble codes (DTCs) may include P0300, P0301-P0304, P0316, P0217, P1285 and/or P1299 stored in powertrain control module (PCM). This may be due to coolant intrusion into the cylinder. To correct the condition, follow the Service Procedure steps to replace the long block engine assembly.",
        "vin": "2FMPK3K93JB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/23/2021",
        "dateOfIncident": "06/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421981,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Lift gate motorized lift cylinder failed to hold the lift gate open while accessing the compartment. Lift gate reversed and you could not stop it by pushing up on the lift gate. Made an appointment at the Ford dealership and they checked the issue out and they confirmed the problem was with the lift cylinder No warning lamps or messages appeared when this happens. Lift gate would not reverse while coming down when up hand pressure was being applied. Serious issue for trapping a person under the lift gate.",
        "vin": "2FMPK4J91JB"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "06/11/2021",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11420534,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Ford Edge. The contact stated that the driver’s and passenger’s side seat adjustment rails had sharp edges. Due to the seat tracks sharp edges, the contact punctured her left leg on the track upon entering the vehicle. The contact sought medical treatment for her injury and was treated for an infection to the wound on her left leg. The contact went to the dealer and notified them of the issue. The dealer decided to place tape on the edges of both seat adjustment tracks to prevent any further injuries. The manufacturer was notified of the failure but offered no further assistance. The vehicle was not repaired. The failure mileage was unknown.",
        "vin": "2FMPK3J9XJB"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/01/2021",
        "dateOfIncident": "04/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419145,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Ford Edge. The contact stated while driving 35 mph and depressing the brake pedal, the vehicle continued moving forward. The contact stated there was no warning light illuminated. The contact stated she continued to depress on the brake pedal to the floor and the vehicle slowed to a stop. The contact received notification of NHTSA Campaign Number: 20V469000 (Service Brakes, Service Brakes, Hydraulic) however, the part to do the recall repair was not yet available. The contact took the vehicle to the local dealer twice and it was confirmed that the part was not yet available. The vehicle was not diagnosed nor repaired. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. Parts distribution disconnect. The failure mileage was approximately 10,000.",
        "vin": "2FMPK4G96JB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/31/2021",
        "dateOfIncident": "05/20/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419084,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 Ford Edge Sport AWD, 7600 miles +/-.  While driving home my wife experienced an Adaptive Steering fault with the steering wheel misaligned about 20 Deg clockwise (pictures available).  Upon arrival I confirmed the fault which cleared by turning the steering wheel back and forth several times.  The next morning the fault reappeared.    Also the driver's seat belt fails to latch properly, takes several attempts and the driver's door is difficult to open from inside.   Took car into the dealership for inspections, replacing the steering wheel assembly and the seat belt assembly, realigned driver’s door. Vehicle has been repaired.",
        "vin": "2FMPK4AP4JB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/26/2021",
        "dateOfIncident": "05/17/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11418657,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "1. The lift gate has come down on top of me several times. I've had bruising on my legs and a headache because of the gate hitting me in the head. 2. There is an anti-freeze odor inside the car intermittently. The dealer tested for leaks but it was inconclusive. I'm taking it back to be tested again this week. 3. On two occasions, the navigation system has given verbal directions different than what it shows on the screen. The first time I thought I heard wrong. But the second time it happened I knew it wasn't my hearing. I have an appointment with the dealer to address this.",
        "vin": "2FMPK4J9XJB"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/19/2021",
        "dateOfIncident": "05/19/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417836,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Sun/panoramic glass roof shattered for no reason.",
        "vin": "2fmpk4k95jb"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/14/2021",
        "dateOfIncident": "05/04/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416536,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY ENGINE LIGHT CAME ON. UPON STARTING MY CAR, IT\u0092S BASA ROUGH IDLE FOR A FEW SECONDS BEFORE GOING TO NORMAL. CODE WAS RAN AN IT WAS DETERMINED TO BE A CYLINDER 2 MISFIRE. MY HEAT HAD QUIT WORKING. I LOOKED UNDER THE HOOD AND THE COOLANT TANK WAS EARLY EMPTY. I REFILLED IT. A FEW DAYS LATER, THE LIGHT CAME ON WHILE DRIVING SAYING OVER TEMPERATURE. CHECKED AGAIN AND COOLANT TANK WAS ALMOST EMPTY AGAIN. HAD IT LOOKED AT AND THERE WAS NO SIGN OF AN EXTERNAL LEAK. UPON SEARCHING, I CAME ACROSS NEWSON LAW IN NASHVILLE WHO HAS A POTENTIAL LAW SUIT AGAINST FORD BECAUSE OF SO MANY COMPLAINTS FOR THIS EXACT ISSUE IN 2016-2018 EDGE WITH 1.5 OR 2.0 ECOBOOST. MINE IS A 2.0. ALL OF THE REVIEWS I HAVE READ ON THIS ISSUE ARE THE EXACT SAME ISSUES HAPPENING. MOST OF WHICH ARE HAPPENING AFTER THE WARRANTY HAS RAN OUT. THIS IS THE CASE FOR ME.",
        "vin": "2FMPK3K95JB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/29/2021",
        "dateOfIncident": "04/17/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414464,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2018 FORD EDGE HAD THE CHECK ENGINE LIGHT ILLUMINATE RECENTLY ONE MORNING WHEN I STARTED THE ENGINE. THE ENGINE HAD A ROUGH IDLE/CHUGGING AND WHITE SMOKE FROM THE EXHAUST THAT ALSO OCCURRED WHEN THE ENGINE LIGHT ILLUMINATED. I SHUT THE ENGINE DOWN, AND RESTARTED THE ENGINE TO SEE IF THE ISSUE WOULD REPLICATE, WHICH IT DID, BUT NOT AS EXTREME. I HAD TAKEN MY VEHICLE INTO THE LOCAL FORD DEALERSHIP ABOUT SIX PRIOR TO THIS INCIDENT FOR A FAULTY FUEL VALVE, AND THE FORD EDGE ACTED THE SAME WAY, EXCEPT THAT THE VEHICLE ENGINE WOULD ALSO CHUG AFTER REFUELING, WHICH IT DIDN'T DO WITH THIS CURRENT ISSUE. WITH THIS MOST RECENT CASE, I TOOK THE FORD EDGE TO THE DEALERSHIP FOR DIAGNOSIS AT 10AM SEVERAL DAYS LATER BECAUSE THEY DIDN'T HAVE ANY IMMEDIATE AVAILABILITY. THE SERVICE MANAGER TOLD ME AT 430PM THAT AFTERNOON THEY COULDN'T REPLICATE THE ISSUE, BUT WANTED TO KEEP THE VEHICLE OVERNIGHT FOR FURTHER TESTING. AT 130PM THE FOLLOWING AFTERNOON, I WAS TOLD THE ENGINE WOULD NEED TO BE REPLACED BECAUSE COOLANT HAD LEAKED INTO THE ENGINE. APPARENTLY, FORD HAS ISSUED A TSB ABOUT THIS ISSUE FOR FORD EDGES FROM 2015-2018, AND OTHER MODELS, BUT THEY HAVEN'T ISSUED A RECALL. I WAS TOLD THE DEALERSHIP HAD SUBMITTED A CLAIM TO THE CORPORATE OFFICE FOR A FULL ENGINE REPLACEMENT, AND SINCE THIS WAS A KNOWN ISSUE, THEY DIDN'T SEE ANY ISSUES WITH IT BEING APPROVED. I HAVE BEEN TOLD IT WILL BE SOME TIME, NO GUARANTEES, AS TO WHEN I WILL HAVE MY FORD EDGE RETURNED SINCE THERE ARE OTHER FORD EDGE'S WITH THIS ISSUE.",
        "vin": "2FMPK3G92JB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/21/2021",
        "dateOfIncident": "08/11/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413252,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A RECALL FROM FORD LAST AUG 11. 20V-469 THAT HAS US WORRIED FOR 8 MONTHS AND WE HAVE CONTACTED OUR FORD DEALER AT LEAST 5 TIMES WITH NO ANSWERS FOR A RESOLATION  YET. WHEN WILL THIS BE RESOLVED?",
        "vin": "2FMPK3J82JB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/19/2021",
        "dateOfIncident": "03/29/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11412921,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A CRACKED GLASS IN MY PANORAMIC ROOF ON MY 2018 FORD EDGE SPORT.  LOCAL FORD DEALER WAS NO HELP IN GETTING FIXED AND MY EXTENDED WARRANTY WILL NOT FIX GLASS. INSURANCE COMPANY IS INVOLVED BUT THERE ARE NO SHOPS WANTING TO FIX GLASS CRACKING.  THIS IS A KNOWN DEFECT ALONG WITH THE EXPLODING GLASS SUNROOFS ON CERTAIN YEARS OF EDGES. SOMETHING NEEDS TO BE DONE. MY CAR WAS SITTING WITH NOTHING THAT COULD HAVE HIT IT. HAPPENED WITH TEMPERATURES CHANGING.",
        "vin": "2FMPK4AP6JB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/16/2021",
        "dateOfIncident": "08/10/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408371,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD NOTIFIED OF THIS PROBLEM ON 8-19-20 AND PROVIDED THE FOLLOWING STATEMENT: FORD MOTOR COMPANY IS WORKING CLOSELY WITH ITS SUPPLIERS TO PRODUCE PARTS FOR THIS REPAIR. WHEN PARTS BECOME AVAILABLE, FORD MOTOR COMPANY WILL NOTIFY YOU VIA MAIL TO SCHEDULE A SERVICE APPOINTMENT WITH YOUR DEALER FOR REPAIRS TO BE COMPLETED FREE OF CHARGE (PARTS AND LABOR). PARTS ARE ANTICIPATED TO BE AVAILABLE 4TH QUARTER 2020. TODAY IS APRIL 16, 2021",
        "vin": "2FMPK3K87JB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/06/2021",
        "dateOfIncident": "03/26/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406766,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2018 FORD EDGE THREW A CODE P0301. WHICH IS A MISFIRE IN CYLINDER 1. COOLANT LEAKING INTO BLOCK AND STARTED THROWING A LOT OF WHITE SMOKE OUT FROM THE EXHAUST. TOOK THE VEHICLE TO THE DEALER AND AFTER THEIR DIAGNOSTIC AND A FEW QUESTIONS TO ME FORD IS NEEDING TO REPLACE THE MOTOR. THE VEHICLE WAS DIFFICULT TO START EACH MORNING AND THE HEN THE MOTOR WAS OFF FOR A WHILE. EVENTUALLY IT WOULD START. OTHER THEN THE CHECK ENGINE LIGHT AND THE WHITE SMOKE OUT THE EXHAUST I NOTICED NO PERFORMANCE LOSS.",
        "vin": "2FMPK3K97JB"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/29/2021",
        "dateOfIncident": "12/28/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405478,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD OIL CHANGED AT DEALERSHIP IN DEC 2020AND ADVISED OF LOW COOLANT. TECH CHECKED NO LEAKS FOUND. MARCH 2021 CHECK ENGINE LIGHT CAME ON CODE P0301, MISFIRE IN CYL 1. HAD NEW SPARK PLUGS PUT IN. DROVE 500 MILES, CODE CAME BACK. SWAPPED COIL PACK FROM CYL 1 AND 2, DROVE ANOTHER 450 MILES CODE CAME BACK. HAD INJECTORS CHECKED, ALL OK. CAR STARTED HAVING A SLOW SLUGGISH START TO IT. NOTICED COOLANT WAS EMPTY. REFILLED, WITHIN A DAY EMPTY. TOOK TO SHOP AND COOLANT IN CYLINDERS",
        "vin": "2FMPK3J90JB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/03/2021",
        "dateOfIncident": "02/17/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399003,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SCREEN WENT COMPLETELY BACK AND NEVER TURNED BACK ON. I CAN NO LONGER USE THE USB PORTS, TURN ON MY RADIO, USE MY REARVIEW MIRROR, CONNECT MY PHONE NOR CONTROL MY A/C SETTINGS. I TOOK IT TO FORD AND THEY INDICATED IT'S A BAD APIM. ANOTHER ISSUE WITH MY VEHICLE. AFTER 18 MONTHS MY BRAND NEW VEHICLE HAD A BATTERY, STARTER, ALTERNATOR AND ENGINE REPLACED. NOW I NEED A NEW APIM? FORD IS RIDICULOUS. THEY'RE CUSTOMER SERVICE AND QUALITY IN CARS IS GONE. MY CAR SHOULD BE  A LEMON YET, 3 YEARS AFTER CONTINUOUS PROBLEMS, I'M STILL FIGHTING FOR MY VEHICLE TO BE RECALLED.",
        "vin": "2FMPK4J94JB"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/09/2021",
        "dateOfIncident": "02/04/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11395432,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2018 FORD EDGE. THE CONTACT STATED THAT WHILE HIS WIFE WAS DRIVING THE VEHICLE AT 55 MPH ON THE HIGHWAY, SHE ATTEMPTED TO DEPRESS ON THE BRAKE PEDAL TO SLOW DOWN IN TRAFFIC WHEN THE BRAKE PEDAL DID NOT FULLY DEPRESS CAUSING THE CONTACTS WIFE TO REAR END AND HIT ANOTHER DRIVER, WHICH CAUSED THE OTHER DRIVER TO SPIN INTO TRAFFIC CAUSING A MULTIPLE VEHICLE COLLISION. THE FRONT DRIVER SIDE AIR BAGS DID NOT DEPLOY. THERE WAS NO WARNING LIGHT ILLUMINATED. THE CONTACTS WIFE SUSTAINED A FRACTURED FINGER, BRUISED HIPS, BRUISED UPPER BODY, AND A SORE BACK. THERE WERE OTHER PEOPLE INJURED IN THE ACCIDENT BUT THAT INFORMATION WAS NOT AVAILABLE. THE CONTACTS WIFE RECEIVED MEDICAL ATTENTION AT THE SCENE OF THE CRASH BUT DECLINED GOING INTO THE HOSPITAL. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO AN IMPOUND WHERE THE INSURANCE COMPANY DEEMED A TOTAL LOSS. THE LOCAL DEALER SAM PACK'S FIVE STAR FORD LEWISVILLE (1144 N STEMMONS FWY, LEWISVILLE, TX 75067) AND THE MANUFACTURER WERE MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 32,000.",
        "vin": "2FMPK3K87JB"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/04/2021",
        "dateOfIncident": "01/15/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394740,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2018 FORD EDGE KEEPS FILLING UP WITH EXHAUST IN THE CABIN. IT HAS DONE THIS ON MANY OCASION'S  IT WILL DO THIS WETHER I AM STATIONARY OR DRIVING . IT'S GETTING WORSE.. I DO A LOT OF HIGHWAY DRIVING LONG DISTANCES  AND I SLEEP IN MY CAR ALOT. THE EXHAUST SMELL HAPPENS NOMATTER IF I AM ON THE HIFHWAY OR RESIDENTIAL STREET. IT HAPPENS ALMOST EVERY FEW DAYS NOW. I DID HAVE IT CHECKED OUT AT RANDON FORD IN FLORIDA . THEY ADVISED ME THAT THEY COULDN,T FIND A LEAK.  THE VERY NEXT DAY I DROVE FROM FLORIDA TO MINNESOTA, THE EXHAUST WAS IN THE CAR SEVERAL TIMES ON THE TRIP",
        "vin": "2FMPK4G92JB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/28/2021",
        "dateOfIncident": "10/16/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390481,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE INTERSTATE AND TRAFFIC WAS HEAVY WITH SPEEDS CONSTANTLY CHANGING. I WAS KEEPING WHAT I THOUGH WAS A SAFE DISTANCE BUT WHEN THE CAR IN FRONT OF ME COMPLETELY STOPPED AND I HIT MY BRAKES, MY VEHICLE SLID INSTEAD OF STOPPING RESULTING IN ME HITTING THE VEHICLE IN FRONT OF ME. WOULD THIS BE ASSOCIATED WITH THE BRAKE RECALL?",
        "vin": "2FMPK3K84JB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/21/2021",
        "dateOfIncident": "01/20/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389143,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2018 EDGE WITH ECOBOOST HAS LESS THAN 62K MILES. NOTICED A RATTLING NOISE WHEN I WAS IDLED OR NOT ACCELERATING. NOISE GOT LOUDER AND WORSE, SEEMED TO HAVE ISSUES CHANGING GEARS, BEGAN SOUNDING LIKE A DIESEL WHEN I WAS IDLE. TOOK IT IN FOR DIAGNOSTICS TODAY AND NOTICED THE CHECK ENGINE LIGHT CAME ON TODAY. RESULTS CAME BACK WITH RANDOM MISFIRE CODE. TURNS OUT THERE IS A CRACK IN THE FLYWHEEL...WHICH FROM WHAT I CAN TELL BY RESEARCH IS DUE TO MANUFACTURER ISSUES WITH THE TORQUE CONVERTER. WHY IS THERE NO RECALL FOR THIS? IT IS DANGEROUS AND THE CAR IS NOT OLD OR WORN OUT ENOUGH TO HAVE THESE KIND OF ISSUES. COST TO CORRECT IS ASTRONOMICAL. PLEASE HELP RAISE AWARENESS AND GET THE HELP CONSUMERS DESERVE.",
        "vin": "2FMPK3G9XJB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/15/2021",
        "dateOfIncident": "01/10/2021",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388359,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 FORD EDGE. THE CONTACT STATED THAT THE VEHICLE LEAKING COOLANT UNTO THE ENGINE CAUSING THE ENGINE TO FRACTURED. THE CONTACT STATED THAT SHE NOTICED THE FAILURE WHILE THE VEHICLE WAS SMOKING AND WAS DRIVING ERRATICALLY. THE ENGINE WARNING LIGHT ILLUMINATED. THE CONTACT MENTION THAT THE VEHICLE WAS UNDRIVERBLE. THE VEHICLE WAS TAKEN TO UNIVERSITY FORD DURHAM, 5001 DURHAM-CHAPEL HILL BLVD, DURHAM, NC 27707, AND WAS DIAGNOSED THAT COOLANT LEAKING INTO THE ENGINE AND HAD FRACTURED THE ENGINE. THE MECHANIC INFORMED THE CONTACT THAT  A NEW ENGINE NEEDED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND REFERRED THE CONTACT TO NHTSA. THE FAILURE MILEAGE WAS APPROXIMATELY 69,747.",
        "vin": "2FMPK3J95JB"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/05/2021",
        "dateOfIncident": "12/29/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386622,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 FORD EDGE. THE CONTACT STATED WHILE IN A DRIVEWAY, THE VEHICLE SHUT-OFF WITHOUT WARNING. THE CONTACT CALLED AN INDEPENDENT MECHANIC WHO MANUALLY RELEASED THE STEERING WHEEL TO MOVE THE VEHICLE. THE VEHICLE WAS TOWED TO BILLY HOWELL FORD (1805 ATLANTA HWY, CUMMING, GA 30040, (770) 872-6928) TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE MAIN INSTRUMENT CONNECTOR WIRE UNDER THE FLOORBOARD WAS FRACTURED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 44,400.  *BF",
        "vin": "2FMPK3G9XJB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/10/2020",
        "dateOfIncident": "11/13/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11382902,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FORD SYNC SYSTEM STOPPED WORKING I CAN NOT CHARGE MY PHONE THE RADIO DOESN'T PLAY NOR DOES THE BACK UP CAMERA WORK ON THE VEHICLE",
        "vin": "2FMPK4K83JB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/01/2020",
        "dateOfIncident": "12/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377273,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "A CLIENT OF OURS WANTS TO FILE A COMPLAINT ON THE 2018 FORD EDGE RECALL. CLIENT WOULD LIKE FORD TO KNOW THAT THEY ARE NOT WORKING WITH THEIR SUPPLIERS FAST ENOUGH TO PRODUCE THE NECESSARY PARTS AND THEREFORE CAUSING A DELAY IN THE REMEDY OF SAID RECALL. THE CLIENT WOULD ALSO LIKE TO NOTE THAT THIS IS CREATING A SAFETY CONCERN FOR THE USER.",
        "vin": "2FMPK4J97JB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/01/2020",
        "dateOfIncident": "11/16/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377321,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 MODEL W/ 2.0L ENGINE.  CAR STARTING & IDLING WAS SLUGGISH.  CHECK ENGINE LIGHT WAS ON.  TOOK TO FORD FOR TROUBLESHOOTING.  EVALUATION REVEALED COOLANT IN CYLINDER.  CAR HAS 34,500 MILES ON IT.  NEW ENGINE WAS REQUIRED.  ENGINES SHOULD NEVER NEED REPLACED.  SEEMS LIKE MANY OTHERS ARE HAVING ISSUES WITH ENGINES ON THIS MAKE & MODEL.      FORD SHOULD REPLACE THESE ENGINES BEFORE WARRANTY EXPIRE AS THEY ARE APPEAR PROBLEMATIC.",
        "vin": "2FMPK4K9XJB"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/12/2020",
        "dateOfIncident": "10/15/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374240,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 FORD EDGE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V469000 (SERVICE BRAKES, SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED VERNER-CADBY INC (1240 BLOOMFIELD AVE, FAIRFIELD, NJ 07004) WHERE IT WAS CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND INFORMED THE CONTACT THAT PARTS WOULD BE AVAILABLE IN 2021. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.  *BF*JB",
        "vin": "2FMPK4J81JB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/02/2020",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372594,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "COOLANT IS GETTING INTO CYLINDERS AND CAUSING THE ENGINE TO RUN ROUGH AND BURN COOLANT AS WELL AS FRYING THE COILS STARTED LESS THAN A YEAR AFTER HAVING THE VEHICLE BUT DIDN'T KNOW IT WAS HAPPENING. CAR DOESN'T OVER HEAT BUT CHECK ENGINE LIGHT COMES ON FOR A MISFIRE IN WHICHEVER CYLINDER AND LOW COOLANT.",
        "vin": "2FMPK3J9XJB"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/19/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365122,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 FORD EDGE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V469000 (SERVICE BRAKES, HYDRAULIC, SERVICE BRAKES) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. WAYNE FORD (444 US-46, WAYNE, NJ 07470, (973) 256-8800) WAS CONTACTED AND IT WAS CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2FMPK4J85JB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/25/2020",
        "dateOfIncident": "09/11/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361204,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A FORD EDGE WITH 60K. IT HAS BEEN DIAGNOSED WITH AN INTERNAL COOLANT LEAK.SIEZED AND STALLED UP ON THE HIGHWAY BECAUSE COOLANT HAS LEAKED INTO CYLINDERS 2 AND 3",
        "vin": "2FMPK3K98JB"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/14/2020",
        "dateOfIncident": "09/10/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354932,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON WARM DAYS THE DRIVER SEATBELT TENSIONER LOCKS AND DOES NOT ALLOW THE SEATBELT TO BE PULLED OUT AND USED BY THE VEHICLE OPERATOR.",
        "vin": "2FMPK4K92JB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/10/2020",
        "dateOfIncident": "08/27/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354098,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2018 FORD EDGE, 67,000 MILES, HAS AND ENGINE LIGHT ON THE DASH. I HAD THE CODE READ AND IT INDICATED A #2 CYLINDER MISFIRE. THE CAR IS AT THE FORD DEALERSHIP AND THEY HAVE INDICATED THAT COOLANT HAS LEAKED INTO THE #2 CYLINDER.   I HAVE RESEARCH THIS ON THE INTERNET AND THERE SEEMS TO BE A LOT OF FORDS WITH THIS SAME PROBLEM. IF THIS WAS AN ISOLATED INCIDENT THEM MAYBE NOT A DEFECT BUT WITH THE AMOUNT OF CASES THIS APPEARS TO BE A MANUFACTURER DEFECT OF THE BLOCK.   I AM WAITING FOR THE DIAGNOSES AND ALREADY THE TECH IS SAYING MAYBE AN ENGINE REPLACEMENT. THE FORD COMPANY SHOULD BE RECALLING THESE ENGINES AND REPLACING THEM AS THEY ARE DIAGNOSED.",
        "vin": "2FMPK3K98JB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/29/2020",
        "dateOfIncident": "08/21/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352016,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2018 FORD EDGE HAS A PROBLEM WITH THE FUEL TANK THAT IS YET TO BE ADDRESSED. WHENEVER I PUMP GAS INTO THE TANK, THE CAR WILL NOT START UNTIL AT LEAST 15 ATTEMPTS. THIS PROBLEM SEEMS TO BE BECAUSE THE TANK WHICH HAS NO CAP DOES NOT CREATE ENOUGH SUCTION PRESSURE FOR THE ENGINE TO PULL THE GAS. WHENEVER GAS IS NEWLY PUMPED, THE ENGINE SEEMS TO PULL AIR, AND WILL NOT START. THE TANK SEEMS TO BE UNABLE TO BLEED OUT AIR OR MAYBE WILL NOT CREATE THE RIGHT PRESSURE UNTIL THE TANK CREATES ENOUGH PRESSURE FOR THE GAS TO FLOW WELL INTO THE ENGINE. THIS IS A SERIOUS PROBLEM THAT FORD COMPANY SEERM NOT TO BE AWARE OF OR MAYBE THEY ARE AWARE AND JUST NOT ADDRESSING IT OR JUST A FACTORY FAULT. WHATEVER IT IS, THIS ISSUE NEEDS TO BE ADDRESSED BY A RECALL PLEASE",
        "vin": "2FMPK3K93JB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/24/2020",
        "dateOfIncident": "08/14/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350950,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "COOLANT LEAKING INTO THE CYLINDERS, I HAVE READ MANY PEOPLE FILING COMPLAINTS ON THIS ISSUE IN THE LAST YEAR ESPECIALLY. EVEN THE TECH AT FORD SAID THIS IS BECOMING A PROBLEM. IT SEEMS THAT THIS NEEDS TO BE UNDER THE RECALL CATEGORY NOW TO HELP PEOPLE NOT GO THROUGH THE PAIN OF WHATS NOT UNDER WARRANTY AND WHAT IS AND HAVING TO SPEND MONEY ON SOMETHING THAT IS CLEARLY AT THIS POINT A MANUFACTURING ERROR. THIS ISSUE ISNT SOMETHING YOU NOTICE IT STARTS WITH A CHECK ENGINE LIGHT AND WILL TURN ON AND OFF.",
        "vin": "2FMPK4K96JB"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/24/2020",
        "dateOfIncident": "07/30/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351055,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS AN ELECTRICAL ISSUE WITH THIS VEHICLE - STARTED AT 24000+/- AND DRAINED BATTERIES - AFTER REPLACING 4 BATTERIES - CHECK ENGINE LIGHT CAME ON - DEALER DID PRESSURE CHECK AND ENGINE HAD TO BE REPLACED!  AFTER REPLACEMENT, BATTERY WAS AGAIN DEAD.  THEY CANNOT FIND REASON FOR DRAINED BATTERY.  THIS VEHICLE IS UNSAFE AND POTENTIALLY A FIRE HAZARD.  I CANNOT GET RELIEF FROM FORD MOTOR - REFUSED TO BUY BACK.  VEHICLE WAS PARKED EVERY TIME BATTERY WAS DRAINED.",
        "vin": "2FMPK3G92JB"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/20/2020",
        "dateOfIncident": "07/19/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340373,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SUN ROOF GLASS CRACKED SPONTANEOUSLY. THE VEHICLE WAS STATIONARY.",
        "vin": "2FMPK3K99JB"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": true,
        "dateComplaintFiled": "07/14/2020",
        "dateOfIncident": "06/16/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339334,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST THE CAR STARTED TREMBLING WHEN TURNING ON AND LOOSING POWER , IT CONTINUES TO GET WORSE , CHECK ENGINE LIGHT CAME ON I TOOK IT TO GET CHECKED AND IT WAS OFF. THEN EVENTUALLY IT CAME ON FLASHING, I LEFT IT IN PLACE TO GET CHECKED . THE MECHANIC TOLD ME IT WAS NOT WORTH IT TO FIX IT , IT WAS DAMAGED BEYOND REPAIRABLE . I'M NOT EXACTLY SURE WHAT HAPPENED BUT I HAVE THE REPORT .",
        "vin": "2FMPK3K93JB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/24/2020",
        "dateOfIncident": "05/20/2020",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325704,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DEAD BATTERY NUMEROUS TIMES IN THE 1 1/2 YEARS OWNED, THE FIRST AFTER 3 DAYS AND DEALER PICKED UP, SAID OKAY---HAS HAPPENED MANY TIMES SINCE.  ON MAY 20, 2020, RETURNING FROM A TRIP, DASH LIGHTS WENT OFF AND ON SEVERAL TIMES AND SMOKE CAME OUT FROM UNDER HOOD.  SUV IS AT DEALER NOW, SO DO NOT KNOW WHAT THEY WILL SAY.  IN MOTION ON A  RURAL ROAD 2 MILES FROM HOME.  *TR",
        "vin": "2FMPK3J83JB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/11/2020",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317590,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 FORD EDGE- IT SOUNDED LIKE A BOMB EXPLODED AND THE WHOLE SUNROOF SHATTERED  I ASKED FOR HELP FROM THE DEALER DCH FORD IN THOUSAND OAKS AND THEY SENT IT TO FORD AND FORD SAID THAT IT IS NOT WARRANTIED. I SEE MANY OTHER COMPLAINTS ON THIS TOPIC SO I WISH WE ALL COULD GET SOME HELP.",
        "vin": "2FMPK3J97JB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/09/2020",
        "dateOfIncident": "03/09/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317037,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE ENGINE LIGHT CAME ON AND THERE WAS A COOLANT LEAK. NO LIGHT WARNING THAT COOLANT WAS LOW EVER CAME ON FOR THE VEHICLE, THE CAR TURNED THE MOTOR OFF WHILE DRIVING DOWN THE INTERSTATE.  FORD DEALERSHIP REPORTS THAT THERE IS A TECHNICAL SERVICE BULLETIN FOR THIS COMPLAINT THAT RECOMMENDS THE ENGINE BE REPLACED. THE VEHICLE HAS LESS THAN 65,000 MILES AND SHOULD NOT NEED SUCH EXTENSIVE REPAIRS AS AN ENTIRE ENGINE REPLACEMENT. IF THERE IS A TECHNICAL SERVICE BULLETIN FOR THIS PROBLEM, THEN IT APPEARS THAT THIS PROBLEM IS KNOWN BY FORD AND THEY ARE NOT ADDRESSING IT PROPERLY, BECAUSE THE VEHICLE IS ONLY 3,000 MILES PAST THE POWERTRAIN WARRANTY. THIS IS NOT A SAFETY ISSUE OR A RECALL AND IT SHOULD BE.",
        "vin": "2FMPK4K90JB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/28/2020",
        "dateOfIncident": "02/20/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11312063,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE HAS FAILED TWICE, AT 42000 MILES AND THEN AGAIN AT 46000, THIS IS ON THE 2.0L FOUR, FIRST LEAK DOWN ON CYLINDER #4, THEN ON CYLINDER #2.",
        "vin": "2FMPK4K94JB"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/01/2020",
        "dateOfIncident": "02/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306486,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT WAS ON IN THE CAR. SEAT BELT LIGHT FOR DRIVER'S SEAT DOESN'T ALWAYS TURN ON NOR DOES IT ALARM EVEN WHEN THE SEAT BELT IN BUCKLED OR UNBUCKLED OR IF THE VEHICLE WAS STOPPED OR IN MOTION. TOOK VEHICLE IN FOR SERVICE, INITIALLY WAS TOLD THERE MAY HAVE BEEN RODENT DAMAGE AND THAT WOULDN'T BE COVERED BY WARRANTY BUT THEY WOULD CHECK IT OUT. WHEN I RETURNED, I WAS TOLD EMPTY WATER BOTTLES UNDER THE PASSENGER SEAT MAY HAVE MOVED A WIRE. SERVICE PEOPLE STATED THAT THE WIRE MAY STILL BE DISLODGED, THEY DIDN'T CHECK THAT. DEALERSHIP (SHEEHY FORD IN GAITHERSBURG, MD) STATED THAT IT WAS MOST LIKELY DUE TO WATER BOTTLES, THEREFORE THEY DIDN'T CHECK TO SEE IF THE WIRE WAS FULLY CONNECTED OR NOT.     I FEEL MY CLAIM WAS DISMISSED BY THE SERVICE CENTER AND IT SEEMS LIKE A SAFETY CONCERN. I AM NOT CONFIDENT THE ISSUE HAS BEEN FIXED. 4 EMPTY WATER BOTTLES THAT SLIDE EASILY UNDER THE SEAT SHOULD NOT DISLODGE A WIRE. ADDITIONALLY, THE DEALER VOIDED THE TICKET AND DIDN'T SUBMIT MY CLAIM TO WARRANTY. I AM STILL CONCERNED ABOUT THE SAFETY OF MY VEHICLE SHOULD I BE INVOLVED IN A CRASH. THEY DID NOT ADDRESS MY SEAT BELT CONCERNS FOR THE DRIVER'S SEAT.",
        "vin": "2FMPK4K89JB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/23/2020",
        "dateOfIncident": "12/27/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301506,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS IN MOTION ON A PAVED STATE OF NEBRASKA HIGHWAY.  I HEARD A LOAD POP, DID NOT SEE ANYTHING IN ROAD OR FEEL THAT THE CAR HIT ANY KIND OF ROAD HAZARD.  WAS TWO MILES FROM HOME, NO WARNING LIGHT CAME ON.  WHEN PARKED I DID SMELL GAS BUT COULD NOT DETERMINE WHERE IT WAS COMING FROM BECAUSE THERE WAS A LIGHT RAIN.  IN THE MORNING ALL FUEL HAD DRAINED OUT ON THE GROUND AND DOWN THE STREET.  HAD IT TOWED TO SHOP, THEY FOUND A HOLE IN THE GAS TANK AND DETERMINED IT WAS A ROAD HAZARD COLLISION.  FORD SEEMS UNABLE TO PROVIDE A REPLACEMENT TANK AND IT APPEARS IT WILL LIKELY BE MONTHS BEFORE THEY CAN GET ONE IN.  JUST CONCERNED THAT THIS TANK MAYBE PRONE TO HOLES CAUSED BY PERHAPS JUST A ROCK BEING THROWN UP UNDER THE TANK.  THIS COULD HAVE BEEN A VERY BAD SITUATION AS I AM A SMOKER AND OFTEN SIT IN MY CAR AND HAVE ONE BEFORE GOING IN THE HOUSE.  I AM ALSO CONCERNED THAT FORD CAN'T PROVIDE A REPLACEMENT TANK, AND SEVERAL PLACES I HAVE CHECK SAY THE TANK FOR THIS CAR HAS BEEN DISCONTINUED.  POSSIBLE PROBLEM WITH THE EXISTING TANK THAT THEY ARE NOT DISCLOSING.  WHY SHOULD IT TAKE 3 MONTHS TO GET A REPLACEMENT GAS TANK?",
        "vin": "2FMPK4K91JB"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/15/2020",
        "dateOfIncident": "11/18/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299577,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE POWERTRAIN EQUIPMENT FAILURE AT 34K MILES CONSISTENT WITH NHTSA CAMPAIGN # 18V390000 AND FORD RECALL 17S16.  NO ACCIDENTS OR INJURY RESULTING FROM THE FAILURE.  REQUIRED REPLACEMENT OF ENGINE AND TRANSMISSION COMPONENTS INCLUDING THE TORQUE CONVERTER.  REPAIRS TOOK ALMOST SIX WEEKS TO COMPLETE DUE TO PARTS AVAILABILITY.",
        "vin": "2FMPK3K92JB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/09/2020",
        "dateOfIncident": "08/08/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298279,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AT VARIOUS TIMES PARKED, THE BATTERY GOES DEAD.",
        "vin": "2FMPK3G96JB"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/06/2020",
        "dateOfIncident": "01/06/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297528,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE MOONROOF IN THE FORD EDGE WILL EXPLODE WHEN DRIVING MORE THAN 65MPH DOWN THE HIGHWAY. I HAVE ONLY HAD THIS CAR FOR 6 MONTHS AND MY ROOF EXPLODED ON ME ON THE WAY HOME AND OF COURSE IT'S NOT COVERED UNDER ANY WARRANTY. I CAN'T IMAGINE IF THERE WAS KIDS IN THE CAR AND THE MOONROOF WAS OPEN. I'M NOT THE FIRST PERSON THIS HAS HAPPEN TOO. THIS ROOF NEEDS TO BE RECALLED.",
        "vin": "2FMPK4AP9JB"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/03/2020",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11296879,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 FORD EDGE. THE CONTACT STATED THAT THE HEADLIGHTS DID NOT ILLUMINATE PROPERLY WHEN DRIVING AT NIGHT. STERNBERG FORD (600 SOUTH WASHINGTON STREET, DALE, IN 47523, 888-263-7958) TEST DROVE THE VEHICLE AND STATED THAT THE HEADLIGHTS WERE DESIGNED IN THAT MANNER AND THE REPAIRS WERE NOT COVERED UNDER WARRANTY. THE CONTACT REPLACED THE HEADLIGHTS HIMSELF; HOWEVER, THE NEW HEADLIGHTS WERE STILL NOT PROJECTING COMPLETELY. THE MANUFACTURER WAS NOT CONTACTED. THE DEALER WAS CONTACTED AGAIN AND STATED THAT THEY COULD NOT ASSIST. THE FAILURE MILEAGE WAS 10.",
        "vin": "2FMPK4J93JB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/01/2020",
        "dateOfIncident": "11/10/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11292442,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WILL RANDOMLY SHUT DOWN WHILE I AM DRIVING. IT HAS HAPPENED DRIVING IN THE CITY I LIVE IN AND ALSO ON THE HIGHWAY GOING 75 MPH. I HAVE TO PULL OVER AND RESTART THE VEHICLE. THIS STARTED IN NOVEMBER 2018 AND STILL HAPPENS. I HAVE HAD IT LOOKED AT BY THE DEALERSHIP AND FORD HAS SENT FIELD SERVICE ENGINEERS THAT HAVE NOT BEEN ABLE TO FIND A TROUBLE CODE THAT IS HAPPENING. IT HAS BEEN LOOKED AT BY 2 DIFFERENT ENGINEERS  DUE TO THE BBB COMPLAINT THAT WAS FILED. THE CAR IS A LEMON ACCORDING TO TEXAS LEMON LAW BUT FORD WILL NOT RECOGNIZE THE PROBLEM SINCE THEY CANNOT FORCE AND INTERMITTENT PROBLEM TO PRESENT ITSELF. THIS IS DEFINITELY A SAFETY HAZARD AS THE CAR HAS STOPPED IN TRAFFIC AS WELL. WHEN IT HAPPENS, THERE IS NOTHING THAT COMES UP, THE DASH JUST GOES BLANK AND THE ENGINE STOPS.",
        "vin": "2FMPK3G9XJB"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "12/23/2019",
        "dateOfIncident": "12/22/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11290874,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD MY HEATED SEATS ON FOR A TRIP TO MY MOTHER'S. WE STOPPED EVERY 2 TO 3 HOURS FOR GAS AND BREAKS. 12 HOURS INTO THE 14 HOUR TRIP I STARTED FEELING PAIN ON THE BACK OF MY LEGS. I CHECKED ON OUR NEXT BREAK AND SAW BLISTERS FORMING ON THE BACKS OF MY LEGS. BY THE TIME I HAD ARRIVED MOST OF THE BLISTERS HAD POPPED. CAR WAS IN MOTION.",
        "vin": "2FMPK3J9XJB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/20/2019",
        "dateOfIncident": "08/08/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281353,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HATCHBACK SLAMS. I'VE RETURNED THE VEHICLE SEVERAL TIME AND TOLD IT'S NORMAL.",
        "vin": "2FMPK3K90JB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/19/2019",
        "dateOfIncident": "11/14/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281008,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 FORD EDGE. THE CONTACT STATED THAT THE VEHICLE FAILED TO START AFTER SEVERAL ATTEMPTS. THE VEHICLE WAS TOWED TO JERRY'S FORD ALEXANDRIA (6510 LITTLE RIVER TURNPIKE, ALEXANDRIA, VA 22312, (703) 256-5000) WHERE IT WAS DIAGNOSED THAT THE ENGINE NEEDED TO BE REPLACED.AND NOT THE ALTERNATOR. THE VEHICLE WAS NOT REPAIRED, BUT THE FAILURE RECURRED. THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 18V548000 (ELECTRICAL SYSTEM). THE MANUFACTURER WAS NOT CONTACTED. THE CONTACT STATED THAT THE FAILURE WAS INTERMITTENT. THE APPROXIMATE FAILURE MILEAGE WAS 60,000. *DT*DT  CONSUMER STATED ACCORDING TO MECHANIC SHE HAD A DEFECTIVE HEAD GASKET AND/OR DEFECTIVE WATER PUMP WHICH CAUSED COOLANT TO LEAK TO THE ENGINE.*JB",
        "vin": "2FMPK4J94JB"
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "10/30/2019",
        "dateOfIncident": "07/29/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11277035,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE MAKING A LEFT ONTO A VIADUCT THE BALL JOINT SEPARATED CAUSING THE VEHICLE TO CONTINUE TO TURN (SHARPLY) INTO THE BARRIER WALL.",
        "vin": "2FMPK4J87JB"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/22/2019",
        "dateOfIncident": "10/12/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270285,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 FORD EDGE. THE CONTACT STATED THAT THE LOW BEAM HEADLIGHTS WERE NOT BRIGHT ENOUGH, WHICH MADE IT DIFFICULT TO DRIVE IN THE DARK. THE CONTACT CALLED RUSSELL & SMITH FORD AT 713-230-8368 (LOCATED AT 3440 S. LOOP W., HOUSTON, TX 77025) AND WAS INFORMED TO BRING THE VEHICLE TO THEIR FACILITY. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT TO CALL THE DEALER. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 42,400.",
        "vin": "2FMPK3J96JB"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/05/2019",
        "dateOfIncident": "10/04/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266490,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR WINDOW SHATTERED WITHOUT WARNING AS VEHICLE WAS IN MOTION. SPEED WAS LESS THAN 15 MPH WHILE EXITING A PARKING LOT, APPROACHING STOP SIGN. WINDOW GLASS RAINED INTO VEHICLE IN SMALL PIECES. VEHICLE HAD ONLY 22,000 MILES WITH EXTENDED WARRANTY. FORD REFUSED TO COVER REPAIR. ATTACHED PHOTOS SHOW EXTENT OF GLASS LOSS AND SIZE OF PIECES.",
        "vin": "2FMPK4AP2JB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/23/2019",
        "dateOfIncident": "08/22/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246076,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES ARE TOO SENSITIVE (GRABBING) AT LOW SPEED, ESPECIALLY AFTER SITTING OVERNIGHT.  A VERY SLIGHT TOUCH OF THE BRAKE PEDAL WILL CAUSE THE CAR TO IMMEDIATELY STOP AND ANYONE IN THE CAR WILL SLIDE FORWARD IN THEIR SEAT IF NOT OUT OF THE SEAT.  THIS IS A PROBLEM WITH BOTH MYSELF AND MY WIFE DRIVING THE CAR.  IF I DRIVE THE CAR AND STOMP ON THE BRAKES A FEW TIMES IT SEEMS TO GET A LITTLE BETTER.  BUT IT IS A SAFETY ISSUE FOR PEOPLE INSIDE THE CAR AND IF A CAR IS FOLLOWING CLOSELY DUE TO THE ABRUPT UNCONTROLLABLE STOP.",
        "vin": "2FMPK3K84JB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/05/2019",
        "dateOfIncident": "07/25/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241688,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JULY 25TH 2019 I WAS LEAVING I40/I85WHEN I HEARD THE LOUDEST EXPLOSION. ON INSPECTION MY BACK, DRIVERS SIDE PASSENGER WIDOW HAD BLOWN OUT. THE POLICE CM AND CHECKED MY CAR AND NO PROJECTILE WAS FOUND. MY PAINTWORK ON THAT DOOR IS ALL DAMAGED WHERE THE GLASS FLEW OUT. LUCKILY NOBODY WAS IN THAT SEAT.   I TOOK IT TO THE DEALER AS ITS UNDER WARRANTY AND HE AGREED WITH ME AND SAID HE HAD SEEN THIS HAPPEN BEFORE.  FORD WILL NOT ENTERTAIN THAT THE GLASS WAS FAULTY AND HAVE SAID NO TO MY REPAIR.  IF YOU POST PROBLEMS IN THE FORD FACEBOOK PAGE THEY CONSTANTLY DELET THEM TO HIDE ANY ISSUES FROM OTHERS.  THERE SEEMS TO BE OTHERS ON FORUMS WITH THIS CAR AND OTHERS FROM FORD 'S WITH FACTORY TINTED GLASS HAVING BLOW OUT ISSUES.  IF THE THIS HAD HAPPENED IN MY DOOR I WOULD HAVE LOST CONTROL OF MY CAR.  THIS NEED LOOKING INTO.",
        "vin": "2FMPK4AP9JB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/28/2019",
        "dateOfIncident": "07/12/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240153,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JULY 12, 2019 I WAS DRIVING MY 2018 FORD EDGE THAT I PURCHASED ON SEPTEMBER 3, 2018, 75 MPH ON THE INTERSTATE AND MY PANORAMIC SUNROOF EXPLODED. THERE WERE THREE ADULTS IN THE CAR AND FORTUNATELY, NO ONE WAS INJURED, BUT WERE SHOWERED WITH PIECES AND SHARDS OF GLASS, ESPECIALLY THE PASSENGER IN THE BACK SEAT. THROUGH CONVERSATIONS WHILE RECALLING THE INCIDENT AMONGST THE THREE OF US, THERE WAS A LOUD POP AND THEN IT SHATTERED.  TO OUR BEST KNOWLEDGE, NOTHING HIT THE SUNROOF. I HAD TO HAVE MY VEHICLE TOWED AS THERE WAS SO MUCH GLASS THAT IT WAS NOT SAFE TO DRIVE. THE FIRST DEALERSHIP TOLD ME THAT DUE TO SCRATCH ON SUNROOF AND THE AIR CONDITIONER BEING ON, THIS CAUSED CABIN PRESSURE AND ULTIMATELY THE EXPLOSION OF THE SUNROOF. WE DID HAVE IT TOWED TO OUR DEALERSHIP AND THEY SAY SOMETHING HIT IT TO MAKE IT SHATTER. BOTH DEALERSHIPS TOLD ME THAT IT IS NOT COVERED UNDER MY WARRANTY SO I DID TURN IT IN TO MY INSURANCE. I FIND IT IRONIC THAT THEY HAD DIFFERING CONCLUSIONS. NEEDLESS TO SAY, THIS HAS BEEN AN UNFORTUNATE LEARNING LESSON. AS OF NOW, I DO NOT HAVE MY VEHICLE BACK, 16 DAYS LATER. I HAVE EXPRESSED MY DISAPPOINTMENT WITH MY DEALERSHIP AND WILL ALSO FILE A COMPLAINT WITH FORD, BUT KNOW NOTHING WILL HAPPEN. I APPRECIATE THAT I AM ABLE TO FILE THIS COMPLAINT AND HOPE THAT ANY OTHERS THAT THIS HAPPENS TO WILL DO THEIR RESEARCH AND KNOW THAT IN ORDER FOR A CHANGE, A REPORT TO YOU NEEDS TO HAPPEN.",
        "vin": "2FMPK4K96JB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/11/2019",
        "dateOfIncident": "07/08/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231189,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEM WITH TRANSMISSION HAS BEEN CHANGE FEW MONTHS AGO  SUV CONTINUE SHOT DOWN BATTERY DRAIN CHANGE TWICE.I  WAS TOLD BY FORD MECHANICS  SIX SENSES TRUCKING SYSTEM DRAINS BATTERY TRUCKING SYSTEM NEEDS TO BE DISCONNECTED MAY BE WILL FIX SHOT DOWN PROBLEM",
        "vin": "2FMPK3J93JB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/10/2019",
        "dateOfIncident": "07/03/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230766,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 FORD EDGE WITH 25,000 MILES, TOOK IT TO THE DEALER WITH A CHECK ENGINE LIGHT AND THE SERVICE DEPT TOLD ME THE ENGINE IS DEFECTIVE AND WILL NEED TO BE REPLACED.",
        "vin": "2FMPK4J93JB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/05/2019",
        "dateOfIncident": "06/28/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229672,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELLING IN THE LEFT LANE, OF A THREE LANE HIGHWAY, NEXT TO A SEMI-TRACTOR TRAILER, THE TRUCK CHANGED LANES INTO MY LANE.  I WAS FULLY IN THE LANE WHEN HE SIGNALED A CHANGE AND BEGAN TO MOVE OVER.  I ACTIVATED THE VEHICLE HORN AND BRAKED HARD BUT, IT WAS APPARENT THAT HE NEVER HEARD THE HORN AS THE OPERATOR CONTINUED INTO MY LANE.  THIS HAS HAPPENED TWICE IN THE LAST YEAR.  (SAME SCENARIO)  (THE VEHICLE HORN IS ABOUT AS LOUD AS A 1965 VW BEETLE.)  I BROUGHT THIS FORD EDGE TO SUNNY SIDE MOTORS, HOLDEN, MA.  I WAS INFORMED, AND PROVIDED A FORD COMPUTER PRINTOUT THAT THIS THAT THIS YEAR 2018 EDGE, HAD ONE OF THE TWO HORNS DELETED BY THE MANUFACTURER.  INSTEAD OF THE TWO, HI/LO HORNS PROVIDED ON THIS AND  ALL OTHER VEHICLES FOR MANY MANY YEARS, MY 2018 EDGE HAS ONLY ONE HORN.  THIIS HORN IS ABSOLUTELY ANEMIC AND CAN NOT BE HEARD IN TRAFFIC AND I BELIEVE THIS IS AN UNACCEPTABLE, SERIOUS SAFETY HAZARD.  HAD IT NOT BEEN FOR MY SKILLED EMERGENCY EVASIVE MANEUVERS, THERE SURELY COULD HAVE HAD DISASTROUS RESULTS. ( I HAVE HAD MANY YEARS TRAINING IN EMERGENCY VEHICLE OPERATION.)    THIS IS A SERIOUS SAFETY HAZARD!!!!!",
        "vin": "2FMPK4K99JB"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": true,
        "dateComplaintFiled": "06/05/2019",
        "dateOfIncident": "06/04/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217993,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING UNDER NORMAL CONDITIONS AT 30 MPH THE BALL JOINT SEPARATED FROM THE WHEEL CAUSING THE WHEEL TO TURN FREELY. THE VEHICLE VIOLENTLY TURNED TO THE RIGHT UNTIL IT STOPPED.",
        "vin": "2FMPK3K98JB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/04/2019",
        "dateOfIncident": "05/24/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11217962,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CPSC:  I OWN A 2018 FORD EDGE THAT HAS A HANDS FREE LIFT GATE. WHILE THE GATE IS OPEN AND I AM LOADING OR REMOVING  CARGO FROM THE CARGO AREA, THE LIFT GATE CLOSES ON ITS OWN. THE FIRST IT CLOSED I BACKED QUICKLY BUT DID NOT LOWER  MY QUICK ENOUGH FROM BANGING IT REAL HARD WHICH LUCKILY ONLY RESULTED IN A LUMP ON THE BACK OF MY HEAD. *DT    THE CONSUMER STATED THE VEHICLE WAS REPAIRED BUT, THE FAILURE PERSISTED. THE DEALER WAS UNAWARE OF HOW TO REPAIR THE VEHICLE.*JS",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "05/28/2019",
        "dateOfIncident": "05/13/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11210425,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ON A 2 1/2 HR TRIP ON THE HIGHWAY, THE HEATER IN THE DRIVER'S SEAT GOT SO HOT I HAVE SECOND DEGREE BURNS ON MY UPPER LEG AND BUTTOCK. SO FAR, IT HAS REQUIRED TO VISITS TO MY DOCTOR FOR TREATMENT. THE MANAGER AT THE DEALER WHERE I PURCHASED THE VEHICLE TELLS ME HE HAS NEVER HEARD OF A HEATER GETTING THAT HOT, AND DOES NOT BELIEVE THAT IS HOW I WAS BURNED. THEY SAID THEY CAN'T FIND ANYTHING WRONG WITH IT AND THEY WILL NOT DO ANYTHING TO ENSURE IT DOES NOT HAPPEN AGAIN.",
        "vin": "2FMPK3J88JB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/25/2019",
        "dateOfIncident": "03/14/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11209954,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS OF TRANSMISSION POWER, LIKE AS IF THE TRANSMISSION CANT DECIDE WHICH GEAR TO BE IN, THEN WHEN IT SELECTS THE GEAR IT SLAMS INTO GEAR SO HARD THAT IT FEELS LIKE YOU HAVE BEEN HIT FROM BEHIND BY A TRUCK. THIS HAS HAPPENED WHILE DRIVING IN STOP AND GO TRAFFIC, WHEN DRIVING THRU A DIP IN THE ROAD,AND MOST DISTURBINGLY WHILE DRIVING UP A LONG STEEP HILL.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/17/2019",
        "dateOfIncident": "05/11/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208222,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SIDE DOOR IS SPLITTING AT THE DOOR CHECK.  AFTER INVESTIGATING, THE DOOR STOP DOES NOT HIT THE STOP WHEN THE DOOR IS IN THE OPEN POSITION AND IT PUTS PRESSURE ON THE DOOR CHECK FATIGUING THE METAL.  A CLAIM WAS FILED WITH FORD MOTOR COMPANY BUT THEY ARE DENYING THE CLAIM.  THE CONTINUED FATIGUE ON THE DOOR CHECK WILL EVENTUALLY CAUSE IT TO FAIL.",
        "vin": "2FMPK4J98JB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/17/2019",
        "dateOfIncident": "12/03/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208228,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "IN DECEMBER 2018 WE NOTICED THE DRIVER SIDE DOOR SPLITTING AT THE DOOR CHECK.  IT WAS TAKEN TO A DEALER WHO NOTED THE PASSENGER SIDE DOOR WAS DOING THE SAME THING.  THEY CAME BACK 2 MONTHS LATER AND SAID IT WAS CUSTOMER ABUSE.  IT WAS THEN TAKEN TO A LOCAL MECHANIC WHO FOUND THE DOOR STOP WAS NOT HITTING THE STOP BEFORE PUTTING PRESSURE ON THE DOOR CHECK.  A CLAIM WAS FILED WITH FORD MOTOR COMPANY AND THE VEHICLE WAS TAKEN TO A DIFFERENT DEALER THAT SAID FORD WILL NOT COVER THE FAILURE.  WHEN THE DOORS ARE FULLY OPENED, THE DOOR STOP IS NOT HITTING THE STOP CAUSING THE DOOR CHECK TO PULL ON THE METAL AND FATIGUING IT.  CRACKS HAVE DEVELOPED ON BOTH FRONT DOORS.  WE HAVE HAD THE CRACKS WELDED MULTIPLE TIMES BUT THE STRESS CREATES NEW CRACKS IN NEW LOCATIONS AROUND THE DOOR CHECKS.  EVENTUALLY THIS WILL LEAD TO DOOR FAILURE.",
        "vin": "2FMPK4J84JB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "04/23/2019",
        "dateOfIncident": "04/21/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203291,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER DOOR OPENED UP AND THE VEHICLE SHUT DOWN COMPLETELY.  I LET HERTZ KNOW THAT THERE IS A RECALL ON THE VEHICLE AND THEY SAID THERE ISN'T BUT I CLEARLY SEE THAT THERE IS",
        "vin": "2FMPK3J99JB"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/20/2019",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11202708,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS ARE TOO DIM. THE SAFETY OF MY FAMILY IS MY MAIN CONCERN WITH THIS COMPLAINT. WE LIVE IN AN AREA WHERE THERE ARE MANY ANIMALS THAT CAN AND ARE OUT ON THE ROAD. I HAVE TO BE ABLE TO SEE BETTER DURING THE NIGHT TIME HOURS. THE NORMAL HEADLIGHTS FEEL AS IF THEY DAYLIGHTS ARE ON. THE HIGH BEAMS ARE EVEN TOO DIM. I FEEL LIKE THE HIGH BEAMS ARE THE BRIGHTNESS THAT THE NORMAL LIGHTS SHOULD BE.",
        "vin": "2FMPK4J96JB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/01/2019",
        "dateOfIncident": "02/22/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183416,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN AT HIGHWAY SPEEDS AND TRY TO SPEED UP TO CHANGE LANES STEP ON GAS  PEDAL    AND NOTHING HAPPENS CAR JUST SLOWS DOWN TILL I LET OFF  THE GAS PEDAL",
        "vin": "2FMPK4J80JB"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/22/2019",
        "dateOfIncident": "02/22/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182034,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS DON'T SHINE ON THE ROAD VERY WELL. THERE NO ADJUSTMENT SCREWS TO CORRECT.",
        "vin": "2FMPK4J94JB"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/19/2019",
        "dateOfIncident": "02/17/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181141,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 FORD EDGE. WHILE DRIVING APPROXIMATELY 65 MPH, THE SUN ROOF EXPLODED AND GLASS SHATTERED. THERE WERE NO INJURIES. THE VEHICLE WAS TAKEN TO PERRY FORD LINCOLN OF SAN LUIS (844-519-2241, LOCATED AT 12200 LOS OSOS VALLEY RD, SAN LUIS OBISPO, CA 93405) WHERE IT WAS STATED THAT THERE WAS NO RECALL. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THE FAILURE WAS NOT COVERED UNDER WARRANTY. THE INSURANCE COMPANY WOULD COVER THE REPAIRS. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 3,200. THE VIN WAS NOT PROVIDED.",
        "vin": ""
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "02/05/2019",
        "dateOfIncident": "01/27/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11174641,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED MY FORD EDGE USED FROM FORD DEALER 12/29/2018 WITH 3400 MILES ON IT. IN JANUARY 2019 I WAS DRIVING THRU AN INTERSECTION AND A  LADY IN A MINI VAN RAN A RED LIGHT DOING APPROX 35 MPH OR MORE, SHE DID NOT HIT THE BREAKS. SHE HIT MY DRIVERS DRIVERS DOOR AND FRONT DRIVERS FENDER OF MY EDGE WHICH SEPEREATED THE FRONT WHEEL AND SUSPENSION FROM MY CAR, CRUSHED THE DRIVERS DOOR AND EVEN BROKE THE EXHAUST SYSTEM SUPPORTS AMOUNG OTHER THINGS . THE INSURANCE LABELED MY CAR A TOTAL LOSS. I RECEIVED 7 STITCHES, HEAD INJURY AND CONCUSSION. WHY DIDN'T MY AIR BAGS DEPLOY. I HAVE BEEN THINKING A LOT ABOUT THIS THE LAST FEW WEEKS AND IT DOES NOT SEEM RIGHT. HOW CAN A CAR BE TOTALED AT SUCH A HIGH SIDE IMPACT SPEED AND THE SIDE BAG NOT BE SET OFF?",
        "vin": "2FMPK3G95JB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/17/2019",
        "dateOfIncident": "10/04/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170603,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY GOES DEAD EVERY 1,500 MILES-------------THIRD BATTERY IN CAR. FORD TECHINICIAN SAYS THEY CANNOT FIND ANYTHING UNUSUAL IN THE ELECTRICAL SYSTEM TO WOULD CAUSE THIS. THIRD BATTERY NOW IN AUTO HAS TROUBLE STARTING IN COLD WEATHER CONDITIONS----STARTER TURNS OVER VERY SLOWLY DURING INITIAL START OF THE DAY",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/19/2018",
        "dateOfIncident": "11/30/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162454,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST PURCHASED A NEW 2018 FORD EDGE. THE LOW BEAM HEADLIGHTS ARE SO DIM WITH NIGHT DRIVING, THEY ARE UNSAFE. SHOWS BARELY ENOUGH LIGHT ( NO BRIGHTER THAN A STREET LIGHT). YOU CAN BARELY FOLLOW THE CENTER LINE. AFTER 100 YEARS IN BUSINESS, YOU WOULD THINK THIS IS SOMETHING THAT I WOULD NOT HAVE TO WORRY ABOUT WHEN PURCHASING A NEW VEHICLE. I THINK THE LOW BEAM LIGHTING SHOULD BE REPLACED WHAT A BRIGHTER LED LIGHTING. I'M CONCERNED WITH MY SAFETY AND MY FAMILY SAFETY. I CAN NOT SEE HOW HIS WAS OVERLOOKED BY THE PEOPLE IN CHARGE OF MAKING SURE A CAR IS SAFE TO DRIVE IN ALL CONDITIONS.",
        "vin": "2FMPK4G96JB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/10/2018",
        "dateOfIncident": "12/08/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11157314,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A MAJOR INTERSTATE AT APPROX. 70MPH THE PANORAMIC MOON ROOF SUDDENLY SHATTERED. PIECES OF GLASS ENTERED THE PASSENGER COMPARTMENT THROUGHOUT THE FRONT AND BACK SEATS.",
        "vin": "2FMPK4J91JB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/28/2018",
        "dateOfIncident": "09/28/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154489,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AT RANDOM TIMES (NO CONSISTENCY) AS WE ARE DRIVING OR AT INITIAL START UP, THE INSTRUMENT CLUSTER WILL BLACK OUT WITH NO COMMUNICATION ALONG WITH AN OCCASION \"TRANSMISSION NOT IN PARK\" MESSAGE THAT APPEARS. RADIO IS LOST AS WELL. I HAVE RETURNED TO THE DEALER FOR WARRANTY REPAIR FOR THE 4TH TIME IN LESS THAN 2 MONTHS WITH NO RESOLUTION. INITIAL REPAIR WAS A LOOSE WIRE, SAME ISSUE APPEARED LESS THAN A WEEK LATER. 2ND REPAIR THE DEALER \"FLASHED\" THE BCM. SAME ISSUE APPEARED THE NEXT DAY. THIRD REPAIR, THE BCM WAS REPLACED. LESS THAN 2 DAYS LATER, SAME ISSUE APPEARED. IT IS CURRENTLY AT THE DEALER AGAIN AND I WAS TOLD THAT FORD ENGINEERING NOW HAS TO GET INVOLVED AS THEY HAVE NO SOLUTION TO THIS ISSUE.",
        "vin": "2FMPK3G91JB"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/07/2018",
        "dateOfIncident": "11/07/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11149889,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEAD LIGHTS ARE ALWAYS ON A DIM MODE. I HAVE CALLED THE DEALER AND THEY HAVE SAID THAT'S AS BRIGHT AS THE LIGHT GET. I ALSO LOOKED UP IF OTHER OWNERS AND DRIVERS ARE HAVING TROUBLE WITH THEIR HEAD LIGHTS. IT IS VERY DANGEROUS TO DRIVE AT NIGHT BECAUSE YOU CAN'T SEE EITHER SIDE OF THE ROAD. I HAVE ASKED MY DEAL WHAT IT WOULD COST TO HAVE BRIGHTER BULBS PUT IN. THEY TOLD ME THAT FORD DOESN'T HAVE BRIGHTER BULBS. I WAS TOLD THAT IT WAS GOING TO COST ME $399.00 TO HAVE THEM BUY OUTSIDE OF FORD AND HAVE THEM PUT THEM IN FOR ME . PLEASE LOOK INTO THIS AS IT SEEMS TO BE A ISSUE FOR A FEW YEARS. THANK YOU I LOOK FORWARD TO HEARING FROM YOU. [XXX] CELLPHONE NUMBER [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "2FMPK4K96JB"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/30/2018",
        "dateOfIncident": "02/13/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144120,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "YOU CAN NOT EASILY BUCKLE AND UNBUCKLE SEAT BELTS IN THE BACK SEAT    I HAD FORD DEALER ATTEMPT TO FIX SEVERAL TIMES WITH NO LUCK.",
        "vin": "2FMPK4K87JB"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/28/2018",
        "dateOfIncident": "10/27/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11143504,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING ANY HEAVY RAIN WITH THE WINDSHIELD WIPERS ON FULL, THERE'RE NOT FAST ENOUGH TO GIVE YOUR CLEAR VISIBILITY, MAKING DRIVING IN THE RAIN VERY DANGEROUS. MY OTHERS FORD CARS DO NOT HAVE THIS PROBLEM. WHEN THE WIPERS ARE SET TO FULL SETTING THEY ARE MUCH FASTER THAN ON THE FORD EDGE. I SEE THIS AS AN SERIOUS. DANGEROUS PROBLEM.",
        "vin": "2FMPK4J86JB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/11/2018",
        "dateOfIncident": "09/22/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139693,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLES SHARK FIN ANTENNA CAME OFF THE CAR DURING A CAR WASH.  THIS ANTENNA IS NOT REMOVABLE.  AFTER THE CAR WASH WAS COMPLETE, THE BLOWERS TURN ON TO DRY THE CAR. I WAS LOOKING THE REARVIEW MIRROR AND HAPPENED TO SEE SOMETHING FLY OFF MY CAR. I PULL OUT CAR WASH AND LOOK AT THE TOP OF MY CAR AND SEE THAT THE SHARK FIN IS MISSING FROM THE ANTENNA.  I RETRACED MY PATH THROUGH THE CAR WASH AND FOUND IT ON THE GROUND. I HAD TO DRIVE HOME SLOWLY NOT TO LOSE THE CIRCUIT CARD THAT WAS EXPOSED. I AM GLAD IT WAS NOT RAINING THAT DAY OR THIS WOULD HAVE BEEN A DANGEROUS SITUATION I HAD TO REATTACH MYSELF BECAUSE A CIRCUIT CARD WAS EXPOSED. THERE ARE SIX CONNECTION POINTS INSIDE THE ANTENNA THAT HOLDS IT IN PLACE. I GLUED THE ANTENNA BACK ON AND SEALED WITH ELECTRICAL TAPE TO HOLD IN PLACE. I COULD NOT LEAVE THE ANTENNA SHARK FIN OFF DUE TO THE CIRCUIT CARD EXPOSED.  IF WATER WOULD HAVE GOTTEN TO THE CIRCUIT CARD, IT WOULD CAUSED A SHORT CIRCUIT OR FIRE TO TOP OF MY CAR OR DAMAGE THE RADIO. I AM GLAD THE SHARK FIN BROKE OFF AT THE CAR WASH BECAUSE IF I WAS DRIVING AT NORMAL SPEEDS OR THE HIGHWAY, THIS COULD CAUSED DAMAGE TO RADIO CIRCUITRY AS WELL AS DAMAGE ANOTHER VEHICLE.  FORD DOES NOT WANT TO REPLACE IT.  THIS IS A DEFECT.  I HAD THE VEHICLE, 2015 FORD EDGE, GOING THROUGH CAR WASHES AND THE ANTENNA NEVER CAME OFF.  DO OTHER OWNERS OF 2018 MODEL HAVE TO BE CONCERNED WITH THE ANTENNA BREAKING OFF GOING THROUGH CAR WASHES? I TALKED WITH FORD CUSTOMER RELATIONS AND THEY THINK IT IS MY FAULT SOMEHOW.  HOW DID I KNOW THAT I CANNOT GO THROUGH AUTOMATED TOUCHLESS CAR WASHES DUE TO A DEFECTIVE ANTENNA? FORD SAID IT IS NOT WARRANTABLE.",
        "vin": "2FMPK4K88JB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/09/2018",
        "dateOfIncident": "09/30/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139286,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR JUST DIED 4 MONTHS AFTER PURCHASE; THERE WAS NO LIGHTS OR ANYTHING.  THE BATTERY HAD TO BE CHARGED AND THE DEALER STATED THAT THE VEHICLE HAD TO BE DRIVEN 30 - 45 MINUTES EVERY TIME TO KEEP IT CHARGED.  THIS IS NORMAL?",
        "vin": "2FMPK4G98JB"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "10/03/2018",
        "dateOfIncident": "09/28/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11133068,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TAMARA RECALL:  I REAR ENDED ANOTHER VEHICLE. STEERING WHEEL AIRBAG DID NOT DEPLOY.  CAUSING MY FACE TO HIT STEERING WHEEL. STITCHES INSIDE OF MY MOUTH",
        "vin": "2FMPK3G91JB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/06/2018",
        "dateOfIncident": "07/31/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11127931,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT AXLE, (KNOWN AS THE HALF SHAFT) BLEW OUT ALL THE GREASE IN THE RUBBER BOOT. THE INSIDE FRONT , DRIVER'S SIDE TIRE, SUSPENSION AND BRAKES WERE COVERED WITH GREASE. CAME FROM THE DEALERSHIP LIKE THIS, AUTO HAD 42 MILES AT TIME  THIS WAS NOTICED.",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/24/2018",
        "dateOfIncident": "07/02/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113341,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR SEAT BELTS ARE VERY HARD TO BUCKLE AND EVEN HARDER TO UNBUCKLE.IT WOULD BE HARD TO GET OUT FAST IF THERE WAS AN EMERGENCY",
        "vin": "2FMPK4K87JB"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/19/2018",
        "dateOfIncident": "07/03/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112416,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LOW BEAM HALOGEN HEADLAMPS ARE INADEQUATE.  CAN'T SEE A THING AT NIGHT, IF IT'S RAINING YOU MAY AS WELL PARK THE VEHICLE.  THE LIGHTS MAY BE BRIGHT TO LOOK AT THE CAR, BUT THEY DO NOTHING TO LIGHT UP THE ROADWAY. IF YOU DRIVE UNDER A STREET LAMP, THE HEADLAMP IS  NO LONGER VISIBLE ON THE ROAD. THIS IS THE FIRST CAR I'VE OWNED THAT THE HEAD LIGHT DOES NOT ILLUMINATE THE ROAD MORE THAN A STREET LIGHT. I SEE THEY GET A POOR RATING FROM THE INSURANCE INSTITUTE FOR HIGHWAY SAFETY",
        "vin": "2FMPK3K9XJB"
    },
    {
        "components": "STEERING,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/06/2018",
        "dateOfIncident": "06/06/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11100296,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "LET ME START BY SAYING YOUR SALES TEAM WAS GREAT, MADE THE CAR BUYING PART OF THIS EASY....MAYBE TOO EASY IN THAT I MADE A QUICK DECISION TO BUY WITHOUT RESEARCHING WHAT COMPLAINTS THERE WERE ABOUT THIS VEHICLE. I AM A HOME HEALTH NURSE AND TRADED MY HONDA ACCORD IN TO YOUR DEALERSHIP AS I NEEDED SOMETHING WITH MORE ROOM TO STORE MY WORK SUPPLIES WHILE STILL MAINTAINING DECENT GAS MILEAGE.     I HAVE NEVER BEEN MORE DISAPPOINTED IN A NEW CAR. I WAS SO PLEASED WITH THE SERVICE DURING THE PURCHASE. BUT THIS CAR IS NOT WHAT IT IS CLAIMED TO BE. THEY CLAIM 20-29 MPG, WHICH IS WHY I PURCHASED THIS TO STAY WITHIN A REASONABLE GAS MILEAGE. I AM NOT EVEN GETTING 16 MPG!!!! THE CAR BLOWS WARM AIR ALL THE TIME, UNLESS THE AC IS ON. THE AIR ALSO BLOWS A FAINT MOTOR/GAS SMELL. MY REAR WINDOW SQUEAKS WHEN YOU ROLL IT DOWN. I CAN NOT AFFORD TO BE FILLING UP TWICE A WEEK, ESPECIALLY AFTER THE AMOUNT OF MONEY I PAY A MONTH FOR THE LEASE PAYMENT. THEN TODAY, MY STEERING WHEEL LOCKED AND WONT MOVE UP/DOWN FRONT/BACK!!!    SADLY, I FEEL I SHOULD HAVE LISTENED TO MY HUSBAND AND STAYED AWAY FROM A FORD. I HOPE YOU CAN STEER MY A DIRECTION IN WHICH THIS CAN BE ADDRESSED. I ALREADY HAVE AN APPOINTMENT WITH A FORD DEALERSHIP (WHO HAPPENS TO BE A GOOD FRIEND OF OURS), BUT I'M NOT FEELING TOO CONFIDENT AT THIS POINT.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/05/2018",
        "dateOfIncident": "05/25/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11100043,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LOW BEAM HEADLIGHTS ARE SO WEAK THAT WHEN THE ROAD IS WET AT NIGHT OR WHEN DRIVING NEAR AMBIENT LIGHTING SUCH AS STREET LIGHTS YOU CAN'T SEE ANY MARKINGS ON THE ROAD SUCH AS THE CENTERLINE OF THE ROAD.    THERE IS ALSO EXHAUST FUMES COMING INTO THE CAR WHEN DRIVING WITH THE WINDOWS UP OR SLIGHTLY ROLLED DOWN AND WHEN THE CLIMATE CONTROL SYSTEM IS IN RECIRCULATING MODE.  THESE FUMES MAKE ME DIZZY AND CAUSE ME TO HAVE BLURRY VISION.  I ALMOST COMPLETELY BLACKED OUT TWICE ALREADY AND I OWNED THIS CAR FOR THREE WEEKS.  I DIDN'T KNOW THAT FORD EDGE HAD THESE PROBLEMS AND THE SALESMAN OF COURSE NEVER MENTIONED THEM. THESE PROBLEMS WITH THE EXHAUST HAPPEN WHILE DRIVING SLOWLY UNDER 20 MPH AND AT HIGHER SPEEDS ON THE HIGHWAY WHEN THE RECIRCULATING MODE IS ON WITH OR WITHOUT THE AIR CONDITIONING TURNED ON.  I HAVE DRIVEN WITH THE CLIMATE CONTROL TOTALLY OFF AND STILL THE FUMES COME INSIDE THE CAR. IT'S AS IF THE BODY OF THE CAR IS CREATING A VACUUM THAT PULLS THE EXHAUST BACK INTO THE CAR BECAUSE I CAN HAVE TO CLIMATE SYSTEM OFF AND THE WINDOWS OPEN AND EXHAUST GETS SUCKED IN.    THIS CAR IS S $36,000 DEATH TRAP AND I PAID THE FULL PRICE SO I'M SCREWED.",
        "vin": "2FMPK4J97JB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/16/2018",
        "dateOfIncident": "01/14/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073213,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO WAS NOT PICKING UP LOCAL STATIONS. NEW ANTENNA ASSEMBLY WAS INSTALLED. STILL HAVE WEAK RADIO RECEPTION ON A FEW LOCAL STATIONS.",
        "vin": "2FMPK4G92JB"
    }
]