[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "08/04/2021",
        "dateOfIncident": "07/15/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427692,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Hello.  While traveling in the right lane on the Interstate (I-43) in Milwaukee, Wisconsin, heading southbound with a semi-truck in the center lane, the rear of my vehicle seemed to Lift/Rise off the ground and move (as if the rear of my auto was floating) to the right.  I was at the point of being between at the semi-trucks front right tire and his bumper.  I was involved in an accident with said semi-truck, thinking he was changing lanes from center lane to right lane and bumped my Left-Rear-Quarter-Panel. After much though and calming down, it seems as if my auto was pushed or lifted in a hydro plane effect by the air between my auto and the semi-truck.  The day was clear and dry out around 10:45 AM, on July 15th. 2021.   My question is: How many of these Ford Fiesta cars (with manual transmission) have had some type of highway collision with a semi-truck?  Or, an unexplained loss (effect) of control while driving on the Interstate.  Yes, a rear kind of Hydro-Plane affect with air pressure.  Did I really have this happen to me while driving this car, I believe so.",
        "vin": "3FADP4EJ6JM"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "03/03/2021",
        "dateOfIncident": "04/26/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 11398847,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE DRIVING ON INTERSTATE WHEN A VIBRATION WAS FELT THROUGH THE STEERING WHEEL, THEN THE VEHICLE STARTED LOSE POWER.  GEAR SHIFT STILL IN DRIVE ENGINE STILL RUNNING AND COASTED TO A STOP ON SIDE OF HIGHWAY.  VEHICLE WAS REAR ENDED  FOUND OUT THAT THE LEFT DRIVE AXLE HAD BECOME DISCONNECTED AT THE TRANSMISSION END.  WHEN THIS HAPPENS THE SV  HAS NO WAY TO MAINTAIN A SAFE SPEED.-++++++*DT*DT*DT*JB*JB*DT*JB*DT",
        "vin": "3FADP4BJ1JM"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/10/2020",
        "dateOfIncident": "12/07/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11382871,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 FORD FIESTA. THE CONTACT STATED THAT THEN WHEN FUEL TANK WAS FILLED, THE VEHICLE TOOK A LONG TIME FOR THE ENGINE TO START UP. THE CHECK ENGINE WARNING LIGHT REMAINED ILLUMINATED. THE CONTACT ALSO TRIED PUTTING A SMALL AMOUNT OF FUEL INTO THE FUEL TANK TO AVERT THE FAILURE HOWEVER, THE FAILURE RECURRED. THE VEHICLE WAS TAKEN TO FENTON FORD ADA (1600 LONNIE ABBOTT BOULEVARD, ADA, OK 74820, (580)332-6161 TO HAVE A DIAGNOSTIC TEST PERFORMED. THE MECHANIC LOCATED THE FAILURE CODE WITH THE EVAPORATOR FUEL VALVE STUCK IN THE OPEN POSITION WHICH CAUSED THE FUEL TO LEAK INTO CHARCOAL CANISTER. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE 88,000.",
        "vin": "3FADP4TJ4JM"
    },
    {
        "components": "SUSPENSION,WHEELS,SEATS",
        "crash": false,
        "dateComplaintFiled": "12/06/2020",
        "dateOfIncident": "03/07/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378121,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DO PURSHASE THE CAR THE SPEAKER ON R SIDE  HAD ALOT OF STATIC AND WHEN I WOULD DRIVE THE WHEELS SEEM TO WOBBLE,AND FELT VER IN SAFE TO DRIVE. WHEN I WAS TO TAKE CAR IN THE COVID CAME AND CLOSED EVERYTHING DOWN. WHEN SERVICE DEPARTMENT OPEN I TOOK CAR IN AND EXPLAINED WHAT WAS WRONG SO THEY REPLACED THE SPEAKER AND SAID THE R SIDE UNDER WHEELS WERE REALLY BAD AND IT NEEDED TO BE FIXED. I DIDN'T REMEMBER TO LET SERVICE KNOW ABOUT THE INSIDE PARTS THAT WAS BROKE AND MISSING. THEN THEY HAD TO CLOSE AGAIN. ONCE I WAS ABLE TO GET OIL CHANGE AND WHEELS ROTATE IT I MANAGED TO TALK TO THE SALES AGENT AND EXPLAIN TO HIM WHAT WAS GOING ON AND HE TOLD ME TO BRING MY CAR IN TO SEE HOW MUCH IT WOULD BE AND HE WOULD GIVE ME HIS DISCOUNT PRICE. THIS STUFF WAS DAMAGED BEFORE I EVEN PURCHASED THE CAR SO I DON'T THINK I SHOULD HAVE TO PAY FOR ANYTHING. NOW SOMETHING UP UNDER MY CAR IS MAKING SOUNDS WHEN I BREAK AND I DON'T THINK IT'S THE BRAKE PADS OR THE SHOES BECAUSE I KNOW THAT SOUND AND IT HAS TO BE SOMETHING ELSE. I HAVE HAD PROBLEMS WITH THIS CAR SINCE I PURCHASED IT AND EVEN BEFORE TAKING IT OFF THE LOT AND BECAUSE OF THE COVID-19 IT'S BEEN VERY HARD TO GET BACK AND FORTH TO GET THINGS TAKEN CARE OF I'M AFRAID TO DRIVE MY CAR NOW BECAUSE WHEN I LET OFF THE GAS AND GET READY TO GO INTO THE BREAK IT SOUNDS VERY STRANGE. I PERSONALLY THINK THAT THIS CAR HAD A LOT OF DAMAGES COULD HAVE BEEN IN A CRASH PRIOR TO ME PURCHASING THE CAR AND IT'S JUST NOT SAFE. I HAVEN'T HAD THE CAR A YEAR AND WHEN I PURCHASED A CAR IT WAS 38,437 AND NOW MY CAR IS 40,000 I WILL TRY TO GET THIS FIXED BEFORE I DRIVE IT AND PUT MYSELF AND MY GRANDKIDS IN DANGER.",
        "vin": "3FADP4EJ7JM"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/08/2020",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373710,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERAL PROBLEMS ONE THE CAR VENT SYSTEM ACTUATOR FAILING TO OPEN VENT MAKING CRACKLING NOISE, SECOND PROBLEM WATER COOLANT CONTAINER LINES START LEAKING FAILING CAUSING ENGINE TO BURN UP CHEAP PLASTIC CONNECTIONS FAILING NO WATER LINES SHOULD AT THE CONTAINER OTHER THAN REFILL POOR ENGINEERING NEED HARDER INSPECTORS",
        "vin": "3FADP46X7GM"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/07/2020",
        "dateOfIncident": "10/06/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363296,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN THE ROAD... ABS, BRAKE, TSC LIGHTS KICKED ON AND THE CAR JERKED TO THE RIGHT-HAND SIDE AND SLOWED DOWN ABOUT 10MPH... AS I KEPT GOING IT LIT UP AGAIN AND JERKED HARD... AS I GOT SPEED TO ABOUT 55MPH DID IT A FEW MORE TIMES BEFORE I FINALLY SHUT THE CAR OFF AND HAD THE DEALERSHIP COME GET IT..",
        "vin": "3FADP4AJ0JM"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/11/2020",
        "dateOfIncident": "06/20/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328346,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SHUDDERS UPON ACCELERATION FROM STANDSTILL. LOSES POWER SEVERELY GOING UPHILL. ENGINE/TRANSMISSION SHAKES SHUDDERS ENGINE RACES AND QUICKLY ACCELERATES AFTER LOSS OF POWER THEN DECREASES AGAIN. WHEN MOVING FROM STOP CAR SHUDDERS MAKES A GRINDING NOISE AND THEN SLOWLY ACCELERATES BEFORE DECREASING RPM AND THEN RACES AGAIN.  *TR",
        "vin": "3FADP4BJ8JM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/27/2020",
        "dateOfIncident": "05/27/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326183,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE PAST 6 MONTHS, THE BRAKE LIGHTS DO NOT COME ON PROPERLY AND OCCASIONALLY THE BATTERY DRAINS. WHEN THIS WAS LOOKED INTO, IT WAS FOUND TO BE A BAD BODY CONTROL MODULE. THIS SEEMS TO BE A COMMON PART FAILURE ISSUE FOR FORD. WE NEED THIS REPLACED/FIXED.  BRAKE LIGHTS NOT WORKING IN STATIONARY POSITION, WORK SOMETIMES WHILE MOVING AND BATTERY TO CAR DRAINS WHILE STATIONARY OVERNIGHT.  *TR",
        "vin": "3FADP4EJ8JM"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/15/2020",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321226,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE AUTOMATIC TRANSMISSION SHUTTERS WHEN GOING INTO SECOND GEAR AND STALLS BEFORE ACCELERATING.    SOME TIMES THE CAR WON'T START AND IT'S NOT RELATED TO THE BATTERY OR THE STARTER.    IT ALSO HAD A PURGE VALVE REPLACEMENT THREE MONTHS AFTER PURCHASE. A FEW MONTHS LATER I HAD TO REPLACE IT AGAIN THIS TIME IT WASN'T UNDER WARRANTY.    I PURCHASED THIS CAR BRAND NEW IN 2018 AND IT HAD ALL THESE ISSUES IN 2018 AND OCTOBER OF 2019 IS WHEN THE TRANSMISSION BEGAN TO SHUTTER.  *TR",
        "vin": "3FADP4BJ9JM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/02/2019",
        "dateOfIncident": "06/19/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265600,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2018 FORD FIESTA IS HAVING THE SAME PROBLEM AS THE 2014 FORD FIESTA. PROGRAM # 14M01  EXCESSIVE TRANSMISSION CLUTCH SHUDDER. ERROR CODE P087E.   THIS NEEDS TO BE REPAIRED AS WELL",
        "vin": "3FADP4BJXJM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/29/2019",
        "dateOfIncident": "06/08/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240281,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WAS DRIVING AT 68 MPH AND APPROXIMATELY 2500 RPM STARTED TO LOOSE SPEED DOWN SLIGHT HILL AND RPMS INCREASED TO 5,500 RPM. LET OFF THE ACCELERATOR 3 SECONDS RPMS DECREASED REAPPLIED ACCELERATOR AND OPERATED PROPERLY.",
        "vin": "3FADP4EJ6JM"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/10/2019",
        "dateOfIncident": "07/02/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230761,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 7/2/2019 MY WIFE AND I WAS IN A PRETTY BAD WRECK TOTALING OUR CAR. THERE WAS MASSIVE DAMAGE DONE TO THE FRONT OF THE CAR HOWEVER THE AIRBAGS NEVER DEPLOYED. WITH THE DAMAGE DONE THERE'S NO REASON THE AIR BAGS SHOULDN'T HAVE WENT OFF. WE WAS TRAVELING ABOUT 70 MPH ON THE HIGHWAY HEADING HOME WHEN THIS HAPPENED",
        "vin": "3FADP4BJ7JM"
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/20/2019",
        "dateOfIncident": "06/07/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221498,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BEEN NOTICING NOW WITH THE FORD FIESTA 2018 THAT MY THIRD GEAR. LOSES THE GRIP GOING UP HILL. BEEN LIKE THIS FOR A FEW WEEKS. I HAVE TAKEN THE CAR TO THE DEALER. TWO TIMES HAVE THEY REPAIR IT. YET, SADLY SEEMS THAT THIS WILL BE THE THIRD AND FINAL TIME. CAN'T BELIEVE FORD DOESN'T DO DURABLE MANUALS ANYMORE. THE ISSUES ARE A LOT ON THE HIGHWAY. CAN'T AFFORD A CRASH OR ACCIDENT.",
        "vin": "3FADP4J6JM1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/24/2019",
        "dateOfIncident": "03/21/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203584,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRICAL SYSTEM SHUT DOWN COMPLETELY ON THE 2018 FORD FIESTA. NO POWER, NO ENGINE, NO LIGHTS, NO ELECTRICAL COMPONENT FUNCTIONED. NO HAZARD FLASHERS IN RUSH HOUR TRAFFIC AT THE INTERSECTION OF AN INTERSTATE HIGHWAY AND A STATE HIGHWAY. THE CAR COASTED AND I STEERED IT BETWEEN LANES TO AS SAFE A SPOT AS I COULD REACH. THE SITUATION WAS DANGEROUS WITH A HIGH POTENTIAL FOR HARM. FORTUNATELY NO ONE WAS HURT AND NO ACCIDENTS RESULTED. AFTER A TWO WEEK REPAIR ON A NEW CAR I HAD OWNED FOR ONLY TWO WEEKS THE CAUSE WAS FOUND TO BE A BROKEN CABLE CONNECTOR UNDER THE BATTERY.",
        "vin": "3FADP4BJ0JM"
    }
]