[
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "03/29/2021",
        "dateOfIncident": "03/08/2021",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405392,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "GEORGETOWN",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 FOREST RIVER GEORGETOWN. THE CONTACT STATED THAT THE MAIN DOOR LATCH WAS INOPERABLE. THE CONTACT STATED THAT OCCUPANTS HAD TO EXIT THE RV THROUGH THE WINDOWS. THE RV WAS TAKEN TO RON HOOVER RV & MARINE OF SOUTH HOUSTON (1903 GULF FWY, LA MARQUE, TX 77568, (409) 935-7101) WHERE IT WAS DIAGNOSED WITH NEEDING THE MAIN DOOR LATCH TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 24,282. THE VIN WAS NOT AVAILABLE.*DT",
        "vin": "1F66F5DY2J0"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/14/2019",
        "dateOfIncident": "04/05/2019",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196088,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "GEORGETOWN",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE HAD A SEPARATION OF THE SIDEWALL FROM THE VEHICLE FRAME. IT APPEARS FROM THE ENTRANCE DOOR GOING FORWARD OVER THE FRONT TIRE. IT LOOKS LIKE SCREWS THAT HOLD THE WALL TO THE FRAMEWORK HAVE BROKEN. THERE IS A GAP UNDER THE ENTRANCE DOOR THRESHOLD PLATE AND LOOKING INSIDE YOU CAN SEE A GAP OF ABOUT 1/4 INCH BETWEEN THE FLOOR EDGE AND THE WALL. I HAVE A PICTURE OR 2 TO SHARE. WE NOTICED THIS WHILE PARKED IN A SPACE WE RENTED FROM CHARLOTTE MOTOR SPEEDWAY WHILE THERE ATTENDING A AUTOMOTIVE EVENT CALLED THE CHARLOTTE AUTO FAIR. MY WIFE WAS ENTERING THE RV AND NOTICED IT FIRST. WE HAD DRIVEN THE NIGHT BEFORE FROM DANVILLE, VA. A TRIP OF ABOUT 2 HOURS AND 15 MINUTES VIA THE RTE I-85 AND RTE 29 FROM DANVILLE . ITS A 4 LANE HIGHWAY AS WELL AS I-85.  OUR RV HAS ABOUT 7500 MILES ON IT AND IT'S A GEORGETOWN GT 36 B 5 MODEL. WHERE I ENTERED THE SPEED I WAS TRAVELING WHEN IT HAPPENED, THAT'S FROM THE TRIP I TOOK GOING TO WHERE I WAS. I WAS SITTING STILL WHEN I NOTICED IT. *DT *DT *DT  CONSUMER STATED SCREWS THAT HOLD THE WALL TO THE  FRAMEWORK ARE BEHIND THIS MOLDING. MOST OF THE LOOSE SCREWS SEEM TO BE FROM THE FRONT TO AN AREA AT THE STEPS WHERE YOU CAN SEE THE GAP UNDER THE THRESHOLD PLATE. LAYING UNDER THE RV NEAR THE TIRE, I CAN SEE THAT THERE IS A SPACE OF ABOUT QUARTER INCH OR BETTER BETWEEN THE WALL AND THE FRAME AND YOU CAN SEE THE SCREWS IN THAT GAP AS WELL. CONSUMER HAS CONTACTED DEALER. INVALID VIN*JB",
        "vin": "1F6F5DY1HJA"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/03/2018",
        "dateOfIncident": "05/01/2018",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133170,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "GEORGETOWN",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ROOF IS LEAKING IN MULTIPLE AREAS.",
        "vin": "1F66F5DYQH0"
    }
]