[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/21/2021",
        "dateOfIncident": "09/19/2021",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433854,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "R-POD",
                "productYear": "2018",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Lionshead Specialty Tire & Wheel LLC",
                "productMake": "LIONSHEAD",
                "productModel": "CASTLE ROCK",
                "productYear": "9999",
                "size": "ST225/75R15",
                "type": "Tire"
            }
        ],
        "summary": "The contact owns a 2018 Forest River R-Pod equipped with Lionhead Tires, Tire Line: Castle rock, Tire size: 225/75/R15, Dot Number: JULT-1MT. The contact stated while the RV was parked outside of the residence, he heard a load pop coming from the vehicle. The contact inspected the vehicle and noticed that the spare tire had exploded, and the thread of the tire was separated and split into two pieces and separated from the frame. The tire was the original spare tire and had never been used. The spare tire was not replaced.  The manufacturer was made aware of the failure.",
        "vin": "4x4trpt15jl"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/08/2021",
        "dateOfIncident": "09/02/2021",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432185,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "R-POD",
                "productYear": "2018",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Ewr Volpe Acme Inc.",
                "productMake": "TBD",
                "productModel": "TBD",
                "productYear": "9999",
                "type": "Vehicle"
            }
        ],
        "summary": "This is a 2018 Forest River Rpod RPT180 travel trailer, total about 10 trips or 4500 travel mileage. The underneath 2 support carriage beam for the whole structure buckle and bent down due to the manufacturer design/material failure. Both supporting beams above the axle buckle and the passenger side is more sever. On passenger side: there's about 4 inch drop/bent start from the axle; the rear wall frame already separated to the carriage beam; the wheel tilt in and about to loose. On driver side: there's about 1/2 inch bent down right above the axle. Inside the trailer, the wall buckle, floor buck up. At the current stage, it is not road worthy and not towable. It poses hazardous to any road user. This is an inexcusable major structure failure to design a beam not been able to carry the designated load.",
        "vin": "4x4trpt1xjl"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/26/2021",
        "dateOfIncident": "04/23/2021",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413943,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "R-POD",
                "productYear": "2018",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Lionshead Specialty Tire & Wheel LLC",
                "productMake": "LIONSHEAD",
                "productModel": "CASTLE ROCK",
                "productYear": "9999",
                "size": "ST225/75R15",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 FOREST RIVER R-POD TRAILER EQUIPPED WITH CASTLE ROCK TIRES, TIRE LINE: LIONSHEAD, TIRE SIZE: ST225/75/R15, DOT NUMBER(S): JULT1MT1917 AND JULT1MT2217. THE CONTACT STATED THAT WHILE DRIVING 65 MPH ON THE FREEWAY, THE FENDER OVER THE PASSENGER'S SIDE TIRE THREAD SEPARATED WHICH CAUSED FENDER TO COME OFF. THE TIRE WAS REPLACED WITH A SPARE. THE CONTACT THEN STATED UPON DRIVING FIVE MORE MILES, THE DRIVER'S SIDE TIRE EXPERIENCED A BLOWOUT. THE TIRE WAS REPLACED AND THE TRAILER WAS DRIVEN BACK TO THE RESIDENCE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE OF THE TIRE WAS 2,347.   CONSUMER  UPDATE:  STATED THE FENDER OVER THE PASSENGER'S SIDE TIRE THREAD SEPARATED WHICH CAUSED FENDER TO COME OFF. SECOND TIRE BLEW OUT.*JB",
        "vin": "4X4TRPT15JL"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/10/2021",
        "dateOfIncident": "03/08/2021",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400205,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "R-POD",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 FOREST RIVER R-POD. THE CONTACT STATED THAT THE BRACKET DETACHED FROM THE TRAILER. THE CONTACT TEMPORARILY REPAIRED THE FAILURE WITH A SCREW TO HOLD THE BRACKET TOGETHER. THE VEHICLE WAS NOT YET DIAGNOSED NOR REPAIRED. A DEALER WAS NOT CONTACTED. UPON INVESTIGATION, THE CONTACT ASSOCIATED THE FAILURE WITH NHTSA CAMPAIGN NUMBER: 20V763000 (EQUIPMENT) HOWEVER, THE VIN WAS NOT INCLUDED. THE MANUFACTURER HAD BEEN INFORMED OF THE FAILURE.*DT*JB",
        "vin": "4X4TRPU14JL"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/10/2019",
        "dateOfIncident": "06/29/2019",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230672,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "R-POD",
                "productYear": "2018",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 FOREST RIVER R-POD EQUIPPED WITH CASTLE ROCK RADIAL ST226 TIRES, SIZE: ST225/75/R15 (NA). WHILE DRIVING APPROXIMATELY 66 MPH, THE REAR PASSENGER SIDE AXIAL TIRE SUDDENLY BLEW OUT. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER AND LOCAL DEALER WERE NOT NOTIFIED OF THE FAILURE. THE TIRE AND VEHICLE FAILURE MILEAGE WAS 2,200. THE VIN AND DOT NUMBER WERE UNKNOWN.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/28/2018",
        "dateOfIncident": "11/17/2018",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154513,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "R-POD",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MANUFACTURING DEFECT IN THERMOSTAT WIRE TO LIQUID PROPANE TANK.  (XXXXXX).  PROPANE HEAT WOULD NOT TURN OFF. TOOK IN FOR WARRANTY WORK AND WAS ADVISED THE CAUSE WAS A CRIMPED WIRE IN THE MANUFACTURING PROCESS. IF WE WERE NOT PRESENT TO SHUT OFF THE PROPANE TANK, IT WOULD HAVE BURNT DOWN OR WORSE. *DT    PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)    CARFAX CANNOT PROCESS THIS REQUEST. *JB",
        "vin": "4X4TRPU13JL"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/15/2017",
        "dateOfIncident": "09/08/2017",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023636,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "R-POD",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 (NA) FOREST RIVER R-POD 176 TRAVEL TRAILER. WHILE DRIVING, THE BLACK WATER TANK PIPE DETACHED AND DRAGGED ON THE GROUND WITHOUT WARNING. AS A RESULT, THE VALVE LEAKED OF SEWAGE. THE CONTACT INDEPENDENTLY REPLACED THE VALVE, THE TERMINATION CAP, AND THE THREE INCH BAYONET AND DOUBLE WACK NUT. THE DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND STATED THAT, DUE TO THE CONTACT NOT PROVIDING PROOF OF THE FAILURE BEFORE THE REPLACEMENT, THEY COULD NOT ASSIST. THE APPROXIMATE FAILURE MILEAGE WAS 1,000.  UPDATED 11/01/17*LJ   VIN INVALID UPDATED 7/17/18*JB  *TR",
        "vin": "4X4TRPT16JL"
    }
]