[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/08/2022",
        "dateOfIncident": "01/07/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446712,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The transmission has a rough shift from 1st to 2nd, whether it is upshifting or downshifting, and isn't always predictable. This rough shift often feels like a lurching forwards when it shifts from 1st to 2nd and from 2nd to 1st it feels like something hits me in the back and shoves me forward. The 1st to 2nd often makes me feel out of control of the vehicle and while it hasn't endangered anyone as of yet, I am concerned that it will push my into the car in front of me one day. The 2nd to 1st shift also causes me concern for how it may cause me a neck injury if I'm not always focused when I'm close to that shift point.  The problem has not be reproduced by a dealer or independent service center, though I do plan to take it when I have the time in the near future. The problem has not been inspected by anyone. There are no warning lights, messages, or other symptom to indicate the problem will occur.",
        "vin": "1GTG5CEN7J1"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/01/2022",
        "dateOfIncident": "01/18/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445813,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Transmission slipped almost from start.  Took three appointments and two years - If my shop foreman knew the third time, why did he not call and tell me we now know your problem.  I finally got fed up and brought it in one more time.  Starter from day ONE maybe 50% of time made loud bang when Bendix retracted.  Shop refused to take it off!!!   I checked ball joint boots.  One feels like no grease in it.  They 'LOOKED' at it.  No answer and nothing was done.  Has had 'lifter noise' since new when small acceleration.  Noise rate accelerates till shift and then repeats.  I'm told they don't hear anything.  I am 76 and hard of hearing.  Pleeeeeze - don't tell me there isn't any.     Not my best day today and felt it's time to say crap is crap.",
        "vin": "1GTH5BEN0J1"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/09/2021",
        "dateOfIncident": "09/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443236,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I have been receiving the “Service Trailer Brake System” error intermittently. The only information I have been have to find around this is a defective wiring harnesses between two modules. This defect is not due to wear/tear and has been reported as a defective part on multiple GMC models. When this service error pops up it is distracting and very unsafe for driving as well as dangerous when towing as the driver has no idea of the trailer brake system is functioning properly..",
        "vin": "1GTP6EE12J1"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/18/2021",
        "dateOfIncident": "10/16/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437225,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle has less than 25,000 miles.  Over the last 3 days, after vehicle is put in park and turned off, the key will not always rotate back to the 'off' position, and can not be removed from the ignition.  This has happened at least 6 times over the last 3 days.  Managed to remove key by turning vehicle back on and driving back and forth a few inches, then trying again.  Took multiple tries on some occasions.  With less than 25,000 miles, nothing should be worn out...  Safety concerns:The possibility that the key will completely fail to be removable, meaning that if the vehicle must be left unattended, it must be left unlocked and in a condition that it could be started and stolen or driven by a curious child.  The possibility that see-sawing back and forth in a parking spot could lead to an accident.  The possibility that the vehicle will have to be towed.  The possibility of being stranded outside- all my keys are on one ring, if I can't get them out of the ignition, how would I open the door to the house?  The problem has not yet been reproduced or confirmed by a dealer or independent service station.  I will be calling to schedule an appointment.  The vehicle or component has not been inspected as of yet.  No warning lamps, messages, or other symptoms happened prior to the first incident.  When I returned home and had an opportunity, I did an internet search and discovered that the problem is a known issue, and has been reported by others.",
        "vin": "1gtg6cen2j1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/06/2021",
        "dateOfIncident": "09/03/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435672,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "i purchased this truck used about 5000 miles ago and it now has 26,800 miles and when you put it in park the key will not come out.you have to keep starting and shutting off and eventually it will come out.i have read alot of complaints about this and nothing is being done at gm.they should be ashamed of themselves for a substantial issue and they want to charge the customer for there issue.",
        "vin": "1GTG6EENXJ1"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/10/2021",
        "dateOfIncident": "05/28/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420373,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "No accident to report. I wasn’t aware of the problem with the High Pressure Fuel Pump intel a week later when the noise got louder, at first I figure it was the belt drive that needed check do to it sitting in the lot do to not being moved a lot. I then took it back to where the Vehicle originally came from they where able to identified the problem quickly to do them knowing already that the truck had that problem but never went to fix the problem or to take time to figure the problem out.",
        "vin": "1GTG6CEN4J1"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/21/2021",
        "dateOfIncident": "04/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413228,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "6 DIFFERENT OCCASIONS SAME ISSUE.  NO SOUND WHEN TRYING TO START.  10 MINUTES LATER VEHICLE STARTS AND CEL IS LIT.  NEVER AUTO SHIFTS AFTER ~30MPH. REPLACED TORQUE CONVERTER AND TRANSMISSION BODY VALVE ON 1ST OCCURRENCE. EACH TIME SERVICED (WARRANTY), AND AT SOME POINT THE PROBLEM WILL OCCUR AGAIN.  TOTAL OF 6 TIMES SINCE PURCHASED NEW.",
        "vin": "1GTG5CEN5J1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/15/2021",
        "dateOfIncident": "04/15/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408239,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR SEVERAL MONTHS, WE ARE NOW CONTINUOUSLY EXPERIENCING A SHAKING AND SHUDDERING OF THE CANYON EVERY TIME THE TRUCK SHIFTS FROM 1ST TO 2ND GEAR.  IT IS VERY DISTURBING DRIVING DOWN THE STREET AND THE CANYON BEGINS TO SHAKE SO HARD THAT EVERYONE IS JARRED IN THEIR SEATS EVEN WITH SEAT BELTS ON.  IT IS ALMOST AS IF THE CANYON IS BEING REAR ENDED BY ANOTHER VEHICLE AS WE'RE DRIVING DOWN THE STREET.  OUR BIGGEST CONCERN IS THAT IT HAPPENS ON MAJOR ROADS WHENEVER WE ACCELERATE AFTER A TRAFFIC LIGHT TRANSITIONS FROM RED TO GREEN.  AS WE CLEAR THE INTERSECTION, THE SHAKING OCCURS AND AS THE CANYON REDUCES SPEED MOMENTARILY, WE HAVE ALMOST BEEN REAR ENDED.    OUR CANYON IS STILL UNDER WARRANTY AS WE HAVE THE EXTENDED POWERTRAIN WARRANTY.  FURTHERMORE, WE JUST LEARNED OF A GM SERVICE BULLETIN, 18-NA-355 DATED AUGUST, 2019, THAT HAS BEEN CIRCULATING.  WE FOUND A COPY OF THE TORQUE CONVERTER CLUTCH SB AND IT APPLIES TO ALL GMC CANYONS FROM 2017-2019.      NEEDLESS TO SAY, GM (CORPORATE AND DEALERSHIP) WANT US TO PAY OUT OF POCKET FOR A VERY EXPENSIVE DIAGNOSTICS TEST (E.G., HUNDREDS OF DOLLARS) TO CONFIRM THERE IS A PROBLEM AND THEN DETERMINE IF WARRANTY WILL COVER THE REPAIR(S).  THIS IS A VERY SERIOUS VEHICLE SAFETY ISSUE THAT CAN CAUSE ACCIDENTS IF THE DRIVER IS NOT ACCUSTOMED TO BEING TOSSED ABOUT IN THEIR SEAT WHILE DRIVING THE CANYON.      GM NEEDS TO DO A RECALL TO FIX THIS PROBLEM FOR ALL AFFECTED VEHICLES AS PEOPLE, ESPECIALLY THOSE THAT ARE ON FIXED INCOMES, ARE NOT ABLE TO PAY OUT OF POCKET FOR A TEST JUST TO VALIDATE THE TOQUE CONVERTER CLUTCH SHUDDER DOES EXIST.",
        "vin": "1GTG6CEN8J1"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/05/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378006,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AT NIGHT, THE BACK-UP CAMERA DISPLAY ON THE DASH IS SO BRIGHT, IT LIGHTS UP THE WHOLE CAB AND THIS CAUSES THE DRIVER NOT TO BE ABLE TO SEE ANYTHING OUTSIDE THE CAB OR AROUND THE VEHICLE WHEN REVERSING. I ALMOST BACKED OVER MY WIFE BECAUSE I COULD NOT SEE HER BECAUSE OF THE BRIGHTNESS. THERE IS NO WAY TO ADJUST THE BRIGHTNESS WHEN IT IS IN REVERSE AND IN THE DARK YOU CAN NOT SEE MUCH IN THE SCREEN BECAUSE OF THE BRIGHTNESS. I TOOK IT TO THE DEALER AND HE SAID THEY HAVE SEEN THIS PROBLEM ON THE FULL SIZED TRUCKS BUT NOT THE MID-SIZED AND HE SAID IT WAS IN WORKING CONDITION. I FEEL THIS IS VERY DANGEROUS IF YOU CAN'T SEE WHEN YOU ARE REVERSING.",
        "vin": "1GTG6CEN6J1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/14/2020",
        "dateOfIncident": "10/13/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364424,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH 69025 MILES TRANSMISSION MOMENTARILY SLIPS INTO FREE WHEEL THEN RE- ENGAGES CAUSING A SURGE. TRANSMISSION SPECIALIST STATES COMPUTER ANALYSIS SHOWS INTERNAL ISSUE REQUIRING REPLACEMENT OF TRANSMISSION. SHUTTER FOUND AFTER 3RD YEAR.",
        "vin": "1GTG6CEN9J1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/11/2020",
        "dateOfIncident": "08/26/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354423,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY GMC CANYON HAS ONLY 35,000 MILES. IT STARTED SHAKING, SHUDDERING FREQUENTLY, AND HAVING HARD SHIFT WHEN CHANGING GEARS, SPECIALLY WHEN SPEEDING DOWN. IT FEELS SIMILAR TO DRIVE OVER THE STREET LINES WITH A SIMILAR SOUND. THERE IS A STRONG SOUND COMING FROM THE TRANSMISSION WHEN FAST SHIFTING HAPPENED FROM HIGH TO LOW OR WHEN STOP AT THE STOP LIGHT. IT IS LIKE THE ENGINE WANTS TO LEAVE FROM THE BODY OF THE TRUCK. THIS VIBRATION IS ALSO FELT WHEN DRIVING AT LOW SPEED OR LOW GEAR AND THE TRUCK IS DEMANDING MORE POWER, BUT THE TRANSMISSION DOES NOT CONTROL THAT DEMAND. IT IS LIKE NOT COMMUNICATION BETWEEN THE TRANSMISSION AND THE ENGINE.",
        "vin": "1GTG6EENXJ1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/29/2020",
        "dateOfIncident": "08/28/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351941,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2018 GMC CANYON SLT SHUDDERS ALOT.  IT IS NOT CONSTANT BUT IT IS OFTEN.  IT SORT OF FEELS LIKE YOU'RE DRIVING OVER RUMBLE STRIPS.  I DO NOT FEEL IT AT HIGHWAY SPEEDS, JUST DRIVING AROUND TOWN.  IT'S ESPECIALLY PREVALENT WHEN GOING UP HILLS.  TO ME, IT FEELS LIKE A TRANSMISSION ISSUE.  WHEN I DID A GOOGLE SEARCH, I FOUND OUT IT'S A KNOWN PROBLEM.  I CONTACTED MY DEALER AND THEY WERE FAMILIAR WITH IT ASKING IF I HAD A TRANSMISSION FLUID CHANGE YET.  I TOLD THEM I HAD NOT AND THEY SCHEDULING ME FOR THAT SERVICE IN A COUPLE WEEKS.  I AM NOT HAPPY THAT MY 2 YEAR OLD $40K PLUS TRUCK HAS A TRANSMISSION PROBLEM AT 25K MILES.",
        "vin": "1GTG6DEN7J1"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/18/2020",
        "dateOfIncident": "06/18/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329565,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE KEEPS SHUTTERING WHEN ACCELERATING.  *TR",
        "vin": "1GTG6EEN8J1"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/14/2020",
        "dateOfIncident": "04/13/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321050,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "NO BRAKE FLUID HAD REPAIRED BY DEAL IN ONE WEEK SAME ISSUES   NO BRAKE FLUID   ONSTAR DIAGNOSTIC REPORT AND ALERTS SAY BRAKE SYSTEM ERROR   NONENO ERROR CODE FOUNDNONE  ABS - BRAKING AND STABILITY SYSTEMC0273AN ISSUE HAS BEEN DETECTED IN THE TRACTION CONTROL SYSTEM.SERVICE WITHIN 7 DAYS  GOT  THIS TODAY PULLED OVER NO FLUID   DRIVING 30 MPH ON CITY STREET   I HAVE ALL ONSTAR AND MECHANICS REPORT'S",
        "vin": "1GTG5CEN1J1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/20/2020",
        "dateOfIncident": "02/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310452,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST PURCHASED A 2018 GMC CANYON USED WITH 8,000 MILES ON IT. DROVE IT 500 MILES AND NOW I HAVE A 8 SPEED TRANSMISSION AND NOW IT SHUDDERS. NOW I'M READING ALOT OF PEOPLE ARE HAVING ISSUES WITH IT. AM I IN THE LAWSUIT WITH GM IN THERE DEFECTIVE TRANSMISSIONS? IT SHUDDERS AT 55-60 MPH DROVE ME NUTS ON THE HIGHWAY.",
        "vin": "1GTG6EEN9J1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/19/2020",
        "dateOfIncident": "02/16/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310115,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 GMC CANYON. THE CONTACT STATED THAT WHILE ATTEMPTING TO TURN THE VEHICLE OFF, THE VEHICLE REMAINED RUNNING. THE CONTACT WAS ALSO UNABLE TO REMOVE THE KEY FROM THE IGNITION. THERE WERE NO WARNING LIGHTS ILLUMINATED. THE CONTACT STATED THAT THE FAILURE WAS INTERMITTENT. THE VEHICLE WAS TAKEN TO COYLE CHEVROLET BUICK GMC 1801 BROADWAY ST, CLARKSVILLE, IN 47129 WHERE THE DEALER WAS UNABLE TO DUPLICATE THE FAILURE. THE MANUFACTURER HAD NOT BEEN NOTIFIED OF THE FAILURE. THE VEHICLE HAD NOT BEEN NOTIFIED. THE FAILURE MILEAGE WAS APPROXIMATELY 18,000.",
        "vin": "1GTG6DEN4J1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/23/2019",
        "dateOfIncident": "05/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270343,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MOVING ON THE HIGHWAY THE VEHICLES' TRANSMISSION STARTS TO SHUDDER. THIS USUALLY HAPPENS WHEN I AM GOING UP A SLIGHT INCLINE AND MY ENGINE IS AROUND 1400 RPMS. I HAVE TAKEN THE TRUCK TO THE DEALERSHIP MULTIPLE TIMES OVER THIS ISSUE. THEY HAVE REPLACED THE TRANSMISSION FLUID TWICE AND THE NEXT APPOINTMENT IS NEXT WEEK ON OCTOBER 31ST. THE DEALERSHIP TOLD ME THAT MORE THAN LIKELY THEY WILL HAVE TO FLUSH THE TRANSMISSION FLUID AGAIN BECAUSE GM IS NOT LETTING THEM DO MUCH MORE WITH THIS ISSUE. THE TRUCK ALSO HAS A HARD TIME SHIFTING WHEN IT IS FIRST STARTED UNTIL IT GETS WARMED UP. ALSO THERE ARE TIMES I FEEL LIKE I HAVE BEEN REAR ENDED WHEN I AM SLOWING DOWN AND IT IS DOWN SHIFTING. I HAVE NOTICED THAT IF I KEEP THE TRUCK AT A FAIRLY HIGHER RPM THAT IT DOES NOT SHUDDER AS BAD AND DOESN'T FEEL AS DANGEROUS TO DRIVE. MY VEHICLE HAS 27,000 MILES ON IT AND HAS BEEN IN THE SHOP COUNTLESS TIMES SINCE I PURCHASED IT IN 2018. I DON'T EVEN LIKE DRIVING IT BECAUSE I FEEL THAT IT IS A SAFETY CONCERN AND IS ENDANGERING MYSELF AND OTHERS.",
        "vin": "1GTG5DEN1J1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/13/2019",
        "dateOfIncident": "05/13/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207241,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "IT STARTED ABOUT 6 MONTHS AFTER I PURCHASED THE VEHICLE. THE ELECTRONIC POWER STEERING WILL INTERMITTENTLY FAIL IF THE TRUCK IDLES FOR A 10-20 MINUTE PERIOD OF TIME. AND WHILE AT HIGHWAY SPEEDS. THAN START WORKING AGAIN. DURING ANY PROLONGED HIGHWAY TRIP THE TRACTION CONTROL, ABS, AND BRAKE LIGHTS WILL ILLLUMINATE. IT HAS GOTTEN SO BAD NOW THAT I CAN COUNT ON IT BEING A DAILY OCCURRENCE. SOMETIMES THE LIGHT WILL COME ON BUT THE STEERING DOESN'T ACTUALLY FAIL. WHEN I PURCHASED THE CAR I WROTE A BAD REVIEW ABOUT THE SERVICE I RECEIVED ON MY FACEBOOK. I GOT A CALL FROM THE SALESMAN NAMED NICK FEOLA SAYING THAT HE SAW THE POST AND DISCUSSED IT WITH HIS MANAGER AND TOLD ME THAT I WAS NO LONGER WELCOME AT THE DEALERSHIP. SO WHEN I CALLED TO HAVE THE ISSUES I DESCRIBED RESOLVED. I WAS HUNG UP ON WHEN MY NAME WAS GIVEN.(DAVID DUKES AT THE TIME OF PURCHASE. I HAVE SINCE CHANGE DAY MY NAME TO SINGER) I DIDN'T KNOW WHO TO FILE A COMPLAINT TO UNTIL I READ AN ARTICLE ABOUT THIS ISSUE AND SAW A LINK TO YOUR WEBSITE.",
        "vin": "1GTH5BEA4J1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/14/2018",
        "dateOfIncident": "11/12/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161458,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "RUMBLING OF TRANSMISSION. CLUCKY START.  GM DEALER ACKNOWLEDGES THE PROBLEM AND HAS TRIED TO REPAIR VEHICLE.  GM SAYS AT THIS TIME THE TRUCK 8 SPEED TRANSMISSIONS ARE NOT FIXABLE.",
        "vin": "1GTH5BEN9J1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/20/2018",
        "dateOfIncident": "09/07/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130462,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 GMC CANYON. THE CONTACT STATED THAT THE STEERING KNUCKLE WAS CRACKED WHERE IT CONNECTED TO THE BALL JOINT. THE DEALER (DARLING'S AUTO MALL, 16 KINGSLAND CROSSING, ELLSWORTH, ME 04605, 1-(877) 548-1819) INDICATED THAT THEY ORDERED THE PART FOR THE STEERING KNUCKLE REPLACEMENT, BUT THEY DID NOT SPECIFY WHEN IT WOULD ARRIVE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 3,000.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/07/2018",
        "dateOfIncident": "08/13/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128149,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AUTOMATIC TRANSMISSION SHIFTS AGGRESSIVELY THE FIRST GEARS FROM A COLD STARTED ENGINE AFTER ENGAGING FROM PARK TO DRIVE. SLUGGISH SHIFTING AND ACCELERATION.",
        "vin": "1GTG6DEN0J1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/07/2018",
        "dateOfIncident": "08/15/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128166,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION CLUNKS FEELS LIKE YOUR HIT IN THE REAR END. I THOUGHT I WAS REAR ENDED 3 TIMES SO FAR. MY TRANSMISSION SURGES FORWARD FROM 4TH TO 5TH GEAR. VERY DANGEROUS TO WEAR I DON'T WANT TO DRIVE THE TRUCK.",
        "vin": "1GTH5BEA9J1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/28/2018",
        "dateOfIncident": "07/18/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123060,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION JERKS FROM 4TH TO 5TH. SOMETIMES FEELS LIKE SOMEONE HIT YOU IN THE REAR ENDED.",
        "vin": "1GTH5BEA9J1"
    }
]