[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/28/2022",
        "dateOfIncident": "03/28/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458637,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 3500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 GMC Sierra 3500. The contact stated after driving on a long downhill road at an undisclosed speed with his 2017 Highland Ridge 349 RV hooked to the vehicle, as he was reaching a leveling point and depressing the brake pedal to slow the vehicle, the brakes failed to operate as needed. The contact stated that as he depressed the brake pedal further, the brake pedal overheated and would no longer respond properly. The contact stated that the vehicle was rated at 22,000-23,000 while the trailer was 14,300 pounds loaded maximum. The contact stated that the trailer currently weighed 11,000 pounds. There were no warning lights illuminated. The contact stated that the failure had been reoccurring while driving. The vehicle was taken to the dealer who informed the contact that the braking system was operating properly. The manufacturer was not notified of the failure. The failure mileage was unknown.",
        "vin": "1GT42YEY4JF"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/15/2020",
        "dateOfIncident": "04/09/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321259,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 3500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "APRIL 9TH 2020 I WAS OPERATING MY VEHICLE A 2018 GMC SIERRA 3500 DENALI EQUIPPED WITH THE DIESEL PACKAGE. I WAS TOWING A BOBCAT SKID STEER ON A TRAILER WITH A TOTAL WEIGHT OF APPROXIMATELY 4300LBS. I WAS TRAVELING AT ABOUT 45 MPH WHEN I ENCOUNTERED A RED LIGHT. WITH PLENTY OF ROOM TO STOP I APPLIED THE BRAKES AS NORMAL. THEY INITAILLAY GRABBED AND SLOW MY TRAVEL TO ABOUT 40 MPH. THEN OUT OF WHAT SEEMED NOWHERE THE BRAKE PEDAL RAPIDLY WENT TO THE FLOOR AND THE VEHICLE FREEWHEELED THROUGH THE LIGHT. I ATTEMPTED MULTIPLE TIMES TO EASE OFF THE PEDAL AND REAPPLY TO NO AVAIL. UPON ENTERING THE INTERSECTION I NEARLY CRASHED INTO A VEHICLE. WHEN I NEARLY I MEAN WITH INCHES. I IMMEDIATELY SLAMMED THE E-BRAKE BRINGING THE TRUCK TO A SKIDDDING HALT. AFTER DROPPING THE TRAILER OFF IN AN EMPTY PARKING LOT MY VEHICLE WENT TO MY LOCAL DEALER. THE SERVICE ADVISER WHO 1ST ENCOUNTERED THE VEHICLE EXPERIENCED THE ISSUE 1ST HAND.AFTER HAVING IT FOR NEARLY A WEEK THEY CALLED TODAY TO SAY 'THEY CAN'T FIND THE ANY ISSUES'. THAT MAKES THIS SITUATION EVEN MORE DANGEROUS. YOU'RE UNAWARE WHEN THIS CAN HAPPEN. THESE VEHICLES NEED TO HAVE A NEW RECALL IMMEDIATELY",
        "vin": "1GT42YEY7JF"
    },
    {
        "components": "STEERING,POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/20/2019",
        "dateOfIncident": "11/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281407,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 3500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING UP HILL THE TRUCK LOST POWER DIED/SHUTDOWN SO I HAD NO POWER STEERING NO POWER BRAKES WE LIVE ON A COUNTRY RURAL ROAD. HAD THE TRUCK TOWED TO KENDALL CHEVROLET IN EUGENE OREGON WHERE IT HAS BEEN SINCE NOVEMBER 2 WITH ELECTRICAL ISSUES THAT THEY ARE TRYING TO PINPOINT.",
        "vin": "1GT42XEY8JF"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/08/2019",
        "dateOfIncident": "05/09/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278880,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 3500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 GMC SIERRA 3500. WHILE DRIVING APPROXIMATELY 60 MPH AND HAULING A TRAILER, THE ABS, SERVICE TRAILER BRAKE, SERVICE POWER STEERING, AND SERVICE STABILITRAK WARNING INDICATORS ILLUMINATED. ALSO, THE VEHICLE LOST BRAKING FUNCTIONALITY. THE CONTACT ALSO STATED THAT THE FAILURE OCCURRED WHILE NOT TOWING A TRAILER. THE VEHICLE WAS TAKEN TO BUSTER MILES CHEVROLET (1884 ALMON ST, HEFLIN, AL 36264, (256) 781-4536) TO BE DIAGNOSED, BUT THE MECHANIC WAS UNABLE TO RETRIEVE A FAULT CODE. THE CONTACT WAS INFORMED THAT THE FAILURE MAY BE DUE TO A WHEEL SPEED SENSOR. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 16,068.",
        "vin": "1GT42YEY6JF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/02/2019",
        "dateOfIncident": "04/02/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265682,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 3500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 GMC SIERRA 3500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V328000 (ENGINE). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. ROYAL MOORE BUICK GMC (1380 SE RIVER RD, HILLSBORO, OR 97123, (503) 648-1153) WAS CONTACTED AND CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE MANUFACTURER WAS ALSO CONTACTED AND MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "1GT42XCY3JF"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/06/2019",
        "dateOfIncident": "10/17/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174779,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 3500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SHAKING OR FLICKERING,  HEADLIGHTS WHEN DRIVEN ON ROUGH ROAD SURFACES FLICKER OR SHAKE LIKE BLINKING YOU'RE EYES REAL FAST VERY DISTRACTING FOR MYSELF AND OTHER DRIVERS W.S.P. SAID IT IS A DEFECTIVE EQUIPMENT ISSUE SEND COMPLAINT TO A.G. WA. A.G. IDA. IDAHO ALSO SEND COMPLAINT TO B.B.B. AND N.H.T.S.A. HAD TRUCK IN 4 TIMES FOR REPAIR FOUND PROBLEM BULLETIN NUMBER 18 -NA-001 DOC. ID. 4924668 COMPLAINT TO GMC TALKED WITH 5 TIMES CLOSED MY COMPLAINT 02-06-2019  THERE IS NO FIX FOR THESE HEADLIGHTS. BOUGHT THIS TRUCK NEW 10-17-18 PROBLEM WAS NOTICED DRIVING IT HOME FROM KELLOGG IDA. TO SPOKANE WA. TOOK TRUCK IN AT 536 MILES FOUND PROBLEM TOOK TRUCK HOME IT DIDN'T FIX THE PROBLEM TOOK IT IN AGAIN 659 IT DIDN'T FIX THE TOOK IT IN AGAIN THE THIRD TIME IN AT 822 MILES HAND ME DOCUMENT NO. 4924668 AND INFORMATION NO. 18-NA-001 HEADLAMP SHAKES OR FLICKERS DO NOT FIX. TOOK TRUCK TO DAVE SMITH GMC DEALER  IN KELLOGG IDA. FOUND SAME PROBLEM HAD TRUCK 4 DAYS SAME BULLETIN . CMC CLOSES THE CASE WILL LET ME KNOW WHEN AND IF IT CAN BE FIXED IN THE FUTURE SAID IT COULD TAKE YEARS. THANK YOU [XXX]  INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'  *PM",
        "vin": "1GT42WCG5JF"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/26/2018",
        "dateOfIncident": "03/15/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081400,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 3500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "HID HEADLIGHTS ON MY TRUCK FLICKER SIGNIFICANTLY, AND DIM AND BRIGHTEN, WHILE DRIVING VEHICLE ON BUMPY SURFACES.  THIS IS BRAND NEW TRUCK WITH 2500 MILES ON IT.  I PAID EXTRA FOR THE ALL TERRAIN VERSION.  GMC'S OFFICIAL RESPONSE TO ME IS THAT IT IS NORMAL FOR HID HEADLIGHTS TO FLICKER ON/OFF, AND THEY ARE REFUSING TO DO ANYTHING ABOUT THE ISSUE.",
        "vin": "1GT42XCY5JF"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/01/2018",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075573,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 3500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL SHAKING FROM 70MPH TO 78 MPH HIGHWAY DRIVING",
        "vin": "1GT42XEY2JF"
    }
]