[
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/26/2022",
        "dateOfIncident": "01/20/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454275,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Glass in front of the moon roof exploded outward. Corners where collapsed inward. Traveling aprox. 50 mph. Clear sunny day. No traffic in front or behind. My first thought was flat tire. Glass was standing straight up with a 2 in gap in the center. The next one may completely leave the vehicle and cause an accident. Not looking for reimbursement. Paid by insurance. I think there was some sort of pressure on the glass to cause the damage making it a product defect.",
        "vin": "KMHGN4JE7JU"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "11/23/2021",
        "dateOfIncident": "10/18/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441477,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Genesis G80. The contact stated the rear driver’s side door failed to lock or unlock. The contact took the vehicle to the local dealer, where it was diagnosed with needing the rear driver’s side door latch to be replaced. The vehicle was not repaired but was pending repairs. The manufacturer had not been informed of the failure. The failure mileage was 66,590.",
        "vin": "KMHGN4JE3JU"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/22/2021",
        "dateOfIncident": "10/01/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437766,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "PROCONTACT TX",
                "productYear": "9999",
                "size": "275/35R19 96W",
                "type": "Tire"
            }
        ],
        "summary": "275.35r19 96w Continental Procontact TX  Between 12-15k miles I had my two front tires form sidewall bubbles. The first bubble resulted in a blowout. Now at about 24k miles I'm told by the dealer the tread on my rear tires is almost gone. One rear tire, also, loses air monthly. I drive mostly locally and my longest trips are not greater than 70miles. I park in my driveway rarely where anything can hit the sidewall. For four tires to fail at this mileage indicates to me there is a serious flaw with the manufacturing.",
        "vin": "kmhgn4jf3ju"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/14/2021",
        "dateOfIncident": "10/13/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436777,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Whenever I make a prolonged right hand turn the steering wheel sticks in that position until it is MANUALLY returned to center. For example, taking an on-ramp than is a large ‘U’, the vehicle steering wheel ‘sticks’ in the turned position to the right. I can take my hand off the wheel and it stays there until it is forcibly turned back to center. This has been going on since I owned the vehicle, but it has never been unrecoverable. It’s happened every time I take the same on-ramp…every time.",
        "vin": "KMHGN4JB6JU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/27/2021",
        "dateOfIncident": "08/16/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434491,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "In general, when you release your grab from the steering wheel, it automatically return to a straight position, but when I steer my vehicle to the right then steering wheel is fixed in to the right position and not turning back, only way to steer in the front direction is using your force to steer it, which means if I failed to steer the wheel into the straight position then my car will get out of the lane and eventually collide with other structures, vehicle, or person   I complained this many times before today to Genesis of Auburn service center but answer I received every time from the service center is they found nothing wrong, but the problem is getting worsen now, back then it only happens on the high-speed in highway but now it occurs in low-speed while driving in city",
        "vin": "KMHGN4JB9JU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/24/2021",
        "dateOfIncident": "03/10/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430308,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Genesis G80. The contact received notification of NHTSA Campaign Number: 21V160000 (Service Brakes, Hydraulic) however, the part to do the recall repair was unavailable. The vehicle was taken to the local dealer and it was confirmed that the part was not available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was notified of the issue however, no further assistance was provided. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "KMHGN4JE6JU"
    },
    {
        "components": "PARKING BRAKE,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/23/2021",
        "dateOfIncident": "01/10/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422051,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Genesis G80. The contact received notification of NHTSA campaign number: 21V160000 (service brakes, hydraulic) however, the part to do the recall repair was not available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The local dealer was made aware of the issue however, the contact has not notified the manufacturer of the issue. The contact had not experienced a failure. Parts distribution disconnect. Consumer would like to withdraw complaint.",
        "vin": "kmhgn4jf8ju"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/24/2021",
        "dateOfIncident": "05/19/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418311,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Genesis G80. The contact received notification of NHTSA Campaign Number: 21V160000 (Service Brakes, Hydraulic) however, the part to do the recall repair was unavailable. The contact took the vehicle to the local dealer and it was confirmed that the part was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "KMHGN4JE5JU"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/06/2021",
        "dateOfIncident": "04/06/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406690,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE HIGHWAY AT 70MPH, NO OTHER VEHICLE IN FRONT OF ME. THE MOVABLE SECTION OF THE SUNROOF EXPLODED WITH A LOUD BANG AND GLASS RAINING DOWN ON ME AND MY PASSENGER.  ALL WIDOWS CLOSED, SUNROOF CLOSED, SUNSHADE OPEN. 60SUNNY MORNING. I'M EXTREMELY CONFIDENT THAT NOTHING HIT THE ROOF. I HAB NEVER HAD AN ISSUE WITH THE ROOF AND ACTUALLY SELDOM OPEN IT....",
        "vin": "KMHGN4JB7JU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/23/2021",
        "dateOfIncident": "02/08/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397548,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GPS, RADIO AND OTHER ELECTRONIC NOTIFICATION SYSTEM ARE MALFUNCTIONING SUCH THAT THEY EITHER FREEZE UP OR GIVE ERRONEOUS INFORMATION BEGINNING WITHIN MINUTES AFTER THE CAR IS STARTED. THIS HAS BEEN GOING ON FOR SEVERAL WEEKS AND THE DEALER' S SERVICE DEPARTMENT CLAIMS IT IS A PROBLEM WITH SIRIUSXM AND OUT OF THEIR HANDS TO FIX. HOWEVER, A GOOGLE SEARCH REVEALS NO EVIDENCE THAT SIRIUSXM IS HAVING ANY TRANSMISSION PROBLEMS AND IT STILL WOULD NOT EXPLAIN THE WIDESPREAD ELECTRONIC MALFUNCTION. THE DEALER CAN NOT SAY WHEN THIS PROBLEM WILL BE SOLVED. I AM CONCERNED THIS ISSUE FORETELLS A POSSIBLE MORE SUDDEN, CATASTROPHIC FAILURE OF THE AUTOMOBILE'S ELECTRONIC/COMPUTER SYSTEM WITH POTENTIALLY DANGEROUS CONSEQUENCES TO THE DRIVER AND ANY PASSENGERS. THE DEALERSHIP IS COCONUT CREEK AUTO MALL. 4960 NORTH STATE ROAD 7, COCONUT CREEK, FL. 33073 CONTACT [XXX].    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR*DT*DT*JB",
        "vin": "KMHGN4JEXJU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/22/2020",
        "dateOfIncident": "08/22/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350783,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONTINENTAL TREADWEAR 400 TIRES THAT COME WITH THIS CAR ARE DANGEROUS. I HAD ONE SIDEWALL BLOWOUT AT ABOUT 35 MPH AFTER LESS THAN 6000 MILES OF DRIVING, AND HAD THE REPLACEMENT TIRE, NEW, DEVELOP BUBBLES ON THE SIDEWALL AGAIN AFTER LESS THAN 6000 MILES DRIVING, AND REPLACE THIS TIRE WITH ANOTHER BRAND. I CONTACTED CONTINENTAL TIRE CONCERNING THIS PROBLEM, BUT HAVE TO DATE RECEIVED NO RESPONSE. MANY TIRE REVIEWS ALSO POINT OUT THIS PROBLEM.",
        "vin": "KMHGN4JF3JU"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/12/2020",
        "dateOfIncident": "08/09/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348837,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTI PRO CONTACT TX",
                "productYear": "9999",
                "size": "245/40/ZR19",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 GENESIS G80 EQUIPPED WITH CONTINENTAL TIRES, TIRE LINE: CONTI PRO CONTACT TX, TIRE SIZE 245/40/ZR19, DOT NUMBER: (NOT AVAILABLE). THE CONTACT STATED THAT WHILE DRIVING AT 60 MPH, A YELLOW WARNING LIGHT APPEARED ON THE INSTRUMENT PANEL. THE CONTACT PULLED OVER AND DISCOVERED THE PASSENGER'S SIDE TIRE SIDEWALL WAS BLOWN OUT. THE CONTACT ALSO STATED THAT THE CHECK YOUR TPMS WARNING MESSAGE ALSO ILLUMINATED ON THE INSTRUMENT PANEL SOON AFTER THE FAILURE. THE CONTACT CALLED ROAD SIDE ASSISTANCE AND HAD THE TIRE REPLACED. THE TIRE WAS PART OF A REPLACEMENT SET OF TIRES WHICH WERE REPLACED BY THE GENESIS DEALER. THE MANUFACTURER WAS CONTACTED AND INFORMED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE ON THE TIRE WAS 20,000.",
        "vin": "KMHGN4JBXJU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/24/2020",
        "dateOfIncident": "07/21/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341333,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING APPROXIMATELY 55/MPH ON THE 210 FWY. WEST; I HEARD A JARRING POP/EXPLOSION. I THEN SAW BLACK FLYING DEBRIS ON THE PASSENGER SIDE OF THE CAR.  WHEN I ARRIVED AT MY DESTINATION, I SAW THAT THE GLASS FROM THE REAT PART OF THE PANORAMIC ROOF HAD SHATTERED AND SETTLED INTO THE SHADE COVERING. I DID'T SEE ANY DEBRIS ON THE ROAD, OR ANYTHING TOSSED FROM ANOTHER CAR. THE CAUSE OF THE INCIDENT IS UNKNOWN.  I DID ADVISE MY INSURANCE CARRIER OF THE INCIEDENT, BUT HAVE NOT YET FILED A CLAIM, AS I AM WAITING TO SEE IF THE DAMAGE IS COVERED  UNDER THE CAR'S WARRANTY.",
        "vin": "KMHGN4JE1JU"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/05/2020",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327447,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTI PRO CONTACT",
                "productYear": "9999",
                "size": "235/45R19",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 GENSESIS G80 EQUIPPED WITH CONTINENTAL TIRES, TIRE LINE: CONTI PRO CONTACT TX, TIRE SIZE 245/40/ZR19 N/A, DOT NUMBER: (NOT AVAILABLE). THE CONTACT STATED THAT WHILE DRIVING AT 40 MPH, THE VEHICLE RAN OVER A POTHOLE AND THE TIRES EXPERIENCED BLOWOUTS. THE TIRE WERE NOT THE VEHICLE ORIGINAL TIRES. THE TIRES WERE REPLACED. THE MANUFACTURER WAS CONTACTED AND INFORMED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE ON THE TIRES WAS 6,000.",
        "vin": "KMHGN4JB4JU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/14/2019",
        "dateOfIncident": "11/13/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279970,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING COLD DAYS, WHEN I HAVE THE HEAT RUNNING, IT FLOWS FINE WHEN SET TO UPPER BODY AND WINDOWS.      WHEN THE HEAT IS SET TO FEET EXCLUSIVELY, IT FLOWS TO THE FRONT WINDOW VENTS MORE THAN TO THE FEET. SETTING THE FAN TO MAXIMUM, THE HEAT BLOWS OUT OF THE FRONT WINDOW VENTS MORE THAN TO THE FEET.     I TOOK THE VEHICLE TO GENESIS OF CHANTILLY VIRGINIA. THEY COMPARED THE AIR FLOW WITH A SIMILAR VEHICLE AND THEY REALIZED IT IS WAS BLOWING THE SAME WAY. THEY AGREED WITH ME THAT IT IS A BAD DESIGN AND NOTHING THEY COULD DO.     WHEN DRIVING IN COLD WEATHER, DRIVER CANNOT SET THE  HEAT EXCLUSIVELY TO FEET AT MAXIMUM SPEED,  SINCE THE HEAT FLOWS TO THE WINDOW VENTS INSTEAD TO THE FEET. THIS CAUSES SEVERE HEADACHE AND DRYNESS TO THE FACE.  THE FEET REMAIN EXTREMELY COLD WHILE DRIVING.",
        "vin": "KMHGN4JEXJU"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/25/2019",
        "dateOfIncident": "09/25/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258027,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDEWALL FAILURE OF CONTINENTAL PROCONTACT TX TIRES.   SEVERAL BUBBLES IN SIDEWALL.  DEALER CLAIMS IT MUST BE FROM ROAD HAZARD.",
        "vin": "KMHGN4JBXJU"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/16/2019",
        "dateOfIncident": "08/08/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244427,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "PROCONTACT GX SSR MOE",
                "productYear": "9999",
                "size": "225/45R18 95H XL",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 GENESIS G80 EQUIPPED WITH CONTINENTAL PROCONTACT TX TIRES, SIZE: 245/40R19 (NA). THE CONTACT STATED THAT BOTH FRONT TIRES SHOWED BUBBLES ON THE SURFACE. THE CONTACT STATED THAT THE TIRES WERE ORIGINAL FROM THE MANUFACTURER. THE VEHICLE WAS TAKEN TO TETON HYUNDAI (LOCATED AT 1350 YELLOWSTONE AVE, POCATELLO, ID 83201, (208) 417-0844) WHERE IT WAS DIAGNOSED THAT BOTH FRONT TIRES NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE VEHICLE AND TIRE FAILURE MILEAGE WAS 14,000. THE DOT NUMBER WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/09/2019",
        "dateOfIncident": "08/09/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242881,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WENT TO THE DEALER TO REPORT A SMELL COMING OUT OF THE ENGINE AS WELL AS A SQUEAKING NOISE WHEN THE ACCELERATOR IS PRESSED EITHER STATIONARY OR IN MOTION. THE DEALER REPRESENTATIVE TOLD ME THAT THERE IS A RECALL ON THE CAR BUT THEY DON'T HAVE A REMEDY YET. I READ ABOUT THE RECALL. ON MY QUESTION 'WHAT IS GOING TO HAPPEN IF THE ENGINE CATCHES FIRE?' THE REPRESENTATIVE TOLD ME THAT THEY HAVEN'T SEEN ANY CARS OF THIS MODEL TO CATCH FIRE YET. I WONDER WHAT NEEDS TO HAPPEN SO THE MANUFACTURER IS MORE PROACTIVE ADDRESSING AN ALREADY ISSUED RECALL WHEN A SEVERE ACCIDENT LIKE ENGINE FIRE COULD HAPPEN? SHOULDN'T NHTSA FORCE HYUNDAI IN THIS INSTANCE TO IMMEDIATELY REPAIR THE AFFECTED VEHICLES? DO WE NEED INJURIES AND DEATH IN ORDER TO TAKE CHARGE?",
        "vin": "KMHGN4JB8JU"
    },
    {
        "components": "STEERING,WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/31/2019",
        "dateOfIncident": "05/02/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240776,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRES DEVELOPED BUBBLES IN SIDE WALLS ON TWO TIRE. ALSO CAR WAS DIFFICULT TO CONTROL ON INTERSTATE HIGHWAYS FOR THE SPEED LIMIT. ALWAYS FIGHTING THE STEERING WHEEL TO STAY IN LANE. I AM 80 YEARS OLD AND THERE WERE MANY COMPLAINTS OF FLATS AND LOSE OF CONTROL THAT I DECIDED TO REPLACE ALL THE TIRES. I CONTACTED HYUANDAI AND ALSO CONTINNENTAL AND WAS GIVEN NO SATISFACTION.ON GOING COMPLAINTS ABOUT ROAD NOISE ON THE OLD TIRES AND THE NEW TIRES HAVE NOT BE RECTIFIED.. MECHANIC SAID LOW PROFILE TIRES ARE THE CAUSE OF BOTH. CAR WAS IN MOTION WHEN THE PROBLEMS OCCURRED",
        "vin": "KMHGN4JBXJU"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/28/2019",
        "dateOfIncident": "05/24/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210454,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE HAD A TIRE BUBBLE AT LESS THAN 6K MILES. NOW HAVE A GASH IN THE INNER SIDEWALL AT 22K MILES. THE QUALITY OF THESE TIRES ARE SUB PAR. UPON REMOVAL OF THE TIRE THAT THE INNER SIDEWALL BLEW, THERE WAS UNEVEN WEAR IN THE MIDDLE OF THE TIRE, THERE ARE NO ALIGNMENT PROBLEMS. THESE TIRES ARE A SAFETY HAZARD.",
        "vin": "KMHGN4JB1JU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/22/2019",
        "dateOfIncident": "04/19/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11202849,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "1. STATIONERY. APPROXIMATELY 50% OF THE TIME WHEN I SWITCH GEARS FROM REVERSE TO DRIVE THE GEAR SLIPS INTO NEUTRAL. IT TAKES 2-3 ATTEMPTS AND THEN FINALLY STAYS IN DRIVE. ONE TIME I HAD TO PUT CAR IN PARK AND THEN SHIFT INTO DRIVE BECAUSE IT WOULD NOT STAY IN DRIVE. THIS HAPPENS EVEN THOUGH I AM PRESSING FIRMLY ON THE BRAKE AND AM PUSHING THE SHIFT BUTTON.  2.  WHILE CAR IS MOVING.  3 TIMES SINCE I HAVE OWNED THIS VEHICLE THE FOLLOWING HAS HAPPENED WHILE I AM DRIVING ON CITY STREETS AND HIGHWAYS. WHEN I AM DRIVING, AND I GENTLY APPLY THE BRAKE IN ORDER TO MAKE A TURN AND THEN ACCELERATE IN ORDER TO COMPLETE THE TURN AND MERGE ONTO THE STREET OR HIGHWAY, WITHOUT MY REALIZING IT THE TRANSMISSION HAS SLIPPED INTO NEUTRAL AND THE VEHICLE WILL NOT ACCELERATE.   THE GENESIS DEALERSHIP AND GENESIS CORPORATE HAVE BOTH INDICATED IT'S MY IMAGINATION AND THAT NOTHING IS WRONG WITH THE VEHICLE.",
        "vin": "KMHGN4JE5JU"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/05/2019",
        "dateOfIncident": "02/23/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184380,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR WAS PURCHASED JULY 2018, SINCE THEN IVE HAD 3 FLAT TIRES.  THE TIRE ARE MADE BY CONTINENTAL TIRE COMPANY.  THE SALESMAN AT THE DEALERSHIP HAS INFORMED ME HE THEY HAVE EXPERIENCED MULTIPLE CASES OF FLAT TIRES FOR THE CONTINENTAL BRAND. ACCORDING TO THE DEALER SALESMAN \"THERE IS A FOAM LINING USE FOR VIBRATION DAMPENING WHICH HAS COMPROMISED THE INTEGRITY OF THE TIRE\". AT $ 400 PER TIRE, HE WAS BOTH CONCERNED AND HAPPY TO SEE SALES INCREASE IN THE SERVICE DEPARTMENT  ONE TIRE HAD A SIDE BULGE AND I DROVE WITHOUT NOTICING FOR WHO KNOWS HOW LONG,, THE OTHER 2 FLATS HAPPENED GOING OVER 1 POT HOLE.ON A SIDE STREET GOING 25 MPH.  AS A RESULT I WONT DRIVE THIS VEHICLE IF IM GOING SOMEWHERE WHERE I EXCEED 45 MPH DUE TO THE DANGER OF GETTING A FLAT GOING FASTER.",
        "vin": "KMHGN4JB2JU"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/22/2019",
        "dateOfIncident": "01/22/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171489,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "OEM TIRES ON MY 2018 G80 SPORT ALREADY WAS SIDEWALL BUBBLES ON THE FRONT TIRES WITH LESS THAN 10K MILES.  THESE ARE DEFECTIVE TIRES THAT SHOULD BE RECALLED.",
        "vin": "KMHGN4JB4JU"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/08/2019",
        "dateOfIncident": "01/07/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165860,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CONTINENTAL PRO CONTACT TIRES HAVE BLOWN OUT 3 TIMES.  THESE ARE DANGEROUS TIRES.  THE SIDEWALKS ARE WEAK.  THESE ISSUES HAVE BEEN EXPERIENCE WHILE DRIVING ON THE HIGHWAY.",
        "vin": "KMHGN4JB4JU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/16/2018",
        "dateOfIncident": "05/14/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161784,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE ARE SO MANY COMPLAINTS REGARDING THESE TIRES. I DEVELOPED A BUBBLE IN THE RIGHT FRONT TIRE AND DECIDED I DIDN'T WANT TO GO THROUGH MORE BUBBLES AND FLAT TIRES AS I AM 80 YEARS OLD. I BIT THE BULLET AND PURCHASED $1000.00 WORTH OF MICHELIN TIRES BEFORE THE CAR HAD 2000 MILES ON IT. I ALSO HAD TROUBLE KEEPING THE CAR IN A STRAIGHT LINE DRIVING ON THE INTERSTATE. THE ROAD NOISE FROM THIS TIRE IS ALSO UNEXCEPTIBLE FOR A LUXURY CAR.  THERE ARE MANY COMPLAINTS ABOUT THIS TIRE RACK WEBSITE AND THIS TIRE SHOULD REALLY BE RECALLED.",
        "vin": "KMHGN4JBXJU"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/06/2018",
        "dateOfIncident": "11/06/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11156518,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 GENESIS G80. WHEN THE WINDSHIELD WIPERS WERE ACTIVATED, THE CONTACT SMELLED WIPER FLUID INSIDE THE VEHICLE. THE DEALER (ROCKLAND HYUNDAI, 55 NY-303, WEST NYACK, NY 10994, (845) 402-8623) STATED THAT THIS WAS A NORMAL CONDITION. THE MANUFACTURER CLAIMED THAT THEY HAD NO KNOWLEDGE OF THE CONDITION. THE FAILURE MILEAGE WAS 9,800. *TT  CONSUMER STATED THE DEALER STATED OTHER CONSUMERS CLAIMED SAME ISSUE BUT THE DEALER REPORTED TO THE CONSUMER IT WAS NORMAL.*JB",
        "vin": "KMHGN4JE9JU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/30/2018",
        "dateOfIncident": "10/30/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144242,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "LANE KEEP ASSIST (LKA) MALFUNCTIONING INFREQUENTLY.  CAR FIGHTING MY CONTROL AND FORCING ME OUT OF LANE.  HAVE TO FIGHT TO STAY IN LANE.  EVEN AFTER DISENGAGING LKA OPTION CAR STILL FIGHTING MY CONTROL.  HAVE PULL OFF ONTO SIDE OF HIGHWAY; TURN CAR OFF; EXIT VEHICLE IN HEAVY TRAFFIC. REENTER CAR AND RESTART ENGINE TO DISENGAGE LKA.  HAVE TO NEVER REENAGE LKA TO AVOID DANGER.",
        "vin": "KMHGN4JE2JU"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/29/2018",
        "dateOfIncident": "09/28/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132223,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CONTINENTAL TIRES ARE CHEAP AND PRONE TO BLOWOUTS AND SIDEWALL BUBBLES. I GOT ONE BUBBLE AND DEALER SAID IT IS A KNOWN PROBLEM WITH THESE TIRES.",
        "vin": "KMHGN4JBBJU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/29/2018",
        "dateOfIncident": "06/29/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104746,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 6/29/18, APPROXIMATELY 9:30AM, TEMP 85. GOING SOUTH ON I-25, AT 70MPH,  I EXPERIENCED A RAPID EXPLOSION OF MY SUNROOF. IT EXPLODED OUTWARD,  ALTHOUGH SOME GLASS CAME INTO THE CABIN. NO ONE WAS INJURED.",
        "vin": "KMHGN4JE5JU"
    },
    {
        "components": "STEERING,SUSPENSION,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/22/2018",
        "dateOfIncident": "02/20/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103507,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "1)AUTONOMOUS EMERGENCY BRAKING (AEB) WITH PEDESTRIAN DETECTION - LOOKS LIKE IT IS WORKING IN 20-30% OF CASES, NEVER WORKING WITH PEDESTRIANS. SERVICE DECLARED EVERYTHING FINE, BUT REJECT DEMONSTRATE THIS.  2)LINE KEEP ASSISTS - PERIODICALLY DEPARTURE CAR FROM THE LINE, IT HAPPENS DURING PERFECT WEATHER CONDITIONS AND ROAD MARKUP.   3) VIBRATION IS AT THE VERY HIGH LEVEL, PERIODICALLY INCREASED AND SOME TIME GOES AWAY, EVEN WHEN CAR STAY. BY MEASURE 4-5 TIMES GREATER THAN IN ANY OTHER CAR. SERVICE TOLD - BECAUSE IMPROPER ENGINE MOUNT, THEY CAN'T FIX ANY INFORMATION FROM THE MANUFACTURER.  4)CASTER IS OUT OF SPECS, SERVICE TOLD ALL G80 COMES FROM THIS DEFECT FROM THE FACTORY AND REJECT TO ADJUST    -- DRIVING 5-6 DIFFERENT GENESIS G80 2017-2018 DURING LAST 4 MONTH, WHILE MY CAR WAS ON SERVICE AND ISSUE 1 AND 2 AND 3  CONTINUOUSLY REPRODUCED ON ALL OF THEM",
        "vin": "KMHGN4JB9JU"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/23/2018",
        "dateOfIncident": "05/20/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097610,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAS HAD TWO TIRE SIDEWALL FAILURES (RIGHT FRONT AND REAR) RESULTING IN LOSS OF TIRE PRESSURE AND THE NEED TO REPLACE BOTH TIRES (CONTINENTAL PROCONTACT TX).  ONE FAILURE OCCURRED WHILE THE VEHICLE WAS IN MOTION.  THE OTHER WAS DETECTED WHILE PARKED.  THERE WAS NO OTHER DAMAGE OR INJURY.   THERE WAS LESS THAN 6000 MILES ON THE TIRES.",
        "vin": "KMHGN4JB9JU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/31/2018",
        "dateOfIncident": "03/19/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11082313,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2018 GENESIS G80 SPORT COMES WITH THE CONTINENTAL PRO CONTACT TX  TIRES. THESE TIRES HAVE A LOT OF ISSUES WITH THE SIDEWALLS. I HAD MY NEW CAR FOR LESS THAN 1000 MILES AND I ALREADY HAD TO CHANGE TWO OF THE TIRES.",
        "vin": "KMHGN4JB8JU"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/29/2018",
        "dateOfIncident": "03/20/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081959,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WAS PARKED IN A PARKING LOT WHEN I DISCOVERED THE RIGHT FRONT CONTINENTAL PROCONTACT TX OEM TIRE HAD A 21/2\" GASH IN THE SIDEWALL. I THOUGHT THIS STRANGE, BUT I HAD THE TIRE REPLACED.   WHEN I RETURNED HOME AND DID SOME RESEARCH I DISCOVERED THAT SIDEWALL FAILURES ARE A KNOWN ISSUE WITH THESE TIRES. I WILL SAY THAT I HAD HIT A POTHOLE, WHILE DRIVING THIS CAR, WEEKS BEFORE MY TIRE FAILED. I HAVE HIT MANY POTHOLES OVER THE YEARS, WHILE DRIVING OTHER CARS AND HAVE NEVER HAD A TIRE FAILURE. I BELIEVE THERE IS A FLAW IN THIS TIRE.   THERE ARE A NUMBER OF REVIEWS ON THE INTERNET IN REGARDS TO THIS SIDEWALL ISSUE. I'VE INCLUDED SOME FROM A GENESIS OWNER'S GROUP FORUM. I'VE ALSO INCLUDED MY REPAIR RECEIPT AS EVIDENCE THAT I HAD TO REPLACE THE TIRE.   EVEN THOUGH THE TIRES HAD LESS THAN 10K MILES ON THEM, I'VE DECIDED TO REPLACE ALL OF THE CONTINENTAL TIRES WITH MICHELIN TIRES DUE TO MY CONCERNS ABOUT THE SAFETY OF THIS BRAND OF TIRE.  I DO BELIEVE AN INVESTIGATION OF THIS TIRE IS WARRANTED, DUE TO THE NUMBER OF COMPLAINTS ABOUT THE WEAKNESS OF THE SIDEWALL.",
        "vin": "KMHGN4JB8JU"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/17/2018",
        "dateOfIncident": "01/03/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073397,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "GENESIS",
                "productModel": "G80",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS PULLING INTO THE DRIVEWAY AND PUT ON THE BRAKE, AND THE BRAKES DID NOT RESPOND. THE CAR CRASHED THRU THE GARAGE DOOR.  I PUT THE CAR IN REVERSE, BUT IT DIDN'T RESPOND. IT TOOK ABOUT 5 SECONDS FOR IT TO ENGAGE. THEN ONCE IT ENGAGED IN REVERSE, IT WAS OUT OF MY CONTROL, AS THE CAR SHOT BACK AT A HIGH SPEED, BOUNCED UP A CURB AND HIT THE NEIGHBOR'S DECK. AGAIN, THE BRAKES WERE NOT RESPONDING TO STOP THE CAR. THERE WERE BURN RUBBER MARKS SHOWING THE SPEED OF THE REVERSE.  I FELT THE CAR HAD CONTROL NOT ME. THIS TIME IT ALSO TOOK SEVERAL SECONDS FOR THE CAR TO ENGAGE IN DRIVE. WHEN IT DID, THE CAR SHOT FORWARD BACK INTO THE GARAGE AND ONLY STOPPED BECAUSE IT COULD GO NO FURTHER DUE TO THE COLLAPSED GARAGE DOOR AND THE CONTENTS UNDERNEATH. THE BRAKES HAD NOT RESPONDED AGAIN. I WAS ABLE TO PUT THE CAR IN PARK AFTER THIS RICOCHET EVENT.  I BELIEVE THE CAR HAS A MANUFACTURING MALFUNCTION AND IS DANGEROUS NOT JUST TO ME BUT TO EVERYONE ELSE ON THE ROAD, BE IT DRIVING OR WALKING. *TT    *CN",
        "vin": "KMHGN4JE3JU"
    }
]