[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/02/2021",
        "dateOfIncident": "09/01/2021",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439033,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Grand Design Reflection. The contact stated that during maintenance of the vehicle, he noticed that the driver’s side rear upper shackle pin on the Dexter trailer axle was not drilled to allow lubricant grease to enter, causing the pin and spring to dry out. The vehicle was not taken to a dealer. The vehicle was not repaired. The manufacturer was notified of the failure. The approximate failure mileage was 9,000. Consumer contacted the RV manufacturer, Grand Design, who suggested he follow up with axle manufacturer, Dexter.",
        "vin": "573fr332xj3"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/28/2021",
        "dateOfIncident": "05/09/2021",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422612,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "While towing my rv, the weld that secures the rear axle springs broke. This weld was located on the right rear side of the frame and it snapped completely off the Lippert frame. It allowed the rear axle to move forward and the two tires on the right side contacted each other and the tires started to disintegrate. A tire on the left side was forced out of alignment and the tire shaved rubber until the steel belts were visible. These tires were high grade tires with less than 5000 miles on them.  I stopped for fuel and noticed the damage. If I had continued the tires would surely have had a catastrophic failure shortly. This would have certainly resulted in a loss of control and a probable crash at highway speed. Since the tires were rubbing it is also likely a fire could have resulted.  I was unable to have the vehicle moved to a repair location and no mobile rv techs would respond since I was in a remote location. I had to hire a local welder to reattach the weld and reinforce the frame on both sides.  In speaking with my insurance company it was determined that this is not an unusual problem with welds breaking.  The vehicle was not inspected by police as no other individuals or property was involved. Photos of the damage and broken weld were sent to Grand Design and Lippert, the manufacturer of the frame.  Photos taken of the repairs performed by the welder were also sent to them. In addition to repairing the broken weld, I had the welder reinforce the left side of the frame holding the axle springs in place so that it would not fail. The unit is now much safer than it was before the repair.  There were no warning lights or symptoms for this problem. I stopped purely by chance for fuel and noticed the steel belts protruding through my tires and this is the only thing that stopped a catastrophic failure and probable crash. The trailer has never been overloaded, and was never driven faster than 65. It has never been in an accident.",
        "vin": "573FR3327J3"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/24/2019",
        "dateOfIncident": "05/23/2019",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209790,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUSPENSION HANGER, THE PIECE THAT HOLDS LEAF SPRING AND IS ATTACHED TO THE FRAME OF THE TRAILER, BROKE CLEAN THROUGH ON INBOARD REAR PASSENGER SIDE OF THE VEHICLE.  THE SUSPENSION FAILURE WAS DISCOVERED WHILE PARKED AND DURING ROUTINE LUBRICATION OF THE SUSPENSION WET BOLTS.  THE COMPONENT IS AN INVERTED U BRACKET, THE TOP OF WHICH ATTACHES TO THE TRAILER FRAME, THE ARMS OF WHICH, IN CONJUNCTION WITH A WET BOLT PROVIDE THE MOUNTING LOCATION FOR THE REAR EYE OF THE LEAF SPRING.  ONE LEG OF THIS U BRACKET, AND CONSEQUENTLY ONE END OF THE BOLT ATTACHING THE LEAF SPRING TO THE BODY COMPLETELY FAILED, BREAKING CLEAN AWAY FROM THE FRAME.    UPON FURTHER INSPECTION THE REAR DRIVER SIDE LEAF SPRING BRACKET HAS DEVELOPED A CRACK, BUT HAS NOT PROPAGATED THROUGH THE ENTIRE ARM OF THE BRACKET.    FORTUNATELY THIS SUSPENSION FAILURE WAS DISCOVERED WHILE THIS 10,000LB VEHICLE WAS PARKED AND FAIRLY EARLY AS THE ARM OF THE SUSPENSION HAD NOT YET HUNG TO A HANGING POSITION.  WITH THE OTHER HANGER BEGINNING TO FAIL, THIS VEHICLE WOULD POSE A SIGNIFICANT HAZARD TO PERSONS AND PROPERTY WHILE TRAVELING AT HIGHWAY SPEEDS.    THE VEHICLE IS LESS THAN 2 YEARS OLD, IT HAS BEEN TRAILERED LESS THAN 3000 MILES, HAS BEEN LOADED WITHIN GVWR LIMITS, HAS NEVER BEEN IN AN ACCIDENT, HAS SUSTAINED NO BODY DAMAGE. *DT    CONSUMER CONTACTED MANUFACTURER OF THE FRAME AND SUSPENSION COMPONENTS.  CARFAX CANNOT PROCESS THIS REQUEST. *JB",
        "vin": "573FR3520J3"
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/21/2018",
        "dateOfIncident": "08/20/2018",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121239,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "GRAND DESIGN REFLECTION OPTIONS ASSEMBLED AT MANUFACTURER OR DEALER ARE NOT INCLUDED ARE NOT INCLUDED IN 9556# UVW OR SUBTRACTED FROM CCC LABEL OF 1379# AS REQUIRED BY AMENDED FEDERAL MOTOR VEHICLE SAFETY STANDARD (FMVSS) NOS. 110 AND 120 TO ADDRESS THE PROBLEM OF MOTOR HOME AND RECREATION VEHICLE TRAILER OVERLOADING. THE FINAL RULE TOOK EFFECT ON JUNE 2, 2008.  IF OPTIONS INSTALLED BY MANUFACTURER OR DEALER AT TIME OF SALE WHEN OPTIONS EXCEED 165# WHICH IS 1.5% OF 10,995 LBS GVWR THE CCC TAG NEEDS TO BE MODIFIED OR REPLACED.    MANUFACTURER SHIPPED OPTIONS DINETTE WITH 4 CHAIRS, 2ND A/C, 2ND AWNING.  DEALER ADDED 2 SLIDE TOPPERS, AUTOMATIC LIFT SYSTEM    THE SUM OF EACH ITEM EXCEEDS 165# THRESHOLD, THUS PLACING OWNER AT RISK OF EXCEEDING 10,995# THUS OVERLOADING AXLE AND SPRINGS.      GRAND DESIGN REQUIRES OWNER TO WEIGH TRAILER BEFORE WARRANTYING BENT AXLES OR SPRINGS AND DENY'S CLAIM IF IN EXCESS OF 10,995# BLAMING CUSTOMER FOR EXCEEDING THE CARGO WEIGHT.  IN OUR CASE OUR TRAILER WAS OVER BY 280# WHICH RESULTED IN INSIDE TIRE WEAR, 2 BENT AXLES AND SPRINGS AFTER APPROXIMATELY 11,500 TRAILER MILES ACROSS US AND ALASKA BETWEEN 12/27/2017 THROUGH 8/20/2018.  PURCHASE 2018 GRAND DESIGN 315RLTS ON 12/27/2017 THUS UNDER 1 YEAR WARRANTY.      GRAND DESIGN CLAIMS ROADS IN ALASKA ARE DAMAGING TO RV WITH EXCESSIVE WEIGHT DUE TO PERMAFROST THUS DENYING THE CLAIM.  CHALLENGING THE AMENDED STANDARD WAS NOT FOLLOWED AND WEIGHT ARE NOT PROVIDED ANYWHERE ON GRAND DESIGN WEBSITE OR DOCUMENTATION CUSTOMERS ARE UNAWARE TO SUBTRACT OPTIONS FROM CARGO WEIGHT AT TIME OF PURCHASE. GRAND DESIGN OFFERED HEAVIER SPRINGS, BUT I WAS RESPONSIBLE FOR LABOR AND AXLES.  GRAND DESIGN HAS NOT PROVIDED WEIGHT OF OPTIONS OR ORIGINAL WEIGHT CERTIFICATION TO UNDERSTAND WHAT IS INCLUDED IN ORIGINAL CERTIFICATION.    REPAIRED ON 8/20/2018 AT OWNERS EXPENSE.  TIRE MANUFACTURER DID ACCEPT WARRENTY",
        "vin": "573TR3826J3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/17/2017",
        "dateOfIncident": "07/14/2017",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005866,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "FOUND SEVERAL PROBLEMS ONLINE INDICATING THAT GREASE LEAKS PAST THE AXLE SEALS AND CONTAMINATES THE BRAKES.  MY WHEELS ARE SHOWING SIGNS OF GREASE AND IT IS ONLY A MATTER OF TIME BEFORE THE BRAKES LOSE EFFECTIVENESS.  PROBLEM IS THAT THE CONDITION WILL GET PROGRESSIVELY WORST AND THE USER MAY NOT NOTICE THE LOSS OF BRAKE EFFECTIVENESS UNTIL IT IS TOO LATE.",
        "vin": "573FR3527J3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/10/2017",
        "dateOfIncident": "05/22/2017",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10994259,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "GREASE LEAKING FROM AXLE SEAL ONTO BRAKE DRUMS ON ALL FOUR WHEELS CAUSING INEFFECTIVE BRAKES.  LIPPERT AXLES",
        "vin": "573TR3828J3"
    }
]