[
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/12/2021",
        "dateOfIncident": "08/12/2021",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428806,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "IMAGINE",
                "productYear": "2018",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Ewr Volpe Acme Inc.",
                "productMake": "TBD",
                "productModel": "TBD",
                "productYear": "9999",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Grand design Imagine. The contact received a recall notification for NHTSA Campaign Number: 21V393000 (Equipment) however, the dealer informed the contact that the part for the recall repair was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was not notified of the issue. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "573te3025j6"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/28/2019",
        "dateOfIncident": "10/26/2019",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271443,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "IMAGINE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 GRAND DESIGN IMAGINE TRAILER. THE CONTACT STATED THAT DUE TO THE LEAF SPRING FLATTENING OUT, THE TIRES WERE RUBBING AGAINST THE BOTTOM OF THE TRAILER. THE CONTACT STATED THAT THE FAILURE SHOULD NOT OCCUR BECAUSE THE TRAILER WAS NOT OVERLOADED. THE VEHICLE WAS NOT TAKEN TO A DEALER OR AN INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND INFORMED THE CONTACT THAT THERE WAS NO RECALL ASSOCIATED WITH THE FAILURE. NO FURTHER ASSISTANCE WAS OFFERED. THE VEHICLE WAS NOT REPAIRED. *DT",
        "vin": "573TE3229J6"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/23/2019",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257381,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "IMAGINE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 GRAND DESIGN IMAGINE 2600 RV. AFTER TRAVELING APPROXIMATELY 5,000 MILES, THE CONTACT DISCOVERED THAT BOTH OF THE VEHICLE'S AXLES HAD LOST THEIR CAMBERS. THERE WERE NO WARNING INDICATORS FOR THE AXLE MALFUNCTION. THE MANUFACTURER WAS INFORMED OF THE FAILURE AND AGREED TO COVER THE COST TO REPLACE BOTH THE AXLE AND SPRING SETS. THE VEHICLE WAS REPAIRED BY AN INDEPENDENT MECHANIC AND THE COST WAS COVERED BY THE MANUFACTURER. AFTER THE VEHICLE WAS REPAIRED, THE CONTACT TRAVELED ANOTHER 6,000 MILES AND NOTICED THAT THE REAR DRIVER'S SIDE TIRE BEGAN TO WEAR SIGNIFICANTLY AND THERE WAS ADVANCED TIRE WEAR ON THE OTHER THREE TIRES. THE CONTACT TOOK THE TRAILER TO AN INDEPENDENT MECHANIC AND WAS INFORMED THAT BOTH AXLES WERE BENT AND HAD FAILED AGAIN. ALSO, ALL FOUR WHEELS WERE OUT OF ALIGNMENT. THE CONTACT HAD THE WHEELS ALIGNED AND ALL FOUR TIRES REPLACED. THE CONTACT RESEARCHED THE COST AND DISCOVERED THAT GRAND DESIGN MANUFACTURED VEHICLES WITH WHAT HE BELIEVED WERE LOW COST, POORLY DESIGNED SPRINGS. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AGAIN AND INFORMED THE CONTACT THAT THEY COULD REPAIR THE VEHICLE AGAIN. THE VEHICLE WAS REPAIRED AT THE CONTACT'S EXPENSE. THE FAILURE MILEAGE WAS APPROXIMATELY 5,000.",
        "vin": "573TE3020J6"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/23/2019",
        "dateOfIncident": "09/13/2019",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257504,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "IMAGINE",
                "productYear": "2018",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Lionshead Specialty Tire & Wheel LLC",
                "productMake": "LIONSHEAD",
                "productModel": "RADIAL ST",
                "productYear": "9999",
                "size": "225/75R15",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 GRAND DESIGN IMAGINE TRAVEL TRAILER EQUIPPED WITH LIONSHEAD WESTLAKE TIRES, SIZE: SP225/75/R15 (NA). WHILE DRIVING 64 MPH, THE FRONT PASSENGER SIDE TIRE BLEW OUT WITHOUT WARNING. THE FAILURE DAMAGED THE MARKER LIGHTS ON THE SIDE OF THE TRAILER AS WELL AS THE PASSENGER SIDE FENDER. ALSO, THE WIRING HARNESS FOR THE ELECTRIC SLIDE WAS RIPPED APART DUE TO THE SUDDEN TIRE FAILURE. THE CONTACT WAS ABLE TO MOVE THE TRAILER TO A PARKING LOT AND CALLED A ROADSIDE TIRE SERVICE TO HAVE THE TIRE REPLACED. THE CONTACT FILED COMPLAINTS WITH VARIOUS AGENCIES, INCLUDING THE MANUFACTURER'S WEBSITE. SHORTLY AFTER THE INITIAL BLOW OUT, THE TIRE BLEW OUT AGAIN ON THE SAME SIDE. AFTERWARDS, THE CONTACT HAD ALL FOUR TIRES REPLACED. THE TIRE AND VEHICLE FAILURE MILEAGE WAS 12,000.",
        "vin": "573TE3222J6"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/27/2019",
        "dateOfIncident": "08/09/2019",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11251828,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "IMAGINE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 GRAND DESIGN IMAGINE TRAILER. WHILE THE CONTACT WAS PERFORMING A SAFETY INSPECTION OF THE TRAILER, SHE NOTICED THAT THE REAR TIRES WERE BALD. THE VEHICLE WAS TAKEN TO D AND G CUSTOM CONVERSIONS, INC. (383 BURGNERS ROAD, CARLISLE, PA 17015, 717-249-8875) WHERE IT WAS DIAGNOSED THAT THE AXLES WERE FAULTY. THE MANUFACTURER WAS CONTACTED AND STATED THAT THE TRAILER REPAIR CENTER WOULD BE PROVIDED WITH THE REQUIRED APPROVAL FOR REPAIRS. WHEN THE REPAIR CENTER CALLED FOR APPROVAL, NO REMEDY WAS PROVIDED. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/06/2019",
        "dateOfIncident": "05/18/2018",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194273,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "IMAGINE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SPRINGS GOING FLAT OR FAILING. SEVERAL REPORTS ON GD FACEBOOK PAGE. I THINK IT NEEDS TO BE LOOKED INTO. CALLED GD FOR HELP BUT NO RESULTS. THEY CLAIM THEY HAD PROBLEMS WITH DEXTER AXLES BUT NOT LIPPERT AXLES. I CALLED LIPPERT AND THEY PRETTY MUCH SAID THERE HAS BEEN ISSUES BUT THEY SEND GD WHAT THEY ASK FOR. *DT    CONSUMER STATED FLAT SPRINGS WERE REPLACED.*JB",
        "vin": "573TE3225J6"
    },
    {
        "components": "EQUIPMENT,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/20/2018",
        "dateOfIncident": "05/21/2018",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102916,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "IMAGINE",
                "productYear": "2018",
                "type": "Vehicle"
            },
            {
                "manufacturer": "DEXTER AXLE",
                "productMake": "DEXTER AXLE",
                "productModel": "BRAKE ACTUATOR",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "IN DECEMBER 2017, I PURCHASED A GRAND DESIGN IMAGINE TRAVEL TRAILER, MODEL 2500RL.  WHEN I TOWED THE TRAILER, I NOTICED THE TRAILERS BRAKES WOULD NOT STOP THE TRAILER EVEN WHEN I ADJUSTED THE BRAKE CONTROLLER GAIN TO MAXIMUM.  THINKING THE TRAILER BRAKES JUST NEEDED ADJUSTMENT, ON MAY 21, 2018, I TOOK THE TRAILER TO THE SELLING DEALER FOR SERVICE.  THE DEALER INFORMED ME THAT THE BRAKES DID NOT NEED ADJUSTMENT.  THE PROBLEM WAS THAT THE BRAKES ON THE FRONT AXLE OF THE DOUBLE AXLE TRAILER WERE NOT CONNECTED TO THE POWER SOURCE THAT OPERATES THE BRAKES.  IN OTHER WORDS, THE BRAKES WERE ONLY 50% CONNECTED.  THE DEALER DETERMINED THAT THE BRAKES WERE WIRED CORRECTLY.  I WAS TOWING A 7500 POUND TRAILER WITH IMPROPERLY CONNECTED BRAKES.  THIS TRAILER SHOULD HAVE NEVER LEFT THE FACTORY WITH INOPERATIVE BRAKES.  THE BRAKES WERE EITHER NEVER CONNECTED OR THE CONNECTORS ARE DEFECTIVE.  IN MY VIEW THIS IS A SERIOUS SAFETY ISSUE.  HOW MANY OTHER TRAVEL TRAILERS FROM GRAND DESIGN HAVE BEEN PLACED IN SERVICE WITH IMPROPERLY CONNECTED BRAKES.  THE BRAKES ON MY TRAVEL TRAILER HAVE BEEN FIXED, BUT ONLY BECAUSE I NOTICED THE POOR BRAKING AND TOOK THE TRAILER TO THE DEALER FOR SERVICE.  GRAND DESIGN SHOULD BE CALLED TO TASK ON THIS PROBLEM.  THEY ARE EITHER NEGLIGENT IN THEIR POST PRODUCTION INSPECTIONS OR THE PARTS USED TO CONNECT THE BRAKE WIRING IS DEFECTIVE. *TT",
        "vin": ""
    }
]