[
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "01/10/2022",
        "dateOfIncident": "01/10/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446971,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The automated braking system deployed at maximum braking without warning 3 times in 60 miles of highway driving (this was the first time I had driven this car on a highway). The road in front was completely clear of both cars and debris for several miles, it was sunny without glare, and the road was dry. The one common factor was that all 3 times occurred while passing a semi truck, as I pulled level with the cab. I was thrown forward against the seatbelt while the car slammed on its brakes while beeping and flashing the orange 'BRAKE' warning, dropping from highway speeds by about 25 mph before I was able to intervene. Thankfully there was also no traffic behind me, so I was able to recover control of the vehicle, but otherwise this would have absolutely caused a collision.  Prior to this incident, there were no warning signs or indications of a problem. I had purchased the vehicle as a Certified Pre-Owned vehicle less than a week before, at which point it had been thoroughly inspected by the dealership and certified as free from issues.  I have reported the issue to the dealership, but from cursory searching online it appears this is a known, unremediated issue - a quote from Wilde East Towne Honda (not my dealer): \"You may find that CMBS is giving you notifications and even feedback when no threat is detected. That is normal on occasions...CMBS picks up 'optical illusions' occasionally\"",
        "vin": "3HGGK5H85JM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/25/2021",
        "dateOfIncident": "09/14/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441652,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "My car's odometer and fuel display gauge is failing under cold weather. This started happening  after just 29K miles. It jitters or displays incomplete numbers, or freezes up. When that happens, I can't see how much fuel I have in the car, for example, or how many miles are on the odometer. This is happening more frequently, which is dangerous.",
        "vin": "3HGGK5H4XJM"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/24/2021",
        "dateOfIncident": "06/21/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430269,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I purchased a new Honda Fit in 2018. In November 2019, at 31,000 miles several indicator lights came on. The check engine, TPMS, Vehicle Stability assist, Electric Power System. The car was running smoothly but I was told by a Honda dealer there was excessive carbon build up. The cost to clean it out would be $500. They claimed that because this was caused by an outside element and a part had not failed that the warranty would not cover this. I fought it and they did a one-time courtesy repair at no charge.  June 2021, 51,000 miles and the same thing happened all over again. Car running smoothly, no hesitation, no misfires. Different Honda dealer told me it was excessive carbon build up on manifold and this time it would be $604 plus tax. I asked if there was a maintenance service that would prevent this from happening and I was told no. That the fuel system service offered does not reach the areas of the engine where the carbon builds up. This is a problem with Direct Injection engines.  Clearly there is a flaw in the direct injection engine design that Honda has known about for years and does not want to take responsibility for. This is unacceptable and Honda is committing consumer fraud by knowingly selling a flawed product that jeopardizes the safety of their customers.  I do not feel safe driving this car with these failures in the engine, not knowing when this problem is going to happen again and facing an expensive repair bill every time it does happen. Not to mention the inconvenience of being without a car for several days while it is being repaired.   I have documentation to back all of this up.",
        "vin": "3HGGK5H40JM"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/09/2021",
        "dateOfIncident": "05/11/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428378,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I am a 76 year old Minnesota woman who lives on a limited budget. I purchased a used 2018 Honda Fit from Richfield Bloomington Honda (RBH) on 04-07-21.  Initially the tachometer & speedometer gauges could easily be read during both day and night driving. Within about a month, during daylight driving these gauges became dark and very difficult to read – especially while driving with sunglasses during the day to protect my eyes from UVA and UVB rays.  Other Honda Fit owners have experienced the same issue. Here’s a post I found on the internet: “I traded in my 2015 Fit last year for a 2017 Fit Sport. I seem to recall that, on the 2015, when in \"daylight mode\", the speedo/tach/fuel gauges were automatically brightly lit at full brightness. I've noticed lately that on my 2017, only the fuel gauge lights up brightly in daylight. The tach and speedo remain completely dark and barely readable. Honda dealer says nothing is wrong. Is this normal?”  RBH has implied that the illumination problem I experience with my speedometer is somehow my fault – either because I wear the wrong sunglasses or that I shouldn’t wear any sunglasses when I drive. My 2018 Honda Fit is not safe when I take my eyes off a crowded hwy for 2-3 seconds while trying to discern my speed from a dark, barely readable speedometer.  This could lead to a tragic accident! I  met with several RBH reps re this illumination problem and sent follow up emails which were ignored. Because pf my low income, I can’t afford to fix the gauge problem and rely on my warrantee. Today only 200 miles are left before my warrantee ends, and RBH is in no hurry to fix the gauge problem. Because this is a safety issue, I want the speedometer fixed by RBH at no cost to me even if my warrantee ends due to RBH delays. I need RBH to provide me with a free loaner car until the speedometer on my 2018 Honda Fit is fixed and deemed safe to drive by an independent auto mechanic.",
        "vin": "3HGGK5H41JM"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/09/2021",
        "dateOfIncident": "05/11/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428400,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I am a 76 year old Minnesota woman who lives on a limited budget. I purchased a used 2018 Honda Fit from Richfield Bloomington Honda (RBH) on 04-07-21.  Initially the tachometer & speedometer gauges could easily be read during both day and night driving. Within about a month, during daylight driving these gauges became dark and very difficult to read – especially while driving with sunglasses during the day to protect my eyes from UVA and UVB rays.       Other Honda Fit owners have experienced the same issue. Here’s a post I found on the internet: “I traded in my 2015 Fit last year for a 2017 Fit Sport. I seem to recall that, on the 2015, when in \"daylight mode\", the speedo/tach/fuel gauges were automatically brightly lit at full brightness. I've noticed lately that on my 2017, only the fuel gauge lights up brightly in daylight. The tach and speedo remain completely dark and barely readable. Honda dealer says nothing is wrong. Is this normal?”       RBH has implied that the illumination problem I experience with my speedometer is somehow my fault – either because I wear the wrong sunglasses or that I shouldn’t wear any sunglasses when I drive. My 2018 Honda Fit is not safe when I take my eyes off a crowded hwy for 2-3 seconds while trying to discern my speed from a dark, barely readable speedometer.  This could lead to a tragic accident!        I met with several RBH reps re this illumination problem and sent follow up emails which were ignored.  Because pf my low income, I can’t afford to fix the gauge problem, and I rely on my warrantee. Today only 200 miles are left before my warrantee ends, and RBH is in no hurry to fix the gauge problem. Because this is a safety issue, I want the speedometer fixed by RBH at no cost to me even if my warrantee ends due to RBH delays. I need RBH to provide me with a free loaner car until the speedometer on my 2018 Honda Fit is fixed and deemed safe to drive by an independent auto mechanic.",
        "vin": "3HGGK5H41JM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/04/2021",
        "dateOfIncident": "05/03/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419596,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving car the electrical system failed with all safety lights on dashboard turning on. When system goes off the ABS braking system, traction control, and power steering fails. Also noted engine misfiring. This happened when driving on freeway. I have brought car into Honda 2 times and they have not been able to figure it out. Car is at 42000 miles only. Complaint filed to Honda of America and it has been 2 weeks without response.",
        "vin": "3HGGK5H87JM"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/07/2021",
        "dateOfIncident": "05/07/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415607,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "PAINT IS CHIPPING AND PEELING.",
        "vin": "3HGGK5H86JM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/19/2021",
        "dateOfIncident": "04/16/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11412905,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL THE WARNING LIGHTS THAT SIGNAL PROBLEMS WITH THE CAR CAME ON INCLUDING THE BRAKE SYSTEM LIGHTS (TIRE PRESSURE, EMISSIONS, CHECK ENGINE, ETC,) DEALER SAID IT WAS DUE TO A FAULTY FUEL INJECTOR DESPITE THIS IS A BRAND NEW CAR WITH NO HISTORY OF ACCIDENTS WHATSOEVER.",
        "vin": "3HGGK5H8XJM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/12/2021",
        "dateOfIncident": "04/11/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407817,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF FUEL INJECTORS AT 3 YEARS OLD AND 54K MILES.  STARTED CAR IN MORNING AND GOT WARNING LIGHTS, USED OBDII TO FIND OUT THERE WERE MISFIRES, TOOK TO DEALER.  WANTS MORE THAN $2000 TO REPAIR.",
        "vin": "3HGGK5G47JM"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/29/2021",
        "dateOfIncident": "03/29/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405371,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "PAINT IS CHIPPING ON THE BODY",
        "vin": "3HGGK5H80JM"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/10/2021",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400096,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PAINT IS DEFECTIVE AND KEEPS PEELING OFF AND EASILY GETS DAMAGED FROM EVER JUST CAR WASHES.",
        "vin": "3HGGK5H87JM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/02/2021",
        "dateOfIncident": "06/04/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398694,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE  RATTLE  AT COLD ENGINE  START UP.  TROUBLE SHOOTED AS A BAD ACTUATOR AND APPARENTLY  AN ONGOING  PROBLEM",
        "vin": "3HGGK5G61JM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/27/2021",
        "dateOfIncident": "01/23/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390347,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "LAST WEEK THE MILEAGE/GAS SCREEN ON MY HONDA FIT GLITCHED A COUPLE OF TIME WHILE I WAS DRIVING DOWN THE ROAD.  IT THEN WENT BACK TO NORMAL.  A COUPLE OF DAYS LATER I WENT OUT TO START THE CAR AND THE SCREEN WAS BLANK.  AFTER ABOUT 10 SECONDS THE SCREEN CAME ON AN PERFORMED NORMALLY FOR THE REST OF THE DAY.  TODAY, I WENT OUT TO START THE CAR AND THE SCREEN WAS BLANK, A FEW SECONDS LATER THE SCREEN DISPLAYED WHAT LOOKED LIKE EVERY LIGHT IT COULD AND THE SCREEN HAD ALL KINDS OF GIBBERISH ON IT.  THE SCREEN THEN WENT BLANK AND CONTINUED TO DO THIS SWITCH BETWEEN GIBBERISH AND BLANK FOR APPROXIMATELY 7 MINUTES . I NEEDED TO KNOW THE MILEAGE ON THE VEHICLE BUT IT WILL NOT DISPLAY THE MILEAGE OR ANY OTHER READABLE INFORMATION.  I CONTACT MY LOCAL HONDA DEALERSHIP WHO ADVISED THEY WOULD NOT BE ABLE TO DETERMINE THE MILEAGE WITHOUT THAT SCREEN WORKING AND THEREFORE WOULD NOT BE ABLE TO TELL ME IF MY CAR IS UNDER WARRANTY OR NOT IN ORDER TO HAVE IT FIXED.  THE CAR IS BETWEEN 30,000 AND 40,000 MILES AND HAS NEVER HAD ANY DAMAGE OR BEEN INVOLVED IN ANY COLLISIONS. THIS HAS NEVER HAPPENED BEFORE UNTIL LAST WEEK AND EVERY TIME I HAVE HAD THE PROBLEM, THE OUTSIDE TEMPERATURE WAS BELOW 45 DEGREES FAHRENHEIT.  UNKNOWN WHAT CREATED THIS UNSAFE CONDITION. HOWEVER, WHEN THIS SCREEN IS NOT WORKING, I HAVE NO WAY OF KNOWING HOW MUCH GAS I HAVE, THE RPMS, THE MILEAGE ON THE VEHICLE, AND HOW MANY MILES PER GALLON MY CAR IS USING.  THE OUTSIDE TEMPERATURE IS ALSO NOT SHOWN. BECAUSE IT DOES NOT SHOW MY MY MILEAGE OR GAS GAUGE, I DON'T KNOW IF IT WILL STILL TRIGGER THE LOW FUEL LIGHT WHEN MY FUEL IS LOW.  PLEASE HELP!",
        "vin": "3HGGK5H45JM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/13/2021",
        "dateOfIncident": "01/13/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387926,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL AND MILEAGE GAUGE MOSTLY FAILS TO DISPLAY. IT MAKES ME FEEL UNSAFE WHEN I CANNOT SEE HOW MUCH FUEL I HAVE WHILE DRIVING. THIS STARTED TO HAPPEN ON 12/18/2020 AT RANDOM TIMES WHENEVER THE CAR IS PARKED AND WHILE DRIVING, USUALLY EARLY IN THE DAY WHEN IT IS COLD. IT SOMETIMES RESOLVES TEMPORARILY OR NOT AT ALL WHEN THE PANEL RESET BUTTON IS PRESSED. WHENEVER THE CAR IS TAKEN TO THE HONDA SERVICE REPAIR, THE MILEAGE WOULD NOT APPEAR, WHICH WAS SEEMINGLY FIXED BY PRESSING THE RESET BUTTON. HOWEVER, THE ISSUE WOULD RETURN AFTER THE CAR IS TURNED OFF AND ON AGAIN EVEN AFTER PRESSING THE RESET BUTTON THE FUEL AND MILEAGE WOULD NOT DISPLAY PROPERLY OR AT ALL.",
        "vin": "3HGGK5H46JM"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/08/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373657,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PAINT IS PEELING OFF THE BODY.",
        "vin": "3HGGK5H8XJM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/25/2020",
        "dateOfIncident": "10/21/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366294,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY 2018 HONDA FIT DURING MARCH 2018 AND ON 21ST OCTOBER 2020 WITH 25K MILES ON IT THE CHECK ENGINE LIGHT, STEERING WHEEL, VSA & TIRE PRESSURE LIGHTS CAME ON. IWAS DRIVING AT THE TIME. I YOOK IT TO THE HONDA DEALERSHIP THE VERY NEXT DAY AND THEY DIAGNOSED TO CONCLUDE THAT THE FUEL INJECTORS NEED TO BE REPLACED. THANKFULLY IT WAS STILL UNDER 3 YEAR BUMPER TO BUMPER WARRANTY AND THIS WORK WAS COVERED UNDER THE SAME. HOWEVER THE DEALERSHIP WAS NOT ABLE TO GIVE ME A ROOT CAUSE ON WHY THE INJECTORS NEEDED TO BE REPLACED AND WHAT I NEED TO DO GOING FORWARD TO PREVENT RECURRENCE OF THIS ISSUE. OVERALL THIS HAS SHAKEN MY TRUST IN THE HONDA BRAND AND I NEED SPECIFICS ON THE POSSIBLE REASONS WHY THIS COULD HAPPEN AND WHAT DO I, AS THE CAR OWNER, NEED TO DO IN ORDER TO PREVENT THIS FROM HAPPENING AGAIN. I'VE ALWAYS DONE REGULAR MAINTENENCE PER DEALERSHIP RECOMMENDATIONS & HAVE USED TOP TIER DETERGENT GASOLINE (REGULAR GRADE) FROM COSTCO. SHOULD I SWITCH TO PREMIUM GRADE? I USED TO DRIVE AROUND 300 MILES PER WEEK UNTIL MID MARCH 2020 AND DUE TO PANDEMIC INDUCED WORK FROM HOME I'VE NOT DRIVEN MUCH AT ALL. I ALSO USED NON TOP TIER REGULAR GRADE GAS FROM SAM'S THE LAST COUPLE OF TIMES WHILE THE CAR WAS NOT BEING USED MUCH. COULD THIS BE A REASON?",
        "vin": "3HGGK5H49JM"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/22/2020",
        "dateOfIncident": "10/11/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365849,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PAINT IS PEELING OFF THE TOP OF THE CAR. AFTER A RAIN I NOTICED THE PAINT STARTED TO PEEL.",
        "vin": "3HGGK5H68JM"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "10/04/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362678,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "A FEW MONTHS AFTER PURCHASING THIS VEHICLE (NEW) IN FALL OF 2017 I NOTICED THAT THE DRIVERS SEAT WAS UNCOMFORTABLY WARM.  I TOOK IT BACK TO THE DEALER I PURCHASED THE CAR FROM AND THE SERVICE DEPT. COULD FIND NOTHING WRONG WITH THE SEAT HEATER.  I THEN TOOK THE CAR TO ANOTHER DEALER, THAT SERVICE DEPT. TOOK AN EXTENSIVE CHECK AND AGAIN I WAS TOLD ALL WAS WORKING FINE AND THEY FIXED NOTHING.  HOWEVER, AFTER THAT SECOND SERVICE THE SEAT WAS COMFORTABLE AND I HAD NO COMPLAINT UNTIL ABOUT A MONTH AGO WHEN THE SEAT AGAIN BECAME UNCOMFORTABLY WARM (WITH THE HEATER ON OFF).  I TOOK IT TO THE SECOND DEALERSHIP, THE PERSON IN THE SERVICE DEPT. TOOK THE CAR FOR A DRIVE AROUND TOWN AND SAID THAT THE SEAT \"RETAINED MORE HEAT THAN HIS VEHICLE OR OTHERS HE DROVE) HE DIDN'T FEEL ANYTHING WAS WRONG, SO NO ONE WORKED ON CHECKING OUT THE WIRING OR ANYTHING AND IT IS STILL UNCOMFORTABLE TO DRIVE.",
        "vin": "3HGGK5H01JM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/09/2020",
        "dateOfIncident": "05/19/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328066,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A LIMITED ACCESS DIVIDED HIGHWAY AT 65 MPH, USING ADAPTIVE CRUISE CONTROL, THE CAR SUDDENLY APPLIED MAXIMUM BRAKING TO ABOUT 30MPH. THERE WERE NO CARS OR OTHER OBJECTS IN FRONT OF OUR CAR.  THERE WAS A CAR BEHIND WHO WAS LUCKILY ABLE TO SWERVE AROUND OUR CAR. THE CONDITIONS WERE LIGHT DRIZZLE, DAMP ROAD, 50 DEGREES, AT 2:30 IN THE AFTERNOON.   AFTER CONTACTING HONDA ,I WAS TOLD THAT I SHOULD READ PAGE 472 OF THE OWNERS MANUAL THAT STATES TO TURN OFF THE CMBS IN BAD WEATHER. (THIS MANUAL IS NOT SUPPLIED WITH THE CAR. ONLY A150 PAGE MANUAL IS SUPPLIED AND PAGE OF THE MANUAL SAYS NOTHING ABOUT ANY LIMITATIONS OF THIS SYSTEM.  *TR",
        "vin": "3HGGK5G82JM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/10/2020",
        "dateOfIncident": "03/08/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317352,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I THINK A LOT OFF PEOPLE CAN AGREE THAT LIGHTS ON HIGHER END, NEW CARS ARE WAY TOO BRIGHT TO THE POINT THAT THEY CAN BE BLINDING AND IT'S OFTEN DIFFICULT TO TELL THE DIFFERENCE BETWEEN HIGH BEAMS AND LOW BEAMS",
        "vin": "3HGGK5H43JM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/21/2020",
        "dateOfIncident": "02/20/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310525,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 HONDA FIT LX, 1,700 MILES. AFTER ABOUT A 10 MILE URBAN DRIVE IN AROUND 40F WEATHER, I STOPPED AT A LIGHT AND THE ODOMETER/GAS DISPLAY FLICKERED AND THE NUMBERS WERE SCRAMBLED. IT GLITCHED ONE MORE TIME, AND THEN DISAPPEARED AFTER ABOUT A MINUTE. THIS IS A COMMON SAFETY ISSUE FOR 2015+ AND SHOULD BE RECALLED. AS FAR AS MY RESEARCH I DID NOT FIND ANOTHER CASE OF THIS HAPPENING WITH SUCH LOW MILEAGE, ONLY THAT IT IS MORE LIKELY TO HAPPEN IN COLD WEATHER. I ALSO READ THAT THE FUSE BOX IS PRONE TO FLOODING AND CAN AFFECT THIS ISSUE, AND IT DID OCCUR AFTER A COUPLE DAYS OF ME DRIVING IN HEAVY RAIN. I JUST BOUGHT THIS CAR USED 3 DAYS AGO AND SO FAR HAVE NOT SEEN THE ISSUE REPEATED, BUT READ THAT IT GETS WORSE OVER TIME. THIS IS A SERIOUS SAFETY AND LEGAL ISSUE FOR ODOMETER NOT TO DISPLAY PROPERLY, AND GAS AMOUNT!",
        "vin": "3HGGK5H47JM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/30/2020",
        "dateOfIncident": "01/30/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306197,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "LATELY, ON STARTUP IN THE MORNINGS, THE ODOMETER SCREEN HAS BEEN GLITCHING OR CLEARING ENTIRELY.  IT SEEMS TO HAPPEN ON THE COLDEST MORNINGS.  THE ISSUE CLEARS UP AFTER BEING ON THE ROAD FOR A WHILE, BUT HOW LONG IT TAKES TO GET BACK TO NORMAL VARIES BY THE DAY.  SOME DAYS THE GLITCH STARTS WHILE THE CAR IS STATIONARY AND WARMING UP.  ON OTHER DAYS IT OCCURS ONCE I AM ALREADY A FEW MILES DOWN THE ROAD.",
        "vin": "3HGGK5H48JM"
    },
    {
        "components": "STEERING,STRUCTURE,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "10/28/2019",
        "dateOfIncident": "10/24/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271723,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ON FM529 IN THE LEFT HAND TURN LANE HEADING TOWARDS THE SOLID GREEN LIGHT, AS I WAS APPROACHING THE LIGHT I STARTED SLOWING DOWN AND NOTICED IN MY LEFT PERIPHERAL VISION A BLACK CAR WAITING TO PULL OUT. I SLOWED DOWN TO 20 MPH WHERE  I PROCEEDED TO HEAD TO THE TRAFFIC LIGHT. THEN ALL OF A SUDDEN, THIS BLACK CAR PULLED OUT CROSSED TWO LANES OF ONCOMING TRAFFIC & SIDE SWIPED MY CAR ON MY DRIVER'S SIDE FROM THE FRONT OF THE LEFT BUMPER ACROSS THE LEFT WHEEL WELL ABOVE THE LEFT TIRE, HIT PART OF MY LEFT DOOR AND COMPLETED TURNED MY LEFT MIRROR INWARD SO THAT IT WAS FLUSH WITH MY LEFT WINDOW. THIS BLACK CAR WAS MUCH BIGGER THAN MINE(2014 TOYOTA CAMRY) AND IT DID GIVE ME QUITE A JOLT UPON IMPACT.  MY CAR WAS COMPLETELY IN THE LEFT HAND TURN LANE WHEN SHE PULLED OUT OF THE GAS STATION. THE LADY THAT DID THIS WANTED TO LEAVE THE SCENE OF THE ACCIDENT. I SAID NO, BECAUSE I WANTED A POLICE REPORT. SHE ALSO STATED SEVERAL TIMES THAT SHE NEVER SAW ME IN THE LEFT HAND TURN LANE.  I CALLED 911 AND TWO POLICE OFFICERS WERE DISPATCHED TO THE SCENE. ONE SAID IT WAS NOT WORTH DOING A REPORT BECAUSE THE DAMAGE WAS LESS THAN $1K. HE STATED THIS WHILE HE WAS LOOKING AT THE DAMAGE TO HER CAR NOT MINE. THE DAMAGE TO MY CAR IS ROUGHLY AROUND $2K & HE ALSO STATED THAT IF HE WERE TO WRITE A REPORT UP, THAT OUR CAR INSURANCE WOULD JUMP \"SKY HIGH\". THERE WERE NO TICKETS GIVEN AT THE TIME. THE LADY AND I AGREED TO HANDLE THIS OUT OF POCKET. I ALSO TOLD THE OFFICERS THAT THE LADY HAD STATED ON SEVERAL OCCASIONS THAT SHE NEVER SAW ME, BUT IT DIDN'T SEEM TO MAKE ANY DIFFERENCE. THIS ACCIDENT HAPPENED AT ABOUT 7:55 AM. THIS LADY CREATED THE PROBLEM BY NOT LOOKING TO HER RIGHT SIDE AND LOOKING STRAIGHT IN FRONT OF HER BEFORE PULLING OUT INTO ONCOMING TRAFFIC. I THINK MY BACK WINDSHIELD WIPER WAS DAMAGED AS IT WAS WORKING JUST FINE BEFORE THE ACCIDENT & NO LONGER WORKS. ALIGNMENT MUST BE CHECKED.",
        "vin": "3HGGK5H68JM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/26/2019",
        "dateOfIncident": "10/19/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271228,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER PARKING AND RETURNING TO VEHICLE, ON START UP, MULTIPLE CHECK ENGINE LIGHTS WENT OFF. CODE WAS READ AS P0303 ENGINE CYLINDER 3 MISFIRE. CAR ~8000 MILES, ON TAKING TO DEALERSHIP WAS TOLD EXTREME CARBON BUILDUP HAD CAUSED MISFIRES. CAR WAS RETURNED, FUNCTIONED FOR A MONTH. ISSUE REOCCURRED, FUEL INJECTORS, FUEL JOINT PIPE SET, AND FUEL PUMP WERE REPLACED. CAR IS CURRENTLY FUNCTIONAL BUT IT IS CONCERNING THAT FUEL INJECTORS HAVE FAILED ON A NEW VEHICLE AFTER UNDER 10,000 MILES.",
        "vin": "3HGGK5H47JM"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/24/2019",
        "dateOfIncident": "10/09/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270658,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "REGULARLY WHEN SHIFTING INTO DRIVE FROM PARK OR SHIFTING INTO DRIVE FROM REVERSE, THE CAR WILL FAIL TO ACCELERATE AT ALL FOR SEVERAL SECOND DESPITE GAS PEDAL ACTUATION AT FULL, OR PEDAL ON THE FLOOR. UNPREDICTABLE ACCELERATION WHEN SHIFTING INTO DRIVE DISALLOWS DRIVER FROM DRIVING CAUTIOUSLY AS THE UNKNOWN VARIABLE IS DISTRACTING AND DANGEROUS IF IN A SITUATION WHERE THE CAR NEEDS TO MOVE ON COMMAND. VEHICLE WAS STATIONARY.",
        "vin": "3HGGK5H46JM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/25/2019",
        "dateOfIncident": "07/22/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234856,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 HONDA FIT. WHILE ATTEMPTING TO DRIVE THE VEHICLE, THE ANTI-LOCK BRAKE, TIRE PRESSURE MONITORING SYSTEM, HILL ACCESS, LANE DEPARTURE, BRAKE ASSIST CRASH, AND POWER STEERING WARNING INDICATORS ILLUMINATED. THE CONTACT WAS ABLE TO DRIVE THE VEHICLE TO BABYLON HONDA (100 EVERGREEN ST, WEST BABYLON, NY 11704, (855) 494-7101) WHERE THE FOLLOWING ERROR CODES WERE FOUND: TU0416-68 (VSA SYSTEM MALFUNCTION), U0401-68 (PCM MALFUNCTION), AND P0303 (# 3 CYLINDER MISFIRED DETECTIVE). ALL THE CODES WERE CLEARED AND THE VEHICLE WAS REPAIRED. WITHIN LESS THAN 24 HOURS AFTER THE VEHICLE WAS REPAIRED, THE FAILURES RECURRED. THE VEHICLE WAS TAKEN BACK TO THE DEALER AND THE CODES WERE CLEARED A SECOND TIME. THE CONTACT WAS CONCERNED THAT THE ENGINE COULD FAIL WHILE DRIVING. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED CASE NUMBER: 09727346. THE APPROXIMATE FAILURE MILEAGE WAS 9,060.",
        "vin": "3HGGK5H98JM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/23/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203060,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "COLLISION MITIGATION BRAKING SYSTEM FALSE ALARMS.  THE CBMS SYSTEM OCCASIONALLY TRIGGERS AND APPLIES THE BRAKES FOR VEHICLES IN THE ONCOMING LANE.  THE SYSTEM CANNOT DISTINGUISH ONCOMING TRAFFIC FROM AN OBSTACLE IN MY TRAVEL LANE.    THE FAULT IS RANDOM AND DIFFICULT TO REPRODUCE.  IT OCCURS MOST OFTEN ON NARROW WINDING SECONDARY ROADS.  IT DOES NOT HAPPEN OFTEN ENOUGH FOR THE DEALERSHIP TO REPRODUCE.    THE DEALER WILL NOT CHECK THE CAMERA CALIBRATION UNDER WARRANTY BECAUSE THEY CANNOT REPRODUCE THE PROBLEM EASILY.  THE ISSUE CAN OCCUR 2-3 TIMES ON A DAILY COMMUTE, AND THEN NOT OCCUR AGAIN FOR A WEEK.  THE FAILURE SEEMS UNRELATED TO WEATHER, SUN, CLOUDS, VEHICLE SPEED, ETC.    THIS IS A SAFETY HAZARD.  VEHICLES BEHIND ME HAVE BEEN SURPRISED BY THE RANDOM BRAKING AND ON TWO OCCASION HAVE TRIGGERED ROAD RAGE BY THE DRIVER BEHIND ME BECAUSE THEY ASSUMED I \"BRAKE CHECKED\" THEM.    PROBLEM HAS BEEN ON-GOING SINCE THE VEHICLE WAS PURCHASED NEW.  NOW AT 1 YEAR AND 20,000 MI.      FOR COMPARISON I OWN A TOYOTA COROLLA WITH A SIMILAR SYSTEM.  THAT CAR NEVER FALSE ALARMS IN IDENTICAL DRIVING SITUATIONS.",
        "vin": "3HGGK5H80JM"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "11/13/2018",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151370,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CVT TRANSMISSION WILL DISENGAGE IF LEFT IN DRIVE AND VEHICLE IS SHUTOFF. YOU CAN TURN OFF VEHICLE WHILE IT IS IN DRIVE AND THE VEHICLE WILL ROLL BACK AND FORTH, AS IF IT WAS IN NEUTRAL. FORGOT TO PUT VEHICLE IN PARK, PRESSED THE PUSH TO START AND VEHICLE SHUT OFF. 3 SHORT BEEPS IS THE ONLY WARNING, EXITED THE VEHICLE AND IT ROLLED BACKWARD OUT THE GARAGE AND INTO YARD ACROSS THE STREET. THIS IS A NEW VEHICLE AND NOT USE TO PUSH TO START FUNCTION.",
        "vin": "3HGGK5H84JM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/09/2018",
        "dateOfIncident": "06/11/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139218,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "LOTS OF GAS IN OIL BOTH TIMES ON OIL  CHANGES.  MOTOR BOGS DOWN SOMETIMES  WHILE IN MOTION.",
        "vin": "3HGGK5G61JM"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "05/23/2018",
        "dateOfIncident": "02/05/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11097548,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THE HONDA FIT ON JANUARY 27, 2018. BY EARLY FEBRUARY I HAD DEVELOPED AN INJURY THAT I WILL DETAIL BELOW BUT WHICH WAS ENTIRELY A RESULT OF DRIVING THE CAR I HAD JUST BOUGHT. I HAVE NOW NOT DRIVEN THE FIT AT ALL SINCE APRIL 18 AND DESPITE SEVERAL MEDICAL INTERVENTIONS (DOCUMENTS ATTACHED), I REMAIN IN DAILY PAIN. MY GP HAS DIRECTED ME TO SEE AN ORTHOPEDIC SPECIALIST WHO I WILL BE SEEING THIS AFTERNOON.     THE DRIVER-SIDE SEAT BELT TONGUE IN THE 2018 HONDA FIT IS PARTICULARLY LARGE & HEAVY; I WAS TOLD BY HONDA SERVICE THAT THE SIZE IS A RESULT OF DRIVER-SIDE SAFETY SENSORS. THE DRIVER-SIDE SEAT BELT BUCKLE IS LOCATED HIGH ON THE SIDE OF THE SEAT & WHEN BUCKLED (WHETHER STANDING STILL OR IN MOTION), THE WEIGHT & SIZE OF THE TONGUE PULLS THE ENTIRE MECHANISM AT A PARTICULARLY SHARP ANGLE TOWARD THE DRIVER. IN MY CASE, THE SEAT BELT TONGUE-&-BUCKLE HITS MY RIGHT HIP AT SUCH AN ANGLE THAT IT AGGRAVATES A NERVE AND RESULTS IN BOTH IMMEDIATE & LASTING PAIN.     I BEGAN TO TRY TO RESOLVE THIS ISSUE BY ASKING HONDA SERVICE TO ADJUST THE SEAT BELT BUT THREE GOOD-FAITH EFFORTS ON THEIR PART DIDN'T SOLVE THE PROBLEM; THE DEALERSHIP ASSOCIATED WITH THE SERVICE DEPARTMENT I WENT TO SAW IT AS AN OPPORTUNITY TO TRY TO UPSELL ME TO A MORE EXPENSIVE CAR; TWO SEPARATE EFFORTS TO RESOLVE THE ISSUE VIA AMERICAN HONDA CUSTOMER SERVICE RESULTED IN BEING TOLD THAT AS THE PART WAS NOT DEFECTIVE, THEY WOULD NOT BE HELPING ME (SCREENSHOT OF PRIVATE EXCHANGE ON TWITTER, ATTACHED.)     FOR WHAT IT'S WORTH, ALL I'VE ASKED FOR IS EITHER A DIFFERENT SEAT BELT WITH A DIFFERENT TONGUE-&-BUCKLE MECHANISM, OR A TRADE-IN FOR AN EARLIER MODEL WITH A DIFFERENT SEAT BELT, AND AT BOTH THE NATIONAL AND THE FRANCHISE LEVEL, NO ONE WAS WILLING TO WORK WITH ME IN EITHER DIRECTION.",
        "vin": "3HGGK5G84JM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/26/2018",
        "dateOfIncident": "01/22/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081416,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SEAT HAS A LACK OF THIGH LENGTH AND SUPPORT RESULTING IN MASSIVE PAIN TO MY LEFT HIP. I FEEL CRIPPLED AS A RESULT.",
        "vin": "3HGGK5G87JM"
    }
]