[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/02/2022",
        "dateOfIncident": "11/20/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459331,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Driver Side Window malfunctioned. Honda has attempted to repair 5 times but it continues to malfunction after working for 2-3 days max.",
        "vin": "5FNYF6H96JB"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "03/29/2022",
        "dateOfIncident": "03/29/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458868,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Honda Pilot. The contact received notification of NHTSA Campaign Number: 21V932000 (Structure, Latches/Locks/Linkages). The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue but informed the contact to have the vehicle shipped by barge to a dealer in Honolulu for the recall repair. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "5fnyf5h39jb"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/03/2022",
        "dateOfIncident": "02/27/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455080,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Honda Pilot. The contact stated that while driving at approximately 40 MPH, she depressed the brake pedal and noticed that her vehicle was not slowing down. The contact stated that as she was approaching another vehicle, she looked to make sure she was indeed depressing the brake pedal, however it would not allow her to press down and seemed to be accelerating faster than 40 MPH. The contact stated that her vehicle then caused her to crash into the rear of another vehicle, however, the vehicle still seemed to be accelerating, even though it had crashed. The contact stated that she attempted to power the vehicle off, however, the vehicle powered itself back on. The contact stated that she powered it off 3 times before the vehicle would remain off. The contact stated that the airbags did deploy and there were no injuries reported. The contact stated a police report was filed. The contact stated she then had her vehicle towed to a tow yard where it was deemed a total loss. The dealer and the manufacturer were not notified of the failure. The failure mileage was 50,000.",
        "vin": "5FNYF5H90JB"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "02/24/2022",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453821,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Honda Pilot. The contact stated while driving at an undisclosed speed, the hood was vibrating. There were no warning lights illuminated. The contact received notification of NHTSA Campaign Number: 21V932000 (Structure, Latches/Locks/Linkages). The vehicle was taken to the local dealer who stated the vehicle was working as designed. The vehicle was not diagnosed or repaired. The contact stated the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was notified but no further assistance was provided. The approximate failure mileage was 30,000.",
        "vin": " 5FNYF5H80J"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/24/2022",
        "dateOfIncident": "11/13/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453829,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Just saw the article concerning the automatic braking in Honda CR-V's and Accords. Since purchasing my 2018 Pilot, in September 2018, this has occurred multiple times. While driving \"Brake\" will flash on my dash screen and a momentary braking action, along with a shimmy in the steering wheel will occur. I have never had a complete stop happen. I went to my local Honda dealers in Modesto and Stockton, CA. Spoke to their service personnel and they both had no idea what might cause this to happen. I then called Honda customer service and they hadn't heard of this problem. After it happened a few more times I called them again. I voiced my concerns of it happening and causing me to be involved in an accident. Laura, the rep I spoke to, gave me a case number (09698440) to reference should I call again. She could provide no explanation for this happening. This does not happen on a regular basis. I can go for long periods of time and nothing will happen. Then it can happen multiple times in a week.",
        "vin": "5FNYF6H98JB"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/16/2022",
        "dateOfIncident": "02/14/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452191,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Engine misfires randomly causing car to go into limp mode. Car was unable to go pass 40 mph on while trying to merge highway. It was very dangerous and scary as cars came very close to my bumper. Honda is aware of an injector issue and has extended the warranty, but this should be a safety recall.",
        "vin": "5FNYF6H96JB"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/08/2022",
        "dateOfIncident": "02/02/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450957,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The auto engine idle \"feature\" automatically shuts the engine off when the car comes to a stop. This \"feature\" is supposed to improve gas mileage, however, I believe it is very dangerous. This \"feature\" has caused my vehicle to stall numerous times in stop and go traffic, requiring me to completely stop the vehicle, place it in park, and then restart the vehicle. This sequence has created several scary and dangerous situations where I was completely stopped on a busy freeway. This \"feature' WILL cause accidents if it has not already caused them. This feature currently cannot be permanently disabled. It must be disabled manually every time I drive the car. I have also contacted Honda directly to notify them of this defect.",
        "vin": "5fnyf6h94jb"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/06/2022",
        "dateOfIncident": "02/06/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450663,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The Auto-Idle feature will unexpectedly over-engage while coming to a stop and the entire vehicle will shut off. I am unable to shift, steer, etc.  It will also completely shut the engine down when at a complete stop.  To be clear, this is not the normal auto-idle.  When the full engine disengage happens, the entire vehicle loses power and the dash flashes. The vehicle states, \"put into P\". Once in \"P\" for park, the vehicle still will not restart. It is as if the vehicle has to \"reset\" itself.   It has taken upwards of 4 minutes for the vehicle to restart.  This has happened on a highway during construction traffic, approaching a stop sign, slowing at a red light on multiple occasions.  I have almost been rear-ended as a result on mutiple occasions. I am not even able to put the vehicle in Neutral to move it to a safe spot.   Honda informed me that I \"just need to disengage this feature each and every time I start the vehicle\" .  That is not the solution.  This feature should be permanently disabled by Honda. Immediately.",
        "vin": "5FNYF5H95JB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/01/2022",
        "dateOfIncident": "10/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449785,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Honda Pilot. The contact stated while driving 55 MPH, the keyless control module unit would shut off. The contact stated no warning light was illuminated. The contact was able to drive to her residence. The contact took the vehicle to the local dealer, where it was diagnosed with needing the keyless control module unit to be replaced. The vehicle was not repaired but was pending repairs. The manufacturer had been informed of the failure. The failure mileage was 60,372.",
        "vin": "5FNYF5H13JB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/29/2022",
        "dateOfIncident": "11/14/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449409,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "To Whom It May Concern:  I writing in regards to a possible defect with my 2018 Honda Pilot.  It is having internal electrical issues stated by the dealership and needs a keyless control module unit replaced.  However,  my car has been in the dealership since November 15, 2021 due to Honda not being able to get the part needed to repair.  American Honda has failed to remedy the defect in my vehicle within a reasonable time period. Can someone please assist me on how I rectify this situation.   Thanks   [XXX]   INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "5FNYF5H13JB"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/26/2022",
        "dateOfIncident": "01/01/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449018,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Honda Pilot. The contact received notification of NHTSA Campaign Number: 18V221000 (Seats) however, the part to do the recall repair was unavailable. The local dealer was contacted, and it was confirmed that the part was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. VIN tool confirms parts are not available.",
        "vin": "5FNYF6H54JB"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "01/25/2022",
        "dateOfIncident": "01/24/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448791,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The adaptive cruise control doesnt pick up a vehicle in my lane but a vehicle to either side of me and brakes hard. Also the automatic emergency braking will pick up vehicles in the opposite lane going past me and brake hard.",
        "vin": "5fnyf5h97jb"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/06/2021",
        "dateOfIncident": "07/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442796,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Honda Pilot. The contact stated that there was no windshield washer fluid coming from the nozzle while attempting to clean the windshield. The contact stated that while driving approximately 25 MPH, the contact heard an abnormal sound coming from the vehicle with the windshield washer fluid warning light illuminated. While attempting to replenish the washer fluid reservoir the windshield washer fluid was spilling. The contact took the vehicle to a dealer where he was informed that the windshield washer motor system needed to be replaced; however, the parts to repair the system were on backorder. The manufacturer had yet to be notified of the failure. The vehicle had yet to be repaired. The failure mileage was approximately 40,000.",
        "vin": "5fnyf6h56jb"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/30/2021",
        "dateOfIncident": "11/29/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11442090,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Honda Pilot. The contact stated that while driving at an undisclosed speed, the vehicle hesitated to accelerate and then lunged forward. The contact sustained whiplash from the vehicle lunging forward abruptly. The vehicle was taken to an independent mechanic, but the independent mechanic could not duplicate the failure. The dealer was made aware of the failure. The vehicle was not repaired. The manufacturer was made aware of the failure and referred the contact to file a complaint with NHTSA. The failure mileage was approximately 43,000.",
        "vin": "5fnyf6h80jb"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/18/2021",
        "dateOfIncident": "11/15/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440941,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Hello, below are answers to suggested questions to help describe what happened. -What component or system failed or malfunctioned, and is it available for inspection upon request?  Unknown but a constant \"chirping\" sound is heard from the car engine area when car engine is on or \"running similar to descriptions at link https://www.piloteers.org/threads/2018-honda-pilot-chirping-noise-audio-file.160027/  -How was your safety or the safety of others put at risk?  Unknown.  -Has the problem been reproduced or confirmed by a dealer or independent service center?  Negative  -Has the vehicle or component been inspected by the manufacturer, police, insurance representatives or others? Few weeks or month after purchase in Sept 2018, dealer serviced the car and the sound disappeared but reappeared recently (approximately 3 years later).  -Were there any warning lamps, messages or other symptoms of the problem prior to the failure, and when did they first appear?  No symptoms.  First appearance mentioned in above answer.",
        "vin": "5FNYF6H54JB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/12/2021",
        "dateOfIncident": "10/11/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436390,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving my kids to school when I stopped at the school intersection. I go to press on the accelerator as I normally would and it would not drive, so I pressed on it a little harder as I was turning left since there were cars approaching. My vehicle suddenly jolted, making myself and the kids shift/jump from the force. I then proceeded driving down the road and let go of the accelerator, and my SUV suddenly started to feel like it was slowing itself down instantaneously. It felt like it was trying to make the vehicle's speed go down to 0. I then pressed on the accelerator again to prevent it from happening, but it continued to do so whenever I let go. I had to stop at the school's parking lot and turn off the SUV completely. When I turned it on again and began to drive, it was functioning normally. Since then, it has happened about 3 or 4 times, 1 of which happened on the expressway, which was way scarier. I had to get out of the expressway as it was dangerous.   Just yesterday, I had a separate issue with the SUV that may seem related in retrospect. My SUV did not want to turn on. I experienced all of the dashboard lights flickering, and being unable to start it. It was not the battery because at some times, the radio would turn on, the lights, and the windows/locks would function normally. I was unable to get the vehicle to go to neutral, or anything then on. When the lights were not flickering, it presented me with the smart entry system light problem. Soon after, all the lights on my dashboard turned on and stated there were air bag problem, brake problem, abs problem, and etc... My vehicle is currently being looked at.",
        "vin": "5fnyf6h92jb"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/03/2021",
        "dateOfIncident": "10/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435294,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "My transmission is having problems. During acceleration the car will jolt forward, also when using the brakes. The dealer did recognize the problem but said it is not covered by warranty and that transmission needed to be flushed.. which was going to cost $500. He said had it been flushed before they may cover it, yet Honda doesn’t recommend a flush before 45000 per my owners manual. Very dangerous.. could cause an accident with Speed going up and down at a moments notice without you doing it",
        "vin": "5fnyf6h51jb"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/26/2021",
        "dateOfIncident": "09/24/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434390,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The Auto Engine Idle feature does not work properly.  When the car is at a light, the engine idle is activated and the car is put into a slumber mode, when the brake is depressed.  On occasion, when it is time to go, the car then turns off when the gas is depressed.  This is extremely dangerous as then you are stuck at an active intersection and need to turn the car back on.    I've discovered a wealth of other owners with this issue here.  My issue is consistent with their reports.  https://www.carproblemzoo.com/honda/pilot/car-stall-problems.php  In my research, the Honda dealers are not doing anything to fix it, and there has been no thoughtful feedback from the company.  I will be taking this to our dealer as well, but am not hopeful given that it appears to be a fundamental design / software issue, not repairable in the fields.  I literally have found no evidence that it is fixable without maybe a software upgrade.",
        "vin": "5FNYF6H9XJB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/24/2021",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434229,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "around 30k miles the keyless system degrades.  Car won't start, says key is not present.  afraid of getting stranded somewhere. forum shows MANY people having this issue, I believe a recall for this is needed.  Problem seems to just get worse and worse over time. happens with both key fobs, replaced batteries no difference. https://www.piloteers.org/threads/keyless-start-system-problem-error.142385/",
        "vin": "5FNYF6H52JB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/30/2021",
        "dateOfIncident": "06/03/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431074,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I have been experiencing issues with the auto engine idle stop feature.  The electrical system (radio & blue tooth) cut off and on when the auto engine idle stop tries to start again.  There have even been several instances of the car cutting off completely and having to be restarted.  This is very unsafe.  One of the instances of the car cutting off occurred in traffic as we stopped and then started moving again.  There were several people in the car at the time.  The dealer has not been able to recreate the issue.",
        "vin": "5FNYF5H93JB"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/16/2021",
        "dateOfIncident": "08/16/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429203,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The driver side sun visor fails to swing down. Dangerous to drive in bright sun Replace commercially and mechanic said this is a common Pilot failure Why is this not a recall?",
        "vin": "5FNYF6H34JB"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/14/2021",
        "dateOfIncident": "07/07/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429102,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The High beams are giving a warning when driving during the day and at night. “High support system problem “. I have taken it to the dealership and they can’t find the issue and I have reported twice and they still can’t figure it out. The high beams come on and off during driving which is a safety issue for both drivers, this issue continues to occur since July 2021 and is reoccurring.",
        "vin": "5FNYF6H07JB"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "08/09/2021",
        "dateOfIncident": "07/15/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428298,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "\"SUA, Sudden Unwanted Acceleration\". I was in the process of parking on the 6th floor of a parking ramp in Rochester MN, I had selected my parking slot and drove very slowly half way into my parking slot. As i was stationary about 3 meters from the front wall and getting ready to reverse for a bit in order to better align in between the white lines in my slot and before i shifted gears to reverse and while my foot was still on the brake, the vehicle experience a sudden full-speed acceleration crashing the vehicle against the wall with full force, the dashboard showed a message that the airbag malfunctioned and could not deploy.  Had not there been a wall but just rails in front of my parking slot, i am afraid the vehicle would have flown from the sixth floor into the ground.  The insurance company deemed the vehicle a total loss. The vehicle is still under my name but in possession of GEICO, available for inspection, but because it was a total loss i was not able to bring it to the Honda dealership where i bought it.  There were no warning signs that this would happen.",
        "vin": "5FNYF6H59JB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/27/2021",
        "dateOfIncident": "07/24/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426596,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "\"Idle Stop System\" fails to successfully restart the engine and results in a stall. Safety is put at risk as the car becomes immobilized at a traffic intersection, red lights, middle of the highway. Anywhere that you came to a complete stop and were not able to get the vehicle to reengage. I have not yet taken the vehicle to the dealer, this issue has happened multiple times and has also been very well documented by others on the internet https://www.carproblemzoo.com/honda/pilot/car-stall-problems.php https://www.piloteers.org/threads/elite-shuts-off-at-stop-light.157005/ The vehicle has not been inspected at this time No warning lamps or symptoms appear prior. When you lift your foot off the brake pedal the vehicle stalls and you are unable to drive the vehicle",
        "vin": "5FNYF6H03JB"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/11/2021",
        "dateOfIncident": "05/25/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424313,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "While stopped at a stop light/sign the engine stalls, dies, shifts to neutral (push button shift) leaving me disabled in the middle of the road. This issue has also occurred while slowing to take a sharp corner. The engine died at approximately 25 mph while slowing for the corner. I had taken it to the dealership and they claimed they could not reproduce the problem. I took the vehicle home, then later that day I drove it approximately 17 miles to a racetrack that I work at part time. At 12:30 am, I was leaving to head home, and while idling in the parking lot, it had died yet again and took several minutes to restart. Once it did restart, I had no throttle response in park, neutral or in drive. I shut the vehicle off and restarted it with no other issues for the 17 mile trip back home.  The dealership suggested that I take picture/video when it happens, which poses another safety concern to do that in the event I am driving when this event occurs. This is a severe safety concern as there is the potential for the engine to die/stall during a hard braking event in which I could lose power brakes. Only the dealership has inspected the vehicle, and the only lights that have been illuminated on the dash was the battery light and the caution light. This issue has been going on for approximately a month and a half. After completing some research, I have noticed there is a large collection of this or very similar complaints.",
        "vin": "5FNYF6H06JB"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/05/2021",
        "dateOfIncident": "07/03/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423444,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SECOND SEATBELT FAILURE.  I previously reported second row passenger seatbelt that was found completely detached from anchor, at point where belt was looped and sewn. This was replaced by dealer.  The second row middle belt locked in extended position at that time, and I requested dealer check this and repair or replace as needed. This was supposedly also done.   The row 2 middle belt is rarely used, using first time since repair was reportedly done, found webbing that is frayed 50%+ through, in portion that is retracted when not being used. I checked all belts when I found this, and found fraying at the 3rd row middle seatbelt (buckle portion webbing), with associated damage to the plastic where the third row seat folds down. It appears the belt webbing has been rubbing on this plastic part of seat back, causing damage. This belt is also rarely used: not at all in last 13 months, and around 5-6 times, every 6-10 weeks in non-pandemic times. The third row is normally kept folded down, with the middle row belt retracted into ceiling when not in use.  I am left wondering if the geometry of the belt placement is causing mechanical/friction damage, if there are sharp edges in the 2nd row middle belt storage (overhead), or if there was chemical damage to some belts in the factory. It is odd and concerning to find multiple issues with the belts, and I want all to be replaced, and their housing inspected for possible points causing the damage.",
        "vin": "5fnyf5h96jb"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/01/2021",
        "dateOfIncident": "06/29/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423102,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Push start does not work, says wireless key issue. Car does not start up (crank) and it does not turn completely off (it's stuck in start/ignition on, car is not running). Alarm would randomly discharge and have to relock the car, but would go off again. The ignition would flicker on and off constantly draining the battery. Doors would eventually unlock and stay unlock.",
        "vin": "5fnyf5h54jb"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/26/2021",
        "dateOfIncident": "06/26/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422430,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Transmission temperature too hot  Seems like every 8k miles I have this pop up. Only been serviced at Honda.",
        "vin": "5FNYF6H59JB"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/26/2021",
        "dateOfIncident": "05/26/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418681,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "There is a noticeable 'Chirp' Noise when taking curves when i slow for the curve and accelerate out of the curve. Yes, it is available to be inspected.  Had this in my 2016 Honda Pilot Touring AWD and we had to replace the entire transmission due to failure with the gears.  Unsure if will be a risk other than being stranded somewhere if it fails.  No police.  No system errors or warnings.",
        "vin": "5fnyf6h91jb"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/24/2021",
        "dateOfIncident": "05/24/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418363,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "When my vehicle has the auto idle stop feature turned on, there are several times when I have been sitting at a stop light or in a median waiting to pull across or merge into traffic, and this feature engages and when you take your foot off the brake and the engine is supposed to auto restart, the engine stops completely instead and shifts itself into neutral which requires you to have to put vehicle in park and completely restart the whole car.  Has been happening several times in the last year. I have taken it in to have the battery checked and it checks fine. The car is not throwing any codes.  This can be particularly dangerous when you are in a median trying to pull across a busy Highway as your car just completely dies on you. Also a problem when you are at a red light and it turns green and everyone starts rolling and your car completely dies, this increases your chance of being rear-ended.  If I manually turn the auto idle stop feature off when I initially turn the car on, this problem does not happen...... but this is every easy to forget as this is an automatic feature when your car is initially started..",
        "vin": "5FNYF6H0XJB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/20/2021",
        "dateOfIncident": "05/20/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417954,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The auto engine idle feature engaged at a stop light as usual. When I moved my foot from the brake to the accelerator, the car shut off, shifted into neutral and would not start. This was on a major highway. It took several minutes to start again, while I was stalled in dangerous traffic.",
        "vin": "5FNYF5H93JB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/07/2021",
        "dateOfIncident": "04/27/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415486,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR SHUT OFF WHEN TRYING TO RECOVER FROM IDLE STOP MODE. ALL LIGHTS TURNED OFF. THE CAR BECOMES INVISIBLE WHEN DARK.",
        "vin": "5FNYF6H06JB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/01/2021",
        "dateOfIncident": "03/06/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414726,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "1. WHEN ACCELERATING GRADUALLY ON THE 2018 HONDA PILOT TOURING AWD FROM COMPLETE STOP, THE CAR JERKS HARD AFTER THE CAR STARTS MOVING - PROBABLY FROM 1ST TO 2ND GEAR.  THE CAR IS IN AUTOMATIC DRIVE MODE.  2.THE 2018 HONDA PILOT TOURING AWD TURNS OFF ENGINE UNEXPECTEDLY.  WHEN SLOWING DOWN TO TRAFFIC, SOMETIMES THE CAR TURNS OFF THE ENGINE.  THIS IS ESPECIALLY BAD WHEN ON A UPHILL AND IN HEAVY TRAFFIC, CAUSING PANIC.  THE SUDDEN ENGINE STOPS ALSO HAPPEN OCCASIONALLY WHEN STOPPING TO SHIFT TO REVERSE INTO MY GARAGE- THIS CAUSES A DANGEROUS SITUATION AS CARS ARE COMING AND CAN GET INTO T-BONE COLLISION.",
        "vin": "5FNYF6H95JB"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/19/2021",
        "dateOfIncident": "04/17/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11412895,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ACCELERATING FROM AN IDLE POSITION THERE IS A 2-3 SECOND DELAY. VERY SLOW TO BET MOVING AND VERY DANGEROUS IN HIGH VOLUME TRAFFIC. THE CAR OFTEN TIMES JERKS WHEN I AM ACCELERATING IN TO A HIGHER GEAR.",
        "vin": "5FNYF6H05JB"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/10/2021",
        "dateOfIncident": "09/05/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407417,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS MADE AWARE OF AN URGENT SAFETY RECALL THAT THE DRIVER & FRONT PASSENGER SEATS WERE ASSEMBLED WITH IMPROPERLY MANUFACTURERED RIVITS USED TO SECURE THE SLIDE RAIL FRAME TO THE VEHICLE FLOOR. I SCHEDULED AN APPT FOR THE RECALL ON 3/02/19 @ HUNTINGTON HONDA. I WAS TOLD THEY HAD THE PARTS & WOULD DO THE RECALL WHEN I BROUGJT MY CAR FOR THE APPT. THEY DID NOT DO THE WORK & TOLD ME THAT IS HONDA'S PROCEDURE IS THAT THEY NEVER REPAIR RECALLS ON THE 1ST APPT. THEN I MADE AN APPT AT HONDA CITY FOR THE RECALL REPAIR TO BE DONE ON 03/14/20 I MADE SURE THEY HAD THE PARTS BEFORE THE APPT.. AGAIN THE REPAIR WAS NOT DONE AND I WAS TOLD THEY NEVER REPAIR IT THE 1ST TIME THEY SEE IT. I SCHEDULED THE NEXT APPT AT HONDA CITY FOR THE RECALL REPAIR ON 09/05/20 & AGAIN IT WAS NOT DONE. I BELIEVE HONDA WILL CONTINUE WASTING MY TIME & CAUSING ME EXPENSES & LOSS OF SALARY EVERY TIME I MAKE AN APPT FOR THIS RECALL REPAIR. I DO NOT BELIEVE THEY HAVE ANY INTENTION OF EVER REPAIRING THIS RECALL.",
        "vin": "5FNYF6H54JB"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/06/2021",
        "dateOfIncident": "04/06/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406741,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUV JOLTS AND DECREASES SPEED . IT TAKES A LONG TIME TO TAKE OFF AGAIN. THE JOLTING CAN BE STRONG AND IT HAS DECREASED ON THE FREEWAY. THIS IS NOT SAFE FOR A FAMILY VEHICLE. THIS HAS HAPPENED FOR A COUPLE OF MONTHS. I WAS TOLD AT THE DEALER I JUST NEEDED A NEW BATTERY I DID CHANGE IT AND IT STILL DOES IT THEN I WAS TOLD THEY FOUND NOTHING.",
        "vin": "5FNYF6H87JB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/19/2021",
        "dateOfIncident": "03/05/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403900,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I PURCHASED THE VEHICLE IN JUNE 2018 I NOTICED THAT THE HOOD VIBRATED EXCESSIVELY AT HIGHWAY SPEED.  I BROUGHT IT TO THE ATTENTION OF THE DEALERSHIP THE DAY AFTER PURCHASE AND AGAIN AT THE FIRST OIL CHANGE.  BOTH TIMES I WAS INFORMED THAT DUE TO THE LIGHTER METALS USED IN THE HOOD TO SAVE WEIGHT, THE VIBRATION WAS NORMAL.  ON  MARCH 5, 2021, WHILE DRIVING ON THE HIGHWAY AT ABOUT 65MPH, I NOTICED A LOUD \"SLAPPING\" NOISE COMING FROM UNDER THE HOOD.  UPON INSPECTION, IT WAS DISCOVERED THAT THE ALUMINUM AROUND THE HOOD SIDE LATCH (METAL HOOK) MECHANISM HAD TORN ABOUT 75% OF THE WAY AROUND THE ATTACHMENT POINTS (THREE BOLTS).  IN ORDER TO KEEP THE HOOD SHUT, AND FROM SEPARATING, IT HAD TO BE TAPED TO THE VEHICLE BODY.  I DROVE IT TO THE DEALERSHIP IT WAS PURCHASED FROM AND ALL WHO INSPECTED IT AGREED THAT IT WAS A MANUFACTURERS' DEFECT AND A SERIOUS SAFETY ISSUE.  HONDA CORPORATE REPRESENTATIVES AGREED.",
        "vin": "5FNYF6H55JB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/11/2021",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400303,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 HONDA PILOT. THE CONTACT STATED THAT WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE SUDDENLY SHIFTED INTO PARK. AN UNKNOWN DEALER WAS CONTACTED AND INFORMED THE CONTACT THAT AS A SAFETY FEATURE IN THE VEHICLE, DEBRIS MAY CAUSE THE FEATURE TO ACTIVATE INDEPENDENTLY. THE CONTACT THEY BOUGHT A SPECIAL VACUUM TO CONSISTENTLY AND CONSTANTLY REMOVE DEBRIS FROM THE AREA HOWEVER, THE FAILURE PERSISTED. THE VEHICLE WAS NOT DIAGNOSED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT THAT THE VIN WAS NOT UNDER RECALL. THE APPROXIMATE FAILURE MILEAGE WAS 30,700.",
        "vin": "5FNYF6H96JB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/07/2021",
        "dateOfIncident": "01/05/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11387000,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 HONDA PILOT. THE CONTACT STATED THAT WHILE IN REVERSED OUT OF THE DRIVEWAY TO GO ON THE MAIN ROAD, WHILE DEPRESSING THE BRAKE PEDAL, THE VEHICLE ACCELERATED INDEPENDENTLY. THE CONTACT ALSO STATED THAT WHEN HE DEPRESSED THE EMERGENCY BRAKE PEDAL, THE VEHICLE CONTINUE TO ACCELERATED AND WAS UNABLE TO STOP, THE CONTACT LOST CONTROL THE VEHICLE WENT UP ON THE SHOULDER OF THE ROAD AND CRASHED INTO A POLE ON THE PASSENGER SIDE BRAKING THE PASSENGER SIDE WINDOW. THE CONTACT DID NOT SUSTAINED INJURIES BUT STATED THAT THE NEXT DAY HE EXPERIENCED DIZZINESS AND BACK PAINED. THE CONTACT DID NOT SEEK MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO A TOW YARD. THE VEHICLE WAS NOT TAKEN TO A DEALER OR AN INDEPENDENT MECHANIC FOR A DIAGNOSTIC TESTING. THE MANUFACTURER WAS CONTACTED AND THEY INFORMED THE CONTACT THAT THEY WILL GET BACK TO HIM. THE CONTACT STATED THAT THE MANUFACTURER HAVE NOT YET CONTACT HIM. THE FAILURE MILEAGE WAS APPROXIMATELY 35,000.",
        "vin": "5FNYF6H94JB"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "12/31/2020",
        "dateOfIncident": "12/11/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11385730,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FIANC WAS DRIVING TO MY DOCTOR TO FOLLOW UP SURGERY, TWO BLOCKS FROM 2 BLOCKS FROM THE HOUSE WE APPROACHED TO TRAFFIC LIGHT WAS ON RED AND SHE WAS APPLYING THE BRAKES WHEN WE WERE JUST ABOUT AT LIGHT SUDDENLY THE CAR ACCELERATED GIRLFRIEND HAD HER FOOT ON THE BRAKE BUT THE CAR KEPT GOING WE STRIKE A CAR AND HIT A PARKED CAR BAD ACCIDENT, 3 PEOPLE GOT HURT.EVERY TIME I WATCH THE VIDEO I AM MORE CONVINCED THAT SOMETHING WHEN WRONG WITH CAR SYSTEMS THIS HAPPENS ON KENNEDY BOULEVARD AND AUDOBON ST ON 12/11/2020 AROUND 11:05 AM SUNNY CLEAR DAY. I HAVE A VIDEO.*DT",
        "vin": "5FNYF6H55JB"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/03/2020",
        "dateOfIncident": "12/03/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377811,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I FOUND THE SEATBELT END THAT SHOULD ATTACH THE BELT TO THE ANCHOR ON MY PASSENGER SIDE SECOND ROW DETACHED TODAY. THE BELT WEBBING IS FRAYED THROUGH BOTH THE WEBBING AND ALSO THE SEWN PORTION THAT MAKES THE LOOP ATTACHING THE BELT TO THE FLOOR/ANCHOR. THE ANCHOR IS BELOW A PANEL, SO I CAN'T SEE IF THERE WAS A SHARP EDGE THERE THAT RUBBED/CUT THE AREA, OR IT JUST UNRAVELED THROUGH AN AREA THAT WAS NOT PROPERLY SEWN. THE VEHICLE WAS STATIONARY, AND MY DAUGHTER REACHED FOR THE BELT TO BUCKLE (SHE USES BOOSTER), NOTICING THE DETACHMENT BEFORE WE DROVE.",
        "vin": "5FNYF5H96JB"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "09/23/2020",
        "dateOfIncident": "09/20/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360629,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS PULLING INTO A PARKING SPACE AT MY CHURCH WITH MY FOOT ON THE BRAKE. AS I NEARED THE END OF THE SPACE, THE CAR SUDDENLY SURGED FORWARD. IT WENT OVER THE CONCRETE BARRIER AT THE END OF THE SPACE AND CAME TO A STOP WHEN THE RIGHT FRONT TIRE HIT A TREE AND WAS KNOCKED TO A PERPENDICULAR POSITION TO THE AXLE. I BELIEVE THIS IS THE ONLY THING THAT CAUSED THE CAR TO STOP. THE AIRBAG DID NOT DEPLOY. THE CAR SURGED FORWARD ABOUT 5-6 FEET AT A HIGH RATE OF SPEED EVEN THOUGH MY FOOT WAS STILL ON THE BRAKE AND I WAS SLOWLY MOVING INTO THE PARKING SPACE.",
        "vin": "5FNYF5H56JB"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/20/2020",
        "dateOfIncident": "09/19/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360107,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER ABOUT 20 MILES OF FREEWAY DRIVING I EXITED AND STOPPED AT A STOP LIGHT. I BELIEVE MY CAR WENT INTO THE ENGINE STOP MODE WHERE IT TURNS OFF THE ENGINE TO SAVE GAS. IT DID NOT RESTART AND WOULD NOT RESTART. THE CAR TOLD ME TO PUT IT INTO PARK, SO I DID. I TOUCHED THE CAR START BUTTON AND IT WOULD NOT START IT KEPT REPORTING AN ERROR ON THE SCREEN. I PANIC'D BECAUSE MY FAMILY WAS IN THE CAR AND THE LIGHT TURNED GREEN WITH CARS COMING FROM BEHIND VERY QUICKLY I KEPT PRESSING THE BUTTON GET THE CAR TO START BUT IT WOULD NOT.  IT KEPT REPORTING ERRORS. FINALLY,AFTER ABOUT 5 MINUTES, THE HONDA LOGO SHOWED ON THE SCREEN INDICATING THE CAR WAS EFFECTIVELY REBOOTING AND THE CAR STARTED AFTER THAT. THIS IS COMPLETELY UNACCEPTABLE FOR ANY CAR.    RELATED: I'VE PREVIOUSLY REPORTED THAT THE CAR ENGAGES THE ENGINE STOP FEATURE FAR TOO QUICKLY, LITERALLY WITHIN A SECOND OF COMING TO A STOP, WHICH IS DANGEROUS BECAUSE YOU MAY JUST BE STOPPING QUICKLY AT A STOP SIGN OR EXIT WHERE YOU'RE REQUIRED TO STOP. THE CAR CUTS OUT AND IT TAKES 3-5 SECONDS TO GET ACCELERATION. AFTER REPORTING THIS TO HONDA DIRECTLY THEY DECLINED TO CHANGE THE FEATURE TO BE FULLY DISABABLE AND I'VE SINCE GOTTEN INTO A COUPLE OF SITUATIONS WHERE I NEED TO GO, BUT MY CAR WAS IN THE STOPPED MODE B/C I COME TO FULL STOPS AT STOP SIGNS, APPARENTLY UNLIKE HONDA'S TESTERS.    THIS FEATURE IS ONLY ENABLE ON ELITE MODELS OF THE PILOT AND IS FAULTY, IT IS DANGEROUS  AND NEEDS A FULL REVIEW. AS SOMEONE WHO WAS ALSO IMPACTED BY THE SATURN IGNITION SWITCH INCIDENT THIS SEEMS VERY SIMILAR.",
        "vin": "5FNYF6H09JB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/18/2020",
        "dateOfIncident": "09/15/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355727,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE TO START. MY CAR WAS LOCATED IN MY DRIVEWAY. AS SOON AS I PUSHED THE START BUTTON THE CAR COMPLETELY SHUT OFF NO POWER TO ANY PART. NO LIGHTS WERE WORKING, NOTHING, COULDN'T EVEN LOCK IT WITH KEY FOB. THE CAR WAS COMPLETELY DEAD. WITH ONLY 17K MILE ON A ALMOST 3 YEAR OLD CAR THIS SHOULD NOT BE HAPPENING. AFTER I FEW MINUTES, CHECKING THE BATTERY, AND MANY ATTEMPTS TO START, IT EVENTUALLY STARTED WITH A SPUTTER AND THE GAUGES JUMPING.",
        "vin": "5FNYF5H18JB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/20/2020",
        "dateOfIncident": "07/07/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350496,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS NOT STARTING ON FIRST ATTEMPT. SEVERAL TIMES THE PUSH START BUTTON NEEDS TO BE PRESSED BEFORE IT DOES.",
        "vin": "5FNYF6H35JB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/08/2020",
        "dateOfIncident": "09/24/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338261,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "HONDA IS SAYING THE POOR PAINT FINISH ON TAILGATE IS NOT DEFECTIVE MATERIAL OR WORKMANSHIP NOT COVERED UNDER WARRANTY PAINT FINISH HAS TWO SPOTS WHERE PAINT IS LIGHTER AND CLEAR COAT IN PROXIMITY HAS FAILED CAUSING PAINT BUBBLED AND CHIPPED.   NORMAL DRIVING, NO DAMAGE.",
        "vin": "5FNYF6H9XJB"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/24/2020",
        "dateOfIncident": "04/09/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330692,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STARTS TO STALL WHEN ACCELERATING AND WHEN I LET GO OF THE ACCELERATION PEDAL.  *TR",
        "vin": "5FNYF6H16JB"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/21/2020",
        "dateOfIncident": "05/10/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325446,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "HONDA PILOT ADAPTIVE SPEED CONTROL (ACC) WORKS WELL ON FREEWAY FOLLOWING ANOTHER VEHICLE AND MAINTAINING A SAFE DISTANCE UNTIL THE CAR AHEAD SLOWS TO APPROX 22 MPH WHEN THE ACC BRAKING FEATURE STOPS WORKING AND THE HONDA PILOT CONTINUES COASTING CREATING A HAZARDOUS SITUATION AND POTENTIAL TO RAM THE CAR AHEAD.  THIS FEATURE IS CORRECTED WITH A LOW SPEED FOLLOW FEATURE IN OTHER HONDA AND LATER HONDA PILOT MODELS, AND SHOULD BE RETROACTIVELY ADDED TO THE 2018 HONDA PILOT TO PREVENT REAR ENDING THE CAR AHEAD.  *TR",
        "vin": "5FNYF6H05JB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/20/2020",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325339,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2018 HONDA PILOT EX 2WD, VIN NUMBER [XXX] WITH 57,100 MILES THAT I PURCHASED FROM EARNHARDT HONDA AVONDALE, AZ ON FEB 13, 2018.     ON MARCH 1, 2020 AT 0830 MY FAMILY OF 6 AND I WERE SEATED IN OUR CAR IN OUR GARAGE PREPARING TO LEAVE TO GO TO CHURCH. AS I PUSHED THE START BUTTON WE WERE ALL SHOCKED AS WE HEARD A LOUD BANG AND SAW SMOKE SPEWING FROM UNDERNEATH THE CAR HOOD. I QUICKLY INSTRUCTED MY FAMILY TO GET OUT OF THE CAR AND MOVE TO SAFETY. I THEN OPENED THE HOOD TO INSPECT WHAT HAPPENED. AFTER REMOVING THE PLASTIC COVER FROM THE BATTERY I FOUND OUT THAT THE BATTERY WAS CRACKED AND LEAKING FLUID. THE EXPLOSION WAS SO POWERFUL THAT IT CRACKED THE BATTERY AND THE BATTERY HOLDER.     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "5FNYF5H36JB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/19/2020",
        "dateOfIncident": "03/03/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318742,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR LOCKS ITSELF WHILE THE KEY FOB IS INSIDE THE CAR AFTER THE DRIVER CLOSES THE DOOR FROM THE OUTSIDE. THE KEY IS NOW LOCKED INSIDE THE CAR.",
        "vin": "5FNYF6H54JB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/19/2020",
        "dateOfIncident": "03/17/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318743,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PUSH BUTTON START FEATURE WILL NOT START THE VEHICLE. NO ERROR MESSAGES ARE DISPLAYED. 4 TO 7 REPEATED ATTEMPTS MUST BE MADE IN ORDER TO START THE VEHICLE.",
        "vin": "5FNYF6H54JB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/10/2020",
        "dateOfIncident": "03/09/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317205,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WOULD \"STALL OUT\" AT A STOP LIGHT OR STOP SIGN WHEN I WAS IN \"AUTO IDLE-STOP\" AND PRESSED ON THE GAS. I FIRST NOTICED THAT THE AUTO IDLE-STOP WAS HESITATING WHEN IT WOULD START UP. I ALSO NOTICED THAT THE RADIO WOULD \"CUT OUT\". AFTER THAT, THE VEHICLE WOULD JUST STALL OUT AND I WOULD HAVE TO PUSH PARK, PUT MY FOOT ON THE BRAKE AND THEN PUSH START. THIS HAS HAPPENED SEVERAL TIMES.",
        "vin": "5FNYF6H09JB"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/14/2020",
        "dateOfIncident": "02/11/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309118,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "HONDA PILOT 2018 WITH 20,555 MILES HAS A DIGITAL DISPLAY.   CAR WAS ON ADAPTIVE CRUISE. WEATHER WAS FINE. MY SPEED WAS APPROXIMATELY 61MPH WHEN THE SPEED LIMIT CHANGED TO 65MPH AS HWY BECAME I73. I USED + ACCELERATION BUTTON ON  RIGHT HAND COLUMN 4 TOUCHES TO INCREASE SPEED 1 MPH PER TOUCH TO 65MPH. CAR BEGAN TO RAPIDLY ACCELERATED TO 79MPH (LAST DIGITAL SPEED I SAW) AND I?M SURE HIGHER AS I  TRIED TO GAIN CONTROL. . MY FOOT HAD BEEN OFF PEDAL  WHILE CRUISE WAS ON  SO I LOOKED AND TOUCHED THE GAS PEDDLE WITH MY RIGHT FOOT TO SEE WHAT WAS HAPPENING. PEDAL  WAS DEPRESSED. AT THIS POINT I BELIEVE I TURNED OFF ADAPTIVE CRUISE BY THE MAIN BUTTON ON RIGHT HAND COLUMN BUT CAR CONTINUED TO ACCELERATE. I PUSHED THE DE ACCELERATION BUTTON - MANY TIMES AND CAR BEGAN TO SLOW DOWN UNCONTROLLABLY FAST REALIZING THIS I THEN PRESSED BRAKE PEDAL HARD AND THAT BROKE THE CONTROL OF THE ADAPTIVE CRUISE AND I WAS ABLE TO GET THE CAR TO THE SHOULDER OF THE ROAD.    HAD CAR TOWED TO DEALERSHIP. CROWN HONDA IN GREENSBORO SAID NO CODE WAS STORED FOR THE INCIDENT",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/09/2020",
        "dateOfIncident": "02/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308095,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST WHEN I BOUGHT THE VEHICLE NEW AFTER ONE MONTH A MESSAGE POPPED UP SAYING 'TRANSMISSION PROBLEM' ON THE DASHBOARD AND THE CAR ONLY HAD 2,000 MILES ON IT.  I TOOK THE CAR TO HONDA DEALER.  THEY DIDN'T DO ANYTHING AND SAID DON'T KNOW WHAT HAPPED AND THEY WERE ABLE TO REMOVE THE MESSAGE WITHOUT DOING ANY REPAIR. NOW THE 2018 HONDA PILOT HAS 24,000 MILES ON IT , THE VEHICLE JERKS AND I FELT THE TRANSMISSION FLARED AND HARD SHIFT IN GEAR 2ND TO 3RD. IT DOES NOT FEEL SAFE TO DRIVE THE CAR.  IT KEEPS ON JERKING WHEN YOU ARE DRIVING AT 30 MILES OF HOUR.",
        "vin": "5FNYF6H90JB"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/12/2020",
        "dateOfIncident": "01/11/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298849,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE CAME EQUIPPED WITH CONTINENTAL CROSS CONTACT LX SPORT TIRES. I HAVE DRIVEN CAR SINCE OCT 2018. TIRES WERE IMMEDIATELY LOSING AIR.. THEY HAVE BEEN FILLED SEVERAL TIMES WITH AIR. NOW THE 4 TIRES ARE SPLITTING EVERYWHERE THERE WAS A SEAM. 20000 MILES AND ROTATED AS REQUIRED AT HONDA DEALERSHIP. JUST NOTICED. NO IDEA WHEN IT ACTUALLY STARTED",
        "vin": "5FNYF6H08JB"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/04/2020",
        "dateOfIncident": "10/14/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297108,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER ONLY A FEW MONTHS OF OWNERSHIP AND ROUGHLY 6,500 MILES MY WINDSHIELD HAS TWO LARGE CRACKS IN IT FROM ROCKS HITTING IT. IT JUST SEEMS A BIT RIDICULOUS THAT THESE WINDSHIELDS ARE SO SUSCEPTIBLE TO DAMAGE IN SUCH A SMALL AMOUNT OF TIME.",
        "vin": "5FNYF6H34JB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/07/2019",
        "dateOfIncident": "11/02/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278784,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 11/2/19, WHILE DRIVING AT APPROXIMATELY 25 MPH, THE VEHICLE SHOWED THE MESSAGE \"TRANSMISSION PROBLEM\" ON THE DASHBOARD. AFTER THIS MESSAGE WAS DISPLAYED, THE VEHICLE WOULD ONLY STAY IN FIRST GEAR. I WAS ABLE TO SAFELY PARK THE VEHICLE IN A PARKING LOT. THE VEHICLE WAS JUST UNDER 16 MONTHS OLD AND HAD APPROXIMATELY 20,000 MILES ON IT. AFTER TURNING THE VEHICLE OFF AND THEN BACK ON, I WAS ABLE TO CHANGE THE GEARS ONCE AGAIN. I IMMEDIATELY CALLED HONDA ROADSIDE ASSISTANCE TO HAVE THE VEHICLE TOWED TO THE NEAREST HONDA DEALERSHIP, WHICH WAS OURISMAN HONDA IN TYSON'S CORNER VIRGINIA. I RECEIVED A CALL FROM A SERVICE ADVISOR AT OURISMAN HONDA ON 11/4/19. HE REFUSED TO ACKNOWLEDGE THAT THERE WAS A PROBLEM WITH THE TRANSMISSION AND NO REPAIR WAS MADE. WHEN I TOLD HIM WHAT HAPPENED, THE SERVICE ADVISOR STATED THAT IT IS LIKELY THAT THE VEHICLE EXPERIENCED A \"COMPUTER GLITCH\" AND THAT SIMPLY RESTARTING THE VEHICLE WOULD FIX THE PROBLEM IF IT HAPPENED IN THE FUTURE. I TOLD HIM THAT IT IS A SERIOUS SAFETY ISSUE TO HAVE TO RESTART A VEHICLE WHILE DRIVING. THE TRANSMISSION OFTEN EXHIBITS A \"STICKY CLUTCH\", DELAYED GEAR SHIFTING (SOMETIMES AS MUCH AS 2 SECONDS OF DELAY BEFORE THE GEAR IS SHIFTED), AND OFTEN TIMES A \"CLUNK\" IS HEARD WHEN THE GEAR IS CHANGED. THE PROBLEM USUALLY OCCURS IN EARLY GEARS (3RD, 4TH, AND 5TH GEAR) WHEN I LIFT MY FOOT OFF THE ACCELERATOR AT APPROXIMATELY THE TIME THE TRANSMISSION IS READY TO SHIFT TO THE NEXT HIGHEST GEAR.",
        "vin": "5FNYF5H97JB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/30/2019",
        "dateOfIncident": "01/30/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277176,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 HONDA PILOT. THE CONTACT STATED THAT ALL THE WINDOWS ROLLED DOWN WHEN THE UNLOCK BUTTON ON THE KEY FOB WAS TOUCHED WHILE IN THE CONTACT'S POCKET. THE FAILURE RECURRED FOUR TIMES. THE CONTACT CALLED AUTONATION HONDA AT 303-578-6112 (LOCATED AT 2999 WEST 104TH AVENUE, WESTMINSTER, CO 80234) AND WAS INFORMED THAT THE FAILURE WAS DUE TO A DESIGN FLAW FOR WHICH THERE WAS NO REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT NOTHING COULD BE DONE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 4,500. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/04/2019",
        "dateOfIncident": "09/18/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266089,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 HONDA PILOT. THE CONTACT STATED THAT THE VEHICLE JERKED, LUNGED, AND LOST POWER WHILE DRIVING 45 MPH. THE VEHICLE HAD TO BE TURNED OFF AND RESTARTED TO RESUME NORMAL OPERATION. DCH HONDA OF TEMECULA (26755 YNEZ RD, TEMECULA, CA 92591, (951) 268-9197) WAS CONTACTED AND SCHEDULED A DIAGNOSTIC APPOINTMENT. THE VEHICLE WAS NOT REPAIRED. THE FAILURE RECURRED MULTIPLE TIMES. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 31,000. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/30/2019",
        "dateOfIncident": "06/30/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11259123,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE NAVIGATION SCREEN OF THE VEHICLE BLACKS OUT INTERMITTENTLY AND WITHOUT WARNING WHEN I TURN ON THE VEHICLE. I HAVE CALLED THE NEAREST DEALER AT LEAST 3 TIMES OVER THE PAST 3 MONTHS AND THEY KEEP TELLING ME THAT HONDA IS SUPPOSEDLY WORKING ON THE ISSUE- BUT NOTHING SO FAR. SOMETIMES THE PROBLEM CLEARS WHEN I TURN OFF THE ENGINE AND RESTART BUT I NEVER KNOW WHEN IT IS GOING TO WORK OR NOT. CONTACTED HONDA CUSTOMER SERVICE- NO SATISFACTION.",
        "vin": "5FNYF6H9XJB"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/24/2019",
        "dateOfIncident": "07/30/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257804,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WE'VE HAD OUR PILOT FOR 8 OR 9 MONTHS AND WE'VE ALREADY HAD TO HAVE THE HOME LINK BUTTON REPLACED, THE ALIGNMENT DONE TWICE AND NOW THE MASTER CYLINDER IS FAILING. WE ARE TAKING IT IN TODAY TO HAVE THE MASTER CYLINDER REPLACED. IT WAS NOT PROPERLY PRESSURIZING THE BRAKE LINES AND WAS CAUSING A WOBBLING IN THE BRAKES AT HIGHER SPEEDS. THE DEALERSHIP HAS BEEN A REAL PAIN TO WORK WITH AND DID NOT DIAGNOSE THE ISSUE UNTIL MONTHS LATER WHEN IT HAPPENED ON A RIDGELINE. LAST HONDA I'LL EVER BUY.",
        "vin": "5FNYF6H8XJB"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/05/2019",
        "dateOfIncident": "07/28/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241909,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "LANE KEEP ASSIST WILL TRIGGER MULTIPLE TIMES ON TWO LANE ROADS. IT WILL ACTIVATE WITH THE \"BRAKE\" MESSAGE IN THE CLUSTER. THE SYSTEM IS TOTALLY UNUSABLE AND UNSAFE. IT HAS BEEN INTO THE DEALERSHIP MULTIPLE TIMES WITH A NO PROBLEM FOUND ANSWER. DURING A ONE AND A HALF OR TWO HOUR DRIVE THE SYSTEM WILL TRIGGER FIFTEEN TIMES OR MORE. AVERAGE SPEED IS ABOUT 50 TO 55 MILES PER HOUR. IT HAPPENS ON STRAIGHT OR CURVED ROADWAYS. CLEAR WEATHER AND IN THE SUN OR SHADE.",
        "vin": "5FNYF5H98JB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/19/2019",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233393,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "6/13  5:10 PM ON I-95 N 30 MINUTES SOUTH OF FREDERICKSBURG, VA WAS GOING 78 MPH WHEN ALL OF THE SUDDEN 'BLIND SPOT SENSOR ERROR' APPEARED ON DASH AND WITHIN 10 SECONDS TRANSMISSION ERROR - SEE OWNERS MANUAL - GET SOMEWHERE SAFE APPEARED  ON THE DASH. THE 2018 HONDA PILOT ELITE IMMEDIATELY SWITCHED INTO NEUTRAL AND WENT FROM 78 MPH TO 60 MPH IN 10 SECONDS. IT WAS A TOTAL FAILURE OF THE TRANSMISSION. IT HAD TO BE REPLACED. IT TOOK THEM A WEEK TO PUT IN THE REMANUFACTURED TRANSMISSION AND SINCE THAT TIME, THE FOLLOWING HAS HAPPENED:  7/1 NIGHT TIME ABOUT 8 PM WAS STOPPED AT A STOP SIGN WHEN I WENT TO GO IT STARTED THEN STUTTERED - IT SEEM LIKE IT TRYING TO FIND THE GEAR' THEN FINALLY SEEM LIKE IT WENT INTO THIRD GEAR' IT DID THE SAME THING ON THE WAY HOME IN A DIFFERENT AREA.  7/2 ON THE WAY TO DEALER WAS MAKING A RIGHT TURN -SLOW DOWN TO MAKE THE TURN, AND WHILE MAKING THE TURN I HIT THE GAS AND IT STUTTERED AGAIN  7/2 IN VIRGINIA AFTER FREDERICKSBURG AND BEFORE MANASSAS ON 95 N. I TURNED OFF AN EXIT AND STARTED TO DO A U-TURN... I CAME TO A STOP TO WAIT ON TRAFFIC AND WHEN I STARTED UP AGAIN, IT STARTED AND THEN STUTTERED AND THEN WENT   7/3 AT ABOUT 1030 PM ........13106 WAS GOING ABOUT 10-15 MPH PUSH THE ACCELERATOR  DOWN AND THE ENGINE JUST REVVED AND DIDN'T GO SO I HIT THE BRAKES SO THAT I WOULD STOP AT THE LIGHT AS IT WAS YELLOW AT THE TIME  7/4  IT STUTTERED SEVERAL TIMES. SEVERAL TIMES WHEN COASTING THEN HITTING THE GAS IT WOULD STUTTER, SOMETIMES JERK AND SOMETIMES MAKE A NOISE  IT HAS BEEN INTO THE DEALER 3 TIMES SINCE THE REPLACEMENT TRANSMISSION AND THEY CAN'T FIND ANYTHING WRONG WITH IT. ONE DAY I SAT AT THE DEALERSHIP FOR OVER 4 HOURS AND WAITED ON THE DISTRICT REP - HE DID SHOW UP BUT WOULD NOT SPEAK TO ME AND WOULD NOT LET ME DRIVE THE CAR WHEN HE RODE IN IT TO SEE WHAT WAS GOING ON.",
        "vin": "5FNYF6H07JB"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/19/2019",
        "dateOfIncident": "07/04/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233482,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE THE TRANSMISSION WAS REPLACED AT 12,181 MILES IN JUNE 2019 ON A 2018 HONDA PILOT ELITE, OTHER ISSUES HAVE POPPED UP.  THE FORWARD COLLISION SYSTEM HAS GONE OFF TWICE ON A 2 LANE STATE HIGHWAY.   IN BOTH CASES, I WAS ON A 2 LANE HIGHWAY GOING ABOUT 50 MILES AN HOUR WITH NO CARS IN FRONT OF ME FOR AT LEAST A MILE OR TWO, NO VEHICLES COMING THE OTHER WAY, ON A STRAIGHT PART OF THE ROAD, NOTHING IN THE ROAD AND NOTHING ON THE SIDE OF THE ROAD. THE DEALER SAID THAT IT DIDN'T HAPPEN TO THEM WHEN DRIVING THE CAR, SO THERE'S NOTHING TO FIX &  HONDA CORPORATION SAID THE DEALER COULDN'T FIND ANYTHING TO FIX.    ONE NIGHT WHEN DRIVING ON THE INTERSTATE IT IT STOPPED RAINING BUT WAS VERY MUGGY AND THERE WAS MOISTURE ON THE WINDSHIELD THE AUTOMATIC WIPERS DID NOT COME ON AND THE DEFROST DID NOT WORK -   THIS WAS OVER THE COURSE OF SEVERAL HOURS OF DRIVING TRYING DIFFERENT TEMPERATURES ON DEFROST AND NOTHING HELPED. EVEN WITH THE WIPERS ON MANUALLY, VISIBILITY WAS POOR.   ALSO, ONE DAY AFTER THE CAR HAD BEEN SITTING ALL DAY I DROVE IT 20 MILES AND THE CAR DID NOT COOL DOWN - I HAD TO RUN THE AIR CONDITIONER ON FULL BLAST THE WHOLE TIME.  THE CAR IS NOT COOLING LIKE IT SHOULD!  OF COURSE, WHEN THEY TRIED IT OUT IT HAD ACTUALLY ALREADY BEEN DRIVEN 20 MILES TO THE DEALERSHIP WITH THE AIR IN EARLY MORNING AND THEN THE HONDA SERVICE DEPARTMENT TESTED IT OUT, THERE WAS COOL AIR AND SAID IT'S BLOWING JUST FINE NOW.",
        "vin": "5FNYF6H07JB"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/08/2019",
        "dateOfIncident": "05/07/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206293,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 HONDA PILOT. WHILE DRIVING 30 MPH, THE VEHICLE ACCELERATED WITHOUT WARNING. THE CONTACT APPLIED THE BRAKES, BUT THE VEHICLE LUNGED FORWARD VIOLENTLY AND MADE A LOUD NOISE. ALSO, THE RPMS INCREASED. THE VEHICLE WAS TOWED TO HEADQUARTER HONDA (17700 FL-50, CLERMONT, FL 34711, (407) 395-7500) WHERE IT WAS DIAGNOSED THAT AN UNKNOWN PART ATTACHED TO THE TRANSMISSION WAS FAULTY. THE DEALER STATED THAT THEY WOULD NOTIFY THE MANUFACTURER. THE VEHICLE WAS BEING REPAIRED UNDER THE WARRANTY. THE VIN WAS UNKNOWN. THE FAILURE MILEAGE WAS 14,200.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/07/2019",
        "dateOfIncident": "11/05/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206670,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 HONDA PILOT. CONSUMER WRITES IN REGARD TO MALFUNCATIONS WITH THE VEHICLE THAT PREVENTS IT FORM START UP. *AS  *JS",
        "vin": "5FNYF6H3XJB"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/12/2019",
        "dateOfIncident": "03/09/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186259,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SATURDAY I WAS DRIVING MY 10 MONTH OLD 2018 HONDA PILOT WITH APPROX. 7,000 MILES ON IT TO AIRPORT TO PICK UP MY DAUGHTER. MY HUSBAND AND 3 YOUNG KIDS WERE MERGING ONTO AIRPORT PROPERTY ON A EXTREMELY BUSY AFTERNOON, MY VEHICLE STALLED. IT WAS LIKE A COMPLETE ELECTRICAL FAILURE. I WAS LEFT STRANDED AT 7PM, IN DARK, WITH 3 SCARED CHILDREN, UNABLE TO ALERT OTHER HOSTILE DRIVERS AROUND ME BY TURNING ON FLASHERS. AFTER NOT BEING ABOUT TO PUSH VEHICLE OUT  WAY OF HEAVY TRAFFIC, I WAS FORCED TO CALL MY INSURANCE COMPANY FOR ASSISTANCE WHICH PROVED TO BE A SERIOUS CHALLENGE DUE TO THE HORNS AND DEROGATORY LANGUAGE OF OTHER DRIVERS AND AS A RESULT MY CHILDREN HAVING AN EMOTIONAL BREAKDOWN IN THE BACK SEAT. MY HUSBAND WAS FORCED TO LEAVE THE KIDS AND I IN THIS VERY DANGEROUS SITUATION IN ORDER TO GET TO OUR 14 YR OLD DAUGHTER (TRAVELING ALONE) OFF HER FLIGHT.   ONCE POLICE ARRIVED, THEY PARKED UNIT BEHIND ME IN ORDER TO PROTECT US FROM BEING HIT. THE POLICE SEARCHED MANUAL AND INTERNET AND WERE UNABLE TO GET VEHICLE INTO EMERGENCY NEUTRAL. THE VEHICLE HAD TO BE DRUG ONTO TOW TRUCK AND TOWED TO DEALERSHIP.   2 DAYS LATER, HONDA INFORMED ME IT WAS A \"DEAD BATTERY.\"  \"BATTERY?\" I HAVE BEEN DRIVING FOR OVER 20 YEAR AND HAVE NEVER BEEN LEFT ON HIGHWAY, IN MOTION DUE TO A BATTERY. AFTER SOME READING OF MY OWN, I LEARNED ABOUT A FUEL SAVING FEATURE ON MY CAR CALLED \"AUTO IDLE-STOP\". WITH THIS FEATURE MY ENGINE SHUTS OFF WHEN BRAKE COMPRESSED IN ORDER TO SAVE ON FUEL. WITH A DEAD BATTERY, THE BATTERY WAS UNABLE TO RESTART VEHICLE. SO BASICALLY THIS FUEL SAVING FEATURE TURNS OUT TO BE A SERIOUS SAFETY PROBLEM BECAUSE INSTEAD OF BEING STRANDED IN A PARKING LOT , I WAS STRANDED IN THE MIDDLE OF A HIGHWAY. AFTER FURTHER READING ABOUT THIS FEATURE, I LEARNED THAT MY VEHICLE SHOULD HAVE AUTOMATICALLY ENABLED THIS AUTO-IDLE IF BATTERY CHARGE WAS LOW, WHICH DID NOT HAPPEN.",
        "vin": "5FNYF6H08JB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/04/2019",
        "dateOfIncident": "03/02/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183897,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUNROOF SHATTERED/EXPLODED WHILE DRIVING DOWN THE HIGHWAY AT 65MPH. THERE WAS A LOUD NOISE. NO EXPLANATION FOR WHY.",
        "vin": "5FNYF5H81JB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/21/2019",
        "dateOfIncident": "02/15/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181558,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE DOOR GLASS SPONTANEOUSLY EXPLODING. WE WERE IN MOTION 65 MPH ON THE HIGHWAY. NO OTHER CARS AROUND US OR AROUND ANY HOUSES. WINDOW WENT BOOM AND JUST EXPLODED.",
        "vin": "5FNYF6H66JB"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "02/20/2019",
        "dateOfIncident": "02/04/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11181337,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SUDDEN ACCELERATION WHILE PULLING INTO A PARKING SPACE IN COVERED PARKING GARAGE.  CAR ENGINE REVVED WHILE PULLING INTO SPACE.  BRAKES APPLIED LEAVING SKID MARKS ON CONCRETE.  CAR WAS DAMAGED BE HITTING CONCRETE RETAINING WALL.",
        "vin": "4T1BK36B46U"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/16/2019",
        "dateOfIncident": "02/15/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180553,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER'S SIDE SEAT BELT IS CONSIDERABLY SHORTER THAN THE FRONT PASSENGER SEAT BELT.  THE DRIVER'S SEAT BELT IS SO CONSTRICTING THAT YOU CAN'T TURN TO LOOK  WHEN CHANGING LANES.  SO THE NEED TO DRIVE WITHOUT USING THE SEAT BELT IS AN ISSUE OF SAFETY.  I AM AN AVERAGE SIZE PERSON AND THIS HAS NEVER BEEN A PROBLEM IN ANY OTHER VEHICLE I HAVE OWNED.",
        "vin": "5FNYF6H36JB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/10/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11176063,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "IN MAY 2018 I PURCHASED A NEW 2018 HONDA PILOT.  UNFORTUNATELY DURING THIS FIRST WINTER I HAVE FOUND OUT THAT THIS VEHICLE DOES NOT HAVE A FUNCTIONING HEATER. AS SOON AS THE WEATHER TURNED COLD I NOTICED THAT THIS NEW HONDA PILOT DID NOT HAVE SUFFICIENT HEAT.  WHILE DRIVING AT HIGHWAY SPEEDS THE HEATER FUNCTIONS OK BUT DURING CITY DRIVING, OR ESPECIALLY AT IDLE, THE TEMPERATURE FALLS WELL BELOW ANY ACCEPTABLE MINIMUM REQUIREMENTS. BELOW IS A CHART SHOWING A COMPARISON BETWEEN A FUNCTIONING HEATER IN A 2014 CRV VERSUS THIS NEW 2018 HONDA PILOT.  PLEASE NOTE THE DIFFERENCES IN OUTSIDE AIR TEMPERATURES:  THE CRV MEASUREMENTS WERE TAKEN AT AN OUTSIDE AIR TEMP OF -8 WHILE THE PILOT DATA WAS RECORDED WITH AN OUTSIDE AIR TEMP OF + 8.     THE VENT TEMPERATURE VARIES CONSIDERABLY BASED ON THE ENGINE RPM.  WHILE ACCELERATING THE TEMPERATURE IS WARM / HOT BUT WHILE DRIVING IN TRAFFIC OR STOPPED THE TEMPERATURE CAN DROP 80 DEGREES OR MORE IN 1-2 MINUTES.      BASED ON THIS DATA, I MADE TWO SEPARATE APPOINTMENTS TO HAVE THE PILOT SERVICED UNDER WARRANTY AT MY LOCAL HONDA DEALER.    THE WEATHER ON THE 2ND VISIT WAS COLD (-17 DEGREES F).  THEY 'VERIFIED THE COMPLAINT' AND FOUND THAT THE VENT TEMPERATURE FROM A FULLY WARMED UP ENGINE WAS 28 DEGREES (YES, BELOW FREEZING!).  THEY SAID THEY HAVE ANOTHER PILOT IN THEIR SHOP THAT DOES THE SAME THING THEREFORE THERE IS NOTHING WRONG WITH MINE AND CONSIDERED MINE AS FUNCTIONING 'NORMAL'.       THEY DID NOT DO ANY DIAGNOSTIC WORK AND REFUSED TO DO ANY WORK, EVEN SIMPLE WORK SUCH AS TRYING TO FLUSH THE HEATER CORE OR REMOVE ANY AIR FROM THE SYSTEM.  THEY STATED THAT HONDA PUT IN AN UNDERSIZED HEATER CORE IN THE PILOT AND THEREFORE THEY WERE NOT GOING TO WASTE THEIR TIME TRYING TO FIX. SINCE I LIVE IN CHICAGO THERE ARE 5 MONTHS OF COLD WEATHER SO I DO NOT CONSIDER A LACK OF HEAT A MINOR INCONVENIENCE NOR AN ACCEPTABLE TO LIVE WITH.",
        "vin": "5FNYF6H51JB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/09/2019",
        "dateOfIncident": "01/05/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11175830,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION JERKS, HESITATES AND/OR CLUNKS WHEN CHANGING AND/OR ATTEMPTING TO CHANGE TO NEXT HIGHER GEAR,   HESITATES AND/OR REVERTS TO NEXT LOWER GEAR WHEN IT SHOULD SHIFT TO NEXT GEAR.  THIS HAPPENS WHEN DRIVING ON LEVEL SURFACES AND DOWN HILLS CAUSING PASSENGERS TO JERK FORWARDED SUDDENLY AND WITHOUT EXPECTATION.  HONDA DEALER KEPT VEHICLE FOR 2 DAYS AND DID NOT FIND ANY ISSUES.  PURCHASED VEHICLE NEW IN APRIL 2018, HAD SAME PROBLEM SINCE WEEK #1. WHEN SHIFTING MANUALLY DOES NOT EXPERIENCE HESITATION OR GEAR HUNTING BUT CLANKING STILL EXISTS.    THESE EVENTS HAPPEN REGARDLESS OF ROAD SURFACE TYPE, SPEED OR INCLINE OF ROAD.  I NOTICED A TRANSMISSION FLUID LEAK AT THE TRANSMISSION GASKET DURING 1ST OIL CHANGE AT 7500 MILES,     UNDECIDES TO ,   (I.E., FROM PARK TO / FROM DRIVE; INTO/OUT",
        "vin": "5FNYF6H06JB"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/08/2019",
        "dateOfIncident": "02/08/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11175761,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN USING THE DRIVERS SIDE SEAT BELT, THERE IS NO EXTRA GIVE IN THE BELT. THE BELT IS VERY TIGHT AND THE DRIVER CAN NOT EVEN TURN TO CHECK THEIR BLIND SPOT. THIS IS VERY DANGEROUS. I HAVE HAD THIS VEHICLE SINCE SEPTEMBER 2018. I HAVE TRIED ADJUSTING THE SEAT FURTHER AWAY FROM THE WHEEL, HOWEVER, THE BELT SEEMS TOO SHORT.",
        "vin": "5FNYF5H55JB"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/01/2019",
        "dateOfIncident": "12/30/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164334,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2018 HONDA PILOT ELITE TURNS ON THE \"AUTO IDLE STOP\" FEATURE EACH TIME I START THE VEHICLE. BASICALLY, THIS MEANS THAT THE ENGINE SHUTS OFF WHEN I'M AT A COMPLETE STOP. WHEN I RELEASE THE BRAKE, THE ENGINE STARTS AGAIN. HOWEVER, THERE IS LAG TIME BETWEEN THE TIME I RELEASE THE BRAKE AND ACCELERATION. THIS HAS NEARLY CAUSED A DEATHLY ACCIDENT ON MORE THAN A DOZEN OCCASIONS DURING THE PAST 6 MONTHS AT INTERSECTIONS. I'VE NEARLY BEEN T-BONED EACH AND EVERY TIME BECAUSE THE VEHICLE WILL SIMPLY NOT ACCELERATE AT THE PRECISE MOMENT WHEN I NEED IT TO. THERE IS OVER A 1 SECOND LAG BEFORE ACCELERATION OCCURS. PERHAPS THIS IS MEANT TO BE AN EMISSIONS CONTROL FEATURE, BUT IT COMES AT THE PRICE OF SAFETY. THIS \"AUTO IDLE STOP\" FEATURE MAKES THE VEHICLE COMPLETELY UNSAFE TO DRIVE FOR FAMILIES. THERE SHOULD BE A PERMANENT ON/OFF SWITCH RATHER THAN HAVING TO TURN THIS FEATURE OFF EACH AND EVERY TIME I START THE VEHICLE. COMPLETELY UNSAFE!",
        "vin": "5FNYF6H09JB"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/01/2019",
        "dateOfIncident": "12/30/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164335,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 HONDA PILOT ELITE--  WHILE DRIVING ON A SMALL, CONGESTED, CURVY TWO-LANE ROAD, IN A POPULAR TOURIST DESTINATION, MY FRONTAL IMPACT SENSORS ALERTED ME TO FRONTAL IMPACT MULTIPLE TIMES BY SHAKING MY STEERING WHEEL. THE DASH LIGHTS ALSO FLASHED THE WORD \"BRAKE\" IN ORANGE AND BLACK.    THIS SO-CALLED \"SAFETY\" FEATURE ALMOST CAUSE ME TO LOSE CONTROL OF THE VEHICLE SEVERAL TIMES ON THIS ROAD BECAUSE OF THE SHAKING STEERING WHEEL.    THIS FRONTAL IMPACT ALERT ALWAYS OCCURRED WHEN A LARGE RV TYPE OF VEHICLE PASSED BY ME. ALTHOUGH I LATER DISCOVERED AN \"OFF\" SWITCH FOR THIS FRONTAL IMPACT ALERT SYSTEM, I SHOULDN'T HAVE TO TURN OFF MULTIPLE \"SAFETY\" SENSORS EVERY TIME I START THE VEHICLE. IF YOU DO NOT TURN OFF THESE \"SAFETY\" SENSORS, THEY WILL ACTUAL CREATE UNSAFE CONDITIONS BY SHAKING YOUR STEERING WHEEL.",
        "vin": "5FNYF6H09JB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/28/2018",
        "dateOfIncident": "12/28/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163771,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE AUTO LOCKED WITH KEYS IN CAR AND COULD NOT UNLOCK.  FORTUNATELY, CAR WAS IN MY GARAGE AND DID NOT CREATE A SAFETY ISSUE.  HOWEVER, HAD THIS OCCURRED IN THE SUMMER WITH A SMALL CHILD OR PET INSIDE, IT COULD HAVE BEEN AN EXTREME SAFETY HAZARD, POSSIBLY LEADING TO FATAL CONSEQUENCES.  THIS VEHICLE IS NEVER SUPPOSED TO LOCK WITH KEYS IN THE CAR.",
        "vin": "5FNYF6H6XJB"
    },
    {
        "components": "SEATS,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/12/2018",
        "dateOfIncident": "08/17/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11160889,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SEAT SINKS AND CHANGES THE SEAT/MIRROR FIELD OF VISION OF THE REAR VIEW MIRRORS.  THIS \"SINK\" HAPPENS SLOWLY (AND WITHOUT NOTICE) CAUSING DANGEROUS BLIND SPOT SITUATIONS WHILE DRIVING AND PARKING.  THE \"SINK\" BEGAN ON FIRST DAY OF OWNERSHIP BUT I DIDN'T REALIZE IT AND ALMOST CAUSED AN ACCIDENT BECAUSE OF THE CHANGE IN SEAT VS REAR VIEW MIRROR POSITION.  I AM THE ONLY DRIVER OF SUV.   MALE, 69 YEARS OLD. 180 LBS.  DRIVER'S SEAT SLOWLY SINKS OVER TIME. APPROXIMATELY 2-5\" PER DAY.  WHILE DRIVING, IN ALL INSTANCES.  ALSO WHEN THE SUV IS SITTING PARKED AND EMPTY OF PASSENGERS, BUT SINK IS SLOWER.  DEALER AND HONDA MAIN PHONE COMPLAINT SITE SAY IT IS NORMAL.  SERVICE WOMAN AT LOCAL BETTEN-BAKER HONDA SAID SHE HAS 2016 PILOT WITH THE SAME SEAT AND ISSUE. SAID THE SINK IS NORMAL.  I BELIEVE IT IS POSSIBLY A LEAKING AIR BLADDER. CAUSE UNKNOWN.  LX MODEL WITH 5000 MILES.",
        "vin": "5FNYF6H12JB"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/03/2018",
        "dateOfIncident": "11/28/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11155614,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "HIGHWAY DRIVING, APPARENTLY A SMALL STONE HIT THE WINDSHIELD. (PICTURE ATTACHED) AND THE WINDSHIELD CRACKED.  THE STONE IN BARLEY 1/4 INCH IN SIZE.  THIS IS NOT UNUSUAL SITUATION, A WINDSHIELD SHOULD NOT CRACK, THIS IS A NORMAL DRIVING SITUATION.  THE ISM'S WINDSHIELD IS ON BACK ORDER, AND WILL TAKE 4 WEEKS TO RECEIVE, AS ONLY HONDA CAN RECALIBRATE THIS AT THIS TIME, THEY WILL ONLY RECALIBRATE AN OEM WINDSHIELD.",
        "vin": "5FNYF6H97JB"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/28/2018",
        "dateOfIncident": "11/28/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154596,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS STOPPED IN A PARKING LOT IN \"DRIVE\" WITH THE AUTO-IDLE FEATURE IN USE. CAR WOULD NOT RE-START WHEN FOOT TAKEN OFF BRAKE. RADIO CUT OUT BRIEFLY AS WELL. DASHBOARD LIT UP WITH MANY ERROR MESSAGES - ONE OF THEM WAS \"COLLISION MITIGATION PROBLEM\" OR SOMETHING SIMILAR. PLACED CAR IN PARK AND PUSHED START BUTTON NUMEROUS TIMES. ONLY GOT CLICKING SOUNDS, WITH OCCASIONAL ENGINE TURNOVER NOISE, BUT IT WOULDN'T START. TURNED OFF A/C AND RADIO. CAR FINALLY STARTED AFTER SEVERAL MORE MINUTES OF PUSHING START BUTTON WHILE IN PARK WITH FOOT ON BRAKE.",
        "vin": "5FNYF6H09GB"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/15/2018",
        "dateOfIncident": "11/15/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151695,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A STATE HIGHWAY, TRAVELLING AT APPROXIMATELY 60 MPH, I HEARD A LOUD 'POP' AND SAW DEBRIS FLY IN MY REAR VIEW MIRROR.  AT FIRST I THOUGHT IT WAS A TIRE, BUT FOUND MY SUNROOF HAD EXPLODED.  THERE WERE NO ROCKS, PROJECTILES, ETC, AND NO OVERHEAD STRUCTURES WHERE SOMETHING COULD HAVE FALLEN.  THE GLASS BLEW OUT AS IT MAY HAVE BEEN UNDER STRESS AND NOT IN AS IF SOMETHING MAY HAVE HIT IT.",
        "vin": "5FNYF6H06JB"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/26/2018",
        "dateOfIncident": "10/26/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11143063,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S FRONT SEAT BELT IS DRASTICALLY SHORTER THAN PASSENGER FRONT SEAT BELT. I AM RESTRICTED IN ABILITY TO LOOK AROUND AND MAKE SURE THERE IS NO OTHER VEHICLE IN MY BLIND SPOT. THERE IS NO FIX FOR THIS PER THE DEALER AS HONDA DOES NOT ACKNOWLEDGE AN ERROR. THIS IS A SERIOUS SAFETY ISSUE AND NEEDS TO BE ADDRESSED BY THE MANUFACTURER.",
        "vin": "5FNYF5H35JB"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/16/2018",
        "dateOfIncident": "09/04/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129775,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE SEAT BELT IS SHORT LOCKS. IN ADDITION, IT PROHIBITS AND RESTRICTS DRIVER FROM LEANING FORWARD. THIS CAUSES AN UNSAFE DRIVING CONDITION.",
        "vin": "5FNYF5H51JB"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/16/2018",
        "dateOfIncident": "09/16/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129791,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SIDE SEATBELT ON MY 2018 HONDA PILOT IS NOT THE STANDARD SIZE AND IS SHORT. IT DOES NOT EXTEND LIKE THE PASSENGER SEATBELT AND PREVENTS THE DRIVER FROM LEANING FORWARD TO CHECK OUT IT IS SAFE TO TURN. THE DRIVER SEATBELT DOES NOT LOCK IN PLACE WHEN STOPPING VEHICLE.",
        "vin": "5FNYF5H18JB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/27/2018",
        "dateOfIncident": "08/16/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122689,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE MOONROOF SHATTERED EXPLODING GLASS. THE VEHICLE WAS ON A HIGHWAY TRAVELING AT 60MPH. THERE WAS JUST A LOUD NOISE AND BOOM. WE OWNED THE CAR JUST FOUR MONTHS AND IT HAS ONLY 6,200 MILES ON IT AT THE TIME OF THIS INCIDENT.",
        "vin": "5FNYF5H64JB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/02/2018",
        "dateOfIncident": "07/31/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115288,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MY 2018 HONDA PILOT - EXL, THE SUNROOF EXPLODED TWICE (SHATTERED). THE FIRST TIME WAS ON FEB 2018 AND THE SECOND TIME WAS ON JULY 2018.",
        "vin": "5FNYF5H55JB"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/19/2018",
        "dateOfIncident": "06/28/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112361,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER'S SIDE SEAT BELT IS TOO SHORT.  IT IS TIGHT ACROSS MY CHEST AND THE LEFT SIDE OF MY NECK.  THE DEALER OFFERS NO FIX FOR THE OTHER THAN A SEAT BELT EXTENDER WHICH HONDA DOES NOT SELL.  I AM 5'2' TALL AND 220 LBS.  YES I AM OVER WEIGHT BUT I'VE OWNED 8 OTHER HONDA'S AND HAVE NEVER HAD THIS PROBLEM BEFORE.  I AM NOW STUCK WITH A BRAND NEW VHICLE I DON'T FEEL SAFE DRIVING.",
        "vin": "5FNYF6H59JB"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "05/16/2018",
        "dateOfIncident": "04/13/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096362,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE SEAT BELT IS TOO SHORT, NOT AS LONG AS PASSENGERS SEAT BELT.  IT PROHIBITS / RESTRICTS LEANING FORWARD TO CHECK ONCOMING TRAFFIC (BOTH LOOKING LEFT AND RIGHT) AT INTERSECTIONS AND MERGING SITUATIONS.  I BELIEVE THIS CAUSES AN UNSAFE DRIVING CONDITION.",
        "vin": "5FNYF6H57JB"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/09/2018",
        "dateOfIncident": "03/09/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11078311,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVERS SIDE SEAT BELT IS MUCH SHORTER THAN THE PASSENGER SIDE. UNLESS YOU ARE AN EXTREMELY SMALL PERSON IT IS DIFFICULT TO MOVE OR CLEARLY LOOK AT YOUR BLIND SPOTS WHEN DRIVING.  THE SEAT BELT SITS ACROSS YOUR NECK AND BREAST WHICH WOULD CAUSE MAJOR DAMAGE IN AN ACCIDENT.  THIS IS A DESIGN FLAW.  THIS SEAT BELT WAS MADE TOO SHORT.",
        "vin": "5FNYF5H57JB"
    }
]