[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/28/2022",
        "dateOfIncident": "02/22/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458677,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Honda Civic. The contact stated while driving approximately 20 MPH, several unknown warning lights illuminated and the vehicle started to idle very rough. The contact had taken the vehicle to a local dealer however, the vehicle was not diagnosed. The contact drove the vehicle to an independent mechanic who diagnosed that there was an engine cylinder misfire failure with DTC codes: P0302 and P0303. Additionally, the contact stated that there was a strong smell of gasoline in the cabin of the vehicle. The vehicle was not repaired. The manufacturer had been informed of the failure. The failure mileage was approximately 80,000.",
        "vin": "2HGFC3A39JH"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/24/2022",
        "dateOfIncident": "03/24/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458254,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The automatic break warning came on with no one in front of me and the car came to a halting stop. Thankfully the car behind me was paying attention otherwise i would have been rear ended.  I think this happened one other time, but I recall someone in front of me.  The incident today 3-24-2022 was very distinctive.",
        "vin": "19XFC1F99JE"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/10/2022",
        "dateOfIncident": "02/03/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456231,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Failed component:  electronic steering gearbox and Steering Electric Power Assist System Safety:  The steering wheel maneuverability is compromised by continuously pulling to the left and requiring the driver to pull the wheel to the right for correction or vehicle will drift into the left lane, increasing the risk of a crash.  This back and forth movement to correct the steering wheel pull requires the driver to constantly move the steering wheel back and forth to keep the vehicle in the current lane.  Problem brought to Slidell Honda dealer 3/9/2022.   Dealer did a sensor relearn but unsuccessful.  Dealer recommends replacement of electronic steering gearbox, for which there is a current Honda recall C2N, P20 but does not include my VIN#.  Reported to Honda, case no. [XXX].  Honda offers to pay 75% of my repair cost which is unacceptable for a defective part that is under a recall.   NHTSA Campaign ID Number: 18V663000  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).”",
        "vin": "2HGFC1F41JH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/09/2022",
        "dateOfIncident": "03/06/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455922,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The steering wheel sticks, so if traveling at highway speeds and you need to do a subtle course correction to stay centered in your lane, the force necessary to 'unstick' the steering wheel causes an oversteer condition and can cause you to exit your lane unintentionally. This is apparently a known issue but Honda is not addressing.",
        "vin": "JHMFC1F77JX"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/07/2022",
        "dateOfIncident": "02/26/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455553,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving on a surface street going approximately 5 - 8 mph and was 2-3 car lengths from the vehicle in front of me when my vehicles automatic emergency braking system engaged without warning, causing the car behind me to have to brake abruptly.",
        "vin": "JHMFC1F95JX"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/07/2022",
        "dateOfIncident": "02/21/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455607,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 Civic Hatchback with less than 18,000 miles on it - noticed A/C was not blowing cool air, so took it into dealership for evaluation. Was told the freon was low but the issue was not due to the condenser and would not be covered under the 2016-19 Civic A/C Condenser Warranty extension. Dealership said they looked at everything possible without disassembling through the dash and so gave me the option to either perform a diagnostic leak test/Freon recharge ($400, with the caveat that the leak may still be there and this would be a temporary fix) or to replace the evaporator entirely ($1800). Unfortunately the car is no longer covered under factory warranty since it’s over 3yrs old. Does not make sense that for a vehicle that’s <4 years old with <18K miles this is an issue.",
        "vin": "SHHFK7H21JU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/12/2022",
        "dateOfIncident": "12/19/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447179,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The AC on my vehicle has broken three times since I bought the car in 2018.  The compressor and condenser have been replaced but this time it's likely the evaporator.    I have been told that it will cost thousands of dollars since the entire dashboard will have to be removed.  And I don't know if it's even worth fixing if this cycle of breakdowns is going to repeat itself every year.  I am so disappointed because I am a long time Honda owner and there has been no support from corporate so far.  The only thing they have done recently is that they continually hound me to invest in an extended warranty.  But I believe that I shouldn't be forced to invest more money in order to pay for a defect on their end. Who knew that a Honda could be a lemon?",
        "vin": "SHHFK7H54JU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/11/2022",
        "dateOfIncident": "01/07/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447073,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I am experiencing issues with my 2018 Honda Civic LX A/C. Here is the history of the A/C issues.  December 2020 A/C stopped working and went in for maintenance for a check up. Told me condenser was leaking and needed to be replaced and was covered under warranty. However the condenser was back ordered and I couldn't get it replaced at that time.  April 2021 Condenser was in stock and went into the dealership to get it fixed on warranty.  January 2022 A/C was blowing hot air again so I bought it back to the dealership. Was told the evaporator/compressor was leaking and was quoted $4,000 to get it fixed.  Summary: Had constant A/C issues and was finally quoted $4,000 to fix the A/C on a car that is only 4 years old.",
        "vin": "2HGFC2F55JH"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/06/2022",
        "dateOfIncident": "08/27/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446503,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I got the car with free accident carfax at Toyota in Waldorf Md . A Honda Civic 2018 with 39000 . The radio wasn’t working and one speaker was broke , they promise me that they were going to fix it , when I tried to find the antena I realize that the back window wasn’t from the manufacture so I took the car to the dealer they sent me to Honda in Waldorf they didn’t  want to fix it cuz I bough the car at Toyota after I left I was making a turn I can said I was like 5 or leas miles an hour and the airbag deployed on me with no accidents ( when I had the car not even a month ) when I took the car to the dealer the manager told me that they were goi g to check the car , after 2 weeks I kept passing by the dealer and the car wasn’t moving when I asked they said it was dangerous to drive but I have to move the car cuz the airbag was deployed cu of my fault I said why ? He didn’t have an answer and since then they ignore me and they don’t want to fix the car when they lie to me with a clean carfax and I found out too that the car has been in the coalition by Toyota . They said that I got the front of the car cuz the tag was bend but if u see the picture when I got the car it was already bent , the rims were different from the picts that they have for sale , paint don’t match .",
        "vin": "2HGFC2F57JH"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/11/2021",
        "dateOfIncident": "06/08/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440132,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "There is fuel leaking into engine oil and thinning it out. My mechanic said there's a software issue causing it but a recall hasn't happened for it. It's hurting my car performance and making my car speed up faster even when breaking.",
        "vin": "SHHFK7H93JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/10/2021",
        "dateOfIncident": "11/06/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440090,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Clutch failure resulting in a non-moveable vehicle in heavy traffic",
        "vin": "2HGFC3A57JH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/08/2021",
        "dateOfIncident": "01/02/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439703,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Traveling straight, I could not make small corrections in the steering.  It would resist then over compensate.  I took it to a dealer who told me the sensor problem was a recall covering other VINs but none covering my vehicle.  The dealer also said they have had several other 2018 civics with same problem with VINs not included in recall.  The dealer test drove my car and agreed it was the sensor,  The dealer worked with Honda and got me a discount on parts and said it was the same problem other VINs have recall for but not mine.  It was still an expensive repair after the discount that I should not have had to pay.",
        "vin": "shhfk7h50ju"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/08/2021",
        "dateOfIncident": "10/26/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439725,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Honda Civic. The contact stated that while driving at 60 mph, the power steering had failed and the vehicle was difficult to steer. The tire pressure monitoring, brake system, electronic power steering, and stability assist warning lights were illuminated. The contact was able to drive to her residence. The dealer was made aware of the failure and informed the contact to turn off the vehicle and turn it back on to correct the failure. The power steering was corrected after restarting the vehicle; however, the warning lights were still illuminated. The vehicle was towed to the dealer and diagnosed with lost communication with the steering angle sensor. The dealer calibrated the steering angle sensor and cleared the DTC, then test drove the vehicle. The failure recurred a week later with an additional unknown warning light. The vehicle was towed a second time back to the dealer, who diagnosed that rodents were chewing the steering column wires. The dealer replaced the steering column wires and wrapped them in a tape produced by the manufacturer. The manufacturer was made aware of the failure and informed the contact that the steering column wires were soy-insulated, which could attract rodents. The failure mileage was 31,879.",
        "vin": "2hgfc2f54jh"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/03/2021",
        "dateOfIncident": "10/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439197,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 Honda Civic 2.0L Sedan bought in July 2018, starts to blow warm air from A/C from on October 2021, with only 50k miles on the car. Went to a mechanic for diagnosis since it was just over warranty and Honda dealer would charge $399 for just diagnosis and the only thing would be under cover is the condenser. The mechanic told me it is either a compressor leak or evaporator leak. I have read the comments online and it says the compressors and evaporator fail at a high rate due to bad design of the 10th gen Honda Civic A/C. I’ve also read that the condenser issue can lead to a compressor and evaporator leak. It is not a safety issue but it is unacceptable that a car which is only over 3 years with about 50k needs to be replaced the compressor or evaporator for over $1000.",
        "vin": "2hgfc2f54jh"
    },
    {
        "components": "WHEELS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/18/2021",
        "dateOfIncident": "10/17/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437203,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "When putting the car in par with a foot firmlt on the break, the car will still move a foot back or forward after taking my foot off, the wheels stay in place but the body moves even when on a completely flat road",
        "vin": "JHMFC1F73JX"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/06/2021",
        "dateOfIncident": "10/05/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435690,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Honda Civic. The contact stated while driving approximately 35-40 MPH, the power steering assist failed to function as needed and the steering wheel was difficult to steer. The contact was able to drive to his residence. The vehicle was taken to an independent mechanic and diagnosed with steering rack failure. The vehicle was not repaired and remained at the independent mechanic. The dealer was made aware of the failure but informed the contact that there was no recall associated with the VIN. The manufacturer was made aware of the failure and informed the contact there was no recall associated with the VIN, and there was no warranty for the vehicle. The failure mileage was approximately 32,015.",
        "vin": "2hgfc2f52jh"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/17/2021",
        "dateOfIncident": "02/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433352,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Honda Civic. The contact stated that the weather strips on all four windows were cracked. The contact had taken the vehicle to a dealer where he was informed that there were no recalls on the vehicle. The contact was also informed that the vehicle warranty did not cover the cost of the repair. The contact was provided an estimate for the cost of new weather strips for each window. The manufacturer was not made aware of the failure. The vehicle was not repaired. The failure mileage was approximately 50,000. Consumer would like a reimbursement for $200 for each window($800) as he was quoted at the dealership. Without the black weather stripping water can flow inside of the doors causing rust, electrical, and mechanical problems.",
        "vin": "2hgfc2f7xjh"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/13/2021",
        "dateOfIncident": "08/23/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432714,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "On or about 8-23-2021 I noticed that the vehicle’s steering wheel would stick when going on a curve or when suddenly changing lanes.  The steering wheel does not return to center and not anticipating this I almost went off the road.  I took the vehicle to koons honda Manassas,VA and they diagnosed a bad Rack Assembly.  The vehicle is a 2018 civic with only 28k miles on it; the rack should not be failing this early.  The cost for the repairs is $3500;  I need the vehicle but cannot afford the repairs and on top of that I have a newborn and 7 year old that will be in the car.  I do not feel the car is safe and Honda is giving me the runaround to fix it.  I also feel that they know about the issue because not only have I read about similar complaints online but they diagnosed the issue within a couple of hours; when such issues would normally start being diagnosed with the simplest fixes like an allignment.  I checked online and saw a recall from 2018 and think that this vehicle could have the same issue.  I have been trying to address this with Honda but I don’t want to wait to have an accident for them to take me seriously.",
        "vin": "2hgfc2f55jh"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/09/2021",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432335,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The AC is blowing hot air.  I hardly use my AC so I don't know exactly when the issue started. I took my car to the Honda dealer in Buena Park CA.  They told me that the warranty was expired. My vehicle is a 2018 with 35k + miles…how can that be?  And as expected, Honda refuses to take responsibility.  They told me a $300+ diagnostic was needed in order to identify the problem, and if the issue was the condenser if was free of charge.   Now according to their findings, the issue IS NOT the condenser but the \"evaporator\" and the cost to repair it is $2000+.  Per the comments here, the problems with the AC unit for 2016-2018 Honda Civics IS a highly reported issue.  This should be a recall, and Honda should take full responsibility for all the parts/repairs of the entire A/C system for these cars.  This is a safety issue to drivers and passengers because there were no vehicle warnings when the malfunction started.",
        "vin": "2hgfc2f55jh"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/03/2021",
        "dateOfIncident": "06/28/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431673,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "We believe our issue was caused by wiring harnesses coated in soy-based bio-plastics.  In late June 2021 our 2018 Honda Civic emitted a strong odor of gasoline. The gasoline odor was detected 15 feet away from the vehicle.  Noxious gasoline fumes were inhaled while driving and posed a health risk to driver and passengers, as well as possible fire hazard due to fumes.  On June 30, 2021, the Honda Civic was taken to a local Honda dealership for service.  It was inspected and signs of mouse damage on top & battery blanket were detected.  Honda replaced fuel lines, pipe set fuel & applied rodent tape.  No vehicle warnings, lamps or messages alerted us to the problem.  It was the strong odor of gasoline that warned us of a problem. Cost to vehicle owner to repair: $1568 on a vehicle that was under warranty.",
        "vin": "19XFC1F39JE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/14/2021",
        "dateOfIncident": "08/14/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429124,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The A/C system both the condenser and compressor failed in my 2018 Honda Civic with 13,000 miles. Honda acknowledges faulty part with their A/C condenser that could cause refrigerant to leak but failed to take responsibility of the compressor. The leak could cause other A/C components to fail such as the compressor, clutch and coil. These failures could further damage the car and cause the car to be unsafe to drive. Honda should take full responsibility of all the parts in their A/C system instead of charging owners $2300+ to fix the compressor.",
        "vin": "SHHFK7H91JU"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/03/2021",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427657,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Honda Civic. The contact stated while driving 70 mph, the sunroof exploded without warning sending glass shards inside the cabin of the vehicle. The vehicle was diagnosed and the sunroof glass was replaced. The manufacturer was informed of the failure but offered no assistance. The failure mileage was approximately 20,000.",
        "vin": "JHMFC1F72JX"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/02/2021",
        "dateOfIncident": "08/02/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427480,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Water leakage from the engine bay that damages coil packs and spark plugs. Coil pack seal is not durable enough to repel water once its introduce from the hood scoop.",
        "vin": "SHHFK8G79JU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/30/2021",
        "dateOfIncident": "04/20/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427186,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "We only have this car for 3 years with 40,000+ mileage and the AC started blowing hot air and is a safety issue especially for my wife and our kid. Please notice this concern is not something to be taken lightly especially the heat here in central california where heat stroke often occurs.",
        "vin": "2HGFC2F7XJH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/14/2021",
        "dateOfIncident": "07/14/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424851,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "A/C evaporator broken, ac nonfunctional",
        "vin": "2HGFC2F76JH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/05/2021",
        "dateOfIncident": "06/30/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423441,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 Honda Civic racking pinning steering needs replaced at 44,000 miles. My steering gets stuck turning right to left and worsens at higher speed. Honda dealership states its not under recall and will cost me $3,587.85. The manufacturing power steering rack costs $ 2,455.28. I have researched the internet and numerous consumers have complained and needed racking pinning replaced prior to warranty expiration and thereafter. This is definitely a safety concern. I cant believe that Honda Manufacturer has not recalled this defect.  Other consumers complaints found for the same defect:  #2 I just got this car in November 2020 (I-��m the second owner and it was originally a lease). It only has 27,400 miles on it. Within the past week I-��ve started feeling and hearing a clicking and jerking in the steering wheel when I turn/correct instead of a smooth transition. This starts 20 to 30 minutes after I first start driving, and it-��s worse at highway speeds (>50 mph) and gets worse the longer I drive the car. I brought the car to the dealership today and was told that the power steering rack is failing and needs to be replaced. No warning lights or messages appeared at any time. Thankfully I caught the problem early, but it made it difficult to steer the car and keep it straight on the highway, and had the problem progressed, my and others' safety could have been in grave danger. It is unacceptable for the power steering to fail and require major, costly repair in a vehicle that is only 3 years old. #3So.. i have this Honda Civic 2018.. just under 25K Mileage.. for past few weeks the steering is getting stiff and not responding .. it gives a sound of TAK TAK TAK..like jerks when the steering is turned fully either side .. no matter in reverse or in Drive Mode.. i went to Honda Centre and told them and they immediately started making video of steering and taking pics of engine no and chasis.. and didnt even ask me a single question.. and said that your car is in warranty..",
        "vin": "2HGFc2f74jh"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/21/2021",
        "dateOfIncident": "04/13/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421704,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Car AC is not working, due to a high number of issue reported to Honda on honda civic AC unit, they extended the warranty of the AC condenser for 10 years.  I see many people have this issue so instead of warranty extension, they should go for AC condenser or complete AC unit recall. my car is 3 years and 3 months old and the millage is around 18500 miles, now honda is saying give the car for inspection, if the issue is related to AC condenser it will be free of cost or I need to pay initial inspection fees of 320 dollars and additional for part replacement. AC condenser is the heart of AC unit due to improperly built of AC condenser it can damage other parts also. so ideally Honda should recall and do it free of cost.  Please help me here I am not getting any proper help from the honda of America customer care of the dealership.",
        "vin": "2HGFC2F72JH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/21/2021",
        "dateOfIncident": "06/18/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421746,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The AC Compressor failed while I was driving from LA to San Jose, on the hottest day of the year. It is available for inspection, and tomorrow will be formally diagnosed at a Honda Service Center. It has already been diagnosed by my regular repair shop, Michael & Co. in San Jose.  Due to the 109* heat and my pets being with me in the car, we had to pull over and take shelter at a motel for 12 hours - and even then, my pets were showing signs of heat exhaustion.   There was zero warning; no lamps, sounds, or other alerts. It just... died.",
        "vin": "2HGFC2F60JH"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "06/10/2021",
        "dateOfIncident": "05/02/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420398,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "On 05.02.2021, I was driving our CAR in Philadelphia, and stopped at red light. When I started driving in heavy stop and go traffic knowing I had to stop in 200 ft. brakes failed, brake pedal went to the floor and the car accelerated, emergency brakes didn’t start and Forward collision warning didn’t work. I hit the car in front of me. My car was totaled,  more cars were damaged.  Two months before this accident I was driving on a crowded Philadelphia city street and when I put on the brakes exactly the same thing happened -  brakes failed, car accelerated, emergency braking didn’t function, Forward collision warning didn’t work. I drove the car to the edge of sidewalk to stop it. Nobody got hurt but the front of the car was damaged. I took it to Honda to investigate the brake failure. First the dealer said they checked and there was nothing wrong we can take to car. Later Honda America told the dealer, the car is not safe and we can’t get it back until they send an expert to check. After the expert, service people at the dealership said the car was OK. The problem could be an unsecured floor mat that interfered with the brakes and that is why brakes failed. We asked why the emergence brakes didn’t work. They said “when you pushed the brake the computer has a message that brakes are pushed and emergency brakes don’t come on functioning”.  We removed the moveable floor mat and asked for the expert report. They told me he didn’t write a report.  Later when I confronted Honda America they said there was a written report but I did not have the right to see it. Honda America also refused any responsibility saying it was up to the insurance company and they were closing the report.I believe Honda America is not acting responsibly. HONDA should share the expert report after the first accident,  should investigate what went wrong during the accident, should try to figure out why the brakes failed twice in the same way in a two months period   but operated fine in between.",
        "vin": "2HGFC1F46JH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/10/2021",
        "dateOfIncident": "06/10/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420501,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I just got this car in November 2020 (I’m the second owner and it was originally a lease). It only has 27,400 miles on it. Within the past week I’ve started feeling and hearing a clicking and jerking in the steering wheel when I turn/correct instead of a smooth transition. This starts 20 to 30 minutes after I first start driving, and it’s worse at highway speeds (>50 mph) and gets worse the longer I drive the car. I brought the car to the dealership today and was told that the power steering rack is failing and needs to be replaced. No warning lights or messages appeared at any time. Thankfully I caught the problem early, but it made it difficult to steer the car and keep it straight on the highway, and had the problem progressed, my and others' safety could have been in grave danger. It is unacceptable for the power steering to fail and require major, costly repair in a vehicle that is only 3 years old.",
        "vin": "2HGFC2F53JH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/07/2021",
        "dateOfIncident": "04/20/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419859,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "A/C blow hot air , not cold.",
        "vin": "2hgfc2f7xjh"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/27/2021",
        "dateOfIncident": "05/24/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418794,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving on the highway and my check engine light starting to flash.  I experienced loss of power and hesitation during acceleration.  I got home and scanned my computer and it returned P0304.    I then removed the #4 ignition coil and that's when I noticed rust.  Seems like the seal on the ignition coil failed and water has been leaking into the #4 cylinder over time.",
        "vin": "SHHFK8G7XJU"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/21/2021",
        "dateOfIncident": "04/11/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11418079,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "As Karen drove over a speed bump in a residential area, the airbag deployed, causing Karen serious injuries.",
        "vin": "2HGFC2F53JH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/19/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417734,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I have 2018 Honda Civic only 30K+ mile and problem with AC. It’s not working and it’s dangerous to drive if I get fog inside vehicle. It’s hard to see outside. Also it’s not comfortable to sit and drive if too hot.I have breathing problems and I have put AC on. I called and they just said only condenser is covered any thing else for ac I have to pay.Which is not right.I checked too many people have same issues with AC",
        "vin": "19XFC1F74JE"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/14/2021",
        "dateOfIncident": "10/10/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416542,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BATTERY THAT CAME WITH THIS NEW CAR DIES EVERY 2 WEEKS FOR NO RHYME OR REASON! THIS BATTERY NEEDS TO BE RECALLED IT\u0092S NOT RIGHT. HONDA REFUSES TO CORRECT THE PROBLEM AND PRETENDS THAT IT PASSES THE BATTERY TEST WHEN IT SHOULD BE FAILING THE BATTERY TEST. PLEASE HELP.",
        "vin": "2HGFC2F84JH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/30/2021",
        "dateOfIncident": "04/30/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414618,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE BEEN TOLD BY THE HONDA DEALER'S MECHANIC THAT R-1234YF IS VERY FLAMEABLE AND WE ARE LUCKY HAT THE CAR DIDN'T CATCH FIRE OR FLASHOVER.  I BELIEVE HONDA IS LIABLE FOR THIS FLAW; THAT THE END OF THE TUBING ASSEMBLY DOES NOT HAVE A SUPPORT TO PREVENT THE TUBING FROM RUBBING AGAINST THE ALTERNATOR OPENING A HOLE FOR THE FREON TO LEAK OUT INTO THE ENVIRONMENT - POTENTIALLY CATASTROPHICALLY.    I WONDER HOW THE USEPA FEELS ABOUT THIS FLAW AND HOW MANY CARS ARE LEAKING FREON???",
        "vin": "2HGFC2F78JH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/26/2021",
        "dateOfIncident": "04/20/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413940,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 50 MPH ON THE RIGHT LANE OF THE SAW MILL PARKWAY THE ENGINE SUDDENLY STOPPED RUNNING. THE CAR CAME TO A HALT IN THE RIGHT LANE. IT WAS IMMOVABLE. I PUT THE FLASHERS ON, PUT THE GEAR SHIFT IN PARK AND PUSHED THE START BUTTON. THE CAR DID START. I DROVE IT HOME BUT AM AFRAID TO DRIVE IT AGAIN.",
        "vin": "2HGFC2F7XJH"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/24/2021",
        "dateOfIncident": "04/23/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413640,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AC SYSTEM WENT OUT 3 TIMES IN LESS THAN 8 MONTHS",
        "vin": "SHHFK7H42JU"
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/16/2021",
        "dateOfIncident": "04/15/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408388,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "A PREVIOUS COMPLAINT TO I SUBMITTED ABOUT THIS VEHICLE WAS RELEVANT TO THE REAR WINDSHIELD SHATTERING ON ITS OWN. UPDATE - BACKED BY INSURANCE CLAIMS, IT HAS HAPPENED 3 TIMES. ONCE FOR EVERY YEAR THE CAR HAS BEEN OWNED. THIS ISSUE SIGNIFICANTLY NEEDS ATTENTION.    THIS COMPLAINT IS ABOUT AN AC UNIT. THEY MANUFACTURED A CAR WITH DEFECTIVE PARTS. LISTED AS A RECALL BY ALL INFORMATION I SEEN, I WAS OBLIGATED TO PAY A LITTLE OVER $300 FOR THE \"RECALL\". ONCE FINALLY GETTING A CHANCE TAKING IT BACK IN BECAUSE THE ISSUE WAS NEVER FIXED, THEY RUN TESTS, AND TELL ME THE COMPRESSOR IS BAD AND IS GOING TO COST $1400, MORE THAN THE $1200 IT WAS THE FIRST TIME.     ABOVE ALL, THE BUSINESS PRACTICES IN WHICH THEY ACCOUNT FOR THE RECALLS NEEDS TO BE EVALUATED. THE PORTION OF THE COST OF THE FIRST WORK ON THE AC SYSTEM WAS LABELLED AS \"GOODWILL\" WHICH IS THE REASON THEY ARE REFUSING TO FIX IT THIS TIME. THEY SAID \"GOOD WILL\" IS A ONE TIME THING. THIS IS ALSO HOW THEY OBLIGATED ME TO PAY FOR PART OF A RECALLED PART THAT AT THE TIME THEY TOLD ME WAS A \"VOLUNTARY RECALL\" AND WOULD THEREFORE NOT BE SUBJECT TO THE STANDARD LAWS SURROUNDING RECALLS.     HONDA IS GENUINELY UP TO NO GOOD AND NEEDS TO BE THOROUGHLY EVALUATED.",
        "vin": "2HGFC2F7XJH"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/14/2021",
        "dateOfIncident": "03/18/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408082,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE PAINT IS TWO YEARS OLD FROM FACTORY, HAS BUBBLED AND THE CLEAR COAT IS LIFTING. THE PAINT IS SO CHEAP THAT ANY ROCK THAT HITS IT, IT GETS CHIPPED. IT IS A CONCERN FOR ME BECAUSE HONDA REFUSES TO COVER BODY PAINT UNDER WARRANTY AND I AM WORRIED IN A YEAR OR TWO, IT WILL RUST THE METAL OF IT NOT SERVING ITS PURPOSE OF PROTECTING THE BODY OF THE VEHICLE. HONDA HAS ME OVER A YEAR DISPUTING MY CLAIM AND ONLY GAVE ME \"I CANNOT DISCLOSE THAT INFORMATION \" FOR EVERYTHING.  MY CAR PAINT IS FAULTY AND THEIR TECHNICIAN MISDIAGNOSED THE VEHICLE DEFECTS.",
        "vin": "SHHFK8G76JU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/13/2021",
        "dateOfIncident": "03/03/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407828,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITIONER STOPPED WORKING, BLOWS OUT HOT AIR. DEALER SAID CONDENSER WAS LEAKING. HEARD THERE WAS RECALL ON SOME HONDA CIVICS FOR THIS ISSUE.",
        "vin": "SHHFK8G76JU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/09/2021",
        "dateOfIncident": "03/31/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407295,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "A/C STOPPED BLOWING COLD AIR.  THIS SHOULD BE A RECALL ITEM. THEY REFUSE TO FIX IT UNDER THE WARRANTY BC IT'S OVER 3YRS OLD.  I'VE NEVER HAD ANY ISSUE WITH HONDA'S I'VE HAD. VERY POOR CUSTOMER SERVICE CONSIDERING ALL OF THE COMPLAINTS!",
        "vin": "SHHFK7H71JU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/08/2021",
        "dateOfIncident": "04/03/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406992,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AC DOESN'T COOL VEHICLE AT 47,000 MILES.",
        "vin": "2HGFC1E33JH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/06/2021",
        "dateOfIncident": "03/08/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406788,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITIONER DOES NOT WORK. IT ONLY BLOWS WARM/HOT AIR. THE VEHICLE HAS 32,707 MILES ON IT. HONDA SAYS IT'S OUT OF WARRANTY AND WILL NOT COVER THE COST OF REPAIR. HONDA IS PUTTING BAD PARTS INTO CARS AND NOT FIXING THE PROBLEM. THOUSANDS OF VEHICLES HAVE THE SAME ISSUE.",
        "vin": "SHHFK7H56JU"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/05/2021",
        "dateOfIncident": "03/29/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406403,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 HONDA CIVIC. THE CONTACT STATED THAT WHILE THE VEHICLE WAS PARKED, THE SUN ROOF SHATTERED WITHOUT IMPACT. THE VEHICLE WAS TAKEN TO WINTER HAVEN HONDA (6395 CYPRESS GARDENS BLVD, WINTER HAVEN, FL 33884) HOWEVER, THE MECHANIC WAS UNABLE TO DIAGNOSE THE FAILURE. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 61,000.",
        "vin": "19XFC1F33JE"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/02/2021",
        "dateOfIncident": "03/29/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406142,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 HONDA CIVIC. THE CONTACT STATED WHILE DRIVING VARIOUS SPEEDS, THE STEERING WHEEL BECAME DIFFICULT TO TURN. THERE WAS NO WARNING LIGHT ILLUMINATED. THE VEHICLE WAS NOT TAKEN TO THE LOCAL DEALER OR INDEPENDENT MECHANIC FOR DIAGNOSIS OR REPAIRS. UPON INVESTIGATION, THE CONTACT ASSOCIATED THE FAILURE WITH NHTSA CAMPAIGN NUMBER: 18V663000 (STEERING) HOWEVER, THE VIN WAS NOT INCLUDED. THE MANUFACTURER WAS NOT INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 30,000.",
        "vin": "2HGFC2F77JH"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/01/2021",
        "dateOfIncident": "07/30/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405918,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR MAKES LIKE A CLICKING NOISE INTERMITTENTLY WHILE ACCELERATING. WHEN IT'S MAKING THIS NOISE IT HAS STOPPED ACCELERATING.  I HAVE TO RELEASE MY FOOT OFF THE GAS FOR A COUPLE SECONDS THEN WHEN I ACCELERATE, IT IS BACK TO NORMAL.THIS DOES NOT HAPPEN EVERY DAY ANYMORE BUT AT ONE POINT IT WAS HAPPENING PRETTY MUCH AT LEAST ONCE A DAY. I TOOK IT TO THE HONDA DEALERSHIP IN OCTOBER 2020 ND NOVEMBER 2020 AND ASKED THEM TO FIND OUT WHAT'S WRONG. I TOLD THEM IT MAY BE THE FUEL PUMP/SYSTEM OR SOMETHING WITH THE ACCELERATOR, AND PRECEDED TO TELL THEM ABOUT THE NOISE. BOTH TIMES THEY COULD NOT RECREATE THE NOISE AND THEREFORE COULD NOT FIX OR DIAGNOSE THE ISSUE. IT HAPPENS WHEN ACCELERATING FROM A STOP, ON A HILL, ACCELERATING QUICKLY, AND SOMETIMES JUST GOOD OLD FASHIONED REGULAR ACCELERATING. IT HAS MADE ME LOSE TRUST IN THE CAR LIKE I COULD BE TURNING OR PASSING SOMEONE AND IT HAPPENS WHEN EVERYONE OND IS CRITICAL. NEEDLESS TO SAY I HAVE BEEN ACCELERATING VERY SLOWLY TO TRY TO LIMIT THE AMOUNT OF TIMES IT HAPPENS BUT IT STILL HAPPENS. CITY STREETS AND HIGHWAYS.",
        "vin": "SHHFK7H54JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/01/2021",
        "dateOfIncident": "02/27/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406039,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE A/C EVAPORATOR HAS APPARENTLY STOPPED WORKING.  THE CONDENSOR HAD TO BE REPLACED BECAUSE IT WAS NOT MANUFACTURED TO SPECIFICATIONS, AND A RECALL WAS GENERATED.  I AM OF THE OPINION THAT THE SAME THING HAS HAPPENED TO THE EVAPORATOR, AS THIS IS A PART THAT SHOULD NOT HAVE FAILED.",
        "vin": "2HGFC2F71JH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/31/2021",
        "dateOfIncident": "11/17/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405756,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AC HAS STOPPED BLOWING COLD AIR.",
        "vin": "2HGFC1E54JH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/31/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405866,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AC NOT WORKING, JUST HIT 38K MILES",
        "vin": "JHMFC1F43JX"
    },
    {
        "components": "PARKING BRAKE,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/30/2021",
        "dateOfIncident": "03/29/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405654,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 HONDA CIVIC. THE CONTACT STATED WHILE THE VEHICLE WAS STATIONARY IN HER GARAGE, THE VEHICLE ROLLED OUT OF THE GARAGE DOWN A HILL ONTO A DIRT ROAD WHILE HER SON WAS IN THE VEHICLE. THE CONTACT STATED THAT THE PARKING BRAKE WAS ENGAGED WHILE THE VEHICLE WAS IN FIRST GEAR HOWEVER, THE VEHICLE STILL ROLLED OUT OF THE GARAGE. THERE WERE NO INJURIES SUSTAINED. THE VEHICLE WAS NOT TAKEN TO A LOCAL DEALER OR INDEPENDENT MECHANIC FOR DIAGNOSIS OR REPAIRS. THE MANUFACTURER HAD NOT BEEN INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 35,596.",
        "vin": "2HGFC1E5XJH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/24/2021",
        "dateOfIncident": "02/25/2021",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404701,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 HONDA CIVIC. THE CONTACT STATED THAT WHEN DRIVING AT 45 MPH, THE CHECK ENGINE WARNING LIGHT ILLUMINATED. THE VEHICLE STALLED AND SMOKE EMITTED FROM UNDER THE HOOD. THE VEHICLE WAS TOWED TO SERVICE CENTER AT HOLMAN HONDA LOCATED AT 12 EAST SUNRISE BLVD, FORT LAUDERDALE, FL 33304 PHONE (954) 607-6730. THE DEALER PERFORMED A DIAGNOSTIC THAT FOUND THAT THE ENGINE SHORT BLOCK FRACTURED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED. THE FAILURE MILEAGE WAS 36,000.",
        "vin": "2HGFC1E50JH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/16/2021",
        "dateOfIncident": "03/12/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403289,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL DOOR ACTUATOR STARTED TO MAKE A LOUD BUZZING NOISE AT 38,500 MILES AFTER 2 YEARS AND 3 MONTHS OF USE. THE ACTUATOR FAILED BECAUSE IT IS LOCKING AND UNLOCKING CONSTANTLY WITH THE VEHICLE. THIS IS A COMMON COMPLAINT WITH ALL HONDAS THAT UTILIZE THIS FUNCTION FOR THE FUEL DOOR.",
        "vin": "2HGFC2F58JH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/12/2021",
        "dateOfIncident": "03/12/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402535,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST BOUGHT THIS CAR. THE PROBLEM HAPPENS AFTER YOU'VE BEEN DRIVING FOR A BIT ON THE HIGHWAY. THE STEERING STARTS TO STICK AND IT TAKES A BIT OF EFFORT TO TURN (LIKE IT'S STUCK) AND WHEN YOU DO END UP TURNING THE STEERING WHEEL, YOU OVERCORRECT. THIS IS EXTREMELY AGGRAVATING AND DOESN'T FEEL SAFE. ALSO, THIS HAS NOTHING TO DO WITH HONDA'S \"LANE KEEP ASSIST.\" THIS PROBLEM DID NOT HAPPEN AFTER A 5 OR 10 MINUTE TEST DRIVE, OR I WOULD NOT HAVE BOUGHT THE CAR.   WHERE I LIVE IT'S FAIRLY HOT, SO HEAT MAY PLAY A FACTOR INTO THIS. THE PROBLEMS SEEMS MORE PRONOUNCED THE FASTER YOU GO. DEFINITELY MORE OF AN ISSUE DURING HIGHWAY DRIVING.",
        "vin": "19XFC2F74JE"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/12/2021",
        "dateOfIncident": "03/11/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402689,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN ROAD, THE STEERING FEELS LIKE IT A HICK IN IT AND ACTS LIKE IT KINDLY LOCKS STEERING WHEEL WHILE IN MOTION WHILE IN ALL SPEEDS, MAKE IT HARD TO DRIVE IN TRAFFIC.LIKE THIS ISN'T ANY PLAY IN STEERING LIKE MOST OTHER CARS HAVE. JUST WONDERFUL IF I SHOULD BRING IT TO HONDAS OF CLEVELAND AND LET THEM LOOKED AT IT  SITTING STILL TO GAS IT GAS AND GO FRONT TIRESBOUNCE  AND SHAMY AS YOU TAKE OFF FROM NOTHING",
        "vin": "2HGFC2F51JH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/01/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398424,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WOULD BECOME \"STUCK\" AND YOU WOULD HAVE TO FORCE THE VEHICLE TO TURN WHILE IN MOTION AND THE STEERING WHEEL WOULD MAKING A CLICKING SOUND. WOULD HAPPEN ABOUT 20-30 MINUTES AFTER BEING DRIVEN. TOOK INTO A HONDA DEALERSHIP AND THEY SAID IT IS THE POWER STEERING RACK IS FAILING",
        "vin": "JHMFC1F38JX"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/07/2021",
        "dateOfIncident": "01/12/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395099,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AC IS NOT BLOWING COLD AIR.",
        "vin": "SHHFK7H96JU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/27/2021",
        "dateOfIncident": "12/17/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390250,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WAS PARKED IN THE PARKING LOT AND WAS HIT IN THE DRIVER'S DOOR PART WHILE I WASN'T IN THE VEHICLE, WHOEVER DID IT, DID'T LEAVE A NOTE OR ANYTHING SAYING OR EXPLAINING WHAT HAPPENED.",
        "vin": "SHHFK7H50JU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/26/2021",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389961,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 HONDA CIVIC. THE CONTACT STATED THAT THE LOW-PRESSURE TIRE WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER HONDA OF NEWNAN (391 NEWNAN CROSSING BYPASS, NEWNAN, GA 30265: (678) 552-2071) WHERE IT WAS DIAGNOSED WITH NEEDING ALL 4 TIRES TO BE REPLACED AND AN ALIGNMENT PERFORMED. THE VEHICLE HAD BEEN REPAIRED BUT CONTINUED TO EXPERIENCE THE FAILURE. THE MANUFACTURER HAD BEEN INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 20,000.",
        "vin": "2HGFC3A56JH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/23/2021",
        "dateOfIncident": "10/16/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389601,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "10/16/2020 I WAS DRIVING MY 2018 HONDA CIVIC LEASE VEHICLE WITH 20,099 MILES STILL UNDER HONDA  BUMPER TO BUMPER WARRANTY. CAR SHUT OFF WHILE DRIVING  IN THE MIDDLE OF THE ROAD WITHOUT WARNING AND WILL NOT START, IT WAS TOW IN TO HONDA DEALER & AS OF TODAYS DATE 1/23/2021 ITS STILL SITTING AT HONDA OF DOWNTOWN LOS ANGELES CAN NOT FIGURED OUT AND HAS HONDA CASE # 11791655 - UN SAFE DEFECTIVE INTERNAL ENGINE POSSIBLY AND THEY DO NOT WANT OTHER CONSUMER'S TO KNOW",
        "vin": "2HGFC2F51JH"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/02/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386057,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON HIGHWAY GOING AROUND A SLIGHT LEFT BEND IN THE ROAD AT 65MPH, LEFT REAR TIRE SUSTAINED A SIDEWALL BLOWOUT. TIRES WERE INFLATED TO SPEC BY HONDA DEALER AFTER OIL CHANGE A MONTH PRIOR TO BLOWOUT. TPMS SYSTEM DID NOT DISPLAY UNDER INFLATION WARNING AND THERE WAS NO REASON TO SUSPECT UNDER INFLATION PRIOR TO BLOWOUT.    TIRE: CONTINENTAL PROCONTACT TX 215/50 R17 91H  TIN: CN6A D754 2718",
        "vin": "SHHFK7H51JU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/28/2020",
        "dateOfIncident": "12/18/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385187,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 HONDA CIVIC LX CONDENSER LEAKED OUT ALL ITS FREON. CONDENSER HAS NO DAMAGE FROM FOREIGN OBJECTS OR IMPACT. VEHICLE IS ONLY TWO THOUSAND MILES OUT OF WARRANTY. MANY OTHER SIMILAR VEHICLES HAVE CONDENSER RECALLS BUT HONDA REFUSES TO PAY FOR REPAIRS BECAUSE THEY SAY MY VIN IS NOT ON THE LIST.",
        "vin": "2HGFC2F58JH"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/16/2020",
        "dateOfIncident": "03/28/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374907,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE SHORTLY AFTER I GOT MY CAR, BRAND NEW, IT STARTED TO STALL A LITTLE BIT AS I WENT TO TURN, IF I HAD TO STOP OR SLOW DOWN BEFOREHAND. IT GOT WORSE AS TIME WENT ON. I TOLD HONDA BEFORE MY FIRST YEAR WAS UP AND HE TOLD ME TO JUST TAKE OFF ECO. I DID, BUT EVENTUALLY IT STARTED DOING THAT WITHOUT ECO. I'M AFRAID IT'S GONNA DO THAT WHEN I HAVE TO TURN LEFT ONTO A BUSY ROAD AND NOT BE ABLE TO GET OUT OF THE WAY FAST ENOUGH. BOTH ECO AND NON ECO SHOULD WORK EFFICIENTLY.  THE DATE BELOW IS AN ESTIMATE OF WHEN IT STARTED. IT'S BEEN A COUPLE YEARS.",
        "vin": "2HGFC2F75JH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/15/2020",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374733,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "IN JULY 2020 I TOOK MY CAR TO LANCASTER HONDA IN LANCASTER, CA FOR ROUTINE MAINTENANCE. THEY POINTED OUT THAT THERE WAS A RECALL AND THEY WOULD ORDER THE PART AND CALL ME TO SCHEDULE AN APPOINTMENT FOR THE REPAIR. NOTHING HAPPENED. IN OCTOBER 2020 I MADE AN APPOINTMENT FOR THE RECALL REPAIR STATING EXACTLY WHAT I NEEDED DONE. THE DAY BEFORE THEY CALLED TO CONFIRM THE APPOINTMENT. I TOOK THE CAR IN ON THE SCHEDULED APPOINTMENT DAY AND THE CUSTOMER SERVICE AGENT SAID NO PART HAD BEEN ORDERED AND THE REPAIR COULD NOT BE DONE. I SAID YOU CONFIRMED THE APPOINTMENT WITH ME SO WHY WOULD YOU DO THAT IF YOU DID NOT HAVE THE PART. HE APOLOGIZED AND SAID THEY WOULD ORDER THE PART AND CONTACT ME TO SCHDULE THE APPOINTMENT TO PUT IT IN. IT IS NOW MID NOVEMBER AND I HAVE STILL HEARD NOTHING FROM THE DEALERSHIP.",
        "vin": "SHHFK7H78JU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/02/2020",
        "dateOfIncident": "11/02/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372733,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PAINT IS CHIPPING AWAY ON THE HOOD.THE CAR IS ALWAYS PARKED IN THE GARAGE.ALSO THE CAR IS WASHED AT A PROFESSIONAL CARWASH ESTABLISHMENT AT LEAST ONE EVERY WEEK.I NOTICED THIS MONTHS AGO BUT IT IS GETTING WORSE.THE DEALER TOLD ME TO SEND IN THE COMPLAINT. THEY HAD SIMILIAR COMPLAINTS WITH THIS BLACK PAINT. THANK YOU",
        "vin": "JHMFC1F96JX"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/10/2020",
        "dateOfIncident": "10/10/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363685,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WILL NOT START.  THE VEHICLE WAS SITTING IN MY OFFICE PARKING LOT THE FIRST TIME THIS HAPPENED AND WENT TO LEAVE AND THE INSIDE LIGHTS FLASHED AND THEN SEEMED AS IF THE BATTERY DIED. GOT CAR JUMPED OFF, TOOK TO ECONOMY HONDA IN CHATTANOOGA, TN THEY CHECKED IT AND SAID NOTHING WAS WRONG AND THE BATTERY WAS FINE.  LEFT AND NOW ABOUT A MONTH LATER IT IS DOING THE EXACT SAME THING. WENT TO START IT, LIGHTS FLASH AND IT WONT COME ON AND NOW IT'S NOT DOING ANYTHING.",
        "vin": "19XFC2F71JE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/30/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362072,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 HONDA CIVIC. THE CONTACT STATED WHILE HIS DAUGHTER WAS DRIVING 70 MPH, SHE HEARD AN ABNORMAL SOUND COMING FROM THE VEHICLE. THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE DRIVER PULLED OVER AND THE VEHICLE WAS TOWED TO HOLLER HONDA LOCATED AT 2211 N SEMORAN BLVD, ORLANDO, FL 32807, (877) 872-9906, WHERE THE SKID PLATE WAS ATTACHED PROPERLY. THE VEHICLE WAS REPAIRED HOWEVER, THE FAILURE RECURRED THREE TIMES. THE MANUFACTURER WAS INFORMED OF FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 18,000.",
        "vin": "19XFC2F52JE"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/13/2020",
        "dateOfIncident": "09/12/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354755,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT ON PASSENGER SIDE COMES ON INDICATING AIRBAG IS OFF EVEN THOUGH PASSENGER IS IN SEAT.  HAPPENS OFTEN.",
        "vin": "WHGFC2F76JH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/11/2020",
        "dateOfIncident": "09/10/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354410,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CHANGED THE OIL FOR THE SECOND TIME ~12,300 MILES ON MY 2018 HONDA CIVIC EX HATCHBACK WITH THE CVT AND DRAINED 5 QUARTS OF OIL/FUEL OUT OF THE ENGINE. (ONLY HOLDS ~3.7QTS. HAD A VERY STRONG GAS SMELL TO THE OIL. CONCERNED WITH DILUTED OIL NOT LUBRICATING EFFECTIVELY AS WELL AS EXCESS OIL/FUEL IN THE ENGINE CAN CAUSE OVERHEATING, FROTHING ALONG WITH OTHER CONCERNS. THIS OIL WAS DRIVING ALL HIGHWAY MILES AND DURING THE SUMMER.",
        "vin": "SHHFK7H53JU"
    },
    {
        "components": "STRUCTURE,SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/10/2020",
        "dateOfIncident": "01/02/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354092,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE VEHICLE IS STATIONARY FOR A FEW DAYS, THE BACK WINDSHIELD SHATTERED OUT OF NOWHERE. THE FUEL SYSTEM HAS BEEN GETTING ERROR CODES. AIR CONDITIONING ALSO RUNS HOT INSTEAD OF COLD SOMETIMES. ENGINE LIGHT COMES ON A LOT.",
        "vin": "19XFC2F82JE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/24/2020",
        "dateOfIncident": "08/21/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351003,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN THE FREEWAY WHEN SOMETHING SOUNDED FROM THE OUTSIDE OF MY CAR LIKE THREE TIMES, I WONDERED WHAT IT WAS AND AFTER I PARKED THE CAR I SAW MY SUNROOF BROKEN.",
        "vin": "2HGFC2F77JH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/21/2020",
        "dateOfIncident": "06/25/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350638,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR IS BABIED.  A/C DIED COMPLETELY AT 21K MILES AND 14 MONTHS OF OWNERSHIP. MANY OTHER CIVIC OWNERS ARE REPORTING SAME ISSUE.  TSB EXISTS BUT RECALL IS NOT YET CREATED.  THIS SHOULD BE RECALLED AND WARRANTY FOR THE SPECIFIC SYSTEM EXTENDED.",
        "vin": "SHHFK7H9XJU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/17/2020",
        "dateOfIncident": "08/17/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349910,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY CAR IN TO THE HONDA DEALERSHIP BECAUSE MY AC HAD STOPPED BLOWING COLD AIR, RENDERING IT USELESS TO ME BECAUSE TEMPS GO UP TO 90 AND ABOVE. THE DEALER TOLD ME THAT IT WAS A FAULTY PART BUT WOULD NOT BE COVERED UNDER WARRANTY (3YR/36000) AS I WAS APPROXIMATELY 10000 MILES OVER, EVEN THOUGH I HAD BOUGHT THE CAR NEW AND HAD ONLY HAD IT A YEAR AND A HALF.    I COME TO FIND OUT THAT HONDA HAD EXTENDED THE CONDENSER WARRANTY TO 10 YEARS FOR 2016-2018 CIVICS, JUST NOT MINE FOR SOME REASON. EVEN THOUGH I HAD THE FAULTY PART, AND THE SAME CAR OF THE SAME YEAR, AND THEIR WARRANTY DOCUMENTATION SIGNIFIED ME AS BEING SUBJECT TO THIS EXTENDED WARRANTY, (BULLETIN TSB 19-091) MY VIN WAS NOT ALLOWED SOMEHOW. WE ARE IN THE MIDDLE OF COVID, MY ELDERLY FAMILY RELIES ON ME FOR TRANSPORTATION, MY CAR IS OVER 100 DEGREES AND THEY WANT 1000 DOLLARS I CANT COME UP WITH. AIR CONDITIONER SIMPLY DOESN'T BLOW COLD AIR. PLEASE HELP.",
        "vin": "SHHFK7H55JU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/13/2020",
        "dateOfIncident": "06/25/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348959,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITIONER HAS STOPPED WORKING.  BLOWING OUT MUGGY OR HOT AIR INSTEAD OF COLD AIR. THIS HAPPENS WHEN BEING STATIONARY AND DRIVING ON ROADWAYS.   THIS IS A SAFETY ISSUE TO DRIVER AND PASSENGERS.    IT WAS ALSO KNOW PROBLEM  TO HONDA AND THEY DID NOTHING TO TELL POTENTIAL BUYERS ABOUT THE KNOWN ISSUE.    THERE IS ALSO A CLASS ACTION SUIT. ACCORDING TO THE CLASS ACTION IT INVOLVES 2016-2018 HONDA CIVICS.    THE ONLY ACTION HONDA TOOK WAS EXTEND THE WARRANTY TO 10 YEARS AND UNLIMITED MILEAGE.  THEY NEVER NOTIFIED ME OF THIS WARRANTY.    I CALLED THE  DEALER AND THEY NEED TO DO A DIAGNOSTIC TEST BEFORE EVEN LOOKING AT THE AIR CONDITIONER.  FIRST WHY SHOULD THERE BE A DIAGNOSTIC TEST DONE.  NOTHING IN THE SERVICE BULLETIN (TSB) 19-091 CONCERNING A/C CONDENSERS THAT CAME FROM THE FACTORY DEFECTIVE IN 2016-2018  HONDA CIVICS NEVER MENTIONS A DIAGNOSTIC BE COMPLETED FIRST.   WHY SHOULD I HAVE TO PAY FOR ANYTHING SINCE HONDA KNEW ABOUT THIS ISSUE!  THERE SHOULD BE A RECALL, AND REPAIR ISSUED TO DEALERS AT NO EXTRA COST TO THE CUSTOMER..  I HAVE ONLY HAD MY CAR FOR 2 YEARS.",
        "vin": "19XFC1F77JE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/13/2020",
        "dateOfIncident": "06/10/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349107,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR CONDENSER IS LEAKING. ALTHOUGH THERE IS A RECALL ON 2016-2018 HONDA CIVICS, MY CAR FOR THE SAME FAILURE WAS NOT COVERED. I WAS CHARGED $ 500 FOR FREON REFILL BUT STILL, THERE IS A LEAK AND WOULD COST ME MORE THAN $1000 TO REPAIR.",
        "vin": "19XFC2F82JE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/07/2020",
        "dateOfIncident": "07/19/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343876,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED THE VEHICLE. MONITOR SCREEN WAS ALL BLACK (RADIO/ AC CONTROL PANEL). TURNED CAR OFF TO SEE IF SCREEN WOULD RESET. I TRIED BUTTON TO SEE IF SIDE TURN CAMERA WOULD TURN ON OR RESET ISSUE. IT DID NOT. DROVE 26 MILES SCREEN ALL BLACK. NO SIDE TURN BLINKER. NO RADIO. PARKED RESTARTED CAR 4 MORE TIMES. SCREEN STILL ALL BLACK. ERROR CODE APPEARED STATING 'DALAUNCHER ISN'T RESPONDING.  WOULD YOU LIKE TO CLOSE IT'",
        "vin": "19XFC2F76JE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/03/2020",
        "dateOfIncident": "06/19/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342916,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITIONING STOPPED WORKING.  IT IS A VERY HIGHLY REPORTED ISSUE WITH 2016-2018 HONDA CIVICS AND THE CONDENSER DEFECT.",
        "vin": "SHHFK7H44JU"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/03/2020",
        "dateOfIncident": "08/03/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342993,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TURNED CAR ON WHILE PARKED, AND STEERING WHEEL WAS LOCKED. SAW THESE WARNING LIGHTS COME ON: TIRE PRESSURE MONITOR PROB, BRAKE SYSTEM PROBLEM, BRAKE HOLD SYSTEM PROBLEM, POWER STEERING PROBLEM, VEHICLE STABILITY ASSIST PROBLEM, AND HILL START ASSIST PROBLEM.",
        "vin": "SHHFK7H56JU"
    },
    {
        "components": "POWER TRAIN,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/01/2020",
        "dateOfIncident": "04/10/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342639,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR STUTTERS WHEN I TURN ON COLD START AND WHEN I ACCELERATE ON ANY GEAR IT STUTTERS LIKE THE FUEL IS CUTTING OFF. AND FOR MY TRANSMISSION IT'S HARD TO CHANGE GEARS THEN IT'S NORMAL THEN IT'S HARD RANDOMLY",
        "vin": "2HGFC1E56JH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/22/2020",
        "dateOfIncident": "07/22/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340843,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR CONDITIONING UNIT DOES NOT WORKIN MY 2018 HONDA CIVIC HAS A LEAKY CONDENSER.  HONDA SAID THAT THIS IS A KNOWN ISSUE FOR 2018 HONDA CIVICS AND A 10 YEAR EXTENDED WARRANTY WAS OFFERED (TSB 19-091); HOWEVER, IT DOES NOT COVER THE VIN SERIES OF MY 2018 HONDA CIVIC.   I WANTED TO LOG THIS ISSUE FOR OTHERS THAT ARE HAVING THE SAME ISSUE AS IT MAKES THE CAR PRETTY MUCH INOPERABLE ON HOT DAYS AND HONDA'S RESPONSE IS NONSENSICAL GIVEN THAT OTHER 2018 HONDA CIVICS ARE COVERED FOR THE EXACT SAME PROBLEM.  THERE IS NO GUARANTEE THAT IF AN EXTENDED WARRANTY IS ISSUED AFTER I PAY FOR THE REPAIR THAT I WILL BE REIMBURSED.",
        "vin": "SHHFK7H81JU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/17/2020",
        "dateOfIncident": "06/30/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339985,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 HONDA CIVIC. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE STEERING WHEEL BECAME DIFFICULT TO STEER. THE FAILURE WAS INTERMITTENT. THERE WAS NO WARNING LIGHT ILLUMINATED. THE CONTACT STATED THAT THE STEERING WHEEL RESUMED BACK NORMAL OPERATION AFTER A FEW MOMENTS. THE VEHICLE WAS TAKEN TO APPLE TREE HONDA (242 UNDERWOOD RD, FLETCHER, NC 28732) WHERE IT WAS DIAGNOSED THAT THE RACK AND PINION FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT REFERENCED NHTSA CAMPAIGN NUMBER: 18V663000 (STEERING) AS A POSSIBLE SOLUTION TO THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 55,000. *DT*JB",
        "vin": "SHHFK7H7XJU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/10/2020",
        "dateOfIncident": "07/10/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338683,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL OF A SUDDEN A/C STOPPED PUSHING COLD AIR, AND IT IS SUMMER 92 DEGREES TODAY. I HAVE AN AUTONOMIC DYSFUNCTION IN WHICH EXPOSURE TO HEAT DRASTICALLY LOWERS MY BLOOD PRESSURE TO A DANGEROUS LEVEL. I'VE HEARD FROM LOCAL HONDA DEALERSHIP THAT MY CONDENSER IS LEAKING AND NEEDS TO BE REPLACED ALONG WITH COILS AND CLUTCH. HOW CAN THIS BE HAPPENING TO A CAR WITH LESS THAN 9,000 MILES? THESE PARTS ARE IN CRITICAL SHORTAGE AS THIS ISSUE IS HAPPENING IN MANY HONDA CIVICS.",
        "vin": "SHHFK7H9XJU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/05/2020",
        "dateOfIncident": "06/10/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337505,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AC WAS WORKING NORMAL WHEN ALL OF SUDDEN DRIVER SIDE STARTED BLOWING HOT AIR AND PASSENGER SIDE SOME WHAT COLD.DRIVING ON SURFACE STREET.",
        "vin": "JHMFC1F35JX"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/28/2020",
        "dateOfIncident": "06/05/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331352,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE WAS IN MOTION ON THE HIGHWAY WITH 68,000 MILES, AND NO SIGNS OF ANY LEAK OR DEFECTS BEFORE DRIVING HOME , 2 YEAR OLD VEHICLE WAS ABRUPTLY SHOW SOME WARNING LIGHTS ON THE DASH SO PULLED OVER ALL HAPPENED IN LESS THAN 2 MINUTES UNTIL I COULD PULL OVER THE SIDE , THE ENGINE OVERHEATED, I MAINTAIN ALL SCHEDULE MAINTENANCE AT DEALER AND WAS UP TO DATE ON SERVICES , I BELIEVE THIS WAS A MECHANICAL FAILURE AND NOT NEGLIGENCE ON MY PART, MY EXTEND COVERAGE WON'T ACCEPT MY CLAIM FOR REPAIRS ,CURRENTLY WITH OUT CAR AND STILL PAYING LOAN AND FACING A $9500.00 REPAIR COST WHICH I BELIEVE THE EXTENDED COVERAGE OR HONDA DEALER INSPECT THE ENGINE FOR ENGINEERING DEFECT IN DESIGN OF COOLING OF MOTOR ,CAR WAS NEVER ABUSED OR DRIVING NEGLIGENCE AND I BELIEVE SHOULD BE REPAIR AT NO COST TO ME, PORTFOLIO ELITE PROTECTION PLAN IS MY EXTENDED WARRANTY WHICH IS 5YEAR/100,000 MILE'S COVERAGE, DEALER REPAIR CENTER IS  ROBERTSON PALMDALE HONDA .  ALL HELP WELL BE WELCOME THANK YOU",
        "vin": "SHHFK7H43JU"
    },
    {
        "components": "VISIBILITY,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/24/2020",
        "dateOfIncident": "06/20/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330674,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY BOUGHT MY CIVIC 2018 LAST YR AND THE AC WAS FINE UNTIL NOW THAT IT STARTED BLOWING HOT AIR ON THE DRIVER SIDE. THE PASSENGER SIDE STILL BLOWS COOL AIR. BUT THE DRIVER SIDE IS SUPER HOT! IT NOT WORKING PROPERLY WITH THIS WEATHER OF 100 DEGREES AND MORE!  *TR",
        "vin": "SHHFK7H43JU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/22/2020",
        "dateOfIncident": "06/16/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11330125,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD AN ACCIDENT ON JUNE 16 2020. A TRAILER HIT MY CAR IN THE BACK AND PULL ME OUT OF THE ROAD. AIRBAGS DID NOT DEPLOY.  *TR",
        "vin": "SHHFK7H53JU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/18/2020",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329545,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 HONDA CIVIC. THE CONTACT STATED WHILE DRIVING 55 MPH, WHEN WARM AIR WAS ENTERING THE CAB OF THE VEHICLE. THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO LOCAL DEALER HONDA OF VALLEY STREAM SERVICE LOCATED AT  396 W MERRICK RD, VALLEY STREAM, NY 11580, (516) 285-6655, AND WAS INFORMED WITH NEEDING AC COMPRESSOR TO BE REPLACED. THE VEHICLE HAD NOT BEEN REPAIRED AS OF YET. THE MANUFACTURER HAD BEEN INFORMED OF FAILURE. THE FAILURE MILEAGE WAS 39,948.",
        "vin": "2HGFC2F72JH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/13/2020",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328637,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER ABOUT 10-20 MINUTES OF DRIVING, THE CAR STARTS TO PULL TO THE LEFT WHEN GOING STRAIGHT ON THE ROADWAY. THE STEERING CHANGES FROM ALLOWING SMOOTH, SLIGHT ADJUSTMENTS, TO BEING STICKY AND JERKY. THEN THE CAR OVERCORRECTS TO THE RIGHT, AND THE STICKY STEERING OVERCORRECTS TO THE LEFT. IT BECOMES A CONSTANT STRUGGLE WITH THE STEERING WHEEL TO KEEP THE CAR TRAVELING IN A STRAIGHT LINE. ONCE THIS ISSUE STARTS, IT HAPPENS WHETHER TRAVELING AT LOW OR HIGHER SPEEDS, BUT IS MUCH MORE OBVIOUS AND DANGEROUS AT HIGHER SPEEDS. I TOOK THE CAR INTO HOLLER HONDA WINTER PARK FL, AND EXPLAINED THE ISSUE IN MARCH 2020.THEY PERFORMED AN ALIGNMENT. THE CAR CONTINUED TO HAVE THE ISSUE AND THE ISSUE BECAME WORSE. I TOOK THE CAR BACK TO HOLLER HONDA ON 6-12-20 AND EXPLAINED THE PROBLEM AGAIN. I ASKED FOR A ROAD TEST. THEY TOLD ME THAT NOTHING WAS WRONG WITH MY CAR AND THEY MADE A 'FEW ADJUSTMENTS.\" I TOLD THEM I WAS VERY CONCERNED ABOUT SAFETY AND THAT I KNOW THERE IS A SEVERE PROBLEM. THEY REFUSED TO DO ANYTHING FURTHER. I AM STARTING TO BELIEVE THAT IT IS BECAUSE MY CAR IS STILL UNDER WARRANTY. I HAVE RESEARCHED AND FOUND NUMEROUS SIMILAR COMPLAINTS ON VARIOUS YEARS OF THE HONDA CIVICS ON THE INTERNET. A RARE FEW APPEARED TO HAVE BEEN RESOLVED BY REPLACEMENT OF THE EPS RACK. I LEFT A MESSAGE WITH THE SERVICE MANAGER ABOUT MY DISSATISFACTION, AND HE HAS NOT RETURNED MY CALL. THE NATIONAL HONDA PHONE LINE HAS BEEN DOWN FOR TWO DAYS NOW.  MY SON AND I ARE BOTH AFRAID TO DRIVE THE VEHICLE ON MAIN ROADWAYS AND HIGHWAYS NOW. THE STEERING STICKS, REQUIRES AN ABNORMAL AMOUNT OF PRESSURE TO ADJUST, THEN 'JUMPS' TOO FAR, MAGNIFYING THE ADJUSTMENT AND MAKING AN OVERCORRECTION. THIS ISSUE CONTINUES THROUGHOUT THE DRIVE WHILE HAVING TO ADJUST STEERING LEFT, THEN RIGHT, THEN LEFT CONSTANTLY. THIS IS EXTREMELY HAZARDOUS AND HAS THE POTENTIAL TO STEER THE CAR INTO ANOTHER LANE OR OFF THE ROADWAY!  *TR",
        "vin": "19XFC1F74JE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/25/2020",
        "dateOfIncident": "05/25/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325909,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THIS CAR BRAND NEW IN 2018. NOW IT HAS 7,000 MILES. MY A/C UNIT DOESN'T WORK. BLOWS HOT AIR. AFTER LOOKING INTO THIS ONLINE, THERE ARE HUNDREDS OF PEOPLE HAVING THE SAME PROBLEM INCLUDING MY SON. I DON'T KNOW WHAT TO DO NOW. AS MAKES CRACKLING NOISE AS I TURNED ON THE A/C. PLEASE HELP.",
        "vin": "19XFC2F59JE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/26/2020",
        "dateOfIncident": "05/06/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322250,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AC STARTED MAKING NOISE ONE YEAR FROM PURCHASE. KEPT COMPLAINING TO DEALER ABOUT NOISE AND THEY WOULD TELL ME THERE WAS NO PROBLEM. THEY FINALLY HEARD IT, FIXED THE NOISE (COMPRESSOR ISSUE), BUT NOW AC IS NOT COOLING. HAVE TAKEN IT TWICE TO DEALER AND THE PROBLEM IS STILL NOT FIXED (THEY DON'T KNOW WHAT IT IS). I'M PAYING FOR A DEFECTIVE CAR THAT HONDA'S OWN DEALERS CANNOT FIX!",
        "vin": "2HGFC2F50JH"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "03/28/2020",
        "dateOfIncident": "03/27/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319613,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MARCH 27, 2020, I WAS DRIVING TO WORK WHEN MY CAR'S ABS LIGHTS, BRAKE SYSTEM LIGHTS, STABILITY CONTROL LIGHTS, AND ANOTHER LIGHT I DID NOT RECOGNIZE ALL LIT UP AT THE SAME TIME. MY CAR BEGAN TO SWERVE AND SUDDENLY MY CAR'S STEERING WHEEL AND FRONT WHEELS LOCKED UP. I LOST CONTROL OF THE CAR AND WASN'T ABLE TO CORRECT ANYTHING BECAUSE THE STEERING WHEEL AND FRONT WHEELS WERE BOTH LOCKED. I HIT A FARM FENCE WITH THE LEFT SIDE OF MY CAR, AND SLID ACROSS THE ROAD INTO A DITCH. MY AIRBAGS DID NOT DEPLOY DESPITE THE SUDDEN IMPACT TO THE DRIVER'S SIDE DOOR. THE CAR WHEELS WERE SO LOCKED UP THAT THE TOW TRUCK DRIVERS HAD DIFFICULTY LOADING THE CAR ON/OFF THE TOW TRUCK. THE EMERGENCY LIGHTS STAYED ON, EVEN WHEN THE CAR WAS TURNED OFF AND BACK ON. A WEEK PRIOR TO THIS, MY CAR TURNED ITSELF OFF WHILE I WAS DRIVING, BUT I WAS ABLE TO CORRECT THE PROBLEM BY TURNING THE IGNITION KEY OFF AND THEN BACK ON. I'VE ATTACHED A PICTURE OF MY DASHBOARD AFTER THE ACCIDENT TO SHOW WHAT EMERGENCY LIGHTS WERE LIT UP. MY INSURANCE COMPANY IS IN THE PROCESS OF INVESTIGATING THIS CLAIM, BUT I WANTED TO REPORT THIS IN CASE THIS IS A RECALL THAT NEEDS TO BE SENT OUT.",
        "vin": "2HGFC2F56JH"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/26/2020",
        "dateOfIncident": "02/29/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319374,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS SOMETHING THAT MAKES THE TIRES WEAR OUT FAST AND MAKES A NOISE",
        "vin": "2HGFC2F74JH"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/17/2020",
        "dateOfIncident": "03/16/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318390,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD MY 2018 HONDA CIVIC FOR LESS THAN 2 YEARS AND MY PAINT IS CHIPPING OFF ON MY HOOD AND DOORS FOR NO APPARENT REASON.",
        "vin": "2HGFC4B09JH"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/10/2020",
        "dateOfIncident": "03/10/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317330,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHOUT WARNING OR WHEN I COME OUT TO MY CALL, ALL THE WINDOWS ARE ROLLED DOWN, AND THE SUNROOF IS OPEN. I HAVE BEEN REPEATEDLY TOLD BY THE DEALERSHIP THAT THIS IS AN OPERATOR ERROR AND THAT THE FUNCTION ON MY KEY FOB MUST HAVE BEEN ACCIDENTLY PRESSED. HOWEVER, THIS ISSUE HAS HAPPENED WHEN THE KEY FOB IS NOWHERE NEAR THE VEHICLE. THIS ISSUE HAS OCCURRED THREE TIMES AT HOME WHERE I KEEP THE KEY FOB AT LEAST 30 YARDS AWAY FROM THE VEHICLE. IN ADDITION, THE ISSUE HAS OCCURRED TWICE AT WORK WHERE THE VEHICLE IS OVER 50 YARDS AWAY AND MUST PASS THROUGH 1.5 FEET OF CONCRETE TO SEND A SIGNAL TO THE CAR.     IN ADDITION, THE NUMEROUS TIMES (I HAVE LOST COUNT) THE TRUNK WILL OPEN WITHOUT ACTIVATING THE KEY FOB OF DEPRESSING THE KNOB IN THE CAR. AGAIN, I HAVE BEEN TOLD BY DEALERS THAT IT IS OPERATOR ERROR. HOWEVER, EACH TIME THIS OCCURS, THE KEY FOB IS IN MY HAND ON THE WAY TO THE CAR OR IN THE CONSOLE AREA WHERE IT IS NOT BEING TOUCHED BY ME OR BY ANYTHING ELSE. IT HAS OCCURRED IN MY DRIVEWAY AND ONCE WHILE THE CAR WAS IN MOTION'CAUSING ME TO QUICKLY PULL OVER SO THE CONTENTS OF THE TRUNK DO NOT FLY OUT AND HIT SOMEONE.     BESIDES THE OBVIOUS SAFETY AND SECURITY ISSUE, THIS PROBLEM HAS CAUSED A GREAT DEAL OF WATER DAMAGE TO THE INTERIOR OF THE VEHICLE AND MAY HAVE GOTTEN INTO THE ELECTRICAL SYSTEM VIA THE HANDS-FREE SYSTEM IN THE CONSOLE AND THE USB PORT IN THE CENTER COMPARTMENT'BOTH OF WHICH WERE COVERED IN WATER DURING THIS PAST INCIDENT WHEN IT WAS HEAVILY RAINING.     I HAVE BEEN TOLD BY THE DEALERSHIP THAT THESE ARE FLUKES, AND HONDA HAS NOT AND WILL NOT MAKE IT POSSIBLE TO DISABLE THIS FEATURE. THE 200+ COMPLAINTS/REPORTS ON THE NHTSA WEBSITE INDICATES TO ME THAT IT IS NOT A FLUKE. AS THE OWNER, I SHOULD BE ABLE TO BE DISABLE THIS FEATURE SO FURTHER DAMAGES, SAFETY, AND SECURITY ARE NOT AN ISSUE. THE HONDA CIVIC IN QUESTION IS LESS THAN TWO YEARS OLD.",
        "vin": "19XFC1E30JE"
    },
    {
        "components": "SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "02/16/2020",
        "dateOfIncident": "01/28/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 1,
        "numberOfInjuries": 1,
        "odiNumber": 11309495,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MAKING A LEFT TURN AT ABOUT 15 TO 20 MPH WHEN OTHER CAR TRYING BEAT THE LIGHT DOING ABOUT 50 MPH RESULTING ME HITTING  HIM BROADSIDE. THE AIR BAGS DEPLOYED PROPERLY  BUT THE SEAT BELT FAILED. THE SEAT BELT RIPPED OUT OF FLOOR OF THE CAR INCLUDING THE BOLT THAT IS SUPPOSED TO HOLD IT IN PLACE. AS ARESULR I WAS INJURED WITH A FRACTURED STERNUM AND RIB.",
        "vin": "SHHFK7H56JU"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/12/2020",
        "dateOfIncident": "01/05/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298815,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST OIL CHANGE AT 4965MI. INDICATES ODOR OF GASOLINE COMING FROM THE OIL DIPSTICK IN THE ENGINE COMPARTMENT.",
        "vin": "SHHFK7H41JU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/07/2020",
        "dateOfIncident": "10/31/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297733,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON STOPPING AND REMOVING THE DRIVER SEAT BELT, THE ELECTRONIC MONITORING SYSTEM IS SUPPOSED TO  ENGAGE THE EMERGENCY BRAKE TO PROHIBIT THE VEHICLE FROM ROLLING WHEN STOPPED.  THE EMERGENCY BRAKE HAS NOT, REPEAT, HAS NOT ENGAGED MULTIPLE TIMES UPON PARKING MY VEHICLE AND THE VEHICLE HAS ROLLED FORWARD OR BACKWARD, DEPENDING ON THE SITUATION.",
        "vin": "2HGFC1E56JH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/07/2020",
        "dateOfIncident": "10/31/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297734,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE OIL DIPSTICK SMELLS OF GASOLINE. THE TURBO CHARGER TECHNOLOGY IS ALLOWING GAS TO PUSH PAST THE OIL AND INTO THE ENGINE. OIL AND GAS SHOULDN'T BE MIXING.",
        "vin": "2HGFC1E56JH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/03/2020",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11296862,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS PAST SUMMER (SUMMER OF 2019) MY WIFE'S 2018 HONDA CIVIC'S AIR CONDITIONING SYSTEM BEGAN TO LOSE ITS ABILITY TO COOL AIR GRADUALLY, UNTIL IN THE MIDDLE OF THE HOTTEST MONTH OF THE YEAR, IT STOPPED COMPLETELY. BECAUSE IT IS A LEASE, I THEN TOOK THE VEHICLE TO OUR HOME HONDA SERVICE CENTER .THEY REFUSED TO COVER COSTS ALLEGEDLY BECAUSE THE MALFUNCTION HAD BEEN CAUSED BY ROAD DEBRIS ON THE CONDENSER. FAST FORWARD TO NOVEMBER, I RECEIVE A LETTER IN THE MAIL STATING THAT THERE IS A RECALL ON 2018 CIVIC CONDENSERS. IT WAS CLEAR TO ME THEN, THAT THE MALFUNCTION WAS DUE TO A MANUFACTURING DEFECT, AND NOT DUE TO MY WIFE GOING OFF-ROADING (WHICH SHE DOESN'T DO LOL). I BECAME HOPEFUL THAT HONDA WOULD REIMBURSE ME (OVER $800). AFTER GOING BACK AND FORTH FOR TWO MONTHS, I JUST RECEIVED A CALL IN WHICH THEY ADVISED ME THAT DUE TO THE NATURE OF THE MALFUNCTION (HAVING BEEN CAUSED BY \"ROAD DEBRIS\" SUPPOSEDLY), HONDA WOULD NOT REIMBURSE ME. I HAVE CLEARLY BEEN TAKEN ADVANTAGE OF.",
        "vin": "2HGFC2F7XJH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/01/2020",
        "dateOfIncident": "10/11/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11292391,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL DIP STICK SMELL LIKE GAS GOING INSIDE THE OIL CAR LACK POWER I NOTICED IT IN COLD WEATHER WE ARE HAVING IN CA STATE A LOUD WHIRLING ENGINE NOISE COMING FROM TOP OF ENGINE DIP STICK SHOW MORE THEN WHAT I FIRST STARTED WITH WHEN I CHANGE OIL 3K MILES B4  IT STALL OUT ON ME 2 TIMES IN THE LAST 3MONTH I LIVE IN AGUANGA CA TEMP FELL TO 29 DEGREES FOR THE LAST COUPLE MONTH WINTER WEATHER WITH SNOW",
        "vin": "2HGFC1E57JH"
    },
    {
        "components": "SUSPENSION,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/29/2019",
        "dateOfIncident": "10/17/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291895,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CRASH MITIGATION SYSTEM WOULD STATE MALFUNCTION OF SYSTEM GOING DOWN THE INTERSTATE AND NOT WORK AND CRUISE CONTROL WOULD NOT WORK WHEN I USED THE BRAKES.WOULD HAVE TO PULL OVER TO SIDE OF ROAD AND TURN THE KEY OFF TO GET IT TO RESET. THIS HAS HAPPENED 3 TIMES. DEALER SAID THEY COULD FIND NO PROBLEM. INTERMEDIATE SUPPORT BEARING FOR RIGHT HAND AXLE HAS FAILED TWICE WITH IN  15 K MILES",
        "vin": "2HGFC1F96JH"
    },
    {
        "components": "SEATS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/16/2019",
        "dateOfIncident": "10/19/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289517,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTO BRAKING WHEN GOING ONTO OR OFF A HIGHWAY RAMP/EXIT. VEHICLE IS IN MOTION AND I'M CONCERNED OF GETTING REAR ENDED. DOESN'T ALWAYS OCCUR.  WHEN USING REMOTE START THE HEATED FRONT SEATS DO NOT COME ON I HAVE TO GET INTO THE CAR AND START IT.",
        "vin": "JHMFC1F92JX"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/03/2019",
        "dateOfIncident": "11/23/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286705,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MANUAL TRANSMISSION: VERY NOTCHY:  IS NOT SMOOTH, KNOCKS AND DOES NOT RETURN TO CENTER (NEUTRAL). VERY DIFFICULT GETTING INTO REVERSE. SEEN SEVERAL COMPLAINTS ON SI FORUMS.  THIS TRANSMISSION AND GEARBOX SHOULD BEEN FUN, SMOOTH, AND EASY TO DRIVE AND IT'S NOT.  THIS OCCURS WHILE DRIVING OR STATIONARY.    NOTICED THE ISSUE AFTER I BOUGHT THE CAR.",
        "vin": "2HGFC1E52JH"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "11/21/2019",
        "dateOfIncident": "05/20/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281486,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ADJUSTING THE DRIVERS SIDE HEIGHT TO LOWER POSITION THE LEVEL MAKES A GRINDING /STRIPPING NOISE AND SEEMS TO MISS GEARS (LEVELS) IN BETWEEN. VEHICLE IS ONLY A LITTLE OVER A YEAR OLD",
        "vin": "SHHFK7H57JU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/21/2019",
        "dateOfIncident": "11/21/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281488,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERAL ISSUES WITH THE TOUCH SCREEN, WHEN COLD OUT THE SCREEN WILL NOT COME ON, ONLY DISPLAYS A BLANK WHITE SCREEN.  THIS REQUIRES SEVERAL RESTARTS, SCREEN GOES BLANK (BLACK) LOSE ALL CONTROLS AND RADIO.  EVEN AFTER PULLING OVER AND RESTARTING THE VEHICLE SEVERAL TIMES, SOMETIMES IT WILL NOT COME BACK ON FOR MILES AND THEN COMES IN AND OUT UNTIL IT FULLY REBOOTS.  WILL MAKE A TONE AND SHUT DOWN THE ENTIRE SCREEN DURING NAVIGATION AND AFTER PULLING OVER AND RESTARTING THE VEHICLE SEVERAL TIMES, WILL SOMETIMES NOT RE-ENGAGE NAVIGATION AT ALL, UNTIL NEXT DAY.",
        "vin": "SHHFK7H57JU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/13/2019",
        "dateOfIncident": "10/25/2019",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279880,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2018 HONDA CIVIC IS LESS THAN A YEAR OLD AND HAS AROUND 5,000 MILES.  I DROVE 25 MINUTES TO PICK UP MY DAUGHTER. I PARKED ON A CITY STREET. IMMEDIATELY, AS I SHIFTED THE CAR INTO PARK, PEOPLE ON THE STREET STARTED SCREAMING AT ME TO GET OUT OF THE CAR BECAUSE IT WAS ON FIRE. THE UNDERNEATH OF THE CAR WAS ON FIRE. AS I WAITED FOR THE POLICE AND FIRE DEPARTMENT, THE FIRE SPREAD TO THE ENTIRE FRONT END OF THE CAR AND ENGULFED IT. THE CAR WAS TOTALED. THEY TOLD ME THAT THE FIRE WAS CAUSED BY SOMETHING MECHANICAL.  THERE IS A POLICE REPORT BUT I HAVE NOT BEEN ABLE TO OBTAIN A COPY YET.  I DIDN'T HAVE ANY ISSUES/PROBLEMS WITH THE CAR LEADING UP TO THE FIRE.",
        "vin": "19XFC2F55JE"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/04/2019",
        "dateOfIncident": "10/30/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278017,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN I45 AT ABOUT 70MPH WHEN I HEARD A REALLY LOUD POP. CONFUSED, I WAS LOOKING IN ALL MY MIRRORS TRYING TO FIND OUT WHAT HAPPENED, AS I KNEW I DIDN'T HIT ANYTHING OR FEEL ANYTHING. I HEAR LOUD WIND NOISES, AND OPEN MY SUNROOF SHADE TO FIND 90 % OF MY SUNROOF HAD EXPLODED UP AND OUT ONTO THE FREEWAY. NOTHING HIT MY SUNROOF. I WASN'T DRIVING BEHIND ANYONE FOR AT LEAST A 1/4 MILE. I DIDN'T DRIVE UNDER AN OVERPASS. I WAS IN THE FAR RIGHT LATE, SO NOTHING CAME FROM THE OTHER SIDE. IT JUST EXPLODED. THE GLASS REMAINING WAS ANGLED OUTWARD, NOT INSIDE MY CAR. I HAVE DONE MY RESEARCH. THIS IS A RECURRING PROBLEM AND NEEDS TO BE ADDRESSED. THE HONDA OF SPRING DEALERSHIP WILL NOT COVER IT UNDER MY WARRANTY. THIS IS A DEFECT/MANUFACTURING PROBLEM. THE SERVICE MANAGER EVEN TOLD ME THIS ISN'T THE FIRST TIME HE'S SEEN IT.... AND YOU DONT THINK ITS A PROBLEM?",
        "vin": "2HGFC1F31JH"
    },
    {
        "components": "SEATS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/28/2019",
        "dateOfIncident": "10/02/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271542,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2018 BRAND NEW CIVIC. ONLY HAD 15 MILES ON IT. I ONLY HAVE HAD IT NOW FOR FOUR MONTHS AND I CAN VERY CONFIDENTLY SAY THIS CAR IS A LEMON. THE MOON ROOF QUIT WORKING. IT JUST STOPPED WORKING. TOOK IT TO AIKEN HONDA AND AFTER FOUR HOURS AND TWO MEN WORKING ON IT THEY TRIED TO SAY IT WAS A ROCK IN IT AND THEY PRODUCED ME A ROCK BIGGER THAN A FIFTY CENT PIECE. THERE'S NO WAY THAT GIANT ROCK WAS IN MY MOON ROOF. I WOULD OF SEEN IT WHEN I ATTEMPTED TO FIX IT MYSELF. I THINK THEY JUST PICKED UP ONE OF THE RIVER ROCKS THAT ARE IN THEIR PARKING LOT PLANTERS. (THAT'S WHAT IT LOOKED LIKE, IRONIC HUH? NOT TO ME BECAUSE THIS HONDA IS THE ONE WHO SOLD ME THIS LEMON ALONG WITH SCAMMING ME OUT OF 30,000. DO NOT SHOP HERE) SO THEY REFUSED TO FIX THE MOON ROOF. EVEN THO THEY MADE ME WITHOUT MY CONCENT PURCHASE 3 WARRANTYS (HAD NO CLUE))    ALSO THE MECHANICAL SEAT HAS SOME SORT OF DEFECT THAT IS KIND OF SCARY. IF YOU GO ALL THE WAY BACK AND LEAN ALL THE WAY BACK (AS TO NOT HIT THE AIRBAG AND NOT LAY DOWN) IT MAKES AN AWFUL DING NOISE IN THE SEAT THAT CAN BE FELT AS IF A GIANT SPRING IS POPPING UNDER THE SEAT CUSHION AND YOU CAN LITERALLY FEEL IT HIT HARD. AS IF IT MIGHT POP THRU THE SEAT INTO YOUR BUTT CHEEK... SCARED ME",
        "vin": "JHMFC1F77JX"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/04/2019",
        "dateOfIncident": "09/07/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266188,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "EMISSIONS SYSTEM PROBLEM, CAR IS ACTING WEIRD AND GIVING A KICK BACK WHEN DRIVING",
        "vin": "19XFC2F79JE"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/24/2019",
        "dateOfIncident": "09/24/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257822,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT WINDSHIELD EASILY GETS CHIPPED AND CRACKED FROM KICKED UP DEBRIS FROM OTHER VEHICLES. DRIVING, I HAVE RECEIVED 3 CRACKS IN MY WINDSHIELD THAT HAVE SPLINTERED BADLY. THESE INCIDENTS HAPPEN DURING DRIVING ON A PAVED ROAD THAT HAS 2 LANES GOING THE SAME DIRECTION. DEBRIS WAS KICKED UP FROM OTHER VEHICLES DRIVING IN FRONT OF ME. I HAVE OWNED MANY CARS IN THE PAST AND HAVE NEVER HAD A PROBLEM OF THIS MAGNITUDE.",
        "vin": "2HGFC1F77JH"
    },
    {
        "components": "SUSPENSION,EXTERIOR LIGHTING,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "08/30/2019",
        "dateOfIncident": "08/23/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252505,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "\"I WAS PULLING INTO THE PARKING LOT, WHEN THE CAR STARTED TO ACCELERATE ON ITS OWN! I PUSH THE BRAKE PEDAL TO THE MAX AND IT KEPT ON GOING, OVER CEMENT STOPPERS, GRASS, AND FINALLY A TREE STOP IT FROM CONTINUING! AND I AM NOT A ZENIOR CITIZEN YET!\"",
        "vin": "SHHFK7H52JU"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/16/2019",
        "dateOfIncident": "08/16/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244554,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 HONDA CIVIC HATCHBACK, GASOLINE SMELL IN CABIN OCCURRED ON 8/16/2019. 1.5L OIL DILUTION COULD BE CAUSE OF ISSUE.",
        "vin": "SHHFK7G42JU"
    },
    {
        "components": "STEERING,POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/12/2019",
        "dateOfIncident": "07/23/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243302,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 HONDA CIVIC. WHILE DRIVING APPROXIMATELY 25 MPH, THE VEHICLE SUDDENLY STALLED. THE VEHICLE'S STOP WARNING ALERT NOTIFIED THE DRIVER TO PULL OVER. THE VEHICLE WAS TAKEN TO SCOTT ROBINSON HONDA (20340 HAWTHORNE BLVD, TORRANCE, CA 90503) TO BE DIAGNOSED, BUT THEY WERE UNABLE TO REPLICATE THE FAILURE. THE DEALER TURNED OFF THE SYSTEM SENSOR. THE CONTACT ALSO STATED THAT THE STEERING WHEEL SEIZED. THE CONTACT TOOK THE VEHICLE TO DCH GARDENA HONDA (15541 S WESTERN AVE, GARDENA, CA 90249, 301-660-7286) WHERE THE FAILURE INITIALLY COULD NOT BE REPLICATED. DURING THE THIRD TEST, WITH THE CONTACT IN THE VEHICLE, THE FAILURE RECURRED. THE VEHICLE WAS NOT REPAIRED AND THE CAUSE OF THE FAILURES WAS NOT SPECIFIED. THE CONTACT STATED THAT THEY WERE WAITING FOR HONDA'S CORPORATE OFFICE TO RESPOND. THE MANUFACTURER PROVIDED CASE NUMBER: 09732156. THE FAILURE MILEAGE WAS 11,200.",
        "vin": "SHHFK7H99JU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/05/2019",
        "dateOfIncident": "07/17/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241779,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT WINDSHIELD GET CRACKS VERY EASY,AFTER GETTING A SMALL STONE CHIP",
        "vin": "SHHFK7H20JU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/14/2019",
        "dateOfIncident": "07/04/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231715,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE WASHING MY 2 DAY OLD CAR A CHUNK OF PAINT BLOWS OFF THE LOWER KICK PANEL.  DEALER TOLD ME IT WAS MY FAULT AND THEY WEREN'T GOING TO PAY FOR IT.  I TOLD THEM THEY COULD HAVE THE CAR BACK.  SUDDENLY THEY WERE GOING TO REPAIR IT.  THEY TOLD ME THEY REPLACED THE ENTIRE PANEL.  2 DAYS AGO ALMOST EXACTLY 1 YEAR TO THE DAY,I WAS WASHING MY CAR AND IN THE EXACT SAME PLACE A CHUNK OF PAINT BLOWS OFF ( A BIT IRONIC).  I WENT TO A DIFFERENT DEALER (CANT TRUST SUPERSTITION SPRINGS AFTER THEY LIED TO ME).  I CALLED HONDA THEY SAID NO PROBLEM TO TAKE IT TO ANOTHER DEALER.  THE DEALER I TOOK IT TO SAID I WOULD HAVE TO PAY FOR THE REPAIR SINCE HONDA SAID THEY HAD PAID FOR THE FIX ONCE. NO WAY THEY REPLACED THE PANEL BECAUSE THEY HAVE NO RECORD OF IT EVER BEING REPLACED AND THE PAPER WORK I HAVE DOES NOT STATE THE PANEL WAS REPLACED.  THEY DIDNT CHANGE THE PANEL, THEY SLAPPED SOME TOUCH UP ON IT AND SENT ME ON MY WAY.",
        "vin": "2HGFC3A5XJH"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/11/2019",
        "dateOfIncident": "01/28/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11230917,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG DID NOT DEPLOY",
        "vin": "SHHFK8G78JU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/01/2019",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228617,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE 1ST OF JULY 2019. AFTER I START THE CAR IN THE MORNING, THEN I PUT IT INTO REVERSE GEAR TO BACK UP FROM THE PARKING SPACE. BUT THE BACKUP CAMERA TURNS THE PURPLE SCREEN.",
        "vin": "SHHFK8G7XJU"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/26/2019",
        "dateOfIncident": "06/21/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222823,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 21, 2019, OWNER OF A 2018 HONDA CIVIC 5 DOOR HATCHBACK GRAND TOURING WAS DRIVING ALONG A 4 LANE DIVIDED HIGHWAY IN A 45 M.P.H. ZONE.  SPEED WAS APPROXIMATELY 46 M.P.H.  THE COLLISION MITIGATION BRAKING SYSTEM (CMBS) SUDDENLY ACTIVATED WITHOUT THERE BEING A VEHICLE OR PERSON IN FRONT OR TO THE IMMEDIATE EITHER SIDE FRONT OF THE CAR. THE CMBS WENT DIRECTLY INTO STAGE 3 ACTIVATION OUT A POSSIBLE 3 CMBS STAGES. THESE ARE:  STAGE 1: VISUAL AND AUDIBLE WARNING  STAGE 2: VISUAL AND AUDIBLE WARNING AND LIGHT BRAKE APPLICATION  STAGE 3: VISUAL AND AUDIBLE WARNING AND STRONG BRAKE APPLICATION  THIS ALMOST CAUSED OWNERS CAR TO BE REAR ENDED BY THE VEHICLE TRAVELING DIRECTLY BEHIND OWNERS CAR DUE TO THE VIOLENT AND STRONG APPLICATION OF THE BRAKING SYSTEM IN OWNERS CAR. REMEMBER, NO CARS TO FRONT OR IMMEDIATE FRONT SIDES OR A PERSON IN THOSE POSITIONS EITHER.   THE APPLICATION OF THE CMBS CAUSED AN EXTREMELY DANGEROUS SITUATION THAT COULD HAVE RESULTED IN INJURY TO THE OWNER OF THE 2018 HONDA CIVIC OR THE DRIVER OF THE VEHICLE DIRECTLY TO THE REAR OF OWNERS' VEHICLE.  VEHICLE WAS TAKEN TO A LOCAL HONDA DEALER TO REPORT THIS INCIDENT. DEALER STATES COMPUTER GLITCH IN DATA SYSTEM. NO CODES ASSOCIATED WITH THIS EVENT WERE FOUND. AND A VERBAL STATEMENT FROM TECHNICIAN OF 'THESE THINGS HAPPEN'. NOT VERY SATISFACTORY ANSWER WHEN THIS INCIDENT COULD HAVE CAUSED AN ACCIDENT.  VEHICLE WAS BROUGHT TO SHOP IN CONJUNCTION WITH A HOPEFULLY SEPARATE ISSUE THAT WILL BE REPORTED SEPARATELY. THE TECHNICIAN CLEARED ALL CODES AND TEST DROVE VEHICLE FOR 2 MILES. TECHNICIAN STATED SHE COULD NOT DUPLICATE PROBLEM AND RELEASED CAR. OWNER HAD TO RETURN TO SHOP TO HAVE TECHNICIAN SET THE SYSTEM SO THE CMBS COULD BE MANUALLY DEACTIVATED AGAIN AS WHEN VEHICLE WAS BROUGHT INTO SHOP.",
        "vin": "SHHFK7H94JU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/17/2019",
        "dateOfIncident": "06/17/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220533,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BACK UP CAMERA IS FUZZY WITH VERY LOW RESOLUTION ESPECIALLY DURING THE EVENING OR LOWER DAYLIGHT.  THIS MAY CAUSE SERIOUS INJURY SINCE RESOLUTION IS VERY POOR.  CAMERA LENS IS NOT DIRTY OR SCRATCHED",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/28/2019",
        "dateOfIncident": "05/26/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210500,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCELERATING UP TO 60 MPH CAR BEGAN TO JERK VIOLENTLY. FLASHING CHECK ENGINE LIGHT CAME ON AND ALL CONTROL OF GAS PETAL WAS LOST UNTIL CAR SLOWED TO UNDER 20 - 25 MPH. OBD2 CODES PULLED AND REPORTED MISFIRING IN CYLINDER 1. CAR NOT ABLE TO BE DRIVEN UNDER ANY NORMAL CONDITIONS AS MISFIRING HAS INTENSIFIED. 2018 HONDA CIVIC SI",
        "vin": "2HGFC1E57JH"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/24/2019",
        "dateOfIncident": "04/23/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11209687,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2018 HONDA CIVIC. THE CONTACT STATED WHILE APPROACHING A STOPPED VEHICLE AT 5 MPH, THE VEHICLE BEHIND WAS DRIVING 45 MPH AND REAR ENDED THE CONTACT'S VEHICLE CAUSING THE CONTACT TO CRASH INTO THE STOPPED VEHICLE IN FRONT. THE CONTACT STATED THE IMPACT MADE HER HEAD HIT THE STEERING WHEEL CAUSING HER TO FRACTURE HER NOSE. MEDICAL ATTENTION WAS REQUIRED. THE AIR BAGS DID NOT DEPLOY. THE VEHICLE WAS TOWED TO HER HUSBANDS BUSINESS. A POLICE REPORT WAS REPORTED. THE CONTACT HAD NOT CONTACTED THE LOCAL DEALER TO NOTIFY FAILURE. THE VEHICLE HAD NOT BEEN DIAGNOSED. THE VEHICLE WAS DESTROYED. THE MANUFACTURER HAD NOT BEEN INFORMED OF FAILURE. THE FAILURE MILEAGE WAS 10,000.",
        "vin": "JHMFC1F9XJX"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/22/2019",
        "dateOfIncident": "05/19/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209370,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE PRESSURE MONITORING SYSTEM COMES ON.  TIRE PRESSURE IS EXACTLY 34/35 PSI AS DOOR PANEL ADVISES.  RESET THE TPMS SYSTEM TO FIX THE WARNING.  ALSO, AFTER DRIVING 100 MILES, THE CRUISE CONTROL, LANE KEEP, & COLLISON MITIGATION SYSTEM FAILED.  HAD TO STOP CAR, TURN IT OFF, AND RESTART TO GET WARNINGS TO DISAPPEAR.",
        "vin": "SHHFK7H94JU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/21/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209132,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "KEYFOB RANGE REDUCED DRASTICALLY     USED TO BE ABLE TO REMOTE START MY CAR FROM OVER 200FT. NOW I CAN'T EVEN DO IT OVER 30FT. EVEN ONE OF THE SALE MEN SAID IT WAS A PROBLEM BECAUSE HE WAS ABLE TO START HIS OWN CIVIC FROM OVER A 100FT. THE SERVICE MANAGE TOLD ME THE LAST TIME I CAME IN TO CHECK IF THERE WAS ANY NEW (BECAUSE THEY NEVER CALL OR RETURNED MY CALL) SAID THAT CORPORATE HONDA DIDN'T HAVE A FIX AND THAT MULTIPLE PEOPLE HAVE BEEN HAVING THE SAME ISSUE. HE THEN GAVE ME A BUNCH OF RIDICULOUS REASONS (SO MUCH ELECTRICAL SYSTEM THAT IT CAN DRAIN THE BATTERY EVEN WITH THE CAR OFF AND THAT THE CAR IS PROTECTING ITSELF FROM DRAINING COMPLETELY BY \"SHUTTING DOWN SOME SYSTEM\" WHEN THE CAR IS OFF. OTHER EXCUSES THEY TOLD ME WAS THAT MY WINDOWS WERE TINTED (THEY ARE CERAMIC TINTED WHICH DOES NOT INTERFERE WITH SIGNAL LOSS) IT COULD BE MY DASHCAM, OR MY SUBWOOFER. I WOULD HAVE CONSIDERED IT IF IT HAPPENED AFTER I JUST HAD THEM INSTALLED. BUT I HAD EVERYTHING INSTALLED 3 MONTHS AFTER I BOUGHT THE CAR WHICH WAS OVER A YEAR AGO AND THE PROBLEM JUST SHOWED UP A COUPLE MONTHS AGO. GOES TO SHOW YOU THAT NOT JUST HONDA BUT CAR DEALERSHIPS WILL DO ALL THEY CAN TO NOT FIX YOUR CAR.    I EVEN SENT CORPORATE HONDA A MESSAGE AND ALL THEY SAID WAS GO TO A DIFFERENT DEALERSHIP... SERIOUSLY? YOU'D THINK THEY'D TRAIN TECHS TO BE ADEQUATE ENOUGH TO DEAL WITH AN ISSUE LIKE THIS. I AM NOT GOING TO DRIVE 45MIN (CLOSEST LOCATION) TO BE TOLD THE SAME THING.     AFTER I ASKED THE DEALERSHIP TO SEE IS THE RECEIVER IN THE CAR COULD BE THE PROBLEM THEY TOLD ME THEY WOULD HAVE TO CHARGE ME A LABOR FEE TO DO THAT. WAS A HONDA FAMILY BUT WILL NOT BE PURCHASING ANOTHER HONDA IN THE FUTURE.",
        "vin": "SHHFK7H97JU"
    },
    {
        "components": "PARKING BRAKE,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "05/20/2019",
        "dateOfIncident": "05/19/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208570,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "*TL THE MANUFACTURER WAS CONTACTED. SEE ATTACHED DESCRIPTION OF THE INCIDENT.  DISCRIPTION IS THAN 2000 CHARACTERS.*JB",
        "vin": "2HGFC2E5XJH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/19/2019",
        "dateOfIncident": "05/11/2019",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208525,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRICAL FIRE WITHIN THE DRIVER DOOR. A FIRE STARTED WHILE VEHICLE WAS PARKED OUTSIDE AND OFF AT MALL IN TOLEDO, OHIO. WEATHER HAD BEEN RAINY. CAME OUT TO VEHICLE AND THE INSIDE WAS FILLED WITH SMOKE. AFTER FIRE DEPARTMENT AND TOWING AGENCY MANAGED TO GET THE PASSENGER DOOR OPEN TO GET INSIDE, IT WAS REVEALED THAT THE DRIVE DOOR HAD BEEN ON FIRE AND MELTED. THE FIRE HAD ALSO DESTROYED THE HEADLINER, DRIVE SEAT AND LEFT THE SMOKE DAMAGED INTERIOR COVERED IN SOOT. THERE WAS ALSO A HOLE IN THE DRIVER FLOOR, REVEALING POSSIBLE FRAME DAMAGE. HONDA SAYS THAT THEY ARE INVESTIGATING TO SEE WHICH COMPONENT CAUSED THE FIRE. DURING A PREVIOUS OIL CHANGE IN FEBRUARY, I HAD MENTIONED TO THE MECHANICS THAT THE CAR HAD BEEN BEEPING RAPIDLY WHILE IT WAS OFF AND THE KEY FOB WAS OUTSIDE THE VEHICLE. IT IS ONLY SUPPOSED TO DO THIS IF THE VEHICLE IS STILL RUNNING. I WAS TOLD THAT THIS WAS NORMAL WHEN THE WEATHER WAS COLD, BUT IT ALSO HAPPENED WHEN IT WAS WARM OUTSIDE, AND BECOMING MORE FREQUENTLY AS TIME WENT ON. THIS CONCERN WAS BRUSHED OFF BY BROWN HONDA, WHO ALSO REFUSED TO PROVIDE A LOANER VEHICLE WHILE HONDA WAS INVESTIGATING THE ISSUE. HONDA CORPORATE SAID THAT THE BEEPING SHOULD NOT BE HAPPENING IF THE CAR IS OFF. I AM CURRENTLY WAITING ON HONDA FOR ADDITIONAL INFORMATION.",
        "vin": "SHHFK8G71JU"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/10/2019",
        "dateOfIncident": "05/10/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206856,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "A RED TOYOTTA COROLLA SWURVED AND PUSHED ME TO THE UNPAVED SIDE OF THE ROAD NOT CHECKING THE LEFT SIDE. I WAS NOT EVEN ON THE BLIND SPOT LANE AND I WAS FORCED TO BE PUSHED TO THE UNPAVED ROAD ON THE LEFT SIDE. IT WAS A SCHOOL ZONE AT 15 MILES PER HOUR. DRIVER WAS ON HER PHONE AND WASN'T LOOKING WHEN TURNING LANES.",
        "vin": "SHHFK7H5XJU"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "05/01/2019",
        "dateOfIncident": "04/25/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204978,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 HONDA CIVIC. THE CONTACT STATED THAT THE REAR DRIVER'S AND FRONT PASSENGER SEAT BELTS WERE SEVERED. THE VEHICLE WAS TAKEN TO SUPERIOR HONDA OF OMAHA (402-408-1000, LOCATED AT 4111 S 144TH ST, OMAHA, NE 68137) WHERE IT WAS DETERMINED THAT THE FAILURE WAS CAUSED BY THE HARNESS THE CONTACT INSTALLED TO STABILIZE THE CHILD SAFETY SEAT. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STOOD BY THE DEALER'S OBSERVATION. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 13,500. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/25/2019",
        "dateOfIncident": "04/20/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11203621,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON APRIL 20, 2019 MY HONDA CIVIC HATCHBACK WAS HIT ON THE FRONT DRIVER SIDE. ONLY THE PASSAGER AIRBAG DEPLOYED",
        "vin": "SHHFK7H58JU"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/21/2019",
        "dateOfIncident": "03/14/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11202744,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL DILUTED WITH FUEL (3/4\" ABOVE THE FULL MARK ON THE DIPSTICK) - THIS IS A PROBLEM WITH HONDA'S 1.5 TURBO ENGINE (CIVIC, CRV).  OTHERS WITH THIS ISSUE HAVE REPORTED THEIR VEHICLES STALLING WHILE DRIVING AT 70 MPH -- DEFINITELY A SAFETY ISSUE.",
        "vin": "2HGFC1F33JH"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/18/2019",
        "dateOfIncident": "03/15/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11197088,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRIC STEERING LOCKED WHILE MAKING A LEFT TURN.  AS I WAS TURNING THE WHEEL SEEMED TO LOCK AND THEN ALL OF A SUDDEN IT WENT THE OPPOSITE DIRECTION I WAS TURNING AND I ALMOST SKIDDED OFF THE ROAD.  MOST OF THE TIME ESPECIALLY WHEN I'M GETTING ON THE FREEWAY, IT FEELS LIKE I HAVE A LITTLE CONTROL OVER THE STEERING AND IT FEELS LOOSE. THE STEERING ALSO GIVES ME PROBLEMS WHEN I PULL INTO A PARKING SPACE I CAN'T ESTIMATE HOW MUCH I HAVE TO TURN THE WHEEL.",
        "vin": "2HGFC1F76JH"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/17/2019",
        "dateOfIncident": "04/15/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196878,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 HONDA CIVIC. WHILE AT A RED LIGHT, THE VEHICLE STALLED. THE GEAR HAD TO QUICKLY BE SHIFTED INTO PARK TO RESTART THE VEHICLE. IN ADDITION, THE BRAKE HOLD INDICATOR FLASHED WITHOUT THE CONTACT ACTIVATING THE FEATURE. THE BUTTON HAD TO BE MANUALLY PRESSED TO PREVENT THE WARNING INDICATOR FROM FLASHING. THE CONTACT HAD TO DISENGAGE THE BRAKE SYSTEM TO MANEUVER THE BRAKE PEDAL AS A SAFETY PRECAUTION WHILE THE VEHICLE WAS IN MOTION. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS NOTIFIED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "2HGFC2F73JH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/04/2019",
        "dateOfIncident": "04/03/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193756,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 HONDA CIVIC, HATCHBACK SPORT TOURING. AFTER ARRIVING AT MY DESTINATION THE VEHICLE  WAS TURNED OFF AND LOCKED.  WHEN I CAME BACK TO THE CAR, I DISCOVERED THAT THE CAR WOULD NOT START. ALL THE LIGHTS WERE ON IN THE DASH AND STAYED ON.. HAD THE CAR JUMPED, AND IT STARTED. ON MY ATTEMPT TO DRIVE THE CAR HOME, THE CAR WAS PULLING HARD TO THE RIGHT AND I HAD TO FIGHT TO KEEP IT STRAIGHT. THE CAR WAS PICKED UP BY THE DEALERSHIP, BUT THEY COULD NOT FIND WHAT CAUSED THE PROBLEM. SO, I RESEARCHED ON LINE AND FOUND A RECALL A RECALL (#18V663000) FOR THE ELECTRICAL POWER ASSIST SYSTEM. I INPUT MY VIN#, BUT IT CAME BACK WITH ZERO RECALLS. ALTHOUGH MY VIN WAS NOT EFFECTIVE, I'M HAVING THE SAME ISSUES DESCRIPTED.",
        "vin": "SHHFK7H9XJU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/27/2019",
        "dateOfIncident": "03/23/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192040,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR JUST LAST SATURDAY HAS STARTED DRAINING LIGHT BLUE FLUID,AND I WAS TOLD IT IT THE VEHICLE'S ENGINE BLOCK. THE DEALERSHIP I BROUGHT THE CAR TO SAYS THAT HONDA SENT A NOTICE TO HONDA OWNERS FOR THIS MAKE AND MODEL WITHIN A SPECIFIC YEAR RANGE BECAUSE OF THE PROBLEMS IN ITS ENGINE BLOCK. HONDA DID EXTENT THE WARRANTY TO 10 YEARS FROM THE ORIGINAL PURCHASE DATE. MY CONCERN IS THAT I BOUGHT THE CAR IN 2011 AS CERTIFIED USED CAR IN A HONDA DEALERSHIP, AND BEING A SECOND OWNER, I NEVER GOT ANY SAFETY CONCERNS OR RECALLS REGARDING THIS VEHICLE BY ANY MEANS (MAIL, CALL, EMAIL). I NOT AWARE OF ANY PROBLEMS WITH THIS CAR, WHICH HONDA KNEW ALL ALONG. TO MAKE MATTERS WORSE, THEY DENY WORKING ON MY CAR AS IT IS OVER 10 YEARS WARRANTY FROM ITS ORIGINAL PURCHASE, EVEN THOUGH MY CAR ONLY HAS 66000 MILEAGE ON IT. MY CAR PROBABLY DID JUST SHOW SIGNS LATE BECAUSE OF ITS LOW USAGE.",
        "vin": "2HGFA165X8H"
    },
    {
        "components": "STEERING,STRUCTURE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/20/2019",
        "dateOfIncident": "01/28/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190175,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED A 2018 HONDA CIVIC SPORT HATCHBACK IN LATE SPRING OF LAST YEAR.   WHILE DRIVING IT IN SNOWY CONDITIONS, IT CONSISTENTLY COLLECTS SNOW AND ICE IN THE WHEEL WELLS TO THE POINT WHERE IT HAS ACTUALLY CAUSES DAMAGE TO THE INNER WHEEL WELL AND CAUSES CONSISTENT RUBBING AND BURNING SMELLS DUE TO THE ICE RUBBING AGAINST THE TIRE.   THE RESPONSE FROM THE DEALERSHIP (GARBER HONDA IN ROCHESTER) AND THE AUTO MANUFACTURER (AMERICAN HONDA FINANCE COMPANY) IS THAT THIS IS DUE TO 'OUTSIDE INFLUENCES' AND IS THEREFORE NOT COVERED BY THEM.    THE ISSUE IN QUESTION IS REGARDING THE MATERIAL DESIGN AND THE INABILITY TO ACTUALLY DRIVE THIS VEHICLE IN INCLEMENT WEATHER CONDITIONS IN WESTERN NEW YORK.    THE INNER WHEEL WELL IS MADE OF SOME TEXTURED, ALMOST 'CLOTH LIKE' MATERIAL THAT ALLOWS FOR SNOW AND ICE TO STICK AND BUILD UP VERY QUICKLY.   AFTER DRIVING JUST A FEW MILES IN SNOWY CONDITION, WE NEED TO PULL OVER TO TRY AND KNOCK SOME OF THE SNOW OFF SO THAT IT DOESN'T RUB AGAINST THE TIRE.   THE COLLECTION OF ICE AND NOW HAS ACTUALLY RIPPED OFF THE INNER WHEEL WELL ON ONE SIDE AND IS STARTING TO AFFECT THE OTHER SIDE.     I FEEL THAT THIS COULD BE A POTENTIAL ISSUE TO ANYONE DRIVING IN SNOW.   WHILE DRIVING UNDER THESE CONDITION, MY CONCERN IS FOR THE DRIVERS OF THIS VEHICLE AND OTHERS ON THE ROAD BECAUSE OF THE NEGATIVE WAY THAT IT AFFECTS THE HANDLING OF THE VEHICLE.      I HAVE SOUGHT OUT ADVICE FROM BOTH THE DEALERSHIP AND HONDA REGARDING ADDING DIFFERENT RIMS AND TIRES, BUT THEY HAVE COME BACK AND SAID THAT IT WOULD NOT AFFECT IT MUCH AND THAT IT WAS AN ENVIRONMENT ISSUE.   THE DEALERSHIP MENTIONED THAT THEY HAVE MANY PEOPLE COMING IN WITH THE SAME ISSUE AND CHARGES THEM EACH AND EVERY TIME TO HAVE THIS RESOLVED.     I DO HAVE A SMALL VIDEO THAT SHOWS EXACTLY WHAT THIS IS DOING TO THE VEHICLE.   IS THERE A LOCATION WHERE I CAN UPLOAD THIS?  I HAVE UPLOADED A PICTURE.",
        "vin": "SHHFK7H49JU"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "03/13/2019",
        "dateOfIncident": "03/12/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186629,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD A BUMPER TO  BUMPER CRASH ON FREEWAY DURING  RUSH HOUR TRAFFIC WAS STOPPING AND GOING BETWEEN 5 TO 15 MILES  AN HOUR I WAS HIT FROM BEHIND  WHILE MY CAR WAS ON NEUTRAL THEN I HIT CAR IN FRONT OF ME MY BUMPERS AND GRILL PLUS SAFETY  BUMPER  BAR WAS BENT INTO RADIATOR,  FRONT VEHICLE HAD SMALL DENT PLUS BUMPER DAMAGE  MY FRONT CAR WAS TOTALED. BUMPERS ARE CLIP ONS THEY CAN FALL AT ANY MOMENT.",
        "vin": "2HGFC2F57JH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/07/2019",
        "dateOfIncident": "03/02/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184928,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SUSPECTED OIL DILUTION... RECENT DEALERSHIP OIL CHANGE, LESS THAN A WEEK LATER, THE VOLUME OF \"OIL\" WAS APPROX. 1/2 INCH OVER THE TOP OF THE DIP STICK MEASUREMENT SECTION.  DEALER RE-DID THE OIL CHANGE TWO WEEKS LATER, AND WE WILL CONTINUE TO OBSERVE.  THE OIL DOES HAVE A STRONG SMELL OF GASOLINE... COMPARED TO OTHER VEHICLES.  I AM CONCERNED ABOUT THE LONGEVITY OF THE ENGINE DUE TO EXCESSIVE WEAR RELATED TO INSUFFICIENT LUBRICATION.",
        "vin": "SHHFK7H96JU"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "03/06/2019",
        "dateOfIncident": "03/04/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184522,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 HONDA CIVIC PARKED ON AN INCLINE. AFTER EXITING THE VEHICLE AND GOING INSIDE HOME, SPONTANEOUSLY ROLLED DOWN HILL AND CRASHED INTO A TREE. THE VEHICLE WAS IN PARK AND DID NOT ROLL IMMEDIATELY. THIS HAPPEN SOMETIME AFTER ENTERING THE RESIDENCE. IN RESEARCHING ONLINE I HAVE FOUND THIS HAS OCCURED WITH SEVERAL OTHER OWNERS AND HAS BEEN REPORTED TO THE HONDA CORPORATION SINCE 2016. 2016-2018 HONDA CIVICS SEEM TO BE THE VEHICLE MODELS/YEARS AFFECTED.",
        "vin": "JHMFC1F38JX"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/05/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184437,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS RUNNING AND IN PARK WHEN THE REAR WINDOW SHATTERED FOR NO APPARENT REASON. IT WAS ABOUT 60 DEGREES OUTSIDE AND THE FRONT AND REAR DEFROSTERS WERE ON. THE GLASS WAS STILL IN NEW CONDITION. THERE IS NO REAL EXPLANATION. AMONG THE WITNESSES WAS THE SALES MANAGER TO THE DEALERSHIP. EVEN WITH THAT, THE DEALERSHIP STILL REFUSED TO TREAT IT AS A WARRANTY REPAIR.",
        "vin": "2HGFC2F7XJH"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "02/06/2019",
        "dateOfIncident": "01/04/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174723,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SON WAS DRIVING HIS 2018 HONDA CIVIC SPORT HATCHBACK ON BASE AS HE IS IN THE ARMY NATIONAL GUARD WHEN HE CAME TO A BEND IN THE ROAD. HE TURNED THE STEERING WHEEL TO THE RIGHT, THEN HEARD AND FELT A POP AND THE CAR BECAME UNABLE TO BE STEERED IN THE DIRECTION THAT HE WAS TURNING THE STEERING WHEEL. THE CAR WENT LEFT EVEN THOUGH HE WAS TRYING TO TURN RIGHT INTO THE BEND. HE WENT ACROSS THE ROAD AND INTO A DITCH CAUSING SIGNIFICANT DAMAGE TO THE VEHICLE. THANKFULLY HE WAS UNHURT. THERE WERE OTHERS WHO WITNESSED THIS BECAUSE HE WAS DRIVING IN A MILITARY CONVOY AT THE TIME IT OCCURRED. THE NHTSA HAS ISSUED A RECALL #18V663000  FOR 2018-1017 HONDA CIVIC'S ON SEPT. 27, 2018 FOR THE POWER STEERING ASSIST FAILURE DESCRIBING EXACTLY WHAT HAPPENED TO MY SON; UNFORTUNATELY, HIS VIN HAS NOT BEEN INCLUDED IN THE RECALL. SOMEONE NEEDS TO INVESTIGATE THIS. THE INSURANCE COMPANY AND AMERICAN HONDA HAVE BOTH BEEN INFORMED OF THIS ACCIDENT AND AN ISSUE REPORT WAS FILED WITH HONDA BY US DETAILING WHAT HAPPENED. HOWEVER, THEY WILL NOT PAY TO OPEN UP THE POWER STEERING GEARBOX TO SEE IF THE MAGNET ON MY SON'S CAR DID IN FACT BECOME DISLODGED AS IN THE OTHERS. WE WOULD HAVE TO PAY OUT OF POCKET TO INVESTIGATE AND SINCE WE ARE LOSING A SIGNIFICANT AMOUNT OF MONEY ALREADY BECAUSE THEY'VE DEEMED THE CAR TOTALED, WE ARE UNABLE TO INVESTIGATE IT ON OUR OWN. PLEASE INVESTIGATE THIS TO SEE IF OTHER VIN NUMBERS NEED TO BE INCLUDED IN THIS RECALL! MY SON COULD HAVE BEEN KILLED OR HE COULD HAVE KILLED SOMEONE ELSE BECAUSE OF THIS!",
        "vin": "SHHFK7G40JU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/14/2019",
        "dateOfIncident": "08/22/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11169979,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 HONDA CIVIC - EX-L  INFOTAINMENT SCREEN (RADIO, HEAT, NAVIGATION SYSTEM, A/C, ETC CONTROLS TOUCHSCREEN) WILL FLASH OFF AND ON WHILE DRIVING INCLUDING DURING BACKUP CAMERA AND NAVIGATION SYSTEM USE. ISSUE IS INTERMITTENT AND NOT PREDICTABLE. HONDA DEALERSHIP HAS ATTEMPTED TWO RE-FLASHES OF THE SOFTWARE TO CORRECT THE ISSUE WITH NO POSITIVE RESULT. HONDA REPRESENTATIVE STATES THAT THE ISSUE HAS NO RESOLUTION AND WILL DO NOTHING FURTHER TO CORRECT THE ISSUE ON MY VEHICLE AND MAY HAVE A FIX AT SOME POINT IN THE FUTURE.",
        "vin": "2HGFC3B70JH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/08/2019",
        "dateOfIncident": "01/08/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165937,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESS FUEL IS ENTERING THE ENGINE OIL WHICH IS DILUTING THE OIL AND CAUSING PREMATURE WEAR.",
        "vin": "SHHFK7H52JU"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/28/2018",
        "dateOfIncident": "11/28/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163878,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 11/28/2018, I WAS DRIVING ON FREEWAY AND THE AIR BAG IN MY CAR DEPLOYED WITH NO REASON. I SENT THE CAR TO THE DEALER FOR INVESTIGATION. THE DEALER TOLD ME THAT THE AIR BAG IS DEPLOYED BECAUSE THEY FOUND A DENT ON THE REAR CONTROL ARM WHICH I FOUND HARD TO BELIEVE. WHEN THE AIR BAG DEPLOYED, THERE WAS NO COLLISION, I WAS DRIVING ON FREEWAY, SO THERE IS SURELY NO BUMPS ON THE ROAD. EVEN IF THEY FOUND A DENT ON THE CAR, THERE IS NO PROOF THAT THE DENT IS MADE ON THE SAME DAY THAT THE AIR BAG POPS UP. HYPOTHETICALLY IT CAN CAUSE THE AIR BAG TO DEPLOY, IT JUST MEANS THE CAR HAS DESIGN PROBLEMS BECAUSE SCRATCHING THE BOTTOM OF THE CAR CAN HAPPEN VERY OFTEN. IT IS TERRIFYING TO KNOW THAT WILL TRIGGER THE AIR BAG TO EXPLODE. THAT IS THE REASON I FEEL IT IS SUSPICIOUS AND IT IS NECESSARY TO FILE A COMPLAINT.  I HAVE REQUESTED THE DEALER TO PROVIDE THE INVESTIGATION RESULT REPORT, BUT THEY HAVE REFUSED. THEY CLAIM THE REPORT WILL ONLY BE PROVIDED TO THE INSURANCE BECAUSE MY INSURANCE HAD PAID FOR THE REPAIR. I HAVE CONFIRMED WITH MY INSURANCE AND THEY DID NOT RECEIVE ANYTHING EXCEPT THE ESTIMATION, MEANING THE DEALER IS STILL HOLDING THE INVESTIGATION RESULT AND DID NOT SHARE WITH ANYONE.",
        "vin": "2HGFC3B36JH"
    },
    {
        "components": "STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "12/27/2018",
        "dateOfIncident": "05/20/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11163608,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCIDENT",
        "vin": "2HGFC2F78JH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/22/2018",
        "dateOfIncident": "10/16/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163068,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "HONDA CIVIC 2018 MANUAL TRANSMISSION. BUMPING THE KEYCHAIN WITH MY KNEE CAN ROTATE THE KEY IN THE IGNITION TURNING OFF THE CAR WHILE DRIVING.     I HAVE A STANDARD SIZE KEY RING WITH A COUPLE CAR KEYS AND WORK/HOME KEYS. THEY DON'T HANG DOWN VERY FAR BUT DO SO FAR ENOUGH TO CONTACT MY KNEE WHEN DRIVING. WHEN IN MOTION, AS I SHIFT AND TAKE MY FOOT OFF THE GAS MY KNEE PUSHES ON THE KEYS. ON THREE OCCASIONS, ALL ON CITY STREETS SO FAR, THIS PUSH HAS BEEN ENOUGH TO ROTATE THE KEY IN THE IGNITION AND TURN OFF THE CAR.",
        "vin": "SHHFK7G23JU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/22/2018",
        "dateOfIncident": "12/11/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163070,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "HONDA CIVIC 2018 MANUAL TRANSMISSION. OCCASIONALLY, WHILE IN MOTION ON CITY STREETS, WHEN SHIFTING INTO 2ND OR 3RD GEAR THE GEARS WON'T FULLY ENGAGE. THE CLUTCH NEEDS TO BE DISENGAGED AND REENGAGE AND THE CAR SHIFTED INTO NUETRAL AND BACK INTO GEAR BEFORE THE GEARS WILL SEAT PROPERLY.",
        "vin": "SHHFK7G23JU"
    },
    {
        "components": "WHEELS,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "12/13/2018",
        "dateOfIncident": "12/07/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161221,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE BLOW OUT CAUSING CAR TO GO OVER CURB. LOSS OF LEFT TWO TIRES FRONT AND BACK AND RIGHT FRONT TIRE.  WAS MERGING FROM ONE HIGHWAY TO ANOTHER.   TIRES WERE CONTINENTAL PROCONTACT 215 /50",
        "vin": "SHHFK7H51JU"
    },
    {
        "components": "POWER TRAIN,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/10/2018",
        "dateOfIncident": "06/24/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11157319,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 HONDA CIVIC. THE CONTACT STATED THAT THERE WAS A CRACK IN THE SUN ROOF AND THE GEAR SHIFT FAILED TO CHANGE INTO ANY GEAR FROM PARK. THE DEALER (NORM REEVES HONDA SUPERSTORE HUNTINGTON BEACH, 19131 BEACH BLVD, HUNTINGTON BEACH, CA 92648, (714) 842-5431) WAS NOTIFIED OF THE FAILURE. THE CONTACT WAS UNCERTAIN IF THERE WAS A WARRANTY THAT APPLIED TO THE FAILURE AND WAS WAITING FOR A RESPONSE FROM THE DEALER. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURES. THE VIN AND FAILURE MILEAGE WERE NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/03/2018",
        "dateOfIncident": "11/19/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11155529,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE BEEN SMELLING GAS IN THE CABIN OF THE VEHICLE ONLY DURING START UP AND ITS BEEN HAPPENING FOR THE PAST COUPLE OF WEEKS. THE CAR IS PARKED IN A HEATED PARKING GARAGE WHEN THE SMELL OCCURS AND IT WILL ALSO HAPPEN OUTSIDE IN A PARKING LOT AFTER THE CAR SITS FOR A LITTLE BIT. YOU CAN ALSO SMELL A STRONG ODOR OF GAS WHEN YOU OPEN THE HOOD WHEN THE ENGINE IS COLD.",
        "vin": "19XFC2F71JE"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/26/2018",
        "dateOfIncident": "11/26/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154111,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 4400 MILES ON THE 2018 CIVIC HATCHBACK 1.5 L (APPROX 4 MOS) THE VEHICLE LOST POWER MOMENTARILY WHILE ACCELERATING AT ABOUT 30 MPH AND HAD A STRONG GAS SMELL IN THE CABIN. A CHECK OF THE OIL SHOWED THAT IT WAS EXTREMELY OVERFILLED WHEN PREVIOUS CHECKS DID NOT. HONDA DEALER (IDE HONDA, ROCHESTER, NY) REPLACED THE OIL AND OFFERED NO CORRECTIVE ACTION OR INFORMATION.",
        "vin": "SHHFK7H27JU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/25/2018",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11153576,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHIN ONLY A COUPLE MONTHS OF BUYING A NEW HONDA CIVIC HATCHBACK 2 OF THE CONTINENTAL PROCONTACT TIRES STARTED DEVELOPING BUBBLES IN THE SIDE WALL. THE BE VEHICLE WAS BOUGHT WITH TWO MILES ON IN AND NO MAJOR BUMPS OR POT HOLES HAVE BEEN HIT. REPLACING ALL TIRES SINCE IT IS ONLY A MATTER OF TIME BEFORE THE OTHER TWO GET THE BUBBLES AS WELL AND DON'T WANT AN ACCIDENT IF ONE BLOWS.      NOT HAPPY CONSIDERING THE CAR NOW HAS LESS THAN 8000 MILES AND LESS THAN A YEAR OLD AND ALREADY HAVING TO REPLACE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/20/2018",
        "dateOfIncident": "11/20/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152827,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 HONDA CIVIC. WHILE DRIVING 65 MPH, THE VEHICLE SPUTTERED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO LUNDGREN HONDA OF AUBURN (163 WASHINGTON ST, AUBURN, MA 01501) WHERE IT WAS DIAGNOSED THAT A MOUSE CHEWED THROUGH THE WIRE HARNESS. THE DEALER ALSO STATED THAT THERE WERE NO WARRANTIES ON THE VEHICLE. THE MANUFACTURER WAS NOT CONTACTED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 7,300. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/12/2018",
        "dateOfIncident": "11/09/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150991,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "RODENTS ATE THROUGH THE ELECTRONIC POWER STEERING WIRES. MY SON WAS DRIVING THE VEHICLE WHEN POWER STEERING LOSS OCCURRED. HE COULD HAVE BEEN IN AN ACCIDENT AND OR KILLED. AMERICAN HONDA WON'T DO ANYTHING ABOUT THIS AND SOMEONE NEEDS TO ADDRESS THIS SAFETY ISSUE. THE VEHICLE WAS IN MOTION WHEN LOSS OF POWER STEERING!!",
        "vin": "SHHFK7H51JU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/10/2018",
        "dateOfIncident": "11/09/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150772,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CHANGED OIL AT 40 % LIFE AND FOUND GASOLINE IN OIL NOT SURE HOW MUCH BUT VERY STRONG ODER.",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": true,
        "dateComplaintFiled": "11/09/2018",
        "dateOfIncident": "09/15/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11150366,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEPTEMBER 15 2018 I WAS INVOLVED IN A SOLO VEHICLE CRASH I FELL ASLEEP AND HIT A PARKED VEHICLE DIRECTLY FROM BEHIND RESULTING IN ME BEING PROPELLED FORWARD INTO THE AIR BAG THAN PUSHED BACK BY THE AIRBAG IN THE SEAT...I WAS WEARING MY SEATBELT BUT THE SEAT BRACKET BENT FORWARD DURING COLLISION PUSHING ME INTO AIRBAG CAUSING SERIOUS CHEST CONTUSIONS AND INFLAMMATION OF LOWER BACK. AFTER THE CRASH SEAT COULD NOT BE MOVED FORWARD OR BACKWARD AS THE BRACKET WAS BADLY BENT. I WAS ABLE TO GET PICTURES OF MY VEHICLE FROM THE OUTSIDE AND WASH GOING TO RETURN TO PULL VEHICLE FROM TOW BUT HONDA PULLED IT OUT BEFORE I COULD AND ARE IN POSSESSION OF THE VEHICLE.",
        "vin": "2HGFC2F50JH"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/08/2018",
        "dateOfIncident": "10/25/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150028,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 2025 MILES MY 2018 CIVICTHAT I HAD FOR 2ISH MONTHS STARTED SMELLING LIKE FUEL IN THE CAB. SO I LOOKED IT UP AND THE EARTH DREAMS MOTOR IS HAVING OIL DILUTION PROBLEMS AND IT IS BECOMING MORE COMMON. SO I CHECKED MY OIL AND FOUND MY CAR A QUART OVERFULL WITH FUEL IN MY OIL. I THEN HAD IT TOWED TO THE DEALERSHIP WHERE THEY GAVE IT A FREE OIL CHANGE AND SAID THAT THERE IS NO FIX ANDIT IS NORMAL. THE OIL VISCOSITY WILL DETERIORATE EVENTUAL LEAVING ME WITHA KNOCK OR DISABLED ON THE SIDE OF THE ROAD. IT IS AN ISSUE THAT CAN CAUSE A CRASH OR SICKNESS WHEN THE NOXIOUS GAS SMELL COMES BACK.  I HAVE NOW PUT 450 MILES ON IT SINCE THE OIL CHANGE AND AM SMELLING FUEL IN MY OIL AGAIN.",
        "vin": "SHHFK7H4XJU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/07/2018",
        "dateOfIncident": "11/06/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11149831,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL SMELL IN ENGINE OIL AND ENGINE OIL IS OVER FILLED ON DIPSTICK NOT LONG AFTER OIL CHANGE POSSIBLY DUE TO FUEL DILLUTION INTO OIL",
        "vin": "SHHFK7H44JU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/07/2018",
        "dateOfIncident": "11/02/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11149961,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE WIRING HARNESS COVER COMPOSITION IS ATTRACTIVE TO RODENTS.  SQUIRRELS CHEWED INTO THE HARNESS LEADING TO LOSS OF ACCELERATION.  THE ENTIRE HARNESS NEEDS REPLACING DUE TO THE SOY BASED WIRE COATING.  THE FAILURE WAS FIRST NOTICED WHILE AT SPEED (APPROXIMATELY 35 MPH IN CITY TRAFFIC.  SUBSEQUENT ATTEMPTS AT STARTING THE VEHICLE RESULTED IN ROUGH IDLE AND DANGEROUS HESITATION WHEN MERGING.    LOCAL DEALER ADVISES THIS IS A COMMON ISSUE AFFECTING THE UK ASSEMBLED CIVIC HATCH BACK.  ESTIMATE FOR REPLACEMENT IS $900.00 AS THIS IS NOT COVERED BY HONDA.",
        "vin": "SHHFK7H57JU"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/20/2018",
        "dateOfIncident": "10/20/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141567,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING ON A SIDE STREET (SPEED LIMIT 35) WHEN SUDDENLY NEITHER THE BRAKES NOR STEERING WORKED. IT WAS ALMOST LIKE I WAS HYDROPLANING, BUT THE ROADS WERE NOT WET AND IT WASN'T RACING. I HAD NO CONTROL OF THE CAR. FINALLY THE STEERING REENGAGED AND I WAS ABLE TO SWERVE THE CAR SO I DIDN'T HIT ANOTHER CAR. FORTUNATELY I WAS ON A SIDE ROAD AND NOT GOING VERY FAST.",
        "vin": "JHMFC1F33JX"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/30/2018",
        "dateOfIncident": "09/30/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132370,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE PASSENGER LANE WATCH CAMERA INTERMITTENTLY DOESN'T TURN ON CREATING A SAFETY ISSUE",
        "vin": "2HGFC1E53JH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/06/2018",
        "dateOfIncident": "08/29/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11124681,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A HONDA CIVIC HATCHBACK FROM WILLETT HONDA SOUTH IN MORROW, GA ON 8/29/2018. THE TIRE PRESSURE MONITORING SYSTEM WARNING LIGHT CAME ON WHILE I WAS DRIVING THE CAR FROM THE DEALERSHIP TO THE MY HOME. THAT DISTANCE BETWEEN THE DEALERSHIP AND MY HOME IS LESS THAN 20 MILES.     I TOOK THE CAR INTO THE SHOP ON 8/30/2018, AND I SPENT APPROXIMATELY 2 HOURS IN THE AT THE WILLETT HONDA WAITING FOR THE REPAIR. THE SAME WARNING LIGHT CAME ON WHEN I WAS ON THE WAY HOME AFTER THE CAR WAS REPAIRED.    WILLETT HONDA SENT A LOANER CAR TO MY NEWLY PURCHASED VEHICHLE FOR ONE DAY, 8/31/2018.    I DID NOT DRIVE THE CAR AGAIN UNTIL 9/5/2018. AFTER DRIVING THE CAR APPROXIMATELY 15 MILES THE TPMS WARNING LIGHT CAME ON AGAIN. I CALLED THE DEALERSHIP AND THEY SENT ANOTHER CAR.       I HAVE HAD THE CAR FOR 1 WEEK. IT HAS BEEN IN THE SHOP 3 TIMES. THERE IS A PROBLEM WITH THE TIRE PRESSURE MONITORING SYSTEM. ROTATING THE TIRES AND ADJUSTING THE AIR IN THE TIRES IS NOT THE PROBLEM. I SAT NEXT TO A LADY WITH HER CAR IN THE SHOP AND SHE IS HAVING THE SAME PROBLEM. ACCORDING THE HONDA, THE WARNING LIGHT SHOULD NOT BE IGNORED, BUT     I HAVE ONLY BEEN ABLE TO DRIVE A BRAND NEW VEHICHLE BACK AND FORTH TO THE SHOP. THE CAR WAS NOT DISCOUNTED TO ME FOR HAVING A FAULTY SYSTEM INSTALLED INTO THE CAR BY HONDA.",
        "vin": "SHHFK7H49JU"
    },
    {
        "components": "AIR BAGS,ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "08/23/2018",
        "dateOfIncident": "05/05/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121909,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD TO HAVE TO MANY OIL CHANGES, ALMOST ONE A MONTH , NOT GOOD ON THE MILAGE THEN A CAMRY MAYBE WOULD HOLD OFF THAT MANY CHANGES.",
        "vin": "2HGFC2F52JH"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/22/2018",
        "dateOfIncident": "08/21/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121665,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE AFTERNOON OF 8/21/2018, I WAS DRIVING MY 2018 HONDA CIVIC (MANUAL TRANSMISSION) TO PICK UP MY SON FROM ELEMENTARY SCHOOL.  AS I WAS MOVING THROUGH THE CAR RIDER LINE (WHICH IS ON A DOWNHILL SLOPE), I TURNED ON THE BRAKE HOLD ASSIST FEATURE SO THAT I WOULD NOT HAVE TO CONSTANTLY PRESS THE BRAKE PEDAL AS I'M WAITING IN LINE.  AS MY SON IS ENTERING THE REAR PASSENGER DOOR, THE CAR STARTS ROLLING FORWARD.  AS I TURN FORWARD AND SLAM ON THE BRAKES, THERE IS A YOUNG BOY AN INCH AWAY FROM MY BUMPER.  THEN LIGHTS APPEAR ON MY DASH DISPLAY INDICATING THERE IS PROBLEM WITH THE BRAKE HOLD SYSTEM (SEE ATTACHED PHOTO).  THANKFULLY NO ONE WAS INJURED IN THIS INSTANCE, BUT BOTH MY SON AND THE CHILD IN FRONT OF MY CAR COULD BOTH HAVE BEEN SERIOUSLY INJURED AS A RESULT OF THE FAULTY SYSTEM.  IF HONDA'S BRAKE HOLD ASSIST FEATURE HAS THE POTENTIAL TO FAIL SUDDENLY IN THIS FASHION, IT SHOULD NOT BE A FEATURE IN THE VEHICLE AT ALL.  IT PROVIDES DRIVER'S WITH A FALSE SENSE OF SECURITY THAT THEIR BRAKES ARE ENGAGED, BUT WHEN THE SYSTEM FAILS THE BRAKE SUDDENLY DISENGAGES ALLOWING THE VEHICLE TO ROLL FREELY.",
        "vin": "19XFC1E37JE"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "08/08/2018",
        "dateOfIncident": "07/25/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11118512,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEAD RESTRAINTS AND SEAT CONFIGURATIONS OF THESE HONDA CIVICS CAUSE SEVERE BACK PAIN, AS DIAGNOSED BY MY DOCTOR AND CHIROPRACTOR. I HAVE ONLY OWNED THE CAR FOR SIX WEEKS AND HAVE SPENT > 20 HOURS GETTING XRAYS, PHYSICAL THERAPY, AND VARIOUS RE-ALIGNMENT TREATMENT BECAUSE OF THE UNSAFE AND HARMFUL CONFIGURATION OF THESE SEATS. PER THE HONDA REPRESENTATIVE, THEY STATED THAT THESE HEAD RESTRAINTS AND SEAT SHAPES COMPLY WITH SAFETY REQUIREMENTS ASSOCIATED WITH THE AIRBAGS. HOWEVER, NHSTA AND OTHERS HAVE FAILED TO REALIZE THAT IN AN ATTEMPT TO MITIGATE \"HYPOTHETICAL WHIPLASH\", THEY ARE PROMOTING ACTUAL, WIDESPREAD, SEVERE DAMAGE TO DRIVERS.",
        "vin": "\tJHMFC1F9XJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/20/2018",
        "dateOfIncident": "04/13/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112528,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY CAR FROM WALDORF HONDA ON FRIDAY, FEBRUARY 23, 2018.   APPROXIMATELY 2 MONTHS AFTER PURCHASE, I BEGAN HAVING TROUBLE WITH THE VEHICLE.  ON APRIL 13, 2018, THE RED BRAKE LIGHT BEGAN TO FLASH AS I WAS DRIVING.  IN ADDITION, THE BRAKE SYSTEM (ABS) YELLOW INDICATOR ILLUMINATED.",
        "vin": "2HGFC2F56JH"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/13/2018",
        "dateOfIncident": "07/13/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111249,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT BUMPERS ON ALL 2016 TO 2018 HONDA CIVICS ARE NOT SECURED PROPERLY, HOND AIS AWARE OF THE ISSUE BUT HAS NO FIX FOR THIS. THESE BUMPERS COULD FLY OFF THE CAR AT HIGHWAY SPEEDS AND HURT OR KILL SOMEONE.     HERE'S A LINK WITH OTHER OWNERS WITH THE EXACT SAME ISSUE:    HTTPS://WWW.CIVICX.COM/THREADS/FRONT-GRILLE-COMING-APART.3495/",
        "vin": "19XFC2F74JE"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/11/2018",
        "dateOfIncident": "01/29/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110782,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "(4 COMPLAINTS, ALL POSSIBLY ELECTRICAL)    1)  KEY NOT DETECTED IN VEH ERROR, WHILE DRIVING VEHICLE, I HAVE THE KEY NOT CONNECTED TO ANYTHING AND NO LONGER IN A POUCH, MY CAR BEEPS AND SAYS \"KEY NOT DETECTED IN THE VEHICLE) THIS HAS HAPPENED WHILE DRIVING ON THE STREET AND FREEWAY. IT IS A RANDOM OCCURRENCE BUT HAPPENS ON A DAILY BASIS.     2) BLUETOOTH IS NOT CLEAR ON THE PERSON SPEAKING TO ME'S SIDE. OTHER PERSON STATES AS WELL AS HONDA TECH LINE STATES IT IS UNCLEAR, MUFFLED, AND LOUD INTERFERENCE WITH MY VOICE HAPPENS WHILE USING BLUTOOTH.     3) CAR PLAY: DUE TO BLUETOOTH ISSUE I STARTED ONLY TAKING CALLS WHILE USING CAR PLAY. ONCE I STARTED USING I STARTED HAVING THE ISSUE OF IT STATING RANDOMLY AFTER BEING SUCCESSFULLY CONNECTED\"CAR PLAY NOT SUPPORTED\" WHILE IN THE MIDDLE OF A CALL IT WILL DISCONNECT AND I WILL HAVE TO PULL OVER TO ATTEMPT TO RECONNECT.  RIGHT AFTER CAR PLAY WILL CONNECT AGAIN AND WORK UNTIL IT RANDOMLY DISCONNECTS AGAIN SAYING CAR PLAY NOT SUPPORTED.     NOTE: WITH CAR PLAY AND BLUETOOTH ISSUE I HAVE TAKEN CAR INTO DLR MULTIPLE TIMES STARTING WITH THE DAY AFTER THE VEH WAS PURCHASED IN 1/29/2018 NO RESOLUTION SO FAR TO DATE. DLR HAS REPLACED MICROPHONE, AND STILL NO RESOLUTION AS OF YET     4) DRIVER WINDOW MAKES WEIRD SOUND LIKE IT IS COMING OFF THE TRACK, TOOK INTO DLR AND THEY REPLACED THE MOTOR FOR THE WINDOW, THE WINDOW STILL HAS ISSUE.     ** I HAVE MORE PHOTOS OF RECORDS FROM TAKING VEH INTO DLRSHIP. BUT THIS FORM ONLY ALLOWS ME TO UPLOAD 5",
        "vin": "2HGFC1F70JH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/04/2018",
        "dateOfIncident": "05/03/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091697,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY REAR TIRE WENT FLAT. THE TIRE IS CRACKED AND AIR IS ESCAPING.NEW CAR BOUGHT ONLY TWO MONTHS TIRES SHOULD NOT BE CRACKING.",
        "vin": "19XFC2F58JE"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/29/2017",
        "dateOfIncident": "11/25/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11051247,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ISSUE IS WITH THE \"ROAD DEPARTURE MITIGATION\" (RDM)SYSTEM.  THE SYSTEM MAY HAVE BEEN WORKING AS DESIGNED: BUT IF SO IT CREATED A CORRECTION THAT MAY HAVE RESULTED IN A SERIOUS ACCIDENT.  THE ISSUE OCCURRED  AT A POINT WHERE THE ROAD ABRUPTLY CHANGES FROM A SINGLE LANE TO A THREE-LANE ROAD.  THE THREE-LANE ROAD HAS A SOLID DIVIDER BETWEEN THE THREE WEST-BOUND LANES AND THE THREE-EAST BOUND LANES. THE NORMAL PROCEDURE IS TO ENTER THE THREE-LANE GOING STRAIGHT AHEAD AND THEN MOVE TO THE RIGHT AS DESIRED TO GET INTO THE MIDDLE OR RIGHT-HAND LANE. IN OTHER WORDS THE SINGLE-LANE ROAD MERGERS INTO THE LEFT-HAND LANE  IF YOU KEEP THE STEERING STRAIGHT AHEAD. AS I APPROACHED THE TRANSITION POINT THE RDM  SUDDENLY PULLED THE STEERING WHEEL TO THE RIGHT (CREATING ABOUT A 30 DEGREE CHANGE IN DIRECTION) AND APPLIED HEAVY  BRAKING.  IF THAT ACTION HAD OCCURRED ON A TWO LANE ROAD WITH A CAR ON MY RIGHT IT WOULD HAVE RESULTED IN A COLLISION. SINCE THERE WAS AN ABRUPT CHANGE IN LANE MARKINGS AND THE SOLID CENTER DIVIDER CLOSE AHEAD; I SUSPECT THE RDM INTERPRETED THAT SITUATION AS \"I WAS ABOUT TO CRASH INTO SOMETHING\".  THE OWNER'S GUIDE SAYS IT WILL DO EXACTLY WHAT IT DID.  BUT IN THIS CASE IT COULD HAVE REPLACED ONE TYPE OF CRASH WITH ANOTHER TYPE OF CRASH;  OR MORE IMPOTENTLY CREATED A CRASH THAT WOULD NEVER HAVE HAPPENED AT ALL !!",
        "vin": "SHHFK7H94JU"
    }
]