[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/18/2022",
        "dateOfIncident": "02/01/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452868,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA HYBRID",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Hyundai Sonata Hybrid. The contact stated that while driving at an undisclosed speed, there were abnormal sounds coming from the vehicle. The malfunction lamp indicator warning light was illuminated. The vehicle was taken to the dealer and diagnosed with engine failure. The contact was informed that the engine needed to be replaced and that there was a Service Campaign Number: 966 (Engine Monitoring Logic) associated with the VIN that was unrepaired. The vehicle was not repaired and remained at the dealer. The manufacturer was made aware of the failure and requested the vehicle's service records. The failure mileage was approximately 75,000.",
        "vin": "KMHE34L37JA"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/18/2019",
        "dateOfIncident": "10/06/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269331,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA HYBRID",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 HYUNDAI SONATA HYBRID. WHILE DRIVING VARIOUS SPEEDS, THE MESSAGE \"HYBRID SYSTEM FAILURE\" SUDDENLY DISPLAYED AND THE VEHICLE LOST POWER AND STALLED. THE VEHICLE WAS TOWED TO CAPITAL HYUNDAI (2820 EASTERN BLVD, MONTGOMERY, AL) TO BE DIAGNOSED, BUT NO FAILURE WAS FOUND. THE VEHICLE WAS NOT REPAIRED. AFTER RETRIEVING THE VEHICLE FROM THE DEALER, THE FAILURE CONTINUED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED CASE NUMBER: 16248749. THE FAILURE MILEAGE WAS 19,000. *BF THE CONSUMER STATED THAT THE FIRST FAILURE OCCURED ON OCTOBER 31, 2019 AND THE SECOND OCCURRED ON OCTOBER 7TH, 2020. BOTH TIMES, THE MANUFACTURER WAS NOTIFIED, HOWEVER THE PROBLEM CONTINUES. *AS",
        "vin": "KMHE24L31JA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/13/2019",
        "dateOfIncident": "04/19/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11207275,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA HYBRID",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2018 HYUNDAI SONATA HYBRID LIMITED WAS INVOLVED IN A MVA ON 4:19/19. IT WAS A FRONT RIGHT IMPACT THAT INCLUDED THE PASSENGER SIDE, RIGHT FRONT TIRE AND RIM AND THE PASSENGER DOOR. IT WAS A HARD IMPACT. NONE OF THE AIRBAGS DEPLOYED. I WAS DRIVING STRAIGHT AT ABOUT 45 MILES PER HOUR ON AN 8 LANE DIVIDED CITY HIGHWAY. THE OTHER VEHICLE CAME OUT OF A SHOPPING CENTER TO THE RIGHT, CAME OVER 2 LANES THEN HIT ME AS I WAS DRIVING IN THE 3. THE OTHER DRIVER WAS GIVEN A TICKET FOR AN IMPROPER LANE CHANGE, CAME INTO MY LANE AND HIT MY VEHICLE.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/25/2018",
        "dateOfIncident": "08/23/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122295,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA HYBRID",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST BOUGHT A HYUNDAI SONATA LIMITED  AND DROVE IT HOME.  ON LOW BEAM THE HEADLIGHTS PROJECT 2 BLACK NOTCHES OR DARK AREAS THAT DO NOT ILLUMINATE THE ROAD UNDER THEM.  THIS IS ANNOYING AND DANGEROUS BECAUSE THE HEADLIGHTS DO NOT EVENLY ILLUMINATE THE ROAD SAFELY SO I CAN SEE WELL.  HAD I KNOWN ABOUT THIS DEFECT I WOULD NOT HAVE PURCHASED THE CAR.    THIS IS NOW WIDELY REPORTED AND I AM GOING TO CONTACT CONSUMER REPORTS ABOUT THIS.    DOES HYUNDAI HAVE A FIX FOR THIS OR AT LEAST AN INTELLIGENT EXPLANATION?    THE DARK LINE AND NOTCHES, BASICALLY BLOCK OUT VISION, WHEN TURNING CORNERS AND UP AND DOWN HILLS, A SAFETY ISSUE. JUST GET USED TO A DARK LINE BLOCKING VISION HALF WAY DOWN THE WINDSHIELD, AND TWO DARK NOTCHES IN THE VIEW IN FRONT OF THE CAR??",
        "vin": "KMHE34L38JA"
    }
]