[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/05/2022",
        "dateOfIncident": "03/02/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459689,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Hyundai Santa Fe. The contact stated while driving approximately 10 MPH, the vehicle independently came to an abrupt stop. There were several unknown warning lights illuminated. The vehicle was towed to an independent mechanic to be diagnosed. The vehicle was diagnosed with alternator, battery, and starter failures. The vehicle was repaired three times. The manufacturer was notified of the failure but provided no assistance. The approximate failure mileage was 100,000.",
        "vin": "KM8SMDHF7JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/10/2022",
        "dateOfIncident": "09/01/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451357,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact’s daughter owns a 2018 Hyundai Santa Fe. The contact stated while driving at an undisclosed speed, the vehicle stalled. There were no warning lights illuminated. The vehicle was towed to the local dealer to be diagnosed. The contact was informed that the engine needed to be replaced. The vehicle was not repaired. The manufacturer was contacted but no further assistance was provided. The failure mileage was unknown. The VIN was not available.*TP",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/03/2022",
        "dateOfIncident": "02/03/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11450306,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I was at the Tim Hortons drive-thru stopped behind a car in front of me the car in front of me started to go to the order window , as I let off the brake to start to go my suv took off full speed! I hit the brakes as hard as I could and the car kept moving forward  like the throttle was stuck at full acceleration.  I wasn't even hitting the gas pedal, after my vehicle struck the car and continued to smash into the car while I was holding a brake I put it in neutral and then the car finally came to a stop. I had 5 children in the car. And I am seeing this being an issue in alot of hyandai vehicles. And alot of complaint with this same issue.  If this would have happened on the hiway it could have possibly killed or Injured someone.  I am scared to death to drive the vehicle again.",
        "vin": "KM8SNDHFXJU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/27/2021",
        "dateOfIncident": "09/22/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434581,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle lost complete control of steering, as it felt \"loose\" during a left turn at an intersection. Vehicle could not be controlled by steering wheel causing me to drive into oncoming traffic lanes until vehicle slowed to a stop.",
        "vin": "km8sr4hf6ju"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/09/2021",
        "dateOfIncident": "04/01/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432290,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "My vehicle is available for inspection upon request.  On multiple occasions the fluid in coolant reservoir has drained out.  There is no visible signs of coolant on the under carriage nor is there a puddle on the floor of my garage and no warning lights have come on.  In the span of approximately 2 weeks the fluid dropped 1/4 of an inch.  Hyundia of Wesley Chapel (in Wesley Chapel, Fl) has had my vehicle on two occasions for this issue.  They documented a lose of pressure in the coolant system of 10psi after an extended pressure test on a cold engine.  Various other tests were performed but the source of the loss of coolant has not been found. The vehicle also intermittently experiences a loss of power when trying to accelerate from a full stop. The above mentioned dealership has not been able to replicate this issue either.",
        "vin": "km8sn4hf0ju"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/30/2021",
        "dateOfIncident": "08/30/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431090,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 HYUNDAI SANTA FE. CONSUMER WRITES REQUESTING THAT AIRBAG SENSOR IN VEHICLE BE DEACTIVATED.  THE CONSUMER STATED THE AIRBAG WOULD NOT ACTIVATE DUE TO BEING PETITE. THE CONSUMER QUESTIONED IF THERE WAS A FIX.",
        "vin": "99999999999"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/23/2021",
        "dateOfIncident": "08/22/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430225,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "This will be the fourth time our vehicle has to go to the dealer. We purchased this car in April of this year and the car has lived more at the dealer service department than with us. The first time, the car started smoking and left us stranded. The dealer changed out the fuel injectors. When it randomly started smoking it smelled strongly of gas and we were scared that the car would catch fire. The other times were due to the car not accelerating as it should on the highway making it quite difficult to merge and speed up as needed on the highway. This time, it's the same thing. The car does not want to shift gears and it's very dangerous when you are trying to accelerate to get to the right speed and you have cars coming in close from behind and there is no way to signal to them that the car is having trouble shifting. This problem started again yesterday. The check engine light turned on yesterday as well and we took the car to Autozone to scan it. the only code that came up was abs. The car just got towed to the dealer yet again but I have lost hope that they will be able to fix the issue as they have failed 3 times already. (one of these times the dealer failed to refill my radiator coolant after the flushed it causing the car to overheat as well and the car ac malfunctioned as well as a result.",
        "vin": "KM8SN4HF2JU"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/29/2020",
        "dateOfIncident": "12/28/2020",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385531,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR BEGAN SHUTTERING WHILE DRIVING DOWN A MAIN STREET (45-50MPH). WHEN WE PULLED OVER WE SMELLED GASOLINE AND BURNING. THE CAR WAS TOWED TO HYUNDAI SERVICE DEPARTMENT. THE SERVICE DEPARTMENT INFORMED MY THE FUEL INJECTORS WERE LEAKING CAUSING A FIRE. THE ARE REPLYING THE FUEL INJECTORS AND TOLD ME IT WOULD BE WISE TO HAVE THEM REPLACE ALL SPARKS PLUGS ($190) WHILE THEY HAD THE ENGINE OPENED UP.",
        "vin": "KM8SN4HF4JU"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/09/2020",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353964,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Kumho Tire Co., Inc.",
                "productMake": "KUMHO",
                "productModel": "KUMHO",
                "productYear": "9999",
                "size": "P195/55R15",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 HYUNDAI SANTA FE EQUIPPED WITH KUMHO TIRES, TIRE LINE: CRUGEN PREMIUM KL33 N/A, TIRE SIZE: 235/55/R19 N/A, THE DOT NUMBER: 000JTYANH4419. THE CONTACT STATED WHILE DRIVING 65 MPH, THE FRONT PASSENGER'S SIDE TIRE WAS SHAKING ABNORMALLY. THE CONTACT DROVE TO A TIRE SHOP AND NOTICE THAT THE TREAD BELT WAS SEPARATING FROM THE FRONT PASSENGER'S SIDE TIRE. THE CONTACT STATED THAT THE TIRE WAS REPLACED HOWEVER, IN APRIL THE FRONT AND REAR DRIVER'S SIDE TIRES EXPERIENCED THE SAME FAILURE. A DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 23,758.",
        "vin": "KM8SR4HF3JU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/09/2020",
        "dateOfIncident": "05/28/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327913,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ONE DAY FOR NO APPARENT REASON THE BSD SYSTEM STOPPED WORKING.  *TR",
        "vin": "5XYZW4LA0JG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/03/2020",
        "dateOfIncident": "04/25/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323084,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR CAMERA HAS A BLUE SCREEN THIS IS KNOWN FOR HYUNDAI SANTA FE SPORT.  ALSO MY SUV RAN HOT WHILE DRIVING.  THE SUV IS ONLY 2 YEARS WHY IS THE ANTIFREEZE/COOLANT RAN OUT. IT WAS BONE DRY. TALK TO CAR SHOP AND I WAS TOLD THAT THE WATER PUMP USUALLY HO OUT ON THE HYUNDAI SANTA FE SPORT. ALSO MY SUV ACT LIKE IT DONT WANT EXCELLARATE AND SWITCH GEARS ESPECIALLY WHEN TURNING.",
        "vin": "5NMZT3LB4JH"
    },
    {
        "components": "EXTERIOR LIGHTING,AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "04/02/2020",
        "dateOfIncident": "03/06/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11320011,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING A RENTAL CAR AT 4:30 A.M. ON COUNTRY ROAD ATTEMPTING TO CATCH OUR FLIGHT BACK HOME.  AFTER DRIVING APPROX. 20 MINUTES, HEADLIGHTS WENT OUT AND DASHBOARD LIGHTS.  WE HAD NO VISIBILITY, ATTEMPTED TO STOP VEHICLE, LEFT PAVEMENT AND STRUCK A TREE.  DURING OUR WEEK RENTAL OF THIS VEHICLE WE DID HAVE ISSUES WITH SUV LOSING POWER WHEN CLIMBING A HILL, BUT NOT A STEEP ONE AT ALL.  SUV WOULD DROP AT LEAST 10 MPH WHEN DOING SO.  NOT SURE IF THESE TWO ISSUES ARE RELATED AT ALL.",
        "vin": "5NMZT3LB2JH"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/08/2020",
        "dateOfIncident": "08/15/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307896,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "6 MONTHS AFTER I PURCHASE A BRAND NEW 2018 SANTA FE GRANDE MY VEHICLE START CUTTING OFF WHEN I TURN THE WHEEL A CERTAIN WAY I REPORTED IT TO THE COMPANY IT WILL NOT DETECT ON THE MACHINES SO THEY CANNOT FIX IT SO I'M STUCK WITH A CAR THAT CONTINUE TO CUT OFF AND NOBODY KNOWS WHY",
        "vin": "KM8SM4HF1JU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/17/2019",
        "dateOfIncident": "11/06/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289739,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING EXHIBITS \"STICTION\" AFTER DRIVING FOR 20-30 MINUTES. THIS BECOMES WORSE AS SPEED IS INCREASED. SMALL MOVEMENTS OF THE WHEEL PRODUCE NO STEERING EFFECT BUT RESISTANCE IS FELT. WHEN THE RESISTANCE IS OVERCOME, THE RESULT IS SLIGHT OVER STEER. UNDER THESE CONDITIONS IT IS DIFFICULT TO DRIVE IN  STRAIT LINE AS CONSTANT CORRECTIONS AND RE-CORRECTIONS ARE REQUIRED BACK AND FORTH. THE EFFECT IS THAT THE STEERING FEELS TO \"FREEZE\" UNTIL A MINIMUM BREAK OUT FORCE IS APPLIED, RESULTING IN AN OVERSHOOT PAST THE INTENDED POINT. IT IS SIMILARLY NECESSARY TO APPLY A POSITIVE RETURN TO CENTER FORCE TO RETURN TO STRAIT, AS THE NORMALLY PRESENT SELF CENTERING FEEL IS NOT PRESENT FOR SMALL STEERING ANGLES. THE PROBLEM CAN SOMETIMES BE DETECTED AFTER BEING AT REST FOR A FEW MOMENTS BUT IS NOT INTRUSIVE AT SLOW SPEED. HOWEVER, FROM ~40 UP IT IS VERY TIRING TO STAY IN LANE. HAVE WORKED WITH ONE DEALER WHO PERFORMED A SAS CALIBRATION WITH NO IMPROVEMENT. THEY CLAIM \"CANNOT REPRODUCE\" BUT SPEND MOST EFFORT TRYING TO PERSUADE ME THAT THE STEERING IS NORMAL. HOWEVER, THE ISSUE DID NOT SHOW UP UNTIL ~ 10,000 MILES WHICH INCLUDED LONG ROAD TRIPS ON THE INTERSTATE WITH NO ISSUES.  HAVE REFERRED ISSUE TO HYUNDAI CONSUMER AFFAIRS WHO HAVE ASKED ME TO WORK WITH ANOTHER DEALER - CURRENTLY WAITING FOR A CALL BACK.",
        "vin": "KM8SN4HF8JU"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/08/2019",
        "dateOfIncident": "10/04/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287809,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SLOW TO ACCELERATED I HAVE TO RE PRESS THE PEDAL JUST TO TRY AN SPEED UP ON THE HIGHWAY IM GETTING HONKED AT TRYING TO GO UP HILLS I HAVE TO PRESS IT TO THE FLOOR TO GO UP HILLS AN IT IDLES OUT AN ITS VERY DANGEROUS TO DRIVE ON THE FREEWAY I CANT GO PAST 50MPH AN I USE SPORT MODE ITS DOSNT HELP IT THIS SHOULD BE A RECALL IN ALL THE HYUNDAI CARS .",
        "vin": "5XYZT3LB6JG"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "10/18/2019",
        "dateOfIncident": "10/05/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269420,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 HYUNDAI SANTA FE. WHILE THE CONTACT'S FATHER WAS DRIVING VARIOUS SPEEDS, HE NOTICED AN ABNORMAL ODOR COMING FROM THE VEHICLE. ONCE THE VEHICLE WAS HOME, THE CONTACT OPENED THE FRONT PASSENGER DOOR AND NOTICED THAT THE PASSENGER SEAT HAD BURNED WITHOUT WARNING. THERE WAS NO INDICATION OF ANY FLAMES. THE VEHICLE WAS TAKEN TO GREEN HYUNDAI (1200 S DIRKSEN PKWY, SPRINGFIELD, IL 62703, (217) 525-1370) TO BE DIAGNOSED, BUT THE CAUSE OF THE FAILURE COULD NOT BE DETERMINED. THE DEALER STATED THAT THE SEAT COVER WAS CUT BY AN OBJECT. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO INSPECTED THE SEAT AND CONFIRMED THAT IT WAS BURNED BY A FAULTY SEAT WARMER. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 23,845.  *LN*JB *TP",
        "vin": "5NMZU3LB7JH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/19/2019",
        "dateOfIncident": "07/18/2019",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233444,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I CALLED THE DEALERSHIP TO REPORT A HOT SMELL IN MY CAR ON TUESDAY. THEY TOLD ME TO BRING IT IN FOR SERVICE INSPECTION. THURSDAY MORNING THE CAR WAS DRIVEN FOR A SHORT TIME AND PARKED IN THE DRIVE WAY AFTER. APPROXIMATELY TWO HOURS TO TWO AND A HALF HOURS LATER THE CAR CAB WAS FULL OF SMOKE. THE FIRE DEPARTMENT AND SHERIFFS DEPARTMENT BOTH ARRIVED ON SCENE.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/19/2019",
        "dateOfIncident": "07/14/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233455,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "A RECALL LETTER FROM HYUNDAI ON MY 2018 SANTA FE ON A KNOCK SENSOR TOOK IT TO MY DEALERSHIP THEY DID WHAT EVER THE RECALL WAS 3 MILES DOWN THE ROAD MY CAR WENT INTP LIMP MODE TOOK ME FROM 70MPH TO 30 CALL THE DEALER HAD TO LIMP IT BACK THEY HAH IT FOR 3 WEEKS HAD THE WIRE HARNESS REPLACED ASKED THEY HAD ANY TROUBLE WITH THIS AS WE WERE GOING ON VACATON THEY SAID NO HALF WAY THROUGH OUR TRIP TO SOUTH DAKOTA IT WENT INTO LIMP MODE AGAIN THIS TIME THE SPEED WAS 80MPH ON THE HIGHWAY  I CALLED HYUNDAI DOESNT SEEM THEY CARE IF WE WERE KILLED OR NOT OFFERED A FEW HUNDRED DOLLARS OUR VACATION WAS RUINED  I DONT FEEL SAFE IN THIS SUV BUT CANT SEEM TO GET HELP FROM HYUNDAI I WILL NEVER BUY ANOTHER ONE",
        "vin": "5XYZUDLB3JG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/20/2019",
        "dateOfIncident": "01/07/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11202644,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE NOISE WHEN STARTING HYUNDAI SANTA FE 2018 STATIONARY",
        "vin": "5NMZU3LB7JH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/09/2019",
        "dateOfIncident": "03/22/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194945,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE INTERSTATE AT 70 MPH AND THE ENGINE SUDDENLY SHUT OFF, IT HAS BEEN AT THE HYUNDAI GARAGE IN DUBOIS, PA FOR 3 WEEKS WAITING FOR A NEW ENGINE AND IT IS A NEW VEHICLE WITH ONLY 12.600 MILES?",
        "vin": "5NMZUDLB5JH"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/06/2019",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194354,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT A MONTH AGO I WAS DRIVING HOME TO SANTA FE NEW MEXICO WITH MY WIFE AND DOG. THE VEHICLE BEGAN TO SPUTTER AND DIED ON THE SIDE OF THE ROAD. I CALLED BLUE LINK WHICH IS THE HYUNDAI ROAD SIDE ASSISTANCE CLUB AND THEY TOWED MY VEHICLE INTO FIESTA HYUNDAI IN SANTA FE. AT FIRST THEY SAID MY OIL WAS OVER FILLED. I CALLED JIFFY LUBE WHERE I HAD IT SERVICE 5 DAYS PRIOR AND THEY SENT THEIR MANAGER TO HYUNDAI. UPON HIS ARRIVAL THE SERVICE MANAGER AT HYUNDAI SAID THEY MADE A MISTAKE AND IT WAS A FUEL INJECTOR THAT WAS STUCK ON AND FILED THE CYLINDER WITH FUEL CAUSING THE VEHICLE TO SHUT DOWN. THEY REPLACE THE FUEL NOZZLE AFTER 3 DAYS I GOT THE VEHICLE BACK AND HEADED TO MCKINNEY TEXAS, I MADE IT TO WICHITA FALLS TEXAS AND THE CAR SPUTTERED AND DIED AGAIN THIS TIME NOT EVEN TURNING OVER WHEN YOU PUSHED THE BUTTON. ONCE AGAIN I CALLED BLUE LINK AND THEY TOWED THE VEHICLE INTO HYUNDAI TO BE SERVICED. THEY CALLED ME THE NEXT DAY SAID THEY WOULD LOOK AT IT AND ADVISE ME. THEY NEVER CALLED ME BACK SO I HAD TO CALL THEM. THEY SAID THAT THE CATALYTIC CONVERTER BLEW OFF. THEY SAID THEY WOULD HAVE IT IN  THE MORNING. THAT NERVE HAPPENED AND THEY HAVE NOT CALLED ME BACK SINCE AND THAT WAS 6 DAYS AGO. THIS VEHICLE POURING FUEL INTO A CYLINDER IS A FIRE HAZARD. THIS TIME IT BUILT UP ENOUGH COMBUSTION TO BLOW THE CATALYTIC CONVERTER COMPLETELY OFF. I DO NOT KNOW THE REASON FOR THIS AS OF YET AS THEY ARE NON RESPONSIVE BUT I HAVE FILED A LEMON LAW CASE AGAINST HYUNDAI AND AM AWAITING THEIR DECISION. THIS CAR IS NOT SAFE AND I REFUSE TO GET BACK ONTO IT AGAIN. IT HAS STRANDING MYSELF AND MY FAMILY DOG INCLUDED TWICE NOW ON THE SIDE OF THE ROAD.. THE VEHICLE WAS IN MOTION WHEN THE ENGINE DIED BOTH TIMES.  *TR",
        "vin": "5XYZWDLAXJG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/26/2019",
        "dateOfIncident": "03/09/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191553,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING VEHICLE ON THE PARKWAY AT APPROXIMATELY 65 MPH, ENGINE FELT LIKE IT WAS SHUTTING DOWN, CAR STOPPED ACCELERATING, ENGINE LIGHT WAS BLINKING, SPEEDOMETER STOPPED WORKING, BLUE LINK NOTIFICATION SYSTEM ADVISED TO GET TO SERVICE TODAY. THIS OCCURRED ONE WEEK AFTER THE CAR RECEIVED A SOFTWARE UPDATE FOR A KNOCK SENSOR RECALL. CAR HAS BEEN IN SERVICE SINCE 3/9/19; DEALERSHIP REPLACED WIRIING HARNESS PER HYUNDAI'S RECOMMENDATION, WHEN THEY TEST DROVE THE VEHICLE, THE ISSUE HAS NOT RESOLVED. THEY ARE WAITING FOR HYUNDAI TO ADVISE OF NEXT STEPS. I DO NOT FEEL SAFE EVER GETTING BACK IN THIS VEHICLE DUE TO ALL OF THE CURRENT ISSUES SURROUNDING HYUNDAI ENGINES, INCLUDING FIRES.",
        "vin": "5NMZUDLB2JH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/24/2019",
        "dateOfIncident": "03/23/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191162,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS DRIVING ON NJ PARKWAY IN HEAVY RUSH HOUR TRAFFIC DOING 70 MILES AN HOUR. CAR THEN STUTTERED AND SLOWED DOWN, WITH HER HAVING TO MOVE THREE LANES OVER WHILE TRYING TO GET OVER BRIDGE. HYUNDAI BLUE LINK CAME ON AND TOLD HER TO GET CAR IMMEDIATELY TO THE DEALER. WHEN TAKEN TO DEALER THEY SAID DUE TO THE KNOCK SENSOR UPDATE THE ENGINE WILL NEED TO BE REPLACED AT 27,000 MILES? THIS WAS DONE BY HYUNDAI TWO WEEKS AGO.    UPDATE TO YESTERDAY 3/23/19 AND SAME THING HAPPENED TO HER AGAIN GOING TO WORK ON THE NJ PARKWAY. I THEN TOOK THE CAR TO THE DEALER, SAME ISSUES, SAME COMPUTER SCREEN SHOWED IN THE CAR AND WILL BE NEEDING NOW SECOND ENGINE AT 29,000 MILES.    TWO BLOWN ENGINES UNDER 30,000 MILES, HYUNDAI ADMITS THE PROBLEM TO US AND NOT SURE WHY OTHERS ARE HAVING ISSUE. RECEIVED RENTAL CAR BOTH TIMES.    WILL SEE HOW HYUNDAI RECTIFY THIS PROBLEM, THEY SHOULD BUY BACK CARS FROM OWNERS AND REIMBURSE TIME MISSED FROM WORK, PAIN AND SUFFERING AS WELL AS THE STRESS OF DRIVING ON ,AMIR HIGHWAY AND LOSING POWER IN YOUR CAR.",
        "vin": "5NMZU3LBXJH"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/22/2019",
        "dateOfIncident": "03/21/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190866,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER'S SEAT APPEARS TO BE SET TOO LOW AT THE BACK OF THE SEAT. THE SIDES OF WINGS OF THE BUCKET SEAT ARE TOO HIGH NEAR THE REAR OF THE SEAT. DUE TO THE POOR DESIGN IT CAUSES THE DRIVER TO POSITION THEMSELVES AWAY FROM THE LEFT SIDE WING EITHER FORWARD OR FORWARD AND TOWARDS THE CENTER CONSOLE. I WORRY THAT DUE TO THE POOR SEAT DESIGN SITTING PROPERLY POSITIONED WITHIN THE SEAT IS NOT POSSIBLE BECAUSE YOU CAN NOT SIT COMFORTABLY. IT APPEARS ONLINE THAT MANY COMPLAIN ABOUT THE DRIVER'S SEAT. DURING AN ACCIDENT I BELIEVE GREATER PERSONAL BODILY INJURY COULD OCCUR TO A DRIVER BECAUSE OF THE POOR SEAT DESIGN AND NOT BEING PROPERLY SEATED IN THE SEAT. I HAVE RIDDEN IN THE PASSENGER'S SEAT AND IT DOES NOT APPEAR TO HAVE THE SAME ISSUE. IT MIGHT BE THE OUTER PLASTIC SHROUD ON THE LEFT SIDE OF THE DRIVER'S SEAT THAT CAUSES THE IMPROPER SEATING WITHIN THE VEHICLE. I WORRY FOR MY SAFETY, MY FAMILY'S SAFETY AND OTHER DRIVER'S SAFETY BECAUSE OF THE POOR SEAT DESIGN.",
        "vin": "5XYZTDLB9JG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/11/2019",
        "dateOfIncident": "02/23/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185946,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS PARKING THE CAR.  THE CAR WAS STOPPED AND MY HAND WAS ON THE GEAR SHIFT.  THE CAR ACCELERATED SUDDENLY.  THE CAR JUMPED THE CURB I WAS FACING AND ENDED UP IN A GRASS MEDIAN.  I HAD TO PUSH THE BRAKE VERY HARD TO GET THE CAR TO STOP.",
        "vin": "5NMZT3LB2JH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/28/2019",
        "dateOfIncident": "01/30/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183217,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK THE VEHICLE IN FOR AN OIL CHANGE. DEALERSHIP PUT A NEW COMPUTER UPDATE ON CAR DUE TO BAD ENGINES. THE NEXT DAY 1-30-19 THE VEHICLE HAD A ERROR COME ON THE CAR PUTTING IT IN SAFE MODE NOT ALLOWING THE CAR TO MOVE OVER 67 MPH. HAD IT TOWED TO THE DEALERSHIP. MURDOCK HYUNDIA OF LINDON. THEY DID A TEST TO DETERMINE THAT THE ENGINE NEEDED TO BE REPLACED. THIS TOOK 29 DAYS FOR THE DEALERSHIP TO FIX AND MY CAR IS NOT THE SAME. THE MOTOR SEEMS SLUGGISH. CAR IS ONLY 6 MONTHS OLD WITH 14000 MILES.",
        "vin": "5NMZUDLB8JH"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/26/2018",
        "dateOfIncident": "09/14/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163465,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "OCCASIONALLY STALLS WHEN STOPPED & TAKE OFF & TURN RIGHT OR LEFT AT A SLOW SPEED..ONE T  IME DIED COMPLETELY ABLE TO PULL OVER & RESTART ENGINE. HAPPENS ON CITY STREETS. THE DATES IT STALLED ARE 9-14-18 10-5-18 10-18-18 11-16-18 11-28-18 12-04-18",
        "vin": "KM8SM4HF7JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/20/2018",
        "dateOfIncident": "12/06/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162841,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE PROBLEM",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/07/2018",
        "dateOfIncident": "10/31/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11149837,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING THE VEHICLE ON THE HIGHWAY AT SPEEDS HIGHER THAN 60MPH, THE STEERING WHEEL SEEMS TO STICK IN ONE POSITION AND JERK WHEN YOU TRY TO ADJUST THE STEERING IN THE SLIGHTEST.",
        "vin": "KM8SM4HFXJU"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/07/2018",
        "dateOfIncident": "03/27/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11149996,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 HYUNDAI SANTA FE. THE CONTACT STATED THAT THE PASSENGER SEAT BELT FAILED TO MAKE AN AUDIBLE SOUND WHEN IT WAS ENGAGED. THE VEHICLE WAS TAKEN TO SPOKANE HYUNDAI (8801 E SPRAGUE AVE, SPOKANE VALLEY, WA 99212, (509) 922-1450) TO BE DIAGNOSED, BUT A FAILURE COULD NOT BE FOUND. THE CONTACT STATED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V145000 (SEAT BELTS). THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 7,500.",
        "vin": "5XYZWDLA6JG"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/16/2018",
        "dateOfIncident": "10/06/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11140655,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING ON A BACK ROAD GOING ABOUT 35-40 MPH, ALL OF A SUDDEN THE RPMS SPIKED WAY UP AND THE CAR STARTED SHAKING. AS I PRESSED THE GAS PEDAL THE CAR WOULD BARELY MOVE BUT THE RPMS WOULD GO EXTREMELY HIGH. EVERY TIME I HAD A STOP LIGHT AND TRIED ACCELERATING ONCE THE LIGHT TURNED GREEN THE CAR WOULD BARELY MOVE AND RPMS WOULD JUST KEEP REVING UP REAL HIGH. I WAS AFRAID I WAS GOING TO GET HIT OR REAR ENDED. HUGE SAFETY CONCERNS.",
        "vin": "5NMZTDLB7JH"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/26/2018",
        "dateOfIncident": "09/26/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131646,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "YESTERDAY WHEN I WAS TEACHING MY VEHICLE I SUDDENLY MARKED STEERING WHEEL ON THE BOARD. AND ON THE BRAKES EVERY TIME I PUT THE EMERGENCY PARKING BRAKE IT MAKES A LOUD SOUND ON THE LEFT REAR SIDE.",
        "vin": "KM8SRDHF6JU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/04/2018",
        "dateOfIncident": "07/23/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11124392,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 HYUNDAI SANTA FE. WHILE DRIVING 40 MPH, THE VEHICLE HESITATED AND WOULD NOT ACCELERATE WHEN THE ACCELERATOR PEDAL WAS DEPRESSED. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS NOT TAKEN TO A DEALER TO BE DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 6,000.",
        "vin": "5NMZU3LB5JH"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/17/2018",
        "dateOfIncident": "01/13/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120572,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "LED HEADLIGHTS PARTICULARLY ON UNLIGHTED ROADS PRESENT A DARKEN SHADOW ON THE TOP HALF OF THE WINDSHIELD WHILE CAR IS IN MOTION.  NARROWING VIEW IS A SAFETY HAZARD AS ONE IS UNABLE TO SEE APPROACHING TRAFFIC OR PEDESTRIANS.  DEALERSHIP AND HYUNDAI CUSTOMER SUPPORT STATED THAT HEADLIGHTS MEET SPECS.  SERVICE MANAGER DROVE CAR AT NIGHT AND TOLD ME THAT HE SEES THE ISSUE BUT HAS NO FIX.  HYUNDAI CUSTOMER SUPPORT SAID IT WAS NOT A WARRANTY ISSUE, BUT A DESIGN ISSUE AND I COULD MODIFY THE HEADLIGHTS AT MY EXPENSE AND BREAK THE WARRANTY.  I WILL ATTACH A PICTURE AND CAN BRING THE VEHICLE TO AN INDEPENDENT AGENT TO VALIDATE.",
        "vin": "KM8SRDHF5JU"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/30/2018",
        "dateOfIncident": "05/17/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11098777,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING @60 W/CRUSE ON GOING DOWN A HILL ENGINE RPM'S SUDDENLY JUMP FROM 2000 TO ANYWHERE FROM 3000 TO 5000 RPM'S AND THE ONLY WAY TO STOP ENGINE RACING IS TO TAP THE BRAKES TO DISENGAGE CRUSE. ALSO VEHICLE WILL NOT SPEED UP WHEN TURNING A CORNER,LIKE THE TRANSMISSION DOESN'T DOWN SHIFT.THESE BOTH HAPPEN ALL THE TIME.VEHICLE HAS LESS THAN 800 MILES.",
        "vin": "5XYZUDLB7JG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/24/2018",
        "dateOfIncident": "04/23/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089898,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WE LEASED THIS NEW VEHICLE ON APRIL 21ST 2018.  AT THE TIME, WE DID NOT KNOW IT HAD AN OPEN RECALL FOR A FAULTY AND DANGEROUS STEERING WHEEL/COLUMN CONNECTION.  WE WERE FINALLY NOTIFIED BY THE DEALERSHIP 2 DAYS AFTER THE SALE ON APRIL 23RD, 2018.  ATLANTIC HYUNDAI OF ISLIP, NY TOLD US THAT THEY THEMSELVES WERE JUST NOTIFIED OF THE RECALL, BUT THROUGH A SEARCH I LOCATED ARTICLES SHOWING THAT HYUNDAI MOTORS BEGAN NOTIFYING CUSTOMERS ON MARCH 16TH, 2018, OVER A MONTH EARLIER.  MY WIFE AND TWO CHILDREN WERE ALLOWED TO DRIVE OFF THE LOT IN THIS VEHICLE, WHICH COULD UNKNOWINGLY EXPERIENCE A SEPARATION OF THE STEERING WHEEL FROM THE STEERING COLUMN WHILE BEING DRIVEN.  WE WOULD NOT HAVE LEASED THIS VEHICLE IF WE HAD KNOWN ABOUT THE RECALL AND BECAUSE THEY LIED, STATING THAT THEY HAD JUST GOTTEN NOTICE OF THE RECALL.",
        "vin": "KM8SNDHF8JU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/17/2018",
        "dateOfIncident": "03/16/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079904,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING BECOMES UNSTABLE DURING DRIVING ON WINDY DAYS.  STEERING TRAYS TO OVER COMPENSATE FOR WIND AND BECOMES SCARY TO DRIVE.",
        "vin": "5XYZW4LA0JG"
    }
]