[
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/13/2021",
        "dateOfIncident": "07/09/2021",
        "fire": false,
        "manufacturer": "KTM North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424560,
        "products": [
            {
                "manufacturer": "KTM North America, Inc.",
                "productMake": "HUSQVARNA",
                "productModel": "VITPILEN 701",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving in heavy traffic on the Manhattan Bridge in Brooklyn, NY on a 2018 Husqvarna Vitpilen 701 motorcycle when my hydraulic clutch suddenly stopped functioning. The bike has only about 70 miles on the odometer. This clutch problem caused the motorcycle to jerk to a stop. It was difficult to shift into neutral to restart the vehicle and there was a long line of cars behind me  on the bridge with no breakdown lane. I was barely able to get the vehicle off the bridge. Every time I had to slow down to avoid a collision, the bike would stall. I learned that the problem was pervasive among the motorcycles with this hydraulic clutch slave cylinder system and saw evidence of hydraulic fluid leaking under the slave cylinder.  There are many Husqvarna Vitpilen owners' discussion groups that are discussing the problem and how to solve it. The consensus seems to be that the OEM hydraulic clutch slave cylinder is defective. There is no warning lamp for this issue, and the manufacturer and dealer had not announced anything about it. I had heard about it from other owners of this kind of vehicle.  The bike can not be safely driven with this defect and I feel lucky to be alive after the incident I described above.",
        "vin": "VBKUPV406JM"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/26/2020",
        "dateOfIncident": "04/08/2020",
        "fire": false,
        "manufacturer": "KTM North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326002,
        "products": [
            {
                "manufacturer": "KTM North America, Inc.",
                "productMake": "HUSQVARNA",
                "productModel": "VITPILEN 701",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 HUSQVARNA VITPILEN 701. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V170000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CALLED TO THREE BROTHERS RACING (1560 SUPERIOR AVE # C, COSTA MESA, CA 92627, (949) 642-0546) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE IF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "VBKUPV403JM"
    }
]