[
    {
        "components": "POWER TRAIN,TIRES",
        "crash": false,
        "dateComplaintFiled": "08/20/2003",
        "dateOfIncident": "07/24/2003",
        "fire": false,
        "manufacturer": "Tiffin Motorhomes, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10033195,
        "products": [
            {
                "manufacturer": "Tiffin Motorhomes, Inc.",
                "productMake": "TIFFIN",
                "productModel": "ALLEGRO",
                "productYear": "1991",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN TIRE CORP.",
                "productMake": "MICHELIN",
                "productModel": "XZU4 22.5",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHILE DRIVING MY MOTORHOME AT 65 MPH I HAD A LEFT INNER TIRE BLOWN, THAT SAME DAY I HAD A LEFT OUTER TIRE BLOWN, AND THE FOLLOWING  DAY I HAD A RIGHT FRONT TIRE BLOWN WHILE DRIVING DOWNHILL.ONLY GODS HANDS KEPT  ME FROM WIPING OUT SEVERAL CARS BEFORE I WAS ABLE TO STOP THE COACH. THESE WERE ALL BRAND NEW XRV 255 80R 22.R. MICHELN CUSTOMER SERVICE  INFORMED ME IT WAS NOT POSSIBLE THAT THEY HAD A PROBLEM WITH THIS TIRE, I WAS TOLD I HAD A COACH THAT WAS VERY OVER WEIGHT AND THAT THERE WAS NOTHING THAT THEY COULD DO. ON A CERTIFIED SCALE THE COACH WAS ALMOST TWO THOUSAND LBS UNDERWEIGHT. THE REAR AXLE WAS FOUR THOUSAND ONE HUNDRED AND FORTY LBS UNDERWEIGHT. I HAD THIS VERY SAME PROBLEM WITH THE PRIOR TIRES ON THIS COACH, THREE OF THEM BLEW IN THE EXACT SAME MANER, ALL HAD WELL OVER HALF THE TREAD LIFE LEFT. THE ONLY REASON THESE TIRES WERE REPLACED WITH MORE MICHELN TIRES IS THAT MICHELN TIRES ARE THE ONLY MAKERS OF THIS SIZE TIRE. WORRIED FOR MY LIFE AND OTHERS I HAD THE STEERING TIRES REPLACED WITH ANOTHER BRAND WITH A DIFFERENT SIZE. I WAS TOLD BY BOTH SERVICE MEN WHO CAME OUT THAT THEY SEE THE SIDEWALL BLOWOUTS ON MICHELN TIRES ALL THE TIME, WHERE I BOUGHT THE NEW STEERING TIRES THE SHOP MANAGER TOLD ME NO MATTER WHAT I WOULD NEVER GET A WARRANTY FROM MICHELN. THEY ALWAYS HAVE A REASON.I CALLED THE ALLEGRO RV COMPANY TO INQUIRE ABOUT THE WEIGHT OF MY CAMPER AND WAS TOLD BY THE PARTS MANAGER THAT THEY SEE THE MICHELN RV TIRES BLOW RIGHT BELOW THE TREAD ON THE SIDEWALL. HE SAID THEY HAD A COACH IN THE SHOP AS WE SPOKE THAT HAD SUSTAINED A LOT OF DAMAGE DUE TO A MICHELN TIRE BLOWING OUT. DON,T LET THIS TURN INTO A FIRESTONE MASS MURDER, PLEASE CHECK THIS OUT. THANK YOU THE REVEREND STEVE D. STEVENS.  *AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/12/1994",
        "dateOfIncident": "03/23/1994",
        "fire": false,
        "manufacturer": "Tiffin Motorhomes, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 474206,
        "products": [
            {
                "manufacturer": "Tiffin Motorhomes, Inc.",
                "productMake": "TIFFIN",
                "productModel": "ALLEGRO",
                "productYear": "1991",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE ACTUATOR FAILED, CAUSING LOSS OF BRAKES.",
        "vin": "1GBKP37N9M3"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/12/1994",
        "dateOfIncident": "03/23/1994",
        "fire": false,
        "manufacturer": "Tiffin Motorhomes, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 474206,
        "products": [
            {
                "manufacturer": "Tiffin Motorhomes, Inc.",
                "productMake": "TIFFIN",
                "productModel": "ALLEGRO",
                "productYear": "1991",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING PUMP FAILED.  *SKD",
        "vin": "1GBKP37N9M3"
    }
]