[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/28/2022",
        "dateOfIncident": "03/22/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458696,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I bought my 2018 Kia Soul from Fredy Kia Dealership in Houston, TX and after 3 years and 124K miles the engine failed. It started with the check light for 'engine knock sensor' code 1326. I had the sensor replaced but the mechanics mentioned that my oil was extremally low and needed oil. I just had my oil replaced by Archer Kia dealership 2 month prior how could that be? So they replace the oil and the sensor. I drove it for 4 hours and the check engine light came on again this time there is a knocking sound. The mechanics say its a blown piston and now the engine has to be replaced. This is incredibly sad and frustrating to know that these cars' engine fail after 100K and have to replace the engine. After researching on on this site and https://www.aboutautomobile.com/, this engine problem has been going on since 2012. How can this be? Why isn't Kia doing something to cover and fix this issue?",
        "vin": "KNDJP3A52J7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/24/2022",
        "dateOfIncident": "08/12/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458170,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY ENGINE STARTED TO KNOCK OUT OF NO WHERE AND IT BLEW A ROD. I HAD A MECHANIC LOOK AT THE CAR AND HE SAID THE ENGINE WAS GONE. HE SAID YOUR CAR SHOULD NOT BE HAVING ENGINE PROBLEM AT ALL FOR THE YEAR OF THE CAR. I HAD ONLY HAD MY CAR NOT EVEN A YEAR. I GOT MY CAR IN 2020. MY CAR HAS BEEN SITTING IN MY YARD WITH A BLOWN ENGINE AND I AM MAKING MONTHLY PAYMENTS ON A CAR I CAN NOT DRIVE. I AM FURIOUS. I GOT MY CAR FROM HERTZ. I AM SO PISS. I NOTICE THEY RECALLED OTHER YEARS EXCEPT 2018. I NOTICE ALOT OF PEOPLE HAS REPORT THIS PROBLEM.",
        "vin": "KNDJP3A55J7"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/14/2022",
        "dateOfIncident": "07/11/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11451929,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owned a 2018 Kia Soul. The contact stated that while driving 35-40 MPH in an intersection, another vehicle ran the red light, causing his vehicle to crash into the passenger side of the other vehicle. The air bags failed to deploy. There were no warning lights illuminated. The contact was able to exit the vehicle on his own. The contact sought medical assistance the next day and was diagnosed with a ruptured disk on his neck and lower back.  A police report was filed. The vehicle was towed to a tow lot, where it was totaled. The dealer and the manufacturer were notified of the failure and advised the contact that the air bags acted as intended and did not have to deploy. The contact became aware of the recall for NHTSA Campaign Number: 22V031000 (AIR BAGS). The contact followed with the manufacturer who informed him they could not assist as his VIN was not included in the recall. The failure mileage was approximately 37,000.",
        "vin": "KNDJP3A57J7"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/17/2022",
        "dateOfIncident": "01/13/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447800,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Follow up to complaint number 11446088 submitted on 1/3/2022  Car was taken to dealership on 12/18/2021 for check engine light with code P1326 and car entered a limp home mode that limited engine RPMs to 1800-2000 RPM.  I received a call from dealership on 1/12/2022 informing me that car was ready for pickup.  Picked up car on 1/13/2022, where invoice says the following:  \"77240 p1326 DTC 39250fln/39250rq0 check engine light on arrival, trouble code p1326.  bearing clearance test was not able to be performed due to no tsb opened yet for this year make and model. opened a pwa case performed compression and leak down test passed . performed few test tech line required and came to a conclusion that engine replacement is not approved, knock sensor was approved under warranty vehicle will be shipped with no dcts over 2 drive cycles of 10 miles\"  Two notes:  (1) it appears that the manufacturer informed dealership that it would not approve replacing the engine, despite the engine being under warranty, because no recall has yet been issued on the 2018 model year. (2) the dealership say they performed 2 drive cycles, each of at least 10 miles.  This was not done, as shown on the mileage in/out readings on the attached invoice (see attached document, \"06 - 2022-01-12 - Kia Carson - Invoice\").  Attached are 8 documents for all the documents I have related to this problem: (1) NHTSA - Vehicle Complaint - 11446088 - 2022-01-03 (2) Kia Product Improvement Campaign Letter - 2021-11-16 (3) 01 - 2021-12-04 - Kia Carson - Workorder (4) 02 - 2021-12-04 - Kia Carson - Invoice (5) 03 - 2021-12-07 - Kia Carson - Workorder (6) 04 - 2021-12-07 - Kia Carson - Invoice (7) 05 - 2021-12-18 - Kia Carson - Workorder (8) 06 - 2022-01-12 - Kia Carson - Invoice  Answers to questions above: (1) not available for inspection.  I no longer possess vehicle (2) see complaint 11446088 (3) dealer confirmed problem, see 2022-01-12 invoice (4) yes, see 2022-01-12 invoice (5) see complaint 11446088",
        "vin": "KNDJP3A55J7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/14/2022",
        "dateOfIncident": "01/01/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447464,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact's daughter-in-law owns a 2018 Kia Soul. The contact stated that while her husband was driving at an undisclosed speed, the vehicle lost motive power. The oil warning light illuminated, and the contact's husband poured oil into the oil reservoir. The vehicle was towed to the contact's daughter-in-law's residence. An unknown dealer was made aware of the failure but informed the contact that there was no recall associated with the VIN. The vehicle was diagnosed by two independent mechanics with engine damage and connecting rod failure, which punctured the engine block. The engine needed to be replaced. The vehicle was not repaired. The manufacturer was made aware of the failure and informed the contact that they had issued a Product Improvement Campaign for the engine in November 2020; however, they did not have the contact's daughter-in-law's address. The failure mileage was approximately 100,000.",
        "vin": "kndjp3a58j7"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/13/2022",
        "dateOfIncident": "01/13/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447348,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "My engine blew it just hit 80,000 miles on the dot and since I’m purchasing it threw Freedom Chevrolet Buick gmc by Ed Morse and not Kia directly my car cannot get fixed! I still owe a pretty penny and now I have no way of fixing when other Kia’s have had the same issue with engine blowing I just would like my car fixed. My safety and my kids what put in danger when it decided to do this On a busy road!",
        "vin": "KNDJP3A52J7"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/04/2022",
        "dateOfIncident": "12/17/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446088,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "On 16 November 2021, Kia sent a letter for a Product Improvement Campaign to install software called \"Knock Sensor Detection System\" (\"KSDS\") on my 2018 Kia Soul Plus.  The software update was installed on 4 December 2021.  The 16 November letter noted that if KSDS detected a problem, the car would enter a limp home mode that limited engine RPMs to 1800-2000 RPM and the Malfunction Indicator Lamp (\"check engine light\") would blink continuously.  On 17 December 2021, the check engine light started to blink continuously, and the engine RPMs never exceeded 2000 RPM.  I took the car to the dealership on 18 December 2021.  The car is not safely operable.  The dealership told me that they needed technical assistance from the factory, which they have not yet received as of 3 January 2022.  I'm reporting the issue because it appears to be related to the known engine manufacturing defects in Theta, Nu, and Gamma lines of engines, and that these issues persist beyond the 2011-2016 model years (for which a recall has already issued) and at least into the 2018 model year.  Answers to questions: (1) powertrain/engine failure, possibly other system(s) (2) safety risk is known fire danger in Theta, Nu, and Gamma engines (3) dealer is currently diagnosing/confirming the issue (as of 1/3/22) (4) only dealer has inspected vehicle (as of 1/3/22) (5) no issues prior to 12/17/21, when Malfunction Indicator Lamp (\"check engine light\") started to blink continuously and engine RPMs were limited to 2000 RPM.",
        "vin": "kndjp3a55j7"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/28/2021",
        "dateOfIncident": "12/23/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445325,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Buyer beware, DO NOT PURCHASE A KIA. Kept up with oil changes on the car. Purchased used in 2019 at 45k miles.  While driving from work car just stopped working, and engine and oil light turned on. Electrical was working replaced battery maybe two months earlier. Wasn’t due for an oil change. Took car to a mechanic who said it was low on oil which seemed odd. Also replaced brake pads and rotors. $1000 later the car starts making a horrible rattling sound and the oil light and engine light turn on and car almost immediately dies.  Took car to dealership, engine is done. This is happening to ALL of Kias cars that are being put on to the market. These cars are STILL being sold and they are all very much aware that these engines are bad. An entire decade of BAD ENGINES from Kia. And they are doing nothing. NOTHING. No recalls on this car. So now I am f*****. I have had this car for TWO years and it is only THREE years old and the engine is DONE. How is nothing being done about this???? Why are our voices being ignored?? There are complaints on this page with this EXACT issue. Why aren’t these cars being recalled?? I had my boyfriend and 3 dogs in the car, what if my car had caught on fire like their other crappy cars they have put out? Would I just be another person murdered by Kia and no one does a thing about it? (Allegedly)",
        "vin": "kndjp3a51j7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/28/2021",
        "dateOfIncident": "09/25/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445253,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Engine Failure, Started burning oil, within a month of that started knocking, after 4 weeks the connecting rod went through the block.   I was driving on a public roadway.   Vehicle is in for repair now for a new short block, catalytic converter (oil damage) with the dealership and being repaired by the manufacturer under warranty.  Only warning lamp the car has had was about a month prior for an inefficient catalytic converter. No warnings for low oil or engine trouble prior to developing the knock.  Vehicle is at Celebration Kia in Delaware Ohio for repairs.  The incident date is approximate.",
        "vin": "KNDJN2A21J7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/11/2021",
        "dateOfIncident": "12/06/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443439,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The alarm won’t let me in the car. Got a jump started for a few. Cut it off now it has not started again. Changed starter that did nothing. Can’t connect to the key, dashboard keeps blinking, Alarm keeps crashing. Battery checked out good. No ideal what is wrong",
        "vin": "Kndjp3a5xj7"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/07/2021",
        "dateOfIncident": "10/16/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442972,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving to work in my 2018 Kia soul on 10/16/21 vehicle has a significant hesitation pulling away from a stop sign/red-light. A very slight knocking noise could be heard. the oil light flickered on and then immediately went off. Next thing I know while doing 65 on the highway the oil, engine, and battery lights all lit up then suddenly power to the vehicle was gone! I managed to get the vehicle off the highway onto the shoulder of the road where I watched smoke pouring out of the engine bay. My vehicle only has 69059 miles. the 2.0L motor that is subject to many other recalls and issues is the same as what is in my Soul. . I've only had this car for less than two years! KIA REFUSES TO DO ANYTHING ABOUT IT!!",
        "vin": "KNDJP3A57J7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/04/2021",
        "dateOfIncident": "11/13/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442652,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "At 94,000 miles without warning I have a rod knock. I have maintained oil changes regularly and topped my oil off before this drive. No warning lights no indicators. Just a blown engine.",
        "vin": "Kndjp3a52j7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/11/2021",
        "dateOfIncident": "11/11/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440153,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I have my oil changed regularly. At about 49,000 miles, upon braking, the oil light came on. When accelerating the oil light would go off. I checked the oil and it didn't even register. I added 2 quarts of oil to bring it to the mid line of dipstick. Took the car in, and had oil changed.  3 weeks later, at 50,000 miles, the oil is now a 1/2 quart low. Took car in to the dealer. They told me that the oil consumption of 1 quart every 1,000 miles is within normal range. This is ridiculous. I should not need to add oil to a 3 year old car between oil changes.",
        "vin": "KNDJN2A27J7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/10/2021",
        "dateOfIncident": "11/09/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439996,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I went and got my oil changed yesterday. The man at the Kia dealership showed me a water bottle that was about 8 oz full with black oil. He told me that that’s all the oil I had in my car and I probably have engine damage. There were no warning lamps or anything else. And I routinely get my oil and tires maintenance. I am now having sounds coming from my vehicle but still no warning lamps.",
        "vin": "Kndjp3a50j7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "11/04/2021",
        "dateOfIncident": "06/27/2020",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 11439319,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "During a front end accident the car burst into flames and the driver was trapped and passed away at the scene.",
        "vin": "kndjn2a20j7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/02/2021",
        "dateOfIncident": "07/31/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439020,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "On the evening of 7/31/2021 myself and my 2 brothers were on our way home from shopping. It had just got dark outside. Suddenly there was a loud noise under the hood and the vehicle stopped dead in the middle of the road. Thank GOD we were not hit from behind. I put the flashers on to warn others. Other cars were blowing there horns, it was very dangerous for us and others as well. I called and got AAA there as soon as possible. The car was smoking and oil was every where. I had the car taken to an independent shop. They told me the connecting rod had gone through the engine block and that it was very bad. They suggested that I take it to the Kia dealership. They said Kia would know about the warranty's. I had AAA take it to the Kia dealer ship in west Orlando. I paid them 265.00 to do the diagnostics on the car. They told me the connecting rod bearing had caused the rod to go thru the engine block. They said I would Have to have a new engine (approx. 10,000.00 ). I said if I gave them the money when could i get my car? They said they didn't know. I ask if I could have a loaner vehicle to get myself to work. They said they don't do that. They also said at that cost I would not get a new engine. I was not treated very nice. I never had any trouble with my car. I had no warning of any kind it just suddenly stopped. I am a widow and my husband always told me to keep my oil changed. He said it is the life of the car. So I  always changed my oil ahead of the scheduled time for it to be changed. I got my oil changed on 7/29/2021 and the bearing went bad on 7/31/2021. A friend from my church tried to contact Kia Corp. in California for assistance,but was treated rudely.I know there have been recalls on different Kia and Hundai engines for connecting rod Bearing issues.This was very dangerous many people could have been hurt or killed. Kia Will not help. I only have 71,000 miles on my car. I was the second owner of the car so my warranty is no good. 3 tech's have seen it.",
        "vin": "KNDJP3A5XJ7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/13/2021",
        "dateOfIncident": "10/12/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436700,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Engine started to knock, then it got louder and finally the engine stopped running. If it would have shut down on the busy interstate, it could have been a disaster. The problem has not been inspected by Manufacture. Trying to report to KIA. Engine has less than 84000. The oil light came on right before it died.",
        "vin": "KNDJP3A51J7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/22/2021",
        "dateOfIncident": "09/22/2021",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433980,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "So, I was driving down the road and there was like a tapping sound coming from the engine. It had been doing that tapping noise for a couple of days. All of a sudden a heard like a loud bang/pop noise and see smoke coming out of my engine area. The car stalled and I slowly let it coast to the side of the road. I looked at my rear view mirror and I see black smoke and a man running toward me yelling, \"Get out of the car! Get out of the car! It's going to explode! Get out of the car!\" Other cars were stopping and I couldn't tell what all the fuzz was about. I picked up my work lap top, parked the car, and took the keys off the ignition. Smoke was coming into the cabin and I realized this was something else. I opened the door and the man yelled again, \"Get out!, Get out!\" I did. I slowly got out of the car and made my way away from the car. I began recording because I was mad that this KIA that I had bought just over a year prior had broken down. It wasn't until I stepped further back that I see the fire coming upward and the engine was on fire as well. The KIA Soul 2018 burned completely down in less than 10 minutes. I was lucky to get out alive.",
        "vin": "KNDJP3A57J7"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/21/2021",
        "dateOfIncident": "09/20/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433904,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "On several occasions now the vehicle has sped up on its own while parked. Thank goodness I had my foot on the brake but as soon as I let go of the brake, it went fast without my peddle on the gas. I stopped it with the break peddle and it did it again once I let go of the brake peddle. It usually takes a couple of times for the car not to do that.  Also, the oil light hasn't warned me that the oil is low. The motor began rattling while I was near work and I stopped the vehicle. Someone helped me and told me that there was barely any oil in the engine. So, we added oil but now it's always rattling. It has also stalled while going up a hill. That's happened on two occasions.  I believe I may have a lemon in my hands. KIA has yet to accept that it's still under warranty and they keep brushing me off.",
        "vin": "KNDJP3A57J7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/14/2021",
        "dateOfIncident": "07/29/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432892,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "My engine failed and gasket blew  with no signs of over heated and no issues prior to failure car had no issues at all.",
        "vin": "KNDJP3A52J7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/12/2021",
        "dateOfIncident": "08/06/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428832,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The car started making a squeaky noise checked to see if it was  the  brakes or anything else, nothing everything appears fine. Hera the noise again have it checked out turns out car has no oil what do ever. I have my car serviced every 3 m as it should be even before the miles I know and have read and other articles about the oil just disappearing, my car only has 53, 000 miles on it.",
        "vin": "KNDJN2A24J7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/10/2021",
        "dateOfIncident": "07/18/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428600,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Around 65000 miles, While driving the engine just lost power and started knocking. There are a lot of forums with the same model with the same compliant and issue. even the Kia dealship says there is a problem with these engines. They are recommending a new engine I am afraid to have my family in this car.",
        "vin": "KNDJP3A59J7"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/24/2021",
        "dateOfIncident": "06/24/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422106,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving to work my engine began to knock, my oil light flickered and went out, and then I completely lost power. I took my 2018 Kia soul to a local mechanic and he confirmed that my engine was blown and would need to be replaced with only 78,388 miles on my vehicle.",
        "vin": "kndjp3a58j7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/07/2021",
        "dateOfIncident": "06/01/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419943,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I have been a 3 car Kia customer for almost 10 years.  In the last 10 months I have had more than a dozen service visits. Starting in August 2020 my engine was losing oil. After first visit, my SA Edwin agreed this is a problem, do the oil consumption test and we’ll be on our way for a repair. Test Done, with a \"sorry\" we have to do the test again but we replaced the ignition coil. (2nd Coil since I’ve owned car)  And again we test. With more \"Sorry\" it didn't burn enough oil, or you have to come in EXACTLY at 1,000 miles. (This is NOT true; math can be converted at any mileage over the 1,000.) Even when I told them it starts burning at the 2,000 mark after oil change. Over and over again, I miss work to sit in the dealership, or WALK home, as the dealership insisted on these appointments but wouldn't give me a loaner (I have full coverage insurance)  Finally in March 2021 they decide they will clean the combustion chamber. Need to leave car: they make me RENT a car saying it will be paid for with my warranty. ADDITIONAL days needed as more problems occurred while in for repair. (Oil switch). Keep the rental they told me, it’s covered. Return the rental and the dealership won’t PAY THE RENTAL. I have now missed over 30 hours of work, repeated oil change costs for the process, Rental Fees, Inspection fees that were never reimbursed. All in avoidance of a repair that was clearly needed to my engine. Go back into a new Kia on 6/1/21 for scheduled oil change, and the Tech tells me there is NO OIL ON THE DIPSTICK. AGAIN. 10 months later and I still have the same problem. THIS VEHICLE IS NOT SAFE and KIA will not address.",
        "vin": "KNDJP3A50J7"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/28/2021",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418856,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 kia soul+ with 2.0l engine has developed a rod knock at 86k miles. Kia customer service was made aware of the issue and has refused to to repair the vehicle.  According to a kid certified technician at a kia dealership, the issue is the same as other kia vehicles with a recall for, \"connecting rod excessive wear\".  Customer service was made aware of these findings and still refuses to issue recall.  Engine currently runs, but can not be run for very long or driven due to eminent risk of catastrophic engine failure.",
        "vin": "Kndjp3a58j7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/01/2021",
        "dateOfIncident": "04/03/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414714,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS 64,700 MILES ON IT. I WAS ACCELERATING TO GET ON THE HIGHWAY GOING ABOUT 50 MILES PER HOUR ALL OF THE SUDDEN I HEARD A POOF NOISE WHITE SMOKE STARTED COMING FROM THE REAR OF THE CAR AND I LOST ALL POWER",
        "vin": "KNDJP3A5XJ7"
    },
    {
        "components": "UNKNOWN OR OTHER,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "04/29/2021",
        "dateOfIncident": "04/09/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414417,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CRUISE CONTROL SOMEHOW AFFECTS THE ENGINE AND OR TRANSMISSION WHEN IN CRUISE IT SPEEDS UP WITH OUT PRESSING ON THE GAS THE MPR GOES WAY OVER 4 MPR THEN I CANCEL THE CRUISE AND RESET IT AND SAME THING HAPPENS THIS IS ON HWY",
        "vin": "KNDJP3A54J7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/03/2021",
        "dateOfIncident": "01/22/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398886,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JANUARY 22, 2021, VEHICLE FELT SLUGGISH WHEN ACCELERATING. SOON AFTER, LOUD NOISE FROM ENGINE AND ENGINE DIED. VEHICLE TOWED TO DEALERSHIP, AND WAS DIAGNOSED WITH ENGINE FAILURE AT 75K MILES. DEALER STATED SEVERAL ENGINE FAILURES IN THE YEAR MODEL CURRENTLY BEING SERVICED. USED ENGINE WITH 12 MONTH WARRANTY WAS PRICED AT $9100.",
        "vin": "KNDJP3A50J7"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/18/2021",
        "dateOfIncident": "02/18/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396789,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST BOUGHT CAR, 33,000 MILES, WAS DRIVING AND TRANSMISSION MALFUNCTIONED, INTERNAL MECHANICAL DAMAGE",
        "vin": "KNDJP3A58J7"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/18/2021",
        "dateOfIncident": "01/26/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396878,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "JANUARY 21ST 2021, WENT TO A DEALERSHIP IN MIAMI AND PURCHASED A USED KIA SOUL PLUS. JANUARY 26TH 2021, AFTER LEAVING THE POST OFFICE CAR SLOWED DOWN AND CAME TO A STOP. OIL LIGHT WAS GLITCHING PRIOR TO THAT DAY. CAR WAS IN DRIVE AND COULDN'T  SHIFT GEARS TO PARK OR NEUTRAL. HAD TO PUSH THE CAR INTO A PARKING LOT AND SIT. TOOK TO A KIA DEALERSHIP AND THEY REPLACED OIL GASKET. TOOK THE CAR HOME FEW DAYS DRIVING TO AND FROM WORK. FEBRUARY 9TH CAR BROKE DOWN AGAIN WHILE TURNING INSIDE PARKING SPOT. CAR BATTERY LIGHT AND OIL PRESSURE LIGHT WAS BOTH ON. CAR WENT BACK TO KIA DEALERSHIP THURSDAY 11TH. KIA LOOKED AT THE CAR STATING OIL SLUDGE WAS ALL INSIDE THE ENGINE AND REPAIRS WILL COST $9,000. USED CAR IS NOT UNDER WARRANTY.",
        "vin": "KNDJP3A59J7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/04/2021",
        "dateOfIncident": "12/04/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394646,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 KIA SOUL. THE CONTACT STATED THAT AFTER GETTING AN OIL CHANGE AND DRIVING AT APPROXIMATELY 40 MPH, THERE WAS AN ABNORMAL METALLIC SCRAPING SOUND COMING FROM UNDERNEATH THE VEHICLE. THE CONTACT ATTEMPTED TO PULL OVER WHEN THE CHECK OIL WARNING LIGHT ILLUMINATED. THE VEHICLE SHUT-OFF AND FAILED TO RESTART. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC AND THE CONTACT WAS INFORMED THAT THE FAILURE WAS NOT RELATED TO THE RECENT OIL CHANGE. THE CONTACT TOOK THE VEHICLE TO KIA OF BOWIE (16620 GOVERNOR BRIDGE RD, BOWIE, MD 20716, (301) 820-7500) WHO DIAGNOSED THAT THE ENGINE HAD FAILED. THE VEHICLE WAS NOT REPAIRED. THE MECHANIC REFERENCED A RECALL FOR 2014/2015 MODEL YEARS HOWEVER, THE 2018 MODEL YEAR VEHICLES WERE NOT INCLUDED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND CONFIRMED THAT THE CONTACT'S MODEL YEAR VEHICLE WAS NOT INCLUDED. THE APPROXIMATE FAILURE MILEAGE WAS 84,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/27/2021",
        "dateOfIncident": "12/10/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390399,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2018 KIA SOUL WITH 89,000 MILES ON IT AND ENGINE MADE A RATTLE NOISE IMMEDIATELY FOLLOWED BY A LOUD CLUNK NOISE OUT OF THE BLUE. DRIVING APPROXIMATELY 50 MPH AND HAD BEEN DRIVING FOR ABOUT 20 MINUTES, AFTER THE NOISE THE ENGINE IMMEDIATELY DIES. I COAST INTO THE SHOULDER OF THE ROAD AND THE ENGINE IS LIGHTLY SMOKING AT THIS POINT. I HAD THE VEHICLE TOWED TO THE KIA DEALERSHIP WHERE THEY TELL ME THE ENGINE IS BLOWN AND NEEDS TO BE REPLACED, THE SHOP MANAGER ALSO STATES THAT THE 2018 KIA SOUL SHOULD HAVE AN ENGINE RECALL IN HIS OPINION BECAUSE HE STATED THAT THE ENGINE THE 2018 SOUL USES IS THE SAME ENGINE THAT IS IN OTHER KIA VEHICLES WITH RECALLS ON THEIR ENGINE. I HAVE RELIGIOUSLY PERFORMED ALL RECOMMENDED MAINTENANCE AND OIL CHANGES AT MANUFACTURES  PRESCRIBED TIME.",
        "vin": "KNDJP3A54J7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/26/2021",
        "dateOfIncident": "01/05/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389953,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING ON A MAIN ROAD AND THE CAR JUST STOPPED. IT GAVE NO WARNINGS OR MADE NO NOTICES. IT JUST STOPPED WORKING. I HAD TO PUSH THE VEHICLE TO A SAFE AREA AND CALLED AAA TO COME AND TOW THE CAR TO MY HOME. MY HUSBAND WENT TO START IT AND SAID BATTERY WASN'T GOOD SO WE BOUGHT A NEW ONE, THEN HE STATES THE STARTER WAS BAD SO WE REPLACED IT, THEN WE FINALLY GOT IT TO START ONLY TO HEAR THE CAR MAKE A LOUD SLAPPING SOUND. THE CAR DOESN'T DRIVE AND THE ENGINE HAS FAILED. I AM THE SECOND OWNER SO THE WARRANTY JUST RAN OUT. I HAVE ONLY HAD THE CAR FOR 18 MONTHS. I HAVE TAKEN IT TO HAVE OIL CHANGES AND KEEP IT CLEAN. I HAVE TAKEN REALLY GREAT CARE FOR THE CAR AND I CAN'T UNDERSTAND WHY IT NEEDS A NEW ENGINE, WHEN IT'S A 2018 KIA. ENGINES SHOULD LAST A LONG TIME.",
        "vin": "KNDJP3A58J7"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/19/2021",
        "dateOfIncident": "01/19/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388931,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CHECK ENGINE LIGHT COMES ON WITH ENGINE CONTROL SYSTEMS AS THE CAUSE OF THE ISSUE I HAVE HAD IT TO THE DEALER 5 TIMES NOW. STILL ON FOR THE 6TH TIME NOW!!!! I WAS TOLD THAT THE RECALL WOULD FIX THIS AND IT HAS NOT",
        "vin": "KNDJX3AA8J7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/15/2021",
        "dateOfIncident": "11/11/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388259,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2 INSTANCES HAVE OCCURRED. 1. IN REVERSE, THE CAR MOVED FORWARD AND NEARLY HIT A WALL. 2. IN REVERSE, THE CAR MOVED FORWARD AND NEARLY HIT ANOTHER CAR. THEN PUT IN NEUTRAL TO PUSH BACK. BUT CAR MOVED FORWARD IN NEUTRAL AS WELL. LET THE CAR SIT FOR A HALF HOUR. AND IT SHIFTED INTO REVERSE CORRECTLY AGAIN.",
        "vin": "KNDJN2A24J7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/12/2021",
        "dateOfIncident": "12/07/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387668,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY KIA 2018 SOUL TO MY JOB GOING AROUND 55 AN HOUR AND I HEARD A LOUD CLINK IN THE ENGINE, THE VEHICLE JUST GOT FIXED FROM HITTING A DEER AND PASTED INSPECTION. EVERYTHING DONE ON IT WAS COMETIC AND WAS NOT DUE FOR AN OIL CHANGE FOR ANOTHER 1,500 MILES. IT COMPLETELY BROKE DOWN WAS TOWED BACK TO WHO REPAIRED IT AND THE ENGINE IS COMPLETELY DESTROYED AND WILL NEED TO BE REPLACE. I ONLY HAD IT A YEAR AND IT ONLY HAS 73,000 MILES ON IT. I AM NOW OUT A VEHICLE AS I CANNOT AFFORD A NEW ENGINE AND ALWAYS GOT AN OIL CHANGE BEFORE THE RECOMMEND TIME AND MILEAGE. THIS IS NOT AN ISSUE A VECHILE SHOULD HAVE IN THE CONDITION IT IS IN!!!!",
        "vin": "KNDJP3A51J7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/05/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386695,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY FOR ABOUT 5 MINS AND MY KIA SOUL MADE A RATTLING NOISE THAN 200 FT LATER MY CAR WAS ON THE SIDE OF THE ROAD AND THE ENGINE IS GONE ACCORDING TO KIA DEALERSHIP AND GAVE NO WARNING &#9888;&#65039; LIGHTS ON THE DASH AND ENGINE JUST CUT OFF",
        "vin": "KNDJP3A58J7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/05/2021",
        "dateOfIncident": "01/02/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386699,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 KIA SOUL. THE CONTACT STATED THAT WHILE HER SON WAS DRIVING 60 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS NOT DRIVABLE. THE VEHICLE WAS TOWED TO HER SON'S APARTMENT. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER KIA OF SOUTH AUSTIN (5306 S IH 35 FRONTAGE RD, AUSTIN, TX 78745, (512) 444-6635) TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE ENGINE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER HAD BEEN INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 68,000.",
        "vin": "KNDJP3A58J7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/03/2020",
        "dateOfIncident": "11/30/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377741,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MILEAGE 68000 - TICKING NOISE BEGAN APPROXIMATELY 5 DAYS BEFORE THE ENGINE FAILURE. THE VEHICLE WAS THEN PARKED FOR TWO DAYS (FOR THE HOLIDAY). TWO DAYS LATER, WHILE DRIVING THE VEHICLE, THE CHECK ENGINE LIGHT CAME ON. TOOK TO MECHANIC AND RAN CODE AND PERFORMED AN OIL CHANGE. NOISE CHANGED IMMEDIATELY TO KNOCKING AND SQUEAKING AND CAR DIED WHILE DRIVING HOME. TOWED VEHICLE TO DEALERSHIP AND WAS INFORMED THAT THE RODS EITHER BROKE, BLEW, OR WERE GOING TO, AND A NEW MOTOR WAS NECESSARY. MY VEHICLE HAS THE 2.0L MOTOR THAT IS SUBJECT TO MANY OTHER RECALLS AND ISSUES BUT YET NOT ON THE RADAR OF THE AUTHORITIES. I'VE ONLY HAD THIS CAR FOR LESS THAN 10 MONTHS AND APPROXIMATELY 20,000 HIGHWAY MILES, AND JUST OUTSIDE THE WARRANTY PERIOD.",
        "vin": "KNDJP3A58J7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/30/2020",
        "dateOfIncident": "11/20/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377230,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 KIA SOUL #3 PISTON AND CONNECTING ROD SHATTERED WITHIN 1.5 BLOCKS OF INITIAL KNOCKING DETECTION WHEN TRYING TO PULL INTO A PARKING LOT OFF OF THE STREET..  THE MOTOR SEIZED AND CAUSED THE VEHICLE TO STOP AND ALMOST BEING REAR ENDED BY OTHER DRIVERS.",
        "vin": "KNDJP3A51J7"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/05/2020",
        "dateOfIncident": "09/08/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362737,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 KIA SOUL. THE CONTACT STATED THAT STEAM CAME OUT THE VENTS INSIDE THE VEHICLE CABIN OF THE VEHICLE AND FOGGED UP THE WINDOWS. THE CONTACT ALSO HEARD AN ABNORMAL GURGLING SOUND COMING FROM BEHIND THE DASHBOARD AFTER THE DEFROSTER/DEFOGGER WAS ACTIVATED. THE VEHICLE WAS TAKEN TO VISION KIA OF EAST ROCHESTER (201 E LINDEN AVE, EAST ROCHESTER, NY 14445, (585) 249-9000) WHERE THE AIR CONDITION DRAIN TUBES WERE CLEARED. THE VEHICLE OPERATED AS INTENDED FOR A WHILE HOWEVER, THE FAILURE RECURRED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 3,638.",
        "vin": "KNDJN2A26J7"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/03/2020",
        "dateOfIncident": "10/01/2020",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362515,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2018 KIA SOUL ON MADISON HWY IN  VALDOSTA,GA.L SAW SMOKE COMING OUT MY HOOD SO I WAS ABLE TO PULL INTO A CONVENIENT STORE ! THE PEOPLE IN THE STORE CAME RUNNING OUT WITH FIRE EXTINGUISHERS AND WE WERE ABLE TO PUT OUT THE FIRE.",
        "vin": "KNDJP3A5XJ7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/28/2020",
        "dateOfIncident": "08/20/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361636,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE TO WORK, VEHICLE CAME TO A COMPLETE STOP AND WOULD NOT TURN ON. AT FIRST THOUGHT IT WAS THE BATTERY BUT THE TOW TRUCK CHARGED THE BATTERY AND WHEN STARTED THE RODS WERE KNOCKING. WE TOWED TO THE DEALERSHIP, REGAL KIA AND THEY DIAGNOSED MY CAR FOR NEEDING A WHOLE NEW ENGINE. IF WE WERE TO DRIVE THE VEHICLE ANY FURTHER THE ENGINE WOULD BLOW. OIL CHANGE WAS JUST A MONTH BEFORE AT THE REGAL KIA DEALERSHIP SO IT WASN'T DUE TO LOW OIL. THE 2018 KIA SOUL HAD 61,000 MILES AT IT AND ENGINE WAS RUINED.",
        "vin": "KNDJP3A54J7"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/12/2020",
        "dateOfIncident": "09/12/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354572,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR CONSISTENTLY WON'T START AS IF THE BATTERY IS DEAD. WILL START ONCE BATTERY IS JUMPED. BATTERY, STARTER, AND ALTERNATOR TESTS COME BACK FINE.",
        "vin": "KNDJP3A59J7"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/11/2020",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354380,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT TOLD BY A KIA MECANIC WELL AT LEAST SEEN IT ON MY DASH CAM THAT I AM SOL THAT MY TICKING PROBLEM IS AN ENGINE DEFECT ON KIA'S PART THAT IS CAUSING ENGINE ISSUES AS WELL AS SOMEHOW MAKING MY ENGINEREV EXTREMELY HIGH WHILE STARTING UP AND SOMETIMES THROUGHOUT THE DAY TO THE POINT IF I DON'T HAVE MY BRAKES ON I WILL GO THROUGH A WALL . THAT'S A MENTION SOMETHING IS WRONG WITH THE AIR CONDITION UNIT/HEATER THAT THE HEATER WILL BLOW EXTREMELY HOT SO HOT THAT THE VENTS BECOME PLIABLE AND THE AIR CONDITIONER AND WON'T COME ON UNLESS I START MESSING WITH BUTTONS OFF AND ON OFTEN ON HIGH AND LOW HIGH AND LOW.I HAVE BEEN IN TO KIA MOTORS FIVE TIMES FOR THE ISSUE",
        "vin": "KNDJP3A5XJ7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/27/2020",
        "dateOfIncident": "08/17/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351542,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 KIA SOUL. THE CONTACT STATED THAT WHILE DRIVING AT 30 MPH, AN ABNORMAL NOISE WAS PRESENT WITHOUT WARNING. THE VEHICLE WAS TAKEN TO THE DEALER (KIA OF MUNCIE 6732 W HOMETOWN BLVD, MUNCIE, IN 47304) WHERE IT WAS DIAGNOSED AND DETERMINED THAT THAT THE ENGINE ROID FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 60,000.",
        "vin": "KNDJP3A59J7"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "08/24/2020",
        "dateOfIncident": "07/11/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11350865,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INVOLVED IN A CAR ACCIDENT ON JULY 11 2020. THE OTHER DRIVER RAN A RED LIGHT AND I T-BONED HIM. MY CAR SUBSTANTIAL AMOUNT OF DAMAGE TO THE FRONT END AND WAS DEEMED TOTALED BY THE INSURANCE COMPANY. IN THIS ACCIDENT NONE OF MY AIRBAGS DEPLOYED.",
        "vin": "KNDJP3A57J7"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/24/2020",
        "dateOfIncident": "08/22/2020",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350993,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 2AM ON SATURDAY AUGUST 22ND MY HUSBAND'S 2018 KIA SOUL, WHICH WAS STATIONARY IN OUR DRIVEWAY AND NOT IN OPERATION AT THE TIME, WAS SET ABLAZE FOR UNKNOWN REASONS. WE WERE ASLEEP AND WERE WOKEN UP BY THE SOUND OF, WHAT WAS POSSIBLY, THE TIRES EXPLODING, THE CAR WAS COMPLETELY ON FIRE BY THE TIME WE WERE ABLE TO WAKE UP AND EVACUATE THE PROPERTY. WE HAVE A DOORBELL CAMERA THAT WOULD HAVE PICKED UP A PERSON IN OUR DRIVEWAY SO WE DO NOT BELIEVE THE CAUSE WAS ARSON. ONLINE RESEARCH AFTER THE INCIDENT INDICATES THAT THIS COULD BE RELATED THE THE RECENT RECALLS OF KIAS AND HYUNDAIS, WHICH OUR MODEL WAS NOT INCLUDED AS FAR AS WE KNOW.",
        "vin": "KNDJX3AA3J7"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/07/2020",
        "dateOfIncident": "08/04/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343985,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2018 KIA SOUL+ AND RECENTLY THERE IS A BURNING SMELL COMING FROM THE CAR ESPECIALLY WHEN THE A/C IS ON. I TOOK MY CAR TO THE DEALER REGARDING THE PROBLEM, BUT WAS TOLD THAT THEY DID NOT SEE ANYTHING WRONG OR SMELL ANYTHING BURNING ON THE CAR. THE PROBLEM HAPPENS MOSTLY WHILE DRIVING ON THE HIGHWAY. I'M AFRAID THAT THE CAR IS GOING TO CATCH ON FIRE. THE CAR ALSO LOSES POWER WHILE DRIVING EX. I CAN BE DRIVING 60 MILES AND ALL OF A SUDDEN THE CAR STARTS TO DECREASE IN SPEED AND YOU HAVE TO RAVE UP THE CAR TO GET IT GOING AGAIN. NOT GOOD AT ALL.",
        "vin": "KNDJP3A57J7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/09/2020",
        "dateOfIncident": "06/08/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338396,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 7/8/20, MY CAR MADE A VERY LOUD NOISE AND SHUT OFF ON ME. NO SENSORS, NO LIGHTS CAME ON. I HAD IT TOWED TO THE KIA IN WHICH I PURCHASED IT FROM, AND THEY TOLD ME MY ENGINE BLEW. MY WARRANTY WAS SUPPOSE TO COVER THE REPAIRS BUT THEY ARE REFUSING TO COVER THE REPAIR.",
        "vin": "KNDJN2A27J7"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/14/2020",
        "dateOfIncident": "06/10/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328760,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD IS BECOMING STICKY AND GLOSSY CAUSING A GLARE ON THE WINDSHIELD",
        "vin": "KNDJX3AA3J7"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/14/2020",
        "dateOfIncident": "08/13/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299322,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 KIA SOUL. THE CONTACT STATED THAT WHILE STOPPED AT A TRAFFIC LIGHT, THE ACCELERATOR PEDAL WAS DEPRESSED HOWEVER, THE VEHICLE HESITATED. THE CONTACT STATED THAT NO WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO TOWBIN KIA LOCATED AT 260 N GIBSON RD, HENDERSON, NV 89014, 702) 567-8000, 4 TIMES TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE TRANSMISSION NEEDED TO BE REPLACED. THE CONTACT STATED THAT THE TRANSMISSION WAS REPLACED TWICE. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS 36,269.",
        "vin": "KNDJX3AA6J7"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/04/2020",
        "dateOfIncident": "01/03/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297073,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CHECK ENGINE LIGHT CAME ON AND EVERY TIME I TOOK IT IN FOR SERVICE I WAS TOLD I USED BAD GAS AND TO CHANGE THE GAS. I WAS EVEN TOLD THE COMPUTER ON MY CAR NEEDED TO BE UPDATED AND UNTIL THEN THE CHECK ENGINE LIGHT WOULD COME ON AND MAY NOT GO OUT. MY CAR STOPPED IN THE MIDDLE OF THE STREET AND WOULDN'T MOVE.",
        "vin": "KNDJN2A24J7"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/17/2019",
        "dateOfIncident": "06/20/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289735,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 KIA SOUL. WHILE THE ACCELERATOR PEDAL WAS DEPRESSED, THE VEHICLE JERKED, LOST POWER, AND THE POWER ASSIST WARNING INDICATOR ILLUMINATED. WHEN THE CONTACT TURNED OFF AND RESTARTED THE VEHICLE, IT RESUMED NORMAL OPERATION. THE VEHICLE WAS TAKEN TO WESELOH KIA CARLSBAD (5331 PASEO DEL NORTE, CARLSBAD, CA 92008, (760) 208-2237) TO BE DIAGNOSED, BUT THE CAUSE OF THE FAILURE COULD NOT BE DETERMINED. THE VEHICLE WAS NOT REPAIRED AND THE FAILURE RECURRED MULTIPLE TIMES. THE CONTACT REFERENCED NHTSA ID NUMBER: 10162049. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT THAT THE VIN WAS NOT INCLUDED IN A RECALL. THE MANUFACTURER PROVIDED CASE NUMBER: (XXX), BUT NO FURTHER ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS APPROXIMATELY 100.  *LN*JB *LN    CONSUMER STATED CLUTCH SYSTEM WAS SLIPPING AND WAS REPLACED.  DEALERSHIP WOULD NOT REPLACE THE TRANSMISSION.*JB     *LN    MANUFACTURER CASE NUMBER (XXX)    ('PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).' *JB  *LN*JB",
        "vin": "KNDJX3AA2J7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/04/2019",
        "dateOfIncident": "12/03/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286788,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AROUND 11:40PM ON 12/3/2019 I PARKED MY CAR IN AN EMPTY PARKING LOT - CAR WAS STATIONARY. IT WAS 51 DEGREES OUT AND CLOUDY, BUT NO RAIN OR ANY PRECIPITATION. THE CAR WAS NOT RUNNING; THE HEAT/AC WERE NOT ON. NO ONE WAS AROUND. SUDDENLY, THE WINDSHIELD IN THE BACK (LARGE HATCH DOOR WINDOW) SHATTERED ENTIRELY. IT SOUNDED LIKE A SHOT. NOTHING FELL ON THE CAR, NO PEOPLE OR ANIMALS WERE AROUND. THE WHOLE WINDOW WAS SHATTERED AND CRUMBLING ALONG THE EDGES. NO ROCKS, BBS, PELLETS, BRANCHES, BALLS, OR OTHER OBJECTS ANYWHERE. NO OTHER DAMAGE MADE AT THAT MOMENT TO THE CAR AT ALL. THE PANE STAYED TOGETHER UNTIL I OPENED/CLOSED MY DRIVER SIDE DOOR. THEN IT STARTED TO FALL APART. NO EVIDENCE OF FOUL PLAY. ONLY 12,600 MILES ON THE CAR. CHECKED WITH THE POLICE, BUT NO SIMILAR  INCIDENTS HAD BEEN REPORTED. OCCURRED IN KIRKLAND, WA. NO PREVIOUS ACCIDENTS AS FAR AS I KNOW. EXCEPT A FEW WEEKS PRIOR, ON THE HIGHWAY DURING RUSH HOUR, A LON CRACK APPEARED ON THE DRIVERS SIDE OF THE FRONT WINDSHIELD, STARTING FROM THE TOP EDGE ABOUT 9\" LONG. NO EVIDENCE OF ROCK, DEBRIS, OR IMPACT.",
        "vin": "KNDJN2A25J7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/20/2019",
        "dateOfIncident": "11/20/2019",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281431,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CITY STREET. WAS TEST DRIVING THIS VEHICLE WHEN IT CAUGHT FIRE AT THE LOWER BACK END OF THE ENGINE.",
        "vin": "KNDJN2A2XJ7"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "10/30/2019",
        "dateOfIncident": "10/29/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277080,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MY WIFE WAS STOPPED IN A SCHOOL PARKING LOT WITH MY FOOT ON THE BRAKE PREPARING TO BACK INTO A PARKING SPACE THE CAR SUDDENLY ACCELERATED. I RAN INTO A PARKED CAR AND THE ONLY  WAY I COULD GET IT TO STOP WAS TO TURN THE CAR OFF. ME, OUR DAUGHTER AND SON ALL HAVE HAD A SURGING ISSUE BUT WAS ALWAYS A MINOR ISSUE. THIS IS A VERY DANGEROUS ISSUE AND KIA NEEDS TO ADDRESS THE ISSUE.",
        "vin": "KNDJP3A51J7"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/25/2019",
        "dateOfIncident": "10/17/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11271100,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I RENTED THIS '18 KIA SOUL FROM HERTZ. ON 10/17 AT 9 PM I WAS INVOLVED IN A SOLO VERY HARD FRONT END COLLISION WITH A LARGE BOULDER ON A CALIFORNIA MOUNTAIN HWY. THE FRONT AIR BAGS DID NOT DEPLOY. THE SIDE ONES DID FOR NO APPARENT REASON. BECAUSE I WASN'T WEARING A SEAT BELT I ENDED UP HAVING SERIOUS HEAD TRAUMA AS WELL AS OTHER BRUISES. AT THIS TIME THE VEHICLE IS IN THE POSSESSION OF HERTZ RENT-A-CAR.",
        "vin": "KNDJP3A59J7"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/17/2019",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269238,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 KIA SOUL. WHILE THE BRAKE PEDAL WAS DEPRESSED, THE DRIVER'S SIDE BRAKE LIGHT FAILED TO ILLUMINATE. THE CONTACT MENTIONED THAT THE BULBS WERE REPLACED THREE TIMES WITHIN THE SAME MONTH. GREENWAY KIA OF HICKORY HOLLOW (5406 TARGET DR, ANTIOCH, TN 37013 (615) 731-0099) WAS CONTACTED AND INFORMED THE CONTACT THAT THE VEHICLE WOULD NOT BE COVERED DUE TO THE MILEAGE. THE VEHICLE WAS NOT TAKEN TO A DEALER OR INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING OR REPAIRS. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND REFERRED THE CONTACT BACK TO THE DEALER. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 55,000.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/02/2019",
        "dateOfIncident": "03/15/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265696,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 KIA SOUL. WHILE DRIVING APPROXIMATELY 35 MPH AND MAKING A TURN, THE VEHICLE STALLED AND THE STEERING LOST POWER. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE FAILURE RECURRED SEVERAL TIMES. THE VEHICLE WAS TAKEN TO JIM CLICK KIA (866-376-4307, LOCATED AT 775 W WETMORE RD, TUCSON, AZ 85705), BUT THE TECHNICIAN WAS UNABLE TO DUPLICATE THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND REFERRED THE CONTACT TO THE CONSUMER SUPPORT ACCELERATION TEAM. THE CONTACT CALLED KIA MOTORS AMERICA AT 949-468-4800 (LOCATED AT 111 PETERS CANYON RD, IRVINE, CA 92606) AND WAS PROVIDED CASE NUMBER: 13283232. THE DEALER STATED THAT THEY COULD NOT ASSIST. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 11,000.",
        "vin": "KNDJN2A20J7"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/30/2019",
        "dateOfIncident": "09/28/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265252,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "1ST OCCURRENCE - DRIVER ENTERED VEHICLE AND DROVE THE VEHICLE FORWARD DOWN A GRADED DRIVEWAY.  AS VEHICLE CAME TO THE ROADWAY, DRIVER APPLIED BRAKES.  BRAKES WERE PRESSED TO FLOOR WITH NO RESPONSE FROM THE BRAKE.  AFTER THE VEHICLE ROLLED TO A STOP IN THE ROADWAY, DRIVER PUT THE VEHICLE TRANSMISSION INTO REVERSE, AND PRESSED ON GAS - VEHICLE MOVED FORWARD - NOT BACKWARDS AS EXPECTED.  DRIVER THEN TURNED VEHICLE OFF, AND RE-STARTED VEHICLE.  VEHICLE THEN PERFORMED NORMALLY AFTER.   SEPTEMBER 15TH, 2019  2ND OCCURRENCE - AFTER DRIVING FOR APPROXIMATELY 3 MINUTES, DRIVER CAME TO A STOP SIGN, CLEARED INTERSECTION, AND ATTEMPTED TO ACCELERATE BY PRESSING ON THE ACCELERATOR...NO RESPONSE...NO CHANGE IN IDLE OF ENGINE.  VEHICLE WAS TURNED OFF, IN THE ROADWAY, AND TURNED BACK ON.  THE CAR THEN DROVE NORMALLY. SEPTEMBER 28, 2019    2 SEPARATE DRIVERS, BOTH OF WHICH ARE FREQUENT DRIVERS OF THE VEHICLE, REPORTED THE ABOVE ISSUES.  VEHICLE IS CURRENTLY AT DEALER FOR ANALYSIS.  THEY HAVE CALLED AND STATED THEY CAN FIND NO ISSUES - THEY WILL CONTINUE TO TEST IT.  TRANSMISSION (ACCELERATION/CHANGING DIRECTION) AND BRAKING ARE TWO SIGNIFICANT CONCERNS.",
        "vin": "KNDJN2A28J7"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/25/2019",
        "dateOfIncident": "09/25/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257976,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 KIA SOUL. THE CONTACT STATED THAT THE VEHICLE INTERMITTENTLY HESITATED AFTER A STOP. THE CONTACT ALSO STATED THAT, OCCASIONALLY, THE ACCELERATOR PEDAL TRAVELED ALL THE WAY TO THE FLOORBOARD AND THE VEHICLE DID NOT ACCELERATE. THERE WAS NO WARNING INDICATOR ILLUMINATED. WHEN THE CONTACT RELEASED THE ACCELERATOR PEDAL, THE VEHICLE ACCELERATED. THE FAILURE RECURRED SEVERAL TIMES. THE VEHICLE WAS TAKEN TO BILL BRYAN KIA (352-431-2354, LOCATED AT 9039 US-441, LEESBURG, FL 34788) WHERE THE TECHNICIAN TEST DROVE THE VEHICLE AND FOUND NO FAILURES. THE DEALER STATED THAT THE VEHICLE PERFORMED AS DESIGNED. THE TECHNICIAN CLEANED THE TURBO, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THE DEALER TEST DROVE THE VEHICLE AND FOUND NO FAILURES. THE FAILURE RECURRED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 16,000.",
        "vin": "KNDJX3AA9J7"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/17/2019",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256156,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 KIA SOUL. WHILE DRIVING 60-70 MPH IN THE RAIN, THE ADAPTIVE CRUISE BLOCKED AND EMERGENCY BRAKE BLOCKED MESSAGES DISPLAYED WITHOUT WARNING. THE CONTACT CALLED RON TONKIN KIA (19335 SE MCLOUGHLIN BLVD, GLADSTONE, OR 97027, (503) 258-5808), BUT THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 3,000. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/02/2019",
        "dateOfIncident": "06/30/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229007,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2018 SOUL HAS AN AUTOMATIC TRANSMISSION AND FROM EARLY ON AFTER I BOUGHT IT \"NEW\"  LAST YEAR \"08/30/2018\" THE TRANSMISSION STARTED ACTING UP FOR NO APPARENT REASON. WHAT IT DOES COMES OUT OF NOWHERE IT WILL NOT SPEED UP WHEN YOU GIVE IT THE GAS. IT HESITATES FOR JUST A BRIEF SECOND THEN IT MOVES SLOWER THAN NORMAL. THIS HAPPENS FROM A DEAD STOP AND WHILE DRIVING IN TRAFFIC TOO. IT WILL GO ALONG DRIVING PERFECTLY FOR A WHILE THEN WITHOUT ANY REASON IT WILL ACT SLUGGISH AND OR STUMBLES. IT CAN HAPPEN WHEN IT IS COLD OR WELL WARMED UP AND IN ALL TRAFFIC CONDITIONS. THE END RESULT IS IT MAKES THE CAR DANGEROUS TO DRIVE BECAUSE THE PERSON DRIVING DOES NOT EXPECT IT TO FALTER AT VERY INORDINATE TIMES. ONE TENDS TO FORGET ABOUT THE PROBLEM AND THEN BOOM YOUR HEART SKIPS A BEAT BECAUSE YOU JUST DROVE YOURSELF INTO A POTENTIALLY DANGEROUS TRAFFIC SITUATION. MY CAR NOW HAS 5,600 MILES AND THE DEALER IS JUST GIVING ME THE RUNAROUND REGARDING THE PROBLEM. I HAVE CHECKED ON THE INTERNET \"KIA FORUMS\" AND I AM FAR FROM THE ONLY OWNER TO HAVE THIS DANGEROUS PROBLEM. IT IS LIKE HAVING UNRELIABLE BRAKES. THE DRIVABILITY IS UNPREDICTABLE!",
        "vin": "KNDJP3A56J7"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/11/2019",
        "dateOfIncident": "06/10/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219298,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN YOU TURN OFF THE CAR THE KEY WON'T COME OUT IF IT'S RAINING YOU GET WET AND SOMETIMES THE CAR WON'T START AND THE REMOTE DON'T WORK. YOU SMELL GAS WHILE YOU DRIVING.",
        "vin": "KNDJN2A21J7"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/06/2019",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218382,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE SEPARATION DRIVERS SIDE REAR.  JUNE1ST. VEHICLE GOING APPROXIMATELY 70MPH ON FREEWAY  TEMPERATURE WAS 90 F AND ABOUT 60% HUMIDITY  CAR HAD NO SPARE PROVIDED WITH CAR.  NO ACCIDENT INVOLVED.",
        "vin": "KNDJP3A58J7"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/29/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210516,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO INCIDENCES OF DECELERATION..ONE CAUSED ME TO EXIT FREEWAY ONTO THE FRONTAGE ROAD..  ONE INSPECTION AT DEALERSHIP AFTER 2ND INCIDENT STATED \"NOTHING FOUND\"...HAD I BEEN SURROUNDED BY VEHICLES FRONT AND REAR, I AND OTHERS COULD HAVE BEEN INVOLVED IN A SERIOUS ACCIDENT...I WAS ABLE TO GET OFF THE FRONTAGE ROAD ONTO A SHOULDER.   THE 2ND INCIDENT WAS NEAR MY RESIDENCE AND FORTUNATELY THERE WAS NO ONE ON THE STREET AT TIME....WHILE THE DEALER TECHNICIANS MAY NOT HAVE THESE EVENTS OCCUR AT THE TIME OF SERVICE, THESE INCIDENCES I BELIEVE ARE SPONTANEOUS AND THEREFORE DANGEROUS TO THE DRIVER AND PASSENGERS OF MY AND OTHER VEHICLES.    THESE INCIDENCES KEEP ME IN FEAR OF DRIVING THIS VEHICLE.  I HAVE ASKED THE LOCAL DEALER FOR A TRADE TO ANOTHER BRAND BUT ONLY RESPONSE SOMETIME APRIL 2019... WE WILL WORK ON IT. I STARTED BY EMAILING SALESMEN AND MANAGERS OF DEALERSHIP AND FINALLY CALLED WHICH FINALLY PRODUCED A RESPONSE TO ATTEMPT TO FIND A DIFFERENT BRAND VEHICLE...THIS IS A NEW LOAN OF MARCH 2018.,THIS VEHICLE SUPPOSEDLY WAS BUILT IN SEPT. 2017.....FIRE HAZARD IS MENTIONED WITH ONE DEATH OF WOMAN IN TEXAS DUE TO ONE OF THESE TWO CAUSES.MY VEHICLE IS NOT SAFE AND I DO NOT WANT ANOTHER KIA SOUL.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/13/2019",
        "dateOfIncident": "05/11/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207230,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST INCIDENT TOOK PLACE ON A CITY STREET, THANKSGIVING NIGHT 2018.  MADE LEFT TURN AT LIGHT, LOST CONTROL OF STEERING WHEEL, RAN UP ONTO SIDEWALK AND BACK INTO THE STREET.  SECOND INCIDENT OCCURRED THE NIGHT BEFORE MOTHER'S DAY 2019, MADE RIGHT TURN AT LIGHT AND LOST CONTROL OF STEERING AGAIN",
        "vin": "KNDJN2A20J7"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/01/2019",
        "dateOfIncident": "03/18/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11204925,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING WHEEL IS MANUFACTURED OF MATERIAL WHICH CONTAINS A TOXIC SUBSTANCE WHICH HAS CAUSED THE OWNER TO SUFFER A MEDICAL CONDITION OF SEVERE CONTACT DERMATITS. THE CAR CAN'T BE DRIVEN WITHOUT THE USE OF A COVER OVER THE STEERING WHEEL, WHICH WILL CAUSE THE CAR TO FAIL THE MARYLAND STATE SAFETY INSPECTION.",
        "vin": "KNDJP3A57J7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "04/29/2019",
        "dateOfIncident": "04/27/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204331,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS SITTING AT A JACKS DRIVE THROUGH WHEN MY CAR ACCELERATED ON ITS ON. MY CAR WAS STOPPED WITH MY FOOT ON THE BRAKE.  I COULD NOT STOP THE VEHICLE. IT PLOWED INTO THE REAR OF THE VEHICLE IN FRONT OF ME. THERE WAS NO DAMAGE TO THE VEHICLE IN FRONT OF ME BUT THE REESE HITCH ON HIS TRUCK WENT THROUGH MY BUMPER. THERE WAS NO INJURY.",
        "vin": "KNDJN2A23J7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/03/2019",
        "dateOfIncident": "06/22/2018",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193681,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 22 2018 I WAS TOWING MY KIA BEHIND MY RV ON I-10 NEAR MONTICELLO FL. IT BECAME ENGULFED IN FLAMES. IT WAS TOTALLY DESTROYED .THE FHP ARRIVED  SHORTLY THEREAFTER AS DID THE LOCATION FIRE DEPARTMENT. UNFORTUNATELY NO ONE WAS HURT  HOWEVER  RV SUSTAINED $20K  DAMAGE. THERE A FHP REPORT ON FILE (FHP01LRO23143).    I REPORTED THIS TO KIA IN LAKE CITY, FL.THERE RESPONSE WAS YES THERE HAD BEEN REPORTS  BUT  NUMBER WAS WASN'T TOO BAD. CALLED THEM SEVERAL TIMES BUT ACTION.   I HAVE PHOTOS AND THE FHP  REPORT IF  NEEDED.   NO FUTURE SAFETY RECALL INFORMATION IS REQUIRED, VEHICLE.IA IN THE BONEYARD.",
        "vin": "KNDJN2A21J7"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": true,
        "dateComplaintFiled": "03/19/2019",
        "dateOfIncident": "01/13/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11190055,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2018 KIA SOUL. WHILE THE VEHICLE WAS IDLING AT A STOP LIGHT, THE CONTACT'S VEHICLE WAS REAR ENDED BY ANOTHER VEHICLE TRAVELING 45 MPH. THE AIR BAGS DID NOT DEPLOY AND THE DRIVER'S SEAT SNAPPED IN HALF. A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED NERVE DAMAGE TO THE BACK THAT REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS DESTROYED AND TOWED. THE DEALER AND MANUFACTURER WERE NOT CONTACTED. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE APPROXIMATE FAILURE MILEAGE WAS 25,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/12/2019",
        "dateOfIncident": "02/08/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11176640,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT INTO AN ACCIDENT ON A CROSS STREET INTERSECTION AT A STOP SIGN I LOOKED BOTH WAYS NO VEHICLE ON SITE UNTIL I STARTED TO CROSS OVER WHEN A DRIVER SPEAD DOWN THE ROAD AND HIT ME THE WHOLE FRONT END OF THE SOUL IS GONE THE CAR IS A TOTAL LOSS.  NOT ONE AIRBAG DEPLOYED (NOT EVEN ONE DEPLOYED).  I SUSTAINED CHEST INJURY AND BREAST INJURY I WAS RUSHED TO THE HOSPITAL AND CHECKED FOR CHEST PAINS XRAYS REVEALED INTERNAL BRUISES.  MY CHEST BREAST AND PART OF MY STOMACH ARE BLACK AND BLUE",
        "vin": "KNDJP3A51J7"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "01/29/2019",
        "dateOfIncident": "01/25/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11172782,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 KIA SOUL. WHILE DRIVING APPROXIMATELY 25 MPH, THE VEHICLE FAILED TO ACCELERATE. THE CONTACT STOPPED THE VEHICLE TO MAKE SURE THAT IT WAS IN GEAR. WHILE THE CONTACT ATTEMPTED TO PARK IN FRONT OF HER HOUSE, WITH THE BRAKE PEDAL DEPRESSED, THE VEHICLE SPONTANEOUSLY ACCELERATED AND CRASHED INTO THE FRONT OF THE HOUSE. THE FRONT DRIVER'S AIR BAG DEPLOYED. THE DRIVER SUSTAINED A BROKEN NOSE THAT REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS TOWED BY THE INSURANCE COMPANY TO A LOT. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 5,000.",
        "vin": "KNDJN2A26J7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/09/2018",
        "dateOfIncident": "10/15/2018",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150429,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WAS PARKED IN A PUBLIC PARKING LOT, WITH NO ONE AROUND IT, WHEN THE ENGINE CAUGHT FIRE AND DESTROYED THE ENGINE COMPARTMENT. FIRE INSPECTOR STATED CAUSE OF THE FIRE COULD NOT BE DETERMINED.",
        "vin": "KNDJN2A21J7"
    },
    {
        "components": "EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/31/2018",
        "dateOfIncident": "10/30/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144286,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "USUALLY AFTER A RAINY NIGHT OR WHEN THERE IS DEW IN THE MORNING, WITH THE VEHICLE IN PARK AND STATIONARY AT MY HOME, THE HEAD LIGHTS WILL NOT TURN ON AND THE WINDSHIELD/BACK GLASS WIPERS WILL NOT WORK. AFTER TURNING THE WIPERS ON AND OFF SEVERAL TIMES THEY MAY COME ON FOR A MOMENT AND THEN WILL NOT OPERATE AGAIN. DEALER HAS BEEN UNABLE TO DUPLICATE ISSUE TWICE SO FAR. HAS LESS THAN 6000 MILES ON IT.  IT IS NOW DARK WHEN I AM LEAVING FOR WORK AND THIS IS A HUGE SAFETY ISSUE SINCE I CAN NOT DRIVE IT WITH OUT HEAD LIGHTS. IT IS ALSO ILLEGAL TO DRIVE WITHOUT HEADLIGHTS/WIPERS IN THE RAIN WHERE I LIVE.",
        "vin": "KNDJN2A2XJ7"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/09/2018",
        "dateOfIncident": "10/08/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139248,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 KIA SOUL. WHILE THE CONTACT'S WIFE WAS DRIVING 60 MPH WITH THE HEATER ACTIVATED, STEAM APPEARED FROM THE HEATER VENTS AND FOGGED UP ALL THE WINDOWS. THE VEHICLE WAS NOT TAKEN TO A DEALER FOR DIAGNOSTIC TESTING OR REPAIRS. THE MANUFACTURER WAS NOTIFIED AND STATED THAT SOMETHING MUST HAVE ENTERED INTO THE DRAIN LINE. THE MANUFACTURER RECOMMENDED THAT THE CONTACT VISIT THE DEALER. THE FAILURE MILEAGE WAS APPROXIMATELY 5,000. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/26/2018",
        "dateOfIncident": "09/25/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131703,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR RIGHT TIRE BLEW UP IN THE MIDDLE OF THE HIGHWAY GOING ABOUT 60MPH WITH NO WARNING (NO LOW PRESSURE SIGN), NO EXTERNAL FACTORS (DID NOT RUN OVER ANYTHING). CAUSED THE CAR TO SPIN OUT OF CONTROL, BUT DID NOT HIT ANYTHING. VEHICLE HAS NEXEN TIRES.",
        "vin": "KNDJP3A51J7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/13/2018",
        "dateOfIncident": "09/13/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129352,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS STOPPED AT A RED LIGHT. THE CAR STALLED AND DIDN'T KNOW IT. THIS HAS HAPPENED TWICE. ALSO SEVERAL TIMES I START THE VEHICLE AND IT STALL OUT IMMEDIATELY.  DEALER COULDN'T FIND NOTHING WRONG.  STOPPED AND IN DRIVE OR PARKED.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/26/2018",
        "dateOfIncident": "07/26/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113971,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "FROM A STOP, THE VEHICLE HAS A SIGNIFICANT HESITATION PULLING AWAY FROM A STOP SIGN/REDLIGHT ETC. AS YOU PUSHING THE GAS PEDAL DOWN, IT HESITATES THEN ACCELERATES HARD. HAS 340 MILES ON IT AT THIS TIME. DEALER AND KIA STATE THIS IS NORMAL FOR THE NEW TRANSMISSION/TURBO DESIGN. EVEN THE SERVICE MANAGER WAS SHOCKED WHEN HE DROVE IT SAYING HE WOULD NOT HAVE BOUGHT IT. I WOULD THINK THIS PROBLEM COULD BE RESOLVED WITH A PROGRAMMING UPDATE. MY CONCERN FOR SAFETY IS TO PART: 1ST, ANTICIPATING THE VEHICLE MAY GO WHEN IN FACT IT HESITATED TO PULL OFF CREATES AN ANTICIPATION EVENT. 2ND, THE HARD ACCELERATION WHEN IT ENGAGES COULD RESULT IN REAR-ENDING SOMEONE. THE ATTACHED DOCUMENTS REPRESENT THE WORK ORDER AND DESCRIPTION OF THE NEW TRANSMISSION. THIS IS A BULLETIN EXPLAINING THE DRIVABILITY CONCERNS, HOWEVER, IT DOES NOT REFLECT THE HESITATION ISSUE.",
        "vin": "KNDJX3AA2J7"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "07/24/2018",
        "dateOfIncident": "07/23/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113338,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES FAILED.  WAS PUMPING PEDLE, NO BRAKES WHATSOEVER AND REARENDED DRIVER INFRONT OF ME  AIRBAGS DID NOT DEPLOY",
        "vin": "KNDJN2A27J7"
    },
    {
        "components": "SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "06/12/2018",
        "dateOfIncident": "05/16/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11101360,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE HIT IN REAR BY A TRUCK. MY WIFE AND I WENT FORWARD TO ALMOST THE DASH AND STEERING WHEEL, THE BELTS NEVER CAUGHT. I CALLED KIA TALKED TO OFFICE IN CALIFORNIA HE SAID THEY SHOULD HAVE CAUGHT. TOOK TO KIA DEALER HAS ADVISED AND THEY SAID IT WORKED FINE. THEY ADJUSTED BECAUSE NOW YOU PULL A LITTLE WAYS THEY LOCK. THE SERVER WRITER SAID THE TECH TOLD HIM THEY WOULD NOT LOCK FOR BEING HIT IN REAR. TALKED TO CALIFORNIA AGAIN THE SAME PERSON AND HE SAID THEY WOULD NOT LOCK BECAUSE WE WENT BACK FIRST AND THEN FORWARD. WE WAS STOPPED AT A YIELD SIGN FOR TRAFFIC ON A HIGHWAY WAITING TO GO TO ANOTHER HIGHWAY WHEN WE WERE HIT.",
        "vin": "KNDJN2A2XH7"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/30/2018",
        "dateOfIncident": "03/27/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11082237,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR BRAND NEW 2018 CAR ON THE MARKET HAS A TIRE MOBILITY KIT. THIS KIT ONLY SEALS A PUNCTURE & COMPRESSES FOR A SHORT TERM TRIP TO A LOCAL GARAGE. AS YOU WELL KNOW, MORE THAN A PUNCTURE CAN OCCUR WHILE DRIVING. NO SPARE WELLS (\"BUT DONUTS ONLY\" ALONG WITH A JACK AT EXTRA COST) ARE BUILT TO ACTUALLY HOLD A REAL SPARE TIRE. THERE ARE CIRCUMSTANCES ALL AROUND THIS COUNTRY OF INADEQUATE COVERAGE OF CELL PHONE SERVICES, NOT TO MENTION TIRE SITUATIONS OTHER THAN PUNCTURES. MAY I ASK YOU HOW YOUR AGENCY CONSIDER THIS METHOD OF EMERGENCY REPAIR CONSIDERED SAFE FOR CONSUMERS? THIS SYSTEM OF SAFETY SHOULD  TAKE HIGHEST PRIORITY! SOMEONE NEEDS TO ADDRESS THIS INADEQUATE APPROACH TO THE PROBLEM.SHAME ON YOUR NEGLIGENCE!!!",
        "vin": ""
    }
]