[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/20/2021",
        "dateOfIncident": "12/13/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444497,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The slightly opened sunroof spontaneously exploded with shattered glass flying outward and some glass pieces falling on my husband while he was driving.  The vehicle can be inspected; however, a Lexus dealership replaced the sunroof glass without charge, the next day after the incident.  The unexpected loud explosion with flying glass startled my husband while he was driving.  Fortunately, there were no cars around him at the time, because the fright caused by the explosion could have caused a multi-vehicle accident.  A Lexus dealer inspected the sunroof damage, and though they would not acknowledge this was a manufacturer defect, they did replace the glass without charge, stating it was a \"one-time goodwill gesture.\"  The day before the repair, the damage was inspected by Senior Officer Sampson of the Maryland Transportation Authority (phone number 410-537-1197) on December 13, 2021 (not long after the incident).  There were no warnings or symptoms of any kind that would have alerted the driver to the spontaneous explosion.",
        "vin": "JTJBZMCA2J2"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/24/2021",
        "dateOfIncident": "02/24/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397659,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX450H",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "IT STARTED HAPPENING A FEW MONTH'S AFTER I PURCHASED THE CAR. I DIDN'T THINK OF IT MUCH BECAUSE IT WAS VERY FAINT AND NOT LOUD AT ALL. THE NOISE WAS GETTING LOUDER INCREASINGLY BUT SLOWLY. THE BRAKES WORKED FINE SO I LET IT GO. LATER ON, IT STARTED BOTHERING ME EVERY TIME I PRESS THE BRAKE PEDAL. THE SQUAWKY NOISE BECAME REALLY ANNOYING SO I TOOK IT TO THE DEALER WHERE I PURCHASED THE CAR. THEIR SERVICE PERSON DIDN'T THINK IT WAS A PROBLEM AND DIDN'T WANT TO TRY TO INVESTIGATE THE ISSUE. A FEW WEEKS/MONTHS (NOT SURE HOW LONG) LATER, I TOOK IT TO ANOTHER DEALER AND THEY CONTACTED LEXUS AND DECIDED TO FIX IT. WHEN I PICKED THE CAR UP, THE NOISE WAS GONE AND I WAS HAPPY FOR A WHILE.   AFTER A FEW MONTHS, THE SQUAWKY NOISE STARTED HAPPENING AGAIN. IT WAS VERY NOT LOUD, SO I REALLY HOPED THAT IT WOULDN'T GET ANY LOUDER THAN THAT. THIS TIME, THE PROGRESSION OF THE NOISE WAS SLOWER THAN THE FIRST TIME. I WAITED SOME TIME TO TAKE THE CAR FOR A SCHEDULED MAINTENANCE. I MENTIONED IT TO THE DEALER WHO FIXED IT. THEY WERE LOOKING FOR A LOUD NOISE THAT IS CONSISTENT, WHICH THEY DIDN'T HEAR. I WAS TOLD THAT IT WAS SOMEWHAT NORMAL FOR A HYBRID CAR, SO THEY CAN'T DO ANYTHING SINCE THERE'S NO SAFETY ISSUE. YES, THE BRAKES WORKED FINE, BUT THE BRAKE HAD BEEN MAKING THE SQUAWKY NOISE NOT SOON AFTER I FIRST PURCHASED THE CAR!   LEXUS ADVERTISES LIKE THIS: LEXUS EXPERIENCE AMAZING. THE SQUAWKY NOISE IS NOTHING CLOSE TO AMAZING WHEN YOU DRIVE A CAR THAT MAKES A NOISE LIKE MY 2018 LEXUS RX450H. ANYWAY, I WAITED ONE MORE SCHEDULED MAINTENANCE. THIS TIME, I COMPLAINED THAT THE NOISE IS GETTING LOUD AND I CAN'T STAND IT. THIS TIME THEY CONTACTED LEXUS AGAIN, BUT LEXUS TOLD THEM THEY DON'T HAVE TO FIX IT BECAUSE IT WAS NOT A SAFETY ISSUE. SO BASICALLY I'M STUCK WITH A CAR THAT SQUAWKS ALMOST EVERY TIME I PRESS THE BRAKE PEDAL. THE ATTACHED DOCUMENT IS THE EXACTLY MY PROBLEM AND I NEED HELP.",
        "vin": "2T2BGMCA6JC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/10/2020",
        "dateOfIncident": "06/02/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328150,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX450H",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD AN ISSUE WHILE DRIVING THE 2018 RX450H ON MAY 4TH WHERE THE CAR LIGHTS CAME ON....ENGINE LIGHT, AWD, ABS, ETC AND THE CAR STALLED COMPLETELY. HAD TOWED TO DEALERSHIP AND THEY STATED THAT IT WAS 'FIXED'. 4 WEEKS LATER WHILE TRAVELING AT 70+ MPH ON MAJOR INTERSTATE, CAR STALLED AGAIN THE SAME WAY....LIGHTS ON, ETC.. WAS LUCKILY IN THE RIGHT LANE OF 4 WIDE TRAFFIC AS CAR WENT TO A STOP QUICKLY. WAS STRANDED IN A HEAVY TRAFFIC LANE, CAR WOULD NOT SHIFT INTO NEUTRAL TO PUSH OUT OF TRAFFIC. WAS 2 HOURS FROM HOME, HAD ANOTHER LEXUS DEALERSHIP TOW THE CAR AND THEY CAME BACK WITHIN A FEW HOURS AND SAID IT WAS THE FUEL PUMP. I WAS NOT AWARE OF THE RECALL TILL THEN AND THIS 18' 450H WAS NOT ON THE CURRENT LIST WHICH ONLY PROVES THAT THIS ISSUE IS SYSTEMIC. FORTUNATELY, NO ONE WAS HURT IN THESE 2 OCCURRENCES BUT WE ARE NOT DRIVING THIS CAR AGAIN UNDER NO CIRCUMSTANCES.  *TR",
        "vin": "2T2BGMCA7JC"
    },
    {
        "components": "POWER TRAIN,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/24/2020",
        "dateOfIncident": "02/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311165,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX450H",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FEBRUARY 13, 2020 MY WIFE AND I WERE DRIVING FROM FORT MYERS, FL TO SARASOTA, FL ON I-75.  AT ABOUT PORT CHARLOTTE EXIT THE CAR STARTED TO SHAKE AND THE ENGINE SHUT DOWN.  WE WERE IN THE LEFT LANE GOING BETWEEN 75 TO 80 MILES PER HOUR.  FORTUNATELY I WAS ABLE TO MANEUVER THE CAR INTO THE MEDIAN.  AUTOMOBILES BEHIND ME HAD TO SUDDENLY BREAK TO AVOID HITTING US.  THE LEXUS 2018 RX 450HL HAS THE SAME GASOLINE",
        "vin": "JTJDGKCA8J2"
    }
]