[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/04/2022",
        "dateOfIncident": "12/22/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446122,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "LS",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The vehicle exhibited 3 episodes of premature battery failure.  Mileage of the vehicle is 6000 miles.  Without any warning the car would just not start from a gas pump or such locations in the middle of the road.  This is a dangerous problem because there was no warning that the battery is running low or there is any problem.  Car runs 100 miles every day.  Lexis dealership diagnosed  battery failure and replace the battery but this is a safety issue particularly because it happens in the middle of the night when you are driving in a remote location and gas pumps tell you to switch off engine before filling  And there is no warning sign to indicate that there is a problem with the battery  THIS SHOULD BE INVESTIGATED AS A SAFETY ISSUE",
        "vin": "JTHC5LFF6J5"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/27/2020",
        "dateOfIncident": "10/25/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366701,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "LS",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HESITATES WHILE DRIVING. RECALL ANNOUNCED TO US 1/20/2020. HAVE ATTEMPTED NUMEROUS TIMES TO HAVE DEALERSHIP DO THE FREE RECALL REPAIR. EVEN WHILE THERE FOR OIL CHANGES AND REGULAR SERVICES THROUGHOUT THIS YEAR. HAVE BEEN TOLD EACH TIME THEY NEED TO ORDER THE PART AND THEY WILL CALL ME. 10 MONTHS OF THIS NOW AND CAR IS UNSAFE- THEY KEEP STALLING ON DOING THE REPAIR THAT IS A SAFETY RISK FOR MYSELF AND FAMILY. WANT THIS DOCUMENTED IF SOMETHING HAPPENS TO US AND WE HAVE AN INJURY OR DEATH BECAUSE THE CAR HAS BEEN HESITATING AND THEY CONTINUE TO TELL US THEY DON'T HAVE THE FUEL PUMP TO DO THE REPAIR.",
        "vin": "JTHB51FF4J5"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/04/2020",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316040,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "LS",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 LEXUS LS 500. THE CONTACT STATED THAT WHILE DRIVING AT 70 MPH, THE VEHICLE SHIFTED FROM TENTH GEAR TO FOURTH GEAR WITHOUT WARNING. THE RPMS REVVED UP AND THE CONTACT FLICKED THE SWITCH ON THE STEERING WHEEL TO GO BACK TO THE TENTH GEAR. THE FAILURE RECURRED 6 TIMES. THE VEHICLE WAS TAKEN TO JOHNSON LEXUS OF RALEIGH LOCATED AT (5839 CAPITAL BLVD, RALEIGH, NC 27616 (919) 436-3916). THE FAILURE RECURRED WHILE THE VEHICLE WAS BEING TEST DRIVEN. A SPECIALIST WAS BROUGHT IN FROM THE MANUFACTURER TO ASSIST WITH THE DIAGNOSTIC AND INSPECTION OF THE VEHICLE. THE DEALER STATED THAT THE VEHICLE OPERATED AS DESIGNED. THE CONTACT WAS GIVEN A LOANER FOR THE DURATION OF THE INSPECTION. THE FAILURE MILEAGE WAS 7,000.",
        "vin": "JTHC51FF3J5"
    },
    {
        "components": "ELECTRICAL SYSTEM,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/11/2019",
        "dateOfIncident": "09/30/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288488,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "LS",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 LEXUS LS. THE CONTACT STATED THAT THE VEHICLE WAS EQUIPPED WITH A PRE-COLLISION SYSTEM, WHICH WAS SUPPOSED TO AID IN PREVENTING A CRASH. IN THE EVENT OF A CRASH, IT RELEASED THE HOOD OF THE VEHICLE. WHILE DRIVING APPROXIMATELY 45 MPH, THE CONTACT WAS CUT OFF BY ANOTHER VEHICLE. THE CONTACT DEPRESSED THE BRAKE PEDAL IMMEDIATELY AND THE PRE-COLLISION SYSTEM ACTIVATED. AS A RESULT, THE HOOD OF THE VEHICLE RELEASED. THE CONTACT TOOK THE VEHICLE TO JIM HUDSON LEXUS (LOCATED AT 3410 WASHINGTON RD, AUGUSTA, GA 30907, 706-650-9999) AND WAS INFORMED THAT THE DIAGNOSTIC BOX INDICATED THAT A COLLISION WAS NOT DETECTED. THE DEALER DIAGNOSED THAT THE VEHICLE'S PRE-COLLISION SYSTEM NEEDED TO BE REPROGRAMMED AND THE ACTUATORS NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND A CASE WAS OPENED. THE MANUFACTURER STATED THAT THEY WOULD NOT BE ABLE TO PERFORM THE REPAIR. THE APPROXIMATE FAILURE MILEAGE WAS 6,300. *LN  THE MANUFACTURER STATED THE PEDESTRIAN HOOD POP UP FEATURE ACTIVATED AS DESIGNED.*JB",
        "vin": "JTHB51FF2J5"
    },
    {
        "components": "STEERING,WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/18/2019",
        "dateOfIncident": "05/16/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280921,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "LS",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "APEAL AGAINST THE RECALL DONE BY LEXUS TOYOTA  ON MAY 16TH, 2019, I TOOK MY CAR LEXUS 2018 LS 500 TO THE DEALER, LEXUS OF WOODLAND HILLS, WHERE I BOUGHT IT, FOR BEING RECALLED BY THE COMPANY. (NHTSA RECALL NO. 19V-134)   AFTER RECALL DEFECTS WERE FIXED, I DROVE ABOUT 4,000 MILES AND TOOK THE CAR BACK TO THE DEALER FOR MAINTENANCE. AT THIS TIME, TREMENDOUS NUMBER OF DEEP LARGE SCRAPES ON ALL FOUR TIRES, WHICH I HAD NEVER SEEN IN THE ENTIRE DRIVING EXPERIENCE OF MY LIFE WERE POINTED OUT BY THE DEALER.  THE DEALER VIOLENTLY INSISTED ON THE SCRAPES WERE NOT CAUSED BY THE DEFECTS.   AFTER TREMENDOUS ARGUMENT, THE DEALER WROTE, 'DIAGNOSTICS IS REQUIRED TO DETERMINE THE RECOMMENDED CORRECTION FOR YOUR CONCERN.'  THE CAR ALSO HAS STABILITY PROBLEM. FROM THE BEGINNING, IT LACKS STABILITY COMPARED WITH LS460 TRADED-IN.  I VISITED LEXUS OF GLENDALE, SANTA MONICA, AND THOUSAND OAKS. THEY WERE SURPRISED AT CONDITION OF SCRAPES, BUT THEY WITHHELD COMMENT. I HAD NO CHOICE, BUT TO APPEAL TO LEXUS OF TOYOTA.    I CONTACTED;  <DATE>          <CONTACTED TO THE PERSON OF..>            <BY >  10/02/19     TOYOTA CUSTOMER SERVICE REP.              EMAIL  10/16/19     LEXUS CASE MANAGER                          PHONE  10/18/19     LEXUS GUEST EXPERIENCE CENTER         EMAIL  10/22/19     LEXUS EXECUTIVE OFFICE                       PHONE  10/24/19     LEXUS GUEST EXPERIENCE CENTER        EMAIL  10/31/19     LEXUS GUEST EXPERIENCE CENTER        EMAIL  11/06/19     FACTORY REP.                                        AT LEXUS OF BEVERLY HILLS.  11/11/19     LEXUS EXECUTIVE OFFICE                      EMAIL    THEIR RESPONSE WAS 'VERY NEGATIVE' AND GAVE ME HARDEST TIME TO APPEAL.  I BELIEVE THAT I HAVE A RIGHT FOR SAFETY STANDARD GUARANTEED AND DECIDED TO APPEAL.  *JS",
        "vin": "JTHB5LFFXJ5"
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/23/2019",
        "dateOfIncident": "03/24/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257525,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "LS",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM FILING THIS COMPLAINT TODAY WITH LEXUS CORPORATION BECAUSE BOTH MY DEALERSHIP, NEW COUNTRY LEXUS OF LATHAM, AND LEXUS CORPORATION HAVE CHOSEN TO IGNORE THE DANGER THEY HAVE PLACED MYSELF AND MY FAMILY.  I HAVE PURCHASED THREE LEXUS' OVER THE YEARS FROM NEW COUNTRY LEXUS AND AM VERY DISAPPOINTED IN THE SERVICE FROM BOTH MY DEALER AND LEXUS CORPORATION.  I AM DISAPPOINTED THAT NEW COUNTRY AND LEXUS CORPORATION WOULD PUT ME AND MY FAMILY AT RISK OF INJURY AND/OR DEATH.  PARTICULARLY IN LIGHT OF THE FACT THAT I HAVE REACHED OUT TWICE TO MY DEALERSHIP AND THREE TIMES TO LEXUS CORPORATION. THEREFORE, I AM DOCUMENTING MY CONCERNS IN THE EVENT OF A SERIOUS INJURY OR DEATH OCCURRING IN WHICH I WILL HOLD BOTH LEXUS CORPORATION AND NEW COUNTRY LEXUS RESPONSIBLE.     ON FEBRUARY 26, 2019 A SAFETY RECALL WAS ANNOUNCED REGARDING CERTAIN RUN-FLAT TIRES WHICH INCLUDED MY NEW VEHICLE, 2018 LS 500.  I DID NOT RECEIVE THIS RECALL NOTICE UNTIL FRIDAY MARCH 29, 2019.  THE PREVIOUS WEEK, ON MARCH 24TH, I WAS ON MY WAY TO KENNEDY AIRPORT IN NEW YORK CITY AND HAD A BLOW-OUT CROSSING THE GEORGE WASHINGTON BRIDGE.  THE SIDE WALL OF MY FRONT DRIVER SIDE TIRE HAD BLOWN OUT (PICTURE ATTACHED).  THIS ALMOST CAUSED ME TO VEER INTO TRAFFIC WHICH I FORTUNATELY WAS ABLE TO AVOID.  I WAS EVENTUALLY TOWED TO A 24HR TIRE REPAIR STATION WHERE A REPLACEMENT TIRE WAS PUT ON THE VEHICLE.  THE TOWING CHARGE AND NEW TIRE COST ME $400 WHICH LEXUS HAS REFUNDED ME A CHECK FOR $400.  TO THIS DAY I CONTINUE TO BE TOLD THE TIRES ARE ON BACK ORDER AND I AM STILL DRIVING ON DEFECTIVE TIRES.  IT HAS BEEN NEARLY 6 MONTHS.",
        "vin": "JTHC51FF8J5"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/24/2019",
        "dateOfIncident": "05/24/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209751,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "LS",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE COLLISION AVOIDANCE SYSTEM BLOWS FUSES AND STOPS WORKING, BUT THE LIGHT ON THE DASH CONTINUES TO INDICATE THAT EVERYTHING IS WORKING.    IN OTHER WORDS, THERE IS NO WAY TO LEARN THAT THE COLLISION SYSTEM IS OFFLINE UNLESS YOU'RE WILLING TO SIMULATE A NEAR CERTAIN COLLISION (WHICH I DID WITH THE DEALER IN MY CAR AND HE FINALLY ACKNOWLEDGED THE PROBLEM), OR HAVING AN ACTUAL ACCIDENT.      THIS IS CLEARLY A DESIGN FLAW.  IF THE FUSE IS BLOWN, OBVIOUSLY THE SYSTEM SHOULD SHOW AN ERROR WHEN IT'S ENGAGED - NOT A GREEN INDICATOR.",
        "vin": "JTHC5LFF4J5"
    }
]