[
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/24/2022",
        "dateOfIncident": "02/08/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453923,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I had a accident almost a year ago if not longer. I hit a deer on the freeway they couldn’t understand why my airbags didn’t deploy. They say the bar was cracked in two different spots that makes the airbag deploy. Luckily my car wasn’t total for that reason. But I always wondered why my airbags didn’t deploy ? I thought I should let you know that .",
        "vin": "3ln6l5c93jr"
    },
    {
        "components": "LANE DEPARTURE,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "08/18/2021",
        "dateOfIncident": "08/17/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429526,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "This is [XXX] my customer is missing and has been missing since 7:45pm 8/17/21 by this vin number i was wondering if you could put a trace on the vin number 3LN6L5D92JR[XXX]  PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "3LN6L5D92JR"
    },
    {
        "components": "ELECTRICAL SYSTEM,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "11/12/2020",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374359,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 LINCOLN MKZ. THE CONTACT STATED THAT WHILE DEPRESSING THE WINDOW SWITCH FOR THE DRIVER'S SIDE REAR WINDOW, THE BLIND SPOT WARNING SYSTEM WAS DEACTIVATED. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. A DEALER WAS NOT CONTACTED. THE MANUFACTURER HAD NOT BEEN INFORMED OF FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 6,000.",
        "vin": "3LN6L5C92JR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/15/2020",
        "dateOfIncident": "01/09/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299439,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "IF YOU ARE ON A HILL SUCH AS A DRIVEWAY AND YOU TURN YOUR CAR ON TO ACCESSORY MODE AND THEN FORGET YOUR CAR IS NOT TURNED ON YOU CAN  PUT YOUR CAR INTO GEAR. IF YOU PUT YOUR CAR INTO REVERSE AND THE CAR STARTS ROLLING IT IS DIFFICULT TO STOP IT BECAUSE YOU HAVE NO POWER ON THE BRAKES AND CANNOT TURN  THE STEERING WHEEL BECAUSE IT IS LOCKED. THIS IS VERY DANGEROUS. THERE MAY BE A CHILD BEHIND A CAR AND IT WILL ROLL BACK UNTIL YOU CAN GET IT TURNED OFF.  I DON'T THINK YOU SHOULD BE ABLE TO PUT THE CAR IN DRIVE OR REVERSE WHEN THE CAR IS NOT TURNED ON AND YOUR FOOT IS ON THE BREAK.",
        "vin": "3LN6L5E98JR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/16/2019",
        "dateOfIncident": "08/15/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269005,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES FADE WHILE WAITING FOR STOP LIGHTS, SOMETIMES BREAK PETAL ALL WAY UP AND OTHER TIMES HALF WAY UP. YOU NEVER KNOW HOW FAR THE PETAL WILL BE WHEN STOPPING, UP OR HALF WAY DOWN. FADES WHEN WAITING, PUT IN NEUTRAL IF LONG LIGHT.",
        "vin": "3LN6L5MU3JR"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/02/2019",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265585,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR LIFT GATE ASSEMBLY CENTER LED STRIP IS FILLED WITH WATER.  THIS CAUSES AN ELECTRICAL  SHORT CONDITION THAT RESULTS IN THE REVERSE LIGHTS TO BE ON AT ALL TIMES WHEN DRIVING.  VEHICLE WILL NOT PASS MA INSPECTION AND HAS BEEN CITED FOR THIS INFRACTION.  NO DAMAGE TO LIFT GATE, EITHER A PART OR MANUFACTURING DEFECT.",
        "vin": "2LMHJ5NK7JB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/22/2019",
        "dateOfIncident": "08/16/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11245947,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER CAME TO PICK ME UP. DRIVER STOPPED, HE THOUGHT HE PUSHED PARK BUTTON.  STARTED TO GET OUT OF CAR.  GOT LEFT FOOT ON GROUND, SWUNG RIGHT FOOT OUT AND CAR STARTED ROLLING BACKWARDS.  CAR DOOR KNOCKED HIM DOWN, CATCHING LEFT FOOT BETWEEN DOOR AND FRAME.  CAR STARTED DRAGGING DRIVER DOWN STREET IN REVERSE.  I HAD TO RUN AROUND DOOR, PUT CAR IN PARK.  DRIVER DRAGGED BETWEEN 5-10 FEET(EST).  DRIVER ENDED UP WITH FRACTURED LEFT ANKLE, 3 BROKEN BONES IN LEFT FOOT, ABRASIONS ON RIGHT SHOULDER AND LEFT ELBOW, HEMATOMA ON RIGHT LEG.  CAR WAS ON A VILLAGE PAVED STREET, IN REVERSE INSTEAD OF PARK.  IT WAS DARK , THE DRIVER THOUGHT HE PUSHED THE PARK BUTTON BUT EVIDENTLY PUT THE CAR IN REVERSE BY MISTAKE.  CAR STARTED ROLLING WHEN HE TOOK RIGHT FOOT OFF BRAKE.",
        "vin": "3LN6L5D95JR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/05/2019",
        "dateOfIncident": "02/07/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218137,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 LINCOLN MKZ. THE CONTACT STATED THAT THE TRANSMISSION FAILED. THE CONTACT SWITCHED GEARS AND THE VEHICLE DECELERATED. THE VEHICLE ROLLED AND STOPPED IN THE MIDDLE OF THE ROAD. THE CONTACT RESTARTED THE ENGINE AND THE VEHICLE WAS ABLE TO DRIVE OFF. THE VEHICLE WAS TAKEN TO OLATHE FORD LINCOLN (1845 E SANTA FE ST, OLATHE, KS 66062) WHERE THEY DIAGNOSED THE VEHICLE, BUT COULD NOT DUPLICATE THE FAILURE. THE MECHANIC STATED THAT NOTHING WAS WRONG WITH THE VEHICLE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 3,000.",
        "vin": "3LN6L5E95JR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/10/2019",
        "dateOfIncident": "05/10/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206840,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKZ",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON DRIVING THE VEHICLE, IT HAS STALLED SEVEN TIMES. TWO OF THOSE INCIDENTS INVOLVED VEHICLE GOING INTO PARK WITHOUT TOUCHING THE PARK BUTTON. AS IT WAS SHIFTING INTO PARK, THERE WAS A LOUD CLICKING SOUND AS THOUGH THE VEHICLE WAS 'FIGHTING' GOING INTO PARK. THEN THE VEHICLE DIED. ON AT LEAST FIVE OTHER OCCASIONS, IT JUST DIED. NOTHING INDICATING ON MY WAY APP, OR AT SERVICE DEPARTMENT FOR LOCAL LINCOLN DEALERSHIP. THIS BEGAN ONE WEEK AGO YESTERDAY AND WITHOUT PATTERN, HAS CONTINUED. UPON RETURN FROM LINCOLN SERVICE DEPARTMENT, ISSUE RESURFACED THIS MORNING WHEN IT WENT INTO PARK WHILE DRIVING.",
        "vin": "3LN6L5E94JR"
    }
]