[
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/24/2022",
        "dateOfIncident": "02/01/2022",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453738,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "My car's rear backup camera has been having issues for the last several thousand miles.  I took the car in for repair, and the Mazda dealership informed me that the wiring for the backup camera has corroded.  After searching various online forums, it appears that this issue is pretty common with this generation Mada3.  I noticed today that Ford issued a recall for a similar problem with Mustangs.",
        "vin": "3MZBN1M35JM"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/21/2022",
        "dateOfIncident": "02/10/2022",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453210,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The body computer experienced a malfunction leading to the wipers becoming inoperable. This can be made available for inspection. I was driving through a snow storm, my wipers stopped working without warning causing severe loss of visibility endangering myself and those around me. The problem has been confirmed by an independent service center. It has not, however the model of car has a recall for this, it does not extend to my specific VIN. There were no warnings. The wipers worked and halfway through a drive they stopped.",
        "vin": "3MZBN1V37JM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/24/2021",
        "dateOfIncident": "09/24/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434306,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Sunroof shattered by itself",
        "vin": "3MZBN1V39JM"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/08/2021",
        "dateOfIncident": "07/07/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423911,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Front windshield wipers for my 2018 Mazda 3 stopped working without any warning while driving on the highway under heavy rain fall.  I recently read online about a faulty wiper motor relay but I have not received any information from Mazda 3 about this.",
        "vin": "3MZBN1L30JM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/19/2021",
        "dateOfIncident": "06/05/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421470,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ONLY REAR BRAKES SEVERELY CORRODED AND NEAR FAILURE AT 13200 MILES DESPITE ROUTINE WASHING AND REGULAR MAINTENANCE AT DEALERSHIP, WHILE THE FRONT BRAKES ARE PRISTINE. REAR BRAKE NOISES BEGAN AT 13200 MILES AND WAS MENTIONED TO DEALER DURING ROUTINE MAINTNENACE AT 13283 MILES. DEALERSHIP REFUSES TO ACCEPT THIS IS A MANUFACTURING DEFECT AND TRIES TO BLAME ENVIRONMENT FOR UNUSUAL CORROSION AFTER 2 YEARS. ESCALATED TO MAZDA USA PENDING. THIS SEEMS ALMOST IDENTICAL TO THE ISSUES NOTED IN 2017 MAZDA3 IN COMPLAINT NHTSAID: 11240160 AND RELATED TO THE REAR BRAKE CALIPER RECALLS FOR ( Part 573 Safety Recall Report 17V-393)",
        "vin": "3MZBN1V30JM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/01/2021",
        "dateOfIncident": "03/29/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419256,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "On March 29, 2021, I had my 2018 Mazda 3 serviced, oil and filter chance, and inspection, at my local Auto repair shop. They indicated that the belt tensioner and belt needed replacement, due to oil leaking, from the tensioner, on to the belt.  I got concerned because the vehicle only had 11,523, and the warranty ran out a few weeks earlier. I emailed Mazda several times, and asked, due to the low mileage, and close to warranty expiration, for their dealer to inspect the vehicle, and if needed, replace the tensioner and belt, both free of charge to me. They declined to grant me that courtesy.",
        "vin": "3MZBN1L37JM"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/26/2021",
        "dateOfIncident": "07/25/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413902,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR WIPER STOPPED WORKING DURING A DRIVE IN HEAVY RAIN CONDITIONS, SIMILARLY LIKE IT HAPPEN TO THE SAME VEHICLE FOR THE FRONT WIPERS 6 MONTHS AFTER I GOT THE VEHICLE.  I TRIED TO SCHEDULE AN APPOINTMENT WITH THE DEALER BUT WITH THE PANDEMIC IT WAS NOT POSSIBLE. WHEN I WENT FOR THE ACTUAL APPOINTMENT ON MARCH 2021, THEY TOLD ME THE VEHICLE WAS OUT OF WARRANTY EVEN THOUGH IT IS BARELY 3 YEARS OLD, AND JUST FOR A DIAGNOSTIC THEY WILL CHARGE $160 PLUS TAX. THE POTENTIAL REPAIR WOULD BE EXTRA, RANGING FROM A NEW BCM TO A NEW MOTOR, OR BOTH, SCALING UP TO $450 REPAIR BILL.  THE ISSUE IS EXTREMELY SIMILAR TO A SAFETY RECALL THAT THE VEHICLE HAD FOR THE FRONT WIPER WERE THEY HAD TO CHANGE THE RELAYS FREE OF CHARGE. I CONSIDER THIS ALSO A SAFETY ISSUE AS IF YOU'RE DRIVING IN THE HIGHWAY AT 55MPH DURING THE HEAVY RAIN AND YOU ARE NOT ABLE TO SEE AND VEHICLE THAT COMES AT HIGH SPEED, SUCH TRUCK THAT LOOSE THE BRAKES IN A ROUNDABOUT EXIT, THAT POSES A SAFETY RISK TO DRIVERS AND OWNERS OF THIS VEHICLE. A RECALL SHOULD BE MADE FOR THIS REAR WIPER ISSUE LIKE FOR THE FRONT ONE.",
        "vin": "3MZBN1M30JM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/09/2021",
        "dateOfIncident": "02/09/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395489,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CHARGE WARNING SYSTEM CAME ON AND THEN A FEW MINUTES LATER MY CAR COMPLETELY SHUTS DOWN IN THE MIDDLE OF TRAFFIC IT HAPPENED ON FEBRUARY 3RD AND I HAD ANOTHER INCIDENT ON FEBRUARY THE 9TH 2021 I TOOK THE CAR IN TO GET LOOKED AT MY MAZDA AND THEY COULDN'T FIND ANYTHING WRONG WITHOUT HAVING THE INDICATION WHEN I CLEARLY TOLD THEM MY CAR STOPPED IN THE MIDDLE OF TRAFFIC THIS IS VERY DANGEROUS AND IT CAN CAUSE ACCIDENTS",
        "vin": "3MZBN1V37JM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/03/2020",
        "dateOfIncident": "06/27/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337318,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR AUTOMATICALLY APPLIES ITS BRAKES WHEN IT SHOULDN'T BE.  I WAS DRIVING AT A SPEED OF AROUND 60 MPH FOLLOWING A PICKUP TRUCK.  THE TRUCK STARTS FLASHING TO TURN RIGHT, I STARTED TO BRAKE A LITTLE, MY SPEED WAS REDUCED TO AROUND  40-45 MPH...  JUST WHEN I WAS READY TO HIT THE GAS PEDAL AGAIN, BECAUSE THE   TRUCK HAS FULLY COMPLETED HIS TURN ( WAS ALL THE WAY ON THE OTHER STREET)... MY MAZDA 3 2018 HIT THE EMERGENCY BRAKE TO SLOW THE CAR REALLY FAST TO AROUND 10 MPH !!!  THERE WAS ABSOLUTELY NO RISK OF A CRASH, MY GIRL FRIEND WAS IN SHOCK, SHE DIDN'T UNDERSTAND WHAT HAPPENED.   SORRY IF MY ENGLISH IS NOT SO GOOD, I USUALLY SPEAK FRENCH !!!    THE CAR HAVE ONLY 2000 MILLES, I BOUGHT IT NEW ON MARCH 2020... JUST BEFORE COVID-19 !!!",
        "vin": "3MZBN1M3XJM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "06/24/2020",
        "dateOfIncident": "06/22/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330612,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS OFF AND UNATTENDED IN PARKING LOT:MANUAL TRANSMISSION WHICH I'VE DRIVEN MY WHOLE LIFE & I'M NO SPRING CHICKEN. LIVE IN FLAT CITY WHERE HILL/ROLLING BACK HAS NEVER BEEN AN ISSUE. CAR HAS ELECTRIC PARKING BRAKE. 1 DAY A YEAR INTO THE LEASE, WAS PARKED @A PUMP@TGAS STATION &WHEN CAME OUT,CAR HAD MOVED/ROLLED BACK. SHOCKINGLY I THOUGHT I MESSED UP/MIGHT'VE FORGOTTEN2 ENGAGE PARKING BRAKE, DESPITE IT BECOMING 2ND NATURE. THANKED GOD DIDN'T ROLL BACK INTO ANYTHING/ANYONE, VOWED 2 BE XTRA MINDFUL/CAREFUL.TURNS OUT NO MATTER HOW CAREFUL/MINDFUL I'VE BEEN,JUST THE OTHER DAY IT HAPPENED AGAIN.THIS TIME, HUSBAND WAS IN THE CAR W/ME &SWORE  SAW ME AS USUAL, AS 2ND NATURE, ENGAGE THE ELECTRIC PARKING BRAKE. MIND U,HAVE NEVER PUT IT INTO 1ST YEAR 2 PARK BECAUSE NEVER NEEDED 2. I GUESS SHOULD HAVE THIS TIME AS BACK-UP 2 THE ELECTRIC PARKING BRAKE THAT DIDN'T ENGAGE. WE WERE ACROSS THE LOT AT THE ATM WHEN WE SAW CAR ROLLING BACK. HUSBAND RAN 2 TRY 2 STOP IT BEFORE IT COULD HIT SOMETHING BUT HE DIDN'T SUCCEED. IT WAS 2 HEAVY & ENDED UP CRASHING IN2 THE POSTS& HANDRAIL THAT I GUESS ARE THERE FOR THAT EXACT REASON. POSTS STOPPED CAR BUT HUSBAND HURT HIS WRIST & NECK IN HIS ATTEMPT 2BE SUPERMAN. POSTS OF COURSE HAD NO DAMAGE. CONTACTED MAZDA,THEY SAID THEY'D CHECK IT OUT. I REFERENCED THAT THERE WAS  A RECALL IN PRIOR YEARS. THEY SAID NO RECALL HAS BEEN ANNOUNCED FOR THIS YEAR. DURING THIS WHOLE COVID-19 &  HUSBAND BEING FURLOUGHED, THE LAST THING WE NEED IS AN EXTRA EXPENSE AS MY INSURANCE DEDUCTIBLE WILL BE. CAR IS @DEALER NOW & THEY'RE TESTING IT 2SEE IF IT HAPPENS WHILE IN THEIR SHOP.I HATE FOR THIS TO BE A FAULTY PART OR WARRANTY ISSUE BUT ALSO HOPING IT IS SO IT WILL BE ANNOUNCED &OTHER PEOPLE CAN LEARN ABOUT THIS HORRIBLE POSSIBILITY O GRATEFUL THAT CAR DID NOT ROLL BACK AND INJURE A PERSON OR AN ANIMAL! UGH! BEWARE! *TR",
        "vin": "3MZBN1V35JM"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/21/2020",
        "dateOfIncident": "05/21/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325490,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BATTERY IN MY 2018 MAZDA 3 (TOURING) HAS DIED 3 TIMES IN ABOUT YEAR'S TIME. AFTER THE FIRST TIME, THE DEALER SAID IT WAS JUST A FLUKE--THAT IT COULD HAVE BEEN CAUSED BY ANYTHING. THEY PUT A BRAND NEW BATTERY IN. AFTER THE SECOND BATTERY DIED, THE DEALER SAID THAT IT WAS BECAUSE WE WEREN'T MAKING LONG DRIVES IN THE CAR. THEY REPLACED THE BATTERY WITH A BRAND NEW ONE--AND THEY ASSURED ME IT WASN'T ANYTHING ELSE INCLUDING THE ALTERNATOR (I ASKED ABOUT THE ALTERNATOR SPECIFICALLY). NOW, THAT BATTERY HAS DIED. I WILL CALL THE DEALER TOMORROW TO HAVE A FOURTH BATTERY INSTALLED.... THE VEHICLE WAS STATIONARY--EITHER IN OUR GARAGE OR DRIVEWAY--WHEN WE REALIZED THE BATTERY WAS DEAD. IF YOU WOULD LIKE TO SEE THE RECORDS OF MY VARIOUS VISITS TO THE MAZDA DEALERSHIP, PLEASE CONTACT ME.  *TR",
        "vin": "3MZBN1V30JM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/14/2019",
        "dateOfIncident": "10/13/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268307,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD A SCARY SAFETY ISSUE WITH MY 2018 MAZDA 3 YESTERDAY.  I HAD LEFT THE CAR RUNNING SO THAT MY DOG WOULD HAVE A/C.  MY CAR IS HAS STANDARD TRANSMISSION.  I PULLED UP THE EMERGENCY BRAKE BUTTON BUT AS I WAS EXITING THE CAR MY DOG ACCIDENTALLY PUT HER PAW ON THE EMERGENCY BRAKE BUTTON AND THE CAR STARTED GOING BACKWARDS.  THANK GOODNESS I WAS ABLE TO REACH IN AND PULL THE EMERGENCY BRAKE BUTTON BACK UP.      THIS COULD HAVE BEEN A TRAGEDY, NOT ONLY POTENTIALLY DAMAGING MY CAR AND OTHER PEOPLE'S PROPERTY BUT GOD FORBID MY CAR ROLLED INTO A PERSON.  THIS EMERGENCY BRAKE IS A SERIOUS SAFETY HAZARD.  I HAVE LEFT MY CAR IN NEUTRAL WITH THE EMERGENCY BRAKE ENGAGED MULTIPLE TIMES SINCE I GOT THE CAR LAST DECEMBER AND AM VERY LUCKY THIS INCIDENT DIDN'T OCCUR WHEN I WASN'T SO CLOSE TO MY CAR.  THE CAR SHOULD HAVE A SENSOR OR SAFETY FEATURE OF SOME SORT THAT WOULD REQUIRE THERE TO BE A CERTAIN AMOUNT OF WEIGHT IN THE FRONT SEAT THAT PREVENTED THE EMERGENCY BRAKE FROM DISENGAGING.  IN PRIOR CARS WITH A NORMAL EMERGENCY BRAKE THAT IS EITHER ENGAGED ON THE FLOOR OF THE CAR OR PULLED UP MANUALLY NEAR THE GEAR SHIFT THIS WOULD NEVER HAPPEN.  MY DRIVER SIDE DOOR WAS OPEN.    THIS ISSUE NEEDS TO BE ADDRESSED.  THIS CAN'T BE THE FIRST TIME THIS HAS HAPPENED AND IT COULD VERY EASILY HAVE DEADLY CONSEQUENCES.  I KNOW THAT MANY PEOPLE WILL LEAVE THEIR A/C OR HEAT RUNNING WHILE THERE IS A HUMAN OR DOG IN THE CAR WHEN THEY HAVE TO STEP OUT OF THE CAR TO GET THE MAIL, PUT SOMETHING ELSE IN THE CAR, ETC.  IN A CAR WITH STANDARD TRANSMISSION, THE ONLY WAY TO LEAVE THE A/C OR HEAT RUNNING IS TO LEAVE THE CAR IN NEUTRAL.",
        "vin": "3MZBN1K71JM"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/12/2019",
        "dateOfIncident": "09/12/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254975,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A CAR OVER A YEAR AGO FOR MY SON FROM CRYSTAL AUTO MALL IN GREENBROOK, NJ, A MAZDA 3,2018. THE DAY AFTER I GOT THE CAR THE TIRE PRESSURE LIGHT CAME ON. I TOOK IT IN FOR SERVICE AND THEY ADVISED THAT NOTHING WAS WRONG WITH THE TIRE OR RIM. ON THE WAY HOME FROM THAT SERVICE VISIT THE TIRE LIGHT CAME ON AGAIN. MY SON COMMUTES SO THE CAR IS NOT USED ON A DAILY BASIS, IF IT SITS MORE THAN 2 DAYS THE TIRE IS COMPLETELY FLAT. THIS HAS BEEN A CONSISTENT ISSUE FROM THAT TIME UNTIL NOW.  I HAVE TAKEN THE CAR IN FOR SERVICE SEVERAL TIMES FOR THIS SAME ISSUE AND THIS DEALERSHIP HAS BEEN COMPLETELY UNRESPONSIVE AND CARELESS ABOUT MY SITUATION. THEY HAVE NOT FIXED THE PROBLEM AND HAVE NOT ATTEMPTED TO REMEDY THE SITUATION.  I AM DEEPLY CONCERNED ABOUT THE SAFETY OF MY SON AND OTHER DRIVERS WHO COULD BE POTENTIALLY HARMED BECAUSE OF NEGLECT BY THIS DEALERSHIP AND THE DEFECT AND OR ISSUE WITH THIS TIRE. YOUR ASSISTANCE IS APPRECIATED.",
        "vin": "3MZBN1V39JM"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/13/2019",
        "dateOfIncident": "02/01/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243531,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 MAZDA 3. WHILE THE WINDSHIELD WIPERS WERE ACTIVATED, THE CONTACT NOTICED A CLOUDY FILM ON THE WINDSHIELD THAT OBSTRUCTED HER VIEW. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT REPLACED THE WINDSHIELD WIPERS, WIPER FLUID, AND BUFFED THE WINDSHIELD. THE VEHICLE WAS TAKEN TO A WINDSHIELD SPECIALIST WHO STATED THAT THE WINDSHIELD SHOULD BE REPLACED. THE VEHICLE WAS TAKEN TO GLOBAL AUTO MALL (1099 RT. 22 WEST, NORTH PLAINFIELD, NJ 07060, (866) 233-6719) WHERE IT WAS DIAGNOSED THAT THE WINDSHIELD WIPERS AND FLUID NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS CONTACTED AND PROVIDED CASE NUMBER:  12263978563. THE CONTACT WAS REFERRED TO THE DEALER. THE INSURANCE COMPANY WAS CONTACTED AND STATED THAT THE WINDSHIELD SHOULD BE REPLACED. THE FAILURE MILEAGE WAS 19,185. THE VIN WAS UNKNOWN.  *BF    CONSUMER STATED THERE REMAINS A CLOUDY FILM THAT MUST BE BUFFED TO CLEAR WINDSHIELD IN WINTER WHEN WIPERS ARE ACTIVATED IT LEAVES A FILM AS IN A SUMMERTIME  BUT THE FILM, FLASH FREEZES AND OBSTRUCTS VIEW COMPLETELY. IN RAINY WEATHER - THERE IS A FILM ON WINDOW WHEN WIPERS USED. I SENT PICTURES TO NHTSA WEBMASTER.*JB",
        "vin": "3MZBN1V30JM"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/31/2019",
        "dateOfIncident": "08/15/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240844,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 MAZDA 3. THE CONTACT STATED THAT SHE WAS EXPERIENCING DIFFERENT ELECTRICAL FAILURES WITH THE VEHICLE. THE CONTACT STATED THAT THE PASSENGER SIDE SEAT BELT WARNING CHIME SOUNDED WHEN THE SEAT WAS UNOCCUPIED. THE CONTACT HAD TO BUCKLE THE SEAT BEAT TO STOP THE WARNING SOUND. IN ADDITION, BOTH PASSENGER SIDE WINDOWS FAILED TO ROLL UP AFTER BEING DOWN. ALSO, WHILE DRIVING 40 MPH, THE TRANSMISSION FAILED TO RESPOND WITHOUT WARNING WHILE DEPRESSING THE ACCELERATOR PEDAL. THE CONTACT HAD TO SHIFT THE VEHICLE FROM SECOND INTO FIRST GEAR IN ORDER FOR IT TO RESUME NORMAL OPERATION. THE CONTACT TOOK THE VEHICLE TO ODGES MAZDA AT THE AVENUES (10681 PHILIPS HWY, JACKSONVILLE, FL 32256, (904) 562-1600) WHERE A DIAGNOSTIC TEST WAS PERFORMED, BUT NO FAILURE WAS FOUND. THE FAILURE CONTINUED AND THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 18.",
        "vin": "3MZBN1K77JM"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/31/2019",
        "dateOfIncident": "07/31/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240932,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WINDSHIELD WIPERS HAVE JUST STOPPED WORKING WHILE DRIVING IN RAIN. I TRIED TO PULL OVER, TURN OFF MY CAR AND TURN IT BACK ON BUT THEY'RE STILL NOT WORKING. THE WIPER FLUID STILL SPRAYS.",
        "vin": "3MZBN1W37JM"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/31/2019",
        "dateOfIncident": "04/30/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217116,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WINDOW WIPERS STOP WORKING ALL OF A SUDDEN WHEN ON THE INTERVAL SETTING. I HAVE TO TURN THEM OFF AND THEN ON AGAIN FOR THEM TO BEGIN WORKING ONCE MORE. THIS HAS HAPPENED MULTIPLE TIMES, USUALLY AFTER THE WIPERS HAVE SWIPED ONCE OR TWICE ON THAT SETTING WHILE DRIVING.",
        "vin": "3MZBN1L37JM"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/20/2019",
        "dateOfIncident": "11/18/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11202646,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED A BRAND NEW 2018 MAZDA 3 2.5L TOURING HATCHBACK.  I HAD ONLY DRIVEN THE VEHICLE AS ITS NEW OWNER ONCE, FROM THE DEALERSHIP BACK TO MY HOME, WHICH WAS LESS THAN 20 MILES, WHEN THE FOLLOWING OCCURRED:  I STARTED THE ENGINE FOR MY SECOND TRIP WITH THE VEHICLE, AND NOTICED THE CHECK ENGINE LIGHT WAS ILLUMINATED AND REMAINED ILLUMINATED. I DROVE THE VEHICLE AROUND THE BLOCK AND DID NOT EXPERIENCE ANY UNUSUAL DRIVING PERFORMANCE CHARACTERISTICS SO I DROVE TO MY INTENDED DESTINATION WHICH WAS ONLY 7 MILES AWAY. WHEN I STARTED THE ENGINE TO MAKE MY WAY BACK I NOTICED THAT NOW FIVE WARNING LIGHTS WERE ILLUMINATED AND REMAINED ILLUMINATED, WHICH CORRESPONDED TO THE FOLLOWING WARNING GUIDANCES: AN ENGINE SYSTEM MALFUNCTION, A DSC MALFUNCTION, A TPMS SYSTEM MALFUNCTION, ALONG WITH TWO SCBS MALFUNCTION WARNINGS. WHEN ATTEMPTING TO DRIVE THE VEHICLE, I FOUND THAT THE ENGINE WAS CLEARLY NOT RUNNING PROPERLY, AS IT JERKED VIOLENTLY, SURGED, HESITATED AND AT TIMES SEEMED POISED TO STALL. THE VEHICLE WAS CLEARLY UNSAFE FOR ME TO PROCEED ON THE ROAD. AS IT WAS SUNDAY, I HAD TO ARRANGE ON THE NEXT DAY FOR A TOW TRUCK TO TRANSPORT THE VEHICLE TO THE NEAREST MAZDA SERVICE CENTER, WHICH WAS NOT THE MAZDA DEALERSHIP I HAD PURCHASED THE VEHICLE FROM.  IT TOOK OVER A WEEK FOR MAZDA SERVICE CENTER TO DETERMINE I HAD A FAULTY THROTTLE BODY, WHICH HAD CAUSED THESE PROBLEMS AND THIS WAS WHAT NEEDED REPLACEMENT. IMPORTANTLY, THE SERVICE TECHNICIAN INDICATED THAT THE WARNING LIGHTS INDICATING PROBLEMS WITH THIS NEW MAZDA WERE KNOWN PREVIOUSLY BY THE ORIGINAL MAZDA DEALER BEFORE THE SALE TRANSACTION WAS COMPLETED: PRIOR TO THE VEHICLE'S ARRIVAL FOR SERVICE AT MAZDA SERVICE CENTER, THE WARNING LIGHTS AND MALFUNCTION CODES WERE PREVIOUSLY CLEARED BY THE MAZDA DEALER, RATHER THAN ADDRESSING THE ISSUE OR RESOLVING IT. THIS IS FRAUD AND CORPORATE MALFEASANCE ON THE PART OF THE MAZDA DEALERSHIP.",
        "vin": "3MZBN1L33JM"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": true,
        "dateComplaintFiled": "03/26/2019",
        "dateOfIncident": "02/14/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 1,
        "numberOfInjuries": 2,
        "odiNumber": 11191637,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 2/14/19 BETWEEN 2:30 AND 3 P.M., MY MOTHER (MELISSA DODSON) WAS INVOLVED IN A FATAL CAR ACCIDENT WITH ANOTHER VEHICLE (A 2004 GMC ENVOY) THAT RESULTED IN BEING DOA. SHE WAS DRIVING A 2018 MAZDA MAZDA3 SPORT FOUR DR AND TRAVELING WESTBOUND ON EAST HANOVER RD IN GRAHAM, NC AT THE TIME OF THE ACCIDENT. ACCORDING TO THE UNSUBSTANTIATED POLICE REPORT, IT STATED THAT MY MOTHER'S CAR VEERED/CROSSED THE DOUBLE YELLOW LINE BEFORE IMPACT. HOWEVER, THE ENVOY WAS  REPORTEDLY DOING 55 MPH UPON ENTERING THE \"S\" CURVE SECTION OF THE NARROW 35 MPH TWO-LANE ROAD (WHICH CONTRIBUTED TO THE CRASH). IN MY MUST HUMBLING OPINION, I HAVE REASONS TO BELIEVE THAT THERE IS MORE TO THE ACCIDENT CAUSING MY MOTHER'S DEATH THAT GRAHAM POLICE IS NOT INVESTIGATING OR HAS NOT INVESTIGATED. WHAT I MEAN IS THAT I HAVE REASONS TO BELIEVE THAT THERE IS STILL AN OPEN RECALL ON THE MAKE AND MODEL VEHICLE THAT MY MOTHER PURCHASED (LESS THAN A MONTH BEFORE THE ACCIDENT); HOWEVER, I PERSONALLY FEEL THIS CONCERN IS NOT BEING TAKEN SERIOUSLY. ENCLOSED I HAVE PROVIDED A COPY OF (IN MY OPINION) INCOMPLETE POLICE REPORT AND PICTURES OF MY MOTHER'S WRECKED VEHICLE AND ALSO I HAVE A LINK TO THE NEWSPAPER COVERAGE OF THE ACCIDENT SITE TOO!    HTTPS://WWW.THETIMESNEWS.COM/NEWS/20190215/BURLINGTON-WOMAN-KILLED-IN-THURSDAY-WRECK-POLICE-STILL-INVESTIGATING-CAUSE",
        "vin": "3MZBN1U77JM"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "03/14/2019",
        "dateOfIncident": "03/12/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186935,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "COMING OFF THE BQE IN NYC, ON A SHARP TURN EXIT RAMP LOST STEERING CONTROL. THE CAR VEERED SHARPLY TO THE LEFT INTO THE BARRIER CAUSING ALL THE SIDE AIRBAGS TO DEPLOY. LUCKY IT WAS AT A LOW SPEED SO NOBODY WAS HURT AND VERY MINOR BODY DAMAGE CAUSED. I HAD MY SON IN THE CAR, THE AIRBAG SAVED HIM FROM HITTING HIS HEAD  INTO THE WINDOW. THE TOWTRUCK DRIVER SAID IT LOOKED AS IF THE STEERING FAILED BECAUSE THE STEERING COLOM DETACHED.",
        "vin": "3MZBN1U7XJM"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "02/21/2019",
        "dateOfIncident": "01/24/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181686,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WAS BEING DRIVEN BY MY WIFE IN THE RIGHT LANE ON 3 LANE WIDE I-95 SOUTH IN CONNECTICUT AT NORMAL HIGHWAY SPEEDS, APPX 55-60 MPH. ACCORDING TO HER, THE CAR LURCHED LEFT AT ALMOST 90 DEGREES AND IT WAS AS IF SHE HAD NO CONTROL OVER THE STEERING AND THE WHEEL WAS NOT TURNING LIKE NORMAL POWER STEERING TURNS THE WHEEL. SHE CROSSED OVER ALL THREE LANES, AND IT CRASHED INTO THE CENTER DIVIDER SO THAT THE LEFT DRIVER'S SIDE WAS DAMAGED FROM FRONT TO BACK. SHE SAID IT WAS AS IF SHE HAD NO STEERING CONTROL AT ALL. FORTUNATELY SHE WAS NOT INJURED. BUT THE UNEXPLAINED LOSS OF STEERING CONTROL SOUNDED LIKE THE PROBLEM EARLIER WITH THE TOYOTA. IF YOU HAVE RECEIVED ANY OTHER COMPLAINTS LIKE THIS, THEN THERE COULD BE A REAL PROBLEM. .",
        "vin": "3MZBN1V39JM"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/26/2019",
        "dateOfIncident": "01/25/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11172322,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 1/25/2019 IN THE MORNING I WENT OUTSIDE TO TAKE MY DOG OUT AND NOTICED THAT THE SUNROOF ON MY 2018 MAZDA 3 WAS CRACKED AND HAD A FAIRLY LARGE HOLE IN IT. THE CAR HAD BEEN PARKED ON MY STREET OUTSIDE MY HOME OVER NIGHT.     AT FIRST I THOUGHT IT MAY HAVE POSSIBLY BEEN FROM SOMEONE TRYING TO BREAK INTO MY CAR. HOWEVER, UPON FURTHER INVESTIGATION I NOTICED THAT THE GLASS WAS ACTUALLY BUBBLED UP AND AWAY FROM THE INSIDE OF THE CAR AND NOT INWARDS. BASED ON THIS I WAS ABLE TO RULE OUT SOMEONE STRIKING THE GLASS WITH FORCE FROM THE OUTSIDE OF THE CAR. I BELIEVE THE GLASS TO HAVE BEEN DEFECTIVE AS THE CAR WAS PARKED AND NOT IN USE WHILE THIS INCIDENT HAD HAPPENED.",
        "vin": "3MZBN1W35JM"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": true,
        "dateComplaintFiled": "09/25/2018",
        "dateOfIncident": "09/13/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11131123,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEPTEMBER 13TH, 2018, I WAS DRIVING OUT OF THE STATE, DURING A ROAD TRIP ON MY WAY FROM CANNON BEACH TO PORTLAND IN THE STATE OF OREGON AROUND 9PM, I WAS DRIVING MY 2018 MAZDA 3 ON NORTH OF HIGHWAY I-5 WHEN RAIN BEGAN DURING RUSH TRAFFIC. I HAD THE AUTOMATIC FRONT WIPERS ON AND THEY BEGAN PERFORMING THEIR FUNCTION FOR ABOUT 3 MINUTES WHEN ALL OF A SUDDEN THEY WENT OFF. RAIN GOT HEAVIER AND EVEN AFTER TRYING TO ACTUATE THE WIPER LEVER TO HIGH SPEED, THE FRONT WIPERS FAILED TO START WORKING AGAIN. I WAS IN THE MIDDLE LANE OF A THREE-WAY ROAD AND WAS HAVING A HARD TIME TRYING TO SEE THROUGH TO GO STOP AND PARK IN A SHOULDER. TRAFFIC BEGAN TO SLOW DOWN AND I COULD BARELY SEE THROUGH THE WINDSHIELD. I TURNED ON THE EMERGENCY LIGHTS AND BEGAN HONKING TO TRY TO STOP IN THE LEFT SHOULDER. HOWEVER, TRAFFIC SUDDENLY BEGAN TO STOP AND I HAD TO HARD BRAKE BEFORE CRASHING INTO A TRUCK IN FRONT OF ME, BUT ANOTHER TRUCK MANAGED TO BARELY EVADE ME HOWEVER IT DID SCRAPE ME AND THE REAR OF THE CAR, I COULD NOT SEE THE LICENSE PLATE OF THE TRUCK DUE TO THE WIPERS NOT WORKING DURING THE DOWNPOUR.  I HAD TO WAIT ON THE SHOULDER UNTIL THE RAIN STOPPED, TRIED CALLING ROADSIDE ASSISTANCE BUT THE RAIN EASED. THE REAR BUMPER OF THE VEHICLE GOT DAMAGED BECAUSE OF THE WIPERS FAILURE, HOWEVER THE SAFETY CONCERN COULD HAVE BEEN WORSE SUCH AS THE VEHICLE GETTING ME INTO MAJOR ACCIDENT WHERE MORE THAN ONE CAUSALITY COULD HAVE OCCURRED. OTHER THAN THAT, THE TIME WASTED DURING MY VACATIONS AND RESOURCES TO PUSH HOTEL STAYS IS MINIMAL YET TO BE ACCOUNTED FOR. BUT NOW THE DISTRESS OF THE INCIDENTS HAS LED TO MENTAL REPERCUSSIONS.",
        "vin": "3MZBN1M30JM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/30/2018",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114662,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "PLEASE HELP ME I HAD PURCHASED A VEHICLE FROM OURISMAN MAZDA IN LAUREL MD.  EVER SINCE I PURCHASED IT I HAD AN ACCELERATION PROBLEM THEY HAD TOLD ME THAT AS LONG AS THE ENGINE LIGHT DOESN'T COME ON ITS HOW IT WAS DESIGN. WELL IT KEEPS THE SAME SPEED AND RPM WHEN YOU LET OFF THE ACCELERATOR. I GUESS YOUR AGENCY HAS CONTACTED MAZDAUSA FROM MY LAST EMAIL. THIS TIME THEY TOLD ME THAT I HAD PURCHASED A 2016 AND ALL ABOUT THE WARRANTY. I HAD PURCHASED A 2018 MAZDA 3 SPORT SEDAN. VIN : (XXXX). I HAD BEEN TOLD BY A MECHANIC THAT WORKED AT A DEALER THAT THEY HAD OTHER COMPLAINTS OF THIS PROBLEM. WHEN I TOOK MY CAR TO THE DEALER I HAD LET THE LEAD MECHANIC DRIVE MY CAR AND HE SAID LOOK IT KEEPS THE SAME SPEED (AFTER HE TOOK HIS FOOT OF THE ACCELERATOR)  I TOLD HIM ITS NOT CRUSE CONTROL. HE THEN SAID THAT'S HOW IT WAS DESIGN. I BELIEVE IT'S IS A SAFETY HAZARD.  THANK YOU FOR YOUR TIME.  (XXXXX)      PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "3MZBN1U77JM"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/16/2018",
        "dateOfIncident": "11/04/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111681,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I LET OFF OF THE ACCELERATOR IT STILL MAINTAINS THE SPEED IT WAS GOING BEFORE I LET OFF THE ACCELERATOR. THE DEALER TOLD ME THAT'S HOW ITS DESIGN. HE EVEN TOOK IT FOR A RIDE AND SAID SEE IT STILL KEEPS THE SPEED I SAID ITS NOT CRUISE CONTROL. I HAD CONTACTED THE DEALER AND MAZDAUSA. MAZDAUSA IGNORES ME. I JUST NEED TO GET THIS FIXED BEFORE SOMEONE GETS HURT. WHEN I GO TO PASS IT STAYS FOR A WHILE AT THE SPEED I HIT BEFORE I RELEASE THE ACCELERATOR.",
        "vin": "3MZBN1U77JM"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/14/2018",
        "dateOfIncident": "05/12/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093764,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A VERY QUIET BOULEVARD IN NIAGARA FALLS, NY. I WAS THERE ON A FAMILY TRIP WHEN ALL OF THE SUDDEN WE HEARD MULTIPLE VERY LOUD NOISES COMING FROM THE TOP OF OUR CAR, ESPECIALLY THE LAST ONE WHICH SOUNDED LIKE AN EXPLOSION. THE SUNROOF OR OUR 6-MONTH OLD 2018 MAZDA 3 HAD JUST EXPLODED! WE PARKED TO CHECK WHETHER AN OBJECT HAD FALLEN INTO THE CAR BUT COULD NOT FIND ANYTHING, THANKFULLY THE INSIDE SUNROOF BLIND WAS SHUT BECAUSE MANY OF US COULD HAVE GOTTEN INJURED FROM GLASS PIECES FLYING EVERYWHERE INSIDE THE CAR OTHERWISE.     NOW, TWO DAYS AFTER THE INCIDENT, OUR MAZDA DEALERSHIP IS CLAIMING THAT AN OBJECT MUST HAVE HIT THE CAR AND SAY THAT WE NEED TO SPEAK TO OUR INSURANCE. THEY DO NOT WANT TO DO ANYTHING ABOUT IT WHEN IT IS VERY CLEAR THAT IT IS A MANUFACTURING PROBLEM THAT COULD GET OTHER PEOPLE INJURED IN THE FUTURE. ONE OF THE REASONS I AM ABSOLUTELY POSITIVE THAT THIS IS A MANUFACTURING ISSUE IS BECAUSE WE HEARD ANOTHER VERY LOUD NOISE AND THE HOLE GOT SUBSTANTIALLY BIGGER WHILE PASSING BY THE SAME BOULEVARD LATER THAT NIGHT, MY WIFE LOST CONTROL OF THE CAR FOR A MOMENT AS IT HAPPENED. THIS IS A VERY SERIOUS AND SCARY SITUATION, WE HAVE SPOKEN WITH MAZDA CUSTOMER EXPERIENCE AS WELL AS WITH THE DEALERSHIP AND NOBODY WANTS TO TAKE RESPONSIBILITY EVEN WHEN THERE IS A CONSUMER REPORTS ARTICLE ON THIS AND 9 DIFFERENT REPORTS ON THIS ISSUE FOR MAZDA3 VEHICLES.",
        "vin": "3MZBN1V38JM"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "05/13/2018",
        "dateOfIncident": "05/01/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093549,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADRESTS TIP TOO FAR FORWARD.  THEY CAUSE GREAT PAIN TO THE NECK, SHOULDERS AND BACK.  PEOPLE HAVE RESULTED IN REMOVING THE HEADRESTS ALTOGETHER.  IF THE VEHICLE CAUSES A PERSON PAIN, THEN THE VEHICLE IS NOT SAFE.",
        "vin": "3MZBN1U79JM"
    }
]