[
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "01/15/2022",
        "dateOfIncident": "12/15/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447574,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AEB system malfunction around 25000 miles. Dealer diagnose as the front radar failed and cause the cruise control not available.",
        "vin": "1N4AZ1CP6JC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/11/2021",
        "dateOfIncident": "10/11/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11436355,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Steering wheel paint chipping causes multiple lacerations on finger during turn",
        "vin": "1N4AZ1CP4JC"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "08/19/2021",
        "dateOfIncident": "08/13/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429682,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2 incidents have occurred with this vehicle.  The first earlier this year (2021) is that upon slowly accelerating to move closer to vehicle that moved up in a turn lane, the automatic emergency brake system engaged, abruptly stopped the vehicle and many lights lit up across the dashboard.  The brakes then released and all lights on the dashboard disappeared.  I was not close enough to the car ahead or at any rate of speed that should have caused this abrupt brake reaction. The 2nd incident and most dangerous happened on 8/13/21.  I was slowly reversing out of a parking spot at a crowded location, when I saw a car behind my vehicle.  I went to brake (not hard brake just regular), and the brakes did not work.  I continued to slowly roll back towards the car behind me.  I tried pressing the brakes repeatedly and it would not stop rolling backwards.  I then pulled the emergency brake and the car came to a stop.  No lights appeared on the dashboard.  I turned the car off and powered it on again and slowly moved forward into the parking space and tried reversing again.  The car was driving completely fine just after.  I had a short trip home & didn't drive the rest of the evening.  I didn't charge the car as there was still 85% left on the battery.  The next morning, the car would not start and a message showing \"Service EV System No Power\" appeared on the dashboard with multiple lights lit. I called a tow truck to take it to the dealer and they found that the 12v battery was completely dead. Battery light not lit on dashboard prior to the complete outage.  The dealer said it was the 12v battery that was likely the cause of these incidents and they replaced it. The brake issues could not be reproduced at the dealer after the new battery installed.  Also note, that I just had the vehicle in for a multi-point inspection in June where nothing was found to be faulty.  They did recommend a brake fluid exchange, so this was done as well as tire rotation.",
        "vin": "1N4AZ1CP4JC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/06/2021",
        "dateOfIncident": "10/15/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415463,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD INITIATED A CLAIM SOMETIME LAST YEAR ABOUT THE B PILLAR PLASTIC DOOR TRIM POSSIBLY BEING DAMAGED FROM THE SUN'S REFLECTION. NISSAN USA REFERRED ME TO THE LOCAL DEALERSHIP SINCE THEY CANNOT HELP ME. THEY SAID THAT IT'S NOT A DEFECT AND WE WOULD HAVE TO PAY FOR ANY DAMAGES THAT NEEDED TO BE REPAIRED (ABOUT $1000).     I DON'T AGREE WITH THIS AS IT'S NOT AN UNCOMMON ISSUE FOR DOOR TRIMS TO MELT JUST LIKE IF THE HEAT FROM A HEAT GUN WAS APPLIED TO IT. THERE ARE QUITE A FEW PHOTOS ONLINE AND NOT JUST NISSAN. I HAVE NO CONTROL OVER WHERE THE SUN REFLECTS OR THE BUILDINGS THAT REFLECT THE SUN'S RAYS. I DON'T BELIEVE THAT I SHOULD BE HELD LIABLE FOR THIS, THE VEHICLE WAS USED AS INTENDED, AND THERE ARE NO INSTRUCTIONS ON THE MANUAL REGARDING THIS. THE CAR IS MELTING FROM THE SUN.",
        "vin": "1N4AZ1CP8JC"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/03/2021",
        "dateOfIncident": "02/03/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394518,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ALONE AT 4:20PM AT ABOUT 30 MPH, WITH NO OTHER CARS OR PEDESTRIANS AROUND WHEN THE BRAKES SUDDENLY ACTIVATED, AND THE ACCELERATOR WENT TO IDLE.  THE BRAKING LASTED ABOUT ONE SECOND AND DID NOT STOP THE CAR COMPLETELY.  THIS OCCURRED ON A CITY STREET.  THESE EVENTS HAVE BEEN HAPPENING SEVERAL TIMES A MONTH.",
        "vin": "1N4AZ1CP4JC"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/01/2021",
        "dateOfIncident": "01/14/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11391083,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING AT APPROX. 30 MPH ALONE ON A LOCAL HIGHWAY WITH NO TRAFFIC AROUND, NO PEDESTRIANS OR OBSTRUCTIONS IN THE ROAD, WHEN THE ACCELERATOR DISENGAGED AND THE BRAKES CAME ON. THE BRAKING ONLY LASTED ABOUT ONE TO TWO SECONDS AND DID NOT STOP THE CAR.  A TRIANGULAR WARNING SIGN APPEARED ON THE DASH DURING THE BRAKING, AND WENT OFF WHEN THE BRAKES RELEASED.  I BELIEVE THE PROBLEM IS A MALFUNCTION OF THE FORWARD COLLISION WARNING SYSTEM.",
        "vin": "1N4AZJCP4JC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/21/2021",
        "dateOfIncident": "01/17/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389170,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT DRIVER SIDE DOOR STARTED SAGGING AGAIN, SAME ISSUE AS PREVIOUSLY REPORTED UNDER # 11308649. TAKEN TO THE DEALER TODAY, THEY ADJUSTED THE \"DOOR STRIKER\". AS REPORTER PREVIOUSLY, THERE MAYBE A STRUCTURAL ISSUE WITH THE DOOR STRIKER BEING TOO FRAGILE OR TOO THIN.",
        "vin": "1N4AZ1CP7JC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/23/2020",
        "dateOfIncident": "06/21/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330412,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKUP CAMERA PERIODICALLY FAILS TO PRODUCE FEED, RESULTING IN BLACK SCREEN WHEN VEHICLE IS IN REVERSE (THOUGH BACKUP TURN GUIDANCE LINES STILL APPEAR).  SLAMMING TRUNK DOOR OR PRESSING ON THE CAMERA MODULE ITSELF SOMETIMES RESOLVES ISSUE BUT CAN ONLY BE DONE FROM OUTSIDE THE VEHICLE AND DOES NOT ALWAYS FIX THE ISSUE.  THIS IS SEPARATE FROM THE EXISTING RECALL IN REGARDS TO THE SOFTWARE ISSUE.  DEALERSHIP HAS INSPECTED VEHICLE AND NOT FOUND ANY WIRING ISSUES AND NOTED THAT THIS IS NOT RELATED TO THE SOFTWARE ISSUE IN THE EXISTING RECALL.  CANNOT RELIABLY REPRODUCE BUT SEEMS TO OCCUR ROUGHLY ONCE A MONTH OR MORE OFTEN.  POSSIBLY OCCURS FROM OPENING AND CLOSING TRUNK DOOR THOUGH ISSUE IS NOT NOTICED UNTIL NEXT TIME THE CAR IS OPERATED AND PUT IN REVERSE.  TURNING VEHICLE OFF AND THEN BACK ON DOES NOT RESOLVE ISSUE.    BACKUP CAMERA TURN GUIDANCE LINES CONTINUE TO APPEAR EVEN IF NO BACKUP CAMERA FEED APPEARS (BLACK SCREEN) WHICH SEEMS TO INDICATE AN ISSUE WITH THE CAMERA MODULE ITSELF RATHER THAN THE DISPLAY MODULE OR SOFTWARE.    THIS HAS BEEN AN ISSUE SINCE THE FIRST YEAR OF VEHICLE OWNERSHIP BUT HAVE NOT BEEN ABLE TO FIX/DIAGNOSE AS IT HAS NOT OCCURRED WHILE AT DEALERSHIP OR OTHER REPAIR FACILITY.  *TR",
        "vin": "1N4AZ1CP7JC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/07/2020",
        "dateOfIncident": "02/05/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316742,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS HAS OCCURRED MULTIPLE TIMES THROUGHOUT MY ALMOST TWO YEARS OF OWNERSHIP. THE NISSAN LEAF 2018 HAS A MODE CALLED \"E-PETAL\" THAT ALLOWS THE DRIVER TO OPERATE THE VEHICLE USING ONLY THE GAS PETAL. THE ISSUE I HAVE WITH MY CAR IS WHEN I AM IN A PARKING LOT TURNING MY STEERING WHEEL AS FAR TO THE LEFT OR RIGHT AS IT WILL GO TO NAVIGATE INTO THE PARKING SPACE, MY CAR WILL SUDDENLY STOP BRAKING CAUSING MY CAR TO RUSH FORWARD. I HAVE NEVER BEEN HURT, BUT THE SUDDEN SPEED INCREASE WHILE MAKING A HARD TURN WIPES MY CAR AND HAS CAUSED ME TO ALMOST HIT PARKED CARS. THE \"E-PETAL\" SHOULD CAUSE THE CAR TO BRAKE WHEN THE GAS PETAL IS DEPRESSED, BUT IT SEEMS TO DISENGAGE ENTIRELY WHEN I DO AS STATED ABOVE. I DON'T SEE ANY REASON TURNING THE WHEEL A CERTAIN WAY SHOULD CAUSE THE \"E-PETAL\" TO DISENGAGE. I DIDN'T KNOW IF I SHOULD REPORT THIS, BUT IT SEEMS LIKE I COULD REALLY HURT SOMEONE IF THIS HAPPENED WITH PEDESTRIANS AROUND. I AM UNSURE ABOUT THE EXACT MILEAGE, DATE, AND SPEED WHEN THE INDECENT OCCURRED BUT IT HAS HAPPENED MULTIPLE TIMES.",
        "vin": "1N4AZ1CP1JC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/12/2020",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308645,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONTROL PANEL TOUCHSCREEN DISPLAY IN THE NISSAN LEAF (2018) HAS A DENIAL OF SERVICE VULNERABILITY THAT CAN BE USED TO LOCK UP THE SCREEN. ONCE LOCKED, THE TOUCH SCREEN CAN NO LONGER BE USED EVEN IF THE CAR IS TURNED OFF AND ON. THE ONLY WAY TO UNLOCK THE SCREEN IS BY REMOVING AND RE-INSERTING THE SD CARD CONTAINING THE MAPPING DATA. THIS SEEMS TO ARISE FROM THE SOS FUNCTIONALITY LOCKING THE TOUCHSCREEN AND NOT TURNING OFF WHEN THE CAR DOES.    TO REPLICATE:  1. TURN ON THE CAR, VERIFY THAT NISSANCONNECT WITH SOS FUNCTIONALITY IS ENABLED BY CHECKING THAT THE LITTLE LIGHT ON THE SOS BUTTON IS LIT.  2. PRESS THE SOS BUTTON.  3. PRESS AND HOLD THE SOS BUTTON WHILE TURNING OFF THE CAR.  4. THE SOS CALL WILL LOCK THE SCREEN OF THE CAR, AND WILL STAY THAT WAY UNTIL THE SD CARD IS REMOVED AND RE-INSERTED.    TRIED REPORTING THIS TO NISSAN, NO RESPONSE.",
        "vin": "1N4AZ1CP7JC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/12/2020",
        "dateOfIncident": "02/07/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308649,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FRIDAY, 02/07/2020, THE FRONT DRIVER SIDE DOOR NO LONGER CLOSED CORRECTLY ON THIS CAR. THE CAR WAS TAKEN TO A NISSAN DEALER WHERE AN \"ADJUSTMENT\" WAS MADE. LATER THAT DAY, THE DOOR WOULD NO LONGER CLOSE AGAIN. ON MONDAY, 02/10/2020 THE CAR WAS TAKEN TO A NISSAN DEALER, AND ANOTHER ADJUSTMENT WAS MADE. THE DEALER ADVISED THAT \"NO WEIGHT\" SHOULD BE PUT ON THE DOOR EVEN THOUGH THIS HASN'T BEEN AN ISSUE BEFORE.    I BELIEVE THAT THERE MAYBE A MANUFACTURING DEFECT INHERENT IN THE HINGING MECHANISM OF THIS MODEL WHICH LEADS TO GRADUAL WEAKENING OF THE HINGE LEADING TO A DOOR NOT BEING ABLE TO CLOSE PROPERLY. THIS MAY BE RELATED TO AN EXISTING NHTSA ID #  10143486 (NTB18-042).",
        "vin": "1N4AZ1CP7JC"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/25/2020",
        "dateOfIncident": "01/12/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11301859,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS NISSAN LEAF HAS AN EZ-PEDAL FEATURE. WHEN ENABLED, TAKING YOUR FOOT OFF THE ACCELERATOR SLOWS YOU DOWN QUICKLY UNTIL YOU COME TO A FULL STOP. AND THEN THE CAR DOES NOT MOVE.  AND THIS NON-MOVEMENT DOES NOT REQUIRE DEPRESSING THE BRAKE.    WHILE A CONVENIENCE, THERE IS A DESIGN FLAW. WHEN ENABLED AND THE CAR IS STOPPED (BUT IN DRIVE), THE BRAKE LIGHTS DO NOT COME ONE. IN CONTRAST, WHEN STOPPED USING THE BRAKES, THE BRAKE LIGHTS  ARE ILLUMINATED.    THIS IS A SAFETY HAZARD!  DRIVERS APPROACHING FROM BEHIND DON'T EXPECT A STOPPED CAR  TO NOT HAVE BRAKE LIGHTS ON. THEY MAY REALIZE RATHER LATE THAT THE CAR IS STOPPED. IN OTHER WORDS, THE VISUAL CUE OF \"BRAKE LIGHTS ON MEANS CAR IS STOPPED OR SLOWING DOWN\" IS NOT EVIDENT. WHICH CAN LEAD TO MISTAKES BY DRIVERS WHO ARE NOT PAYING FULL ATTENTION.    THIS HAPPENED TO ME RECENTLY. I WAS STOPPED BEHIND A CAR WAITING AT A CROSSWALK. ON A 3 LANE 40MPH STREET,  WITH NO LIGHTS OR STOP SIGNS FOR  A MILE. A FAST STRETCH WITH NO EXPECTATION OF STOPPING!. I, IN MY LEAF, HAD EZ PEDAL ENABLED. I WORRIED THAT SOMEONE MIGHT HIT ME, SINCE I WAS STOPPED IN A PLACE THAT IS UNUSUAL TO STOP IN.  AND 15 SECONDS AFTER STOPPING I WAST REAR ENDED! NO PERSONAL DAMAGE, BUT $1500 IN REPAIR (AND MORE FOR THE CAR THAT HIT ME). SINCE I WAS NOT AT FAULT, I WILL GET FULL INSURANCE. BUT IT IS NOT A GOOD THING!    I CHECKED LATER - AND INDEED THE BRAKE LIGHTS DO NOT GO ON WHEN THE CAR IS STOPPED IN EZ-PEDAL MODE.    THIS NEEDS TO BE RESOLVED! I IMAGINE THIS IS A SOFTWARE UPDATE. I SUGGEST THAT FOR CARS (LEAF OR OTHER) IN DRIVE, WITH EZ-PEDAL ENABLED: WHEN THE CAR IS FULLY STOPPED THE BRAKE LIGHTS MUST GO ON. AND, WHEN THE CAR IS DECELERATING QUICKLY (WHEN YOU TAKE YOUR FOOT OF THE ACCELERATOR WHILE MOVING), THE BRAKE LIGHTS SHOULD GO ON.    THANKS. I COULD OF PUT ON MY EMERGENCY FLASHERS, BUT IT IS NOT EASY TO THINK OF SUCH A TRICK ON THE FLY.*DT*JB *DT*JB",
        "vin": "1N4AZ1CP7JC"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/04/2019",
        "dateOfIncident": "12/04/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286815,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "NISSAN PROPILOT HAS A SERIOUS SAFETY FLAW.  WHEN USING PROPILOT ON MY 2018 NISSAN LEAF SV IN STOP AND GO HIGHWAY TRAFFIC, SOMETIMES WHEN MY NISSAN LEAF COASTS TO AN ALMOST COMPLETE STOP 15 FEET BEHIND A \"BOXY\" VEHICLE LIKE A SEMI-TRUCK, THE LEAF SUDDENLY ACCELERATES LIKE IF THERE IS NO VEHICLE DIRECTLY IN FRONT OF ME AND IF I AM NOT COMPLETELY ATTENTIVE AND IF I DO NOT IMMEDIATELY APPLY THE BREAKS, THE NISSAN LEAF WOULD REAR END THE SEMI-TRUCK.  THIS HAS HAPPENED TO ME 4 TIMES OVER THE PAST 6 MONTHS WHEN FOLLOWING A SEMI-TRUCK WITH TRAILER AND THIS MORNING IT OCCURRED AGAIN A FIFTH TIME BUT THIS TIME I WAS BEHIND A SEDAN.  I HAVE A DASHCAM VIDEO OF THE INCIDENT FROM THIS MORNING.  I HAVE REPORTED THIS ISSUE TO NISSAN BUT THEY HAVE DONE NOTHING ABOUT IT.  I HAVE TAKEN MY 2018 NISSAN LEAF IN TO THE LOCAL NISSAN SERVICE CENTER BUT THEY SAY THERE IS NOTHING WRONG WITH THE SENSORS AND THEY DO NOT SEE ANY ISSUES AND NO ERROR CODES REPORTED BY THE CAR.  I BELIEVE THIS IS A SOFTWARE PROBLEM WHERE THE SOFTWARE IGNORES THE RADAR IMAGE OF THE TRUCK IN FRONT BECAUSE IT THINKS IT IS AN OVERHEAD SIGN AND NOT ANOTHER VEHICLE IMMEDIATELY IN FRONT, THE CAMERA INPUT OF THE VEHICLE IN FRONT ALSO APPEARS TO BE IGNORED BY THE SOFTWARE IN THIS SITUATION.  ADDITIONALLY, I HAVE HAD AT LEAST TWO INCIDENTS (ALSO OCCURRED  THIS MORNING) WHERE PROPILOT LANE KEEPING FEATURE SHUTS OFF AND AUTOMATIC EMERGENCY BREAKING IS ALSO SHUT OFF AND DEACTIVATED FOR AND EXTENDED PERIOD OF TIME FOR NOW APPARENT REASON (IN EXCELLENT WEATHER AND CLEAR CONDITIONS, NO OBSTRUCTIONS OF SENSORS, ETC.), I HAVE VIDEO OF THIS AS WELL.",
        "vin": "1N4AZ1CP6JC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/25/2019",
        "dateOfIncident": "11/25/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282306,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE STREET WE USE TO LEAVE OUR NEIGHBORHOOD, THERE IS ONE SECTION OF THE CEMENT THAT IS A LITTLE TALLER THAN THE ONE BEFORE IT.INTERMITTENTLY, THE AUTOMATIC BREAKING WILL BE SET OFF IN THIS SPOT FOR NO REASON. IT IS ALARMING! WE ARE ALSO WORRIED IT WILL HAPPEN ON A BUSY STREET AND CAUSE AN ACCIDENT.",
        "vin": "1N4AZ1CP9JC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/30/2019",
        "dateOfIncident": "05/18/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240675,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 NISSAN LEAF. THE CONTACT STATED THAT THEIR SPOUSE WAS DRIVING THE FAMILY VEHICLE AND WAS ABOUT TO COME TO A STOP WHEN ANOTHER VEHICLE CRASHED INTO THE CONTACT'S SPOUSE FROM THE REAR. THEY ATTEMPTED TO BRAKE HOWEVER, THE VEHICLE SLID UNTIL IT HIT CURB. THE AIR BAGS DID NOT DEPLOY. THE CONTACT'S SPOUSE WAS NOT INJURED. THERE WAS KNOW ONE ELSE IN THE VEHICLE WITH THE CONTACT'S SPOUSE. THE PERSON THAT CRASHED INTO THE REAR OF THE CONTACT'S SPOUSE WAS NOT INJURED. THEIR WAS NO MEDICAL ATTENTION NEEDED. A POLICE REPORT WAS FILED. THE VEHICLE WAS DEEMED TOTALED BY THE INSURANCE COMPANY. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 13,000.",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/08/2019",
        "dateOfIncident": "07/07/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230120,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2018",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN NORTH AMERICA",
                "productMake": "MICHELIN GREEN X",
                "productModel": "RADIAL X",
                "productYear": "9999",
                "size": "P225/65R17",
                "type": "Tire"
            }
        ],
        "summary": "GROOVED ROAD SURFACE IN COMBINATION WITH SPECIFIC VEHICLES GIVE DRIVERS THE FEELING OF LOSING CONTROL OF THEIR VEHICLES AT FREEWAY SPEEDS. SPECIFICALLY, THE GROOVED SURFACE OF WASHINGTON STATE ROUTE 520 EVERGREEN POINT FLOATING BRIDGE (REGULAR SPEED OF 60 MPH) IN COMBINATION WITH CURRENT MODEL NISSAN LEAF, ARE LEADING TO SIGNIFICANT \"GROOVE WANDER\" WITH HEAVY SHAKING TO THE LEFT AND RIGHT. THE RAPID ONSET OF SUCH SHAKING UPON DRIVING ONTO THE BRIDGE AT 60 MPH IS GIVING DRIVERS A FEELING OF LOSING CONTROL OF THEIR VEHICLES. THIS EFFECT DOES NOT GET BETTER EVEN WHEN REDUCING SPEED TO 40 MPH.THIS HAS BEEN GOING ON EVER SINCE THE NEW BRIDGE WAS OPENED OVER A YEAR AGO, AND IS MUCH WORSE THAN THE SIDE WINDS EXPERIENCED ON THE PREVIOUS BRIDGE. NISSAN DENIES BEING AWARE OF THIS ISSUE. AT MY WORKPLACE, MULTIPLE DRIVERS HAVE REPORTED THIS EFFECT, WHICH ALSO OCCURS ON A PAVEMENT TEST SEGMENT BETWEEN REDMOND WA AND WOODINVILLE WA (AVONDALE RD).",
        "vin": "1N4AZ1CP4JC"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/17/2019",
        "dateOfIncident": "05/12/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208166,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE, WITHOUT WARNING THE CAR STOPPED ITSELF SIMULATING A \"SLAMMING ON THE BRAKES\" AFFECT. THERE WAS NO WARNING, THE CAR JUST STOPPED. AFTER THE CAR STOPPED, AN ERROR APPEARED ON THE SCREEN SAYING \"POWER SUPPLY FAILURE. TO AVOID ACCIDENT, SERIOUS INJURY OR DEATH DO NOT DRIVE. CONTACT DEALER FOR SERVICE.\" THE CAR STOPPING SUDDENLY IS VERY DANGEROUS, IF THERE WAS ANOTHER CAR BEHIND ME, OR IF I WAS ON THE FREEWAY, I WOULD HAVE GOTTEN REAR ENDED.",
        "vin": "1N4AZ1CP4JC"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/03/2019",
        "dateOfIncident": "12/21/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164720,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE'S BLIND SPOT DETECTOR TURNS OFF AT LOW SPEEDS POTENTIALLY PUTTING THE DRIVER AT RISK IF THE DRIVER DEPENDS ON THE BLIND SPOT DETECTOR. THE COLLISION AVOIDANCE SYSTEM IS UNRELIABLE. WHEN THE CAR IN FRONT SWITCHES LANES AND THERE IS A STOPPED CAR IN FRONT THE VEHICLE STARTS TO SLOW DOWN BUT RELEASES THE BREAKS ABOUT 50 FT FROM THE STOPPED CAR AND STARTS WARNING OF IMPENDING COLLISION. AND THE BREAKS ARE NOT APPLIED.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/27/2018",
        "dateOfIncident": "10/24/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163616,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "NISSAN LEAF WITH PRO-PILOT ASSIST PACKAGE. INTERMITTENTLY THE SYSTEM WARNING LIGHT FOR AUTOMATIC FORWARD EMERGENCY BRAKING AND/OR LANE KEEP ASSIST WILL FLASH INDICATING SYSTEM UNAVAILABLE.  THIS HAS OCCURRED ON MULTIPLE OVASSIONS AND AT VARIOUS LOCATIONS.  DEALER HAS BEEN UNABLE TO ISOLATE CAUSE OR EFFECT REPAIR.    I ALSO HAD THIS HAPPEN ON A NISSAN SENTRA LOANER CAR THEY PROVIDED SO ISSUE MAY BE WITH SYSTEM AND NOT JUST THE LEAF MODELS",
        "vin": "1N4AZ1CP7JC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/23/2018",
        "dateOfIncident": "10/22/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142217,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS ISSUE OCCURS WITH THE NISSAN E-PEDAL ENGAGED/ENABLED. IT HAPPENS INTERMITTENTLY AFTER DRIVING OFF. SYMPTOM REGENERATIVE BREAKING/E-BRAKE DOES NOT ENGAGE. VEHICLE COASTS. NO BLUE BARS LIGHT UP ON THE DASH TO INDICATE THAT REGENERATIVE BREAKING IS ACTIVE. BREAK PEDAL HAS BE BE ENGAGED FOR IT TO STOP. I HAVE REPRODUCED IT SEVERAL TIMES USUALLY AFTER VEHICLE HAS BEEN PARKED FOR A LONG TIME. CHARGE LEVEL BETWEEN 30-80%. ISSUE HAS BEEN REPORTED TO DEALER (10/23/18). WAITING FOR A RESPONSE.",
        "vin": "1N4AZ1CP4JC"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "06/25/2018",
        "dateOfIncident": "05/15/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103747,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING FORWARD, THE VEHICLE SUDDENLY, UNEXPECTEDLY AND VIOLENTLY APPLIES THE BRAKES WITHOUT ANY DRIVER INPUT WHATSOEVER! THERE ARE NO OTHER VEHICLES OR PEDESTRIANS IN THE VICINITY AT THE TIME. THIS SUDDEN BRAKING PROBLEM BEGAN ON OR ABOUT 5/15/18 AND HAPPENED ON SEVERAL OCCASIONS AFTER THAT. TWICE WHILE ENTERING THE UNDERGROUND PARKING GARAGE AT AN OFFICE BUILDING AND TWICE WHILE DRIVING ON A CITY STREET. VEHICLE HAS BEEN AT THE LOCAL NISSAN DEALER FOR OVER A WEEK BUT NEITHER THE DEALERSHIP NOR THE MANUFACTURER APPARENTLY HAS ANY IDEA HOW TO FIX THE PROBLEM. THEY THINK THAT THERE IS A FAULT IN THE AUTOMATIC EMERGENCY BRAKING SYSTEM. THE SERVICE MANAGER TOLD ME THAT OTHER INSTANCES OF THE SAME ISSUE HAVE BEEN REPORTED TO NISSAN. THE SALESPERSON INDICATED THAT THERE WERE 4 OTHER SIMILAR CASES AT THEIR DEALERSHIP ALONE.THEY ALSO WILL NOT LET US TAKE THE VEHICLE HOME WITHOUT SIGNING A RELEASE OF LIABILITY DOCUMENT. THE OBVIOUS CONCERN IS THAT THE EMERGENCY BRAKING SYSTEM WILL AGAIN RANDOMLY ACTIVATE WHILE TRAVELING AT A HIGHER SPEED AND CAUSE AN ACCIDENT RESULTING IN SERIOUS PROPERTY DAMAGE AND INJURIES!",
        "vin": "1N4AZ1CP1JC"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "05/09/2018",
        "dateOfIncident": "04/14/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092604,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS NISSAN CAR IS EQUIPPED WITH FEATURES NAMED, PRO-PILOT ASSIST (PPA), INTELLIGENT CRUISE CONTROL (ICC) AND EMERGENCY BRAKE ASSIST (EBA). WHEN ENGAGED, IT IS SUPPOSED TO KEEP LANES AND FOLLOW DISTANCE IF THERE IS A CAR IN FRONT. WHEN THE CAR IN FRONT IS STOPPED THIS CAR IS SUPPOSED TO STOP AS WELL.     PPA WHEN ENGAGED, IF THERE ARE GOOD ROAD MARKINGS, WILL SHOW A GREEN STEARING ON THE DASH BOARD, TO SHOW THAT CAR CAN STEER IT SELF. HOWEVER IF THERE IS A CAR STOPPED IN FRONT ON THE SAME LANE (EX. STOPPED FOR A RED LIGHT), THIS CAR DO NOT DETECT THAT THERE IS A CAR STOPPED, AND KEEP GOING FORWARD UNTIL CRASH INTO THE STOPPED CAR, DRIVER HAVE TO INTEVENE TO STOP AT THIS TIME TO STOP. I TOOK CAR TO DEALER AND THEY SAID THIS IS NORMAL. THAT IS NOT WHAT NISSAN ADVERTISE.      THIS BEHAVIOR IS QUITE DANGEROUS OF THESE CARS, AND MY EXPECTATION IS THE CAR NEED TO STOP IF THERE IS AN OBSTRUCTION IN THE ROAD, WHEN THE GREEN STEERING WHEEL ON DASH IS SHOWING THAT CAR IS DOING AUTO-STEER.",
        "vin": "1N4AZ1CP0JC"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "05/08/2018",
        "dateOfIncident": "05/05/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092600,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE BRAKES ARE APPLIED MODERATELY AT AROUND 40MPH TO SLOW DOWN, AND IF A WHEEL GO ON TOP OF SOME BUMPS OR POT HOLES, CAR SEEMS TO LOOSE BRAKING POWER, BRAKE PADEL DROP ABOUT 1 INCH, HAVE TO PEDAL HARD TO GET THE BRAKES BACK. AT ONE TIME I SAW A MESSAGE ON DASHBOARD \"NOT AVAILABLE\" WHICH I WAS NOT ABLE TO READ AND CONFIRM, AS THIS HAPPENED IN A PANIC SITUATION. THIS IS OCCATIONAL BUT HAS HAPPENED TO BE 4 - 5 TIMES NOW.     MY GUESS IS CAR TRY TO APPLY REGENERATIVE BRAKES FIRST, IF THAT CANNOT WORK DUE TO EXCESSIVE, BUMP / POT-HOLE ON THE ROAD, IT GIVE UP, AND AS A RESULT, CAR LOOSE BRAKING POWER FOR 1-2 SECONDS. THIS 2 SECONDS CAN BE LIFE AND DEATH IN AN EMERGENCY BRAKING SITUATION. I TOOK THE CAR TO DEALER, AND THEY SAID, NO ISSUES FOUND. THIS PROBLEM IS HARD TO REPRODUCE, BUT CAN BE REPRODUCED.    THIS HAPPENED IN LOCAL ROADS WITH 45MPH SPEED LIMIT. ONE TIME WHEN THERE WAS ROUGH ROAD DUE TO CONSTRUCTION. ANOTHER TIME WHEN ONE TIRE WAS GOING ON TOP OF ROAD DIVIDERS WHICH ARE ABOUT 1 INCH TALL AND 1 FOOT APART, IT HAD MANY OF THESE NEXT TO EACH OTHER, WHEN I WAS APPLYING BRAKE.",
        "vin": "1N4AZ1CP0JC"
    }
]