[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/04/2022",
        "dateOfIncident": "02/01/2022",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455175,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Mitsubishi Outlander. The contact stated that the vehicle failed to start up right away. After waiting for a while, the vehicle started as needed. The contact stated that while driving at an undisclosed speed, the vehicle stalled. The contact stated that several warning lights were flickering while starting the vehicle. The contact called and notified the local dealer; however, the vehicle was not diagnosed or repaired. The contact related the failure to NHTSA Campaign Number: 17V609000 (Electrical System) however, the VIN was not included. The manufacturer was not contacted. The approximate failure mileage was 65,000.",
        "vin": "JA4AD3A31JZ"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/02/2022",
        "dateOfIncident": "02/28/2022",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454922,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I believe they said it was the cam broke a part .I was driving on a 4 lane highway going 70 my car made a horrible noise and then my car  it just shut down I was in the middle lane and thank God I was not hurt or hit by the semis going around me .then tried to order this part and cannot get it it's on backorder and they have no idea when it would be available  and so they checked the motor and I now have to replace the motor because of this breaking this was definitely a safety issue with my car just shutting down while driving it.",
        "vin": "JA4AZ3A3XJZ"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/23/2021",
        "dateOfIncident": "06/27/2020",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11437886,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving when a woman pulled out In front of me. I was going 49 mph and have the EDR report to prove so. (I was wearing my seatbelt). The front of my car smashed into the rear end of her car and I smashed the right side of my head into the steering wheel. I’ve sustained a traumatic brain injury, long term post concussion syndrome along with a page long list of injuries that I’m still dealing with. It’s been a little over a year and my injuries are just getting worse. Mitsubishi sent a guy out to read my Event Data Recorder with promises of giving me a copy of the report. After 6-7 months of them refusing me the report and telling me the air bags should not have went off i hires a lawyer to subpoena a copy of the report. It says the safety features failed. But here I am left with a car that’s totaled and injuries I will never recover from. I also did research and found out that my car was made in the same plant on the same line as the other 68,000 recalled 2018 outlanders. I can’t understand why mine wasn’t part of the recall?!?! It was made in between the dates as the other 68,000 that was recalled.",
        "vin": "Ja4az3a32jz"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/13/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428954,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Mitsubishi Outlander. The contact stated that the check engine warning light was illuminated. The contact took the vehicle to the dealer who stated that there was a code for leak in the fuel tank however, the mechanic was unable to determine the location of the failure. The vehicle was not repaired. The failure recurred four times. The manufacturer was not made aware of the failure. The approximate failure mileage was 40,000.",
        "vin": "ja4j24a5xjz"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/23/2021",
        "dateOfIncident": "07/14/2021",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426092,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Mitsubishi Outlander. The contact stated that the lower engine heat shield had cracked at the bolt inserts causing the shield to become unsecure. The cause of the failure was not yet determined. The vehicle was taken to the local dealer who diagnosed that the heat shield needed to be replaced. The vehicle was not yet repaired. The manufacturer was notified of the failure, but no assistance was offered. The failure mileage was 28,000.",
        "vin": "JA4J24A51JZ"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/20/2021",
        "dateOfIncident": "04/05/2021",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413095,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CRUSE CONTROL SHUTS OFF SAYING ACC NOT AVAILABLE DURING ROAD TRIPS.  THIS IS ON HIGHWAYS.  IT HAPPENED 5 TIMES DURING ROAD TRIP FROM MILWAUKEE, WISCONSIN TO WAUSAU WISCONSIN WHILE IN MOTION..  THIS HAPPENS EVERY TIME I USE THE CRUSE CONTROL. IT HAPPENED ON THE WAY TO WAUSAU AND ON THE WAY HOME  ROUND TRIP APX 600 MILES THIS TRIP",
        "vin": "JA4JZ4AX1JZ"
    },
    {
        "components": "ELECTRICAL SYSTEM,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "04/13/2021",
        "dateOfIncident": "09/26/2020",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407922,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS HAD EV SYSTEM SERVICE REQUIRED, BSW SERVICE REQUIRED, AND ASC SERVICE REQUIRED WARNING LIGHTS COME ON EVERY FEW DAYS SINCE SEPTEMBER.   WHEN THESE COME ON MULTIPLE SAFETY FEATURES OF THE VEHICLE ARE IMMEDIATELY DISABLED.   THE DEALER HAS BEEN UNABLE TO FIX THE ISSUE AFTER FIVE VISITS INCLUDING ONE WHERE THEY HAD THE VEHICLE FOR 65 DAYS.    PER THE MANU:    EV SYSTEM SERVICE REQUIRED: \"ONE OR MORE FAILURE IS OCCURRING IN THE PLUG-IN HYBRID EV SYSTEM.  HAVE YOUR VEHICLE INSPECTED BY A CERTIFIED MITSUBISHI EV DEALER\"    ASC SYSTEM SERVICE REQUIRED \"THERE IS A FAULT IN THE ACTIVE STABILITY CONTROL.   CONTACT A CERTIFIED MITSUBISHI EV DEALER TO HAVE THE SYSTEM CHECKED\"    BSW SERVICE REQUIRED \"THE BLIND SPOT WARNING (BSW) DOES NOT OPERATE NORMALLY BECAUSE THERE THERE ARE SOME MALFUNCTIONS IN THE SENSOR OR THE SYSTEM.  IMMEDIATELY HAVE YOUR VEHICLE INSPECTED AT A CERTIFIED MITSUBISHI EV DEALER\"   WHEN THE WARNING DISPLAY APPEARS THE BSW WILL BE DEACTIVATED.",
        "vin": "JA4J24A57JZ"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/03/2021",
        "dateOfIncident": "02/26/2021",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398831,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M HAVING TROUBLE WITH MY 4WD LIGHT IS STUCK BLINKING SINCE THE PAST WINTER WEATHER ALSO IT WILL NOT RESET ITSELF FROM SHOWING THE WHEEL IMAGE ON MY ODOMETER SCREEN. PLEASE HELP ME UNDERSTAND WHAT'S GOING ON.",
        "vin": "JA4AZ3A37JZ"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/13/2020",
        "dateOfIncident": "12/12/2020",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383195,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IN A PARKING LOT AND SLOWED DOWN BECAUSE OF A BUMP THE CAR IMMEDIATELY DIED AS SOON AS I PASSED THE BUMP WITH NO ENGINE LIGHT ERRORS. THE BATTERY WAS CAR JUMP AND NOTHING HAPPENED. THE BATTERY WAS TESTED WITH VOLTAGE METER AND SAME ISSUE. WHEN YOU TURN ON THE CAR NOTHING HAPPENS, NO SOUND, NO CRANKS, NO ENGINE LIGHT. I HAD THE CAR TOWED AT HOME.  THIS IS A SAFETY ISSUE AND VERY CONCERNING. THE CAR IS 2018 OUTLANDER ES AND HAVE 34K MILES.",
        "vin": "JA4AZ3A38JZ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/24/2020",
        "dateOfIncident": "10/24/2020",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376171,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUNROOF GLASS EXPLODED OUT OF OUR CAR WHILE WE WERE DRIVING ON THE FREEWAY IN IDAHO. THE SUNROOF WAS CLOSED BECAUSE IT HAD BEEN RAINING AND IT WAS COLD. MITSUBISHI HAD A SIMILAR PROBLEM WITH SUNROOF GLASS DETACHING IN OUTLANDERS FROM 2007-2010. WHEN WE CONTACTED MITSUBISHI THEY INFORMED US THAT THE GLASS FLYING OUT OF OUR SUNROOF WAS NOT A SAFETY PROBLEM OR A MANUFACTURER'S DEFECT EVEN THOUGH IT WAS RULED AS SUCH IN PREVIOUS YEARS.",
        "vin": "JA4AD3A33JZ"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/17/2020",
        "dateOfIncident": "10/12/2020",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364788,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHIN 10,000 MILES OF OWNING MY NEW CAR I NOTICED IT WOULD RANDOMLY STALL SOMETIMES AT THE STOP LIGHT OF AN INTERSECTION. IT DOESN'T TAKE LONG TO START BACK UP. OTHER TIMES MY CAR STRUGGLES TO START ALL TOGETHER. I'LL TURN THE KEY 2-3 TIMES BEFORE IT STARTS. SEVERAL MONTHS WENT BY WHERE THE ISSUE WAS NO LONGER PRESENT BUT OVER THE PAST MONTH IT STARTED AGAIN. LIKELY RELATED TO THE WHETHER NOW THAT WINTER IS NEAR. FINALLY MY EBRAKE HAS NEVER WORKED SINCE I BOUGHT THE CAR IN EARLY 2019 WITH 21K MILES.",
        "vin": "JA4AD2A34JZ"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/09/2020",
        "dateOfIncident": "10/09/2020",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363636,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE REPLACED THE LOWBEAM HEADLIGHTS 7 TIMES IN THE PAST YEAR. I DONT REALIZE THEY ARE OUT UNTIL SOMEONE OR THE POLICE TELL ME. THIS IS A SAFETY PROBLEM.",
        "vin": "JA4AZ3A33JJ"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/04/2020",
        "dateOfIncident": "05/06/2020",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11327258,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 MITSUBISHI OUTLANDER. THE CONTACT CALLED ON BEHALF OF THE DRIVER HIS DAUGHTER. THE CONTACT STATED THAT WHILE HIS DAUGHTER WAS AT A COMPLETE STOP, A VEHICLE DRIVING AT 50 MPH FAILED TO STOP AND CRASHED INTO THE CONTACT REAR REMOVING THE VEHICLE REAR BUMPER, AND TAIL LIGHTS, THE DRIVER PROCEEDED TO SPIN THE CONTACT VEHICLE IN A CIRCLE, AND PUSHED THE CONTACT VEHICLE INTO THE VEHICLE IN FRONT. THE DRIVER AIR BAG, PASSENGER FRONT AIR BAG, THE STEERING AIR BAG, THE SIDE AIR BAGS FAILED TO DEPLOY. THE DRIVER HEAD HIT THE STEERING WHEEL, DRIVER SUSTAINED DISK, INJURY, HEAD TRAUMA, CONCUSSION, EARS RINGING, MEMORY LOST, NECK, BACK INJURY, CAN NOT LOOK INTO BRIGHT LIGHT. THE PASSENGER SUSTAINED HEAD TRAUMA, NECK, BACK, KNEES INJURIES. THE READ OAK POLICE DEPARTMENT WAS PRESENT, THE VEHICLE WAS TOWED TO A COLLISION SHOP. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE APPROXIMATE FAILURE MILEAGE WAS 53,000. *LN*DT*JB    CONSUMER STATED THERE WAS NO DEPLOYMENT OF THE AIRBAGS.*JB",
        "vin": "JA4AD3A36JZ"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/28/2020",
        "dateOfIncident": "10/30/2019",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302439,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CRUISE CONTROL (ACC) DISENGAGES ON ITS OWN  WITHOUT ANY NOTICE WHEN TRAVELING ON THE ROAD. OTHER TIMES WITHOUT ANY PROMPTING IT FLASHES THAT THE ACC NEEDS SERVICING.",
        "vin": "JA4JZ4AXXJZ"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/21/2019",
        "dateOfIncident": "10/17/2019",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281588,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING AT HIGHWAY SPEEDS AND JUST TOPPED A HILL WITHOUT ANY OTHER VEHICLES AROUND, NO OVERPASSES, NO ONE ON THE SIDE ROADS, ETC. WHEN THE SUNROOF SPONTANEOUSLY EXPLODED. HAD BEEN DRIVING FOR ABOUT 20 MINUTES WITHOUT ANY INCIDENTS BEFORE THIS HAPPENED. NOT ONLY DID THE GLASS BLOW OUT BUT THE SHARDS LEFT HUNDREDS OF SCRATCHES TO THE PAINT ON THE ROOF BAD ENOUGH TO NEED TO BE REPAINTED. WHEN IT HAPPENED THE SOUND OF THE GLASS EXPLODING WAS EXTREMELY LOUD. THAT MORNING WAS THE FIRST MORNING WE HAD FROST ON THE VEHICLES SINCE WE BOUGHT IT NEW.",
        "vin": "JA4AZ3A39JZ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/06/2019",
        "dateOfIncident": "11/03/2019",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278513,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY CAR JULY 31, 2018, 0 MILES VEHICLE MITSUBISHI OUTLANDER GT 2018. I HAVE NOTICE DANGEROUS CONDITION ON THE BREAK SYSTEM.     - FIRST OF ALL, WHEN THE VEHICLE WAS ABOUT 6 MONTH OF USE THE REAR BREAK START TO SOUND. WHEN I TAKE MY VEHICLE TO THE MITSUBISHI SERVICE DEPARTMENT AND THE REAR BREAK PADS WAS WORN OUT WITH ONLY 12,000 MILES. THEY CLAIM THAT IS MY DRIVING HABITS WAS WHAT CAUSES THE PREMATURE WORN OF THE BREAK PAD. I TOLD THEM THAT MY LAST CAR I CHANGE REAR BREAK PAD AT 60,000 MILES WITH THE SAME DRIVING HABITS THEY ALLEGED. AT THE END, I PAY FOR THE PADS AND THE WARRANTY PAY FOR THE DISK REPAIR AND INSTALLATION.    - SECOND, I HAD AN EXPERIENCE IN A SUDDEN STOP THAT THE ABS SYSTEM DID NOT RESPOND PROPERLY AND MY CAR SLIDE THROUGH THE PAVEMENT UNTIL STOP. FORTUNATELY I HAD ENOUGH SPACE TO STOP WITHOUT CAUSING AN ACCIDENT. I HAVEN'T HAD ANY OTHER INCIDENT AND I CAN'T TELL IF THE PROBLEM PERSIST.    - THIRD, RECENTLY I TAKE MY VEHICLE TO ANOTHER MITSUBISHI SERVICE DEPARTMENT BECAUSE OF A NOISE ON THE REAR BREAKS. THE TECHNICIAN INDICATE THAT THE BREAK PADS ARE WORN OUT AND THE CALIPER RUBBER PROTECTOR IS BROKEN. MY VEHICLE ONLY HAVE ONE YEAR OF USE AND 25,000 MILES.    MY BIG CONCERN IS WITH THE ABS SYSTEM THAT DID NOT RESPONDED PROPERLY AND I DON'T HAVE THE TECHNICAL KNOWLEDGE TO DETERMINE IF THE ABS PROBLEM HAVE SOMETHING TO DO WITH THE PREMATURE WORN OUT OF THE REAR BREAK PADS.    IF YOU NEED ADDITIONAL INFORMATION, PLEASE LET ME KNOW.",
        "vin": "JA4JZ4AX2JZ"
    },
    {
        "components": "ELECTRICAL SYSTEM,WHEELS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/06/2019",
        "dateOfIncident": "07/05/2019",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229722,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "8 RECALLS ON BRAKES. ELECTRICAL. WHEELS. COLLISION. STABILITY. EMERGENCY BRAKING. ANTILOCK BRAKES. HYDRAULICS.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/01/2019",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217306,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN REVERSING THE VEHICLE IF YOU SWITCH IT INTO DRIVE TO FAST THE VEHICLE COMPLETELY STALLS OUT, REQUIRING YOU TO PUT THE VEHICLE IN PARK, SHUT IT OFF, RESTART THE VEHICLE THEN GO. THIS IS COMPLETELY DANGEROUS. IT IS AN ACCIDENT WAITING TO HAPPEN AND SHOULD NOT BE HAPPEN ON A BRAND NEW VEHICLE. THIS HAS BEEN HAPPENING EVER SINCE I BOUGHT IT BRAND NEW WITH LESS THAN 50 MILES ON IT. THIS HAS HAPPENED TO ME PULLING OUT OF A PARKING SPACE AT A LOCAL GROCERY STORE, TO BACKING OUT OF MY DRIVEWAY TO TAKE THE KIDS TO SCHOOL.",
        "vin": "JA4AZ2A36JZ"
    },
    {
        "components": "AIR BAGS,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "04/19/2019",
        "dateOfIncident": "03/11/2019",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11202533,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MARCH 11 TH, MY OUTLANDER WAS UNABLE TO STOP AND HAD MINIMAL TRACTION IN ABOUT A QUARTER OF AN INCH OF SNOW CAUSING MY VEHICLE TO HIT A TREE HEAD ON. I WAS DRIVING UNDER 30 MILES AN HOUR WHEN THE ACCIDENT OCCURRED. AFTER HITTING THE TREE, THE STEERING WHEEL BEGAN TO SMOKE. I WAS ABLE TO EXIT THE VEHICLE AND TURNED AROUND TO SEE THE AIRBAG ONLY PARTIALLY DEPLOYED. FROM THERE, MY VEHICLE WAS DECLARED A TOTAL LOSS. NOW, AFTER REQUESTING MY INSURANCE COMPANY TO DEMAND A SAFETY INSPECTION FROM THE MITSUBISHI DEALERSHIP TO NO AVAIL, I'VE CONTACTED MITSUBISHI CORPORATE AND GAVE THEM MY ACCIDENT REPORT WITH HIGH CONCERN IN REGARDS TO THE RECALL #18V621. I HAVE OFFERED TO TOW MY OUTLANDER TO THE DEALERSHIP AND THEY HAVE RESPONDED TO MY CONCERN BY REFUSING TO EVALUATE AND INSPECT THIS VEHICLE. WHEN I LAST SPOKE TO MY CASE MANAGER AT MITSUBISHI CORPORATE, SHE LET ME KNOW THERE IS NOTHING THEY WILL DO. I HAVE CALLED THE NASHUA NH DEALERSHIP TO MAKE AN APPOINTMENT FOR SAFETY INSPECTION OF THIS RECALL AND THEY HAVE REFUSED TO HAVE THE SERVICE DEPARTMENT INVESTIGATE. TODAY, I HAVE BEEN TOLD UPON TOWING MY VEHICLE THERE THAT THEY REFUSED DELIVERY OF THE OUTLANDER. I HAVE NOT AGREED TO THE SETTLEMENT OFFERED BY MY INSURANCE AND CONTINUE TO SEEK MEANS OF HAVING THIS VEHICLE INSPECTED FOR THE RECALL WHICH I'M CERTAIN CAUSED MY ACCIDENT.  CORPORATE DID STATE THAT IF I SUBROGATE THAN THEY MAY BE ABLE TO DIAGNOSE MY DEFECTIVE VEHICLE. AS OF TODAY, I'M IN THE PROCESS OF GATHERING DOCUMENTS.",
        "vin": "JA4AZ3A32JZ"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "03/29/2019",
        "dateOfIncident": "03/11/2019",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11192398,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2018 MITSUBISHI OUTLANDER. THE CONTACT STATED THAT THE VEHICLE EXPERIENCED THE SAME FAILURE AS LISTED IN NHTSA CAMPAIGN NUMBER: 18V621000 (FORWARD COLLISION AVOIDANCE, ELECTRONIC STABILITY CONTROL, SERVICE BRAKES, HYDRAULIC, ELECTRICAL SYSTEM). WHILE DRIVING 28 MPH, THE VEHICLE CRASHED INTO A TREE. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TOTALED AND TOWED FROM THE SCENE. A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED INJURIES, BUT DID NOT RECEIVE MEDICAL ATTENTION. THE DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 13,000.   *JS *JS",
        "vin": "JA4AZ3A32JZ"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/28/2019",
        "dateOfIncident": "03/28/2019",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192193,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVERS SEAT IS LOOSE AND WOBBLES. THE SEAT IS LOOSE AND WOBBLES BOTH WHEN THE VEHICLE IS IN MOTION AND WHEN THE VEHICLE IS STATIONARY. I TOOK THE BRAND NEW VEHICLE TO THE DEALERSHIP AND THEY SAID THAT THEY WERE TOLD BY MITSUBISHI NOT TO FIX AT THIS TIME. THEY ARE AWARE OF THIS AND ARE LOOKING FOR A WAY TO FIX IT.",
        "vin": "JA4AD32J058"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/07/2019",
        "dateOfIncident": "02/05/2019",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174920,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAD LIGHTS BURNED OUT 3 TIMES IN LESS THAN ONE YEAR. HEADLIGHTS HAVE A LIFE EXPECTANCY OF MORE THAN 1 YEAR.  NOT SURE IS STATIC BUILD UP AND SHOCK IS RELATED, BUT THAT IS ONGOING TOO.",
        "vin": "JA4AD3A32JZ"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/25/2019",
        "dateOfIncident": "01/19/2019",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11172109,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 MITSUBISHI OUTLANDER. THE CONTACT STATED THAT THE VEHICLE COULD NOT BE DRIVEN IN SNOW OR ICE. WHILE DRIVING IN THESE CONDITIONS, THE VEHICLE WOULD SHAKE VIOLENTLY. THE FAILURE OCCURRED WHEN THE SPEED REACHED 40 MPH. THE VEHICLE WAS TAKEN TO SUNNYSIDE MITSUBISHI (7630 PEARL RD, MIDDLEBURG HEIGHTS, OH 44130, (440) 243-7711) WHERE THE MECHANIC STATED THAT THE RIMS NEEDED TO BE WASHED OUT. THE DEALER ALSO SPRAYED THE RIMS WITH SILICON. THE VEHICLE WAS NOT DIAGNOSED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 2,000.   *TR",
        "vin": "JA4AR3AU4JU"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/27/2018",
        "dateOfIncident": "12/15/2018",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163712,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CITY STREET DRIVING AND A NOTIFICATION OF AIRBAG SYSTEM SERVICE REQUIRED APPEARED ON THE SCREEN.",
        "vin": "JA4AP3AU6JU"
    },
    {
        "components": "EXTERIOR LIGHTING,STRUCTURE,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "12/17/2018",
        "dateOfIncident": "12/17/2018",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162079,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "'TAKATA RECALL' I GOT INTO A THREE COLLISION ACCIDENT ON A CITY HIGHWAY. WHEN I WAS BRAKING TO AVOID THE ACCIDENT IT KEPT ON MOVING LIKE IT WAYS DELAYED. I BELIEVE THAT THE ACCIDENT COULD OF BEEN PREVENTABLE IF MY BRAKES WAS AWARE THAT MY FEET WAS ON IT. IT'S LIKE THE CAR WAS DOING IT'S OWN THING. THERE COULD BE MORE THINGS UNKNOWN GOING ON WITH THE CAR. I JUST BROUGHT THIS CAR 2 MONTHS AGO.",
        "vin": "JA4AD2A39JJ"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/18/2018",
        "dateOfIncident": "11/07/2018",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152282,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SECOND ROW MIDDLE SEAT BELT HAS A PROBLEM. IT ALWAYS SEIZES ONCE THE MIDDLE PASSENGER FASTENS IT AND THEN STARTS BEING MORE TIGHTER ON THE PASSENGER, THUS PRESSING ON THE CHEST CAUSING HIGH LEVEL OF DISCOMFORT.",
        "vin": "VIN JA4JZ4A"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "10/30/2018",
        "dateOfIncident": "07/01/2018",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144247,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER'S SIDE SEAT ROCKS BACK AND FORTH WHEN I ACCELERATE AND BRAKE. THIS BECAME EVIDENT DAYS AFTER I PURCHASED THE VEHICLE. THE DEALER TRIED TO FIX THE ISSUE BUT THEY DAMAGED THE VEHICLE EVEN MORE.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/02/2018",
        "dateOfIncident": "08/02/2018",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115337,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IF KEY IS HIT, THE CAR WILL SHUT OFF.",
        "vin": "JA4AD2A38JZ"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/26/2018",
        "dateOfIncident": "05/21/2018",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11113921,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.. I WAS INVOLVED IN A FRONT END COLLISION AND THE AIR BAGS DID NOT DEPLOY.  *TR",
        "vin": "JA4AD2A38JZ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "05/27/2018",
        "dateOfIncident": "05/27/2018",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11098228,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 27MAY2018, I STARTED MY 2018 MITSUBISHI OUTLANDER PHEV AND PUT IT IN REVERSE TO BACK OUT OF THE GARAGE. FOR THE FIRST TIME EVER, THE ALARM DINGED AND THE CAR WOULD NOT REVERSE.  MY CONSOLE INDICATED THE CHARGE CORD WAS STILL PLUGGED IN. SO I JUMPED OUT OF THE CAR TO UNPLUG THE CORD, NOT REALIZING THAT I NEVER PRESSED THE 'P' BUTTON TO PUT THE CAR IN PARK. I DIDN'T EVEN THINK TO PRESS THE 'P' BUTTON TO INITIATE PARK BECAUSE THE VEHICLE HAD NO MOTION. ANYWAY, I QUICKLY UNPLUGGED THE CHARGER, AND IMMEDIATELY THEREAFTER, THE CAR STARTED MOVING IN REVERSE, WHICH WAS THE LAST COMMAND THAT I HAD PLACED IT IN.  IN SHOCK, I RAN AROUND TO THE BACK OF THE CAR WITHOUT SHUTTING THE ELECTRIC RECEPTACLE DOOR AND WAS NEARLY RUN OVER BY THE VEHICLE WHILE TRYING TO STOP IT FROM ROLLING OUT OF MY GARAGE. LUCKILY, I MOVED OUT OF THE WAY QUICKLY ENOUGH, BACK AROUND THE DRIVER'S SIDE OF THE CAR, HOPPED INTO MY SEAT, AND HIT THE 'P' BUTTON TO PARK THE CAR.  HOWEVER, BEFORE THE CAR CAME TO A COMPLETE STOP, THE ELECTRIC RECEPTACLE DOOR I LEFT OPEN IN MY HASTE WAS HEAVILY DAMAGED BY THE VEHICLE REVERSING INTO THE SIDE OF MY GARAGE DOOR OPENING. OVERALL, THIS WAS A VERY DANGEROUS SITUATION THAT I FEEL WOULD NOT HAVE HAPPENED IN A CONVENTIONAL VEHICLE BECAUSE, IN A CONVENTIONAL VEHICLE, THE DRIVER, UPON REMOVING HIS OR HER FOOT FROM THE BRAKE, WOULD IMMEDIATELY NOTICE IF THE VEHICLE WAS ACTUALLY IN PARK OR REVERSE. IN CONTRAST, THE PHEV WAS IN A STANDBY STATE, WHICH APPEARED THE SAME AS PARK, THEREBY SIMULATING THE PERCEPTION OF BEING IN PARK EVEN THOUGH THE VEHICLE ACTUALLY WAS UNDER THE LAST COMMAND OF REVERSE.  UNFORTUNATELY, THIS INCIDENT HAS RESULTED IN SIGNIFICANT VEHICLE AND PROPERTY DAMAGE, NOT TO MENTION A HIGHLY DANGEROUS SITUATION.  I WOULD RECOMMEND THE 2018 MITSUBISHI OUTLANDER PHEV BE PROGRAMMED TO SHIFT TO PARK AUTOMATICALLY IF THE CHARGE CORD IS STILL PLUGGED IN.",
        "vin": "JA4J24A58JZ"
    }
]