[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/26/2020",
        "dateOfIncident": "01/26/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301923,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING ON HIGHWAYS OR BRIDGES FEB WARNING SIGN APPEARS WITH A MESSAGE (UNAVAILABLE :FRONT RADAR OBSTRUCTION) , NISSAN DEALERSHIP REPLACED THE SENSOR TWICE BUT IT KEEPS HAPPENING",
        "vin": "1N4AL3AP0JC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/21/2019",
        "dateOfIncident": "02/08/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11181492,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "NISSAN 370Z (TOTAL RIDE OF 10,000 KILOMETERS) PURCHASED FROM NISSAN KOREA (GANGNAM BRANCH) IN LATE JULY 2019 AND RODE ON POCHEON LACEWAY (CAR RACECOURSE, CIRCUIT) ON FEBRUARY 8, 2019, AND SUFFERED A HUGE BLOW DUE TO SUSPECTED BREAKAGE. AFTER RIDING A CIRCUIT (WITH ENOUGH COOLING, TOTAL CIRCUIT DRIVING BLACK BOX VIDEO) AT A CERTAIN INTERVAL, THE BRAKES DID NOT WORK WELL AT ABOUT 180 MPH, AND SOON AFTER, THE SPONGE PHENOMENON OCCURRED AT 120 MPH. FORTUNATELY, THERE WAS NO ONE NEARBY, AND I WAS ALSO LUCKY TO END UP WITH A STIFF NECK AND NO CREDIT. ON FEBRUARY 7, 2019, THE DAY BEFORE THE ACCIDENT, NISSAN SEONGSU CENTER RAN A CIRCUIT AND ASKED FOR A CHECK ON BRAKES AND OTHER CONSUMABLES. THE COMPANY SAID THAT THERE WAS NO PROBLEM WITH ENGINE OIL CHANGE AND OTHER PARTS.    BUT THE NEXT DAY, I ENDED UP LOSING MY LIFE IN A BIG ACCIDENT BECAUSE OF A BRAKE DEFECT DURING CIRCUIT DRIVING. AS A RESULT, I WAS ABLE TO SUSPECT THAT THE ABS MODULE, THE BRAKE COMPONENT USED ON NISSAN VEHICLES, WAS DEFECTIVE, AS THE BLACK BOX VIDEO AND THE DRIVING RECORD AT THAT TIME SHOWED THAT THE BRAKES HAD NOT BEEN APPLIED, AND THE VEHICLE WAS CHECKED A DAY AGO AND ONLY RODE ON A FULL-KILOGRAM VEHICLE. THIS WAS ALSO POINTED OUT BY MBC AS A DEFECTIVE PART MANUFACTURED BY CONTINENTAL COMPANY (INCLUDING DOZENS OF VEHICLE LISTS RELEASED LAST NOVEMBER, INCLUDING NISSAN GTR AND USING PARTS SUCH AS 370Z), WHICH CAUSED THE BRAKE FLUID TO BOIL, RESULTING IN A VERY SERIOUS PROBLEM CONNECTING THE PRESSURE OF THE BRAKES (RESPONSE) TO THE SPONGY PHENOMENON. HOWEVER, NISSAN HAS ONLY RECALLED THE VEHICLE IN RELATION TO THE ABS, BUT HAS BEEN IRRESPONSIBLE ABOUT OTHER PROBLEMATIC VEHICLES. YOU CAN ALSO SEE THAT THE 370Z VEHICLE HAS LONG BEEN A VERY POOR VEHICLE FOR ALL ENGINE RELATED PARTS, AND THE NISSAN CENTER HAS BEEN CHARGING THEM FOR FREE (THIS IS NOT A FORMAL RECALL).",
        "vin": "JN1AZ44EXJM"
    }
]