[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/31/2021",
        "dateOfIncident": "05/07/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431227,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I have a 2018 Nissan Frontier bought it in 2019 I noticed a little vibration at first and now 2 years later it’s vibrating a lot more I took to Nissan in 2020 they said they saw nothing wrong but now I’m told that it’s my motor mounts and Nissan doesn’t want to fix cause it’s only covered by bumper to bumper and not power train warranty now I can’t drive because I’m scared for motor to break or transmission and I’ve researched and heard of people that have the same problem and can’t get any help",
        "vin": "1N6AD0ERXJN"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/14/2021",
        "dateOfIncident": "07/14/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424735,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Squeaking sound coming from front driver side suspension. This has been happening ever since purchased in 2018 that dealer cannot find. Getting worse as it ages. Afraid tire may drive train may break while driving.",
        "vin": "1N6AD0EV1JN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/29/2020",
        "dateOfIncident": "12/29/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385416,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 NISSAN FRONTIER. THE CONTACT STATED THAT THE VEHICLE WOULD NOT INCREASED SPEED AND RUNS ON IDLE FOR ABOUT FIVE OR SIX SECOND AND AFTER IT WOULD RUN OK,  THE CONTACT MENTION THAT THE FAILURE ONLY OCCURRED ONCE TO THREE TIMES A MONTH. THE CONTACT STATED THAT IN ANOTHER OCCASION  WHILE HIS WIFE WAS AT A STOP AND TO GO, THE VEHICLE WOULD GO SLOW ON IDLE AND WHEN MAKE A RIGHT OR LEFT TURN IT RETURN  TO NORMAL. NO WARNING LIGHTS ILLUMINATED. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN FOUR TIMES TO FUCCILLO NISSAN OF CLEARWATER, 15232 US-19, CLEARWATER, FL 33764, AND WAS DIAGNOSED BUT COULD NOT FIND A FAULTY CODE. THE CONTACT ALSO STATED THAT THE VEHICLE WAS TEST DRIVING BUT THE TECHNICIAN WAS UNABLE TO DUPLICATED THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE TWICE AND WAS INFORMED TO TAKE THE VEHICLE BACK TO THE DEALER AND PROVIDED A CASE NUMBER. THE CONTACT STATED THAT HE TAKEN THE VEHICLE BACK TO THE DEALER BUT STILL WAS UNABLE TO DUPLICATED THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 27,800.",
        "vin": "1N6AD0ER4JN"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/19/2020",
        "dateOfIncident": "02/27/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349409,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 NISSAN FRONTIER. CONSUMER WRITES IN REGARDS TO PROBLEM WITH ALIGNMENT.*LD    THE CONSUMER STATED THE DEALER COULD NOT COMPLETE AN ALIGNMENT BEFORE REPAIRING THE VEHICLE WITH A KIT. THE MANUFACTURER ASSISTED %50 OF THE REPAIR COST. THE CONSUMER WAS DISSATISFIED DUE TO THE FAILURE BEING A MANUFACTURING FLAW. *JS",
        "vin": "1N6DD0CW9JN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/25/2020",
        "dateOfIncident": "02/25/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311507,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST BOUGHT A 2018 NISSAN FRONTIER WAS DRIVING HOME FROM WORK PUT WINDOWS DOWN IN THE BACK AND I'M HEARING A SOUND COMING FROM TIRES LIKE UNBALANCED. GOT HOME AND LOOK TO SEE IF THERE WAS TIRE WEIGHTS ON THE RIM BECAUSE ITS LIKE ITS UNBALANCED WITH A LOUD SOUND AND I NOTICED ALSO THAT A SWAYING A LITTLE. AND I REMEMBER THE THIS WEBSITE WAS GETTING RECALLS ON TIRES. SO I WANTED TO SEE IF MINE WAS ON THE LIST WHICH IS P265\\60\\R18  109T.  THIS IS ON REGULAR CITY ROADS. EMAILED MY SALES MAN THAT SOLD ME THE TRUCK AND TOLD HIM I WAS HAVING A PROBLEM LIKE A SHIMMY IN REAR TIRE. SO WE WILL SEE MAYBE THIS WEEKEND IF THEY GET BACK TO ME TODAY IS 2/25/2020",
        "vin": "1N6AD0ER4JN"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/25/2019",
        "dateOfIncident": "10/24/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270992,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WENT FOR INSPECTION AND THEY TOLD ME I NEED FROM BRAKES AND ROTOR AND I ONLY GOT TEN THOUSAND EIGHT HUNDRED MILES",
        "vin": "1N6AD0EVXJN"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/06/2019",
        "dateOfIncident": "08/02/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242124,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2018 NISSAN FRONTIER 9745 MILES. AS A PREVIOUS OWNER HAS EXPLAINED HIS BRAKE PROBLEM SAME AS MINE WHEN YOU DEPRESS THE BRAKE PEDAL  SOLID IT ALMOST GOES TO THE FLOOR ALSO WHEN THIS PEDAL GOES LOW THE ACCELERATOR GOES DOWN TOO CLOSE TO EACH OTHER. I HAVE CONTACTED 3 NISSAN DEALERS THEY CLAIM THEY CANT DUPLICATE THE PROBLEM ON A ROAD TEST.. NISSAN CORP ADMIN LADY FINALLY CALLED, SHE KNOWS NOTHING ABOUT MAINTENANCE PROBLEMS...I AM A 75 YEAR OLD 100% DISABLE VETERAN AND JUST WANT A CAR WITH GOOD RELIABLE BRAKES, UNFORTUNATELY NISSAN TRUCKS AREN'T FOR ME....IF NISSAN CANT SOLVE MY PROBLEM I WILL BY BUYING ELSEWHERE NO ACCIDENT BUT VERY CLOSE CALL............",
        "vin": "1N6AD0ER5JN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/31/2019",
        "dateOfIncident": "07/30/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240890,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS TRUCK IS A 2018 NISSAN FRONTIER THAT HAS ~10K MILES AND IS DRIVEN DAILY.  IN THE EVENINGS IT IS KEPT OUTSIDE.  RECENTLY, A HORRIBLE ODOR BEGAN COMING FROM THE VENTILATION SYSTEM.  I IMMEDIATELY STARTED DISMANTLING THE PASSENGER DASH, REMOVED THE CABIN AIR FILTERS, AND DISCOVERED A DEAD MOTHER RAT AND 4 OFFSPRING IN THE COMPARTMENT ABOVE THE FILTERS.  IF I HAD NOT BEEN ABLE TO FIND THE PROBLEM, THE TRUCK WOULD HAVE BEEN COMPLETELY UNUSABLE.  HOW WERE THEY ABLE TO GAIN ENTRY?  I AM GUESSING THROUGH SOME FRESH AIR INTAKE THAT IS OBVIOUSLY OPEN TO THE EXTERIOR.  NISSAN NEEDS TO ADD A VERY SIMPLE WIRE MESH COVER TO THE OFFENDING ENTRANCE.  TO ALLOW ACCESS TO A FULLY GROWN RAT, IT IS ASSUREDLY 2-3\" IN DIAMETER!    THANKFULLY, I WAS ABLE TO CATCH THE PROBLEM.  HOWEVER, IT IS SUMMER, HIGH TEMPERATURES, AND HAD THE TRUCK BEEN LEFT UNATTENDED FOR SEVERAL DAYS, THE RESULTING ODOR MAY HAVE NEVER BEEN REMEDIATED.  MY CONCERN IS, IF I CAN'T FIND AND COVER THE OPENING, THIS COULD HAPPEN AGAIN.",
        "vin": "1N6DD0ER2JN"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/30/2019",
        "dateOfIncident": "05/30/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210771,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER 6 MONTHS OF OWNING THIS NEW VEHICLE, WHEN PUMPING GAS IT WOULD CUT OFF WHEN BEGINNING TO PUMP THOUGHT IT WAS A FLUKE BUT IT HAPPENS EVERYTIME,TOOK IT TO DEALER THEY REPLACE A BUNCH OF PARTS AFTER FIRST FILL UP IT WAS OK THE SECOND FILL UP THIS MORNING TOOK 10MINUTES TO GET 10 GALLONS IN TO IT I WILL CALL DEALER TODAY",
        "vin": "1N6AD0CW3JN"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/17/2019",
        "dateOfIncident": "02/05/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180604,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY 2018 FRONTIER WITH 40K MILES ON IT BACK IN APRIL 2018. I NOW HAVE ABOUT 56K MILES ON IT. OVER THE LAST COUPLE OF MONTHS IT GOT HARDER AND HARDER TO PUT GAS IN IT AND FOR A MONTH NOW IT SHUTS OFF MULTIPLE TIMES AND OR SPITS GAS OUT WHEN I TRY TO FILL IT. YES, WHILE FILLING THE TANK THE GAS PUMP WILL SHUT OFF AND GAS WILL SPIT OUT OF THE FILLER TUBE AND SPILL ONTO THE GROUND!  TOOK IT TO MY LOCAL DEALER AND ASSUMED IT WOULD BE FIXED UNDER WARRANTY NOT KNOWING ANYTHING ABOUT THIS COMMON ISSUE. DEALER LOOKED AT IT AND TOLD ME $1,600 AND SUGGESTED REPLACING FILLER TUBE ASSEMBLY, CANISTER FILLER, CANISTER ASSEMBLY, CONTROL VALVE ASSEMBLY AND EVAP CONTROL SYSTEM PRESSURE SENSOR. THE PAPERWORK SAYS 'PLEASE CHECK AND ADVISE FOUND DTC FOR VENT VALVE P0448 SERVICE BULLETIN NTB15-079.' THEY SAID MY VEHICLE WAS OVER THE 35K GENERAL WARRANTY MILEAGE.  I DID ONE MINUTE OF RESEARCH ON THE WEB AND FOUND A TSB AND NISSAN WEBSITE FOR THE WARRANTY ENHANCEMENT (15YRS/150K). I CALLED THE DEALER BACK AND SAID WHY DIDN'T YOU TELL ME ABOUT THE TSB, THE NISSAN WEBSITE AND THAT THIS WAS A COMMON PROBLEM FOR 15 YEARS WITH MULTIPLE MODELS OF NISSAN VEHICLES? NOT MUCH OF A RESPONSE EXCEPT YOU CAN CALL NISSAN.  I CALLED NISSAN AND WAS ASSIGNED A CASE MANAGER. THEY EXPLAINED THAT THE WARRANTY ENHANCEMENT WAS VIN SPECIFIC AND DID NOT APPLY TO MY VEHICLE. HE SAID HE WOULD REVIEW THE CASE AND GET BACK TO ME IN 4 DAYS! HE CALLED BACK AND SAID THEY HAD DECIDED NOT TO HELP ME AT ALL WITH THE REPAIR. SO, HERE I AM WITH A 2018 VEHICLE AND NISSAN WANTS ME TO SPEND $1600 TO FIX THIS ISSUE THEY HAVE HAD FOR 15 YEARS. THE SAME ISSUE THEY ARE COVERING FOR THOUSANDS OF OTHER CARS UP TO 15 YEARS OLD WITH THE WARRANTY ENHANCEMENT.  HTTPS://WWW.NISSAN-TECHINFO.COM/ASISTGC_1/USENG/DISKDOCS/1/V/I/1VI38.PDF  HTTPS://WWW.NISSANASSIST.COM/CAMPAIGNS/NISSAN-EVAP-EMISSION-WARRANTY-POLICY-ENHANCEMENT/",
        "vin": "1N6AD0EV6JN"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/28/2019",
        "dateOfIncident": "01/27/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11172445,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS STOPPED, FOOT ON BRAKE, EXITING A PUBLIC PARKING LOT,  WHEN SUDDENLY ENGINE ACCELERATED RAPIDLY AND WHEELS WERE SCREECHING.  THE PASSENGER OF VEHICLE HAD TO PLACE TRANSMISSION IN NEUTRAL, THEN PARK TO STOP VEHICLE FROM MOVING FORWARD. THIS ACTION DID NOT STOP ENGINE FROM REVVING AT EXTREME HIGH SPEED--RATHER, THE ENGINE WOULD SLOW DOWN AFTER ABOUT 3-5 SECONDS. THIS HAPPENED 5 TIMES, WITHIN A 10 MINUTE 4 MILE DRIVE, BUT NOT CONSISTENTLY. DRIVING APPROX. 15-25 MPH BETWEEN STOP SIGNS: BRAKE WOULD BE APPLIED AND THEN ENGINE AND TRUCK WOULD RACE FORWARD.  EACH TIME THE PASSENGER WAS REQUIRED TO PUT SHIFT LEVER IN NEUTRAL TO AVOID HITTING VEHICLES OR OBJECTS IN FRONT OF VEHICLE. THE DRIVER WOULD CLEARLY STATE THAT  FOOT WAS NOT ON THE GAS PEDAL.",
        "vin": "1N6AD0ER5JN"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/20/2018",
        "dateOfIncident": "09/20/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162672,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 NISSAN FRONTIER. THE CONTACT STATED THAT THE BRAKE AND ACCELERATOR PEDALS WERE TOO CLOSE TOGETHER. WHILE BRAKING, THE ACCELERATOR PEDAL WOULD ALSO DEPRESS AND THE VEHICLE WOULD LUNGE FORWARD. THE CONTACT ALSO STATED THAT THE BRAKE PEDAL WAS LOOSE AND WOULD TRAVEL ALL THE WAY DOWN TO THE FLOORBOARD WHEN DEPRESSED HARD. THE CONTACT SPOKE WITH JEFF WYLER FAIRFIELD CADILLAC KIA NISSAN (5815 DIXIE HWY, FAIRFIELD, OH 45014, (513) 682-2500). THE DEALER COULD NOT DUPLICATE THE FAILURE AND REFERRED THE CONTACT TO THE MANUFACTURER. THE MANUFACTURER WAS NOTIFIED AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 500. *TT*JB",
        "vin": "1N6AD0EV5JN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/22/2018",
        "dateOfIncident": "10/09/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141852,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR WHEELS LOCK-UP WHILE DRIVING AT 25 MPH - 40 MPH. THE O/D LIGHT FLASHES AND VEHICLE STOP ACCELERATING AND THEN WILL START BACK. TOOK IT BACK TO DEALER FOR REPAIRS. IT WORKED FINE FOR A WEEK AND DID THE SAME THING AGAIN. THIS NEARLY CAUSED ME TO BE REAR ENDED. I TOOK THE VEHICLE BACK TO DEALERSHIP FOR REPAIRS AGAIN. IT HAS LESS THAN 4500 MILES ON IT.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/13/2018",
        "dateOfIncident": "08/05/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11140130,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE THROTTLE CONTROL, FOOT PEDAL, HAS DEAD SPOTS THAT HAPPEN WHEN LEAVING A STOP SIGN, GREEN LIGHTS, PULLING OUT INTO TRAFFIC. ALSO CLIMBING A HILL WHEN YOU STEP ON THE GAS NOTHING HAPPENS UNTIL THE TRANSMISSION KICKS DOWN THEN YOU GO TO FAST.  THIS HAPPENS OCCASIONALLY. IT IS BETTER IF YOU TURN OF THE OVERDRIVE DID IT STILL HAPPENS. I HAVE HAD IT BACK TO THE DEALER 3 TIMES.DEALER REPROGRAMMED THE TRANSMISSION, REPROGRAMMED THE THROTTLE BODY AND THEN REPLACED THE THROTTLE BODY.   WHEN I PULL OUT INTO TRAFFIC I DO NOT KNOW IF THE TRUCK IS GOING TO MOVE OR NOT. SOMETIME THERE IS ABOUT A SECOND DELAY UNTIL IT CATCHES AND THEN SOMETIMES IT CHIRPS THE TIRES.    I HAVE JUST OVER 1000 MILES ON THIS TRUCK AND DO NOT FEEL SAFE.   THIS IS MY FORTH NISSAN FRONTIER, I NEVER EXPERIENCED ANY FEAR IN DRIVING THE OTHER TRUCK. I BELIEVE IT AND ANY OTHERS WITH THIS PROBLEM SHOULD BE RECALLED OR THE TRUCKS REPLACED.   THIS IS AN ONGOING PROBLEM SINCE I BOUGHT THE TRUCK.",
        "vin": "1N6ADOCW5JN"
    }
]