[
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "04/05/2022",
        "dateOfIncident": "04/05/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459754,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 NISSAN SENTRA SV. The contact stated that she had opened her hood of her vehicle to refill the windshield washer fluid, however once she attempted to close the hood, the latch that she had pulled to release the hood would not go back into place, causing the hood of the vehicle not to close properly. The contact stated that she was advised by a friend that there was a recall on her model vehicle, however her vehicle was not included in the recall NHTSA campaign 20V315000 (Locks, Latches) . The contact had not yet contact the dealer or manufacturer as of yet. The failure mileage was 83,000.",
        "vin": "3N1AB7AP6JL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/25/2022",
        "dateOfIncident": "03/24/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458293,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Car will only go in reverse. While driving down a busy road my car stopped accelerating in forward and now no longer will drive forward at all. I have kept up with all routine maintenance, and had no warning sign that this was going to happen. My warranty expired at 60,000 miles and I am at 64,000. I bought the car brand new in October of 2018, and still owe on it. So now I am stuck with a car payment for a car that I cannot even drive.",
        "vin": "3N1AB7AP5JY"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/22/2022",
        "dateOfIncident": "03/22/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457905,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I got no incident, just that my car doesn’t start the engine at all. We already try all the basics like put a new battery and still can start the engine.And I can’t  used anymore, I really need it to go to work. Because that’s my primary vehicle use. I want to know when is gonna be available those parts to repair the recall. It’s been almost 2 weeks already",
        "vin": "3N1AB7AP7JY"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/17/2022",
        "dateOfIncident": "03/01/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457116,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Nissan Sentra. The contact stated while driving at an undisclosed speed, the vehicle failed to shift into gear as designed with the check engine warning light illuminated. The vehicle was taken to the local dealer where it was diagnosed that the transmission needed to be replaced. The vehicle was taken to another local dealer, Winners Circle Nissan (1134 W Mercury Blvd, Hampton, VA 23666, (757) 838-6111) where it was diagnosed that the transmission needed to be replaced. The vehicle was not repaired. The manufacturer was notified of the failure but no additional assistance was provided. The approximate failure mileage was 68,000.",
        "vin": "3N1AB7AP6JY"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/14/2022",
        "dateOfIncident": "11/29/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456696,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The AEB (automatic emergency braking) system gives false positives on a regular basis. Dashboard light comes on, and monitor says there is an obstruction, or AEB not working. Occurs at any speed. Has happened frequently since November 2020 when I purchased vehicle.",
        "vin": "3n1ab7ap1jy"
    },
    {
        "components": "POWER TRAIN,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/11/2022",
        "dateOfIncident": "03/04/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456256,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I drive a 2018 Nissan Sentra SV  The vehicle began having problems with the break/ driving assistance feature. The light is continuously turning on and that feature hardly ever works, making me feel unsafe and at risk of my breaks or something else malfunctioning. To make matters worse, my transmission stopped working, causing me to nearly crash/ get into countless car accidents. This didn’t only add unnecessary stress to my life but made me late to my office job and is now costing me thousands of dollars to fix ! The whole point of buying a new or relatively new car is to avoid these type of issues and this is simply unacceptable!  I have spoken to many Nissan owners and more than half (about 8/10) have reported having or know someone who had  transmission issues, making me believe this is a huge Nissan issue. My transmission completely gave up on me and I know that this is just not right.  I work at a law office that deals with accidents / personal injury and know enough to say this ain’t right. I demand to be compensated for such horrible and faulty vehicle that has cost me time, money, and unnecessary stress.",
        "vin": "3N1AB7AP9JY"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/10/2022",
        "dateOfIncident": "02/07/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456066,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Nissan Sentra. The contact received notification of NHTSA Campaign Number: 21V135000 (Exterior Lighting) however, the part to do the recall repair was not yet available. The local dealer was contacted by phone and it was confirmed that parts were not yet available. The contact stated that the brake lights failed to illuminate. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the failure. The failure mileage 79,000. VIN tool confirms parts not available.",
        "vin": "3N1AB7AP3JY"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/02/2022",
        "dateOfIncident": "02/17/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454779,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I was accelerating then lost power and car failed to go into gear so no drive or no reverse",
        "vin": "3N1AB7AP0JY"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/23/2022",
        "dateOfIncident": "02/22/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453603,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Nissan Sentra. The contact received notification of NHTSA Campaign Number: 21V135000 (Exterior Lightning). The contact stated that while driving at an undisclosed speed, an unknown malfunction warning message was displayed and the vehicle lost motive power. The vehicle was towed to the contact's residence. The vehicle was not diagnosed nor repaired by an independent mechanic or dealer. The manufacturer was not made aware of the failure. The failure mileage was approximately 180,000.",
        "vin": "3n1ab7ap8jy"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": true,
        "dateComplaintFiled": "02/08/2022",
        "dateOfIncident": "09/25/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11450971,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owned a 2018 Nissan Sentra. The contact stated that while driving at 20 MPH, the exterior brake lights were inoperable which caused another vehicle to rear-end her vehicle. The contact's vehicle then crashed into another vehicle in front of hers. The air bags deployed upon impact. The contact suffered a concussion and later received medical treatment at the hospital. A police report was filed. The vehicle was towed to a tow yard and deemed totaled by the insurance company. The contact later received notification of NHTSA Campaign Number: 21V135000 (Exterior Lightning). The manufacturer was not made aware of the failure. The failure mileage was approximately 70,000.",
        "vin": "3n1ab7ap4jy"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/01/2022",
        "dateOfIncident": "12/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11449812,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Nissan Sentra SV. The contact stated that upon starting the vehicle, she depressed the brake pedal and pressed the push start button but the vehicle failed to start.  The warning message \"Malfunction Indicator Light\" illuminated. The contact stated that as she continued to depress the brake pedal and squeezed an unknown wire under the steering wheel,  she was able to start the vehicle. The contact stated that the failure had been reoccurring.  The contact also stated that the brake pedal would make abnormal loud sounds and would intermittently hesitate to respond while driving.  The contact stated that while driving at 50 MPH,  the brake pedal was depressed but failed to respond. The contact stated that she continued to depress the brake pedal but it failed to respond. The contact stated that as she was about to crash into the rear of the vehicle ahead of her, she veered off the road and crashed into a ditch. The air bags failed to deploy. The contact sustained injuries on the shoulder and her friend who was in the front passenger seat did not sustain any injuries. The contact did not seek medical assistance. The contact was able to drive the vehicle to her friend's residence.  A police report was filed. The dealer was notified of the failure. The contact received the recall notification for NHTSA Campaign Number: 21V135000 (EXTERIOR LIGHTING). The manufacturer was notified of the failure and advised the contact that they could not assist as her vehicle was not drivable. The vehicle was not diagnosed nor repaired. The failure mileage was approximately 48,000.",
        "vin": "3N1AB7AP4JL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/01/2022",
        "dateOfIncident": "01/29/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449719,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle loss power no check engine light while at a street light on highway 111 in El Centro California. Light turn green I pressed on gas pedal and vehicle would not move, RPM remained at zero even with gas pedal pressed all the way. Vehicle coming higher speeds behind me since it's a freeway placed my emergency flashers to avoid getting hit and slowly pulled to side since Vehicle would not got more than 3 to 4 miles per hour. Got to safe side street at this speed off the freeway and than a check engine light appear. Codes related to transmission. I had been traveling that day from Palm Desert CA heading to Calexico CA and had no warning or issue till I stop at that red light was also not the 1st stop I made on this trip. Very scary experience and could have been deadly with a semi truck behind us.",
        "vin": "3n1ab7ap6jy"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "01/26/2022",
        "dateOfIncident": "10/12/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448944,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I purchased this car October 10th of 2021 and 2 days after I purchased it I called my service department because I was driving on the highway at 65 miles an hour and the malfunction warning light came on for the automatic braking system and it also depressed my brakes so it scared the crap out of me. I was told that because of the weather it was raining that day that that sometimes happens. I didn't think anything of it on December 10th my son got into a car accident with the car and he did some damage to the front axle and the front end of the car it has since been repaired and now everyday several times a day the same thing happens and it is messing with my brakes and it's scaring me and I don't know what to do.",
        "vin": "3n1ab7ap8jy"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/13/2022",
        "dateOfIncident": "04/30/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447374,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "UNKNOWN. however there has been a safety recall about the brake lights not illuminating. I have tried three times to make an appointment with nissan dealership to get this problem fixed but i have had no luck with them helping. Im worrried about my daughters safety. She is not even two years old yet, i dont want her or anyone else on the road getting hurt because of a faulty safety feature.",
        "vin": "3N1AB7AP5JY"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "11/29/2021",
        "dateOfIncident": "09/08/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441993,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The automatic emergency braking system is not working and the dash says “forward collision malfunctioning” with the master warning light on. The car did not brake however the aeb is not functioning.",
        "vin": "3N1AB7APXJY"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/18/2021",
        "dateOfIncident": "10/18/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437135,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I have a cvt transmission and sometimes it’s hard for me to even start to move my vehicle because of this sputtering. I’ve seen so many complaints on this cvt and it’s really starting to hinder me from getting back and forth.",
        "vin": "3N1AB7AP0JY"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "10/06/2021",
        "dateOfIncident": "05/05/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435671,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Nissan Sentra. The contact stated while driving approximately 60-65 MPH in the rain, the vehicle in front of him splashed water, and the Forward Collision sensors activated the Automatic Emergency Braking (AEB) system, and the vehicle inadvertently stalled while hydroplaning. There were no warning lights illuminated. The dealer was notified of the failure and advised the contact to take the vehicle to the nearest dealer for diagnostic testing. The contact stated he contact a second dealer - West Herr Nissan of Lockport (6069 S. Transit Rd, Lockport, NY 14094) several times to schedule an appointment but no one returned his phone calls. The contact was able to schedule an appointment with the first dealer when he returned to Florida. The contact also stated that the sensing and radar system was malfunctioning, sending faulty messages to the vehicle whenever a bug or water would fall on the vehicle. The manufacturer was notified of the failure and advised the contact that he would be responsible for the cost of the diagnostic test, then they would determine whether they should cover the repair of the vehicle.  The vehicle was not diagnosed nor repaired. The approximate failure mileage was 37,000. The consumer stated even if the sensor is maintained and cleaned, it's still malfunctioning. The consumer provided a link showing the defect.",
        "vin": "3N1AB7AP8JY"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/20/2021",
        "dateOfIncident": "05/04/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433689,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I received a recall notice (PM971) (21V-135) on May 4, 2021. I went twice to the dealership to have my car fixed. I called several times asking what to do to get the recall completed.  One person said they needed to look at it to get the part.  I went to the dealership on May 24, 2021 and I am still waiting for them to call me telling me that they have the part. Meanwhile, I am having lots of trouble stepping on the brake to start the car.  Frequently it takes me up to 10 minutes before I can get the car started.  Yesterday (9/19), I gave up trying to start the car.  Today, (9/20) I had problems each time I tried to use the car, taking 5-10 minutes each time. The first time I went to the dealership, the technician said he didn't know why the notice was sent out because they didn't have the parts. The dealership is Ray Brandt Nissan 4000 Lapalco Blvd., Marrero, LA 70072.   I could not evacuate for Hurricane Ida because I could not be sure that I would be able to start my car or that my brake lights would work in stop an go traffice. My car is my only means of getting to work and accomplishing other tasks.  I cannot continue to hope that my car will eventually start and hoping that my brake lights continue to work. Your help is appreciated.",
        "vin": "3N1AB7AP6JY"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "07/20/2021",
        "dateOfIncident": "07/12/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425700,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Nissan Sentra. The contact stated while the vehicle was parked, the hood latch independently released without warning and failed to close. The vehicle was taken to the local dealer where the mechanic diagnosed that the hood lever needed to be replaced. The vehicle was not repaired. The vehicle was taken to another local dealer, Green Nissan (4801 Wabash Ave, Springfield, IL 62711) where the vehicle was diagnosed, and the contact was informed that the hood release system needed to be replaced. The vehicle was not repaired. The manufacturer was notified of the failure. The failure mileage was 52,388. The vin was not available.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/16/2021",
        "dateOfIncident": "07/16/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425132,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Nissan Sentra. The contact received notification of NHTSA campaign number: 21V135000 (Exterior Lighting) however, the part to do the recall repair was not yet available. The local dealer was contacted, and it was confirmed that the part was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue and referred the contact to the NHTSA for assistance. The contact had not experienced a failure. Vin tool confirms parts not available.",
        "vin": "3N1AB7AP9JY"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/08/2021",
        "dateOfIncident": "06/08/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423947,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "When passing someone it will not go over 80 it will shift down, rpms will jump back and forth until it shifts correctly and then it will accelerate. This is an issue for several nissans since 2003 that they will not fix.",
        "vin": "3n1ab7ap6jy"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "06/29/2021",
        "dateOfIncident": "05/05/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422798,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The AEB light came on and message appeared saying \"Front Radar Unavailable Due to Obstruction\"",
        "vin": "3N1AB7AP8JY"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/28/2021",
        "dateOfIncident": "06/16/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422672,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Nissan Sentra. The contact stated while attempting to park the vehicle, the vehicle unintendedly accelerated. The vehicle stopped after the brake pedal was depressed, and the emergency brakes was engaged. The vehicle eventually stopped. The vehicle was towed to the dealer and diagnosed that the brakes needed replacement. The vehicle was not repaired and remained at the dealer. The manufacturer was made aware of the failure and informed the contact that there was a recall associated with the VIN, which would cover the repair cost for the ABS, rear stop lamp switch, Engine and Cruise Control. The failure mileage was 66,000.",
        "vin": "3N1AB7AP7JY"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/21/2021",
        "dateOfIncident": "06/21/2021",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421729,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Nissan Sentra. The contact stated while the vehicle was parked, the push to start button and brake pedal was depressed but the engine failed to start. The contact also stated that the RPM's would go to 5 when she depressed the accelerator pedal and the vehicle had a burning smell when driving. The contact stated the vehicle was previously serviced under NHTSA Campaign Number: 21V135000 (EXTERIOR LIGHTING) on June 11, 2021, at the dealer. The manufacturer was not made aware of the failure. The failure mileage was 19,127.",
        "vin": "3N1AB7AP1JY"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/14/2021",
        "dateOfIncident": "06/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420918,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "My Sentra at around 75mph starts shifting back and forth abnormally between gears. The only thing that releases it is letting go of gas, forcing to drop speed, which also forces a shift to higher gear. You feel a jerk when it's jumping gears, but the RPM arrow also jerks between, started around 30k miles and getting worse.",
        "vin": "3n1ab7ap6jy"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/28/2021",
        "dateOfIncident": "05/28/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418846,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "When I push the brakes and start button, all lights come on, navi starts, but Car Does NOT start.  I am stranded for 6th or 7th time and waiting on tow truck.  According to this link, this is a recurrent problem Nissan is aware of, and they do nothing to fix it. https://www.cargurus.com/Cars/Discussion-c27227_ds963428  Being stranded is dangerous-PERIOD.  I am enduring a homeless man yelling at me while I sit in my car with doors locked.    Nissan should recall this car. 2018 Sentra SV with push start is Not safe.",
        "vin": "3n1ab7ap2jy"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/14/2021",
        "dateOfIncident": "04/07/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416632,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "A TIMELY FIX FOR THIS RECALL HAS NO BEEN ISSUED.",
        "vin": "3N1AB7AP9JY"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/13/2021",
        "dateOfIncident": "05/12/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416392,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LIGHT SWITCH IS F AS FAILING MAKING MY REAR BRAKE LIGHTS NOT GLOW",
        "vin": "3N1AB7AP3JY"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/11/2021",
        "dateOfIncident": "04/24/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416184,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 NISSAN SENTRA. THE CONTACT STATED WHILE DRIVING 80 MPH, THE VEHICLE FAILED TO PERFORM AS NEEDED. THERE WAS NO WARNING LIGHT ILLUMINATED. THE DRIVER AVOIDED A NEAR CRASH. THE VEHICLE COASTED ONTO THE SHOULDER OF THE ROADWAY. THE VEHICLE WAS THEN TOWED TO UNITED NISSAN IMPERIAL (2361 HWY 86, IMPERIAL, CA 92251, (760) 352-2900) TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE TRANSMISSION FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT YET REPAIRED. THE MANUFACTURER WAS CONTACTED AND INFORMED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 118,000.",
        "vin": "3N1AB7APXJY"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/03/2021",
        "dateOfIncident": "04/30/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415028,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 NISSAN SENTRA. THE CONTACT STATED THAT WHILE PARKED, THE GEAR SHIFTER FAILED TO SHIFT INTO DRIVE OR ANY OTHER GEARS. THE VEHICLE WAS NOT YET DIAGNOSED NOR REPAIRED. THE DEALER AND MANUFACTURER WERE NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 71,000.",
        "vin": "3N1AB7AP2JL"
    },
    {
        "components": "EXTERIOR LIGHTING,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "04/17/2021",
        "dateOfIncident": "11/13/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408582,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I BOUGHT THE CAR MY FRONT COLLISION SENSOR LIGHT WAS ON I HAD TO TAKE IT TO THE DEALERSHIP AND I WAS TOLD IT WAS AFFECTED NOW THERE IS AN ACTIVE RECALL ON MY VEHICLE AND IT'S AFFECTING MY BRAKES MY LIGHTING AND MY SPEED CONTROL BECAUSE I CAN'T BREAK AND THEY HAVE NOT SENT ME A RECALL OR SEND ANY INFORMATION TO ME I FOUND THIS OUT ON MY CARFAX REPORT",
        "vin": "3N1AB7AP1JY"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/21/2021",
        "dateOfIncident": "03/21/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404134,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT CAME ON.",
        "vin": "3N1AB7AP1JY"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/14/2021",
        "dateOfIncident": "03/08/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402939,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS A RECALL DUE TO FLUID BUILD UP THAT CAN CAUSE LOSS OF THE BRAKES IN THE CAR I JUST BOUGHT FROM CARVANA. THANK GOD I RESEARCHED THE VIN BECAUSE IT WASN'T DISCLOSED TO ME FROM CARVANA. I COULD HAVE DIED IN AN ACCIDENT IF I NEVER WOULD HAVE DID A VIN SEARCH SO SEE IF ANY RECALLS EVER HAPPENED. HOW CAN I GET THIS FIXED IMMEDIATELY?",
        "vin": "3N1AB7AP7JY"
    },
    {
        "components": "ELECTRICAL SYSTEM,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/06/2021",
        "dateOfIncident": "12/27/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399452,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THIS FROM A NISSAN DEALER NOVEMBER 2018. A MONTH AFTER PURCHASE A WARNING APPEARED ON THE DASH STATING \"UNAVAILABLE FRONT RADAR OBSTRUCTION\" FOLLOWED BY THE DEACTIVATED RADAR SYMBOL THAT REMAINS ON THE DASH. I CALLED THE DEALER TO SEE IF ANY RECALLS WE'RE OUT FOR THE COLLISION WARNING SENSOR. THEY SAID NO. I KNOW THAT THE NISSAN MURANOS HAVE ALSO HAD ISSUES WITH THIS SENSOR. IT STARTED GOING OFF ABOUT ONCE A DAY, NOW IT DEACTIVATES NEARLY SIX OR MORE TIMES A DAY AND I DRIVING ME CRAZY.   WHEN I LOOKED INTO THIS ISSUE WITH THE MURANO, THEY MENTIONED THAT OCCASIONALLY THE \"AUTO BRAKE\" FEATURE WOULD ENGAGE WHILE DRIVING AFTER SEEING THIS MESSAGE AND I AM AFRAID MY VEHICLE WILL DO THE SAME.",
        "vin": "3N1AB7AP5JY"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/04/2021",
        "dateOfIncident": "02/25/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399168,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "IN SEPTEMBER 2020 I PURCHASE A 2018 NISSAN SENTRA SV 1.8LITER CAR FROM A SMALL DEALERSHIP. EVERYTHING IS GOING GOOD, I KEEP UP ON THE MAINTENANCE OF THE CAR. ON 02/25/2021 I TOOK THE CAR IN FOR AN OIL CHANGE AND IT WAS INFORMED THAT ALL THE REAR SHOCKS ARE LEAKING BAD AND THE FRONT SHOCKS LEAKING AS WELL. FOR A 3 YEAR OLD CAR SHOULD THESE PARTS BE LEAKING LIKE THIS ALREADY? THE MILAGE ON MY CAR IS UNDER 70,000 AND THEY ALL NEED TO REPLACE ALREADY.I JUST WANTED TO KNOW HOW LONG SHOULD SHOCKS LAST FOR ON A CAR. I JUST BELIEVED THIS CALLS FOR A SAFETY RISK. THERE IS NO ACCIDENT OF ANY SORT ONLY THE REPORT FROM THE MECHANIC SHOP.",
        "vin": "3N1AB7AP8JL"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/25/2021",
        "dateOfIncident": "02/25/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397942,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN THE FREEWAY AT 65 MILES AN HOUR AND THE SUNROOF EXPLODED/SHATTERED. IT WAS A SLIGHTLY CLOUDY DAY WITH TEMPERATURES IN THE 40S. NO OBJECTS STRUCK THE VEHICLE OR ANYTHING. THERE WERE OTHER CARS ON THE FREEWAY, BUT NO CARS NEAR AT THE TIME OF THE INCIDENT. ALSO, NO OTHER DAMAGE OTHER THAN THE SUNROOF GLASS JUST SHATTERED UNEXPECTEDLY. NO SIGNS OR IDEA OF THE CAUSE.",
        "vin": "3N1AB7AP0JY"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/14/2021",
        "dateOfIncident": "02/05/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396139,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE HAS ALWAYS GIVEN ME PROBLEMS WITH THE AUTOMATIC BRAKE AND WHEN I TOOK IT TO THE DEALERSHIP THEY RESPONDED WITH OH YEAH WE ALREADY KNEW ABOUT THAT RATHER THAN GIVING ME SOME KIND OF DIRECTIONS TOWARDS WHERE I CAN FIX IT. MY CAR HAS PROBLEM SPEEDING IT FEELS LIKE IT'S LOST IT'S POWER. I SERVICE MY VEHICLE AT THE DEALERSHIP. I REPLACE ANYTHING THE CAR NEEDS. THIS VEHICLE ISN'T OLD AND SHOULD NOT BE GIVING ME ANY MECHANICAL ISSUES. I ALSO DON'T HAVE ANY LIGHTS ON MY DASH BOARD BUT THE CAR JERKS. I HATE THIS CAR. IVE TAKEN GOOD CARE OF IT AND LITERALLY ALL IT'S GIVEN ME IS PROBLEM AFTER PROBLEM. I STILL OWE TEN GRAND ON IT AND FOR WHAT? FOR JUNK? I THOUGHT ABOUT BUYING ANOTHER VEHICLE WITH NISSAN BUT IF THIS IS THE VEHICLE YOU GUYS ARE MAKING, UNRELIABLE, FRAGILE, AND UNSAFE; I DON'T WANT IT. ALSO SIDE NOTE I TOOK THE CAR TO A MECHANIC AND THERE IS NOTHING WRONG WITH IT ACCORDING TO HIM AND IT STILL GIVES ME THESE ISSUES WITH THE JERKING, THE RPH GOING UP AND DOWN WHILE THE MPH ISN'T. MY VEHICLE DOESN'T HAVE A RECALL BUT THE AUTOMATIC BRAKE HAS NEVER WORKED. UNBELIEVABLE.",
        "vin": "3N1AB7APXJY"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/27/2021",
        "dateOfIncident": "01/06/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390273,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A NISSAN SENTRA BACK IN JUNE 2020 SO I HAVEN'T HAD IT VERY LONG. IT HAD ROUGHLY ABOUT 52K MILES WHEN I PURCHASED IT AND I PURCHASE IT BECAUSE MY FAMILY HAS HAD INFINITI'S AND NISSAN AND MY DAD WORKS FOR AN INFINITI DEALERSHIP. ALL OF OUR VEHICLES HAVE BEEN VERY RELIABLE. SO WHY WOULD THIS ONE BE ANY DIFFERENT. I RECENTLY HAD AN ISSUE DRIVING THIS VEHICLE WHERE IT JUST STARTED THIS WEIRD JUTTER OR VIBRATION AND THEN THERE WAS LOSE OF POWER/HESITATION AND WOULDN'T GO PAST 45 TO 50 MPH. I LIVE ABOUT 71 MILES AWAY FROM WORK AND HAD A HARD TIME GETTING IT TO WORK. AFTER GETTING OFF WORK I DROPPED MY CAR OFF BY THE CLOSEST NISSAN DEALER TO FIND OUT WHAT WAS GOING ON WITH MY CAR. THE SERVICE ADVISOR CALLED ME BACK TO SAY THAT MY TRANSMISSION WAS DONE AND THAT I NEEDED A NEW ONE. I THEN FOUND OUT THAT THE EXTENDED WARRANTY THAT I PURCHASED FROM THE DEALER EXPIRED ALREADY AND THAT I WOULD HAVE TO PAY FOR A TRANSMISSION IN A CAR THAT I JUST BOUGHT LESS THAN A YEAR AGO. AFTER FURTHER RESEARCH I FOUND WHERE NISSAN HAS A REALLY BAD ISSUE WITH THEIR CVT TRANSMISSIONS AND THAT THERE WAS A RECALL ON THEM. WHEN I ASKED NISSAN DEALER ABOUT IT THEY SAID THAT IT ONLY COVERS UP TO 2017 NISSAN SENTRA. MY DAD DID SOME RESEARCH AND FOUND THAT THERE IS A SERVICE BULLETIN REFERENCE (NTB20-035A) FOR 2018-2019 NISSAN SENTRA; CVT JUDDER. WHEN WE CONTACTED NISSAN CONSUMER AFFAIRS FOR ASSISTANCE THEY SAID THAT MY CAR WASN'T INCLUDED IN THIS, AND THAT THEY WOULDN'T COVER ANYTHING. NISSANS SERVICE BULLETIN SAYS THAT IF ANY OF SEVERAL CODES POPPED UP WHILE DIAGNOSING THE VEHICLE (P2859) REPLACE THE CVT TRANSMISSION. THIS IS MY FIRST VEHICLE PURCHASE ON MY OWN, I'M 23, AND I STILL HAVE TO MAKE THE PAYMENTS ON THIS CAR. I WAS QUOTED A TRANSMISSION REPAIR COST OF 4K TO 5K. NISSAN SHOULD BE RESPONSIBLE FOR THIS ISSUE BEING THAT THEY KNOW OF THE PROBLEM. ANY HELP ON THIS IS GREATLY APPRECIATED.",
        "vin": "3N1AB7AP2JY"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/02/2020",
        "dateOfIncident": "10/14/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377601,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CVT FAILED AT 65000 MILES. EXTENDED WARRANTY REPLACED IT. VEHICLE WAS VERY DANGEROUS TO DRIVE AS IT WAS JERKING, SHUDDERING, REFUSING TO ACCELERATE, AND STALLED TWICE.",
        "vin": "3N1AB7AP0JY"
    },
    {
        "components": "POWER TRAIN,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "11/07/2020",
        "dateOfIncident": "07/04/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373563,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERY NIGHT I DRIVE HOME FROM MY NIGHT JOB THE WARNING LIGHT AND MESSAGE COME ON THAT THERE'S AN OBSTRUCTION ON MY FRONT SENSOR. THE CVT IS TRASH, MY RPM KEEPS GOING UP AND DOWN WHEN I DRIVE ON SLIGHT INCLINE AND I LOOSE SPEED. ONCE, ON THE FREEWAY I LOST OVER 25 MPH WHERE THE FASTEST I COULD GO WAS 40MPH. IT WAS SCARY AND I HAD MY BABY IN THE CAR WITH ME. THE DEALER FORCED ME TO GET THIS CAR AND SAID I WOULDN'T HAVE ANY ISSUES. LIES AND SHAME ON WINTER CHEVROLET OF PITTSBURG CALIFORNIA!!! THEY NOW DON'T RETURN MESSAGES!!!",
        "vin": "3N1AB7AP1JL"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "11/04/2020",
        "dateOfIncident": "10/28/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373043,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 NISSAN SENTRA. THE CONTACT STATED WHILE DRIVING APPROXIMATELY 30 MPH, THE VEHICLE STOPPED INDEPENDENTLY WITH THE FORWARD COLLISION AVOIDANCE AUTOMATIC EMERGENCY BRAKING WARNING LIGHT ILLUMINATED. THE CONTACT PULLED OVER TO THE SIDE OF THE ROADWAY, TURNED OFF THE VEHICLE FOR SEVERAL SECONDS, BEFORE RESTARTING AND DRIVING THE VEHICLE TO VICTORY NISSAN OF DICKSON (2219 HIGHWAY 46 SOUTH, DICKSON, TN 37055) WHERE THE VEHICLE WAS DIAGNOSED WITH A RADAR SENSOR FAILURE. THE VEHICLE WAS REPAIRED HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE HOWEVER, NO ADDITIONAL ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS 59,447.",
        "vin": "3N1AB7AP1JY"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/21/2020",
        "dateOfIncident": "08/07/2020",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365612,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 NISSAN SENTRA. THE CONTACT STATED THAT THE VEHICLE FAILED TO START WHEN HER DAUGHTER ATTEMPTED TO DRIVE AND THAT THE FAILURE WOULD OCCURRED INTERMITTENTLY. IN ADDITION, ON ANOTHER OCCASION, THE CONTACT STATED THAT WHILE HER DAUGHTER WAS DRIVING 45 MPH, THE BRAKES FAILED TO FUNCTION. THE CONTACT STATED THAT HER DAUGHTER WAS DEPRESSING THE ACCELERATOR PEDAL BUT THE BRAKE WAS STOPPING THE VEHICLE. THE DRIVER WAS ABLE TO COAST TO THE SIDE OF THE ROAD AND NOTICED THE BRAKE PAD FROM THE WHEEL WELL WAS SMOKING. THE CONTACT STATED THAT THE SMOKE STARTED AFTER THE VEHICLE WAS STOPPED. THE CONTACT CALLED THE POLICE, THE FIRE DEPARTMENT ARRIVED. THE CONTACT ALSO MENTIONED THAT THE TWO FRONT TIRES GOT SO HOT THAT THEY MELTED THE WEIGHT THAT WAS ON THE RIMS. THE VEHICLE WAS TAKEN TO WALSER NISSAN COON RAPIDS, 3300 129TH AVE NW, COON RAPIDS, MN 55448, AND WAS DIAGNOSED THAT TWO SENSOR THAT WAS NOT COMMUNICATING CORRECTLY WAS TELLING THE VEHICLE TO STOP. THE BRAKE AND STEERING ANGLE SENSOR NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED A CASE NUMBER AND REFERRED THE CONTACT TO NHTSA. THE FAILURE MILEAGE WAS 58,972.*DT*JB",
        "vin": "3N1AB7AP9JY"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/21/2020",
        "dateOfIncident": "10/21/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365666,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2018 NISSAN SENTRA IS HAVING A PROBLEM WITH THE (AEB) AUTOMATIC BRAKING SYSTEM. I'VE HAD THE CAR FOR 10 MONTHS AND WHILE IM DRIVING, I GET A WARNING LIGHT INDICATING THAT THE AEB HAS MALFUNCTIONED, FOLLOWED BY A CONSTANT BEEPING NOISE THAT DOESNT GO AWAY UNLESS I TURN THE VEHICLE OFF. THE LOUD BEEP WILL KEEP GOING FOR AS LONG AS IM DRIVING, AND THE VEHICLE SOMETIMES BRAKES ON ITS OWN, WHICH IS SCARY, AND DANGEROUS. EVERYDAY THAT I DRIVE THE VEHICLE, THE LIGHT COMES ON AUTOMATICALLY WHILE IM DRIVING, FOLLOWED BY THE ANNOYING BEEP, THERES NOT ONE DAY IT DOESN'T HAPPEN, AS FAR AS THE BRAKING GOES, THAT HAPPENS DEPENDING ON THE POSITION OF THE VEHICLE AND OTHER VEHICLES. SOMETIMES OBJECTS WILL MAKE MY VEHICLE BRAKE, OR SOMETIMES IT'LL BRAKE FOR NO REASON, JUST A SLIGHT BRAKE.",
        "vin": "3N1AB7APXJY"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/19/2020",
        "dateOfIncident": "09/24/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365275,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "EBS MALFUNCTION WARNING LIGHT COMES ON. EVERY DAY. WHEN CAR IS IN MOTION.",
        "vin": "3N1AB7AP3JY"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/14/2020",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364400,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 NISSAN SENTRA. THE CONTACT STATED THAT UPON TEST DRIVING THE VEHICLE AT 45 MPH, THE FRONT UNAVAILABLE RADAR OBSTRUCTION WARNING MESSAGE ILLUMINATED ON THE INSTRUMENT PANEL. THE CONTACT INFORMED SAVANNAH TOYOTA (11101 ABERCORN ST, SAVANNAH, GA 31419) OF THE WARNING LIGHT AND THE VEHICLE REMAINED IN THEIR POSSESSION FOR A FEW DAYS. AFTER THE VEHICLE WAS INSPECTED BY GRAINGER NISSAN (1550 CHATHAM PKWY, SAVANNAH, GA 31408) THE CONTACT WAS INFORMED THAT THE FRONT CRASH SENSOR WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE CONTACT WAS GIVEN AN ESTIMATE AND THE CONTACT REFUSED TO PAY FOR THE REPAIR OF THE VEHICLE. THE MANUFACTURER HAD YET TO BE NOTIFIED OF THE FAILURE. THE VEHICLE HAD YET TO BE REPAIRED. THE FAILURE MILEAGE WAS 54,573.",
        "vin": "3N1AB7AP7JY"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/12/2020",
        "dateOfIncident": "10/12/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363959,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER 37,122 MILES THE TRANSMISSION ON MY 2018 NISSAN SENTRA WENT BAD ON ME. I TOOK IT TO THE DEALERSHIP AND THEY INFORMED ME THAT THE ENTIRE TRANSMISSION NEEDED TO BE REPLACED. THE DEALERSHIP ALSO SAID THE FUEL PUMP AND CLUSTER NEEDED TO BE REPLACED. I READ THAT THERE HAVE BEEN OTHER COMPLAINTS MADE ABOUT THE TRANSMISSION SYSTEM FOR THESE CARS, AND THERE SHOULD DEFINITELY BE A RECALL.",
        "vin": "3N1AB7AP7JY"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "09/25/2020",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361094,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT'S MOTHER OWNS A 2018 NISSAN SENTRA. THE CONTACT STATED THAT THE FRONT RADAR OBSTRUCTION LIGHT FLASHED STATING THAT THE SYSTEM WAS UNAVAILABLE. NEITHER THE DEALER NOR THE MANUFACTURER WERE CONTACTED OR NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 53,000.",
        "vin": "3N1AB7APXJY"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/19/2020",
        "dateOfIncident": "09/09/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360015,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "OVER 2 1/2 YEARS OF OWNERSHIP OF THE VEHICLE, I'VE TAKEN THE CAR IN FOR SERVICE 6 TIMES FOR THE SAME PROBLEM: THE BREAK SWITCH HAS FAILED TO ALLOW THE PUSH-BUTTON STARTER TO ENGAGE, WHICH LEAVES ME UNABLE TO STAR THE CAR. THE ISSUE EFFECTIVELY LEAVES ME STRANDED AND HAS RESULTED IN MAKING ME LATE. IT ONLY HAPPENEDS WHEN STARTING THE CAR SO IT'S STATIONARY.",
        "vin": "3N1AB7AP0JY"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/15/2020",
        "dateOfIncident": "09/04/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355109,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR PULLS TO RIGHT ON THE EXPRESS WAY MAKING VERY LOUD FUNNY NOISES , RPM SHOOTS TO 2 TO 5 AND THE STEERING WHEEL HAS LOCKED A FEW TIMES TAKING ME OFF OF THE ROAD BUT NOT CRASHING OR INTO A ACCIDENT , THE BRAKES ARE ALSO SOUNDING BAD. ON STREETS THE CARS STEERING DRIFTS LIKE THE CAR WANTS TO DO ITS OWN THING .",
        "vin": "3N1AB7AP0JL"
    },
    {
        "components": "SEAT BELTS,VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/12/2020",
        "dateOfIncident": "03/31/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354592,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR LOOSES POWER MID DRIVING....SEATBELT ON BACK PASSENGER SIDE DOES NOT ALWAYS CLICK IN SAFELY....WHEN PRESSING ON GAS THERE IS A CLICKING SOUND AND CAR DOES NOT ALWAYS GO FORWARD WHEN GOING FROM IDLE TO MOVING ON THE ROAD...TWICE THE CAR WENT FORWARD FAST AND SOMETIMES IT HAS TOO MUCH POWER WHEN I AM NOT PRESSING THE GAS",
        "vin": "3N1AB7AP3JY"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/05/2020",
        "dateOfIncident": "09/04/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353327,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "RECIB LA NOTIFICACIN ESTANDO PARQUEADO EN MI CASA.NO HA PASADO NADA.",
        "vin": "3N1AB7AP0JY"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/25/2020",
        "dateOfIncident": "08/25/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351070,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTER APPEARS TO BE OUT. ELECTRONICS ARE TURNING ON, BUT ENGINE WILL NOT TURN OVER. I CURRENTLY HAVE 50078 MILES ON MY 2018 NISSAN SENTRA.",
        "vin": "3N1AB7AP0JY"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/20/2020",
        "dateOfIncident": "08/19/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350499,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS STILL UNDER WARRANTY AND I HAVE HAD TO TAKE IN IN TO THE DEALERSHIP 3 TIMES BECAUSE THE AEB SENSOR LIGHT COMES ON.  THEY HAVE REPLACED IT ALL THREE TIMES AND I BRING IT HOME AND ONCE I START DRIVING ON THE FREEWAY, THE SENSOR COMES ON AGAIN.  AS I'M DRIVING, THE VEHICLE SLOWS DOWN EVEN THOUGH I'M PRESSING ON THE GAS.  I HAVE TO LET MY FOOT OFF THE GAS AND THEN PRESS THE GAS PEDAL HARD TO KICK IT BACK INTO RUNNING CORRECTLY.   I HAVE A 2018 NISSAN SENTRA AND IT HAS 30,000 MILES.  THE WARRANTY EXPIRES AT 36,000 MILES AND I'M AFRAID THAT I WILL HAVE TO TAKE IT IN AND PAY FOR THE REPAIRS IF THEY CAN'T FIGURE OUT WHAT'S WRONG.  I'VE OWNED SENTRAS BEFORE AND NEVER HAD THIS MUCH PROBLEM!",
        "vin": "3N1AB7AP5JY"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/18/2020",
        "dateOfIncident": "08/18/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349993,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "KEYLESS IGNITION NOT STARTING AFTER KEY FOB BATTERY HAS BEEN CHANGED AND CAR BATTERY CHANGED, APPEARED TO BE OKAY THEN PROBLEM RETURNED WITHIN A FEW DAYS. KEYLESS IGNITION AGAIN NOT STARTING. THE VEHICLE IS CURRENTLY STATIONARY IN MY DRIVEWAY.",
        "vin": "3N1AB7AP2JL"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "08/17/2020",
        "dateOfIncident": "11/08/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349914,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "COLLISION AVOIDANCE FAILED AND ACCERATOR APPEARED TO STICK RESULTING IN ACCIDENT.IN MOTION APPROACHING LOVERS LANE ON NOBLE AVENUE WHEN DRIVER PASSED OUT RESULTING IN MULTIPLE REAREND STATIONARY OBJECT AND SIDE COLLISION.",
        "vin": "3N1CB7AP1JY"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/17/2020",
        "dateOfIncident": "03/09/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349933,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "RPMS ARE GOING UP AND DOWN WHEN MAINTAINING THE SAME SPEED . WE TOOK IT BACK TO THE DEALERSHIP AT 9000 MILES AND THEY TOLD US IT'S A SPECIAL TRANSMISSION.BELT DRIVEN NOT GEAR DRIVEN. WE TOOK IT BACK A FEW MORE TIMES AND FINALLY WE TOOK IT TO MIDAS AND THEY TOLD US TO TAKE IT TO DEALERSHIP FOR THE TRANSMISSION PROBLEM AFTER THEY DROVE IT AND NOTICED RPMS GOING UP AND DOWN .",
        "vin": "3N1AB7AP1JY"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/10/2020",
        "dateOfIncident": "08/08/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348378,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ATTEMPTED TO START VEHICLE IN A PARKING LOT AND ENGINE WOULD NOT TURN OVER. ELECTRICALLY EVERYTHING TURNED ON BUT ENGINE WOULD NOT START. HAD TO ATTEMPT TO START THE CAR A FEW TIMES BEFORE THE ENGINE WOULD ACTUALLY TURN OVER. PURCHASED MY CAR A FEW DAYS AGO FROM HERTZ CAR SALES AND THIS STARTED HAPPENING MORE AND MORE FREQUENTLY EVERY TIME I ATTEMPT TO START THE CAR. I READ ALL THE POSTS RELATED TO THIS TYPE OF 2018, AND APPEARS THIS IS A COMMON PROBLEM, LOOKS LIKE IT SHOULD BE RECALLED.",
        "vin": "3N1AB7AP8JY"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/06/2020",
        "dateOfIncident": "08/05/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11343613,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 NISSAN SENTRA. THE CONTACT STATED THAT WHILE MAKING A LEFT TURN OUT OF A GAS STATION, HER VEHICLE  WAS HIT ON THE FRONT PASSENGER SIDE BY ANOTHER VEHICLE. THE CONTACT WAS HAVING PAIN IN HER SHOULDERS, BACK AND STOMACH. SHE ALSO HIT HER HEAD  BUT DID NOT INITIALLY GO TO THE HOSPITAL UNTIL THE NEXT DAY. THE CONTACT DID NOT KNOW IF THE OTHER DRIVER WAS INJURED. A POLICE REPORT WAS FILED AND NONE OF THE FRONTAL AIR BAGS DEPLOYED. THE VEHICLE WAS TOWED TO A TOWING COMPANY LOT. THE CONTACT'S INSURANCE COMPANY WILL DETERMINE IF THE VEHICLE WILL BE TOTALED. THE DEALER AND MANUFACTURER HAD NOT BEEN CONTACTED YET. THE FAILURE MILEAGE WAS 56,000.*DT*LN*JB *BF*JB",
        "vin": "3N1AB7AP4JL"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/31/2020",
        "dateOfIncident": "07/30/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342462,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE'S AUTOMATIC EMERGENCY BRAKING (AEB) SYSTEM MALFUNCTIONS AND APPLIES VEHICLE BRAKES IN RANDOM INSTANCES. THIS POSES A SAFETY HAZARD AS THE VEHICLE COULD BRAKE SUDDENLY WHEN IN TRAFFIC AND CAUSE A CRASH.",
        "vin": "3N1CB7AP5JY"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/24/2020",
        "dateOfIncident": "07/22/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341253,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 'OCCUPANT AIRBAG SENSOR' IS MALFUNCTIONING AND NEEDS TO BE REPLACED. NO MATTER THE SIZE OR WEIGHT OF THE PASSENGER, THE OCCUPANT AIRBAG REMAINS OFF AS INDICATED BY THE AIRBAG WARNING LIGHT. THIS MALFUNCTION HAS BEEN PROVEN BY COMPUTER ERROR CODE AT OUR LOCAL NISSAN DEALER (CANNON NISSAN SERVICE DEPARTMENT 662-236-3300).",
        "vin": "3N1AB7AP4JY"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/17/2020",
        "dateOfIncident": "07/17/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340009,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS DRIVING DOWN A STREET PREPARING TO GET ON THE FREEWAY THE MALFUNCTION AND COLLISION SIGN POPPED UP IN THE DASH BOARD..AFTER SO LONG A CONTINUOUS DING SOUND CAN BE HEARD. PULLED OVER TURNED THE CAR OFF CAR WOULDN'T START. HAD TO TAP THE BRAKES SEVERAL TIMES BEFORE THE CAR WOULD EVEN START..ONLY HAVE 30,000 MILES AND I JUST GOT THIS CAR IN APRIL AND ALREADY HAVING ISSUE..",
        "vin": "3N1AB7AP7JY"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/25/2020",
        "dateOfIncident": "05/15/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325841,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2018 NISSAN SENTRA HAS ISSUES WITH NOT STARTING AND THE BRAKE SENSOR FAILING AND COMING ON WITH NOTHING AROUND.  THE BACK UP CAMERA GOES OUT AND THE RADIO AND TEMPERATURE CONTROL LIGHTS GO OUT.  THERE ARE SEVERAL ONGOING DANGEROUS ISSUES WITH THE VEHICLE I HAVE CONTACTED NISSAN CONSUMER AFFAIRS, CORP AND MANAGERS AT SUTHERLIN NISSAN TO NO AVAIL.*DT*JB*DT*JB",
        "vin": "3N1AB7APXJY"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/18/2020",
        "dateOfIncident": "04/16/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321523,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERYTIME I DRIVE IN THE RAIN OR SNOW OR ANY WET CONDITIONS MY FRONT SENSOR FOR THE BRAKES SAYS SENSOR UNDETECTED ERROR MESSAGE AND ALSO MY BRAKES LOOK BRAND NEW AND THEY SQUEAK",
        "vin": "3N1AB7AP3JY"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/29/2020",
        "dateOfIncident": "03/25/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319631,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "FORWARD COLLISION SENSOR CAUSING VEHICLE TO BRAKE WHEN NOTHING IS FRONT OF ME WHILE I DRIVE. IT HAS HAPPENED ON 5 DIFFERENT OCCASIONS AT DIFFERENT SPEEDS. NISSAN DEALERSHIP STATED THAT NISSAN IS AWARE OF ISSUES BUT IS CHARGING ME $1300 TO FIX BECAUSE IT IS OUT OF WARRANTY",
        "vin": "3N1AB7AP7JY"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/18/2020",
        "dateOfIncident": "03/11/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318618,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "03/11/2020 I DROVE THE 2018 NISSAN SENTRA ON HWY 26 W TO PORTLAND OREGON. WHILE DRIVING THE AEB SENSOR LIGHT TURNS ON, MALFUNCTION FROM MANUFACTORY LIGHT ON WITH THE PIPING SOUND CAME ON THAT WAS THE EFFECTED THE SPEED CONTROL BY THE BRAKING. NEXT DAY 3/12/20. I DROVE TO CARR NISSAN DEALER FOR REPAIR AEB(AUTOMATIC EMERGENCY BRAKE) CENSOR. THE DEALER SAID THAT MY CAR HAS NO WARRANTY AND CHARGED FOR REPAIR IS $5,754.42 DUE ON 03/18/2020. I THINK THE NISSAN DEALER WAS OVERCHARGED. I THINK THIS IS SAFETY ISSUES AND 2018 NISSAN SENTRA NEEDS TO RECALL THE AEB SENSOR.ON THE HWY26 HAVE MY KID 16 YEARS OLD AND MY WIFE IN THE CAR.",
        "vin": "3N1AB7AP2JY"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/17/2020",
        "dateOfIncident": "03/16/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318508,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "STOPPED GOING FORWARD WHEN AT TRAFFIC LIGHT WILL ONLY GO IN REVERSE.  DEALERSHIP SAYS WARRANTY IS UP AND IT WILL COST 4000$  TO FIX.   I AM CONFUSED AS TO HOW A CAR THAT WAS BOUGHT 4/20/2018  HAS THE NEED FOR THE TRANSMISSIOM TO BE REPLACED.  THIS CAR HAS HAD REGULAR MAINTENANCE AND I DO NOT BELIEVE AFTER PAYING 479.09 A MONTH FOR THE PAST 23 MONTHS I SHOULD BE SPENDING AN ADDITIONAL 4000$",
        "vin": "3N1AB7AP1JY"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/05/2020",
        "dateOfIncident": "03/04/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316206,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERY TIME THE VEHICLE IS DRIVEN ON AN INTERSTATE THE AEB SYSTEM ERRORS CAUSING THE TCS AND ESP SYSTEMS TO SHUT DOWN. SEVERAL WARNING LIGHTS ILLUMINATE AND THE VEHICLE MUST BE RESTARTED TO CLEAR THE FAULT.",
        "vin": "3N1AB7AP0JY"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/22/2020",
        "dateOfIncident": "02/20/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310795,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "NISSAN 2018 SENTRA AUTOMATIC EMERGENCY BRAKING (AEB), RELIES ON A RADAR IN THE FRONT GRILLE TO MONITOR A CAR'S PROXIMITY TO THE VEHICLE AHEAD, WARN OF POSSIBLE COLLISIONS, AND HIT THE BRAKES IF THE DRIVER CAN'T. BUT A PROBLEM WITH SOME OF THOSE RADAR MODULES ' A THIRD-PARTY COMPONENT SUPPLIED BY BOSCH ' MAKES THE SENSOR FREQUENTLY DEACTIVATE ITSELF, DISABLING CRUISE CONTROL AND THE EMERGENCY BRAKING SYSTEM. A WARNING FLASHES ON THE DASHBOARD TO INDICATE THE PROBLEM: 'FRONT RADAR UNAVAILABLE DUE TO OBSTRUCTION.'",
        "vin": "3N1AB7AP5JY"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/20/2020",
        "dateOfIncident": "10/20/2019",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11310332,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2018 NISSAN SENTRA. THE CONTACT STATED WHILE DRIVING APPROXIMATELY 10 MPH, THE VEHICLE CAUGHT FIRE. THE CONTACT STATED SHE MAY HAVE SEEN SMOKE FROM UNDER THE HOOD NEAR THE WINDSHIELD WIPER. THE CONTACT STATED SHE KEPT DRIVING UNTIL SHE SAW FLAMES AND ALL THE WARNING LIGHTS ILLUMINATING AS WELL AS THE DOOR LOCKS UNLOCKING AND LOCKING AUTOMATICALLY. THE CONTACT STATED HAD TO KICK THE DRIVER SIDE DOOR SEVERAL TIMES TO EXIT THE VEHICLE. THE AIR BAGS DEPLOYED. THE FIRE DEPARTMENT WAS CALLED AND EXTINGUISHED THE FIRE.  A FIRE DEPARTMENT REPORT WAS FILED. THE CONTACT STATED THAT SEVERAL DAYS LATER SHE SOUGHT MEDICAL ATTENTION FOR HER EAR AND DISCOVERED THAT A PART OF THE AIR BAGS WAS FOUND IN HER EAR AS SHE HAS LOST HEARING IN HER LEFT EAR. THE VEHICLE WAS TOWED TO A TOW LOT AND DEEMED A TOTAL LOSS.  THE APPROXIMATE FAILURE MILEAGE 40,000.",
        "vin": "3N1AB7AP2JY"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/13/2020",
        "dateOfIncident": "01/28/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309065,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 NISSAN SENTRA RADAR MODULE OR CALLED NISSAN SENSOR ASSYS-DISTANCE WAS A MALFUNCTION AND AFFECT ON THE BRAKE WHILE DRIVING ON THE FREEWAY OF THE HIGHWAY.",
        "vin": "3N1AB7AP2JY"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/31/2020",
        "dateOfIncident": "01/31/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306412,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "RANDOM WARNING STATING \"FRONT RADAR OBSTRUCTION,\" ESSENTIALLY DEACTIVATING THE AUTOMATIC BRAKING SYSTEM FOR FRONT END COLLISION. VEHICLE WILL BRAKE QUICKLY ON ITS OWN WITHOUT ANYTHING AHEAD IN THE ROAD, WHICH CAUSES OTHER VEHICLES TO SLAM ON THEIR BRAKES TO AVOID COLLISION",
        "vin": "3N1AB7APXJY"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/29/2020",
        "dateOfIncident": "01/29/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302727,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT RADAR UNAVAILABLE DUE TO OBSTRUCTION FLASHED ON THE DASHBOARD WHILE IN MOTION.",
        "vin": "3N1AB7AP0JY"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/28/2020",
        "dateOfIncident": "01/25/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302489,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION IS GOING OUT I WAS ONLY ABLE TO USE REVERSE, MY CAR HAS 46000 MILES I HAVE NEVER BEEN LATE ON CHANGING MY OIL AND GETTING THE CAR SERVICED,  WOULD NOT RECOMMEND BUYING A SENTRA",
        "vin": "3N1AB7AP5JY"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/21/2020",
        "dateOfIncident": "01/07/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300743,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY VEHICLE ABOUT 30 MPH, BEFORE I EVEN APPROACHED ANOTHER VEHICLE MY SENSORS BEGAN BEEPING QUICKER AS IF I WERE ABOUT TO HIT ANOTHER CAR. NO VEHICLE NEAR ME CLOSE ENOUGH FOR SENSOR TO BEGIN ALERTING ME. AS I TRIED TO SLOW DOWN , THEY BEGAN BEEPING VERY FAST AND I WAS UNABLE TO STOP, I WENT AROUND A CAR THAT WAS SITTING AT THE STOP SIGN TO AVOID REAR ENDING THEM, AND STILL REAR ENDED A PARKED CAR. POLICE WERE ON THE SCENE AND WITNESSED THE ACCIDENT. MY CAR WAS TOTALED DUE TO A MALFUNCTION",
        "vin": "3N1AB7APXJY"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/13/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298931,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MALFUNCTIONING ICC RADAR SENSOR MALFUNCTIONING. I'M RECEIVING A WARNING MESSAGE \"FRONT RADAR OBSTRUCTION\". DEALER REFUSES TO FIX BECAUSE MY MILEAGE IS TOO HIGH",
        "vin": "3N1AB7AP4JY"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "01/13/2020",
        "dateOfIncident": "01/12/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298942,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN BRAKING, IF YOU ARE NOT CAREFUL YOUR FOOT MAY BE ON BOTH THE BRAKE AND THE GAS AT THE SAME TIME, MAKING CAR TO EXCELERATE.  GAS AND BRAKE PEDAL ARE VERY CLOSE TO EACH OTHER.  WHEN YOU ARE DRIVING AND GO TO BRAKE IS WHEN IT HAPPENS, ANYWHERE.",
        "vin": "3N1AB7AP4JY"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/28/2019",
        "dateOfIncident": "12/20/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291729,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 12/16/19 I REPORTED AN ISSUE WITH THE AUTOMATIC BRAKE SYSTEM WARNING IT'S UNAVAILABLE. I'VE HAD THE VEHICLE IN 3 TIMES TO FIX THE ISSUE AT METRO NISSAN IN MONTCLAIR CALIFORNIA. THEY CAN'T FIX THE PROBLEM AND KNOW ABOUT IT FROM OTHER VEHICLES. THEY HAVE NOW CHOSEN TO BLAME ME FOR THE ISSUE. THIS DEALERSHIP IS THE WORST POSSIBLE. NISSAN IS WELL AWARE OF THE ISSUE AND DOESN'T HAVE A FIX. THE SENSOR HAS BEEN REPLACED, THE SENSOR HAS BEEN CALIBRATED, ETC. PROBLEM IS THE SYSTEM IS GOING TO CAUSE AN ACCIDENT AND POSSIBLY MORE. NISSAN WAKE UP AND FIX THIS PROBLEM FOR MANY OF YOUR CAR OWNERS. BUY THE CARS BACK IF YOU DON'T KNOW HOW TO FIX IT. KEEP OUR SAFETY PRIORITY #1. I'VE ONLY HAD THE CAR 3 WEEKS AND IT'S BEEN AT METRO NISSAN THE MAJORITY OF THE TIME AND STILL BROKEN. SINCE THE DEALER CAN NOT FIX THE PROBLEM I'M CONTACTING NISSAN CORP DIRECTLY. LOUSY DEALERSHIP. STAY AWAY FROM THEM.",
        "vin": "3N1AB7AP1JY"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/21/2019",
        "dateOfIncident": "12/19/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290470,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT RADAR IS NOT WORKING. WE GET AN ERROR SAYING 'THE FRONT RADAR IS UNAVAILABLE OBSTRUCTION'. I'VE CHECKED WHAT I THINK IT THE RADAR MODULE AND IT'S NOT OBSTRUCTED. I'VE ALSO SEEN A TON OF SIMILAR COMPLAINTS ABOUT THIS ISSUE.",
        "vin": "3N1AB7AP3JL"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/16/2019",
        "dateOfIncident": "12/07/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289502,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC EMERGENCY BRAKING SYSTEM SENSOR FREQUENTLY LIGHTS UP WITH A WARNING RADAR UNAVAILABLE WHILE DRIVING ON THE HIGHWAY AND LOCAL STREETS. I JUST GOT THIS CAR AND AFTER ONE DAY I HAD TO TAKE IT BACK TO THE DEALER. FIRST THEY SAID THEY WOULD REPLACE THE SENSOR. AFTER FOUR DAYS IN THE SHOP THEY SAID THEY CLEANED THE SENSOR AND CLEARED THE CODES. THEY ALSO CALIBRATED THE SENSOR. THE NEXT DAY IT HAPPENED AGAIN TWICE. I HAVE AN APPOINTMENT TO TAKE IT BACK TO THE DEALER IN TWO DAYS. IN READING THE NHTSA WEBSITE THERE ARE MANY REPORTS OF THIS PROBLEM WITH THIS YEAR AND MODEL CAR, WITH THE FORWARD COLLISION AVOIDANCE SYSTEM. MANY OWNERS HAVE REPORTED THIS ISSUE. NISSAN HAS FAILED TO ISSUE A RECALL OR FIX THE PROBLEM. THESE CARS ARE LEMONS. THE FAILURE CAN CAUSE AN ACCIDENT OR SOMETHING A LOT MORE SERIOUS. ACTION NEEDS TO BE TAKEN.",
        "vin": "3N1AB7AP1JY"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/14/2019",
        "dateOfIncident": "12/14/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289080,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC EMERGENCY BRAKING (AEB) SYSTEM IS MALFUNCTIONING, DISPLAYING THE WARNING MESSAGE 'FRONT RADAR UNAVAILABLE DUE TO OBSTRUCTION.' THE WARNING WILL CLEAR AND REAPPEAR MULTIPLE TIME WITHOUT ANY DRIVER INTERVENTION DURING A SINGLE TRIP.",
        "vin": "3N1AB7AP9JY"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/02/2019",
        "dateOfIncident": "12/13/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286331,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION OVER HEATS. TRANSMISSION HAS A LOUD NOISE AND DRAGS SINCE 60,000 MILES",
        "vin": "3N1AB7AP2JL"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/23/2019",
        "dateOfIncident": "11/19/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281966,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "EMERGENCY BREAKING SYSTEM SENSOR SEEMS TO SAY THERE IS SOMETHING OBSTRUCTING FRONT CAR ITS FAULTY/BAD SENSOR JUST PURCHASED VEHICLE.",
        "vin": "3N1AB7AP8JY"
    },
    {
        "components": "EXTERIOR LIGHTING,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/17/2019",
        "dateOfIncident": "10/19/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280674,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A 2018 NISSAN SENTRY IN NOVEMBER OF 2018. IN THE PAST MONTH THE BRAND NEW CAR HAS NOT BEEN STARTING. IT HAS BEEN LEAVING ME STRANDED AT WORK AND AT THE STORE. I KEEP TAKING IT TO THE DEALER SHIP AND THEY REPLACE THE BRAKE SWITCH AND BATTERY. HOWEVER THE CAR IS STILL NOT STARTING ON ME. THE DEALERSHIP REPLACE THE BRAKE SWITCH AGAIN BUT NOW THEY ARE WAITING FOR ANOTHER PART. THIS IS VERY FRUSTRATING BECAUSE IT'S A NEW CAR AND TO ME EVERYTHING IN THE CAR SHOULD BE NEW.  THANK YOU [XXX]    ('PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).')  *JB",
        "vin": "3N1AB7AP7JL"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/30/2019",
        "dateOfIncident": "10/30/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277209,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC EMERGENCY BRAKING BROKEN WITH SENSOR & RADAR PROBLEMS.  THE SENSOR FREQUENTLY DEACTIVATE ITSELF, DISABLING CRUISE CONTROL AND THE EMERGENCY BRAKING SYSTEM. A WARNING FLASHES ON THE DASHBOARD TO INDICATE THE PROBLEM: 'FRONT RADAR UNAVAILABLE DUE TO OBSTRUCTION.'",
        "vin": "3N1AB7AP0JY"
    },
    {
        "components": "SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "10/23/2019",
        "dateOfIncident": "10/19/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11270487,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HIT A DEER HEAD ON. MY PASSENGER 16YR OLD. HAD HER SEATBELT ON. IT DIDNT LATCH AND KEEP HER FROM HITTING THE WINDSHIELD. THE AIRBAG WENT OFF AND IT DIDN'T STOP HER FROM HITTING THE WINDSHIELD EITHER. WE WAS ON AN INTERSTATE DOING 70MPH. IN A 70MPH ZONE. SHE HAS ENDED UP WITH A CONCUSSION AND I FEEL LIKE BOTH THESE SAFETY FEATURES SHOULD HAVE STOPPED HER FROM HITTING THE WINDSHIELD. PLEASE CHECK INTO THIS.",
        "vin": "3N1AB7AP9JY"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/21/2019",
        "dateOfIncident": "08/13/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257073,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED CAR NEW AND ONE WEEK INTO OWNERSHIP HAD THE FRONT PROXIMITY SENSOR GO BAD, WHICH DISABLES VEHICLE SAFETY SYSTEMS INCLUDING CRUISE CONTROL.  AFTER WAITING A MONTH ON A BACK ORDERED PART IT WAS INSTALLED AND THE VEHICLE OPERATED NORMALLY.  1 YEAR LATER THE SENSOR AGAIN WAS DIAGNOSED AS BAD AND ONE WAS ORDERED , THE NEW PART CAME IN DAMAGED AND WHEN REORDERING THE PART, IT AGAIN WENT TO BACK ORDER.  IT HAS NOW BEEN A MONTH, AND STILL NO PART. NISSAN CUSTOMER CARE WAS CONTACTED AND THE \"ESCALATED\" THE COMPLAINT TO A \"REGIONAL LEVEL\".   ALL THAT HAS ACCOMPLISHED IS AN OCCASIONAL PHONE CALL FROM THE REPRESENTATIVE TELLING ME THAT THE PART IS NOT IN AND HE HASN'T EVEN GOT A TIMEFRAME FOR IT. ALSO THAT THERE ARE 1000 VEHICLES AWAITING THAT PART AND MINE IS AT THE HEAD OF THE PACK.  THIS IS A SAFETY SENSITIVE PART AND THEY ARE NOT MAINTAINING AN ADEQUATE SUPPLY OF REPLACEMENT PARTS , AND ARE RETURNING VEHICLES TO CUSTOMERS TO DRIVE WHILE AWAITING THE REPLACEMENT.",
        "vin": "3N1AB7AP5JY"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/20/2019",
        "dateOfIncident": "01/30/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256800,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERY TIME THE CAR IS DRIVEN, THE AEB WARNING LIGHT COMES ON AND IT BEEPS SAYING THAT THERE'S AN OBSTRUCTION. IT HAPPENS ALL THE TIME AND THERE IS NO OBSTRUCTION PRESENT. IT HAPPENS WHILE DRIVING AND WHEN STOPPED.",
        "vin": "3N1AB7AP4JY"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/16/2019",
        "dateOfIncident": "09/09/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255904,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 NISSAN SENTRA. WHILE DRIVING AT AN UNKNOWN SPEED, THE \"UNAVAILABLE FRONT RADAR SENSOR\" MESSAGE WAS DISPLAYED. THE VEHICLE WAS TAKEN TO JIM KERAS NISSAN (2080 COVINGTON PIKE, MEMPHIS, TN 38128, (901) 373-2800) WHERE IT WAS DIAGNOSED THAT THE FRONT RADAR SENSOR NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND PROVIDED CASE NUMBER: 37101150. THE APPROXIMATE FAILURE MILEAGE WAS 42,300.",
        "vin": "3N1AB7AP8JL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/24/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246156,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY 2018 NISSAN SENTRA WITH 5 MILES (BASICALLY BRAND NEW) THE CAR CURRENTLY  HAS 10,000 MILES AND THE VEHICLE IS KEPT MAINTAINED. A FEW MONTHS AFTER I PURCHASED THE NISSAN SENTRA I BEGAN HAVING ISSUES WITH MY BACK UP CAMERA SCREEN IN WHICH IT BEGAN BLACKING OUT AND FLICKERING IN AND OFF. SINCE IT HAD BEEN RAINING IN MY TOWN I ASSUMED THERE WAS SOME SORT OF SHORT OR WATER MUST OF LEAKED INTO THE WIRING SYSTEM L, I TOOK IT TO MY LOCAL NISSAN DEALER AND THEY COULDN'T FIND ANY TYPE OF ISSUE WITH THE CAR SO I LEFT IT AT THAT I HAVEN'T HAD ANY ISSUES WITH IT GAIN HOWEVER IT HASN'T RAINED EITHER SO I'M JUST WAITING TO SEE. AFTER THAT OCCURRED I BEGAN HAVING ISSUES WITH THE FRONT RADAR CRASH SENSOR. I GET A WARNING &#9888;&#65039; SIGNAL ON MY DASH CONSTANTLY READING THAT I HAVE A FRONT RADAR  OBSTRUCTION  WHICH THERE IS NOTHING BLOCKING THE SENSOR. SHORTLY AFTER THAT MY AC BEGAN BLOWING UP STREAMLINED HOT AIR AND WENT OUT ONE DAY. I'VE ATTEMPTED TO HAVE IT FIXED AND THERE'S NOTHING THEY CAN FIND TO FIX THE ISSUES. I'VE HAD THE CAR FOR A YEAR ABOUT 10,000 MILES AND THESE ISSUES HAVE RAISED CONCERN. THE VEHICLE IS UNDER WARRANTY AND STILL THESE ISSUES CANNOT BE FIXED",
        "vin": "3N1AB7AP9JY"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/16/2019",
        "dateOfIncident": "08/09/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244354,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN THE PARKING LOT STATIONARY, ATTEMPTING TO LEAVE THE STORE,  AND  MY VEHICLE WOULD NOT START DUE TO THE BRAKE SENSOR MALFUNCTIONING.  I DRIVE A 2018 NISSAN SENTRA AND IT IS PUSH START. AT THE TIME IT WAS MID DAY AND THE WEATHER WAS ABOUT 102. MY  EIGHT MONTH AND A HALF PREGNANT GIRLFRIEND HAD TO WAIT IN THE PARKING LOT FOR APPROXIMATELY 20 MINUTES IN THE HEAT UNTIL  THE VEHICLE STARTED TO WORK AGAIN.  AFTER ONE GOOGLE SEARCH I WAS ABLE TO FIND OUT THAT THIS ISSUE IS QUITE FREQUENT AND NEEDS TO BE ADDRESSED.  THIS IS HAPPENED ON FOUR SEPARATE OCCASIONS PRIOR TO THIS AND ALL OF THEM HAPPENED BETWEEN 21,500 AND 23,500 MILES. THIS ISUNACCEPTABLE FOR A ONE-YEAR-OLD VEHICLE AND COULD'VE LED TO SOMETHING WAY MORE DANGEROUS IN THE EVENT WE HAD OUR NEWBORN CHILD WITH US.",
        "vin": "3N1AB7AP8JY"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/06/2019",
        "dateOfIncident": "07/30/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242166,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 NISSAN SENTRA SAFETY SYSTEM MALFUNCTION. AUTOMATIC EMERGENCY BRAKING SYSTEM NOT WORKING WITH ERROR DISPLAYED 'FRONT RADAR UNAVAILABLE DUE TO OBSTRUCTION.'. ALSO, CRUISE CONTROL WOULD BECOME INOPERABLE WHEN ERROR CODE APEARED ON INSTRUMENT SCREEN.  VEHICLE RENTED FROM DOLLAR RENT A CAR LOCATION HONOLULU, HI AIRPORT. NOTIFIED RENTAL LOCATION WITH RESPONSE OF \"VEHICLE IS FINE\". NOTIFIED DOLLAR CORPORATE AND RECEIVED NO RESPONSE. DOLLAR IS KNOWINGLY RENTING VEHICLES WITH INOPERABLE SAFETY SYSTEMS TO CONSUMER.",
        "vin": "3N1AB7AP2JY"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/11/2019",
        "dateOfIncident": "06/11/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219244,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR PULLING TO LEFT CONTRACTION LIGHT GOING ON WHEN DRIVING",
        "vin": "3N1AB7AP1JY"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/06/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218322,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "FAULTY RADAR IN THE AUTOMATIC EMERGENCY BRAKING SYSTEM IS CAUSING A VERY DANGEROUS MALFUNCTION IN THE CAR.  THE DEALERSHIP HAS REPEATEDLY TRIED TO REPAIR THE PROBLEM, TO NO AVAIL.  THIS IS CAUSING THE CAR TO RANDOMLY STOP IN THE MIDDLE OF THE HIGHWAY AND/OR CAUSE THE AUTO EMERGENCY BRAKE TO SIMPLY NOT WORK.",
        "vin": "3N1AB7APXJY"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/27/2019",
        "dateOfIncident": "05/27/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210171,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE CAR IS IN GEAR WHITH BRAKES APPLIED THE THE CAR BEGINS TO ROLL IF ON SLIGHT INCLINE.  AS IF IT GOES INTO NEUTRAL.",
        "vin": "3N1AB7AP0JY"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/22/2019",
        "dateOfIncident": "05/02/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209363,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS 14,000 MILES ON IT AND IS UNDER WARRANTY.  THE FRONT RADAR CAMERA IS CONSTANTLY ACTING LIKE THE CAR IS IN A WRECK AND IT LIGHTS UP THE DASH WITH VARIOUS CRASH EMBLEMS.. I TOOK IT TO THE LOCAL NISSAN DEALERSHIP AND THEY PUT IN A NEW RADAR CAMERA AND IT CONTINUES TO DO THE SAME EXACT THING 2 DAYS AFTER BEING IN THE DEALERSHIP FOR 7 FULL DAYS...NISSAN CANT FIX THIS RADAR CRASH SENSOR.... THIS HAPPENS AFTER YOU CRANK THE CAR AND YOU GO ROUGHLY A HUNDRED YARDS.",
        "vin": "3N1AB7AP0JY"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "05/18/2019",
        "dateOfIncident": "02/09/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11208384,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "EMERGENCY BRAKE ASSIST  HAS BEEN ACTING FROM.THE DAY I PURCHASED THE VEHICLE...THEN I WAS IN A CAR ACCIDENT THEN IT GOT WORSE, THEY REPLACED THE BRACKET AND SENSOR AND THEY PROBLEM STILL REMAINS... ACTUALLY I WORSE THEN BEFORE EVERYTIME I USE MY SIGNAL OT GOES OFF WHEN I'M APPROACHING A HILL IT GOES OFF.",
        "vin": "3N1AB7AP8JL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "05/13/2019",
        "dateOfIncident": "04/16/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11207336,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2018 NISSAN SENTRA. THE CONTACT STATED THAT WHILE DRIVING AT AN UNKNOWN SPEEDS AND GOING OVER RAILROAD TRACKS, THE VEHICLE IN FRONT WAS REAR ENDED AND THE AIR BAGS DEPLOYED. THE VEHICLE WAS PULLED OVER AND TWO PEDESTRIANS ASSISTED THE CONTACT IN EXITING THE VEHICLE. THE CONTACT SUSTAINED INJURIES TO THEIR BACK AND RIGHT CHEST AREA THAT REQUIRED MEDICAL ATTENTION. THE OTHER DRIVER OF THE VEHICLE DID NOT SUSTAIN ANY INJURIES. A POLICE REPORT WAS FILED. IT WAS UNKNOWN IF A  DEALER WAS CONTACTED. THE VEHICLE WAS TOWED TO THE LOCAL MECHANIC. THE MECHANIC DEEMED THE VEHICLE TOTALED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 5,887.  *DT *DT  PHOTOS ATTACHED.*JB *JB",
        "vin": "3N1AB7AP5JL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "03/18/2019",
        "dateOfIncident": "03/08/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 11187440,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DAUGHTER WAS INVOLVED IN AXSINGKE CAR ACCIDENT THAT COST HER LIFE. THE FRONT END COLLISION SENSORS WERE NOT WORKING AT THE TIME OVATE ACCIDENT. LAST YEAR WHEN THE SENSOR LIGHT WENT ON, WE MADE AN ATTEMPT TO GET IT REPAIRED. WE WERE TOLD BY THE DEALER M'LADY NISSAN IN CRYSTAL LAKE IL THAT THERE WAS NO FIX FOR HIS PROBLEM YET.   ABOUT A MONTH AGO [XXX] AND I TOOK HER CAR IN FOR AN OIL CHANGE AND I DEMANDED THE FRONT SENSORS GET FIXED. WE RECEIVED THE SAME RESPONSE FROM THE DEALER AND TOLD WE WOULD RECEIVE A POSTCARD WHEN THE REPAIR WAS MADE. MY DAUGHTER HIT THE TRAFFIC LIGHT POLE AND THE BRAKES WERE NEVER APPLIED. I DON'T KNOW IF THIS WOULD HAVE SAVED HER LIFE BUT I BELIEVE THIS IS AN IMPORTANT DEFECT THAT MUST BE REPAIRED. I HAVE A HARD TIME BELIEVING MULTI BILLION DOLLAR COMPANY CANNOT COME UP WITH A FIX FOR A $5.00  SENSOR. MY DAUGHTER WAS 28 AND I DO NOT WANT ANY OTHER FAMILY TO HAVE TO GO THROUGH.  WHAT WE ARE GOING THROUGH. I WAS TOLD THAT THERE WILL NOT BE AN INVESTIGATION BY THE WOODSTOCK POLICE DEPARTMENT. THE POLICE REPORT #[XXX]. PH # 815-338-2131   WOODSTOCK, IL POLICE DEPARTMENT. I DO NOT HAVE A PHOTO OF THE CAR. I UNDERSTAND IT WAS ON THE FRONT PAGE OF THE NW HERALD IN CRYSTAL LAKE IL    INFORMATION REENACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TT *DT *DT *DT*JB *DT*JB  POLICE REPORT SUBMITTED.*JB *DT *DT *DT  PHOTOS ATTACHED *JB *DT  COMMUNICATION WITH NISSAN ATTACHED.*JB",
        "vin": "3N1AB7AP6JY"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/18/2019",
        "dateOfIncident": "03/16/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11189757,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 NISSAN SENTRA 22K MILES. FRONT RADAR WARNING MALFUNCTION LIGHT ON. DEALER STATED THERE IS NO FIX FROM NISSAN AT THIS TIME AND WE SHOULD CONTINUE DRIVING THE CAR UNTIL THEY CALL US BACK. DEALER STATED IT COULD BE TWO DAYS OR TWO MONTHS. OWNERS MANUAL STATES THE CAR SHOULD NOT BE OPERATED AND TOOK TO THE DEALER IF THIS OCCURS. LOCAL DEALER REFUSED TO GIVE A COURTESY CAR UNTIL THE REPAIR COULD BE MADE. THIS IS A BIG SAFETY CONCERN FOR US AS OUR SON IS DRIVING THE CAR TO COLLEGE DAILY. DEALER STATED THE CAR DOES NOT APPLY THE BRAKES WITH THIS SYSTEM, THE VIDEO FROM NISSAN STATES OTHERWISE. CAR CANNOT BE SAFE TO DRIVE THIS WAY.",
        "vin": "3N1AB7APXJL"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/08/2019",
        "dateOfIncident": "09/28/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11175769,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST BEFORE I HIT 1000 MILES, THE FRONT COLLISION SENSOR STARTED BEEPING AT RANDOM TIMES WHETHER THE VEHICLE WAS STOPPED OR IN MOTION AND ULTIMATELY, IT HAD TO BE REPLACED. DEALERSHIP TOLD ME THEY HAVE SEEN THIS HAPPEN A LOT ON THE 2018 MODEL SENTRAS. ALSO, THE GUARD IN THE INSIDE TRACK OF THE DRIVER DOOR CAME OFF TWICE AND I HAD TO FASTEN IT BACK ON. I DID BUY IT OFF THE SALES FLOOR SO A LOT MORE PEOPLE WERE IN AND OUT OF IT BUT I STILL DO NOT FEEL LIKE THAT SHOULD HAPPEN ON A BRAND NEW CAR. LAST, MY 2017 NISSAN NEVER HAD PROBLEMS WITH THE BLUETOOTH BUT THIS ONE CONSTANTLY KICKS ME OFF OF CALLS BUT WAS TOLD NOTHING COULD BE DONE UNTIL DEALERSHIP CATCHES IT IN THE ACT. OVERALL, I LOVE THE SAFETY, COMFORT, AND FEEL OF MY CAR, JUST WISH THE BLUETOOTH WOULD WORK RIGHT.",
        "vin": "3N1AB7APXJY"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/18/2018",
        "dateOfIncident": "12/18/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162246,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT RADAR SYSTEM TURNS OFF AND THEN RESETS FOR NO APPARENT REASON.  DASH MESSAGE IS 'FRONT RADAR UNAVAILABLE DUE TO OBSTRUCTION'.  IT IS TIED INTO THE AUTOMATIC EMERGENCY BRAKING SYSTEM AND INTELLIGENT CRUISE CONTROL.   HAPPENS WHEN VEHICLE IS IN MOTION ON VARIED ROADWAYS.  THERE IS NO OBSTRUCTION. *DT  CONSUMER STATED HE IS CANCELLING REQUEST.*JB",
        "vin": "3N1AB7AP8FY"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/30/2018",
        "dateOfIncident": "09/09/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132356,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2018 NISSAN SENTRA STARTED HAVING ELECTRICAL SYSTEM/WIRE PROBLEMS AFTER HITTING A SMALL PUDDLE GOING UP TO MY TIRES.  DAYS LATER THE CAR GOT IT OIL CHANGE HAVE FAMILY OIL COMPANY ON RIDGE AVENUE IN NORRISTOWN PENNSYLVANIA VERY NEXT DAY HAVE TO WORK MY CAR STOP MOVING I JUST STILL RAN I TOOK IT TO NISSAN  SO THAT THEY CAN SEE WHY THE CAR IS NOT RUNNING PROPERLY THEY TOLD ME IT WAS ELECTRICAL PROBLEMS WITH THE WIRES THEY STILL HAVE MY CAR THEY HAD IT FOR ALMOST 3 WEEKS I STILL HAVE NOT BEEN ABLE TO FIX IT.",
        "vin": "3N1AB7AP3JY"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "08/29/2018",
        "dateOfIncident": "08/29/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11123272,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2018 NISSAN SENTRA. WHILE DRIVING APPROXIMATELY 20 MPH, A SECOND VEHICLE TRAVELING APPROXIMATELY 65 MPH CRASHED INTO THE FRONT OF THE CONTACT'S VEHICLE. ALL THE AIR BAGS DEPLOYED EXCEPT THE DRIVER SIDE CURTAIN AIR BAG. IN ADDITION, THE FRONT DRIVER AND PASSENGER SIDE SEAT BELTS DID NOT RESTRAIN PROPERLY AND CAUSED THE FRONT PASSENGER TO STRIKE THE WINDSHIELD. THE DRIVER SUSTAINED AN INJURED TORSO AND RIBS, WHICH REQUIRED MEDICAL TREATMENT. THE FRONT PASSENGER SUSTAINED A FRACTURED NECK AND LACERATIONS TO THE LEFT ARM, WHICH ALSO REQUIRED MEDICAL TREATMENT. A POLICE REPORT WAS FILED. THE VEHICLE WAS DESTROYED AND TOWED TO AN UNDISCLOSED LOCATION. THE CAUSE OF THE FAILURES WAS NOT DETERMINED. THE LOCAL DEALER (PELTIER NISSAN, 3201 SSW LOOP 323, TYLER, TX) AND THE MANUFACTURER WERE NOTIFIED OF THE FAILURES. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 13,000.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/23/2018",
        "dateOfIncident": "08/17/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121973,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WORK IN A SHOP AND OVER THE LAST MONTH, WE'VE SEEN 10 SENTRAS UNDER 15000MILES COME IN WITH SNAPPED DRIVE BELTS. ALL OF THEM HAVE PULLEYS THAT SPIN FREELY SO THAT'S NOT THE ISSUE. THE BELTS SEEM TO BE COMING APART AT THE SEAMS",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/16/2018",
        "dateOfIncident": "08/08/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120373,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING SLIGHTLY OVER 80 MPH IN UTAH WHERE THE SPEED LIMIT IS 80 MPH, THE GASKET HOLDING DOWN THE WINDSHIELD STARTED TO COME OFF AND HAD TO BE HELD IN PLACE BY CLOSING THE WINDOW ON IT.  THIS HAPPENED TO THE GASKET ON BOTH SIDES OF THE WINDSHIELD.  THIS WAS A RENTAL CAR.  FOR FUTURE DRIVING I WAS ABLE TO HOLD IT DOWN IN PLACE WITH DUCT TAPE WHICH I HAPPENED TO HAVE.",
        "vin": "3N1AB7AP6JL"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "07/31/2018",
        "dateOfIncident": "05/31/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114723,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT SENSOR KEEP SHOWING THE \"FRONT SENSOR UNAVAILABLE\" FOLLOWED BY THE CRASH ICON AT ALL TIMES OF THE DAY, AND ALL SPEEDS INCLUDING IN THE STOPPED POSITION.  THE SENSOR GOES OUT REGARDLESS OF WHETHER OR NOT THERE ARE OTHER VEHICLES NEAR THE CAR.",
        "vin": "3N1AB7AP1JY"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/19/2018",
        "dateOfIncident": "05/19/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096875,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHIN ONE WEEK OF DRIVING THE VEHICLE IT STALLED AS I ENTER ONTO  THE HIGHWAY. THE VEHICLE ALSO FEELS AS IF IT'S OUT OF BALANCE AND SHAKES AT SPEED OF 65 TO 70 MPH. AND THE  FORWARD  EMERGENCY BRAKING  SYSTEM WARNING LIGHT DISPLAY/ UNAVAILABLE FRONT RADAR OBSTRUCTION WARNING LIGHT ALSO DISPLAY AT ANY GIVEN TIME.  AS YOU CAN SEE BY JUST A FEW OF THE MANY PHOTOS BELOW IT IS HAPPENING ANY GIVEN DAY AT ANY GIVEN TIME EVEN AT ZERO SPEED *TT",
        "vin": "3N1AB7APXJY"
    }
]