[
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/17/2022",
        "dateOfIncident": "01/07/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447728,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "TITAN",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Attempted to shift vehicle into four wheel drive high mode. 4WD error message appeared in center display, as well as traction control and ABS warning indicators. 4WD was inoperative. Attempted to shift into four wheel drive high multiple times, with no success.  Not sure if the traction control and ABS warning indicators are actually indicating that these systems are inoperative or not. These warnings stay on after switching back to 2WD mode, and are only extinguished after the engine is shut off and restarted. I believe the lack of 4WD can be considered a safety issue depending on the weather conditions and where the vehicle is located when this failure occurs.   Dealer confirmed issue, and is replacing the transfer case, under warranty.  I did a bit of research on an internet forum covering this vehicle, and found that others have had this same issue, and it has been identified as a broken shift fork in the transfer case.",
        "vin": "1N6AA1C43JN"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/26/2021",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438210,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "TITAN",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Nissan Titan. The contact stated while attempting to add fuel into the vehicle, the fuel overflowed from the fuel filler neck before the fuel tank was full. The contact stated no warning light was illuminated. The contact took the vehicle to the local dealer, where it was diagnosed with needing the fuel tank and the fuel tank canister to be replaced. The vehicle was repaired but continued to experience failure. The vehicle was taken back to the dealer on 3 different occasions but was not repaired. The manufacturer had been informed of the failure. The failure mileage was approximately 25,000.",
        "vin": "1N6AA1E64JN"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/02/2021",
        "dateOfIncident": "09/29/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435216,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "TITAN",
                "productYear": "2018",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Ewr Volpe Acme Inc.",
                "productMake": "TBD",
                "productModel": "TBD",
                "productYear": "9999",
                "type": "Vehicle"
            }
        ],
        "summary": "At highway speed of 65 MPH, passenger-rear tire started to make slight thumping sound.  After a few minutes, it became much louder.  I pulled off the road to investigate and found that treads were completely delaminating from tire.  Tire was inflated to 74 psi and they have always been properly maintained.  Only 24,000 miles on tire (vehicle purchased new in Feb, 2019).  No injuries but had I not pulled over right away, there is no doubt that a blowout would have occurred with potentially devastating consequences.  The vehicle is a 2018 Nissan Titan XD, Platinum Reserve, purchased at Baxter, Nissan of Bellevue, Nebraska.",
        "vin": "1N6BA1F47JN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/27/2021",
        "dateOfIncident": "09/27/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434586,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "TITAN",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "My Nissan has 35 thousand miles on it it use it as a pleasure vehicle. I was driving the other day and it started shifting really high motor racing loud and not really going anywhere. It was like the transmission was slipping. It had never done this before. I thought it was a isolated incident but the next few days going to get gas and groceries (17 miles one way) it did it again this time starting in low gear the tachometer raced up to 5 -6 thousand rpm before it shifted and when it hit 2gear it did it again and 3rd gear all the time acting like the transmission was slipping. I read on some sites that this model has this problem and nobody seems to want to take accountability for this problem. I paid 33thousand dollars for this truck and it isn’t even broken in but it is broken! So help me what should I do I ask you first so you can give me guidance! Thanks Dennis Nash",
        "vin": "1N6AA1F37JN"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/16/2021",
        "dateOfIncident": "07/26/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429360,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "TITAN",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "1.The Engine Sub-Harness Assembly failed; melted, I feel due to the engine heat, because this harness insulation is not heat rated and melted off the wire. 2.The dashboard engine light came on and would not go off. 3.The Robbins Nissan Dealership I took my truck to in Humble, Tx. 77338 lied and said this failure was caused by rodent damage; which I know for a fact that my garage  is very clean and I've never even seen any signs of rodents. 4.I first noticed a problem approximately  in June of 2021 when the dashboard engine light came on and never went off. 5.By this dealership blaming it on rodent damage, this defective harness was not covered by the Nissan North America, Inc. Warranty, so I was charged $1,522.14 for this repair.",
        "vin": "1N6AA1EJ4JN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/18/2021",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417653,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "TITAN",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "while I'm driving my truck, it has a Cummins Diesel engine, at certain times I guess that the engine goes through a regen process, when it odes this process then the cab is filled with noxious gases. This process last a few minutes and causes you to lower the windows to get rid of the toxic gases.  I reported it to my Nissan Dealer twice when I took it in for it's service, they acted like they had never heard about it before and told me that there was no issue with my truck. that I had to drive it more to get it to stop ding it. Is this normal or are we being poisoned or getting cancer from these events?",
        "vin": "1N6BA1F4XJN"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/06/2021",
        "dateOfIncident": "05/06/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415411,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "TITAN",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 NISSAN TITAN. THE CONTACT STATED WHILE DRIVING 35 MPH, THE ACCELERATOR PEDAL WAS DEPRESSED HOWEVER, THE VEHICLE FAILED TO RESPOND. THE CONTACT STATED THAT SEVERAL UNKNOWN WARNING LIGHTS ILLUMINATED ON THE INSTRUMENT PANEL AND THEN WENT BLANK. THE VEHICLE WAS TOWED TO EMPIRE LAKEWOOD NISSAN (14707 W COLFAX AVE, LAKEWOOD, CO 80401) BUT WAS NOT YET DIAGNOSED. THE VEHICLE WAS NOT YET REPAIRED. THE MANUFACTURER HAD NOT BEEN INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 61,400.",
        "vin": "1N6AA1E55JN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/24/2021",
        "dateOfIncident": "02/05/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413692,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "TITAN",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2018 NISSAN TITAN STARTED MAKING A KNOCKING SOUND IN THE ENGINE. I HAVE 28000 MILES ON THE TRUCK THE NOISE HAS GOTTEN LOUDER IN THE LAST 6,000 MILES. THE DEALERSHIP KEEPS TELLING ME IT'S NORMAL. THERE IS NO WAY IT'S NORMAL. THIS HAS BEEN A ONGOING PROBLEM WITH THE 2ND GENERATION TITAN",
        "vin": "1N6AA1E55JN"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/17/2021",
        "dateOfIncident": "04/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408562,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "TITAN",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRES ARE LOSING AIR ON THE SIDEWALL THAT'S CRACKING OR BREAKING DOWN. NO PUNCTURE OR DAMAGE IS VISIBLE. BUT WITHIN A HOUR TIRE BECOMES FLARE. THIS HAPPENED WHEN VEHICLE WAS PARKED AND GOT INSIDE AND MY TMPS LIGHT WAS ON AND PRESSURE WAS LOW.",
        "vin": "1N6AA1E56JN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/12/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387663,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "TITAN",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I PARKED THE  VEHICLE IN THE DRIVEWAY AND THE CAR STARTED ROLLIN BACKWARDS. SECOND DAY PARKED IT AGAIN AT NIGHT AND WHEN I WOKE UP THE VEHICLE HAD ROLLED DOWN AT THE END OF THE DRIVEWAY. I BROUGHT IT TO THE DEALERSHIP AND ACCORDING TO THEM NOTHING WAS WRONG WITH THE VEHICLE. I WENT ON MY OWN AND DID THREE PARKING TESTS AND EVERY TIME IT ROLLED BACKWARDS WHILE THE VEHICLE WAS IN PARK. I FILMED THE INCIDENT AND BROUGHT IT BACK TO THE DEALERSHIP. AT THAT TIME THEY KEPT THE TRUCK FOR FURTHER INVESTIGATION. THEY HAD A SPECIALIST FROM CORPORATE NISSAN COME IN AND HIS FINDINGS WERE THAT THE VEHICLE WAS FINE AND THE TIRES NEEDED TO BE CHANGED. THAT DOESN'T SOLVE THE ISSUE OF THE VEHICLE ROLLING BACKWARDS WHILE PARKED.I HAVE HAD THIS VEHICLE FOR 2 1/2 YEARS AND NO ISSUES UNTIL NOW. SNOW IS NOT A NEW SITUATION BECAUSE I LIVE IN UPSTATE NY. IT JUST STARTED ON 1/1/21 AND IT HASN'T STOPPED ROLLING BACKWARDS. THIS IS A SAFETY CONCERN THAT NISSAN IS NOT ADDRESSING. I DO HAVE THE VIDEOS BUT I DO NOT HAVE THE OPTION TO UPLOAD.",
        "vin": "1N6AA1E59JN"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/30/2020",
        "dateOfIncident": "11/27/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377029,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "TITAN",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2018 NISSAN TITAN SV XD, SINCE WE PURCHASED THIS VEHICLE NEW THERE IS NOW WARNING BUZZER FOR THE DRIVER SEAT IF THE SEAT BELT IS UNBUCKLED AND YOUR DRIVING,THIS ALSO APPLIES IF THERE IS A PASSENGER IN THE FRONT WHO IS NOT BUCKLED UP,  THE ONLY THING THAT SHOWS IS A ICON ON THE INSTRUMENT CLUSTER.  AT ONE POINT WE ADDRESSED THIS ISSUE WITH THE DEALERSHIP SERVICE DEPARTMENT ONLY TO TELL US THIS IS NORMAL.. AS A SERIOUS SEAT BELT USER WHEN DRIVING, WE FEEL THAT THIS IS A BIG SAFETY ISSUE WITH NO BUZZER WARNING OF A UNBUCKLED SEAT BELT WHILE DRIVING. WE PURCHASED THIS VEHICLE NEW IN APRIL 2019.  THIS ISSUE WAS BROUGHT TO THE DEALERS ATTENTION IN MAY 2019.",
        "vin": "1N6AA1F44JN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/08/2020",
        "dateOfIncident": "09/06/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353699,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "TITAN",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A VOX SMELL/FUMES/VAPORS FROM THE DIESEL POWER PLANT THAT KEEPS COMING INTO THE CAB CAUSING THE OCCUPANTS TO INHALE THESE POTENTIAL POISONOUS/HAZARDOUS  GASES WHILE DRIVING THE VEHICLE. THIS HAS HAPPENED NUMEROUS TIMES. I'VE TAKEN THE VEHICLE BACK TO THE NISSAN DEALERSHIP SEVERAL TIMES AND THEY KEEP TELLING ME THAT NOTHING IS WRONG WITH THE VEHICLE EXCEPT FOR ME NOT DRIVING IT ENOUGH.",
        "vin": "1N6BA1F4XJN"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/07/2020",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316767,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "TITAN",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CLIMATE CONTROLLED HEATED AND COOLED SEAT ON DRIVERS SIDE DOES NOT HEAT OR COOL EFFECTIVELY. THERE IS BARELY A TEMPERATURE DIFFERENCE BETWEEN OFF AND ON. DEALER ADVISED IT MUST COMPLETELY STOP WORKING TO FIX EVEN THOUGH IT HEATS LESS THAN HALF OF WHAT THE PASSENGER SEAT DOES",
        "vin": "1N6AA1E51JN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/18/2020",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309839,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "TITAN",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 NISSAN TITAN. WHILE DRIVING 25-35 MPH THE STEERING WHEEL VIBRATED AND THERE WAS AN ABNORMAL METAL ON METAL SOUND DETECTED. THE VEHICLE WAS TOWED TO FORMULA NISSAN 1504 US-302, BARRE, VT 05641 (802) 479-2277 WHERE IT WAS DIAGNOSED THAT THE TIE ROD, STEERING RACK, GEAR LINKAGE, AND SWAY ARM NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED HOWEVER THE FAILURE RECURRED. ON ANOTHER OCCASION, WHILE DRIVING 25 MPH MAKING A LEFT TURN THE STEERING WHEEL SHUDDERED AND DROVE INTO A SNOWBANK. WITHOUT WARNING THERE WAS AN ABNORMAL POPPING NOISE DETECTED. THE VEHICLE WAS TOWED TO FORMULA NISSAN 1504 US-302, BARRE, VT 05641 (802) 479-2277 BUT WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS CONTACTED WHO SENT AN INVESTIGATOR WHO STATED THE FAILURE WAS DUE TO AN OUTSIDE SOURCE. THE FAILURE MILEAGE WAS 46,000.",
        "vin": "1N6AA1EJ9JN"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/27/2019",
        "dateOfIncident": "12/27/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291466,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "TITAN",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "1. THE VEHICLE HAD TO BE BRAKED HARD  ON THE HIGHWAY TO AVOID A CAR THAT FAILED TO YIELD WHILE MERGING. THE OTHER VEHICLE THEN BRAKED HARD AND I ATTEMPTED TO ACCELERATE TO GET IN FRONT BUT THE VEHICLE WOULD NOT RESPOND TO THE GAS PEDAL. THE ENGINE DID NOT SHUT OFF, BUT THE TRUCK WOULD NOT REV THE RPM'S OR HAVE ANY RESPONSE TO THE GAS PEDAL FOR ABOUT 3 SECONDS. LUCKILY A COLLISION DID NOT OCCUR.   2. WHILE TAKING A RIGHT HAND TURN ONTO A STEEP INCLINE DRIVE FROM A HIGHWAY THE TRUCK ONCE AGAIN WOULD NOT RESPOND TO THE GAS PEDAL. THE TRUCK WAS  JUST SITTING ON THE INCLINE FOR ABOUT THREE SECONDS BEFORE IT RESPONDED TO THE GAS PEDAL AND CLIMBED THE HILL. THERE WAS A VEHICLE FOLLOWING BEHIND INTO THE DRIVE AND HAD TO STOP TO AVOID COLLIDING INTO MY REAR END AS THE TRUCK WOULD NOT GO FOR A FEW SECONDS.  I AM NOT EXACTLY SURE HOW TO DESCRIBE THESE TWO INCIDENTS OTHER THAN IT IS A \"DEAD PEDAL\" FOR SEVERAL SECONDS WHEN PROPULSION IS TRULY NEEDED",
        "vin": "1N6BA1F4XJN"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/24/2019",
        "dateOfIncident": "12/24/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291105,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "TITAN",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 NISSAN TITAN PRO-4X WITH 7118 MILES. TRUCK HAS BEGUN TO REV HIGH DURING ACCELERATION, SLOWING ACCELERATION & SHIFTING. THE TRUCK ALSO RANDOMLY DOWN SHIFTS DURING HIGHWAY USE. THIS TAKES PLACE DURING NORMAL OR EXTREME ACCELERATION ON BOTH HIGHWAY & STREET USE. THIS IS EXTREMELY DANGEROUS DUE TO THE LACK OF ACCELERATION THAT MAY BE NEEDED IN ORDER TO SAFELY MERGE INTO TRAFFIC.",
        "vin": "1N6AA1E50JN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/18/2019",
        "dateOfIncident": "01/21/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280800,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "TITAN",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON NO LESS THAN 30 OCCASIONS, THIS TRUCK, UPON ENTERING AN INTERSECTION OR ENTERING A PASSING LANE WENT \"PEDAL DEAD\" MEANING THE ACCELERATOR FAILED TO OPERATE LEAVING ME, MY FAMILY AND THE PEOPLE IN THE ONCOMING VEHICLES IN DIRECT DANGER OF COLLISION.. I HAVE TAKEN THE TRUCK TO THE DEALER, THEY SAY THEY FIND NOTHING. I HAVE FOUND 20 PLUS COMPLAINTS FOR THE SAME THING FROM OTHER CONSUMERS. THIS TIME MY TRUCK IS NOW ON DAY 20 AT THE DEALER. WITH THIS TRUCK DYEING UPON ENTERING INTERSECTIONS AND PASSING LANES, SOMEONE WILL BE KILLED, IT IS ONLY A MATTER OF TIME. I BOTH THIS NEW, MY FIRST COMPLAINT WAS IN JANUARY OF 2109 AT 242 MILES, NOW 11 MONTHS LATER IT ONLY HAS 3300 MILES ON IT BECAUSE THIS PROBLEM PERSISTS AND IT IS ABSOLUTELY GOING TO CREATE AN ACCIDENT SITUATION. THE FAULTS OCCUR WHEN TURNING ONTO A RAMP, PULLING INTO AN INTERSECTION, OR MANEUVERING INTO THE PASSING LANE. I HAVE SIGNED LETTERS FROM TWO PASSENGERS IN HAND WHO HAVE NOT ONLY EXPERIENCED IT FIRST HAND, THEY WILL NO LONGER RIDE IN THE TRUCK AS WELL AS OVER 20 CONSUMER COMPLAINTS FROM COMPLAINT.COM FOR THE SAME MATTER",
        "vin": "1N6AA1E53JN"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/01/2019",
        "dateOfIncident": "09/07/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277585,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "TITAN",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN FILLING GAS TANK IT HAS A HIGH PITCH WHISTLE AND BLOWS GAS BACK OUT ALL OVER THE SIDE OF THE TRUCK AND ON THE GROUND CAUSING A FIRE HAZARD. NISSAN KNOWS OF THE ISSUE AND HAS ISSUED A TSB BUT I FEEL IT IS VERY DANGEROUS AND NEEDS A RECALL BEFORE SOMEONE GETS BURNT OR KILLED THANKS FOR YOUR HELP",
        "vin": "1N6AA1E59JN"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/21/2019",
        "dateOfIncident": "10/18/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269965,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "TITAN",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS PUMPING GAS THE FUEL TANK BEGAN TO MAKE A HOWLING SOUND AND BEGUN TO SPIT THE GAS BACK OUT. THIS HAS HAPPENED FOUR TIMES, AND HAS BECOME WORRISOME.",
        "vin": "1N6AA1E68JN"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/04/2019",
        "dateOfIncident": "07/15/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253219,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "TITAN",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE THE TRUCK IS FUELING AND STATIONARY THE FILLER NECK EMITS A HIGH-PITCHED WHINE NOISE. THE NOISE VARIES IN PITCH WITH RELATION TO HOW FULL THE TANK BECOMES. THE MENTIONED COMPLAINT HAS OCCURRED SINCE THE FIRST FILL UP WHEN I PURCHASED IT BRAND NEW OFF THE LOT. ADDITIONALLY, I'VE MADE ATTEMPTS OF INFORMING TWO SEPARATE DEALERS OF WHAT WAS HAPPENING AND PROVIDED VIDEO OF THE COMPLAINT. ONE ASKED FOR A COPY OF VIDEO, AND THE OTHER SAID THE ENGINEERS ARE AWARE AND WILL RESPOND SHORTLY. THAT WAS SEVERAL MONTHS PRIOR TO THIS COMPLAINT AND STILL HAVEN'T HEARD ANYTHING.",
        "vin": "1N6AA1E55JN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/07/2019",
        "dateOfIncident": "06/27/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242330,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "TITAN",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 NISSAN TITAN. THE CONTACT STATED THAT THE VEHICLE WOULD NOT START. ROADSIDE ASSISTANCE ATTEMPTED TO JUMPSTART THE VEHICLE, BUT WAS UNSUCCESSFUL. THE VEHICLE WAS TOWED TO HENDERSON NISSAN (295 AUTO MALL DR, HENDERSON, NV 89014) WHERE IT WAS DETERMINED THAT ALL THE ELECTRICAL HARNESSES NEEDED TO BE REPLACED DUE TO RODENT DAMAGE. THE DEALER KEPT THE VEHICLE FROM JUNE 2, 2019 UNTIL AUGUST 6, 2019. THE CONTACT ALSO STATED THAT THERE WERE MULTIPLE ELECTRICAL FAILURES WITH THE VEHICLE. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 19V495000 (ELECTRICAL SYSTEM). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 16,916.",
        "vin": "1N6AA1E54JN"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/31/2019",
        "dateOfIncident": "07/30/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240797,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "TITAN",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST BOUGHT THIS NISSAN TITAN AND WAS NOT IN FORMED OF THIS { TAKATA RECALL}...AND WHAT IS PERMAPLATE SOUNDGARD ITS UNDER THE DEALERS APPEARANCE PLAN . ITOLD THEM I DID NOT WANT THINGS THAT THE MANUFACTURE HAS ALREADY PUT ON THE TRUCK SUCH AS PAINT PROTECTION  SEAT PROTECTION CHEMICALES.. I ONLY DROVE IT FROM THE DEALER TO HOME SO NOTHING HAS HAPPENED THAT I CAN SAY FOR SURE EXCEPT LOCKING AND UNLOCKING DOORS SEEMED DIFFERENT AND CRUSE SEEMED TO WORK AND NEXT TIME I FOUND IT TOOK A WHILE FOR ME TO GET IT TO WORK",
        "vin": "1N6AA1EJ5JN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/25/2019",
        "dateOfIncident": "04/22/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203764,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "TITAN",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON DATE THE TRUCK WAS PURCHASED, BEFORE WE DROVE TRUCK OFF LOT, CENTER CONSOLE HAD UPDATE ERROR MESSAGE DISPLAYED (SEE IMAGES). NOTHING ON CENTER CONSOLE WOULD WORK, BUT VEHICLE WOULD RUN FINE.  BLIND SPOT DETECTION WOULD NOT WORK.  SYSTEM WOULD TRY TO REBOOT ITSELF FOR ABOUT AN HOUR BEFORE SYSTEM WOULD COME BACK ONLINE AND EVERYTHING WOULD BE NORMAL, INCLUDING BLIND SPOT DETECTION.  NEXT DAY, I TOOK TRUCK TO WORK AND CONSOLE WENT OUT AGAIN AS I WAS DRIVING. BLIND SPOT DETECTION NO LONGER WORKED AGAIN. TOOK IT TO DEALERSHIP. THEY CONFIRMED IT HAD THE LATEST SOFTWARE UPDATE AND DETERMINED HEAD UNIT WAS BAD AND ARE REPLACING IT NOW.",
        "vin": "1N6AA1E5XJN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/22/2019",
        "dateOfIncident": "04/19/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11202876,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "TITAN",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE VEHICLE NEW IN JULY 2018.  WHEN THE ENGINE STARTED MAKING A KNOCKING SOUND I TOOK IT TO A NISSAN DEALER SHIP TO BE DIAGNOSED. I WAS TOLD  \"THEY WERE AWARE OF  ISSUES WITH SOME OF THESE ENGINES AND 2 OTHER VECHICLES HAVE ALREADY REQUIRED THE MOTORS BE REPLACED BY THEIR SERVICE DEPARTMENT.   I DECIDED TO GET A SECOND OPINION SO I WENT TO ANOTHER NISSAN DEALER. THIS DEALERSHIP CONFIRMED THAT THEY HAVE A FACTORY NOTICE STATING THERE ARE ISSUES WITH THIS MOTOR. THE DEALERSHIP IS TELLLING ME THEY CAN NOT PERFORM THE FACTORY REQUIRED TEST FOR THREE WEEKS AND IF IT IS DETERMINED  IT IS A DEFECTIVE ENGINE IT WILL BE ANOTHER 3 TO 4 WEEKS UNTIL THE ENGINE CAN BE REPLACED. IN THE MEAN TIME I AM STILL DRIVING THE VEHICLE. IN THE EVENT THAT THIS ENGINE FAILS AT A HIGH RATE OF SPEED THERE IS A POTENTIAL FOR LOSS OF STEERING AND LOSS OF BRAKES.   CURRENTLY THERE HAVE NOT BEEN ANY RECALLS OR NOTICES SENT OUT TO THE CONSUMER AND FROM WHAT I AM TOLD IT IS UNKNOWN HOW MANY OF THESE VEHICLES ARE DEFECTIVE AND CURRENTLY ON THE ROAD.",
        "vin": "1N6AA1E595N"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/20/2019",
        "dateOfIncident": "03/19/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190265,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "TITAN",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN  FLOORING THE ACCELERATOR PEDAL (AS TO PULL OUT ON ENTRANCE RAMP) IT HAS DIESEL LAG RESPONSE (JUST TAKE A FEW SECONDS TO ACCELERATE) AND ALSO TRANSMISSION HAS SHIFTING ISSUES DURING THIS TIME. SOMETIMES INTERMITTENT    I HAD A NEAR MISS EXPERIENCE WHEN THIS HAPPENED TO ME I WAS PULLING OUT ONTO THE HIGHWAY FROM THE ENTRANCE RAMP..",
        "vin": "1N6BA1F48JN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/15/2019",
        "dateOfIncident": "11/27/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180382,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "TITAN",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MAKING A LEFT TURN ONTO A FOUR LANE ROAD WITH MEDIAN SEPARATING THE OPPOSITE DIRECTION LANES, I BEGAN TO PULL OUT AND WHEN PART WAY ACROSS WAS FACED WITH AN EMERGENCY WITH A CAR RACING AT ME IN THE SECOND LANE. FLOORING THE ACCELERATOR, THE TRUCK FAILED TO ACCELERATE OR DOWNSHIFT THROUGH THE TURN.    THIS IS BRAND NEW 2018 TITAN XD DIESEL 2000 MILES ON IT.  FIRST TRIP TO DEALER TOLD NO CODES ALL FIRMWARE UP TO DATE.  \"YOU NEED TO DRIVE SOME MORE FOR IT TO LEARN\"  SYMTOMS STILL EVIDENT AFTER 600 MILES.  DEALER FOUND NOTHING AND NISSAN SAID RELEASE TO CUSTOMER.  \"UNABLE TO REPLICATE CUSTOMER CONCERN.\"    FILED CASE WITH NISSAN CONSUMER AFFAIRS.  TOLD TO TAKE TO DIFFERENT DEALER FOR SECOND OPINION.  SAME ANSWERS.  NISSAN SCHEDULED ENGINEER TO MEET ME AT DEALER.  DUPLICATED DELAY / LACK OF DRIVE OVER TO MEET ENGINEER.  TEST DROVE FOR 30 MINUTES WHERE ENGINEER DUPLICATED HARD SHIFTS BUT NOT DELAYS.  MY OPINION BUT HE NEVER TRIED TO MIMIC CONDITIONS FOR DELAY.  REPORT \" NO PROBLEMS FOUND, EVERYTHING TO MAUNFACTURES DESIGN SPECIFICATIONS. \"  TOOK BACK TO FIRST DEALER AND TEST DROVE WITH TECH WHO IMMEDIATELY AND REPEATEDLY REPEATED PROBLEM OF DELAY / NO ACCELERATION FOR MULTIPLE SECONDS WITH ACCELERATOR FLOORED.  SAID NISSAN NEVER CAME UP WITH FIX, THEY ALL DO IT.  ALSO, OFFERED HIS OWN SITUATION WHERE ON A TEST DRIVE ALMOST GOT REAR ENDED BY A SEMI AFTER MAKING A TURN ON A HIGHWAY FEEDER ROAD.   THIS IS A SAFETY ISSUE AND NISSAN IS AWARE OF THE PROBLEM AND HAS DONE NOTHING TO FIX IT AFTER 3 YEARS.",
        "vin": "1N6BA1F4XJN"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/18/2018",
        "dateOfIncident": "08/16/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130202,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "TITAN",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK HAS BAD HESITATION WHEN AUTOMATIC  TRANSMISSION IS SHIFTING FROM GEAR TO GEAR AND THE RPMS FLUCTUATE BADLY. NO LOW END POWER. THIS CONDITION IS WORSE WHEN TOWING. DEALER SAID THEY ALL DO THIS. I HAVE OWNED 4 TITANS INCLUDING MY 2018 NONE OF MY OTHER TRUCKS DID THIS. WISH I DIDN'T TRADE IN MY 2013",
        "vin": "1N6AA1E54JN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/19/2018",
        "dateOfIncident": "07/16/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112309,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "TITAN",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THE TRUCK BRAND NEW ON 7/16/2018.  WHILE DRIVING HOME FROM DEALERSHIP AND NEXT DAY ON SMOOTH HIGHWAY BETWEEN 60MPH - 80MPH YOU CAN FEEL IT SHAKING. YOU CAN WATCH THE PASSENGER SEAT SHAKE AS IF ON A UNLOADED WASHING MACHINE.  EVEN WITH A PASSENGER THEY NOTICED THEY SHAKE TOO.  IT IS A VERY NOTICEABLE SHAKE ESPECIALLY AROUND 72MPH, AS IT SEEMS LIKE A WHEEL UNBALANCED OR ALIGNMENT IS NOT RIGHT.     I BROUGHT TRUCK BACK INTO THE DON DAVIS NISSAN DEALERSHIP ON 7/17/18 BUT THE DEALERSHIP JUST SHRUGGED IT OFF SAYING IT MIGHT BE A FLAT SPOT IN THE TIRE AND DID NOTHING. TOLD ME TO DRIVE IT FOR A DEW HUNDRED MILES.  THIS IS A PRETTY BAD SHAKE WHEN DRIVING WHICH I HAVE NEVER SEEN ON OTHER BRAND NEW TRUCKS.",
        "vin": "1N6BA1F43JN"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/17/2018",
        "dateOfIncident": "04/24/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112058,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "TITAN",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "IN A ROLLING STOP VEHICLE HESITATES/LAGS/STALLS   2ND VISIT THEY DID A SOFTWARE UP GRADE PROBLEM STILL CONTINUES NOT FIX WAS TOLD TAKES 2000 MILES FOR TRUCK TO GET USED TO NEW SOFTWARE NOW AT 11000 MILES SAME ISSUE",
        "vin": "1N6BA1F40JN"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/04/2018",
        "dateOfIncident": "05/24/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11109565,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "TITAN",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY JOB REQUIRES ME TO TRAVEL A LOT AND IN DOING SO WHEN I'M EITHER MERGING ONTO THE INTERSTATE OR NEEDING TO PULL OUT AT INTERSECTIONS FROM A DEAD STOP . IT'S AS THO MY TRUCK STALLS AND MY THROTTLE RESPONSE GOES DEAD . LEAVING THE OTHER CARS DO COME CLOSE IN REAR ENDING ME . IT'S SCARY ESPECIALLY WHEN I HAVE MY WIFE ALONG WITH MY THREE KIDS RANGING FROM 8 TO 12 MONTHS OF AGE .",
        "vin": "1N6BA1F44JN"
    }
]