[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/09/2022",
        "dateOfIncident": "01/02/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446785,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "5500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "At 95;000 miles abs and traction control lights going on and off on and off, now lights stays on brakes lock up when stopping quickly. Speed control no longer works due to this problem. After a google search I found lots of the same problems with other years and model’s having the Cummins 6.7 diesel motors.The ABS module fails, but you can’t replace the module, you have to replace the whole abs unit which is very costly",
        "vin": "3c7wrnflxjg"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/21/2021",
        "dateOfIncident": "08/16/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433823,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "5500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The steering shaft completely failed while driving.   Thankfully the driver was leaving a customer and pulling out of a drive which he was able to drive into a ditch to keep from being hit or hitting others.  The problem was fixed by Pliler International in Longview, TX.  It has not been inspected by anyone other than mechanic shop.  No warnings at the time of incident.",
        "vin": "3C7WRMBL9JG"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/18/2021",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429600,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "5500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Ram 5500. The contact received notification of NHTSA Campaign Number: 21V398000 (Wheels) however, the part to do the recall repair was unavailable. The dealer had been notified about the recall; however, the contact was informed that the part was not yet available. The manufacturer had been notified of the recall. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The contact had not experienced a failure. Vin tool confirms parts not available.",
        "vin": "3c7wrmal8jg"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/24/2021",
        "dateOfIncident": "03/23/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404657,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "5500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MARCH 23, 2021, WHILE DRIVING ON THE HIGHWAY, I STARTED HEARING THE SAME HUMMING NOISE I HEARD 8 MONTHS AGO WHEN I HAD THE TRANSFER CASE PROBLEM. THIS WAS THE NEW TRANSFER CASE THE DEALERSHIP HAD PUT IN, AND ALL OF A SUDDEN THERE WAS A LOUD BANG/EXPLOSION SOUND FROM WHERE THE TRANSFER CASE EXPLODED. I WAS DRIVING AT 60 MPH AND WAS NOT ABLE TO BRAKE AS I LOST THE BRAKES AFTER THE TRANSFER CASE EXPLODED. AFTER ABOUT 30 SECONDS THE TRUCK COMPLETELY TURNED OFF AND IT STARTED SLOWING DOWN ON ITS OWN, AND AFTER NEARLY HITTING SEVERAL CARS ON THE HIGHWAY I WAS ABLE TO PULL OVER ON THE SIDE OF THE HIGHWAY. THE ENGINE WIRING HARNESS WAS DAMAGED AS WAS THE DRIVESHAFT, BRAKE LINES AND FUEL LINES. APPARENTLY THESE RAM TRANSFER CASES ARE FAULTY... EVEN THE TOW TRUCK DRIVER THAT TOWED ME TO THE NEAREST DEALERSHIP SAID HE'S HAD TO REPLACE THE TRANSFER CASE ON HIS FLEET OF TOW TRUCKS 3 TIMES, AND HIS RAM TRUCKS WERE 2019. IS CHRYSLER GOING TO WAIT UNTIL SOMEONE DIES BEFORE THEY DO SOMETHING ABOUT THIS PROBLEM THAT APPARENTLY HAS BEEN GOING ON FOR YEARS NOW?*DT",
        "vin": "3C7WRNEL3JG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/11/2020",
        "dateOfIncident": "10/02/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383064,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "5500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 RAM 5500. THE CONTACT STATED THAT WHILE DRIVING ON THE HIGHWAY AT 45 MPH, THE TRANSFER CASE EXPLODED. THE FRONT DRIVE SHAFT FRACTURED IN HALF AND PUNCHED A HOLE IN THE FLOORBOARD OF THE CABIN OF THE VEHICLE. THE CONTACT PULLED OFF THE HIGHWAY SAFELY. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THE FAILURE WITH THE TRANSFER CASE. THE VEHICLE WAS TOWED TO ANOTHER INDEPENDENT MECHANIC CLOSER TO THE CONTACT'S RESIDENCE. THE VEHICLE WAS NOT REPAIRED DUE TO PARTS NOT BEING AVAILABLE FOR THE REPAIRS. CONWAY CHRYSLER DODGE JEEP RAM (2385 CHURCH STREET, CONWAY, SC 29526, (843) 438-4363) WAS CONTACTED AND REFERRED THE CONTACT TO THE MANUFACTURER. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED A CASE NUMBER. THE FAILURE MILEAGE WAS 160,000.*DT*DT *TR*DT*JB",
        "vin": "3C7WRNFL3JG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/09/2020",
        "dateOfIncident": "03/27/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320633,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "5500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2018 RAM 5500 AND WAS DRIVING UP THE INTERSTATE WORKING IN MY TRUCK AT POSTED SPEED AND THE TRUCK STARTED TO MAKE A VERY LOUD NOISE AND BOOM! THE TRUCK BUCKED LIKE I HAD HIT A SOLID WALL. THE TRUCKS INDICATOR LIGHT FOR AIRBAGS HAD CAME ON, BUT DIDN'T DEPLOY EVEN THOUGH I HADN'T ACTUALLY HIT ANYTHING, THANKFULLY. COME TO FIND OUT AFTER HAVING TO GET A TOW TO THE DEALERSHIP THE TRANSFER CASE HAD EXPLODED AND  CAME APART WHICH MADE THE DRIVESHAFT BREAK LOOSE AND COME THROUGH THE FLOORBOARD. WHO KNOWS WHAT ALL DAMAGE WAS DONE BECAUSE THE TRUCK SAT AT DEALERSHIP FOR 6 BUSINESS DAYS BEFORE THEY EVEN MADE AN ATTEMPT TO LOOK AT IT. WHEN I WOULD CALL I WAS JUST PUSHED TO THE NEXT DAY. THEN WHEN SOMEONE HAD FINALLY GOT BACK WITH ME I WAS TOLD THAT CHRYSLER WAS WANTING SPECIFIC INFORMATION, SUCH AS MAINTENANCE RECORD , TOOLS THAT WOULD HAVE BEEN USED. I SHOULD TELL YOU THAT THIS TRUCK HAS 82K MILES ON IT, SO IT SHOULD STILL BE COVERED UNDER ORIGINAL  WARRANTY. WELL, CHRYSLER HAS REFUSED TO STAND BEHIND THEIR PRODUCT.  I WAS SUCKERED INTO ALL THE GREAT BOASTING ABOUT HOW TOUGH THESE TRUCKS ARE. I WAS DUMB ENOUGH THAT I'VE BOUGHT 4 RAM PRODUCTS , BECAUSE I'VE ALWAYS BEEN A FAN AND PROUD TO DRIVE A DODGE PRODUCT. WHO WOULD HAVE THOUGHT CHRYSLER WOULD HAVE THE AUDACITY  TO CLAIM THEY HAD ONE OF THE BEST PRODUCTS AND THEN NOT STAND BEHIND A LOYAL CONSUMER.",
        "vin": "3C7WRNDL6JG"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/14/2020",
        "dateOfIncident": "02/13/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309128,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "5500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR WHEEL STUDS BUST OFF WHEN THE WHEELS GET MUD IN THEM. ONCE THE FIRST ONE GOES THE OTHERS GO RIGHT AWAY. THIS WAS ON A HIGHWAY, IN MOTION DRIVING STRAIGHT. WE ALSO OWN A 2013 RAM 5500 VIN #[XXX] THAT WE'VE HAD THEM BREAK OFF OF ABOUT 5 DIFFERENT TIMES. I ASSUMED A RECALL WAS IN THE WORKS BUT I'VE SEEN NOTHING TO DATE SO I DECIDED IT WAS PAST TIME TO ACT BEFORE SOMEONE GETS KILLED. I PERSONALLY KNOW OF OTHERS WHO HAVE HAD THE DUALS COME COMPLETELY OFF AND INTO TRAFFIC. WE HAVE BEEN LUCKY ENOUGH WE HAVE GOTTEN THE TRUCK SHUT DOWN PRIOR TO THE WHEELS FALLING OFF.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "3C7WRNBL2JG"
    },
    {
        "components": "POWER TRAIN,WHEELS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/28/2019",
        "dateOfIncident": "01/12/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252128,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "5500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TRUCK FROM NEW GAD TURBO EXHAUST MANIFOLDS KEPT WARPING BREAKING BOLTS IN THE HEAD EVERYTIME MY RADIO QUITS AND REBOOTS AND GLITCHES AFTER TRUCK UPDATES RUNS POORLY WITH EXCESSIVE EGT  AND DEALERS TEFUSED TO DO ANYTHING FOR ME KEPT TELLIN ME THEY DIDNT HAVE PROPER TECH OR TOOLS OR WAS TOLD ALL WAS NORNAL AND MY FRINT 19.5 WHEEL CRACKED IN THE MIDDLE WITH NO IMPACT OR TIRE DAMMAGE RADIO WUITS AND FREEZES REBOOTS SEVERAL TIMEX A DAY",
        "vin": "3C7WRMEL7JG"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/23/2019",
        "dateOfIncident": "05/23/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209597,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "5500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRAME HAS CRACKED!   THIS ISN'T THE FIRST I'VE HEARD ABOUT THESE FRAMES CRACKING EITHER.   THERE'S A LOT OF COMPLAINTS ONLINE ABOUT THE DODGE 5500 CRACKED FRAMES",
        "vin": "3C7WRMDL3JG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "02/26/2019",
        "dateOfIncident": "02/15/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182523,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "5500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I PARKED MY TRUCK AND TURNED IT OFF. WENT INSIDE AND ABOUT 15 MINUTES LATER MY TRUCK ROLLED DOWN A HILL AND WENT ACROSS A BUSY ROUTE 15 . THE TRUCK WAS STILL IN PARK AND THE ENGINE WAS OFF AND THE WHEEL WAS STILL LOCKED AT THE BOTTOM. IT RIPPED THE PLOW OFF MY TRUCK. I'M HAVING A HARD TIME WITH THE DEALERSHIP AND MY INSURANCE IS GIVING ME A RUN AROUND. THEY DON'T WANNA COVER MY PLOW AND WANNA USE USED PARTS ON IT. I DON'T SEE WHY I SHOULD HAVE TO EAT THE DAMAGE. I DID NOTHING WRONG AND I'M PAYING FOR IT. NOT RIGHT. I'M  SELF-EMPLOYED AND I'M LOSING MONEY EVERY DAY. I'VE CALLED CHRYSLER ABOUT IT AND NOBODY IS GETTING BACK TO ME. MY POOR DAUGHTER IS SO UPSET ABOUT THIS IT'S MAKING HER SICK. I DON'T KNOW WHY WE SHOULD HAVE TO SUFFER OVER THIS. I JUST SPENT 62,000 DOLLARS ON THIS THING AND IT'S A JUNK NOW. IT WOULD BE NICE TO GET SOME  ANSWERS ON IT. THANKS SO MUCH *DT*JB  *TR",
        "vin": "3C7WRNAL9JG"
    }
]