[
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/03/2022",
        "dateOfIncident": "04/15/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459418,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS Electronic Brake System warning. \"Service Antilock Brake System\" warning as well as \"Service ABS System\" warning. Warnings are intermittent. It is available for inspection. Traction control light is on and braking seems difficult. I have not taken to a dealer because of prohibitive costs. This vehicle has not been inspected as it is a very common problem for this model truck. The problem has been intermittent for the past year or approximately 5000 miles driven (with only a total of 48,000 miles on the vehicle.",
        "vin": "3C6UR5CJ5JG"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/29/2022",
        "dateOfIncident": "01/05/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458781,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Intermittent alert on ABS and Traction Control warnings.  These warnings are not consistent and come on/off.  Researched and found numerous issues on this model vehicle for same issue related to ABS/Traction Control pump.  Checked the speed sensors, all are working and reporting same speed.  Dealer wants 2 days to trouble-shoot and there is no guarantee this will not return.  I have owned other vehicles - GMC, Ford, Subaru, etc - none of them have failed on a critical item like ABS/Traction Control.",
        "vin": "3C6UR5FL7JG"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "03/25/2022",
        "dateOfIncident": "03/20/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11458336,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Ram 2500. The contact stated while her husband was driving approximately 25 MPH the steering wheel lost functionality, the vehicle veered to the left off of the roadway. The vehicle collided with a reinforced cinder block wall on the driver's side front end, the hood impacted first and was crushed with additional damage to the undercarriage. The contact stated no warning light was illuminated. The airbags did not deploy. The husband was transported from the scene by ambulance to a hospital. The husband received cuts to left side of head and left side of face, additionally the contact had minor cuts to the left side of her face and bruised left forearm. The police were on scene and an incident report was written. The vehicle was towed to a towing lot and later towed to a collision repair center. The vehicle was not repaired. The contact researched online and related the failure to NHTSA Campaign Number 19V021000 (Steering). The manufacturer had not been informed of the failure. The failure mileage was approximately 37,000.",
        "vin": "3C6UR5DL7JG"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/23/2022",
        "dateOfIncident": "03/23/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458044,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I have been having intermittent ABS/traction control lights flashing on my dash.  When I hooked my truck up to my DTC code reader, it says I have a C0020-21 stored.  ABS pump motorcontrol - general electrical failure.  I have noticed thousands of complaints on various websites about the same issue.  My truck only has 38,000 miles on it.  This must be a defective part.....I called and asked my local dealership about this and they said its a very common issue.  I believe it is a safety issue because it reduces the trucks ability to stop quickly, it may cause my truck to swerve in an emergency stop situation, and if this happens while the cruise control is on it turns the cruise control off unexpectedly.  This happened to me in a bad rainstorm and caused my truck to swerve into the next lane over.  I asked the dealer when they could get to repairing it and thy told me it would be months before they could repair it and it would cost approximately 1,800 dollars.  They told me to just keep driving it with the error codes active.  This is ridiculous.  This part needs to be recalled because it affects thousands of vehicles and it is unsafe.  My vehicle is available for inspection.",
        "vin": "3C6UR5CL7JG"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/03/2022",
        "dateOfIncident": "10/28/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455117,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I was on vacation with my family and pulled over to the side of the road to get something from the back and the service abs electronic light came up. it was intermittently coming on and off. it really dampened our trip because i have been stranded with electrical issues in this truck before. my family was scared the brakes were going to fail and we reduced our trips into the mountain areas we had planned.  being not fully trusting of this very expensive vehicle i thought would take me anywhere i need to go i tried to sell it back to the dealer, i signed all the sale paperwork feeling like today was the best deal and they wouldnt give me the same deal the next day. only to be told i needed to pick the truck back up because of the brake system hydraulic control and brake system module being not availiable. so long story short. they said i am stuck with this truck and this is not a recall issue. i cant find the parts, this is just out of warranty period, i do not feel safe driving this vehicle. i am actively searching and do see that probably thousands of owners have the same issues, hopefully i can get the updated part and resolve this issue.",
        "vin": "3C6UR5KL5JG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/28/2022",
        "dateOfIncident": "02/01/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454537,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The antilock brake system has failed and the ABS light is on. There is a C0020 Code stored with a description. ABS Pump Motor Control: General Electrical Failure. Mopar is unable to provide a repair part in a timely manor. According to MOPAR Dealer I need 2 parts with the following part numbers. 68347098AB Anti-Lock Brake System Module 68143491AA Anti-Lock Brake System Hydraulic Control Unit This seems to be a very common failure. My vehicle is just out of factory warranty at 41K miles. While I dont mind paying for the repair, the 68347098AB Anti-Lock Brake System Module is backordered with no ETA. Does not seem safe to continue to operate the vehicle without antilock brakes. Dealer has no ETA as to when this part will be available. I can't just park my truck for an extended period.",
        "vin": "3c6ur5cl6jg"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "02/13/2022",
        "dateOfIncident": "12/26/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 1,
        "numberOfInjuries": 3,
        "odiNumber": 11451722,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "We were involved in a single car crash, it’s been over a month and it’s still under investigation. The steering link was still intact. Is there another reason that would have caused us to loose control of the steering and crash?",
        "vin": "3C6UR5FL3JG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/07/2022",
        "dateOfIncident": "01/31/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450872,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "My issue seems to be a highly reported issue that the manufacture refuses to address. The ABS pump/control/module fails on this model Ram at an alarmingly high rate, causing loss of brakes, or locking up of brakes.  I bought this truck just over 3 years ago and the first time it happened was about a year after I bought it with around 26,000 miles on the truck. I took it back to the dealer and they diagnosed it as a bad ABS control module/pump and replaced it under warranty. Since it was a safety issue the dealership even provided me with a free rental vehicle while the truck was being repaired.  When the ABS pump/control module goes out the service Electronic brake system message comes up (see picture below)  Fast forward about year and a half later and another 25k miles (the truck just hit 50k miles) and the same issue has happened again. The new ABS pump/control module has failed again with only 25k miles since the repair. And this time the truck is no longer in warranty so the dealership will expect me to foot the bill for something they know is a defective part from the factory.  Here is the link to google search, if you read the complaints you will see there are thousands of people having the same issue. And many stories of accidents or near accidents because of the brakes failing.  https://www.google.com/search?q=2018+ram+2500+abs+issues  This is a serious safety issue that needs to be addressed immediately. If the factory part remains defective, then they need to develop a replacement part that won't FAIL every year or two.  My truck just turned 4 years old and has 50k miles on it, which is right at the national average. The truck isn't over used or abused so there is no reason for the ABS to be failing not only on my truck but so many others.  Please advise me of how we can remedy this asap. I'll include my contact info below. I can scan the papers from the first warranty repair for the ABS if needed.  Regards, [XXX]  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "3C6UR5FL5JG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/02/2022",
        "dateOfIncident": "01/02/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449949,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Our truck has less than 25000 miles on it and the transmission has been consistently slipping in high gears for about the last 3000 miles. Our friends had the same truck with 46000 miles and their transmission just failed. We have read about many instances with the same transmission going out prematurely.  Our truck is available for inspection. There have been no warning lights in the truck.",
        "vin": "3c6ur5dl8jg"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/31/2022",
        "dateOfIncident": "11/08/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449528,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE ELECTRONIC BRAKING CONTROL AND TRACTION CONTROL LIGHTS COME ON AND CHIMES. AFTER SEVERAL TRIPS TO THE DEALER AND MOST OF THE TIME THEY COULD'T DUPLICATE THE PROBLEM I FINALLY HAD THE LIGHTS TO COME ON AND WENT STRAIGHT TO THE DEALER WITHOUT SHUTTING DOWN THE TRUCK AFTER THE  CHECKS THEY STATE ABS CONTROL MODULE AND HCU NEEDS REPLACED. PARTS ARE UNAVAILABLE FOR AT LEAST 6 MONTHS AND $1200 REPAIR COST. THE LIGHT COMES ON THEN THE CRUSE CONTROL STOPS WORKING AND THEN WHEN BRAKING HARD THE WHEELS LOCK UP AND CAUSES SKIDDING. TO ME THIS IS A SAFETY ISSUE THAT RAM NEEDS TO STEP UP AND REPAIR. ITS FEDERAL LAW THAT MANUFACTURES PUT ABS ON THE VEHICLES SO THEY SHOULD MAKE SURE THEY WORK CORRECTLY.",
        "vin": "3C6UR5CL1JG"
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "01/31/2022",
        "dateOfIncident": "01/31/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449578,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact's family owns a 2018 Ram 2500. The contact stated that while driving at 48-55 MPH with the vehicle hitched to a tow trailer transporting a vehicle, the rear driver's side wheel inadvertently detached, rolled away, and crashed into the front end of a vehicle that was driving on the opposite direction. The contact engaged the trailer brakes and the vehicle brake pedal to stop his vehicle. The contact was able to veer to the side of the road. There were no injuries sustained. The contact stated as he was inspecting the rear driver's side wheel, he noticed that the wheel studs were missing. A police report was filed. The vehicle remained at the scene. The contact referenced NHTSA Campaign Number: 21V398000 (WHEELS). The dealer and the manufacturer were not notified of the failure. The vehicle was not diagnosed or repaired. The failure mileage was approximately 86,000. Consumer is providing a link to photos of the incident and photos taken after the incident of the exact studs that failed. In the photos the day of the incident, a mark on the asphalt can be seen where the bare rotor slid to a halt on the side of the road. The other pictures were taken after the ram had been towed and was sitting in a grass field for ~12 days. Consumer saved all the failed studs from the vehicle. Consumer stated will be replacing the rest of the studs from the vehicle and will be saving them to along with a record of which wheel they came from.  Consumer has managed to recover the wheel itself, which does not have oblong hole damage.",
        "vin": "3C6UR5FJ6JG"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/30/2022",
        "dateOfIncident": "09/10/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449479,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Every so often I am getting the “Service Electronic Brake System” and my ABS light and Traction Control Light come on.  This has happened to quite a few Gen 4 and Gen 5 Ram’s.  Everyone replaces the wheel speed sensors, wheel hubs and ABS sensors with no fix.  Only thing after that is the Hydraulic Control Unit and ABS Control Module (which is on National back order until who knows when).  The ABS system for some reason is not covered under the power train warranty, why I don’t know.  It’s a serious issue that needs to be addressed.",
        "vin": "3C6UR5PL6JG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/18/2022",
        "dateOfIncident": "10/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447978,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Hi  2018 Dodge Ram 2500.  Screen for radio/gps/Uconnect etc is delaminating.",
        "vin": "3C6UR5FL1JG"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/16/2022",
        "dateOfIncident": "11/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447654,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving the ABS and Traction Control light comes on randomly, when on neither the ABS or Traction Control work when light is on. Cruise control is also not working when light comes on. Took Ram to dealer, they tested and stated a failure of ABS Module, took over a month to get in as they are in demand. Dealer stated this is a common issue and parts are backordered. ABS Module was replaced and system is still not working. This is a safety concern as no ABS and Traction control make the vehicle unsafe to operate. I do have the old ABS module on hand after dealer replaced old one. Dealer is trying their best, but always have one or two on lot with issue. Stopping and handling are hazardous when system goes out.",
        "vin": "3C6UR5DL3JG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/15/2022",
        "dateOfIncident": "01/03/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447621,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Was traveling westbound on highway when I got a chime and notification, \"Service Antilock Brake System\" and then another chime, \"Service Electronic Braking System\". The notification went away and both came on again. I was approaching a red light and when I applied brakes I had none. I swerved to the right and drove into a ditch. I was able to put it in 4 wheel drive and get out. While parked I started looking on YouTube and found a mechanic that advised pulling the 40 amp fuse to disable the ABS system. I did so and turned around and drove slowly home with brakes working but notification on. There were no I,juries or damage but had I hit the Fiat, with my truck, there would have been 4 dead. I notified Ram and asked why there is no recall as I looked it up and there are many incidence of this exact problem!",
        "vin": "3C6UR5DL3JG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/09/2022",
        "dateOfIncident": "10/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446775,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "For at least 2 months I have been getting intermittent warning signals for abs automatic braking system and traction control which also causes you not too have cruise control.  Without traction control wet pavement is dangerous. Vehicle just has around 20000 miles on odometer I am now out of warranty I took too get checked at Christian brothers automotive  and they diagnosed a faulty abs module.  The info I received from garage is that there was 1800 modules on back order so evidently ram has a big problem that they are failing too take care of.  Repair would be $1300 if garage could ever get ahold of module and I ate cost of diagnostics.  Please look into this problem and let me know. Thank you [XXX]  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "3c6tr5ej8jg"
    },
    {
        "components": "STEERING,SUSPENSION,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/08/2022",
        "dateOfIncident": "10/05/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446696,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Steering dang link , steering gear box has my steering throwing me all over the road . It's getting bad to almost causing wrecks and suspension is very bad . This has been getting really bad to the point of calling a lawyer",
        "vin": "3C6UR5DL8JG"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/08/2022",
        "dateOfIncident": "01/06/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446699,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The ABS and Traction Light come on intermittently.  We recently had snow fall and I had to stop quickly, the ABS worked as it should have until the light activated on the dash which disabled the ABS.  Luckily I was able to control the vehicle when it started to slide into the on coming lane. It is definitely not safe.  As I have seen in numerous complaints this is a well documented problem on the 2018 Ram 2500.",
        "vin": "3c6ur5hl4jg"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/06/2022",
        "dateOfIncident": "01/01/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446463,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The ABS warning light intermittently comes on and turns off. After searching on-line, it seems that it is an ongoing problem with many others.  I'm afraid it could cause a serious accident. I had the same problem about 10,000 miles ago and took it to Cape Coral Dodge to check it. They repaired it but here it has cropped up again. Every time the ABS Warning light goes off an alarm sounds and it drives you crazy. There really should be a recall on this to resolve the defect.",
        "vin": "3C6UR4JL8JG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/03/2022",
        "dateOfIncident": "11/02/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446070,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "12,478 miles and abs & traction control warning lights on. Diagnostic code on C0020-01 ABS pump motor control - general electrical failure.   Based on internet search this is a common problem.  FCA Star Online Publication appears aware of issue. No ABS brakes is a safety issue.",
        "vin": "3C6LR5AT5JG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/30/2021",
        "dateOfIncident": "08/25/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445644,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I, along with hundreds (if not thousands) of other Ram 2500 and 3500 owners for years 2017 through 2018 have been having an issue with the ABS Module and Hydraulic Control Unit. Have contacted the dealership and it is a well known problem with the aforementioned parts, to the tune of a 3-6 month wait for the ABS Module. The module has a manufacturing defect that FCA/Ram will not admit to, and when in fault disables cruise control and causes ABS to malfunction, which could lead to locking up of tires in an emergency braking situation. This happens intermittently and sporadically for no apparent reason. I have video of the faults happening, but cannot upload the video due to it not being the proper format.",
        "vin": "3C6UR5NJ9JG"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/28/2021",
        "dateOfIncident": "04/14/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445371,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Randomly my 2018 ram 2500 ABS/Traction control go out. It’ll happen for 10mins in an out. Sometimes not at all, and others all the time. When the ABS and traction control like come on and off on the dash it causes the brakes to become spongy and harder to brake.",
        "vin": "3c6ur5ml3jg"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/24/2021",
        "dateOfIncident": "12/21/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444928,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I have owned this vehicle from the beginning. The first thing that happened 4 wheel drive module went out causing my cruise and abs system go down took to the dealer found out the module went down they replace it under warranty. Then a couple months later the abs system went down again to it to the dealer they said the abs passenger side sensor went bad replaced it under warranty. Drove for about 6months lost abs again the same sensor went bad they replaced again under warranty. Then about 6 months the abs went down again that's when they said they hcu and abs went bad replaced it did fine. Then Dec 21 the abs started acting up took to O'Reilly here in town read the code this one came up c0020-01. Call the dealer gave the code to them they said abs most likely went out. Truck is out of warranty now by 5,000 miles. This had been an recurring problem that seems like no one wants to fix it, I haven't taken back to the dealer yet.",
        "vin": "3C6UR5CL7JG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/18/2021",
        "dateOfIncident": "11/15/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444254,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The ABS warning light would intermittently come on for any reason and then go off. Check some Dodge/Ram forums and noticed this occurring quite a bit",
        "vin": "3c6ur5dl8jg"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/14/2021",
        "dateOfIncident": "11/23/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443749,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Service Anti-Lock brake system and Service Electronic brake system messages repeatedly display along with a distracting chime. Symbols for these illuminate and then go out. The dealer spent three and a half hours trying to determine the problem about a week and a half ago. They made an appointment to pick up the vehicle this morning to look at it again \"after their electronics specialist gets back from vacation\".  No one picked it up and a call to the dealer revealed that they have no drivers available to come get it.  The constant chiming of the warning is especially distracting when driving in traffic and the intermittent nature of the problem could actually cause an accident if it occurred while the systems were trying to control a skid.",
        "vin": "3C6UR5CJ0JG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/08/2021",
        "dateOfIncident": "11/24/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443050,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Truck has intermittent abs/traction error on screen. It appears for a second or a minute. 40k on vehicle, dealer wants 1100 to fix… problem is parts are not available per dealer but Ram website shows in stock. When error codes appears, I loose cruise right away and deceleration plus I have no abs or traction control function. I tow a 7000lb in the winter. I feel that it makes the vehicle unsafe…",
        "vin": "3c6ur5fl3jg"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/06/2021",
        "dateOfIncident": "12/04/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442813,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "My 2018 Ram 2500 has over 45,000 miles on it and this is the second time that I have gotten the service antilock brake system and service electrical braking system warnings.  The first time my truck was still under warranty and the dealer replaced the parts (I believe the ABS module and the hydraulic control unit) which seemed to remedy the issue until recently.  Now here we are with the same issue coming up.  Seems that the first time occurred when turning on a wet road and the second occurred while backing up in some mud at our camp.   Seems like the culprit might be when one of the rear tires seems to slip/spin differently than the other.  Considering this is my second issue with this and there seems to be more and more complaints online for the same exact thing, this might be a defect in the parts or some other underlying issue.  I take really good care of my truck and don't abuse it and these parts should not fail this quickly.",
        "vin": "3C6UR5FL0JG"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/02/2021",
        "dateOfIncident": "11/18/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442419,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Ram 2500. The contact stated while driving 60 MPH, the Service Electric Braking System and the ABS and Traction Control warning lights were illuminated. The contact took the vehicle to a local dealer, where it was diagnosed with needing the ABS pump to be replaced. The vehicle was not repaired but was pending repairs. The manufacturer had not been informed of the failure. The failure mileage was approximately 26,800.",
        "vin": "3C6UR5FL9JG"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "11/30/2021",
        "dateOfIncident": "10/15/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442147,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The service anti-lock brake system light keep coming on and off on dash, sometimes every few minutes then it could be days before it happens again. Diagnostics code reader is listing C0020-01 - ABS Pump Motor Control General Electric Failure",
        "vin": "3C6UR5DL9JG"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/29/2021",
        "dateOfIncident": "11/27/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441949,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving and sometimes sitting still, the Service Antilock Brake System warning will flash on and off rapidly.  Then go off.  When this happens cruse control stops working.  Antilock brake functions no longer work.  And traction control no longer works. I found this out while driving on snow and ice covered roads recently. I was stopping at an intersection, and the ABS system started to work then turned off and my tires locked up, causing me to slide into the intersection.  Fortunately no one else was at the intersection. Online forums show a great number of low mileage Ram trucks like mine with this issue.  Seems to be a failure of the motors on the hydraulic control unit.",
        "vin": "3C6UR5CL7JG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/24/2021",
        "dateOfIncident": "05/05/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441638,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "My ABS system failed, taking out the cruise control also. I had to have my ABS module replaced under warranty by the dealer. The warning lamps were on and I was told this is ULTRA common on the 2018 ram 2500's, dealer wanted $1400 until they realized it was certified pre owned.",
        "vin": "3C6UR5FL2JG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/20/2021",
        "dateOfIncident": "11/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441147,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The Uconnect 8.4 system has failed, in that the screen has delaminated.  This system affects all others.  The climate control, Bluetooth, Sirius and Radio, rear view camera, and navigation system are all controlled by the Uconnect system.  The system self initiates, cannot be turned off, and randomly changes audio sources.  The navigation system does not track with the vehicle and the Bluetooth will not engage or disengage with driver input.  Additionally, the Bluetooth will automatically engage and disengage during phone calls.  This system was an expensive option, and now does not operate properly.  It is extremely distracting.  As I said, the system cannot be turned off and expected to stay off.  It operates random and autonomously.",
        "vin": "3C6UR5NJ1JG"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/17/2021",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440740,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Ram 2500. The contact stated that while operating the vehicle, the U-Connect display screen malfunctioned, causing light to be present inside the cabin of the vehicle and causing a visibility hazard for the driver while operating the vehicle in the dark. On one occasion the driver nearly hit a pedestrian due to the poor visibility caused by the defect. The local dealer and manufacturer were notified of the safety issue, but no assistance was offered. The failure mileage was 80,000.",
        "vin": "3C6UR5FL9JG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/14/2021",
        "dateOfIncident": "11/08/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440367,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS system check light comes on.  Dealer said the ABS Module has failed due to a \"internal failure\" meaning it is faulty (as per many others who have experienced this issue) and needs to be replaced along with the HCU and then the system needs to be flushed - all for $1400. The truck has 40,000 miles and is just out of warranty.  If not fixed the breaks can fail and I would crash so they have said it HAS to be done to avoid injury.  This module needs to be recalled and replaced.",
        "vin": "3c6ur4cj7jg"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/12/2021",
        "dateOfIncident": "11/12/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440188,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS and ESC lights game on the dash. Diagnosed by the dealership as a hydraulic control unit replacement. Luckily I'm within the warranty still, but many others on the forums have reported the same issues and are just outside of warranty. Obviously, this should be part of a recall.",
        "vin": "3C6UR5NL7JG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/11/2021",
        "dateOfIncident": "10/28/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440106,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle antilock breaking system began cycling on and off during a stop.   Service Antilock Break System warning began illuminating at about one second intervals.",
        "vin": "3C6UR5FL0JG"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "11/09/2021",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439861,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "8.4 Uconnect (media center) screen delamination causing \"ghost touches\"/glitches on the touchscreen, which prevent backup camera from functioning.  While backing up, camera randomly turns off or switches to a separate cargo camera.  Backup camera often remains on while driving forward.  Ghost touching also cause random phone calls and emergency phone calls, which cause a distraction to driving.  According to simple Google search, 8.4 Uconnect screen delamination appears to be a common problem even on low-mileage vehicles.  Manufacturer/dealer will not replace outside of warranty.",
        "vin": "3C6UR5FJ2JG"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/08/2021",
        "dateOfIncident": "09/02/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439810,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Constant warning to service electronic braking system kicks out cruise control.  According to ram this is a known problem with related module",
        "vin": "3C6UR4FL1JG"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/03/2021",
        "dateOfIncident": "09/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439168,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The Service Electric Braking System and the Service Antilock Brake System warning lights come on with chime. I or other have not been put into risk of safety as of yet. No dealer will look at it right now. I have called 2 dealerships and they both told me that they have to many vehicles as of now to look at it. At what point is mine and others safety con into play? I need my truck for my business and can't afford to let it go for long.",
        "vin": "3C6UR5NL1JG"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "11/02/2021",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439057,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact called inquiring about a Law Enforcement vehicle (2018 RAM 2500). November 2020, vehicle shut down while traveling up a road. “Lost all PCM communication.” Instrument cluster was on, but vehicle would not start, multiple warning lights were illuminated. The vehicle was not drivable. Towed vehicle to Flower Motors (RAM) in Montrose, CO where it was diagnosed with needing a PCM replaced. The vehicle was repaired, however it continued to experience the same failure. July 2021 while the same Law Enforcement Officer was traveling at 30 mph in a 35-mph zone into a sharp right turn, the vehicle \"lost all the PCM communication\". The Law Enforcement Officer could not stop, due to no brakes and had a difficult time turning the vehicle. The Law Enforcement vehicle crossed the road into the oncoming lane of traffic and off the shoulder into Sagebrush. The Law Enforcement Officer was able to steer to the right and drove back onto the road and across both lanes of traffic, exiting off the road surface and into more Sagebrush. The Law Enforcement vehicle finally came to a stop. Multiple warning lights illuminated. The air bags did not deploy. The Law Enforcement Officer was not injured nor sought medical attention. No police report was filed. The Law Enforcement vehicle was not drivable and had to be towed Flower Motors (RAM) in Montrose, CO where it was diagnosed with needing the PCM replaced for a second time. The Law Enforcement vehicle was repaired, however, it continued to experience same failure. August/September 2021, the Law Enforcement vehicle again “lost all the PCM communication”. The Law Enforcement Officer was pulling up to a highway getting ready to merge onto the highway when the Law Enforcement vehicle shut down. The Law Enforcement vehicle was not drivable and was towed to Berthod Motors (RAM) in Glenwood Springs, CO where it was diagnosed with needing the PCM to be replaced for a third time. Multiple warning lights were illuminated. November 2021, the Law Enforcement vehicle was being driven approximately 10-15 mph on a road when the Law Enforcement vehicle shut down. As with the other three times, the instrument panel indicated multiple warning lights. The Law Enforcement vehicle would not start, was not drivable and had to be towed to Flower Motors in Montrose, CO where it was diagnosed with needing the PCM to be replaced. The manufacturer had been informed of the 4 failures. The failure mileage with less than 73,000 miles. Flower Motors (RAM) – 2580 N. Townsend Ave., Montrose, CO 81401 – (970) 249-9664. Berthod Motors (RAM) – 400 27th St., Glenwood Springs, CO 81601 – (970) 945-7466",
        "vin": "3C6UR5CJ8JG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/29/2021",
        "dateOfIncident": "05/27/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438597,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The rear backup camera intermittently goes out when backing up. Alot of the time it just don't work at all and you'll get a blue screen or a very hard to make out image that's extremely blurry. I'd have a feeling that this problem is more if an electrical connector problem because you can slam the tailgate and it will go back to working just fine for a little while till you hit a bump in the road or open your tailgate again. It can be  extremely dangerous not being able to use your backup camera in such a big truck.",
        "vin": "3c6ur5fl1jg"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/26/2021",
        "dateOfIncident": "10/06/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438197,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOVE VEHICLE 2018 RAM 2500 HAS ISSUE WITH THE ABS SYSTEM AND OR ELECTRONIC BRAKING SYSTEM. ABS LIGHT BLINKS ALONG WITH TRACTION CONTROL BECAUSE OF A ISSUE WITH THE ABS MODULE AND OR ABS PUMP. THIS ISSUE IS WELL DOCUMENTED IN NUMEROUS RAM TRUCKS, NEW AND USED,  OF A FAILING PART OR PARTS THAT CAUSES A SAFTEY CONCERN. WHEN THIS PART FAILS , YOU LOSE YOUR ANTI LOCK BRAKES AND IT ALSO PUTS YOUR VEHICLE WITH NO TRACTION CONTROL. THIS ISSUE NEEDS TO BE ADDRESSED AND A SAFTEY RECALL NEEDS TO BE ISSUED TO FIX THIS PROBLEM BEFORE SOMEONE GETS HURT OR KILLED DUE TO THEIR VEHICLE LOSING CONTROL DURING BRAKING OR DURING ACCELERATION.",
        "vin": "3C6UR5DL5JG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/25/2021",
        "dateOfIncident": "10/06/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438026,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Abs and electronic braking system pump failed and need replaced around 40,000 miles. Was told it is a common known issue with these trucks",
        "vin": "3c6ur5fj8jg"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "10/25/2021",
        "dateOfIncident": "09/27/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438091,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving my 2018 Ram 2500, the Service Electrical Breaking System and Service Anti-locking Break System flashes on and off. It usually does this while traveling on a bumpy road or driving over railroad tracks. Sometimes it will go days without coming on and some days while driving it constantly beeps and flashes the entire time while driving and it really distracts me from driving. When I called my local Ram dealership Lander's Dodge Bossier City, to make an appointment, they knew that it was a  2018 Ram 2500 before I told them. The first available appointment isn't until 22 November 21.",
        "vin": "3C6UR5NJ3JG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/25/2021",
        "dateOfIncident": "10/22/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438123,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Ram 2500. The contact stated that the vehicle was repaired at the dealer under NHTSA Campaign Number: 20V036000 (Power Train) however, the failure occurred after the recall was repaired. The transmission shifter would not shift to drive after the vehicle was parked. The transmission shifter cable disconnected from the transmission, causing the vehicle to not perform shifts intended by the driver. Additionally, the gear shift lever position on the dashboard did not match the actual transmission gear. The vehicle was towed to the dealer. The vehicle was not diagnosed nor repaired and remained at the dealer. The manufacturer was made aware of the failure. The failure mileage was approximately 30,000.",
        "vin": "3c6trvdgxje"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/25/2021",
        "dateOfIncident": "09/06/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438130,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The \"Service ABS\" light started intermittently going on and off on our 2018 truck. The truck has only 8,400 miles on odometer, and the issue started just three months after the bumper to bumper warranty expired. Taken to the RAM dealership and to an independent shop  we were told that C0020 ABS pump motor failed and ABS pump and module must be replaced and reprogrammed. After doing some research on the web, we read of several cases identical to ours,. Still the dealerships did not offer any assistance and we are waiting to hear back from FCA/RAM. Since the issue is well known and common to a large number of vehicles (just google the error code) we wonder why this is not part of a recall. Braking systems are an integral safety part of the vehicles and the fact that the manufacturer is not acting on this issue despite being well aware of it being a  common problem on their trucks is just irresponsible.",
        "vin": "3C6TR5EJ5JG"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/19/2021",
        "dateOfIncident": "10/17/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437385,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Ram 2500. The contact stated that the central control system head unit malfunctioned and turned off. Additionally, the head unit would activate or deactivate other systems in the vehicle without driver input. The contact had taken the vehicle to the dealer who diagnosed that the central control system radio head unit needed to be replaced. The vehicle had not been repaired. The manufacturer was made aware of the issue. The approximate failure mileage was 29,000.",
        "vin": "3c6ur5dl6jg"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/14/2021",
        "dateOfIncident": "09/23/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436827,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The abs light and traction control light came on with chiming going off. The lights would go on and off at random. Didn't start till I washed my truck. Took to dealer they said the ABS module bad and ordered it. They say warranty will cover it. They shut the light off and reset the system. Stayed off till I washed the truck again. The part is in just need to have taken to shop to put on. This should be a RECALL for as many of these trucks that this has happened too. The cruise control, won't work and how do you now that the brakes will stop the truck if someone pulls out and you hit the brakes hard if the ABS system isn't working right. They inspect the truck and see that the ABS system was not working who is liable in a law suite. Chrysler won't say that it is a problem. Something needs to be done about Chrysler (or any manufacture) responsible for the safety of the consumer buy there product. The truck only has 21,536 miles on it now. If it wasn't under warranty it wouldn't be fixed. It had 20,659 miles when went in to dealer. it had 20,583 miles when the light first came on.",
        "vin": "3C6UR5NL0JG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/04/2021",
        "dateOfIncident": "10/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435359,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 Ram 2500, 45637 miles. Service Electronic Braking System and ABS/TRACTION CONTROL lights illuminated. Code present. C0020-1 = ABS PUMP MOTOR CONTROL. ELECTRICAL FAILURE.  This is a known issue and a technical bulletin and star report has been produced. Chrysler needs this as a recall as these are all low mile vehicles and the end user had no input on the component failure. ABS problems are a safety issue and required to work properly according to the law.",
        "vin": "3c6ur5fl0jg"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/26/2021",
        "dateOfIncident": "09/21/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434426,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The truck was in at 35,486 miles because the service four-wheel light was coming on while towing the dealership said the electrical connector to front axle disconnect is packed with grease pushing pins from the electrical connector cleaned excessive grease from connector and repaired pins and reassembled Road tested verified repair shortly three weeks after the service ABS light has been coming on and off when it comes on with the cruise control on it causes sudden deceleration also when the service ABS light is on anti-lock brakes do not work and traction control light is also on it comes on and goes off while driving just like the service four-wheel-drive light I have not had it in yet for service due to the fact still fighting with warranty but to me it seem like an electrical short issue",
        "vin": "3c6ur5flxjg"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/20/2021",
        "dateOfIncident": "09/19/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433635,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The display on the instrument panel said service anti lock brake system and service electronic braking system. Also a warning chime sounded and warning indicator lights for the anti lock brake and traction control malfunctions came on.",
        "vin": "3C6UR5DL4JG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/06/2021",
        "dateOfIncident": "09/06/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431895,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Center console touchscreen is de laminating and executing vehicle functions on its own while I’m driving. Very unsafe and distracting. This is apparently a very common issue.",
        "vin": "3c6ur5dl0jg"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/30/2021",
        "dateOfIncident": "08/26/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430977,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "C0020-01-ABS PUMP MOTOR CONTROL - GENERAL ELECTRICAL FAILURE.  I called the dealership and was told by service advisor at Maik Haik Dodge in Temple, Texas this is a common issues and Ram knows about it. It is effecting Ram trucks from 2014 to 2018 models 1500 to 3500.  This issue turns off all ABS, Traction Control and Disables cruise control.  The Abs and traction control light goes off and on constantly. message on the dash is service ABS system and service electric brake system.",
        "vin": "3C6UR5ML9JG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/28/2021",
        "dateOfIncident": "08/24/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430849,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "My husband was driving a \"gsa work truck\" when the steering linkage apparently broke. After running the vin, it shows there is a unrepaired recall. After someone contacted management in regards to the unrepaired recall, an employee named kirt flowers claims that the recall was fixed, but the dealership failed to put it in the system. (Highly unlikely!) Even if that was true, the \"repair\" failed. Either way, someone could have been killed!",
        "vin": "3C7WR5HJ5JG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/23/2021",
        "dateOfIncident": "08/11/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430234,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS light came on. Dealership said that ABS Control Valve is defective.  Could lead to safety issue.  Have read on several forums that this is a reoccurring problem with this vehicle.  My vehicle has only 30,000 miles. Have only owned it for three years.  Should this be listed as a recall item?  Warranty declines to cover.",
        "vin": "3C6TR5EJ7JG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/19/2021",
        "dateOfIncident": "07/15/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429751,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The anti lock brake and electronic braking system are throwing alerts on dashboard. It cuts off cruise control as well. This is a safety concern for us and other vehicles. On all ram forums there are complaints wanting to start a class action. This is a very common problem with the ram trucks. It costs $800-$1000 out of pocket. These sensors are a safety feature that one would expect to be able to depend on. The negligence of these safety features need to be addressed.",
        "vin": "3C6UR5FL1JG"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "08/10/2021",
        "dateOfIncident": "08/10/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428540,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Regarding the Safety Recall V06 / NHTSA 19V-021 Drag Link.   This issue regarding the jam nuts on the drag link needs to be remedied. It calls for welding an adjustable part of the steering linkage rendering it non- adjustable when having the front end aligned in the future. Not to mention the effect of welding, potentially causing a problem with the integrity of the metal. The correct fix for this SAFETY issue is to REPLACE this steering linkage component, the entire Drag Link! And NOT a weld job on the steering linkage of all things! I am appalled that NHTSA approved such a thing. PLEASE revisit this issue and do the right thing. Require Chrysler (FCA US LLC) to REPLACE this defective part with the proper part. Note.... Chrysler is not welding the nuts on the drag links on trucks coming off the assembly line! They are coming off with proper, safe, adjustable drag links!",
        "vin": "3C6TR5EJ1JG"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/09/2021",
        "dateOfIncident": "08/03/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428361,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Abs and tc lights come on and ding randomly, freedom service told me it’s a hydraulic pump and causes a safety issue it also knocks cruise control off when it happens. The dealership said they have changed many so I am sure ram is aware of this issue.",
        "vin": "3C6UR5CL4JG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/30/2021",
        "dateOfIncident": "07/23/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427176,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The DEF Pump responsible for controlling the flow of Diesel Exhaust Fluid to reduce exhaust emissions prematurely fails (in my case, it was at 61,000 miles) which forces the truck into \"limp mode\" limiting the speed of the vehicle to 5 miles per hour. Additionally, once this part fails, the truck cannot properly dispense DEF to the exhaust to reduce diesel emissions as designed and as mandated by the EPA.  Manufacturer acknowledged failure of the part and began redesign and remanufacture of the DEF Pump prior to the Covid pandemic. Replacement part availability is sporadic at best. Further, repair of this component has not been covered by Federal emissions warranty or any extended warranty of the drivetrain, thus forcing a several thousand dollar repair on the consumer. Online search reveals thousands of other Ram truck owners who are experiencing the same issues as described here  My vehicle has been appropriately maintained and yet this occurred without warning of the imminent failure. Once the failure occurs, the vehicle poses significant risk to the environment due to inappropriate emissions, and places an undo financial burden on the consumer for a known manufacturing defect.  I brought my vehicle to an authorized Ram dealership who diagnosed the issue as described above and then repaired the vehicle at a cost to me of approximately $ 2,100.00.",
        "vin": "3C6UR5FL9JG"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "07/29/2021",
        "dateOfIncident": "07/05/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427045,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Ram 2500. The contact stated that the infotainment system ceased randomly without warning. The back-up camera was inoperable. Upon investigation, the contact associated the failure with NHTSA Campaign Number: 18V398000 (Back Over Prevention) however, the Vin was not included. The vehicle was diagnosed and repaired; however, the failure persisted. The manufacturer was informed of the failure and the contact was awaiting a response. The failure mileage was approximately 23,242.",
        "vin": "3C6TR5CT0JG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/19/2021",
        "dateOfIncident": "07/18/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425405,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Drag link even welded on is throwing my steering off bad. It’s not safe and they should just put an aftermarket or better drag link on.",
        "vin": "3C6UR5DL1JG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/19/2021",
        "dateOfIncident": "07/19/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425424,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Touch screen delaminated causing random inputs and essentially disabling phone, SOS feature, rear parking assist, climate control, audio input control, BlueTooth, etc.",
        "vin": "3C6UR5JL4JG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/15/2021",
        "dateOfIncident": "07/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424963,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "truck engine failure at 120,920 miles.  6.4 hemi in a 2500 ram truck.  this is the 3rd truck that has engine failure at approx 120,000 miles and reports of bearing metal in the block.  seems that there is an issue with the engine parts that are not lasting and resulting in engine failure while in operation.  loss of power and power.",
        "vin": "3C6UR5HJ5JG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/09/2021",
        "dateOfIncident": "07/08/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424139,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Intermittent dash notification to Service Electronic Braking System  It is the braking system and there is noted thousands of these failed systems at very low vehicle mileage  I have not had it in the shop, it just started yesterday but during my investigation of possible solutions I found thousands of the same problem going back years, Ram is well aware  yes, the dash board lights and dings as well as a written dash warning.  I also got the info on my cell phone",
        "vin": "3C6UR5FL2JG"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/01/2021",
        "dateOfIncident": "06/24/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423103,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS module, HCU module Currently available to be inspected if dealer won’t fix.  Potential loss of brakes.  Dealer confirmed I had codes relating to a known problem with both abs and hcu modules.  Dealership ran diagnostics.  Service braking system warning lamp appeared on dash. Codes C0020 and U0147.  FCA star letter case #: S2005000004 Letter relates to codes stating general electrical failure.   Dealership wants to charge me $785.21 to fix.  They started by saying the cost would be close to $2800, when I asked why so much, they said I need several other repairs but couldn’t provide a break down. I brought my vehicle in with the letter about the faulty equipment and the codes and was told it would get taken care of.",
        "vin": "3c6ur5jl5jg"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/28/2021",
        "dateOfIncident": "06/20/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422709,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "the service abs and service traction control come on if i hit any bump on the road, seems to be a common problem with this vehicle model.",
        "vin": "3C6UR5CJ2JG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/24/2021",
        "dateOfIncident": "04/30/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422168,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The screen is delaminating for the navigation system.  It has also affected the ability to use my phone hands free through Autoplay or bluetooth as the screen is malfunctioning",
        "vin": "3C6UR5ML6JG"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/18/2021",
        "dateOfIncident": "05/26/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11421428,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Head on collision occurred doing 50mph and airbags did not deploy.  Impact was hard enough to twist the frame of the truck.",
        "vin": "3C6UR5CL3JG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/28/2021",
        "dateOfIncident": "04/30/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418837,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Traveling West on I10 Mobile, AL it was raining and the ABS and TCS system lights started flashing along with a waring bell. this was repeating about once every 10-15 seconds. The road was in the process of being resurfaced and was rough. Return home to make an appointment with the dealer and was told five days was first available. Used a bi-directional scan tool to verify the fault as a ABS motor connection fault. Purchased the OEM hydraulic control unit installed and corrected the problem. After replacement the bad unit dc motor was found to be open no electrical connection. I have also performed a simple failure analysis. I found that one of the two DC motor brushes to be stuck in the brush holder. this appears to be causing intermittent connection faults on the rough road and total failure in the near future. I have found that the other brush that was making contact with the motor armature could be pushed into the brush holder and would also stick for a short time. This looks to be a design and or tolerance issue. I cut the outer motor housing with a small metal cutting wheel, while removing the armature probably pushed the bad brush into it's deeper position with no contact. I have all the parts if the NHTSA would like to inspect the motor.",
        "vin": "3C6UR5DL4JG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/26/2021",
        "dateOfIncident": "05/02/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418684,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Ram 2500. The contact stated while driving at undisclosed speed, the contact pressed the auto memory button on the front driver’s side seat and became aware that the electronic control unit on the vehicle had reset itself and radio which caused the front driver’s and passenger’s side rearview mirrors to open and close independently. Additionally, the front driver’s and passenger’s side windows activated independently. The contact stated that the failure recurred several times. The vehicle was taken to the local dealer and diagnosed the failure with an electronic control unit failure however, the mechanic was unable to duplicate the failure. The contact took the vehicle to another dealer, Wake Forest Dodge RAM (10936 Star Rd, Wake Forest, NC 27587, (919) 899-4586) who inspected the vehicle and confirmed the failure with the electronic control unit in the radio. The unit was replaced however, the failure persisted. The vehicle was not yet repaired. The manufacturer was made aware of the failure. The approximate failure mileage was 33,000.",
        "vin": "3c6ur5fl7jg"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/03/2021",
        "dateOfIncident": "04/30/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414945,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2018 RAM 2500 WITH 24320 MILES ON IT. THE TRACTION CONTROL LIGHT/ ABS/EBS SERVICE LIGHTS COME ON WHEN DRIVING. THE SPEED CONTROL GOES OFF. I HAVE SEEN ON THE RAM FORUM THAT THIS IS COMMON ON THIS AND THE 2017 YEARS TOO. MY QUESTION IS IF THERE ARE SEVERAL 100 PEOPLE WITH THE SAME PROBLEM. WHY HAVE YOU NOT ISSUED A RECALL. THIS WILL GET SOMEON KILLED IF THEY ARE NOT CAREFUL.",
        "vin": "3C6UR5CJ6JG"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/19/2021",
        "dateOfIncident": "04/16/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11412835,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 RAM 2500. THE CONTACT STATED THAT WHILE DRIVING 50 MPH, THE FRONT END OF THE TRUCK STARTED VIOLENTLY SHAKING WITHOUT WARNING. THE CONTACT LOSS CONTROL OF THE STEERING WHEEL. THE CONTACT SLOWLY REGAINED CONTROL OF THE VEHICLE AND DROVE THE VEHICLE TO MOSS BROS. CHRYSLER JEEP DODGE RAM SAN BERNARDINO (1100 S E ST, SAN BERNARDINO, CA 92408) WHERE THE VEHICLE WAS LEFT OVERNIGHT. THE FOLLOWING DAY, THE CONTACT WAS INFORMED BY THE DEALER THAT ALL FOUR TIRES HAD FLAT SPOTS AND NEEDED TO BE REPLACED. THE CONTACT THEN TOOK THE VEHICLE TO AN INDEPENDENT MECHANIC WHERE IT REMAINED IN THEIR POSSESSION AND WAS NOT YET DIAGNOSED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 4,000.",
        "vin": "3C6UR5HL2JG"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/14/2021",
        "dateOfIncident": "04/14/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408095,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSISTANT FLASHING UP \"SERVICE ELECTRONIC BRAKING SYSTEM\" AND \"SERVICE ANTILOCK BRAKING SYSTEM\" WHILE DRIVING.  DEALER HAS ATTEMPTED TO REPAIR REPLACING ABS MODULE AND HCU, BLED AND RECALIBRATED THE BRAKING SYSTEM.  ISSUE RETURNS AFTER FEW THOUSAND MILES.  ONLINE FORUMS SHOW A LOT OF OTHER OWNERS OF THIS TRUCK WITH THE SAME ISSUE.  BRAKES SUDDENLY FAILING IS A SERIOUS SAFETY ISSUE!  FIRST ISSUE WAS AT 14K MILES, RETURNED AT 37K MILES.  THE ALERT COMES UP AT RANDOM TIMES SUCH AS DRIVING DOWN THE HIGHWAY AT 70 MPH OR SITTING AT A LIGHT.  DOES NOT SEEM RELATED TO ACTUALLY ENGAGING THE BRAKES TO HAVE THE ERROR.",
        "vin": "3C6UR5FL2JG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/09/2021",
        "dateOfIncident": "01/12/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407239,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SPORADICALLY VEHICLE WILL NOT START. DASHBOARD LIGHTS FLASHING, DISPLAY TOGGLES THROUGH WARNINGS, IDLE NEEDLE AND SPEEDOMETER NEEDLE MOVING WHILE PARKED, VEHICLE NOT ON. THIS HAS HAPPENED SEVERAL TIMES. LOCAL DODGE DEALER IS CURRENTLY ON 3RD VISIT TO REPAIR.",
        "vin": "3C6UR4HLXJG"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/16/2021",
        "dateOfIncident": "11/14/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403183,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TOUCH SCREEN ON THE CENTRAL CONTROL COMPUTER/ENTERTAINMENT/CELL PHONE SYSTEM HAS DELAMINATES AND RANDOMLY SELF SELECTS BUTTONS. ON MORE THAN ONE OCCASION THE DISTRACTION OF CANCELLING PHONE CALLS AT ALL HOURS, ACTIVATION OF BACK UP CAMERAS AND SIGNALS THAT TELL THE VEHICLE TO DO WIERD THINGS NEGATIVELY IMPACT OF DRIVERS ATTENTION AND FUNCTION' THERE ARE LAWS ABOUT DISTRACT4D DRIVING AND THIS IS A MAJOR DISTRACTION.  I HAVE TRIED TO RESOLVE THE ISSUE WITH THE MANUFACTURER AND THEY ARE UN RESPONSIVE.    LOOKING AT THE VIDEOS ON HOW TO RE-LACE THE TOUCH SCREEN DUE TO MANUFACTURER REQUESTING OVER $1500 TO REPLACE BASED ON FALSE CLAIMS OF BROKEN/CRACKED GLASS IN THE SCREEN. WHEN THE REAL ISSUE IS THE TOUCH SCREEN MANUFACTURER FAILED TO USE AN ADHESIVE THAT CAN WITHSTAND THE HEAT WITHIN THE CLOSED CABIN OF A STATIONARY VEHICLE.",
        "vin": "3C6UR5FL8JG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/09/2021",
        "dateOfIncident": "01/02/2000",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399942,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WINTER STORM WARNING KEEPS POPPING UP ON MY SCREEN AND IVE SEARCHED EVERYTHING TO NO AVAIL OF DISCONNECTING.... THIS IS AGRAVATING AND DISTRACTING HELP  THIS IS ALSO DANGEROUS WHILE MOVING ,,,DISTRACTING",
        "vin": "5RXFB3222K2"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/07/2021",
        "dateOfIncident": "01/15/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395089,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK SLIDES AFTER BEING PARKED . IT HAS SLID ANYWHERE FROM 1 FOOT WHILE I STOOD THERE WATCHING. TO SEVERAL FEET WHERE I HAD TO JUMP BACK INTO THE TRUCK TO STOP IT. AND OVER 14 ONE NIGHT FROM THE TIME I PARKED TO WHEN I CAME OUT THE NEXT MORNING. DOES NOT FULLY ACCELERATE THRU A TURN.,TOUGH TO TURNS SOMETIMES. IN SAME TURNS",
        "vin": "3C6UR5DJ3JG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/01/2021",
        "dateOfIncident": "01/29/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11391132,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRAG LINK ON ABOUT 795,000 OF THE ABOVE VEHICLES MAY HAVE BEEN BUILT WITH AN OUTBOARD STEERING LINKAGE JAM NUT THAT COULD LOOSEN ALLOWING ONE END OF THE DRAG LINK TO SEPARATE FROM THE ADJUSTER SLEEVE. A DRAG LINK SEPARATION CAN RESULT IN A LOSS OF DIRECTIONAL STEERING CONTROL, WHICH CAN CAUSE A VEHICLE CRASH WITHOUT PRIOR WARNING.",
        "vin": "3C6UR5CL8JG"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/22/2021",
        "dateOfIncident": "01/22/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389366,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I AM DRIVING I WILL RANDOMLY GET A WARNING \"SERVICE AIRBAG SYSTEM\" AND THEN IT WILL TURN OFF RANDOMLY. AFTER DOING SOME RESEARCH AND SPEAKING TO A DEALERSHIP THIS IS A KNOWN ISSUES WITH THE WIRING UNDER THE SEAT. THE DEALER DIDN'T KNOW IF THE AIRBAGS WOULD STILL WORK WHEN THE WARNING WAS PRESENT.",
        "vin": "3C6UR5HJ6JG"
    },
    {
        "components": "STEERING,SUSPENSION,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/02/2021",
        "dateOfIncident": "01/02/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386079,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE TRUCKS USED FROM A DEALERSHIP RICK HENDRICK IN FAYETTEVILLE, NC.  IN MARCH OF 2019. IT ONLY HAD 20,000 MILES ON IT.  ISSUE ONE WAS THEY SOLD IT TO ME WITH PARTS THAT VOID WARRANTY PER CHRYSLER AND THIS WAS NOT DISCLOSED UP FRONT. MAIN PROBLEM I HAD TO THREATEN TO SUE IN ORDER TO GET MONEY BACK TO GET TIRES WITH THE CORRECT CLASS RATING AS I COULD NOT TOW WITH IT.  NEXT ISSUE WAS THEY WOULD NOT WARRANTY BAD WHEEL BEARING OR BREAKS AT 37000 MILES WHICH PER THEM WAS DUE TO A LIFT KIT.  THERE IS NO LIFT KIT ON THE TRUCK BUT SOMEONE INSTALL A LEVELING KIT. DODGE ALSO PERFORMED A WARRANTY RECALL ON THE TRUCK AFTER IT WAS PURCHASE WHICH IS THE D TRUCK DRAG LINK.  IT HAS SINCE COME UNDONE AND THERE IS NO CORRECT FIX FOR THIS OR SOLUTION TO THIS PROBLEM. NO ONE ELSE WILL TOUCH THE ISSUE OR RESOLVE IT WHEN CHECKING ALIGNMENT.  NOW MY STEERING WHEEL IS WAY OFF BY ROUGHLY 30 DEGREE FROM CENTER AND THE TRUCK IS HARD TO DRIVE ON HIGHWAY.  I HAVE TAKEN IT IN TO HAVE DODGE REDO THIS WORK AND NOW THEY REFUSE TO DO IT AND WANT ME TO GO FOR A WEEK WITHOUT MY TRUCK WHICH I CAN NOT DO WHILE THEY INVESTIGATE AND FIGURE OUR WHAT NEEDS TO BE DONE.  CURRENTLY THEY ARE NOT OFFERING ME ANOTHER VEHICLE TO DRIVE.  I'VE TAKEN THE TRUCK TO OTHER AUTO REPAIR PLACE AND NO ONE WILL WORK ON THIS DUE TO RECALL. DODGE HAS TO DO THIS AND MAKE IT RIGHT ITS NOT MY FAULT AND THE TRUCK IS NOT SAFE TO DRIVE BUT I HAVE NO CHOICE AS I HAVE NOTHING ELSE TO DRIVE FOR WORK.  IN SHORT THE STEERING IS VERY LOSE AND IF THIS D LINK COMES ANY LOSER IT COULD CAUSE THE TRUCK TO CRASH AND ME TO LOSE CONTROL WITH OUT ME DOING ANYTHING BUT DRIVING NORMAL ON HIGHWAY. PLEASE HELP WHAT CHRYSLER AND DODGE ARE DOING TO BE IS WRONG.  I JUST WANT MY TRUCK TO WORK RIGHT ITS ONLY A 2018 AND I HAVE PAID GOOD MONEY FOR EVERYTHING TO GET CORRECT AND IT STILL IS NOT. YOU CAN PULL EVERYTHING ON TRUCK IN CAR FACT REPORTS.",
        "vin": "3C6UR5PL3JG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/30/2020",
        "dateOfIncident": "04/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385582,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 RAM 2500. THE CONTACT STATED THAT THE VEHICLE INDEPENDENTLY DRIFTED TO THE RIGHT WITHOUT WARNING, WHILE DRIVING AT VARIOUS SPEEDS. THE CONTACT HAD THE VEHICLE SERVICED TWICE BY AN INDEPENDENT MECHANIC FOR THE FAILURE HOWEVER, THE FAILURE PERSISTED. THE CONTACT THEN RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V021000 (STEERING). THE VEHICLE WAS REPAIRED UNDER RECALL BY DAYTONA DODGE CHRYSLER JEEP RAM & FIAT (1450 N TOMOKA FARMS RD SUITE A, DAYTONA BEACH, FL 32124). SOON AFTER THE REPAIR, THE FAILURE RECURRED. THE DEALER WAS CONTACTED AND INFORMED OF THE FAILURE. THE CONTACT WAS INFORMED THAT HE HAD TO PAY A DIAGNOSTIC FEE OUT OF POCKET BEFORE THE VEHICLE COULD BE REPAIRED. THE CONTACT DECLINED THE OFFER AND TOOK THE VEHICLE TO AN INDEPENDENT MECHANIC WHERE THEY INFORMED HIM THAT THE WELDING TO THE SLEEVE ON THE DRAG LINK HAD LOOSENED. THE VEHICLE REMAINED IN THE POSSESSION OF THE INDEPENDENT MECHANIC. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 6,000.*DT*JB",
        "vin": "3C6TR5EJ8JG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/07/2020",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378374,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 RAM 2500. THE CONTACT STATED THAT AFTER A WHEEL ALIGNMENT WAS PERFORMED ON THE VEHICLE, THE STEERING WHEEL WOULD INDEPENDENTLY VEER TO THE LEFT WHILE DRIVING AT VARIOUS SPEEDS, WITHOUT WARNING. THE CONTACT HAD TAKEN THE VEHICLE TO CERRITOS DODGE CHRYSLER JEEP RAM (18803 STUDEBAKER RD, CERRITOS, CA 90703) WHERE HE WAS INFORMED THAT A JAM-LINK ON THE STEERING NUT HAD LOOSENED. THE NUT WAS TIGHTENED AND ANOTHER WHEEL ALIGNMENT WAS PERFORMED. THE CONTACT THEN TOOK THE VEHICLE TO AN INDEPENDENT MECHANIC WHO INFORMED HIM THAT BOTH JAM LINKS HAD LOOSENED AND BOTH WERE TIGHTENED. THE STEERING FAILURE PERSISTED AND THE VEHICLE WAS TAKEN TO LOS ANGELES CHRYSLER DODGE JEEP RAM (2025 S FIGUEROA ST, LOS ANGELES, CA 90007) WHERE HE WAS THEN INFORMED OF NHTSA CAMPAIGN NUMBER: 19V021000 (STEERING) WHICH WAS LINKED TO THE FAILURE. THE CONTACT STATED THAT PREVIOUS RECORDS SHOWED THAT AN INSPECTION WAS PERFORMED PRIOR AND NO FAILURE WAS FOUND THEREFORE, THE RECALL WAS REMOVED FROM THE VEHICLE. THE DEALER INFORMED THE CONTACT THAT THEY WOULD CONTACT THE MANUFACTURER FOR GUIDANCE ON HOW TO PROCEED. THE VEHICLE WAS NOT YET REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 15,500.*DT*DT *TR*DT *JB",
        "vin": "3C6UR5FL5JG"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "11/16/2020",
        "dateOfIncident": "11/04/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374813,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A SERVICE THE ELECTRONIC BRAKING SYSTEM. THERE IS ONLY 13,900 MILES ON THE VEHICLE. I HAVE SEEN FORUMS THAT THIS A MAJOR ISSUE THAT KEEPS HAPPENING.",
        "vin": "3C6UR5GL2JG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/02/2020",
        "dateOfIncident": "11/02/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372637,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE ANTI-LOCK BRAKE SYSTEM AND SERVICE ELECTRONIC BRAKE SYSTEM INTERMITTENTLY DISPLAYED ON THE DASH ALONG WITH THE LAMPS ILLUMINATING.  THIS OCCURED WHILE DRIVING ON THE INTERSTATE.  AFTER RESEARCHING, THIS APPEARS TO BE A COMMON PROBLEM FOR THESE VEHICLES.",
        "vin": "3C6UR5NL3JG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/01/2020",
        "dateOfIncident": "01/07/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372516,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "APPARENTLY RAM WELDED THE JAM NUTS TO THE ADJUSTER SLEEVE ON MY NEW 2018 RAM 2500 HD PRIOR TO ME TAKING DELIVERY OF THE VEHICLE LAST YEAR. AFTER INSTALLING NEW TIRES, I ATTEMPTED TO HAVE MY TRUCK ALIGNED BUT WAS TOLD BY MY MECHANIC THAT HE WAS NOT WILLING TO ALIGN THE TRUCK DUE TO THE WELDS ON THE DRAG LINK ASSEMBLY. I WAS FORCED TO PURCHASED AN UPDATED DRAG LINK ASSEMBLY FROM RAM TO ALLOW MY TRUCK TO BE ALIGNED, BUT MY REIMBURSEMENT REQUEST TO FCA HAS BEEN DENIED BECAUSE THEY FEEL THE WELDS WERE SUFFICIENT TO REPAIR THE DEFECT OUTLINED IN THEIR V06 RECALL. THE SAFETY OF MY FAMILY SHOULDN'T REST ON TWO BOOGER WELDS THAT WERE NOT PERFORMED BY A CERTIFIED WELDER AND FCA SHOULD BE LIABLE FOR THE COST OF THE PROPER REPLACEMENT PARTS.",
        "vin": "3C6TR5EJ7JG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/23/2020",
        "dateOfIncident": "09/13/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360654,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BAD STARTER OVER THE MILES",
        "vin": "3C6UR5DJ8JG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/16/2020",
        "dateOfIncident": "09/04/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355443,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 RAM 2500. THE CONTACT STATED WHILE DRIVING 68 MPH, THE BRAKE PEDAL WAS DEPRESSED TO THE FLOORBOARD BUT FAILED TO STOP THE VEHICLE. THERE WAS NO WARNING LIGHT ILLUMINATED. THE CONTACT STATED THAT SHE DROVE ON THE SIDE OF THE ROAD UNTIL THE VEHICLE SLOWED DOWN. THE CONTACT STATED SHE ALSO HEARD AN ABNORMAL SOUND COMING FROM THE VEHICLE. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER MOSS BROS. CHRYSLER JEEP DODGE RAM MORENO VALLEY LOCATED AT 27810 EUCALYPTUS AVE, MORENO VALLEY, CA 92555, (855) 999-8991, WHERE IT WAS DIAGNOSED WITH NEEDING BRAKE PADS AND MAINTENANCE SERVICE COMPLETED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER HAD NOT BEEN INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 30,000.",
        "vin": "3C6UR5FL2JG"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/15/2020",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355157,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 RAM 2500. THE CONTACT STATED THAT THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 19V021000 (STEERING). AS PART OF THE RECALL REPAIR, THE ADJUSTER SLEEVE NUT WAS WELDED TO THE DRAGLINK. THE REPAIR WAS PERFORMED AT BROWNING DODGE CHRYSLER JEEP RAM (1983 HAMNER AVE, NORCO, CA 92860, (951) 272-3110). THE CONTACT STATED THAT WHILE DRIVING AT AN UNDISCLOSED SPEED, THE VEHICLE WAS PULLING TO THE RIGHT. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR ALIGNMENT HOWEVER, THE MECHANIC WAS UNABLE TO PERFORM THE ALIGNMENT DUE TO THE RECALL REPAIR. THE MANUFACTURER WAS CONTACTED AND INFORMED OF THE FAILURE. THE MANUFACTURER REFERRED THE CONTACT TO AN AUTHORIZED DEALER TO HAVE A NEW DRAGLINK INSTALLED FREE OF COST. THE DRAGLINK WAS REPLACED HOWEVER, THE FAILURE PERSISTED WITH THE VEHICLE PULLING TO THE RIGHT. THE CONTACT WAS INFORMED THAT THE VEHICLE NEEDED AN ALIGNMENT. THE CONTACT REFUSED TO PAY FOR THE ALIGNMENT AND THE VEHICLE REMAINED UNREPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 53,000.",
        "vin": "3C6UR5DL8JG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/08/2020",
        "dateOfIncident": "08/11/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353806,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TRUCK IS SENDING A MESSAGE SAYING SERVICE ELECTRONIC BRAKING AND SERVICE ANTILOCK BRAKING SYSTEM. I HA E CONTACTED THREE DEALERS AND ALL HAVE TOLD ME THE ABS MODULE AND HYDROLOGY CONTROL UNIT WILL NEED TO BE REPLACED. THE TRUCK WAS PURCHASED NEW IN AUGUST OF 2019 AND HAS 46000 MILES ON IT. ALL OF THE DEALER HAVE STATED THERE IS A NATIONAL BACK ORDER FOR THE PARTS DUE TO THE VOLUME OF FAILURES THAT KEEP HAPPENING. THIS ALSO SHUTS OFF THE VEHICLE TRACTION CONTROL AND STABILITY CONTROL WHEN THIS PART FAILS. THE WARNING CAME ON THE DASH AT START UP AND WILL FLASH ON AND OFF CONTINUALLY RATHER THAN STAY ON. THE TRUCK IS CURRENTLY AT THE DEALER FOR FURTHER DIAGNOSTICS AND REGULAR SERVICE AT THE TIME I AM FILING THIS.",
        "vin": "3C6UR5CLXJG"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/21/2020",
        "dateOfIncident": "11/15/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350663,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 RAM 2500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V818000 (EQUIPMENT, ENGINE AND ENGINE COOLING) AND 20V036000 (POWER TRAIN) HOWEVER, THE PARTS NEEDED FOR THE RECALL REPAIRS WERE NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER CARSON DODGE CHRYSLER JEEP RAM (3059 S. CARSON ST, CARSON CITY, NV 89701) WAS CONTACTED AND CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "3C6TRVCG8JE"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/14/2020",
        "dateOfIncident": "08/12/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349187,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS CONTROL MODULE AND HYDRAULIC CONTROL UNIT FAILURE.   VEHICLE INFORMATION CENTER SHOWS SERVICE ABS AND ELECTRONIC BRAKING SYSTEM, ABS MIL AND TRACTION CONTROL FLASHES ON DASH.   DEALER STATED ABS CONTROL MODULE AND HCU FAILED.",
        "vin": "3C6UR5KL6JG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/21/2020",
        "dateOfIncident": "07/12/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340782,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION FAILED WHILE DRIVING IN CITY STREET TRAFFIC WITH NO WARNING. THE VEHICLE WOULD NOT MOVE FORWARD OR IN REVERSE. THE VEHICLE WAS HAULED TO THE DEALERSHIP FOR REPAIRS UNDER WARRANTY.",
        "vin": "3C6UR5FJ5JG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/08/2020",
        "dateOfIncident": "08/26/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338315,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BACK UP CAMERA SCREEN IS TOO DARK, EVEN ON THE LIGHTEST CONTROL SETTING. I'VE BROUGHT THE VEHICLE TO TWO DEALERSHIPS AND OPENED A COMPLAINT WITH THE COMPANY'S CUSTOMER CARE. I'VE BEEN TOLD THE CAMERA IS OPERATING NORMAL OR AN ADDITIONAL CAMERA SHOULD BE INSTALLED AT MY EXPENSE (THIS CAMERA WOULD ONLY DISPLAY THE TRUCK BED) PLUS MY TRUCK IS NOT EQUIPPED FOR THIS FEATURE",
        "vin": "3C6UR5CL0JG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/06/2020",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337774,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM HAVING ISSUES WITH MY DRAG LINK LOOSENING WHILE DRIVING. A RECALL WAS ISSUED HOWEVER THE SOLUTION TO MITIGATE THIS IS WELDING THE JAM NUTS. THIS DOES NOT ALLOW ME TO REALIGN THE TRUCK PROPERLY. I HAVE ATTEMPTED TO CONTACT FCA DOZENS OF TIMES AND HAVE PROMISED A CASE MANAGER WOULD CALL ME BACK TO RECTIFY THIS BUT THEY HAVE FAILED TO REACH OUT. THIS HAS BEEN ONGOING FOR TWO MONTHS NOW AND POSES A SERIOUS SAFETY RISK TO MY VEHICLE AND MY FAMILY.",
        "vin": "3C6UR5NLXJG"
    },
    {
        "components": "STEERING,POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/18/2020",
        "dateOfIncident": "11/28/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329615,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK LOSES POWER STEERING COMPLETELY WHILE DRIVING MAKING IT 10X HARDER TO MANEUVER THE VEHICLE MAKING TIGHT TURNS VERY DIFFICULT. LACK OF BRAKING POWER. TRUCK HAS A VERY EVIDENT AERATION NOISE EVERY TIME STEERING WHEEL IS TURNED AT ANY TIME. TRUCKS POWER STEERING FLUID HAS FALLEN BELOW MINIMUM THREE TIMES IN THE VEHICLES LIFE. TRUCK IS AT 27,000 MILES. ISSUE BEGAN AROUND 15,000 MILES. BUBBLES IN POWER STEERING RESERVOIR. POWER STEERING PUMP SMELLS LIKE IT'S BURNING UP. POWER STEERING PUMP AND HYDRO BOOST ARE FAILING AND HAS AIRFLOW PASSING THROUGH A SYSTEM THAT CONSTANTLY NEEDS TO BE LUBRICATED BY POWER STEERING FLUID. PUMP AND HYDROBOOST WILL FAIL PREMATURELY BEFORE THEIR LIFE EXPECTANCIES. I HAVE BROUGHT MY VEHICLE INTO THREE DIFFERENT DEALERSHIPS, TWICE AT ROCKWALL DODGE, TWICE AS DALLAS DODGE, ONCE AT HUFFINES DODGE. DEALERSHIPS CLAIM NOTHING IS WRONG WITH VEHICLE, THE POWER STEERING PUMP ON THIS PARTICULAR MODEL IS MORE AUDIBLE THAN OTHERS, ALSO THERE IS SUPPOSED TO BE SOME AIR CREATED IN POWER STEERING SYSTEM. DEALERSHIP SERVICE ADVISOR STATED, 'FOR ALL I KNOW, YOU COULD BE SYPHONING THE FLUID OUT OF THE RESERVOIR AND CLAIMING IT'S LOW' EACH DEALERSHIP SAID NOTHING WAS WRONG, BUT HAS FAILED TO EXPLAIN TO ME WHERE MY FLUID IS GOING, WHY I'M LOSING BRAKING POWER, HAVING COMPLETE LOSS OF POWER STEERING, OR WHY MY TRUCK IS VERY AUDIBLY MAKING AN AERATION NOISE. VEHICLE HAS BEEN OUT OF SERVICE FOR 15 PLUS DAYS. DEALERSHIPS ONLY LOOK TO SEE PHYSICAL LEAKS, SEE NOTHING, AND SAY IT'S FINE AND SEND ME OUT THE DOOR. I'VE BEEN THROUGH THE LEMON LAW PROCESS. FCA WON THE CASE AND NCDS DENIED BUYBACK. I WILL ATTACH A PICTURE OF NCDS'S STATEMENT ON WHY THE DENIAL WAS MADE. DIRECT STATEMENT FROM [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "3C6UR5CL1JG"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/04/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11327227,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE WAS INVOLVED IN A FRONT END COLLISION AT SPEEDS GREATER THAN 35 MPH. THE PASSENGER FRONT SEATBELT DID NOT LOCK AND THE AIR BAGS DID NOT DEPLOY.*DT*JB  *TR",
        "vin": "3C6MR4AJ0JG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/04/2020",
        "dateOfIncident": "06/04/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327277,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING WHEEL IS NOT ADJUSTABLE WHEN PERFORMING ALIGNMENT, DUE TO RECALL FIX UNDER V06/NHTSA 19V-021.  STEERING WHEEL OFF CENTER.  TIME WHEEL CREATE UNEVEN WEAR IN TIRES AND OR OVER CORRECTING IN STEERING.  *TR",
        "vin": "3C6UR5CL4JG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/01/2020",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322996,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CARPLAY STOPS WORKING AT RANDOM. WAS WORKING FINE, THEN STOPS. ONLY CHARGES PHONE FOR A SECOND. THEN STOPS ALTOGETHER. WE'VE BOUGHT SEVERAL NEW CHARGES, APPLE NAME BRAND, TRIED SEVERAL DIFFERENT PHONES & IT STILL ISN'T WORKING.",
        "vin": "3C6UR5FL8JG"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/10/2020",
        "dateOfIncident": "04/10/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320807,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INVOLVED IN AN ACCIDENT TODAY THAT TOTALLED MY TRUCK AND THE AIRBAGS NEVER DEPLOYED. IMPACT DAMAGE WAS IN THE FRONT AND BOTH SIDE REAR PASSENGER DOORS. CAR RAN STOP SIGN AND THE BRUNT OF IMPACT WAS IN THE FRONT.",
        "vin": "3C6UR5CJ3JG"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/30/2020",
        "dateOfIncident": "03/21/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319707,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Lionshead Specialty Tire & Wheel LLC",
                "productMake": "LIONSHEAD",
                "productModel": "CASTLE ROCK",
                "productYear": "9999",
                "size": "ST225/75R15",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 DODGE RAM 2500 EQUIPPED WITH A 2018 OPEN RANGE 291RLS RV EQUIPPED WITH LIONS HEAD TIRES, TIRE LINE:  CASTLE ROCK ST, TIRE SIZE: 225/75/R15, DOT NUMBER NOT AVAILABLE. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 65 MPH, THE TWO REAR TIRES EXPERIENCED A BLOWOUT SUDDENLY AND PREMATURELY. THE CONTACT TOOK THE RV TO THE GOODYEAR LOCATED AT (863 NORTH, US-27, LADY LAKE, FL 32159, (352) 751-1119) AND HAD THE TIRES REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE OF THE VEHICLE 7,000. THE APPROXIMATE FAILURE MILEAGE FOR THE RV AND TIRES WERE 3,000.*DT  CONSUMER STATED MANUFACTURER WOULD REIMBURSE THE CONSUMER.*JB*BF  CONSUMER STATED RV'S TIRE FAILURE HAD NOTHING TO DO WITH THE TRUCK. ALL FOUR TIRES WERE REPLACED.*JB",
        "vin": "58TCH0BP6J3"
    },
    {
        "components": "POWER TRAIN,EQUIPMENT,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/24/2020",
        "dateOfIncident": "11/15/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319135,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 RAM 2500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 19V818000 (EQUIPMENT, ENGINE AND ENGINE COOLING) AND 20V036000 (POWER TRAIN). THE CONTACT CALLED HILLTOP CHRYSLER LOCATED AT (3291 AUTO PLAZA DRIVE, RICHMOND, CA 94806) AND WAS INFORMED THE REMEDY PARTS WERE NOT AVAILABLE. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED, THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCE A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3C6TRVDGXJE"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/14/2020",
        "dateOfIncident": "03/13/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317961,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TODAY (SUNNY, 65 DEGREES) WHILE DRIVING AT 60 MPH, ON HIGHWAY 120 IN MANTECA, CA  (A 2 LANE HIGHWAY) WITH NO OTHER VEHICLES AROUND MY SUNROOF SPONTANEOUSLY SHATTERED. THE DOOR WINDOWS WERE NOT OPEN BUT THE REAR SLIDER WINDOW MAY HAVE BEEN OPEN. I WASHED THE VEHICLE EARLIER THIS WEEK AND DRIED THE WINDOWS IMMEDIATELY TO AVOID WATER SPOTS AND DID NOT NOTICE ANY CRACKS IN THE SUNROOF. THE SUNROOF HAS BEEN OPENED TWO, MAYBE THREE TIMES SINCE PURCHASING THE VEHICLE IN MAY 2019. THE VEHICLE HAS 10,800 MILES ON IT. I DROVE IMMEDIATELY TO THE DEALERSHIP AND SHOWED THEM WHAT HAPPENED. THEY STATED THEY'VE NEVER HEARD OF ANYTHING LIKE THIS BEFORE. I CALLED THE CUSTOMER CAROLINE AND ALSO REPORTED IT WITH THEM AND I'M SUPPOSED TO RECEIVE A PHONE CALL ON MONDAY, MARCH 16.",
        "vin": "3C6UR5NL9JG"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/05/2020",
        "dateOfIncident": "01/05/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316474,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS OF THROTTLE FROM DEAD STOP AND WHILE AT VARYING SPEEDS, VEHICLE IS NOT THROWING ANY CODES. DEALER IS STUMPED AND HAS SENT ME AWAY IN A TRUCK THAT COULD CAUSE A SERIOUS ACCIDENT. IVE FILED A COMPLAINT WITH RAM TRUCKS/CHRYSLER FIAT BUT NOT GETTING MUCH TRACTION.",
        "vin": "3C6UR5FL8JG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/04/2020",
        "dateOfIncident": "03/04/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316086,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SIRIUS XM TRAVEL LINK CONSTANTLY PUSHES NOTIFICATIONS TO THE RADIO SCREEN WHICH MAKES THE DRIVER TALE THEIR EYES OFF OF THE ROAD TO CLEAR THE NOTIFICATION. SIRIUS XM ADDS THE SERVICE TO VEHICLES AT NO CHARGE WITHOUT THE CONSENT OF THE CONSUMER TO ACCEPT OR DENY THE SERVICE AND TAKES AWAY THE ABILITY FOR YOU TO REQUEST THE SERVICE BE TURNED OFF. I HAVE MADE PHONE CALLS AND REQUESTS TO HAVE THE DISTRACTING SERVICE TURNED OFF AND THEY REFUSE SAYING THAT BECAUSE IT HAS NO CHARGE THEY CAN'T TURN OFF THE SERVICE.",
        "vin": "3C6UR5FL1JG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/27/2020",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311969,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I BACK UP MY TRUCK THE BRAKE PADS CHATTER WHILE BACKING. BUT STARTED WHEN THE TRUCK HAD AROUND 7000 MILES ON IT. I HAVE HAD IT TO THE DEALER AND THEY STATED THE FIRST VISIT THAT THAT IS A NORMAL THING THAT HAPPENS. I TOOK IT IN A SECOND TIME BECAUSE IT GIFT WORSE AND THEY STATED IT WAS THE MATERIAL THE PADS ARE MADE OF BUT HAVE NO FIX FOR THE PROBLEM.",
        "vin": "3C6UR5DJ5JG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/19/2020",
        "dateOfIncident": "08/25/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310110,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2018 DODGE PRO-MASTER RAM 2500. THE CONTACT STATED HE STARTED THE VEHICLE AND RELEASED THE EMERGENCY BRAKE, UPON EXITING AND RETURNING TO THE VEHICLE NOTICED THAT THE VEHICLE AHD ROLLED AWAY DOWN A HILL AND MADE A RIGHT TURN.  THE VEHICLE CRASHED INTO AN OAK TREE IN THE NEIGHBORS YARD. THE CONTACT STATED THAT THE VEHICLE WAS STILL IDLING AND IN PARK WHEN HE ENTERED THE VEHICLE AFTER THE CRASH AND EMERGENCY BRAKE WASN'T ON. NO WARNING LIGHTS WERE ILLUMINATED. THE VEHICLE WAS TOWED TO AN AUTO BODY SHOP WHERE THE VEHICLE WAS DEEMED A TOTAL LOSS. THE FAILURE CAUSE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE HOWEVER, NO ASSISTANCE WAS OFFERED.  THE FAILURE MILEAGE WAS 29,000. THE VIN WAS NOT AVAILABLE. *DT  *TR*DT*JB",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/22/2020",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301098,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS RECALL ALLOWED THE MANUFACTURER TO WELD AN ADJUSTABLE COMPONENT RENDERING IT NON-ADJUSTABLE. THIS STEERING LINK SHOULD HAVE BEEN REPLACED, NOT COMPROMISED. FUTURE ALIGNMENT ADJUSTMENTS MAY NOT BE MADE WITHOUT POSSIBLE DAMAGE FROM REMOVING THE WELDS WHICH WILL LIKELY CAUSE DAMAGE AND WEAKEN THE COMPONENTS.",
        "vin": "3C6UR5FJ3JG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/22/2020",
        "dateOfIncident": "10/02/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301245,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRAG LINK RECALL IS TO WELD THE DRAG LINK THUS MAKING IT UNUSABLE TO GET A FRONT END ALIGNMENT AND ALSO CHANGING PROPERTIES OF THE METAL BY WELDING IT AND POSSIBLY MAKING IT WEEK AND PRONE TO A FAILURE.",
        "vin": "3C6UR5DJ0JG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/15/2020",
        "dateOfIncident": "01/07/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299535,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "FCA COMPLETED A SUB-PAR REPAIR ON A DEFECT RELATED TO THEIR RECALL NOTICE V06. THIS 'REPAIR' WAS COMPLETED ON MY NEW 2018 RAM 2500 POWER WAGON PRIOR TO ME TAKING DELIVERY OF THE VEHICLE (I AM THE 1ST OWNER). THE 'REPAIR' RELEGATES WHAT IS DESIGNED AND REQUIRED TO BE AN ADJUSTABLE STEERING DRAG LINK INTO A FIXED, NON-ADJUSTABLE COMPONENT BY WELDING THE JAM NUTS TO THE ADJUSTING SLEEVE. BY DOING SO, FUTURE STEERING ALIGNMENTS WILL REQUIRE ADDITIONAL TIME AND EXPENSE TO THE CUSTOMER BECAUSE FCA WANTS TO SAVE A FEW DOLLARS INSTEAD OF PROPERLY REPAIRING THE VEHICLE AS PART OF THE V06 RECALL CAMPAIGN. FCA REDESIGNED THIS COMPONENT FOR THE 2019+ MODELS AND THE NEWLY DESIGNED COMPONENT IS FULLY COMPATIBLE WITH PRIOR MODEL YEARS. I HAVE PURCHASED THE REDESIGNED COMPONENT AT MY OWN EXPENSE BECAUSE I DO NOT FEEL SAFE WITH AN ADJUSTABLE PART THAT WAS WELDED BY A NON-CERTIFIED WELDER AND WASN'T DESIGNED TO BE WELDED. THE MATERIALS ARE DISSIMILAR AND ANY WELD WILL BE SUBJECT TO FAILURE UNLESS CAREFUL CONSIDERATION WAS GIVEN TO THE AMPERAGE AND FILLER MATERIAL BEING USED TO COMPLETE THE WELD.",
        "vin": "3C6TR5EJ7JG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/02/2020",
        "dateOfIncident": "12/31/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11296734,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED MY 2018 RAM 2500 IN THE EARLY MORNING AND A MESSAGE POPPED UP IN MY MESSAGE CENTER ( SERVICE 4X4 SYSTEM) . USUALLY IT WOULD NOT BE A BIG DEAL BECAUSE YOU SHOULD SERVICE YOUR VEHICLE TO KEEP UP WITH MAINTENANCE , BUT I JUST BOUGHT THE TRUCK 10 MONTHS AGO AND IT HAS 5000 MILES ON IT. HAVE AN APPOINTMENT WITH DEALER TO FIND OUT THE PROBLEM, 4X4 WILL NOT ENGAGE IN THE MEAN TIME.",
        "vin": "3C6UR5CJ5JG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/25/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291167,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL TAKE DOES NOT ALLOW PRESSURE TO RELEASE CAUSING A ENGINE LIGHT AND REFILLING PROBLEMS. I CAN GET ABOUT HALF A GALLON IN AT THE PUMPS AT A TIME. THIS PROBLEM OCCURRED RANDOMLY ABOUT 8 MONTHS AFTER PURCHASE OF THE NEW TRUCK. THE DEALER HAS HAD THE VEHICLE IN 4 TIMES NOW.  1. DIAGNOSTIC, COMPUTER AND ENGINE LIGHT RESET.  2. DIAGNOSTIC, ENGINE LIGHT AND REFILL PIPE REPLACEMENT.  3. DIAGNOSTIC, ENGINE LIGHT AND FULL TANK REPLACEMENT.   4. DIAGNOSTIC, ENGINE LIGHT AND NO SOLUTION.  THE VEHICLE WAS TESTED AT DIFFERENT GAS STATION PUMPS ALL PRODUCING THE SAME RESULT. FAILURE TO FILL CONTINUOUSLY AND REPEAT ENGINE LIGHT.",
        "vin": "3C6UR5JJ3JG"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/17/2019",
        "dateOfIncident": "12/17/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289725,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE OPERATING VEHICLE THE ABS AND TRACTION CONTROL LIGHTS WOULD FLASH ON AND OFF AND MESSAGE SERVICE ANTI LOCK BRAKE SYSTEM.  THEN SERVICE ELECTRIC BRAKE SYSTEM WOULD FLASH IN MESSAGE CENTER.  AFTER FLASHING ON AND OFF MULTIPLE TIMES THE MESSAGES SELF CLEARED AND LIGHTS WENT OUT",
        "vin": "3C6UR5CL7JG"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/07/2019",
        "dateOfIncident": "10/10/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287669,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DODGE WELDED LOCK NUT ON STEERING SUSPENSION WELDER WAS NOT CERTIFIED. ASKING FOR NEW UPDATED TYROID STEERING PIECE FOR PROPER FIX",
        "vin": "3C6UR5FL7JG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/04/2019",
        "dateOfIncident": "12/03/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286828,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 RAM 2500. WHILE DRIVING 40 MPH, THE VEHICLE SHUT OFF WITHOUT WARNING. AFTER SEVERAL ATTEMPTS, THE VEHICLE RESTARTED AND OPERATED NORMALLY. THE CONTACT TOOK THE VEHICLE TO NAPLETON'S NORTHLAKE CHRYSLER DODGE JEEP RAM (3701 NORTHLAKE BLVD, LAKE PARK, FL 33403, (888) 682-8985), BUT IT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 16,500.",
        "vin": "3C6UR5HL0JG"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/20/2019",
        "dateOfIncident": "11/20/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281420,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2019 TRAVATO WAS BUILT ON THIS RAM 2500 CHASSIS. WINNEBAGO GLUED HEAVY, SILVER ALUMINUM TRIM STRIPS TO THE BOTTOM OF ALL SECTIONS OF THIS VAN. WE HAD THE ONE ON THE DRIVER'S DOOR FALL OFF WHILE PARKED IN LAS VEGAS IN MARCH OF 2019. WE HAD THIS REATTACHED WHICH WAS COVERED BY WARRANTY. IN NOVEMBER OF 2019 WE DISCOVERED OVER EIGHT MORE SECTIONS COMING LOOSE AND IT WAS GOING TO COST $1,300.00 TO HAVE THEM REINSTALLED. WE WERE TOLD THAT THERE WAS NO GUARANTEE THAT WE WOULD NOT HAVE TO HAVE THEM REINSTALLED 4 OR 5 YEARS LATER.  WE ELECTED TO HAVE THEM REMOVED INSTEAD. THESE ARE HEAVY PIECES OF METAL THAT ARE EXPOSED TO HIGH WIND GUSTS WHILE TRAVELLING AT HIGHWAY SPEEDS. IF ONE (OR MORE) SHOULD FLY OFF WHILE IN TRANSIT, THEY COULD DAMAGE VEHICLES FOLLOWING US OR EVEN CAUSE A FATAL ACCIDENT.",
        "vin": "3C6URVJG3JE"
    },
    {
        "components": "ELECTRICAL SYSTEM,WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/29/2019",
        "dateOfIncident": "10/15/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277007,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS OF COMMUNICATIONS BETWEEN SEVERAL MODULES. ERRORS ARE TPMS LOSS OF COMMO AT ALL 4 SENSORS, NOT ABLE TO LOCK DOORS LOSS OF KEY FOB COMMUNICATIONS CAUSEING ENGINE TO TURN OFF. STATIONARY OR MOVING ON ANY ROAD OR SPEED. THESE BEGAN WHEN THE VEHICLE WAS FIRST PURCHASED OCT 2018.",
        "vin": "3C6UR5NL4JG"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/24/2019",
        "dateOfIncident": "11/14/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270913,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN PUTTING IN REVERSE THE BACKUP CAMERA DISPLAY GOES MULTI COLOR BLUR.THIS WAS ABOUT 20K  THEN CORRECTED ITSELF WHEN PUT IN REVERSES THE NEXT TIME. DIDN'T THINK MUCH ABOUT IT. NOW AT 42 K ITS DOING IT MORE OFTEN.  TOOK IT TO THE DEALER AND FRANK AT VACAVILLE DODGE TELLS ME ITS OUT OF WARRANTY, WHEN I HAD ALREADY SEEN THERE WAS A RECALL ON THIS PROBLEM. I WILL DOCUMENT AND TAKE PICS NEXT TIME IT DOES IT.",
        "vin": "3C6UR5FLXJG"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/23/2019",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270410,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 RAM 2500. WHILE ATTEMPTING TO ACCELERATE FROM A STOP, THE VEHICLE FAILED TO ACCELERATE. THE CONTACT MENTIONED THAT THE VEHICLE WAS OPERATING INDEPENDENTLY. THE VEHICLE WAS TAKEN TO AUTONATION CHRYSLER DODGE JEEP RAM AND FIAT JOHNSON CITY (3700 BRISTOL HWY, JOHNSON CITY, TN 37601, (423) 354-3916) TO BE DIAGNOSED, BUT THE CAUSE OF THE FAILURE WAS UNDETERMINED. THE VEHICLE WAS NOT REPAIRED AND THE FAILURE RECURRED MULTIPLE TIMES. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 600.",
        "vin": "3C6UR5JL5JG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/23/2019",
        "dateOfIncident": "10/22/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270492,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING TO WORK ON A STATE HIGHWAY THE BRAKES ON MY VEHICLE FAILED.  THE VEHICLE IS 10 MONTHS OLD AND HAS ~8000 MILES ON IT.  THE ABS ACTIVATED WHILE NOT APPLYING THE BRAKES.  WHEN I STEPPED ON THE BRAKES TO SLOW THE SPEED OF THE VEHICLE, THE VEHICLE TOOK MUCH LONGER TO SLOW DOWN AND OR STOP.  AFTER WHICH, THE ABS AND TRACTION CONTROL LIGHT CAME ON.  THE LIGHT THEN BEGAN TO COME OFF AND ON WITHOUT A PATTERN.  THE CAR WAS TAKEN TO THE DEALERSHIP AND THE ABS PUMP AND ABS CONTROL MODULE WERE REPLACED.  THIS ISSUE OCCURRED WITHOUT WARNING.  IF THE CONDITIONS HAD BEEN DIFFERENT, THIS LOSS IN BRAKING COULD HAVE CAUSED A SERIOUS ACCIDENT.",
        "vin": "3C6UR5DL6JG"
    },
    {
        "components": "STEERING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/11/2019",
        "dateOfIncident": "10/11/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267943,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 RAM 2500. THE CONTACT TOOK  THE VEHICLE TO H AND M MOTOR COMPANY (373 E 3RD ST, WESTON, WV 26452, 304-269-5727) FOR ROUTINE MAINTENANCE. THE DEALER INFORMED THE CONTACT THAT THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 19V021000 (STEERING) AND PERFORMED THE RECALL REPAIR. AFTER THE RECALL REPAIR WAS PERFORMED, THE CONTACT TOOK THE VEHICLE TO AN INDEPENDENT MECHANIC TO HAVE THE TIRES REPLACED AND FOR AN ALIGNMENT. THE MECHANIC INFORMED HIM THAT DUE TO THE WELDING THAT WAS PERFORMED DURING THE RECALL REPAIR, THEY WERE UNABLE TO PERFORM AN ALIGNMENT. THE SAME DEALER WAS CONTACTED AND INFORMED HIM THAT THE WORK THEY PERFORMED ON THE VEHICLE WAS APPROVED BY THE MANUFACTURER. THE MANUFACTURER WAS NOTIFIED AND THE CONTACT REQUESTED THAT THEY PAY FOR THE ALIGNMENT DUE TO THE WORK PERFORMED ON THE VEHICLE. THE MANUFACTURER DENIED THE REQUEST AND PROVIDED CASE NUMBER: 64758281. THE VEHICLE HAD NOT BEEN REPAIRED. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3C6UR5NL3JG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/05/2019",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253478,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 RAM 2500. THE CONTACT STATED THAT THE VEHICLE WAS REPAIRED PER NHTSA CAMPAIGN NUMBER: 19V021000 (STEERING) BY SOUTH POINTE CHRYSLER JEEP DODGE RAM (LOCATED AT 9240 S MEMORIAL DR, TULSA, OK 74133, (918) 584-1481). AFTER THE REPAIR, THE CONTACT STATED THAT THE STEERING WHEEL WAS NOT ALIGNED AND THE VEHICLE HESITATED. WITHIN A WEEK, THE VEHICLE WAS TAKEN BACK TO THE DEALER, BUT THE FAILURES COULD NOT BE DUPLICATED. AFTER MULTIPLE VISITS, THE DEALER DIAGNOSED THE VEHICLE WITH NEEDING AN ALIGNMENT AND THAT THE STEERING WHEEL NEEDED TO BE RE-WELDED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT LEFT A VOICEMAIL MESSAGE WITH THE MANUFACTURER. THE FAILURE MILEAGE WAS 7,000.",
        "vin": "3C6UR5ML0JG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/22/2019",
        "dateOfIncident": "08/22/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245878,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 RAM 2500. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 19V021000 (STEERING). THE MANUFACTURER WAS CONTACTED AND STATED THAT THE REMEDY WAS NOT THE PROPER REPAIR BECAUSE IT WOULD PREVENT THE VEHICLE FROM HAVING A WHEEL ALIGNMENT. THE CONTACT STATED THAT THE PROPER REPAIR WOULD BE TO HAVE TWO JAM NUTS PLACED ON EACH SIDE, WHICH SHOULD PREVENT THE SLEEVE FROM TURNING. THE DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3C6UR5GL2JG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/25/2019",
        "dateOfIncident": "07/14/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234931,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ACCELERATION STUCK ON HIGHWAY",
        "vin": "3C6MR5AL6JG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/23/2019",
        "dateOfIncident": "06/10/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234417,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 DODGE RAM. CONSUMER WRITES IN REGARDS TO DRAG LINK SAFETY RECALL. *LD    THE CONSUMER STATED THE DRAG LINK REPAIR WAS PERFORMED BUT, THE FIALURE RECURRED. *JS",
        "vin": "3C6UR5DL3JG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/17/2019",
        "dateOfIncident": "07/16/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232662,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DODGE IS KNOWINGLY  INSTALLING 18' SPARE TIRES AND WHEELS ON HD PICKUPS WHERE THE VEHICLE ACTUALLY HAS 20 WHEELS EVEN THOUGH THE CUSTOMER IS PAYING FOR A FULL SIZE SPARE TIRE. THIS IS DANGEROUS, ESPECIALLY ON A HEAVY DUTY PICK UP BUT ALSO AMOUNT TO FRAUD IN THAT CUSTOMERS ARE PAYING FOR 20\" WHEELS SPARE AND GETTING AN 18\"",
        "vin": "3C6UR5LL5JG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/14/2019",
        "dateOfIncident": "07/11/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231765,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS PULLING MY 5TH WHEEL TRAILER UP A STEEP HILL, AND MY ENGINE FAN SUCKED IN MY FAN SHROUD CUT IT INTO LARGE CHUNKS, THEY THEN FLEW INTO MY RADIATOR AND PUNCTURED IT RESULTING IN LOSS OF ALL ENGINE COOLANT. APPARENTLY THIS HAS BEEN HAPPENING FOR QUITE SOME TIME WITH 4TH GEN RAM TRUCKS AFTER SEARCHING ON MULTIPLE INTERNET FORUMS. THIS IN MY OPINION SHOULD BE A RECALL. IT LEFT MY 2 KIDS, WIFE, AND TWO DOGS STRANDED ON THE SIDE OF THE ROAD.",
        "vin": "3C6UR5CL7JG"
    },
    {
        "components": "SUSPENSION,WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/10/2019",
        "dateOfIncident": "09/22/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230874,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VIBRATION AT VARIOUS SPEEDS. CAN BE FELT AND NOTICED IN STEERING WHEEL. FEELS LIKE A SHAKING OF THE VEHICLE. HAPPENS ON DIFFERENT ROAD SURFACES (ASPHALT VS CONCRETE) UPGRADES, DOWNGRADES, FLAT, LEFT TURN'S RIGHT TURNS STRAIGHTAWAYS. TYPICALLY STARTS AT 55 MPH TO 80 MPH. STILL NOTICEABLE UNDER HEAVY OR LIGHT LOADS AND EVEN EMPTY.",
        "vin": "3C6UR5DL0JG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/10/2019",
        "dateOfIncident": "05/20/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218930,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE THE VERY SAME ISSUE THAT HAS BEEN PREVIOUSLY EXPRESSED ON MAY 20TH, 2019.  I HAD MY SERVICE DONE ON THE MAY 20TH, ONLY TO BE TOLD ABOUT THE 'SPOT WELD' WHEN I PICKED UP THE TRUCK, AFTER THE REPAIR WAS DONE. I TOO AGREE WITH THIS DESCRIPTION THE FRUSTRATIONS, ISSUES  AND CONCERNS.  THIS IS NOT AN ACCEPTABLE FIX, ESPECIALLY OF A NEW VEHICLE.  I RECENTLY RECURVED A RECALL (V06) ON MY NEW RAM 2500. THIS RECALL REQUIRED THE JAM NUTS ON THE ADJUSTER SLEEVE PORTION OF THE DRAG LINK TO BE WELDED IN PLACE. THIS AFFECTS THE SERVICEABILITY OF THE VEHICLE IN THAT IF AN ALIGNMENT IS REQUIRED THE STEERING WHEEL WILL BE OFF CENTER BECAUSE THE COMPONENT THAT IS DESIGNED FOR THIS ADJUSTMENT HAS BEEN RENDERED USELESS BECAUSE OF THE RECALL PROCEDURE. I QUESTIONED THE SERVICE REP WHEN I HAD THE RECALL PERFORMED IF THIS WAS A TEMPORARY FIX UNTIL A PROPERLY REDESIGNED COMPONENT WAS AVAILABLE. HIS ANSWER WAS THAT TO HIS KNOWLEDGE WELDING THE JAM NUTS WAS THE PERMANENT FIX. I FEEL THIS REPAIR IS UNACCEPTABLE AS A PERMANENT FIX AS IT RENDERS A COMPONENT OF THE STEERING SYSTEM THAT WAS DESIGNED TO BE ADJUSTABLE USELESS, THUS MAKING ROUTINE MAINTENANCE IMPOSSIBLE.",
        "vin": "3C6UR5FL6JG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/21/2019",
        "dateOfIncident": "05/20/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209091,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 RAM 2500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V021000 (STEERING). THE CONTACT STATED THAT HILL-KELLY DODGE CHRYSLER JEEP RAM (LOCATED AT 6171 PENSACOLA BLVD, PENSACOLA, FL 32505, (850) 972-2050) EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. UPON FURTHER INVESTIGATION, THE CONTACT BELIEVED THAT THE RECALL REMEDY WOULD PREVENT PROPER ALIGNMENT. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "3C6UR5NL6JG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/20/2019",
        "dateOfIncident": "04/19/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208559,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVELINE WHINE AT 70-80 MPH CAUSED BY BAD REAR END SETUP/BEARINGS",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/20/2019",
        "dateOfIncident": "04/15/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208856,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY RECURVED A RECALL (V06) ON MY NEW RAM 2500. THIS RECALL REQUIRED THE JAM NUTS ON THE ADJUSTER SLEEVE PORTION OF THE DRAG LINK TO BE WELDED IN PLACE. THIS AFFECTS THE SERVICEABILITY OF THE VEHICLE IN THAT IF AN ALIGNMENT IS REQUIRED THE STEERING WHEEL WILL BE OFF CENTER BECAUSE THE COMPONENT THAT IS DESIGNED FOR THIS ADJUSTMENT HAS BEEN RENDERED USELESS BECAUSE OF THE RECALL PROCEDURE. I QUESTIONED THE SERVICE REP WHEN I HAD THE RECALL PERFORMED IF THIS WAS A TEMPORARY FIX UNTIL A PROPERLY REDESIGNED COMPONENT WAS AVAILABLE. HIS ANSWER WAS THAT TO HIS KNOWLEDGE WELDING THE JAM NUTS WAS THE PERMANENT FIX.  I FEEL THIS REPAIR IS UNACCEPTABLE AS A PERMANENT FIX AS IT RENDERS A COMPONENT OF THE STEERING SYSTEM THAT WAS DESIGNED TO BE ADJUSTABLE USELESS, THUS MAKING ROUTINE MAINTENANCE IMPOSSIBLE.",
        "vin": "3C6UR5DL7JG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/19/2019",
        "dateOfIncident": "05/16/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208533,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "RAM ISSUED A RECALL TO WELD THE ADJUSTMENT NUT ON THE DRAG LINK.  THIS IS NOT THE PROPER WAY TO FIX THE PROBLEM. MY TRUCK HAS BEEN TO TWO DIFFERENT DEALERS AND WELDED THREE TIMES. THE PROBLEM IS STILL NOT FIXED.",
        "vin": "3C6UR5CJ7JG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/07/2019",
        "dateOfIncident": "05/07/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206050,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FCA HAS ISSUED A V06 RECALL FOR THE DRAG LINK ON MY VEHICLE. AS STATED IN THE RECALL, THE OUTBOARD STEERING LINKAGE JAM NUT MAY LOOSEN, ALLOWING ONE END OF THE DRAG LINK TO SEPARATE. I CHECKED MY TRUCK AND ONE JAM NUT WAS LOOSE. ACCORDING TO THE RECALL, IF THE TORQUE VALUES MEET REQUIREMENT, THE NUTS WILL BE WELDED TO THE ADJUSTER SLEEVE. IF THE TORQUE VALUES DO NOT MEET REQUIREMENT, THE DRAG LINK ASSEMBLY WILL BE REPLACED. I THEN CALLED MY DEALER AND HE CONFIRMED THAT THEY COULD NOT WELD IT. UNFORTUNATELY, HE ALSO STATED THAT NO REPLACEMENT PARTS WERE CURRENTLY AVAILABLE. SO WHERE DOES THAT LEAVE ME? I EMAILED THE FCA CEO AND EVENTUALLY WAS TOLD THAT I NEEDED TO DRIVE THE TRUCK TO THE DEALER FOR INSPECTION. I WAS APPALLED THAT I WAS SUPPOSE TO DRIVE THE TRUCK WITH A LOOSE DRAG LINK AND THAT THEY COULDN'T DO ANYTHING ELSE TO HELP ME UNTIL I DID SO. I EVEN SENT THEM PICTURES OF THE LOOSE DRAG LINK, YET THEY WILL TAKE NO ACTION. I DO NOT WANT TO PUT MY LIFE, OR THE LIVES OF FAMILY MEMBERS AT RISK TO DRIVE THE TRUCK IN TO BE TOLD THE SAME THING I WAS OVER THE PHONE. SOME PEOPLE HAVE POSTED ONLINE THAT THEY HAVE BEEN REIMBURSED FOR AN AFTERMARKET DRAG LINK OR THE DEALER HAS REPLACED THE DRAG LINK WITH A NEWER VERSION. I'M HOPING TO HAVE ONE OR THE OTHER DONE.",
        "vin": "3C6TR5EJXJG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/08/2019",
        "dateOfIncident": "02/21/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194685,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER BUYING THIS VEHICLE I NOTICED THAT THE PLASTIC TRIM AROUND INSTRUMENT CLUSTER IS COCKED TO THE POINT WHERE IT IS VERY NOTICEABLE. IS IT A SAFETY ISSUE NO BUT IT IS AN APPEARANCE ISSUE. TOOK IT TO THE DEALER WHERE I PURCHASED IT ON 1/21/19. THEY SAID IT WAS FIXED IT'S NOT FIXED. WAS TOLD NOTHING CAN BE DONE ABOUT IT. TOOK IT IN ON 3/7/19 SAID THEY ADJUSTED THE STEERING WHEEL COVER. THAT'S NOT WHAT IS COCKED.",
        "vin": "3C6UR5CJ1JG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/03/2019",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193579,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FCA RECALL V06 CONCERNING DRAG LINK SEPARATION PRESCRIBES A SPOT WELD REPAIR THAT I FEEL WILL EVENTUALLY FAIL BECAUSE OF FUTURE ALIGNMENT SERVICE.  SPOT WELDING THE JAM NUTS TO THE ADJUSTER SLEEVE WORKS ONLY UNTIL THE NUT AND ADJUSTMENT SLEEVE ARE SEPARATED WHEN THE VEHICLE IS IN FOR A FUTURE ALIGNMENT. I CALLED DODGE WITH THIS CONCERN, AND THEY PUT ME IN CONTACT WITH THE LOCAL DEALER WHO SAID IF THE ADJUSTER NEEDED TO BE MOVED WITH  FUTURE ALIGNMENTS THEY WOULD GRIND THE WELD OFF, MAKE THE ADJUSTMENT, THEN WELD THE NUTS BACK TO THE ADJUSTMENT SLEEVE.  THIS WILL WORK IF THE OWNER USES ONLY THE DODGE DEALER FOR ALIGNMENT.  MANY ALIGNMENTS ARE DONE AT TIRE STORES, AND A VARIETY OF OTHER SERVICE FACILITIES WHO WILL NOT KNOW ABOUT THIS REPAIR.  THE WELD MIGHT BREAK WHEN THE TECHNICIAN COUNTER WRENCHES THE JAM NUT AND ADJUSTMENT SLEEVE, OR GRINDS IT OFF TO ALIGN THE TRUCK. WITH OUT KNOWING ABOUT THIS RECALL THE TECH MIGHT MAKE ADJUSTMENTS AND TURN THE JAM NUT BACK ON THE SLEEVE; RETURNING THE TRUCK TO IT'S PRE RECALL CONDITION.  THIS IS NOT A COMPLAINT  ABOUT THE DEALER, OR FCA.  I'M CONCERNED THAT MOST OWNERS WILL BE UNAWARE THAT AFTER A COMMON ALIGNMENT THE V06 RECALL MIGHT NEED TO BE REDONE.   MY VEHICLE HAS BEEN SPOT WELDED AND THE RECALL IS DONE.",
        "vin": "5JG284612"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/03/2019",
        "dateOfIncident": "03/30/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193638,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS RECENTLY NOTIFIED OF SAFETY RECALL V06 / NHTSA 19V-021 DRAG LINK FOR MY 2018 RAM 2500. I'M WRITING TO COMPLAIN ABOUT THE PROPOSED REPAIR: \"...THE (JAM) NUTS WILL BE WELDED TO THE ADJUSTER SLEEVE.\" THIS SOLUTION APPEARS TO SIMPLY MASK THE PROBLEM OF THE ADJUSTER SLEEVE'S THREADS BEING STRIPPED OUT AND THE DRAG LINK BECOMING SEPARATED FROM THE VEHICLE'S STEERING CONTROLS, AND QUITE POSSIBLY WITHOUT WARNING. AS THE SUBJECT COMPONENT IS RELATED TO MANEUVERING LARGE VEHICLES THAT OFTEN CARRY OR PULL LARGE LOADS, AND THUS VITAL FOR PUBLIC SAFETY, I FEEL STRONGLY THAT FIAT CHRYSLER AUTOMOBILES SHOULD PROVIDE A MUCH HIGHER QUALITY SOLUTION TO THIS ISSUE. FURTHER, THIS COMPONENT IS DESIGNED TO BE AN ADJUSTABLE COMPONENT, ADJUSTMENTS WOULD NO LONGER BE POSSIBLE AFTER THE NUT(S) IS WELDED TO THE ADJUSTER SLEEVE; THIS IS NOT ACCEPTABLE AS THE NUT/PART WOULD HAVE TO BE CUT OFF WITH A GRINDER OR METAL SAW (WHICH WOULD DAMAGE THESE PARTS) THE NEXT TIME THE STEERING NEEDS TO BE ADJUSTED. ULTIMATELY, I AM VERY DISAPPOINTED IN THE PROPOSED \"REPAIR\" AS THERE ARE KNOWN ALTERNATIVES THAT WOULD PROPERLY CORRECT THIS ISSUE.",
        "vin": "3C6UR5CL3JG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/03/2019",
        "dateOfIncident": "04/03/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193699,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RECENT RAM 2500 RECALL NUMBER V06/NHTSA RECALL NUMBER 19V-021 REMEDY/REPAIR, HAS ME VERY, VERY, VERY UPSET AS A CONSUMER.  IF I MAY BE SO BOLD, THE ENGINEER(S) THAT DEVISED THE REPAIR METHOD FOR THOSE TRUCKS EFFECTED, REALLY DIDN'T THINK THINGS THROUGH FROM A CONSUMER PERSPECTIVE.  THE WELDING OF THE JAM NUTS ON THE LEFT/RIGHT DRAG LINKS, MEANS THAT PART OF THE OVERALL STEERING GEOMETRY ADJUSTMENTS, HAS BEEN MINIMIZED AS IT APPLIES TO TOE AND STEERING WHEEL ALIGNMENT ADJUSTMENTS.  THE REPAIR IS A CHEAP, JURY RIGGED TEMPORARY REPAIR THAT CLEARLY IS A COSTS SAVINGS MEASURE.      EVERY CUSTOMER THAT HAS HAD THIS REPAIR, WILL REQUIRE THE PURCHASE OF A NEW SET OF DRAG LINKS IN THE FUTURE.  MY VEHICLE (2018 RAM 2500 POWER WAGON) IS BUILT FOR EXTREME OFF-ROADING, AND I CAN GUARANTEE YOU AND DODGE/FIAT/RAM THAT I NEED THE ABILITY TO MAKE ADJUSTMENTS'    THIS IS AN UNEXPECTED ACT ON THE BEHALF OF FIAT'  I REALLY DO WANT AN ANSWER BACK ABOUT HOW THIS IS GOING TO BE ADDRESSED'  MY ANSWER IS SIMPLE; MAKE SURE THE CURRENT INVENTORY OF REPLACEMENT DRAG LINKS, DO NOT HAVE THE SAME SUB-STANDARD BUILD AS THE CURRENT LINKS, AND' RATHER THAT WELD THE JAM NUTS, JUST REPLACE THE DRAG LINKS WITH UPDATED ONES'",
        "vin": "3C6TR5EJ8JG"
    },
    {
        "components": "STEERING,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "03/21/2019",
        "dateOfIncident": "03/12/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190457,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 RAM 2500. THE CONTACT STATED THAT THE REARVIEW CAMERA SCREEN TURNED BLACK WHEN THE VEHICLE WAS PLACED IN REVERSE. THERE WERE NO WARNING INDICATORS ILLUMINATED; HOWEVER, \"ERROR\" WOULD DISPLAY OCCASIONALLY ON THE INSTRUMENT PANEL. THE VEHICLE WAS TAKEN TO AUTONATION CHRYSLER DODGE JEEP (7740 NE LOOP 820, FORT WORTH, TX 76180, (817) 522-4981) WHERE IT WAS DIAGNOSED THAT THE CAMERA NEEDED AN UPDATE. THE UPDATE WAS PERFORMED FIVE TIMES, BUT FAILED EACH TIME. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURES. THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 19V021000 (STEERING). THE FAILURE MILEAGE WAS 20,000.",
        "vin": "3C6UR5CJ7JG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/15/2019",
        "dateOfIncident": "03/15/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187062,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE THE TRUCK IS RUNNING AND PARKED PASSENGER GETS OUT OF VEHICLE AND SHUTS DOOR CAUSING THE  KEY FOB HAS LEFT THE VEHICLE WARNING ON THE DASH TO APPEAR. BUT THE KEY FOB IS CLEARLY SETTING IN THE CUP HOLDER IN THE CENTER CONSOLE AND HAS NOT LEFT THE VEHICLE. ONLY WAY TO RESET IS TO TAKE THE KEY FOB OUT OF THE TRUCK. THIS HAS HAPPENED EVER SINCE THE SEAT BELT MODULE WAS REPLACED. ON THE PASSENGER SIDE. HAS HAPPENED 10+ TIMES",
        "vin": "3C6UR5NL9JG"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/05/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184391,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "PULLED OUT INTO TRAFFIC AND THE GAS PEDAL DID NOT PROPEL THE TRUCK AND I WAS ALMOST HIT BROADSIDE. IT'S LIKE THE GAS PEDAL TOOK 3-4 SECONDS TO SEND FUEL TO THE ENGINE AND CAUSED THE TRUCK TO JUST ROLL INSTEAD OF PROPELLING IT DOWN THE ROAD",
        "vin": "3C6UR5CL7JG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/30/2019",
        "dateOfIncident": "01/30/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173018,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M HAVING ISSUE WITH CONSTANT WEATHER ALERT POP UPS ON THE SCREEN IN THE CENTER OF THE CAB.  THIS IS VERY DISTRACTING WHILE DRIVING AND IT FORCES YOU TO MANUALLY CLOSE THE POP UP TO RETURN TO THE SCREEN.  THESE ALERTS HAPPEN WHILE THE CAR IS IN MOTION AND WILL HAPPEN SEVERAL TIMES DURING A 15 MINUTE COMMUTE.     THIS MAY SEEM INCONSEQUENTIAL BUT IT IS NO DIFFERENT THEN TALKING ON THE PHONE AS IT REQUIRES YOU TO TAKE YOUR EYES OFF THE ROAD,",
        "vin": "3C6UR5DL0JG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/25/2019",
        "dateOfIncident": "01/21/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11172030,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 RAM 2500. WHILE DRIVING 60 MPH, THE CRASH SENSOR WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO WACONIA DODGE CHRYSLER JEEP RAM (LOCATED AT 905 STRONG DR, WACONIA, MN 55387, (952) 373-5327) WHERE IT WAS DIAGNOSED THAT THE FAILURE WAS DUE TO THE EXTREME COLD AND WET CLIMATE. THE CONTACT WAS INFORMED THAT AS SOON AS THE TEMPERATURE BECAME WARMER, THE MALFUNCTION WOULD CEASE. THE SENSOR WAS RESET AND THE ENGINE CONTROL MODULE WAS RE-FLASHED, BUT THE FAILURE RECURRED. THE FAILURE WAS INTERMITTENT. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 1,000.",
        "vin": "3C6UR5FJ9JG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/20/2018",
        "dateOfIncident": "11/16/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162625,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "NEW VEHICLE WITH 57 MILES ON ODOMETER DIED WHILE PARKED IDLING. TRIED RESTARTING VEHICLE, RAW FUEL RUNNING OUT OF TAIL-PIPE. TOWED TO I5 DODGE FOR DIAGNOSIS. FOUND PCM BAD. #7 INJECTOR BEING HELD OPEN CONSTANTLY. PCM REPLACED AFTER 1 WEEK WAIT FOR RELEASE FROM NATIONAL BACK-ORDER. VEHICLE REPAIRED AND RETURNED TO SERVICE.",
        "vin": "3C6UR5FJ1JG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/11/2018",
        "dateOfIncident": "12/11/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11160810,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 RAM 2500. THE CONTACT STATED THAT THE U-CONNECT SCREEN PERIODICALLY FAILED TO FUNCTION, WHICH IMPACTED THE FUNCTIONALITY OF THE SOS FEATURE BUILT INTO THE REARVIEW MIRRORS. THE DEALER (FREMONT MOTOR, 6101 E 2ND ST, CASPER, WY 82609, 307-237-8491) SCHEDULED A DIAGNOSTIC APPOINTMENT FOR DECEMBER 18, 2018. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 6,030.",
        "vin": "3C6TR5EJ4JG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/10/2018",
        "dateOfIncident": "11/26/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11160610,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FCA BASED UCONNECT SYSTEM WITH THE 5 YEAR SIRIUSXM TRAVEL LINK SUBSCRIPTION HAS A FATAL SOFTWARE ERROR WITH NO SOLUTION. IT FORCES PERSISTENT \"WEATHER UPDATES\", EVERY COUPLE OF MINUTES, WHICH ARE A FULL SCREEN BLOCKING NOTIFICATIONS REQUIRING THE DRIVER TO PHYSICALLY INTERACT WITH THE SCREEN TO REGAIN ACESS. THESE APPEAR ON ANY SCREEN: GPS, RADIO, BACKUP CAMERA ETC. AND WILL NOT STOP. THERE IS NO MENU CONTROL TO AFFECT THE PROBLEM, NO ABILITY FOR DEALER TO AFFECT, SIRIUS XM WILL NOT CANCEL UNDER ANY CIRCUMSTANCES OR DEMANDS. THIS FLAW CAUSES TERRIBLE DISTRACTION FROM DRIVING RANDOMLY AND PERSISTENTLY AND RENDERS OTHERWISE IMPORTANT SYSTEMS USELESS.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/27/2018",
        "dateOfIncident": "09/18/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131951,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 RAM 2500 HD DIESEL 13000 MILES, 3 SEPARATE OCCASIONS, UNDER ALL DRIVING CONDITIONS, BRAKE PEDAL WENT TO FLOOR REQUIRING PUMPING ACTION TO STOP VEHICLE. OTHER OCCASIONS PEDAL FEELS SPONGY. NO SERVICE AVAILABLE. ONE DEALER WAS 4 WEEKS OUT SCHEDULING TWO OTHER ARE 1-2 WEEKS SCHEDULING.  VEHICLE IS SCHEDULED FOR DROP OFF OCTOBER 4TH 2018",
        "vin": "3C6UR5FL1JG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/25/2018",
        "dateOfIncident": "07/05/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113644,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 RAM 2500. WHILE THE VEHICLE WAS PARKED, THE GEAR SHIFTED INTO NEUTRAL AND ROLLED DOWN THE CONTACT'S DRIVEWAY INTO A POND. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER (CAVENAUGH CHRYSLER JEEP DODGE, 118 E POPLAR ST, WALNUT RIDGE, AR 72476, (870)-886-2414) WHERE IT WAS AWAITING DIAGNOSTIC TESTING AND REPAIRS BY THE MANUFACTURER FIELD INSPECTOR. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 13,200.",
        "vin": "3C6TR5EJ7JG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/19/2018",
        "dateOfIncident": "07/19/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112394,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON MAXIMUM EMERGENCY BRAKING AT ANY SPEED, THE TRUCK STOPS AS IF THE BRAKES WHERE WET,  IMPOSSIBLE TO STOP WHEN TOWING A UNLOADED 16 FOOT UTILITY TRAILER DOWN HILL IT JUST KEEPS ON GOING UNTIL YOU REACH BOTTOM. TAKEN TO DODGE DEALERSHIP THEY SAY IT'S NORMAL BUT THEY SAY OTHER TRUCKS LIKE CHEVY 2500 CAN STOP A TRAIN.",
        "vin": "3C6TR5CJ5JG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/06/2018",
        "dateOfIncident": "06/05/2018",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11109920,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR DODGE RAM 6.7 2500 2018, CASE, HARVEST EDITOR CAUGHT ON FIRE WITHIN A WEEK OF PURCHASE, WHILE DRIVING DOWN THE FREEWAY TOWING. AT TIME OF PURCHASE IT HAD 555 MILES ON IT, AND WE'D ONLY DRIVEN IT 3 TIME PRIOR TO THIS. WE WERE DRIVING BELOW THE SPEED LIMIT. THE TRUCK STARTING LOOSING POWER, WE SAW A LITTLE SMOKE IN THE REAR VIEW MIRROR. AS WE SLOWED THE SMOKE INCREASED. UPON LIFTING THE HOOD, TRANSMISSION FLUID WAS SQUATTING OUT ACROSS THE ENGINE PORING ON THE GROUND, FLAMES WERE MOVING ALONG THE BACK OF THE FIRE WALL. WE PUT THE FIRE OUT OURSELVES PRIOR TO THE FIRE DEPARTMENT ARRIVING. OUR INSURANCE INVESTIGATOR SAID IT WAS A WARRANTY ISSUES, DEFECTIVE TRANSMISSION LINE. HE ALSO SAID THERE WAS NO EVIDENCE TO SUPPORT ANYTHING THAT WE COULD HAVE OR MIGHT HAVE DONE. CHRYSLER'S INVESTIGATIONS REVEALED THAT IT WAS ALSO A WARRANTY ISSUE.",
        "vin": "3C6UR5DL0JG"
    }
]