[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/10/2022",
        "dateOfIncident": "01/10/2022",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446839,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Parasitic battery drain. Car is rendered inoperable after periods of non use. The batter has been replaced and the problem persists.",
        "vin": "Jf1va2m64j9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/04/2022",
        "dateOfIncident": "01/02/2022",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446144,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Battery dies and vehicle is unable to start after short periods of being turned off. This has left me stranded in unsafe areas and can pose a major safety hazard. Vehicle has been inspected and no issues found by Subaru dealer. No warning lights or other notifications, vehicle simply does not start.",
        "vin": "JF1VA1C65J9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/14/2021",
        "dateOfIncident": "04/15/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432906,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Subaru WRX. The contact stated that the vehicle had been parked in the garage during the winter months and while attempting to drive the vehicle, the vehicle would not start. The contact stated he charged the battery and he was able to restart the vehicle. The vehicle was not diagnosed nor repaired by an independent mechanic or dealer. The contact stated that the failure persisted, and he replaced the battery himself. However, the failure reoccurred, and he was unable to restart the vehicle. The dealer and the manufacturer were not notified of the failure. The vehicle was not diagnosed nor repaired. The approximate failure mileage was 5,000.",
        "vin": "JF1VA1C62J9"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/16/2021",
        "dateOfIncident": "03/09/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416770,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY DRAINED EVEN THOUGH I LEFT NO LIGHTS ON AND HAS HAPPENED MULTIPLE TIMES. HAD TO REPLACE BATTERY TWICE IN LESS THAN A YEAR. HAD BATTERY TESTED AND IT WAS GOOD. HAD TO JUMP MY CAR MULTIPLE TIMES FOR DEAD BATTERY WHILE AT WORK. VEHICLE WAS PARKED IN A PARKING LOT.",
        "vin": "JF1VA1A69J9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/15/2021",
        "dateOfIncident": "12/31/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416671,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY DRAINING BEGINNING IN DECEMBER 2019 BUT STILL EXISTS",
        "vin": "JF1VA1C63J9"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/04/2021",
        "dateOfIncident": "10/14/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386489,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WOKE UP ONE DAY TO MY WINDSHIELD HAVING A SMALLER CRACK THAT WAS NOT THERE BEFORE. WAS A COLD NIGHT CRACK HAS SPREAD, ASKED SUBARU IF THEY WOULD COVER THE COST THEY DIDN'T BUT ITS A KNOWN DEFECT IN SUBARU",
        "vin": "JF1VA1A62J9"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/14/2020",
        "dateOfIncident": "01/24/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383340,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD CHIPPED/CRACKED WHILE DRIVING ON A HIGHWAY.",
        "vin": "JF1VA1F63J8"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/09/2020",
        "dateOfIncident": "09/06/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354086,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING MY 2018 SUBARU WRX PREMIUM IN THE HEAT WITH THE A/C ON IT IS CAUSING EXTREME DRIVING CONDITIONS WITH THE CAR STUTTERING CAUSING FLUCTUATION IN SPEED WITH THE CAR DRAGGING THEN PROPELLING DRAMATICALLY DUE TO THE TURBO ENGAGING. THE ERRATIC CHANGE IN THE PERFORMANCE OF THE CAR IS NOT NORMAL AND IS CAUSE FOR ATTENTION FROM THE MANUFACTURER. I WAS DRIVING ON THE FREEWAY AND THIS PULLED SUCH AN EXTREME DRAIN ON THE CARS ELECTRICAL SYSTEM AND COOLING SYSTEM IT ALMOST MADE MY CAR OVERHEAT IN THE MIDDLE OF FAST MOVING TRAFFIC. MY CAR IS WELL MAINTAINED AND DRIVEN RESPONSIBLY. I HAD MY FAMILY IN THE CAR AND THIS COULD HAVE CAUSED A TRAGGIC SITUATION AS THE FREEWAYS HERE IN CALIFORNIA ARE VERY UNFORGIVING.",
        "vin": "JF1VA1C63J9"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/21/2020",
        "dateOfIncident": "02/20/2020",
        "fire": true,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340539,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE THROW-OUT BEARING AND FORK IN THE SIX SPEED MANUAL TRANSMISSION COMPLETELY BURNING THE CLUTCH IN 3 MONTHS TO 3000 MILES AFTER REPAIR WITH REPLACEMENT PART. THIS IS COMPLETELY UNACCEPTABLE IN A BRAND NEW VEHICLE AFTER REPAIR AT DEALERSHIP.  PURCHASED 2018 WRX WITH 13,000 MILES ON FEBRUARY 17, 2020 AND IT IS NOW JULY 2020 SINCE THEN, ON MY THIRD THROW OUT BEARING REPLACEMENT.  I PUT THE CAR IN GEAR, LET THE CLUTCH OUT ALL THE WAY OUT, PUSH THE GAS PEDAL AND THE CAR REVS UP AND SLIPS AND DOESNT MOVE IN MOVING TRAFFIC! IT COMPLETELY STOPS IN THE ROAD, I PHYSICALLY HAD TO GET OUT OF THE VEHICLE AND PUSH THE CAR OFF THE ROAD AND HAVE A TOW TRUCK TOW IT TO THE DEALERSHIP! THROW-OUT BEARING FORK BURNT OUT SMOKES UNDERNEATH THE HOOD.  A COMMON DEFECTIVE ISSUE ON THIS MODEL 2018 SUBARU WRX   THE DEALERS KNOW THIS AND THROW OUT BEARING IN TRANSMISSION IS NOT COVERED UNDER WARRANTY  MULTIPLE DUPLICATE SUBARU SERVICES PERFORMED WITH SAME DEFECTIVE THROW OUT BEARING  THE MANUFACTURER HAS CREATED A NEW RELEASE OF BEARINGS AND INCORPORATED INTO PRODUCTION IN THE 2018 LEGACY, OUTBACK, IMPREZA, CROSSTREK AND FORESTER. BUT NOT THE WRX!  FACT CHECK    HTTPS://STATIC.OEMDTC.COM/TSB/MC-10150949-9999.PDF    THROW OUT BEARING FORK IS RUSTED FROM MAJOR HEAT FRICTION AND CORRODED BURNT BLACK AND ORANGE RUST PARTICLES ON THE 3 MONTH OLD TRANSMISSION INTERIOR IN 3000 MILES OF DRIVING A BRAND NEW VEHICLE AND CLUTCH AND FLYWHEEL ARE COMPLETELY BURNT TO HELL.  THE THROW OUT BEARING MAKES A LOUD CHIRPING NOISE  FROM THE TRANSMISSION WITHIN THE BELLHOUSING OF THE TRANSMISSION EVERY DAY.  THOUSANDS OF WRX OWNERS EXPERIENCING THE SAME THROW-OUT BEARING ISSUE AND THE DEALER IS CHARGING CUSTOMERS FOR THESE REPAIRS OF THEIR FACTORY  DEFECTIVE SLIPPING TRANSMISSION IN THE 6 SPEED MANUAL TRANSMISSION.  IT IS A RIP OFF AND LEMON",
        "vin": "JF1VA1C66J9"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/21/2020",
        "dateOfIncident": "02/20/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340541,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE OEM THROW-OUT BEARING AND FORK IN THE SIX SPEED MANUAL TRANSMISSION COMPLETELY BURNING THE CLUTCH IN 3 MONTHS TO 3000 MILES AFTER REPAIR WITH REPLACEMENT PART. THIS IS COMPLETELY UNACCEPTABLE IN A BRAND NEW VEHICLE AFTER REPAIR AT DEALERSHIP.  PURCHASED 2018 WRX WITH 13,000 MILES ON FEBRUARY 17, 2020 AND IT IS NOW JULY 2020 SINCE THEN, ON MY THIRD THROW OUT BEARING REPLACEMENT.  I PUT THE CAR IN GEAR, LET THE CLUTCH OUT ALL THE WAY OUT, PUSH THE GAS PEDAL AND THE CAR REVS UP AND SLIPS AND DOESNT MOVE IN MOVING TRAFFIC! IT COMPLETELY STOPS IN THE ROAD, I PHYSICALLY HAD TO GET OUT OF THE VEHICLE AND PUSH THE CAR OFF THE ROAD AND HAVE A TOW TRUCK TOW IT TO THE DEALERSHIP! THROW-OUT BEARING FORK BURNT OUT SMOKES UNDERNEATH THE HOOD.  A COMMON DEFECTIVE ISSUE ON THIS MODEL 2018 SUBARU WRX   THE DEALERS KNOW THIS AND THROW OUT BEARING IN TRANSMISSION IS NOT COVERED UNDER WARRANTY  MULTIPLE DUPLICATE SUBARU SERVICES PERFORMED WITH SAME DEFECTIVE THROW OUT BEARING  THE MANUFACTURER HAS CREATED A NEW RELEASE OF BEARINGS AND INCORPORATED INTO PRODUCTION IN THE 2018 LEGACY, OUTBACK, IMPREZA, CROSSTREK AND FORESTER. BUT NOT THE WRX!  FACT CHECK    HTTPS://STATIC.OEMDTC.COM/TSB/MC-10150949-9999.PDF    THROW OUT BEARING FORK IS RUSTED FROM MAJOR HEAT FRICTION AND CORRODED BURNT BLACK AND ORANGE RUST PARTICLES ON THE 3 MONTH OLD TRANSMISSION INTERIOR IN 3000 MILES OF DRIVING A BRAND NEW VEHICLE AND CLUTCH AND FLYWHEEL ARE COMPLETELY BURNT TO HELL.  THE THROW OUT BEARING MAKES A LOUD CHIRPING NOISE  FROM THE TRANSMISSION WITHIN THE BELLHOUSING OF THE TRANSMISSION EVERY DAY.  THOUSANDS OF WRX OWNERS EXPERIENCING THE SAME THROW-OUT BEARING ISSUE AND THE DEALER IS CHARGING CUSTOMERS FOR THESE REPAIRS OF THEIR FACTORY  DEFECTIVE SLIPPING TRANSMISSION IN THE 6 SPEED MANUAL TRANSMISSION.!   IT IS A RIP OFF AND LEMON",
        "vin": "JF1VA1C66J9"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/21/2020",
        "dateOfIncident": "04/15/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329882,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS IN MOTION ON A HIGHWAY WHEN THE WIND SHIELD CRACKED ALONG THE MOST SUPERIOR BORDER OF THE WINDSHIELD. THERE WAS NOTHING VISIBLE OR AUDIBLE THAT HAD CAUSED THE WINDSHIELD TO CRACK DURING MY 10 MINUTE COMMUTE. THERE WAS ALSO LITTLE TO NO TRAFFIC. THE CRACK WAS LARGE ENOUGH THAT I HAD TO REPLACE THE WINDSHIELD. I AM ONLY REPORTING THIS NOW BECAUSE I SUSPECT THE WINDSHIELD CRACKED SECONDARY TO BEING ONE OF THE DEFECTIVE WINDSHIELD'S THAT SUBARU IS UNDER SCRUTINY FOR. UNFORTUNATELY, I NO LONGER HAVE PICTURES OF THE CRACKED WINDSHIELD; HOWEVER, I HAVE ATTACHED MY RECEIPT FROM SAFELITE AUTOGLASS.",
        "vin": "JF1VA1A68J9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/16/2020",
        "dateOfIncident": "01/16/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299791,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF EXPLODED DRIVING ON HIGHWAY GOING ROUGHLY 65MPH. THE CAR WAS NOT DRIVEN FOR 2 DAYS PRIOR DUE TO SNOW IN THE AREA, MEANING 2 OR 3 INCHES OF SNOW WAS SITTING ON TOP OF THE CAR THE PREVIOUS TWO DAYS. THE NIGHT PRIOR TO THE INCIDENT THE TEMPERATURE ROSE IN THE AREA TO AROUND 40 DEGREE F. THE MORNING OF THE INCIDENT THE TEMPERATURE WAS AROUND 38 DEGREES F. THE DEFROST WAS ON IN THE CAR AND THE SUNROOF COVER WAS CLOSED. THE CAR IS FITTED WITH A SUNROOF DEFLECTOR ON THE ROOF OF THE CAR AND ROOF RACKS ARE INSTALLED. FOR DEBRIS TO HIT TOP OF THE VEHICLE FROM ANOTHER MOVING CAR IS VERY UNLIKELY. THERE WERE NO OVERPASSES OR BRIDGES THAT WERE PASSED UNDER DURING THE INCIDENT.",
        "vin": "JF1VA2W66J9"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/03/2019",
        "dateOfIncident": "01/19/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205591,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "IN JANUARY 2019 AT AROUND 10PM PST MY 2018 SUBARU WRX EXPERIENCED A SERIOUS MALFUNCTION. AT THE TIME OF THIS INCIENT I WAS IN A SECLUDED, WOODED AREA WITHOUT CELLPHONE SERVICE, AS WELL AS BEING AT LEAST 30MINUTES TO THE NEAREST STORE.  THIS COULD HAVE BEEN DEADLY.  I WAS GOING DOWN A HILL AT 35MPH, IT WAS  RAINY AND DIFFICULT TO SEE. AT THE  BOTTOM OF THIS HILL WAS A SHARP TURN, AT THIS TIME THE SAFETY SYSTEM ACTIVED TAKING OVER ALL CONTROL OF THE VEHICLE. THIS CAUSED THE STEERING TO LOCK UP, PULLING TO THE FAR LEFT, TOWARDS A 15-20FOOT DROP INTO A LAKE. THE APPROACHING TURN I WAS SUPPOSED TO TAKE WAS A SHARP RIGHT. STILL UNABLE TO REGAIN CONTROL I WAS DRIVING STRAIGHT INTO THE FAST APPROACHING LAKE. SHORTLY BEFORE THE ENDGE OF THE ROAD I WAS ABLE TO FORCE THE VEHICLE TO THE RIGHT. AGAIN STEERING LOCKED UP, NOW FORCING ME FAR RIGHT. AT THE RIGHT WAS DENSE TREES, BUSHES, AND SHRUBS. NARROWLY ABLE TO REGAIN CONTROL BEFORE GOING HEAD-ON INTO A TREE, I FORCED THE STEERING WHEEL BACK TO THE LEFT. I ENDED UP STRIKING SOME BUSHES AND A TREE STUMP. CAUSING MINOR DAMAGE TO THE PASSENGER SIDE MIRROR, SCRATCHES TO BOTH PASSENGER DOORS, AND A DEEP DENT ON THE LOWER REAR DOOR AND QUARTER PANNEL. THIS IS WHEN THE REAR PASSENGER TIRE COLLIDED WITH A TREE STUMP, TAKING THE 35MPH BRUNT IMPACT THAT STOPPED THE CAR INSTANTLY. THE TIRE WAS SEPARATED FROM THE RIM BY A TREE BRANCH, THE LOWER CONTROL ARM WAS BENT AND CRACKED, THE ENTIRE REAR DRIVE TRAIN WAS PUSH TO THE RIGHT CAUSING THE ALIGNMENT OF THE DRIVER SIDE LEFT TIRE TO BE PUSHED OUT AS WELL. THE AIRBAGS DID NOT DEPLOY. THE CAR WAS 100% IMMOBILE AT THIS POINT AS THE REAR TIRE WOULDN'T MOVE. AFTER SPENDING AN HOUR I WAS ABLE TO REMOVE THE OLD TIRED AND PUT ON THE DOUGHT. I HAVE COMPLAINED ABOUT THE ISSUES THAT CASUED THIS MANY TIMES AND NOTHING HAS BEEN DONE. I AM SCARED OF THIS CAR AND WILL NEVER OWN A SUBARU AGAIN.",
        "vin": "JF1VA1L69J8"
    },
    {
        "components": "STEERING,STRUCTURE,WHEELS",
        "crash": true,
        "dateComplaintFiled": "05/03/2019",
        "dateOfIncident": "01/19/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205600,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "IN JANUARY 2019 AROUND 10PM PST MY 2018 SUBARU WRX EXPERIENCED A SERIOUS MALFUNCTION. AT THE TIME OF THIS INCIENT I WAS IN A SUCLUDED, WOODED AREA WITHOUT CELLPHONE SERVICE, AS WELL AS BEING ATLEAST 30MINUTES TO THE NEAREST STORE. THIS COULD HAVE BEEN DEADLY.  I WAS GOING DOWN A HILL AT 35MPH, IT WAS VERY RAINY AND DIFFICULT TO SEE. AT THE  BOTTOM OF THIS HILL WAS A SHARP RIGHT TURN, AT THIS TIME THE SAFETY SYSTEM ACTIVED TAKING OVER ALL CONTROL OF THE VEHICLE. THIS CAUSED STEERING TO LOCK UP, TURNING TO THE FAR LEFT. AT THE RIGHT WAS A 15-20FOOT DROP INTO A LAKE. THE TURN I WAS SUPPOSED TO TAKE WAS A SHARP RIGHT. STILL UNABLE REGAIN CONTROL AND WAS DRIVING STRAIGHT TOWARDS THE FAST APPROACHING LAKE. SHORTLY BEFORE DROPOFF I WAS ABLE TO FORCE THE STERRING WHEEL TO THE RIGHT. BUT STEERING AGAIN LOCKED UP AND FORCED ME TO THE FAR RIGHT. OFF THE ROAD TO THE RIGHT WAS HEAVLY WOODED. NAROWLY ABLE TO REGAIN CONTROL OF STERRING I CRASHED THROUGH BUSHES. CAUSING MINOR DAMAGE TO THE FOLLOWING; PASSENGER SIDE MIRROR, SCRATCHES TO WHOLE PASSENGER SIDE, DEEP DENT ON LOWER REAR DOOR AND QUARTER PANEL. REAR PASSENGER TIRE COLLIDED WITH A TREE STUMP WITH IMPACT AT 35MPH STOPPING THE CAR INSTANTLY. TIRE WAS SEPARATED FROM THE RIM BY A TREE BRANCH, LOWER CONTROL ARM WAS BENT AND CRACKED, ENTIRE REAR DRIVE AXLE WAS PUSH TO THE RIGHT CAUSEING ALIGNMENT OF THE DRIVER SIDE REAR TIRE TO BE PUSHED OUT. THE AIRBAGS DID NOT DEPLOY AND I HIT MY HEAD ON THE DRIVER'S SIDE WINDOW. THE CAR WAS 100% UNDRIVABLE TIRE WOULDN'T MOVE. TAKING DAMAGE TIRE OFF AND PUTTING ON DONUGT TOOK OVER AN HOUR, I COULDN'T GET THE DAMAGED TIRE OFF. A LOT MORE TO THIS AS WELL. I HAVE COMPLAINED ABOUT THIS ISSUE MANY TIMES AND DEALERSHIP DID NOTHING. I AM SCARED OF THIS CAR AND WILL NEVER OWN A SUBARU AGAIN. I WANT THIS CAR GONE!!!!  SOMETHING OF THIS NATURE HAPPENS EVERYDAY WITH MY CAR. JUST ONCE IT CAUSED AN ACCIDENT",
        "vin": "JF1VA1L69J8"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "05/03/2019",
        "dateOfIncident": "01/19/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205605,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "IN JANUARY 2019 AROUND 10PM PST MY 2018 SUBARU WRX EXPERIENCED A SERIOUS MALFUNCTION. AT THE TIME OF THIS INCIENT I WAS IN A SUCLUDED, WOODED AREA WITHOUT CELLPHONE SERVICE, AS WELL AS BEING ATLEAST 30MINUTES TO THE NEAREST STORE. THIS COULD HAVE BEEN DEADLY.  I WAS GOING DOWN A HILL AT 35MPH, IT WAS VERY RAINY AND DIFFICULT TO SEE. AT THE  BOTTOM OF THIS HILL WAS A SHARP RIGHT TURN, AT THIS TIME THE SAFETY SYSTEM ACTIVED TAKING OVER ALL CONTROL OF THE VEHICLE. THIS CAUSED STEERING TO LOCK UP, TURNING TO THE FAR LEFT. AT THE RIGHT WAS A 15-20FOOT DROP INTO A LAKE. THE TURN I WAS SUPPOSED TO TAKE WAS A SHARP RIGHT. STILL UNABLE REGAIN CONTROL AND WAS DRIVING STRAIGHT TOWARDS THE FAST APPROACHING LAKE. SHORTLY BEFORE DROPOFF I WAS ABLE TO FORCE THE STERRING WHEEL TO THE RIGHT. BUT STEERING AGAIN LOCKED UP AND FORCED ME TO THE FAR RIGHT. OFF THE ROAD TO THE RIGHT WAS HEAVLY WOODED. NAROWLY ABLE TO REGAIN CONTROL OF STERRING I CRASHED THROUGH BUSHES. CAUSING MINOR DAMAGE TO THE FOLLOWING; PASSENGER SIDE MIRROR, SCRATCHES TO WHOLE PASSENGER SIDE, DEEP DENT ON LOWER REAR DOOR AND QUARTER PANEL. REAR PASSENGER TIRE COLLIDED WITH A TREE STUMP WITH IMPACT AT 35MPH STOPPING THE CAR INSTANTLY. TIRE WAS SEPARATED FROM THE RIM BY A TREE BRANCH, LOWER CONTROL ARM WAS BENT AND CRACKED, ENTIRE REAR DRIVE AXLE WAS PUSH TO THE RIGHT CAUSEING ALIGNMENT OF THE DRIVER SIDE REAR TIRE TO BE PUSHED OUT. THE AIRBAGS DID NOT DEPLOY AND I HIT MY HEAD ON THE DRIVER'S SIDE WINDOW. THE CAR WAS 100% UNDRIVABLE TIRE WOULDN'T MOVE. TAKING DAMAGE TIRE OFF AND PUTTING ON DONUGT TOOK OVER AN HOUR, I COULDN'T GET THE DAMAGED TIRE OFF. A LOT MORE TO THIS AS WELL. I HAVE COMPLAINED ABOUT THIS ISSUE MANY TIMES AND DEALERSHIP DID NOTHING. I AM SCARED OF THIS CAR AND WILL NEVER OWN A SUBARU AGAIN. THIS IS ONE OF DOZENS OF ISSUES I HAVE WITH THIS CAR. ITS GETTING WORSE BUT THE DEALER WONT CARE UNTIL I GET HURT",
        "vin": "JF1VA1L69J8"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/25/2019",
        "dateOfIncident": "03/26/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203653,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING VEHICLE THE ENGINE STARTED KNOCKING. TOOK TO DEALER UNDER WARRANTY AND DENIED CLAIM.",
        "vin": "JF1VA1A68J9"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/23/2019",
        "dateOfIncident": "04/17/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203037,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT ADVISING CYLINDER MISFIRE  ADVISING RINGLAND OISTON FAILURE SPARKNPLUG DESTROYED",
        "vin": "JF1VA2M63J9"
    },
    {
        "components": "STEERING,WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/16/2019",
        "dateOfIncident": "12/20/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11170277,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WHEELS LOCKED WHILE DRIVING ON A CLEAR DECEMBER DAY (I DON'T HAVE EXACT DAY) ON A WINDING MOUNTAIN ROAD FULL OF CLIFFS. 38 MPH AND FEET FROM GOING OFF A CLIFF SUBARU SAY  ELECTRONIC MODULE FAILED THEN IN ANOTHER STATEMENT FROM HAK AT SUBARU AMERICA THEY SAY THE TWO OCCURRENCES NOT RELATED EVEN THOUGH THEY HAPPENED SIMULTANEOUSLY.  WE TOOK THE CAR IN BECAUSE OF THE WHEEL LOCKING UP WHILE MOVING AND THEY DISCOVERED THE ELECTRONIC FAILURE. THEY MAINTAIN THE CAR IS SAFE TO DRIVE \"BECAUSE THEY CAN'T RECREATE THE PROBLEM\".  SUBARU FAIRFIELD HAS PROMISED US HELP BUT HAVE DONE NOTHING BUT ISSUE THREATS WHEN NO ONE FROM SUBARU AMERICA EVEN CALLS US! THE CARS HAVE A SERIOUS SAFETY ISSUE AND NO ONE WANTS TO DRIVE IT INCLUDING THE SERVICE TECHNICIAN. THEY DROVE IT 20 MILES WHEN THEY WERE SUPPOSED TO BE TESTING IT. WE HAVE DATE/TIME STAMPED PHOTOS!  WE WERE TOLD THIS IS A \"RARE\" SAFETY FAILURE YET THEY TREAT US LIKE NORMAL AND LIE ABOUT EVEN TEST DRIVING IT. THIS IS SO UNSAFE THAT A CAR WHEEL STOPS MOVING LIKE THE ENGINE IS OFF YET THE CAR IS RUNNINGT!!!  SHE DECIDED TRY AND JERK THE WHEEL SUPER HARD AND FORTUNATELY IT FINALLY MOVED AND SHE DID NOT GO OVER THE CLIFF AND FORTUNATELY THERE WAS NO TRAFFIC COMING IN THE OPPOSING LANE AS SHE CROSSED THE YELLOW LINES ETC.  SHE HAD A SORE BACK FOR MANY DAYS FROM THE FORCE OF JERKING THE WHEEL AND WAS LEFT SHAKEN AND DISTURBED WITH NO WHERE TO PULL OVER.  SUBARU AMERICA REGIONAL SERVICE MANAGER REQUESTED THE DETAILS AND WAS SUPPOSED TO CONTACT US BUT NO ONE HAS.  WE NAIVELY BELOVED THE DEALER THAT THEY WERE TRYING TO HELP US INSTEAD TODAY I GET AN EMAIL SAYING THE WILL NOW CHARGE US STORAGE OF $175 X DAY IF WE DON'T COLLECT THE CAR.  I SENT THEM NOTIFICATION THAT WE ARE SURRENDERING THE LEASE AS WE WILL NEVER GET IN THIS CAR AGAIN.  DONT BUY A WRX!!!!!",
        "vin": "JF1VA1A67J9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/29/2018",
        "dateOfIncident": "05/06/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154864,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE MILEAGE WAS 7387 MILES. WHILE DRIVING SEVERAL CHECK ENGINE LIGHTS ILLUMINATED INCLUDING TRACTION CONTROL, CHECK ENGINE LIGHT, ABS, HILL DECENT ASSIST, CRUISE CONTROL ICON FLASHING. VEHICLE POWER WAS DRAMATICALLY REDUCED. MADE APPOINTMENT NEXT DAY WITH SUBARU DEALERSHIP. I WAS INFORMED CODE P0016 SHOWED UP ON THE DIAGNOSIS. IT INDICATED CRANKSHAFT POSITION CAMSHAFT POSITION CORRELATION BANK 1 SENSOR A. VEHICLE WAS AT DEALERSHIP FOR CLOSE TO TWO WEEKS. NUMEROUS PARTS WERE REPLACED INCLUDING OIL VALVE ASSEMBLY, CAMSHAFT SPROCKET ASSEMBLY, ECU CONTROL UNIT, GUIDE CHAINS, CHAIN LEVER, ETC. I HAVE INVOICE FROM DEALERSHIP DETAILING ALL PARTS REPLACED. ALTHOUGH COVERED UNDER WARRANTY, A BRAND NEW VEHICLE WITH UNDER 8000 SHOULDN'T ENCOUNTER THESE ISSUES.",
        "vin": "JF1VA1C66J9"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/26/2018",
        "dateOfIncident": "10/07/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142978,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT PASSENGER DOOR WAS SLAMMED ON MY 2018 SUBARU WRX.  THIS CAUSED ALL OF THE SIDE AIRBAGS TO DEPLOY- INCLUDING THE AIRBAG IN THE PASSENGER SEAT.  THE VEHICLE WAS STOPPED WITH THE ENGINE ON.  THERE WAS NO IMPACT ASIDE FROM THE DOOR BEING SLAMMED FROM THE OUTSIDE.  THIS OCCURRED IN A PARKING LOT.",
        "vin": "JF1VA1A68J9"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/27/2018",
        "dateOfIncident": "05/30/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104249,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS ISSUE OCCURS ON ACCELERATION , MOST NOTICEABLE WHEN MERGING ONTO FREEWAY FROM ON RAMP 1/2 THROTTLE , THE VEHICLE STARTS TO ACCELERATE NORMAL THEN HITS AROUND 4200 RPM AND THE BOOST GAUGE GOES NUTS FLUCTUATING UP AND DOWN AND THE VEHICLE LOOSES POWER , HESITATES , SURGES ( LIKE A FLAT SPOT ) THEN FINALLY GETS A LITTLE HIGHER IN RPM AND IT WILL PICK UP AGAIN THROUGH THE REST OF RPM GAUGE , MOST NOTICEABLE IN LOWER GEARS ( MINES A 6 SPEED MANUAL , I HAVE TAKEN THE CAR TO DEALER ON 5/30/18 WITH 1380 MILES ON THE ODOMETER , HUFFINES SUBARU DENTON TEXAS , TONY THE SERVICE MANAGER DROVE MY CAR AND DUPLICATED THE COMPLAINT , HE THEN PROCEEDED TO GET ANOTHER NEW WRX OFF THE LOT SIMILAR TO MINE AND AGAIN DUPLICATED THE COMPLAINT ( SO THIS IS A KNOWN ISSUE ) THE DEALER CLAIMS ITS JUST A DESIGN IN THE CAR , ITS VERY UNSAFE AS YOU THINK YOU WILL GET UP TO SPEED AND THEN IT HESITATES WHICH COULD CAUSE AN ACCIDENT , THE DEALER DID SAY THEY WOULD OPEN A CASE WITH SUBARU TECHLINE WHICH THEY DID NOT , SO I CALLED SUBARU CUSTOMER SERVICE AND FILED A COMPLAINT , THEY CALL BACK 2 DAYS LATER AND TELL ME WE SPOKE TO DEALER NOTHING WE CAN DO , SO I PROCEEDED TO DO AN INTERNET SEARCH AND FOUND NUMEROUS PEOPLE COMPLAINING ABOUT THE SAME ISSUE ON 17-18 WRX MODELS , I CURRENTLY HAVE 2006 MILES ON THE CAR AND ITS STILL DOING THIS , NOT SURE IF ITS A DRIVE BY WIRE , THROTTLE MAP ISSUE OR A FLAW IN THE FACTORY TUNING CAUSING THIS BUT IT NEEDS TO TO BE ADDRESSED AND FIXED , VEHICLE GIVES FALSE SENSE OF SECURITY ON ACCELLERATION .",
        "vin": "JF1VA1F69J9"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "05/25/2018",
        "dateOfIncident": "05/14/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097999,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 SUBARU WRX. WHILE DRIVING AND AFTER SHIFTING THE GEAR, THE STEERING WHEEL SEIZED WITHOUT WARNING.  AS A RESULT, THE VEHICLE JUMPED A CURB AND CRASHED INTO SOME BUSHES. THE AIR BAGS DID NOT DEPLOY. THERE WERE NO INJURIES. A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS TOWED TO SUBARU OF SANTA FE (7511B CERRILLOS RD, SANTA FE, NM 87507), BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 3,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING,AIR BAGS,WHEELS",
        "crash": true,
        "dateComplaintFiled": "10/12/2017",
        "dateOfIncident": "09/28/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11033086,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT'S SON OWNS A 2018 SUBARU WRX. WHILE MAKING A LEFT TURN AT 25 MPH, THE FRONT DRIVER SIDE WHEEL REMAINED IN A TURNED POSITION AFTER THE DRIVER ATTEMPTED TO STRAIGHTEN THE VEHICLE. THE DRIVER LOST CONTROL OF THE VEHICLE AND COLLIDED WITH A TREE. THE AIR BAGS FAILED TO DEPLOY. THE DRIVER SUFFERED A BROKEN NOSE AND A SWOLLEN EYE. THE DRIVER WAS TAKEN TO THE HOSPITAL FOR MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED FROM THE SCENE TO AN INDEPENDENT MECHANIC. THE VEHICLE WAS IN THE PROCESS OF BEING TRANSFERRED TO BRUNSWICK SUBARU (2992 CENTER RD, BRUNSWICK, OH 44212) FOR DIAGNOSTIC TESTING. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PLANNED TO INVESTIGATE. THE APPROXIMATE FAILURE MILEAGE WAS 1,055.",
        "vin": "JF1VA1C62J9"
    }
]