[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/31/2021",
        "dateOfIncident": "03/20/2021",
        "fire": true,
        "manufacturer": "Thor Motor Coach",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405729,
        "products": [
            {
                "manufacturer": "Thor Motor Coach",
                "productMake": "THOR",
                "productModel": "WINDSPORT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RADIO (AND CAMERA SYSTEM) HAD BEEN ACTING STRANGELY AND MY CIGARETTE OUTLETS STOPPED WORKING WHILE I WAS DRIVING.  I STOPPED FOR THE NIGHT AND HAD PARKED AND CONNECTED THE RV TO THE CAMPGROUND POWER.  ABOUT 10 MINUTES AFTER PARKING AND HOOKING UP I STARTED TROUBLE SHOOTING THE LOSS OF POWER TO THE CIGARETTE LIGHTERS.  I CHECKED THE FUSE AND DID NOT SEE ANY VISIBLE FAILURE OF THE FUSE BUT DECIDED TO TRY A BRAND NEW FUSE JUST IN CASE.  AFTER REPLACING THE FUSE FOR THE CIGARETTE LIGHTERS, A FIRE STARTED IN THE AREA OF THE RADIO AND CIGARETTE LIGHTERS.  WHILE TRYING TO USE A FIRE EXTINGUISHER TO PUT OUT THE FIRE BY SPRAYING UP FROM UNDER THE DASH, THE RADIO FELL INTO THE DASH.  I THEN SPRAYED WHAT WAS LEFT OF THE FIRE EXTINGUISHER INTO THE RADIO OPENING.  I WAS UNABLE TO PUT THE FIRE OUT AS I NOTICED A GLOW IN THE DASH STILL TO THE DRIVERS SIDE OF THE RADIO OPENING.  AT THAT POINT I EVACUATED THE RV AND CALLED 911.  THE RV BURNED DOWN AND IS A TOTAL LOSS.",
        "vin": "1F66F5DY7J0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/31/2020",
        "dateOfIncident": "08/31/2020",
        "fire": false,
        "manufacturer": "Thor Motor Coach",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352353,
        "products": [
            {
                "manufacturer": "Thor Motor Coach",
                "productMake": "THOR",
                "productModel": "WINDSPORT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A CABINET MOUNTED ON THE CEILING THAT IS ABOVE THE DRIVERS AND PASSENGERS SIDE THAT HAS NOT BEEN PROPERLY SECURED.  THERE ARE COMPLAINTS AND PICTURES FOUND ON THE FACEBOOK GROUP FOR THOR OWNERS.  I DECIDED TO CHECK MINE AND IT WAS LOOSE AND WHEN I OPENED THE DOORS ALL OF THE SCREWS LOCATED ON THE FRONT SIDE HAVE BEEN PULLED DOWN FROM THE CEILING.  I HAVE CONTACTED THOR BY EMAIL AND EXPLAINED TO THEM THAT THIS COULD CAUSE AN ACCIDENT IF IT FELL DOWN WHILE DRIVING.",
        "vin": "1F66F5DY1J0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/04/2020",
        "dateOfIncident": "01/10/2020",
        "fire": false,
        "manufacturer": "Thor Motor Coach",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307021,
        "products": [
            {
                "manufacturer": "Thor Motor Coach",
                "productMake": "THOR",
                "productModel": "WINDSPORT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AXEL HANGERS ON THE PASSENGER SIDE OF MOTOR HOME WERE LOOSE, FOUND THAT THIS IS A PROBLEM WITH THE MOTOR-HOMES VERY UNSAFE WHEN TOWING A CAR OR TRAILER. ON HIGHWAY TRAVELING HAD TO STOP AND GET IT TORQUED  TO CONTINUE. *DT*JB",
        "vin": "1F66F5DY9J0"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/20/2019",
        "dateOfIncident": "05/13/2019",
        "fire": false,
        "manufacturer": "Thor Motor Coach",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208560,
        "products": [
            {
                "manufacturer": "Thor Motor Coach",
                "productMake": "THOR",
                "productModel": "WINDSPORT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS NOT SECURELY FASTENED AND NOT AIMED APPROPRIATELY. TEN FEET AHEAD OF VEHICLE ON LOW BEAMS.",
        "vin": "1F65F5DY8JO"
    }
]