[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/17/2022",
        "dateOfIncident": "01/01/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452413,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The front differential in our 2018 Toyota 4Runner failed.  This caused damage to one of the front axels of the vehicle.  The failure can cause difficulties in turning the vehicle.    The failure can lead to catastrophic failure of the axels, leading to the wheels to lock up.   The problem is reoccurring in model years 2016-2019. Toyota is aware of the problem and has issued bulletins (see Toyota Technical Service Bulletin T-TCI-5185 Rev.1, dated 4/5/2019).  Yet, Toyota refuses to offer a cost free repair of the failure/damage.   The failure was inspected and confirmed by an authorized Toyota dealership on 2/9/2022.  The failure had no warning signs/indicators.   The failure began approximately 30-45 ago with a faint grinding sound coming from the drivetrain while driving.",
        "vin": "JTEBU5JR0J5"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/29/2021",
        "dateOfIncident": "06/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422778,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle steering shakes between 60-65 mph. After 4 different sets of tires in 3 weeks, multiple road force balances, tire rotations, an alignment, an alignment checks, brakes checked, a “visual inspection” of suspension components from two Toyota dealerships, the vehicle continues to vibrate at highways speeds.",
        "vin": "Jtebu5jr6j5"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/17/2021",
        "dateOfIncident": "01/03/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417419,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I noticed a crack forming in the windshield without seeing any signs of an impact. I took it in and Toyota had found a small indentation along the crack line that they claimed to be what caused the crack. This indentation along the crack line was superficial and did not have any of the \"spider legs\" type crack lines out of it. I have had older vehicles in the Pacific Northwest without this issue, and  I thought this was odd so I took it to a 3rd party Master Window repair technician not associated with Toyota and they diagnosed it as a stress crack related to the heating element.",
        "vin": "JTEBU5JR7J5"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/29/2021",
        "dateOfIncident": "01/13/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405344,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA 4RUNNER. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V682000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO RECALL REPAIR WAS UNAVAILABLE. TUSCALOOSA TOYOTA (3325 SKYLAND BLVD E, TUSCALOOSA, AL 35405, (205) 553-3325) WAS CONTACTED AND IT WAS CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JTEZU5JRXJ5"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/26/2021",
        "dateOfIncident": "03/26/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405007,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA 4RUNNER. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V682000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CALLED MOSES TOYOTA (1433 MACCORKLE AVE, ST ALBANS, WV 25177) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JTEBU5JR1J5"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/24/2021",
        "dateOfIncident": "02/23/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404761,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS BEING DRIVEN ON BELTWAY AND SUDDENLY LOST ALL POWER, BRAKING, AND STEERING CAPABILITIES.  EMERGENCY BRAKE WAS USED TO STOP VEHICLE.  VEHICLE WAS NOT ABLE TO BE RESTARTED.  PHONE ATTACHED VIA CIGARETTE OUTLET WAS ZAPPED.  MANUFACTURER HAS FAILED TO ASSUME ANY RESPONSIBILITY CUSTOMER HAS ENDURED DUE TO THIS TOTAL VEHICLE MALFUNCTION.",
        "vin": "JTEBU5JR1J5"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/14/2021",
        "dateOfIncident": "03/08/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402837,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 4RUNNER TRD OFF ROAD PREMIUM. 24733MILES (AT THE TIME THIS REVIEW IS WRITTEN)   STARTED TO FEEL LIKE IT ACCELERATE BUT WITH OUT DOING IT. (VERY FEW NOT THAT PRONOUCE)  TOOK IT TO DEALER ON APRIL  2020 AROUND (14900MILES). THEY DID A RECALL CHECK AND SAID THEY FOUND NOTHING AND THAY MY TRUCK WAS FINE.  MARCH 2021  IT HAPPEN AGAIN BUT NOW IT WAS DOING IT VERY STRONGLY. TRUCK STARTED TO STALL  DASHBOARD LIGHTS STARTED TO APPEAR  4WD INDICATOR FLASHES RAPIDLY  CHARGING SYSTEM WARNING  LOW ENGINE OIL PRESSURE  CHECK ENGINE  MULTI-TERRAIN FLASHES CONTINUESLY  TRAC OFF LIGHT  ECO LIGHT  TOOK IT TO THE DEALER THEY TOLD ME THEY WILL CHECK  THE PROBLEM.  CALL THEM TO SEE IF THEY HAPPEN TO KNOW WHAT WAS GOING ON AND THEY TOLD ME THAT THE WERE WORKING ON IT DOING THE RECALL SERVICE (AGAIN).   NEXT DAY THEY CALL ME AND SAID THEY DID THE RECALL (WHICH THERE IS NOT REMEDY AVAILABLE AT THIS TIME 3-8-21) AND THE TRANSMISSION WAS THE PROBLEM AND THAT I NEED TO PAY TO GET IT FIX IT BECAUSE THEY FOUND METAL DEBRIS ON IT. WENT THERE RIGHT AWAY THEY EXPLAINED TO ME WHAT THEY SAID IT LOOKS TO BE THE PROBLEM. FAST FORWARD THEY CALL ME AGAIN AND SAID PROBLEM WAS DIFFERENT (GETTING OTHER PARTY INVOLVED). THE 3RD PARTY WENT IN TO CHECK THE PROBLEM THEY SAID IT WAS TO BE TOLD A VERY DIFFERENT HISTORY SAYING THEY FOUND GEAR OIL INSIDE TRANSMISSION AND THEY WERE SURE (NOT BECAUSE ANY TESTING)  BUT BECAUSE IT LOOKS AND SMELLS LIKE IT (WHEN THE OIL THEY SHOWED ME AT FIRS WAS BURNED OIL) VERY DIFFERENT FROM WHAT THEY TOLD ME BEFORE AND NOW THE TRUCK TRANSFER CASE WAS ON THE PROBLEM AS WELL. ALL I KNOW IS TRANSMISSION SEEMS TO BE THE PROBLEM AND NOW A PRACTICLY NEW TRUCK HAS TO GET A NEW TRANSMISSION",
        "vin": "JTEBU5JR3J5"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/20/2021",
        "dateOfIncident": "01/07/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389041,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MULTIPLE OCCASIONS WITH SPEEDS VARIED 35-60MPH WHEN BRAKES WERE APPLIED VEHICLE LOCKED UP, SOMETIMES PULLING TO ONE SIDE, BRAKES THEN WENT TO FLOOR NOT STOPPING VEHICLE REQUIRING ME TO BRAKE AGAIN.. SOMETIMES ROLLING INTO TRAFFIC.. THIS STARTED IMMEDIATELY AFTER PURCHASING THE VEHICLE WITH ONLY 12 MILES ON THE ODOMETER.  I HAVE TAKEN THE VEHICLE IN MULTIPLE TIMES AND TOLD THEY CANNOT RECREATE THE ISSUE SND ARE UNABLE TO IDENTIFY A ISSUE.. WHAT WORRIES ME IS THAT I HAVE TO POTENTIALLY GET HARMED. THE VEHICLE ONLY HAS 26K MILES ON IT. I AM TERRIFIED TO DRIVE IT.",
        "vin": "JTEBU5JR8J5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/29/2020",
        "dateOfIncident": "08/25/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385434,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA 4RUNNER. THE CONTACT STATED THAT WHILE DRIVING A POPPING NOISE OCCURRED THAT WAS COMING FROM THE ENGINE. THE VEHICLE STARTED TO DECELERATE. THE VEHICLE STARTED MAKING AN ABNORMAL SOUND THAT WAS COMING FROM THE ENGINE. THE VEHICLE THEN WAS ABLE TO DRIVE NORMAL. THE AIR BAGS WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO FRED HAAS TOYOTA WORLD (20400, I-45, SPRING, TX 77373) TWICE, BUT WAS NOT DIAGNOSED NOR REPAIRED. THE VIN WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 20V682000 (FUEL SYSTEM, GASOLINE). THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 47,000.",
        "vin": "JTEBU5JR9J5"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/15/2020",
        "dateOfIncident": "11/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383570,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA 4RUNNER. THE CONTACT STATED THAT WHILE DRIVING 55 MPH, THE VEHICLE STALLED WITHOUT WARNING. ADDITIONALLY, THE BRAKE LIGHTS WERE INOPERABLE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V682000 (FUEL SYSTEM, GASOLINE). A DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS CONTACTED IN REGARDS TO SCHEDULING AN APPOINTMENT FOR THE RECALL REPAIR HOWEVER, THE CONTACT WAS INFORMED THAT PARTS WERE NOT YET AVAILABLE FOR THE RECALL REPAIR AND THERE WAS NO IMMEDIATE TIME FRAME WHEN PARTS WOULD BE AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 25,000. ## VIN PASSED ## TOYOTA 2018 ##",
        "vin": "JTEBU5JRXJ5"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "12/14/2020",
        "dateOfIncident": "12/12/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383292,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2018 4RUNNER STALLED 12/12  AMIDST MY HAVING MADE A TURN OUT OF MY DRIVE WAY AND COMMENCING ACCELERATION OF THE VEHICLE. MY SPEED  COULDN'T HAVE BEEN IN EXCESS PN 20 MPH. I DID NOT LOOSE ELECTRICAL FUNCTIONS. THE VEHICLE SIMPLY LOST MOBILITY. I SHIFTED THE VEHICLE TO NEUTRAL AND JUGGLED THE ACCELERATOR AND REGAINED ACCELERATION, WITHOUT ANY FURTHER SUCH INCIDENTS OF THE KIND. THE FOLLOWING DAY 12/14 THE VEHICLE STALLED YET AGAIN AT A POINT OF ACCELERATEATION AT APPROXIMATELY 15 MPH. ON THIS OCCASION I WAS TURNING YET AGAIN AT LOW SPEED. THE SUCCESSION OF STALLS SEEMS TO OCCUR AT LOW SPEED WHILE ON THE PROCESS OF TURNING. ARRANGEMENTS HAVE BEEN MADE TO RETURN THE VEHICLE TO LOWE TOYOTA  IN WARNER ROBINS TO LEAVE THE VEHICLE FOR FURTHER OBSERVATIONS. I WILL BE PERSONALLY DRIVING THE VEHICLE.",
        "vin": "JTEBU5JRXJ5"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/07/2020",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378226,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA 4RUNNER. THE CONTACT DISCOVERED NHTSA CAMPAIGN NUMBER: 20V682000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. SINCE DISCOVERING THE RECALL, THE CONTACT STATED THAT HE WOULD HEAR AN ABNORMAL HUMMING SOUND COMING FROM THE FUEL PUMP WHILE THE VEHICLE WAS STATIONARY. THE CONTACT STATED THAT THE SOUND CONTINUED UNTIL THE VEHICLE WAS RESTARTED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS APPROXIMATELY 20,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JTEBU5JR4J5"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/10/2020",
        "dateOfIncident": "04/17/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373941,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TOP OF THE STEERING WHEEL IS FLAKING OFF LEAVING IT ROUGH AND ANNOYING TO THE TOUCH. I HAVE REPORTED THIS TO TOYOTA WHO HASN'T TAKEN ANY ACTION.",
        "vin": "JTEBU5JR8J5"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/08/2020",
        "dateOfIncident": "11/30/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373655,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY 2018 4RUNNER NEW IN NOVEMBER 2018. SHORTLY AFTER I NOTICED THE STEERING WHEEL WOULD WOBBLE TO THE LEFT AND RIGHT WHILE DRIVING 50-60 MPH. I HAVE TAKEN THE VEHICLE TO MY LOCAL TOYOTA DEALERSHIP THREE TIMES BUT THEY ARE UNABLE TO FIX THE ISSUE EVEN AFTER REBALANCING THE TIRES EVERY TIME AND DOING AN ALIGNMENT ONCE. THE DEALERSHIP STATES THAT THIS IS NORMAL ON 4RUNNERS. THIS IS DEFINITELY NOT NORMAL ON A NEW VEHICLE AND TOYOTA NEEDS TO FIX THE ISSUE. MANY PEOPLE HAVE REPORTED HAVING SIMILAR PROBLEMS WITH THEIR 4RUNNER WHILE DRIVING AT THE SAME SPEEDS.",
        "vin": "JTEBU5JRXJ5"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/01/2020",
        "dateOfIncident": "10/21/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372555,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED VEHICLE BRAND NEW WITH 18 MILES ON IT. I GET IT SERVICED LIKE CLOCKWORK AND HAVE NEVER MISSED A MAINTENANCE APPOINTMENT. A LITTLE OVER A WEEK AGO, THE ELECTRICAL LOCKING SYSTEM ON THE DRIVERS SIDE DOOR STOPPED FUNCTIONING. TOYOTA IS TELLING ME THAT THERE ARE NO RECALLS AND IT WILL COST ME ALMOST $1000.00 TO REPAIR. NOW, THE ELECTRIC LOCKING SYSTEM FOR THE PASSENGER SIDE DOOR IS NOT WORKING AND TOYOTA IS STILL SAYING IT IS NOTHING THEY CAN DO BECAUSE THERE IS NO RECALL AND THE VEHICLE IS NO LONGER UNDER WARRANTY. THIS IS NOT ACCEPTABLE. ONE MINUTE THE LOCKING SYSTEM WAS WORKING WITH NO OBVIOUS SIGNS THAT SOMETHING WAS AMIDST, THEN ALL OF A SUDDEN, MY 4 RUNNER DOORS ARE NOT LOCKING. NOW THE COST IS DOUBLE AND THEY ARE SAYING THAT THE OTHER DOORS WILL SOON FOLLOW.",
        "vin": "JTEBU5JR9J5"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/26/2020",
        "dateOfIncident": "10/23/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366551,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED A NEW 2018 TOYOTA 4RUNNER WITH VIN [XXX] IN LATE 2017.  IN OCTOBER OF 2019 WE NOTICED THAT THE BUMPER KEPT SEPARATING FROM THE BODY OF THE VEHICLE. AT THAT TIME THE VEHICLE HAD 31K MILES. JIM HUDSON TOYOTA TRIED TO FIX IT. THE BUMPER IS HELD ON BY SMALL CLIPS THAT COME LOOSE WHILE DRIVING.  THEY SAID IT WAS A KNOWN DEFECT BUT NOT A RECALL AND THE DESIGN WAS CHANGED FOR THE 2019 MODEL, SO IT IS UNIQUE TO THE 2018 MODEL. TOYOTA GAVE THE DEALERSHIP 3 WAYS TO FIX THIS ISSUE. THEY WERE SUPPOSEDLY GOING TO REPLACE THE VEHICLE IF THE 3 FIXES DID NOT WORK.  WE TOOK THE VEHICLE IN A TOTAL OF 10 TIMES OVER THE COURSE OF OVER A YEAR. THEY TRIED ALL 3 OF THESE PLUS ANOTHER 5 WAYS TO TRY TO FIX; SOME DID NOT WORK, AND SOME WERE MERELY COSMETIC AND DID NOT HOLD DURING NORMAL DRIVING CONDITIONS. THE LAST 2 TIMES JIM HUDSON PAID A BODY SHOP TO FIX IT AS IF IT HAD BEEN IN AN ACCIDENT, WHICH IT HAS NOT.  WE ARE STUCK WITH A VEHICLE THAT HAS LOST VALUE DUE TO TOYOTA (DEFECT AS WELL AS HISTORY OF REPAIRS) AS WELL AS QUESTIONABLE SAFETY DUE TO THE BUMPER CONTINUOUSLY DETACHING..  ALL WE ASKED IS THAT THEY PURCHASE THE VEHICLE FROM US FOR WHAT WE OWE. WE FINANCED THROUGH TOYOTA. TOYOTA CORPORATE REFUSES TO DO ANYTHING FURTHER AFTER REVIEWING FOR 2 MONTHS. THEY CLAIM THAT BECAUSE IT TOOK THEM SO LONG TO WORK ON IT, THAT THEY ARE NO LONGER LIABLE SINCE THE VEHICLE NOW HAS MORE THAN 35,000 MILES ON IT A YEAR AFTER INITIATING THE PROCESS TO FIX IT, EVEN THOUGH IT DID NOT HAVE THAT MANY MILES ON IT WHEN THE PROCESS WAS STARTED.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "JTEBU5JR0J5"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/27/2020",
        "dateOfIncident": "09/19/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361360,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING WHEEL IS BEGINNING TO DELAMINATE WITH BLACK MATERIAL FLAKING OFF.  THIS ONLY SEEMS TO AFFECT THE TOP OF THE STEERING WHEEL AND NOT THE OTHER PARTS. IT IS UNCOMFORTABLE DRIVING WITH CONSTANT SMALL PARTS OF THE STEERING WHEEL COVER COMING OFF.",
        "vin": "JTEBU5JR8J5"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/15/2020",
        "dateOfIncident": "09/12/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355071,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MOONROOF GLASS SHATTERED RANDOMLY WHILE WAITING AT THE RED LIGHT.",
        "vin": "JTEBU5JR0J5"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/15/2020",
        "dateOfIncident": "09/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355143,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT REAR WINDOW POPPED WHILE MAKING A LEFT TURN",
        "vin": "JTEBU5JR1J5"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "07/20/2020",
        "dateOfIncident": "07/19/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340505,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "HUSBAND FELL ASLEEP AT THE WHEEL GOING 80MPH AND HIT A HUGE EXIT SIGN WHICH HIT THE ENTIRE FRONT BUMPER AS WELL AS THE  DRIVER SIDE PASSENGER DOOR AND NO AIRBAGS DEPLOYED.",
        "vin": "JTEBU5JR5J5"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/05/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307186,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY IPHONE 11 PRO MAX CONSTANTLY MAKES THE SYSTEM REBOOT (EVERY 30 SECONDS OR SO)  WHEN TRYING TO CONNECT TO THE HANDSFREE BLUETOOTH AUDIO AND PHONE  FEATURE OF THE VEHICLE. IT HAPPENS WHEN THE CAR IS PARKED AND IN MOTION, AND MAKES DRIVING MORE HAZARDOUS BY NOT ALLOWING US ANY HANDSFREE OPTION TO STAY WITHIN THE LAWS ON CELLULAR DEVICES NATIONWIDE.",
        "vin": "JTEZU5JR4J5"
    },
    {
        "components": "AIR BAGS,STRUCTURE,ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "01/04/2020",
        "dateOfIncident": "05/30/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297063,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TOTALED VEHICLE REPAIRED AFTER VEHICLE REPORTED TOTALED - VEHICLE NOT REPAIRED ADEQUATELY AND IS UNSAFE AS A RESULT OF A HIT AND RUN ACCIDENT. INCIDENT REPORTED TO POLICE - INSURANCE COMPANY, TOWING SERVICE, AND CONSUMER FRAUD BY NETWORK HACKING INSURANCE INFORMATION.",
        "vin": "JTEZU5JR9J5"
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/19/2019",
        "dateOfIncident": "09/25/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290114,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "IMPERFECTIONS IN GLASS (ALL WINDOWS) WHICH CAUSE VISIBILITY PROBLEMS IN THE DAYTIME AND NIGHTTIME DRIVING. I HAVE REPORTED THIS TO TOYOTA CUSTOMER SERVICE CENTER. A TOYOTA INSPECTOR HAS INSPECTED THE GLASS AND TOYOTA REFUSES TO CORRECT THIS PROBLEM. I HAVE HAD SEVERAL GLASS COMPANY'S AND AUTO DETAILERS LOOK AT THE GLASS AND THEY HAVE TOLD ME THAT IT IS A FACTORY DEFECT.",
        "vin": "JTEBU5JR1J5"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/16/2019",
        "dateOfIncident": "09/16/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268847,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA 4RUNNER. WHILE DRIVING DOWN A CURVY HILL AT 35 MPH, THE VEHICLE STARTED TO LOSE CONTROL. THE CONTACT FELT THAT THE VEHICLE WAS GOING TO ROLL OVER. THE CONTACT SLOWED DOWN THE VEHICLE TO APPROXIMATELY 15 MPH TO REGAIN CONTROL OF THE VEHICLE. THE VEHICLE PULLED TO THE LEFT WHILE DRIVING ON THE HIGHWAY AND THE CONTACT HAD TO COMPENSATE BY TURNING THE STEERING WHEEL TO THE RIGHT. IN ADDITION, THE FRONT END OF THE VEHICLE VIBRATED. THE VEHICLE WAS TOWED TO HONDA MARYSVILLE (640 COLEMANS CROSSING BLVD, MARYSVILLE, OH 43040, (937) 645-4080). THE DEALER LEFT A VOICE MESSAGE STATING THAT NO FAILURES WERE FOUND. THE CONTACT PLANNED TO CALL THE DEALER BACK. THE MANUFACTURER WAS NOT CONTACTED. THE CONTACT STATED THAT THE FAILURES HAD BEEN OCCURRING EVER SINCE THE VEHICLE WAS PURCHASED ON SEPTEMBER 16, 2019 AND WAS ALREADY REPAIRED THREE TIMES. THE FAILURE MILEAGE WAS 22,000.",
        "vin": "JTEBU5JR4J5"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/12/2019",
        "dateOfIncident": "08/08/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243303,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA 4RUNNER. WHILE DEPRESSING THE BRAKE PEDAL TO STOP THE VEHICLE, THE PEDAL TRAVELED TO THE FLOORBOARD AND THE VEHICLE DID NOT IMMEDIATELY STOP. THE DRIVER HAD TO PUMP THE BRAKE PEDAL MULTIPLE TIMES TO STOP THE VEHICLE; HOWEVER, THE STOPPING DISTANCE WAS EXTENDED. THE VEHICLE WAS TOWED TO BEAVER TOYOTA (2995 US 1 SOUTH ST, AUGUSTINE, FL) TO BE DIAGNOSED, BUT THE CAUSE OF THE FAILURE WAS NOT YET DETERMINED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 21,000.",
        "vin": "JTEBU5JR0J5"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/05/2019",
        "dateOfIncident": "06/05/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218087,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING 30MPH ON A CITY STREET SOUNDED LIKE A GUN GOING OFF AND MY SUN ROOF GLASS EXPLODED. NO CARS IN FRONT OR IN THE OTHER LANES BECAUSE THE LIGHT HAD TURNED RED .NO CONSTRUCTION SITES NEAR BY . GLASS WAS PUSHED OUT OR UP NOT IN LIKE SOMETHING CAME DOWN THROUGH IT.",
        "vin": "JTEBU5JR6J5"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/03/2019",
        "dateOfIncident": "04/23/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205442,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE FREEWAY WHEN I CAME UPON A DEER JUST STANDING THERE. I SWERVED TO AVOID HITTING IT AND HIT THE GUARDRAIL AT APPROX 60MPH.",
        "vin": "JTEBU5JR5J5"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/03/2019",
        "dateOfIncident": "04/23/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205444,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE FREEWAY AT 0540 WHEN I CAM UPON A DEER JUST STANDING IN THE MIDDLE OF THE FREEWAY. I SWERVED TO AVOID HITTING IT AND HIT THE GUARDRAIL AT AN 90 DEGREE ANGLE, WHERE THE FORCE WHIPPED THE BACK END OF MY CAR INTO THE GUARDRAIL AS WELL.",
        "vin": "JTEBU5JR5J5"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/03/2019",
        "dateOfIncident": "04/23/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205466,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE FREEWAY AT 0540 WHEN I CAME UPON A DEER STANDING IN THE MIDDLE OF IT. I SWERVED TO AVOID HITTING IT AND CRASHED INTO A GUARDRAIL AT AN 90 DEGREE ANGLE, AT HIGH SPEED, CAUSING ALMOST 14 THOUSAND IN DAMAGE.",
        "vin": "JTEBU5JR5J5"
    },
    {
        "components": "SEAT BELTS,SEATS",
        "crash": false,
        "dateComplaintFiled": "01/24/2019",
        "dateOfIncident": "01/07/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171839,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "NEW VEHICLE DISCOVERED TO HAVE RUSTING SEAT RAILS AND SEAT BELT ATTACHMENTS.  LOCAL TOYOTA SERVICE CENTER SAID THEY HAVE NEVER SEEN SUCH A PROBLEM ON A NEW VEHICLE AND RECOMMENDED IMMEDIATELY REPLACING ALL SEATS. HOWEVER, TOYOTA REGIONAL REPS AFTER ONLY DOING A VISUAL INSPECTION DECIDED THE RUST 'DOES NOT COMPROMISE THE SEATS INTEGRITY AT THIS TIME.'  THEY IGNORED THE RECOMMENDATION OF THEIR MECHANICS TO REPLACE. THEY ALSO REFUSED TO CLEAN AND SEAL.  THE REGIONAL REPS WILL NOT REPLACE UNTIL THE INTEGRITY IS COMPROMISED. THIS IS A WILLFUL SELECTION TO IGNORE THE SAFETY OF THE OCCUPANTS.  THANK YOU.",
        "vin": "JTEBU5JR0J5"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/17/2018",
        "dateOfIncident": "12/16/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161974,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WINDSHIELD IS CRACKING WITHOUT THE TEMPERATURES BEING SO HIGH. THE VEHICLE WAS PARKED BUT TURNED ON, WHEN WE TURNED ON THE HEAT AND DROVE IT FOR A LITTLE BIT (6 MILES) WE NOTICED THE WINDSHIELD CRACKING AND WE TURNED OFF THE HEAT. TEMPERATURE WAS AT 40 DEGREES THE LOWEST.",
        "vin": "JTEBU5JR9J5"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/10/2018",
        "dateOfIncident": "12/08/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11160523,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER DOOR OPENED WHILE DRIVING",
        "vin": "JTEBU6JR2J5"
    },
    {
        "components": "STEERING,WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/11/2018",
        "dateOfIncident": "05/26/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139597,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL VIBRATES BETWEEN 55-65 MPH. VEHICLE FEELS UNSTABLE UNTIL IT REACHES APROX 70 MPH. TAKEN TO DEALER 3 TIMES. THEY BALANCED THE FRONT WHEELS, BUT ISSUE RETURNS EVERYTIME, 2-3 WEEKS LATER. TOYOTA SAYS IT IS NORMAL. CANNOT BE NORMAL FOR A BRAND NEW CAR, WITH NEW TIRES. MULTIPLE OWNERS  REPORT ISSUE HAPPENING IN MULTIPLE WEBSITES",
        "vin": "JTEBU5JR8J5"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/03/2018",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11124154,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "HHHHH",
        "vin": "123456"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/14/2018",
        "dateOfIncident": "08/10/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119864,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RACK & PINION OR STEERING DOES NOT RETURN TO A \"HOME\" POSITION. SIMPLY PUT, IF YOU TURN AROUND A CORNER, THE STEERING WHEEL DOES NOT EASILY RETURN TO \"STRAIGHT\".  IF YOU ARE DRIVING DOWN A STRAIGHT PATH AND TURN THE STEERING EVEN ONE DEGREE, LET GO OF THE WHEEL, IT WILL CONTINUE THAT PATH UNTIL THE VEHICLE RUNS OFF OF THE ROAD. THIS CAR HAS 2100 MILES ON IT. THE DEALER HAS CHECKED THE CAMBER, THE TOW, THE NUMBERS ON THE ELECTRONIC ACTUATED RACK & PINON. THE SERVICE MANAGER DROVE THE CAR AND AGREED IT WAS NOT CORRECT; HOWEVER IT WAS \"IN THE LIMITS\" OF TOYOTA SPECIFICATIONS. HE SAID HE DROVE OTHER NEW VEHICLES AND THEY REACT THE SAME.  IF YOU DRIVE DOWN ANY STRAIGHT AWAY, YOU HAVE TO CONSTANTLY BE CORRECTING HOW THE CAR STEERS.  THERE IS NO HOME POSITION WHICH IS UNLIKE ANY VEHICLE I HAVE DRIVEN. I THINK AN ACCIDENT IS WAITING TO HAPPEN AND IT LOOKS LIKE TOYOTA IS NOT WILLING TO ADMIT THEY HAVE A PROBLEM.",
        "vin": "JTEBU5JR6J5"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/03/2018",
        "dateOfIncident": "06/28/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11105429,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SUN ROOF SHATTERED WITHOUT WARNING WHILE PARKED IN OUR DRIVEWAY AT HOME.    THE VEHICLE IS LESS THAN A YEAR OLD.",
        "vin": "JTEZU5JR6J5"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/23/2018",
        "dateOfIncident": "05/05/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097671,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING LEGALLY AT 70 MPH ON OHIO INTERSTATE, SHARP CROSS WINDS DURING A PERIOD OF AMBIENT WIND OF 23 MPH, CAUSED VEHICLE TO CROSS DIVIDING LINES IN AN UNSAFE MANNER.     VEHICLE IS KNOWN TO HAVE \"SOFT\" OR \"SLOPPY\" STEERING, WHICH IS \"CHARACTERISTIC\" OF THAT VEHICLE ACCORDING TO THE DEALER, AND UNDER NORMAL CIRCUMSTANCES DOES NOT AFFECT SAFETY. HOWEVER, IN THE WIND, THE REACTION TIME TO CORRECT FROM A CROSS WIND IS SUFFICIENTLY EFFECTED TO THE DETRIMENT OF SAFE HANDLING.    IN OTHER WORDS, BY THE TIME YOU REACT TO BEING FORCED OVER THE DIVIDING LINE OF TRAFFIC, ITS ALREADY TOO LATE, WHEREAS A NORMAL STEERING RATIO ON A PASSENGER VEHICLE WOULD ALLOW YOU TO CORRECT BEFORE BEING BLOWN FAR ENOUGH TO CROSS THE DIVIDING TRAFFIC LANE. THIS IS A VERY UNSAFE VEHICLE UNDER THOSE CIRCUMSTANCES AND SHOULD BE IMMEDIATELY RECALLED AND RE-ENGINEERED.",
        "vin": "JTEBU5JR3J5"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/23/2018",
        "dateOfIncident": "05/05/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11097675,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS CONSTANT TRANSMITTED ENGINE VIBRATION IN STEERING WHEEL. VIBRATIONS ARE CAUSING TINGLING, NUMBNESS AND JOINT PAIN. VIBRATIONS ARE WORSE WITH INCREASED ENGINE RPM. VIBRATIONS HAVE BEEN CONSTANT SINCE CAR WAS PURCHASED NEW IN APRIL, 2018. CAR HAS 2400 MILES ON IT CURRENTLY, 5/23/18.    LONG TRIP (900 MILES) WAS FIRST TIME THERE WAS TINGLING AND NUMBNESS WHICH WERE UNBEARABLE AT THE 450 MILE MARK AND THE RETURN TRIP WAS QUITE DISTRACTING AND UNCOMFORTABLE TO SAY THE LEAST. FOR 2 WEEKS AFTERWARDS, TINGLING AND NUMBNESS REMAINED.     NOW AFTER APPROX. 3 WEEKS, IT TAKES ABOUT 10 MINUTES OF DRIVING FOR THE TINGLING AND NUMBNESS TO RETURN NOW FEELING MILD JOINT PAIN AS WELL.     VEHICLE HAS BEEN BROUGHT IN FOR REPAIR 3 TIMES SO FAR FOR THIS CONDITION AND THE DEALER AND TOYOTA REFUSE TO ACKNOWLEDGE THE CONDITION! I HAVE ALREADY SCHEDULED THE 4TH. APPOINTMENT AT THE DEALER SO I CAN COMMENCE MY ARBITRATION/LEMON LAW CLAIM.    I PURCHASED A VIBRATION ANALYZER AND THE READINGS OFF THE STEERING WHEEL FAR EXCEED SAFE RECOMMENDED VIBRATION LEVELS ESTABLISHED BY N.I.O.S.H,/O.S.H.A. BY A FACTOR OF AT LEAST 3 TO 4 TIMES!    IF I KEEP DRIVING THIS VEHICLE IT WILL TURN INTO A PERSONAL INJURY LAWSUIT VS. A SIMPLE LEMON LAW CLAIM.",
        "vin": "JTEBU5JR3J5"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/15/2018",
        "dateOfIncident": "04/10/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11085111,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA \"ALL WEATHER FLOOR LINERS\" ARE COLLAPSING AT THE SIDES AND BECOMING A TRIPPING HAZARD. TOYOTA PART NUMBER PT908-89160-02. WITHIN WEEK OF BUYING NEW CAR, THE FLOOR LINER ON PASSENGER SIDE WAS COLLAPSING ON THE SIDES. REPORTED TO DEALER. HE CHECKED WITH TOYOTA REP AND WAS TOLD IT WAS NOT UNDER WARRANTY. WE CONTACTED THE SALES MANAGER AT DEALERSHIP, HE BOUGHT USE NEW MATS.  WITHIN SIX DAYS OF NEW MATS, THE SAME PROBLEM BEGAN AGAIN, SEE PICTURE.  SINCE TOYOTA HAS A HISTORY OF FLOOR MAT ISSUES, ONE WOULD THINK THIS WOULD BE A BE CONCERN TO THEM, APPARENTLY NOT.",
        "vin": "JTEBU5JR2J5"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/15/2018",
        "dateOfIncident": "02/28/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079564,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA 4RUNNER. WHILE DRIVING APPROXIMATELY 60 MPH, THE STEERING WHEEL STARTED TO VIBRATE AS THE VEHICLE PULLED TO THE RIGHT. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT COASTED THE VEHICLE OVER TO THE SIDE OF THE ROAD AND POWERED OFF THE ENGINE. THE VEHICLE WAS RESTARTED, BUT THE FAILURE RECURRED. THE VEHICLE WAS NOT TAKEN TO A DEALER OR INDEPENDENT MECHANIC TO DETERMINE THE CAUSE OF THE FAILURE. THE MANUFACTURER WAS NOT CONTACTED. THE APPROXIMATE FAILURE MILEAGE WAS 150.",
        "vin": "JTEBU5JR3J5"
    }
]