[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/29/2021",
        "dateOfIncident": "08/21/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430947,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "At approximately 42000 miles with no significant issues and no front end damages, the steering failed as I was driving at highway speed (70 mph) on a 2 lane road approaching a 90 degree curve. The power steering warning light and a separate triangle warning light appeared at the same time as I felt a pop and lost power and response in the steering wheel.  Thankfully, I have driven heavy power equipment in the past and was able to control the vehicle to the shoulder and there was no surrounding traffic. I was able to proceed to my residence at a slow speed on the road shoulder with no power steering and an almost unresponsive steering wheel. After being towed to the local dealer, it was determined the torque sensor failed and the entire steering column required replacement. I had no warning of this impending failure. The airbag recall was done on this vehicle by the dealer several weeks prior to this with no reports of an issue. It is unknown if the airbag recall service impacted this catastrophic failure. The dealership was in possession of the faulty part on 8/27/2021, when the repair was completed. I understand there were previous recalls on Avalons pre-2005 for this issue.",
        "vin": "4T1BK1EB1JU"
    },
    {
        "components": "ELECTRICAL SYSTEM,LANE DEPARTURE,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "06/24/2021",
        "dateOfIncident": "01/15/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422114,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "My car check engine light  lane sensor light and Lad light came on and card had rough handling i took it to Toyota of plano and they worked on charged me $650 so i was was happy they fixed the problem after one day the lights came back they said it was the rodent damage a Rat chewed the wire because what i learned toyota is using soy base wires it attracts Rats they should not use it it is a safety hazards now my safety feathers  don't work i can not afford $600 every other day so please recall this problem Thanks so many accidents can be avoided,",
        "vin": "4t1bk1eb7ju"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "05/09/2021",
        "dateOfIncident": "05/07/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415720,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PRE-COLLISION BRAKING SYSTEM DOES NOT APPEAR TO WORK.  SEVERAL TIMES WHEN CARS IN FRONT OF US HAVE SLAMMED ON THEIR BRAKES, THE PRE-COLLISION BRAKING SYSTEM DOES NOT RESPOND.  WE OWN A 2016 PRIUS WITH THE SAME FEATURE AND IT ALWAYS RESPONDS ' FLASHING A WARNING AND APPLYING THE BRAKES.  WE COMPLAINED TO THE DEALERSHIP MULTIPLE TIMES, AND THEY SAID THE SYSTEM IN OUR CAR PERFORMS A CHECK EVERY TIME WE TURN ON THE CAR AND SINCE IT DOES NOT INDICATE A FAULT, TO THEIR KNOWLEDGE THE SYSTEM IS WORKING FINE.  THEY SAID THERE ARE NO OTHER TESTS FOR THEM TO PERFORM.  I'VE ADJUSTED THE SYSTEM TO THE MOST SENSITIVE MODE (ACTIVE WHEN VEHICLE IN FRONT OF US IS FURTHER AWAY), BUT THIS HAS HAD NO EFFECT.  ALSO, THE ADAPTIVE CRUISE CONTROL WHICH USES THE SAME RADAR SYSTEM AS THE PRE-COLLISION BRAKING WORKS FINE.  THERE DEFINITELY IS SOMETHING WRONG WITH THE PRE-COLLISION BRAKING, AND I AM CONCERNED THAT THIS SAFETY FEATURE WILL NOT SAVE US FROM A COLLISION.  THE ONLY WAY SOMEONE WOULD BE AWARE THAT THE SYSTEM ISN'T WORKING IS TO EXPERIENCE A NEAR COLLISION.  I BELIEVE THE PRE-COLLISION BRAKING SYSTEM COULD BE TESTED WITHOUT DAMAGING OUR CAR BY PLACING A LARGE STATIONARY INFLATABLE OBJECT IN FRONT OF OUR MOVING CAR.  I WOULD BE GLAD TO PROVIDE OUR CAR FOR YOU TO PERFORM SUCH A TEST OR ANOTHER TEST THAT YOU MAY HAVE DEVELOPED.  THIS MAY BE A PROBLEM WITH MANY OTHER TOYOTA AVALONS AND OTHER CARS.",
        "vin": "4T1BD1EB1JU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/27/2021",
        "dateOfIncident": "03/20/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405151,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN HAVING TROUBLE WITH MY RADIO HANGING UP PHONE CALLS AND SEVERAL OTHER THINGS.  AFTER TAKING MY CAR SEVERAL TIME I WAS TOLD IT WILL BE REPLACED.  I TOOK MY CAR AND LEFT IT OVER NIGHT  MARCH 18TH AND MARCH 19TH.  IT HAD A CHARGING LIGHT ON SO THEY SAID IT'S BEST IF IT SAYS OVER NIGHT.  WHEN CONTACTED THE SATELLITE RADIO COMPANY TO GIVE THE NEW RADIO ID, THE SAID IT WAS THE ID.  I CALLED APPLE TO SEE IF THERE WERE ANY ISSUES WITH MY IPHONE, THERE WAS NONE AND WE EVEN WENT THROUGH RESETTING THE PHONE, JUST IN CASE CASE THE RADIO WAS STILL DROPPING CALLS AND OTHER THINGS.  I HAVE A CASE WITH TOYOTA CUSTOMER SERVICE #2103032049.  I CONTACTED THEM AND THE DEALERSHIP THE MONDAY AFTERWARDS MARCH 22, I STILL WAS UNABLE TO GET ANY ANSWERS.  I HAVE NO PROOF THE RADIO WAS REPLACED, NO ONE FROM TOYOTA OR THE DEALERSHIP, WHICH IS MIKE CALVERT TOYOTA 713-558-8100",
        "vin": "4T1BK1EB7JU"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/20/2020",
        "dateOfIncident": "11/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375620,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AUTO HIGH BEAMS DAILY FAIL TO WORK CORRECTLY DURING NIGHT TIME DRIVING,  THE LOW BEAM WOULD BE ON, THE TURN SIGNAL CONTROL LEVER WILL BE PUSHED ALL THE WAY FORWARD. THE GREEN LIGHT ON THE DASH PANEL IS SHOWING A HEADLIGHT WITH A WORD \"AUTO\" WOULD ILLUMINATE AND THE HIGH BEAMS WOULD CYCLE ON & OFF AS THEY SHOULD WITH THE AUTO HIGH BEAM SYSTEM. THEN THE GREEN \"AUTO\" LIGHT WOULD MYSTERIOUSLY GO OFF AND THE HIGH BEAMS WOULD NOT TURN ON ANYMORE EVEN UNDER THE RIGHT CONDITIONS - THIS WOULD LAST FROM THIRTY SECONDS TO ABOUT FIVE MINUTES..THEN THE AUTO HIGH BEAM SYSTEM MYSTERIOUSLY COMES BACK ON AND ALL WORKING CORRECTLY AGAIN.  THIS IS ONLY ON NIGHT TIME DRIVING WHEN THE AUTO HIGH BEAM SYSTEM IS TURNED ON WITH THE GREEN AUTO INDICATOR. THIS IS WHEN THE VEHICLE IS IN MOTION AND MOSTLY ON DARKER / RURAL ROADS WHERE HIGH BEAMS ARE DESIRED. THIS PROBLEM IS WITH THOUSANDS OF TOYOTAS..AND LEXUS ES ALL MODELS AND THE LAST FIVE MODEL YEARS. DEALERS TURN A BLIND EYE TO IT... ALTHOUGH IT IS OFTEN A VERY INTERMITTENT PROBLEM. TOYOTA DEALERS WILL NOT ACKNOWLEDGE IT... LOOK IN ALL THE TOYOTA ONLINE AUTOMOTIVE FORUMS... IT'S OUT THERE...THIS HAPPENS EVERY AND ANY EVENING WE DRIVE THE CAR AT NIGHT. VERY ANNOYING FOR SURE.",
        "vin": "4T1BD1EBXJU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/22/2020",
        "dateOfIncident": "08/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350749,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2018 TOYOTA AVALON THAT IS SUBJECT TO RECALL FOR A POTENTIALLY DEFECTIVE FUEL PUMP. I TOOK THE CAR IN 8/3/2020 TO FIX THE PROBLEM. I WAS ADVISED THE DEALER DID NOT HAVE THE CORRECT FUEL PUMP IN PARTS AND THAT IT WILL BE LATE SEPT. OR OCT. BEFORE THEY HAVE THE CORRECT FUEL PUMP. IN THE INTERIM, I HAVE A VEHICLE WITH A POTENTIAL SAFETY ISSUE.",
        "vin": "4T1BK1EB6JU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/27/2020",
        "dateOfIncident": "05/05/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341599,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECKING ON THE STATUS OF THE FUEL PUMP RECALL?? WAS SUPPOSED TO GET A NOTICE BY MAY BUT HAVE NOT RECEIVED THE NOTICE YET. I ENTERED THE 17 DIGIT VIN NUMEBER IN YOUR FORM BUT GOT NO RESPONSE.",
        "vin": "4T1BK1EB9JU"
    },
    {
        "components": "STEERING,AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "05/08/2020",
        "dateOfIncident": "01/26/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11323844,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA AVALON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V024000 (AIR BAGS) HOWEVER, THE PART FOR THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 40 MPH WHEN ANOTHER CUT IN FRONT OF THEM AND IN ORDER TO AVOID HITTING THE OTHER VEHICLE THE CONTACT VEERED TO THE LEFT, THE CONTACT ENDED UP CRASHING INTO A SIDE BARRIER ON THE SIDE OF THE ROAD. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS FILED. THE CONTACT RECEIVED INJURIES TO HIS LEFT ARM, LEG AND CHEST/TORSO AREA MEDICAL ATTENTION WAS NEEDED. THE VEHICLE WAS TOWED. THE CONTACT CONTACTED THE UNKNOWN DEALERSHIP WHO DIAGNOSED THAT THE LEFT SIDE OF THE VEHICLE, STEERING, AND BRAKING NEEDED TO BE REPAIRED. THE VEHICLE HAD RECEIVED REPAIRS TO THE BODY, STEERING, AND BRAKES OF THE VEHICLE. THE CONTACT STATED THAT THE VEHICLE WAS STILL DIFFICULT TO STEER AND THERE WAS A RUMBLING COMING FROM UNDERNEATH THE VEHICLE WHENEVER DRIVING OR BRAKING THE VEHICLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUES, HOWEVER, THERE WAS NO RESOLVE PROVIDED. THE APPROXIMATE FAILURE MILEAGE WAS 10,000.  VIN TOOL CONFIRMS REMEDY NOT YET AVAILABLE.",
        "vin": "4T1BD1EB1JU"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/24/2020",
        "dateOfIncident": "01/24/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301611,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2018 TOYOTA AVALON. THE CONTACT BECAME AWARE THAT THE VEHICLE WAS SUBJECTED TO NHTSA CAMPAIGN NUMBER: 20V024000 (AIR BAGS) AFTER A VIN SEARCH WAS PERFORMED ONLINE. THE CONTACT SPOKE WITH NHTSA HOTLINE AND WAS INFORMED THAT THE PART FOR THE RECALL REPAIR WAS NOT YET AVAILABLE. A DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS NOT CONTACTED NOR MADE AWARE OF THE ISSUE.  THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "4T1BK1EB7JU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/26/2019",
        "dateOfIncident": "10/23/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271236,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING ON THE INTERSTATE SPEED BETWEEN 60-70 MPH THE CAR SUDDENLY JERKS TO THE RIGHT. I HAD THE CAR CHECKED BECAUSE IT FELT SCARY (AS IF I WOULD HIT THE CAR IN THE NEXT LANE)  I HAD THE PROBLEM CHECKED THROUGH A REPUTABLE SERVICE CENTER- THE TORQUE STEERING WAS OFF; CAR JERKED WITH ACCELERATION",
        "vin": "4T1BK1EB5JU"
    },
    {
        "components": "STEERING,POWER TRAIN,WHEELS",
        "crash": true,
        "dateComplaintFiled": "09/06/2019",
        "dateOfIncident": "08/21/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253690,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING ON I-294 SOUTH IN THE VICINITY OF, SOUTH HIGHLAND, ILLINOIS TRAVELING ABOUT 70 MILES PER HOUR.  I WAS NEXT TO THE MEDIAN.  THERE WAS A CAR NEXT TO ME THAT WAS BEHIND AN 18 WHEELER, PULLING AN EXTRA TRAILER.  THE 18 WHEELER SWERVED TO MISS A CAR AND AS A RESULT OF THE 18 WHEELER SWERVING, THE CAR NEXT TO ME SWERVED TO MISS THE TRAILER; WHEN THAT HAPPENED I SWERVED TO MY LEFT BECAUSE OF THE VEHICLE.  AS I DID SO MY VEHICLE MADE CONTACT WITH THE EMERGENCY STRIP THAT MAKES A NOSE LIKE YOUR TIRES ARE FLAT, ALMOST INSTANTLY IT APPEARED THAT I WAS PULLED INTO THE WALL MEDIAN.  THERE WAS NO WAY THAT I COULD HAVE CORRECTED THAT WITH ALL THE STRENGTH THAT I WAS PUTTING INTO GETTING MY VEHICLE BACK IN THE LANE.",
        "vin": "4T1BK1EB0JU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/06/2019",
        "dateOfIncident": "09/26/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11242028,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA AVALON. THE CONTACT STATED THAT WHILE WAITING AT A TRAFFIC LIGHT, A VEHICLE TRAVELING AT HIGH SPEEDS CRASHED INTO THE VEHICLES FRONT PASSENGER SIDE. NONE OF THE FRONTAL AIR BAGS DEPLOYED. THE POLICE WAS PRESENT AND A REPORT WAS ISSUED. THE PASSENGER WAS TAKEN TO THE HOSPITAL BY AMBULANCE, TREATED AND RELEASED THE FOLLOWING DAY. THE VEHICLE WAS DRIVEN TO THE DEALER JIM NORTON TOYOTA OF OKC, 8401 NORTHWEST EXPRESSWAY, OKLAHOMA CITY, OK 73162, THEY COULD NOT DETERMINED WHY THE AIR BAGS DID NOT DEPLOY. A THIRD PARTY COMPANY SENT BY THE MANUFACTURER CAME TO EVALUATE THE VEHICLE AND THEY WERE NOT ABLE TO DETERMINE WHY THE AIR BAGS DID NOT DEPLOY AND THE CLAIM WAS DECLINED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 9,300.",
        "vin": "4T1BK1EB8JU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/17/2019",
        "dateOfIncident": "07/17/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11233352,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 TOYOTA AVALON. CONSUMER WRITES IN REGARDS TO AIR BAGS THAT DID NOT DEPLOY DURING AUTO ACCIDENT. *LD  *JS",
        "vin": "4T1BK1EB8JU"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/13/2019",
        "dateOfIncident": "01/02/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219860,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "IN DYNAMIC RADAR CRUISE CONTROL, THE CAR DOES NOT ACT AS DESCRIBED ON PAGE 237 OF THE OWNERS MANUAL.  THE MANUAL STATES EVEN WITHOUT CANCELING THE CRUISE CONTROL, THE SET SPEED CAN BE INCREASED BY FIRST ACCELERATING THE VEHICLE TO THE DESIRED SPEED AND THEN PUSHING THELEVER DOWN TO SET THE NEW SPEED.\"  WHEN I TRY TO DO THIS THE VEHICLE WILL QUICKLY SLOW DOWN TO 1 MPH BELOW THE PREVIOUS SET SPEED.  SOMETIMES, THE BRAKES ARE APPLIED TO BRING THE CAR DOWN TO THAT SPEED.  THIS COULD BE UNSAFE, ESPECIALLY ON WET PAVEMENT.  TOYOTA SAY THE CAR ACTS AS INTENDED.",
        "vin": "4T1BK1EB6JU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/14/2019",
        "dateOfIncident": "04/23/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207521,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BACK UP CAMERA DISPLAY CLEARLY SHOWS THE  REAR LICENSE PLATE. VEHICLE PURCHASED MAY 25, 2018. THE CAMERA AND DISPLAY WORKED FINE UNTIL 4/23/2019, DID NOT SHOW THE REAR LICENSE PLATE.  BILL WRIGHT SERVICE OF BAKERSFIELD, CA STATED THAT THIS WAS 'NORMAL' AND REFUSED TO CONSIDER ANY RE-DO OR REPAIRS.  CALLED TOYOTA FACTORY SERVICE (COURTNEY) AT 1-800-331-4331 AND SHE STATED THAT SHE WAS UNAWARE OF THE PROBLEM AND HAD NO SOLUTIONS FOR ME.  CONTACTED CALIFORNIA BUREAU OF AUTO REPAIR (BAR), THEY INVESTIGATED THE PROBLEM AND ONLY WANTED TO CHECK INSTALLATION MEASUREMENTS.  I FIRMLY BELIEVE THAT THE INSTALLATION OF THE CAMERA IS OK BUT BELIEVE  THAT THE CAMERA LENS NOW SHOWS A DISTORTED VIEW I HAVE TWO PHOTOS THAT I WILL TRY TO ATTACH WHICH WILL ILLUSTRATE WHAT I BELIEVE IS THE PROBLEM.  I BELIEVE THAT MUCH USE OF CLOSING THE TRUNK HAS CAUSED THE CAMERA LENS TO SHIFT DOWNWARD. NOT A VERY GOOD SAFETY DEVICE AS PER PL 110-189 2/28/2008 CONTACTED THE BILL'S SPONSOR, (XXXX), BUT SHE WAS NOT INTERESTED IN PURSUING THIS PROBLEM.  ONE PICTURE I HAVE IS A LATE MODEL TOYOTA COROLLA WITH NO EVIDENCE OF A REAR LICENSE PLATE, AND THE OTHER IS MY VEHICLE CAMERA VIEW CLEARLY SHOWING THE REAR LICENSE PLATE.    PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "4T1BK1EB8JU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/01/2018",
        "dateOfIncident": "04/29/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132427,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PRE-COLLISION DETECTION SYSTEM DOES NOT OPERATE. DEALERSHIP MIKE ERDMAN TOYOTA OR TOYOTA HEADQUARTERS IN TEXAS WILL PUT IN WRITING THAT THE SYSTEM WORKS NOR WILL THEY DO AN ACTUAL TEST TO PROVE THAT IT IS OPERATIONAL.  ALL THEY WILL SAY IS THAT THE COMPUTER ANALYSIS SAYS IT SHOULD BE WORKING.  IT DOES NOT WORK AND WILL NOT STOP THE CAR IN ANY CIRCUMSTANCES OR WARN YOU OF A POTENTIAL DANGER!!!!!",
        "vin": "4T1BK1EB5JU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/22/2018",
        "dateOfIncident": "03/09/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121781,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "A. DAY DRIVING IMPAIRED VISIBILITY-REAR WINDSHIELD:    A REAR WINDSHIELD VISIBILITY PROBLEM EXISTS WITH THE 2018 TOYOTA AVALON ON SUNNY DAYS.. THE COMBINATION OF THE STEEP ANGLE OF THE REAR WINDSHIELD AND THE LIGHT INTERIOR ON THE BACK DECK BEHIND THE REAR SEATS CREATES A GLARE ONTO THE REAR WINDSHIELD. THE GLARE IS  THE REFLECTION OF THE REAR DECK PANEL ONTO THE ENTIRE REAR WINDSHIELD. IT IS A DISTRACTION TO THE DRIVER BECAUSE IT IS DIFFICULT TO SEE CLEARLY CARS APPROACHING FROM BEHIND THROUGH THE REAR VIEW MIRROR. INSTEAD OF LOOKING THROUGH THE REAR WINDOW, THE DRIVER LOOKS AT THE REAR WINDOW WHICH CAUSES MORE DISTRACTION. THIS LACK OF CLEAR VISIBILITY CAN POTENTIALLY CAUSE AN ACCIDENT. TOYOTA HAS HAD THIS PROBLEM SINCE 2013 (NHTSA 10505067) AND SHOULD HAVE SOLVED IT.   PHOTO IMAGE 5288 CLEARLY SHOWS THE REDUCTION IN VISIBILITY CAUSED BY THE GLARE WHICH APPEARS AS A HAZE ACROSS THE ENTIRE REAR WINDSHIELD. PHOTO IMAGE 5289,  PROBLEM MITIGATED BY USING A DARKER INTERIOR (FOR CONTRAST, BLACK TOWEL ON LEFT SIDE) ON THE BACK DECK.    B. NIGHT DRIVING IMPAIRED VISIBILITY-REAR WINDSHIELD                  HEADLIGHTS OF APPROACHING CARS FROM BEHIND SHINE THOUGH THE REAR WINDSHIELD, AND CREATE VERTICAL COLUMNS OF DASHED LINES AS SHOWN IN PHOTO BW1, WITH WINDOW FILM. THESE LINES ARE SPACED IN PROPORTION TO THE DISTANCE BETWEEN THE HEATER STRIPS IN THE REAR WINDSHIELD.  AND OBSTRUCTS THE DRIVERS VIEW. WITHOUT WINDOW FILM, THIS NIGHT EFFECT IS STILL NOT ELIMINATED AS SHOWN IN PHOTO BW2.     TOYOTA HAS BUILT THIS AVALON FROM 2013 THROUGH 2018, AND   SHOULD HAVE FIXED THESE DESIGN FLAWS; (1) THE DAYTIME GLARE ON THE REAR WINDSHIELD ON SUNNY DAYS, AND (2) THE NIGHT TIME VERTICAL COLUMN OF DASHES CREATED BY CAR'S HEADLIGHTS SHINING THROUGH THE HEATER STRIPS ON THE REAR WINDSHIELD.  A CLAIM HAS BEEN FILED  WITH TOYOTA BY THE DEALER, BUT TOYOTA HASN'T GOTTEN BACK TO ME.",
        "vin": "4T1BK1EB8JU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/16/2018",
        "dateOfIncident": "06/25/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111801,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA IN THEIR ADS SHOW THE AVALON TO STOP BY ITSELF  IN FRONT OF OBSTACLES AND PEOPLE. MY TEST SHOWS THIS NOT TO BE THE CASE WITH MY CAR. TOYOTA  ADVISED TO HAVE THE CAR CHECKED AND THIS WAS DONE. THE LOCAL TOYOTA DEALER PRONOUNCED THE CAR UP TO FACTORY STANDARDS.  . PLEASE WATCH THIS YOUTUBE VIDEO :  HTTPS://YOUTU.BE/XETNKNYB17W",
        "vin": "4T1BD1EBXJU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/28/2018",
        "dateOfIncident": "01/04/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065477,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LANE DEPARTURE BEEPING SIGNAL IS SO WEAK THAT I CAN HARDLY HEAR IT.  NORMAL DRIVING NOISE SUCH AS  TIRE NOISE, RADIO, CONVERSATION, ETC. USUALLY COMPLETELY DRIVES IT OUT.  ON THE BUICK THAT I TRADED IN THE LDA SOUND WAS NORMAL AND ON A NUMBER OF OCCASIONS I DOZED OFF AND WAS SNAPPED OUT OF IT BY THE BEEPING FROM THE LDA.  I AM DISMAYED THAT THIS VERY IMPORTANT SAFETY FEATURE IS ALL BUT USELESS IN MY NEW TOYOTA.  A FRIEND JUST BOUGHT A NEW PRIUS AND HIS VEHICLE HAS THE SAME WEAK LDA VOLUME AS MINE.  I LOOKED ON THE INTERNET AND SAW COMPLAINTS ABOUT THE SAME PROBLEM.  THIS IS APPARENTLY A PROBLEM ON ALL LATE MODEL TOYOTAS.    I HAD THIS PROBLEM ON INTERSTATE, OTHER HIGHWAYS AND CITY DRIVING",
        "vin": "4T1BD1EB4JU"
    }
]