[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/20/2021",
        "dateOfIncident": "06/20/2021",
        "fire": false,
        "manufacturer": "Thor Motor Coach",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441127,
        "products": [
            {
                "manufacturer": "Thor Motor Coach",
                "productMake": "THOR MOTOR COACH",
                "productModel": "TUSCANY",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "On Sunday afternoon 20 June while traveling westbound on I-10 about 50 miles east of Ft. Stockton, TX, the passenger side rear slideout extended on its own.  This slideout is about 2 feet deep so the width of my motor home suddenly changed from 8.5 feet wide to 10.5 feet wide.  Fortunately there was little traffic on I-10 at this time.  I was able to pull to the shoulder and used wood blocks in an effort to keep the slideout from extending.  These blocks held until reaching Ft. Stockton where we were able to get off I-10 and into the first campground we came to.  By this time the slideout had extended on its own again.  I was able to get a truck mechanic to use cargo straps to strap this slideout in place so it would not extend and returned home to Alabama.    My RV mechanic had found that both Lippert slideout cylinders had gone into bypass allowing the slideout to extend on its own.   By this time the opposite slideout was giving me the same problem and one of its cylinders was found to have gone into bypass.  This drivers side slideout gave me the same problem on I-25 southbound about 100 miles north of Denver last summer.  A Lippert slideout cylinder was again found to have gone into the bypass mode.  And fortunately for me again there was little traffic on this section of I-25.    My RV has three slideouts and each slideout is controlled by two Lippert slideout cylinders.  In the past two years I've now had three Lippert slideout cylinders fail by going into bypass and allowing two slideouts to extend while traveling on interstate highways.  Fortunately, I was traveling in areas with little traffic, but the outcome could have been tragic if I was traveling I-10 through Houston or I-25 through Denver.   I've included pictures of these three Lippert slideout cylinders with the part number data tags clearly shown.    My recommendation is for an immediate investigation to get this suspect lot of Lippert slideout cylinders off the highway.",
        "vin": "4UZFCHCY6HC"
    },
    {
        "components": "WHEELS,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/24/2021",
        "dateOfIncident": "07/24/2021",
        "fire": false,
        "manufacturer": "Thor Motor Coach",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437965,
        "products": [
            {
                "manufacturer": "Thor Motor Coach",
                "productMake": "THOR MOTOR COACH",
                "productModel": "TUSCANY",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Right tag axle hub cap broke lose from the bracket securing the hub cap to the hub and departed the motorhome chassis.  Incident occurred while traveling east on I-10 in Texas somewhere between San Antonio and Weimer.  The hub cap bracket separated at the feet of the bracket. The feet of the bracket where still attached to the hub.  Picture attached.   The feet are available for further inspection.   There were no warnings/symptoms when the incident occurred.  Exactly when the event occurred is unknown.  The hub cap assembly weighs approximately one pound.  It could have struck a trailing vehicle causing significant damage, and a very real safety concern.   I (driver/owner of the vehicle) was the only person to inspect the broken bracket.",
        "vin": "4UZFCHCY6HC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/16/2020",
        "dateOfIncident": "09/23/2019",
        "fire": false,
        "manufacturer": "Thor Motor Coach",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329230,
        "products": [
            {
                "manufacturer": "Thor Motor Coach",
                "productMake": "THOR MOTOR COACH",
                "productModel": "TUSCANY",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "FLOORS IN THE UNDERSIDE PASS-THROUGH STORAGE COMPARTMENTS AND COMPARTMENTS HOLDING THE WATER TANKS IS COMPOSED OF A VERY THIN LAYER OF PLYWOOD SANDWICHED BETWEEN TWO LAYERS OF VERY THIN ALUMINUM. THIS MATERIAL IS NOT WATERPROOF AND HAS DELAMINATED, CAUSING THE FLOORING TO LOSE ITS RIGIDITY. THIS AREA IS NORMALLY USED TO STORE ITEMS LIKE GRILLS, CHAIRS, CARPETS AND OTHER NECESSARY ITEMS WHILE TRAVELING. IT IS ALSO THE ONLY FLOORING UNDER THE WATER TANKS. AS THE FLOORING WEAKENS AND FAILS, THESE ITEMS COULD POSSIBLY FALL THROUGH ONTO THE HIGHWAY, CAUSING HAZARDOUS CONDITIONS FOR THE COACH AND OTHER VEHICLES TRAVELING ON THE HIGHWAY.     IN TALKING WITH THE PREVIOUS OWNER, HE STATED THAT HE DISCOVERED THIS SAFETY ISSUE JUST A MONTH OR SO AFTER PURCHASING THE COACH. THOR HAD REFUSED TO REPLACE THE FLOORING. AFTER NUMEROUS REQUESTS FOR REPAIRS, HE HAD RETURNED THE RV TO CAMPING WORLD FOR FAILURE OF BAY FLOORING (AMONG OTHER ISSUES). WE WERE NOT INFORMED OF THIS ISSUE WHEN WE PURCHASED THE COACH BUT DISCOVERED IT AFTER PURCHASING IT. DURING THE REPAIRS, OUR TECHNICIAN DISCOVERED EVIDENCE OF PREVIOUS ATTEMPTED REPAIRS TO OTHER COMPARTMENTS. HE ALSO NOTED THAT THE FLOORING BENEATH THE HOT WATER BAY IS ALREADY SHOWING EVIDENCE OF DELAMINATION.  *TR",
        "vin": "4UZFCHCY4HC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/20/2020",
        "dateOfIncident": "02/27/2019",
        "fire": false,
        "manufacturer": "Thor Motor Coach",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325290,
        "products": [
            {
                "manufacturer": "Thor Motor Coach",
                "productMake": "THOR MOTOR COACH",
                "productModel": "TUSCANY",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FLOORING IN THE UNDERSIDE PASS-THROUGH STORAGE COMPARTMENTS IS COMPOSED OF A VERY THIN LAYER OF PLYWOOD SANDWICHED BETWEEN TWO LAYERS OF A VERY THIN ALUMINUM. THIS MATERIAL IS NOT WATERPROOF AND HAS SEPARATED CAUSING THE FLOORING TO LOOSE IT'S  RIGIDITY. THIS AREA IS NORMALLY USED TO STORE ITEMS LIKE GRILLS, CARPETS TENTS AND OTHER NECESSITIES WHILE TRAVELING. THESE ITEMS HAS THE FLOOR WEAKENS COULD POSSIBLY FALL THROUGH ON TO THE HIGHWAY CAUSING HAZARDOUS CONDITION FOR THE COACH AND OTHER VEHICLES TRAVELING ON THE HIGHWAY.   THIS ISSUE WAS DISCOVERED IN MY COACH A FEW MONTHS AFTER PURCHASED  BEFORE ANY THING LIKE HAS OCCURRED. FROM THE INFORMATION I AM HEARING FROM OTHER OWNERS THIS IS A, WIDE SPREAD ISSUE WITH THIS COACH MANUFACTURER, SOME THEY HAVE AGREED TO REPLACE AND OTHERS THEY HAVE REFUSED.  MY COACH IS SET TO GO BACK TO THE FACTORY REPAIR CENTER FOR NOW THE THIRD TIME FOR REPAIRS WITH THIS BEING ONE AND THEIR RESPONSE TO ME IS IT WILL BE REPAIRED OR REPLACED TO INDUSTRY STANDARDS.  IF INDUSTRY STANDARDS ALLOWS THEM TO USE THE SAME MATERIAL THIS IS GOING TO CONTINUE TO HAPPEN AGAIN AND AGAIN UNTIL A CHANGE IS MADE.  *TR",
        "vin": "4UZACHCY3HC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/30/2017",
        "dateOfIncident": "04/30/2017",
        "fire": false,
        "manufacturer": "Thor Motor Coach",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10981508,
        "products": [
            {
                "manufacturer": "Thor Motor Coach",
                "productMake": "THOR MOTOR COACH",
                "productModel": "TUSCANY",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "IN THE THOR MOTOR COACH TUSCANY 38SQ THE BATTERIES ARE STORED IN A BOX THAT IS ONLY ACCESSIBLE FROM WITHIN THE MOTORHOME.  IT IS IN THE SLEEPING AREA.  GASES FROM THE BATTERIES THAT ARE NOT SEALED CAN ESCAPE TO THE INTERIOR OF THE SLEEPING AREA AND ARE A SAFETY HAZARD FOR THE OCCUPANTS.",
        "vin": ""
    }
]