[
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/01/2022",
        "dateOfIncident": "02/28/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11454705,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "My daughter was in an accident on 2/28/2022 at  20 plus miles and hour. It was a front end collision where the air bags did not deploy.",
        "vin": "2t1burhexjc"
    },
    {
        "components": "POWER TRAIN,FUEL/PROPULSION SYSTEM,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/08/2022",
        "dateOfIncident": "01/31/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450905,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Had a recall on the fuel system causing the system to potentially stall the vehicle.  Had the car service but still when doing cruise control its still doing the same thing by reving the engine to high on RPM to potentially stall the vehicle. Potential safety problem",
        "vin": "5YFBURHE5JP"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "01/06/2022",
        "dateOfIncident": "12/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446498,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving the car started to sputter like it was going to die. When I stopped to gas the next day a gush of air came out of the gas tank when I took the cap off. I put gas in and then my car wouldn’t start. For 3 hours I tried and finally it started. Now I can have in park and it revs clear to the 5 sometimes then it starts sputtering. Every time I put gas in I have to sit for 3 hours then it starts. The trac off light on the dash is on as well so nothing works the lane control, cruise control, the emergency brake system.",
        "vin": "5yfburhe2jp"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/31/2021",
        "dateOfIncident": "12/31/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445768,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving at 55 mph, cruise control engaged, the vehicle suddenly lost power, the cruise control disengaged, the engine light came on and the traction control disengaged warning was displayed. The vehicle continued operating. After engine fault code stated there was a Mass Airflow Sensor fault. Owner replaced the sensor. Two weeks later, the situation repeated, this time the fault read as an oxygen sensor error. After a day or two, the fault would clear, only to repeat a week or two later. Then, on Dec. 31, the vehicle completely stalled at highway speeds. It would restart, but if the rpms exceeded 2,500 it would stall again. Trying to get an appointment with the dealership, but will have to wait until after the New Year for them to open again.",
        "vin": "2T1BURHE8JC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/16/2021",
        "dateOfIncident": "12/15/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443984,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The driver door will no longer open from the inside. As a driver door this door does not have child safety lock nor should it have one. This makes exiting the car very difficult under normal situations and prevents exiting the car in the event of an emergency. I had a mechanic dissemble the door and the mechanic discovered that the door handle mechanism had failed internally so that the interior door handle was no longer connected internally to the door opening mechanism. The only way to exit the vehicle is to either crawl to another door or to roll down the windows (which requires electric power to be available). This problem occurred suddenly without any warning.",
        "vin": "2t1burhe4jc"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/30/2021",
        "dateOfIncident": "09/29/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434967,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "UNKNOWN BRAKE FAILURE AFTER SLOW SPEED STOP (LOCK UP)",
        "vin": "2T1BURHE2JC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/31/2021",
        "dateOfIncident": "08/27/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431254,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Toyota Corolla. The contact stated while coming out of a complete stop, the vehicle stalled. The vehicle was able to be restarted and functionality was regained. The contact stated that the check engine warning lights were illuminated. Upon investigation, the contact associated the failure with, NHTSA Campaign Number: 20V012000 (Fuel System, Gasoline). The vehicle was repaired but continued to experience failure. The vehicle was taken to a local dealer but was not diagnosed or repaired. The manufacturer was informed of the failure and the contact was awaiting a response. The failure mileage was approximately 76,000. Consumer stated engine light and \"Traction Control Turned Off\" warning while vehicle was still moving, then \"Charging System Malfunction\" and \"Oil Pressure Low/Stop in a Safe Place\" warning lights appeared at the same time the vehicle stalled.",
        "vin": "2T1BURHE8JC"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "07/01/2021",
        "dateOfIncident": "06/30/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423130,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 Toyota Corolla - Front drivers seat is making clicking noises while driving. I believe seat is not properly secured and may be unsafe to drive. Car was under the Manufactures warranty when taken into Bill Kidds Toyota for service. Service manager was able to duplicate clicking noise while test driving car. Bill Kidds Toyota refuse to investigate any further. I went on-line and found similar complaints to my vehicles problem. One person stated the problem is with the seat track not being secured properly. I reached out to Toyota Motors to file a formal complaint, and they referred me back to the dealership. Dealership is refusing service. I think this may not be an isolated issue with the 2018 Corolla. I would like Toyota to further investigate and force dealership to properly inspect my seat which was under warranty at time of original complaint. Thank You.",
        "vin": "2T1BURHE2JC"
    },
    {
        "components": "AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/01/2021",
        "dateOfIncident": "07/13/2020",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11398510,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAD EARLY SIGNS OF PROBLEMS WITHIN ONLY THE SECOND YEAR. IT HAD STOPPED TWO TIMES. IF THIS CAR STOPS BEFORE THE 18,000 OR LEMON LAW RETURN IT. I THEN WAS NOTIFIED THAT IT HAD 3 RECALLS. MY CAR WAS ACTUALLY STILL DRIVEABLE. I ALSO WANT TO DISCLOSE THAT I DEALL WITH ENVIROMENTAL ALLERGIES. I HAD THE VEHICLE FIXED SEVERAL TIMES WITH NO PROBLEM. HOWEVER, AFTER THE RECALLS WERE FIXED WITH THE FUEL PUMP AND AIR BAG I STARTED TO BECOME EXTREMLY ILL . I EVER PURCHASED A VOC MONITOR AND WAS ABLET TO DETECT GAS AT DANGEROUS LEVELS. MY DEALER TOYOTA BOWIE  AND THE MANUFACTURER DID LITTLE TO NOTHING TO ACCOMODATE ME. I WILL NEVER BUY ANOTHER TOYOTA AGAIN, OR A CAR PERIOD UNLESS I CAN PAY FOR IT IN CASH UPFRONT. THE VEHICLES VOC TURNED DANGEROUS AFTER TURNING ON THE CAR FOR 10MINUTES STRAIGHT.",
        "vin": "5YFBURHE5JP"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/03/2021",
        "dateOfIncident": "07/10/2020",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394237,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 TOYOTA COROLLA. THE CONTACT STATED THAT SHE RECEIVED A RECALL NOTIFICATION UNDER NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE). *LD    THE CONSUMER STATED THE VEHICLE CAUGHT FIRE. *JS",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/25/2020",
        "dateOfIncident": "07/10/2020",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376278,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2018 TOYOTA COROLLA. THE CONTACT STATED THAT SHE RECEIVED A RECALL NOTIFICATION UNDER NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE). THE VEHICLE WAS TAKEN TO BEV SMITH TOYOTA, 3350 US-1, FORT PIERCE, FL 34982, WHERE THE REPAIR WAS COMPLETED FOR THE RECALL. THE CONTACT STATED AN HOUR LATER AFTER SHE LEFT THE DEALER, TWO MILES DOWN THE ROAD DRIVING AT 34 MPH, THE VEHICLE STARTED TO DECELERATED TO 15-19 MPH. THE CONTACT CALLED BACK THE DEALER AND WAS INFORMED TO BRING BACK THE VEHICLE. THE VEHICLE THEN STALLED AND THE CONTACT WAS ABLE TO COAST TO THE SIDE OF THE ROAD TO WAIT FOR THE DEALER TECHNICIAN TO PICK UP THE VEHICLE. THE CONTACT STATED THAT THE TECHNICIAN HAD SPRAYED A SUBSTANCE ON THE ENGINE IN ORDER TO START THE VEHICLE AND TAKEN IT TO THE DEALER BUT WHEN ATTEMPTING TO START THE VEHICLE, THE VEHICLE TO IGNITE INTO FLAMES. THE CONTACT STATED THAT THE VEHICLE WAS DESTROYED DUE TO NEGLIGENT FROM THE DEALER. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND OPENED A CASE. THE FAILURE MILEAGE WAS APPROXIMATELY 24,000.",
        "vin": "2T1BURHE9JC"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/17/2020",
        "dateOfIncident": "11/02/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375105,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA COROLLA. THE CONTACT STATED WHILE DRIVING 50 MPH, THE AIR BAGS AND REAR SEAT BELTS WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER TOYOTA OF DOWNTOWN LA. (1901 S FIGUEROA ST, LOS ANGELES, CA 90007, (213) 986-2011) HOWEVER, THE MECHANIC WAS UNABLE TO DUPLICATE THE FAILURE. THE FAILURE RECURRED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER HAD NOT BEEN INFORMED OF FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 19,391. *LN*JB",
        "vin": "5YFBURHE3JP"
    },
    {
        "components": "POWER TRAIN,STRUCTURE,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "11/08/2020",
        "dateOfIncident": "10/25/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11373682,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAGS DIDN'T DEPLOY WHEN I HAD AN ACCIDENT.*DT*DT*JB*JB",
        "vin": "5YFBURHE4JP"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/22/2020",
        "dateOfIncident": "10/22/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361815,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 TOYOTA COROLLA. CONSUMER WRITES IN REGARDS TO TOYOTA BEING UNABLE TO REPAIR DEFECT IN VEHICLE. *LD *JS",
        "vin": "5YFBURHE2JP"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/20/2020",
        "dateOfIncident": "09/09/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365477,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SAFETY RECALL WORK ON THE AIRBAGS/SEAT BELTS WAS PERFORMED AT CITY TOYOTA, DALY CITY ON 6-16-20. ON 9-9-20 I WAS HEADING HOME FROM THE BANK, DID NOT FEEL WELL, LOST CONTROL OF THE CAR AND RAN OVER A ROAD DIVIDER ISLAND CURB AT THE INTERSECTION OF LAKE MERCED BLVD. AND SKYLINE BLVD., S.F. AT AROUND 5 PM. THE FRONT AIR BAGS DID NOT DEPLOY WHEN I THINK THEY SHOULD HAVE IS WHAT I AM REPORTING HERE. EVERYTHING FROM THE HOOD DOWN WAS RIPPED OFF THE CAR, NAMELY, THE HEAD LIGHTS, GRILL, TOYOTA EMBLEM, BUMPER, RADIATOR, AND PART OF THE AC SYSTEM. I WAS THE ONLY PERSON IN THE CAR, HAD MY SEAT BELT ON, AND WAS NOT INJURED, AND LUCKILY DID NOT HIT ANY PEOPLE OR ANOTHER VEHICLE. A LADY WHO WITNESSED THE ACCIDENT CALLED AN AMBULANCE (KING-AMERICAN AMBULANCE CO.), S.F. POLICE AND A TOW TRUCK. AAA AUTOMOBILE INSURANCE COMPANY INITIALLY DECLARED THE CAR A TOTAL LOSS (CLAIM #[XXX]) AND THEN OVER A MONTH LATER ON 10-15-20 THEY E-MAIL SAYING THE CAR HAD BEEN DEEMED REPAIRABLE AFTER ALL. NOW, THE CAR IS BEING TOWED TO PIERRE'S AUTO BODY, 1349 NINTH AVENUE, SAN FRANCISCO CA 94122, TEL. (415) 564-0900 AND THE REPAIR WORK IS SCHEDULED TO BEGIN ON THIS FRIDAY MORNING 10-23-20. THE OWNER OF THE SHOPS NAME IS [XXX], AND THE ESTIMATE IS A WHOPPING $8,473.45 DOLLARS. IF THIS REPORT IS REVIEWED SOON ENOUGH, I THINK THE VEHICLE SHOULD BE INSPECTED BY YOUR AGENCY BEFORE REPAIRS BEGIN AND TELL ME WHAT YOU THINK? THE AAA INSURANCE CLAIM ADJUSTERS NAME IS [XXX] AND CAN BE REACHED AT [XXX]. THANK YOU FOR LOOKING INTO THIS SITUATION.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "2T1BURHE9JC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/04/2020",
        "dateOfIncident": "10/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362628,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "IT HAS BEEN MULTIPLE TIMES WHERE I AM SITTING AT A RED LIGHT AND THE CAR SURGES FORWARD UNEXPECTEDLY. IT FEELS AS IF SOMEONE JUST REAR-ENDED ME. ONCE THIS HAPPENS AND YOU PRESS ON THE ACCELERATOR IT TAKES LONGER TIME FOR THE CAR TO COME TO SPEED. IT'S AS IF THE ENGINE JUST \"BOGS\" UP FOR A COUPLE SECOND.",
        "vin": "2T1BURHE7JC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/01/2020",
        "dateOfIncident": "09/30/2020",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362185,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA COROLLA. THE CONTACT STATED THAT WHEN SHE PUT THE KEY IN THE IGNITION SWITCH WITHOUT STARTING THE VEHICLE, SMOKE START TO EMITTED THROUGH THE VENTS AND THE BOTTOM OF THE DASHBOARD IN THE MIDDLE. THE CONTACT NOT AWARE OF WHAT CAUSING THE SMOKE TO COME THROUGH THE VENT. THE VEHICLE WAS NOT TAKEN TO A DEALER OR AN INDEPENDENT MECHANIC FOR A DIAGNOSTIC TESTING. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 59,326.",
        "vin": "2T1BURHE5JC"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/08/2020",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353698,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA COROLLA. THE CONTACT STATED THAT THE FRONT DRIVER'S SIDE AND PASSENGER'S SIDE SEAT BELTS MALFUNCTIONED AND FAILED TO RETRACT OR SECURE THE VEHICLE OCCUPANTS. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. NEITHER THE LOCAL DEALER NOR THE MANUFACTURER WERE NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 100. INVALID VIN.",
        "vin": "2T1VURHE7J6"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/24/2020",
        "dateOfIncident": "06/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351018,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA COROLLA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 20V024000 (AIR BAGS) AND 20V012000 (FUEL SYSTEM, GASOLINE). THE VEHICLE WAS TAKEN TO THE TOYOTA OF BOWIE DEALER LOCATED AT 16700 GOVERNOR BRIDGE RD, BOWIE, MD 20716, WHERE THE RECALLS WERE REPAIRED.  THE CONTACT STATED AFTER THE REPAIRS, SHE STARTED FEELING DIZZY AND NAUSEATED, HAVING MIGRAINE HEADACHES. THE DEALER WAS CALLED BACK AND THE TECHNICIAN WAS UNABLE TO DETECT THE CAUSE OF THE ISSUE. THE CONTACT PURCHASED AN AIR QUALITY DETECTOR AND DETECTED A VOC (VOLATILE ORGANIC COMPOUND) OF .975MG (WITHIN 15 MINUTES OF RUNNING THE VEHICLE) WHICH WAS OVER EPA RECOMMENDATION. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND WAS TOLD THAT SOMEONE WOULD CALL BACK. THE CONTACT WAS NOT CALLED BACK. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 60,000.*DT *JS",
        "vin": "5YFBURHE5JP"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/20/2020",
        "dateOfIncident": "08/18/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350497,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA COROLLA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE).  THE CONTACT STATED WHILE DRIVING APPROXIMATELY 60 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE CONTACT STATED SHE WAS ABLE TO SHIFT THE VEHICLE INTO PARK AND RESTARTED THE VEHICLE. THE VEHICLE WAS NOT TAKEN TO BE DIAGNOSED. NEITHER THE DEALER NOR THE MANUFACTURER WERE NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 24,000.",
        "vin": "2T1BURHE1JC"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "08/19/2020",
        "dateOfIncident": "08/18/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350297,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA COROLLA. THE CONTACT STATED THAT HER VIEW FROM THE BACKUP CAMERA WAS OBSTRUCTED. THE CONTACT STATED THAT THE VIEW SHOWS PART OF THE BUMPER, THE TAG, AND THE ROADWAY. THE CONTACT STATED THAT THE LOCATION OF THE CAMERA WAS POORLY DESIGNED AND ALLOWED THE VIEW TO BE OBSTRUCTED. THE MANUFACTURER STATED THAT THERE WAS NO FIX FOR THE ISSUE AND THAT THE VEHICLE WAS DESIGNED TO HAVE THE CAMERA WHERE IT WAS LOCATED. THE CONTACT WAS PROVIDED A CASE NUMBER. THE DEALER TOYOTA OF TAMPA BAY (1101 E FLETCHER AVE, TAMPA, FL 33612, (813) 933-6402) INSPECTED THE VEHICLE AND SHOWED THE CONTACT OTHER MODELS THAT WERE ALL DESIGNED THE SAME WAY. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 17,858.*DT  CONSUMER NO LONGER OWNS THE VEHICLE AND WOULD LIKE TO CLOSE THE CASE.*JB",
        "vin": "2T1BURHE7JC"
    },
    {
        "components": "AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/13/2020",
        "dateOfIncident": "08/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349042,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I I CALLED RAY BRANDT TOYOTA 2WEEKS AGO FROM TODAY TO ADVISE THEM I HAD RECALLS ON MY CAR. BUT I NEVER HEARD BACK FROM FROM THEM SINCE I CALLED.",
        "vin": "5YFBURHE4JP"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/10/2020",
        "dateOfIncident": "08/07/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11344299,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAGS DIDN'T DEPLOY WHEN A MAN RAN A STOP SIGN AND HIT THE FRONT DRIVERS FINDER AND DRIVER DOOR AND THEN THE FRONT OF THE CAR HIT BRICK WALL AND A CHAIN FENCE",
        "vin": "2T1BURHE8JC"
    },
    {
        "components": "SUSPENSION,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/08/2020",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343995,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUBJECT VEHICLES ARE EQUIPPED WITH A LOW-PRESSURE FUEL PUMP WHICH MAY STOP OPERATING. IF THIS WERE TO OCCUR, WARNING LIGHTS AND MESSAGES MAY BE DISPLAYED ON THE INSTRUMENT PANEL, AND THE ENGINE MAY RUN ROUGH. THIS MAY RESULT IN A VEHICLE STALL, AND THE VEHICLE MAY BE UNABLE TO BE RESTARTED. IF A VEHICLE STALL OCCURS WHILE DRIVING AT HIGHER SPEEDS, THIS COULD INCREASE THE RISK OF A CRASH.",
        "vin": "5YFBURHEXJP"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/17/2020",
        "dateOfIncident": "04/30/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339892,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE CRUISE CONTROL WORKS FINE ON A FLAT SURFACE, BUT WHEN IT ENCOUNTERS A DOWNGRADE IT ACCELERATES 10MPH OVER THE SET SPEED AND THE RPMS INCREASE TO 4000. THE VEHICLE THEN APPLIES THE BRAKES FORCIBLY TO SLOW TO THE SET SPEED. IT SEEMS TO DOWNSHIFT BUT DOESN'T LET OFF THROTTLE SO IT SPEEDS UP RATHER THAN ENGINE BRAKE.",
        "vin": "2T1BURHEXJC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/13/2020",
        "dateOfIncident": "05/29/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338984,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA COROLLA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER THE PART TO DO THE RECALL REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE VEHICLE WAS TAKEN TO VANN YORK TOYOTA (500 EASTCHESTER DR, HIGH POINT, NC 27262), AND IT WAS CONFIRMED THAT THE PART WAS AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.*DT  VEHICLE HAS BEEN REPAIRED AT VANN YORK.*JB",
        "vin": "5YFBURHE5JP"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/20/2020",
        "dateOfIncident": "04/17/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329816,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED RECALL NOTICE INTERIM NOTICE 4/17/2020 FOR LOW PRESSURE FUEL PUMP RECALL NHTSA # 20V-012. CALLED CURRY TOYOTA AND BROUGHT CAR IN AND RECEIVED A LONER.  THEY HAVE MY CAR OVER 70 DAYS NOW WITH NO REMEDY.  MY CAR IS UNDER WARRANTY, LESS THAN 24 MONTHS OLD AND HAS A LITTLE OVER 7,000 MILES.   I BELIEVE IT SHOULD COME UNDER THE LEMON LAWS #4. THERE IS NO REMEDY IN SIGHT.   PLEASE ADVISE.THIS IS THE SECOND RECALL ON THIS VEHICLE. *TR",
        "vin": "5YFBURHEXJP"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/17/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329410,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA COROLLA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE VEHICLE WAS TAKEN TO VANDERGRIFF TOYOTA (1000 W. INTERSTATE 20 W, ARLINGTON, TX 76017, (817) 533-4240) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2T1BURHE0JC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/15/2020",
        "dateOfIncident": "10/15/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328971,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA COROLLA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT VEHICLE STALLED WHILE DRIVING. THE VEHICLE WAS TAKEN TO VAL HENDRICKSON TOYOTA (5201 W. SAMPLE RD, COCONUT CREEK, FL 33073, (954) 972-1100) AND IT WAS CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE CONTACT WAS INFORMED NOT TO DRIVE THE VEHICLE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND ISSUED THE CONTACT A LOANER VEHICLE.  THE LOANER VEHICLE STALLED WHILE DRIVING OUT OF A PARKING LOT. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THE PART WAS AVAILABLE AND REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 11,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.*DT*JB",
        "vin": "5YFBURHE5JP"
    },
    {
        "components": "AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/15/2020",
        "dateOfIncident": "12/20/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328977,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG WAS REPLACED BUT THE FUEL PUMP WHICH CAUSED THE CAR TO FLOOD OUT AND STALL HAS NOT BEEN FIXED BECAUSE THE PART IS STILL NOT AVAILABLE FOR REPAIRING THE PROBLEM.  I REPORTED PROBLEMS TO TOYOTA AND I WAS TOLD THAT THE PART FOR THE FUEL PUMP WAS STILL NOT AVAILABLE.  THE CAR STALLED AT A RED LIGHT AND I TOOK THE CAR TO THE DEALER AND I WAS TOLD TO TAKE THE CAR HOME, PARK IT AND DO NOT DRIVE IT BECAUSE OF THE ISSUE.  THE DEALER GAVE ME A CAR TO USE AND IT ALSO STALLED .. TOYOTA SENT ME A RECALL NOTICE IN JANUARY OF 2020 BUT THE PART IS STILL NOT AVAILABLE TO FIX THE PROBLEM.*DT*JB *TR",
        "vin": "5YFBURHE5JP"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/09/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327961,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA COROLLA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE.  THE CONTACT CALLED TOYOTA OF EL CAJON DEALERSHIP (965 ARNELE AVE, EL CAJON, CA 92020, (619) 270-3000) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR.  THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND A CASE WAS FILED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5YFBURHE9JP"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/03/2020",
        "dateOfIncident": "01/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327125,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA COROLLA. THE CONTACT STATED WHILE DRIVING AT LOW SPEEDS THE VEHICLE RAN ROUGH, VIBRATED AND STALLED WITHOUT WARNING. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE VEHICLE WAS TAKEN TO AL HENDRICKSON TOYOTA (5201 W, FL-834, COCONUT CREEK, FL 33073, (954) 972-1100) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. A LOANER VEHICLE WAS PROVIDED. THE MANUFACTURER WAS CONTACTED HOWEVER NO FURTHER ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS 11,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5YFBURHE5JP"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/29/2020",
        "dateOfIncident": "01/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326502,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA COROLLA. THE CONTACT STATED THAT THE CHECK ENGINE WARNING LIGHT INTERMITTENTLY ILLUMINATED WHILE DRIVING. THE VEHICLE WAS TAKEN JIM ELLIS TOYOTA OF MCDONOUGH (144 HWY 81, MCDONOUGH, GA 30253), TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE FUEL PRESSURE PUMP NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED BECAUSE THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE VIN WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE). THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 33,000.*DT*JB",
        "vin": "5YFBURHE7JP"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/21/2020",
        "dateOfIncident": "01/17/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325470,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE'S BEEN A RECALL ON MY CAR FOR 5 MONTHS AND TOYOTA STILL DOES NOT HAVE A REMEDY. I USE MY CAR FOR WORK BUT BECAUSE OF THE RECALL MY COMPANY DOESN'T ALLOW ME TO USE THIS CAR ANY LONGER FOR WORK UNTIL RECALL HAS BEEN COMPLETED.  *TR",
        "vin": "2T1BURHE8JC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/18/2020",
        "dateOfIncident": "05/04/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325024,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA COROLLA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 20V024000 (AIR BAGS) AND 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PARTS TO DO THE RECALL REPAIRS WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIRS. NEITHER THE MANUFACTURER NOR THE DEALER WERE MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED EITHER FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2T1BURHE3JC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/07/2020",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323764,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA COROLLA. THE CONTACT STATED WHILE THE VEHICLE WAS AT A STAND STILL, THE CONTACT WAS UNABLE TO START THE VEHICLE. THE CONTACT STATED AFTER SEVERAL ATTEMPTS THE VEHICLE STARTED. THE VEHICLE WAS TAKEN TO TOYOTA OF KATY LOCATED AT 21555 KATY FWY, KATY, TX 77450, WHERE THE MECHANIC WAS UNABLE TO DUPLICATE THE FAILURE. THE CONTACT CONTINUED TO EXPERIENCE THE FAILURE. THE CONTACT RECENTLY RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE). THE MANUFACTURER HAD NOT BEEN INFORMED OF FAILURE. THE PART WAS NOT AVAILABLE FOR THE REPAIR. PARTS DISTRIBUTION DISCONNECT. THE FAILURE MILEAGE WAS 46,000.",
        "vin": "5YFBURHE1JP"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/30/2020",
        "dateOfIncident": "07/30/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322815,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA COROLLA. THE CONTACT STATED WHILE DRIVING APPROXIMATELY 50 MPH THE VEHICLE STALLED WITH THE MALFUNCTION-NO POWER MESSAGE DISPLAYED ON THE INSTRUMENT PANEL. THE CONTACT WAS UNABLE TO RESTART THE VEHICLE. THE VEHICLE WAS TOWED TO TOYOTA OF GREENSBURG (4964 US-30, GREENSBURG, PA 15601) WHERE THE VEHICLE WAS DIAGNOSED HOWEVER, THE MECHANIC WAS UNABLE TO RETRIEVE A FAULT CODE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 24,000.  *BF  CONSUMER STATED VEHICLE HAD A MALFUNCTION INDICATOR WHEN VEHICLE STALLED.*JB",
        "vin": "2T1BURHE6JC"
    },
    {
        "components": "AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/23/2020",
        "dateOfIncident": "04/16/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322045,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA COROLLA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V024000 (AIR BAGS) AND NHTSA CAMPAIGN NUMBER: 20V012000(FUEL SYSTEM, GASOLINE) HOWEVER, THE PARTS TO DO THE RECALL REPAIRS WERE NOT YET AVAILABLE. THE CONTACT STATED AN UNKNOWN DEALER WAS CONTACTED HOWEVER, NO ASSISTANCE WAS PROVIDED. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT STATED THAT WHILE DRIVING AT 55 MPH, THE RPM FLUCTUATED AND THE VEHICLE STALLED. THE CHECK ENGINE WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. *LN*JB",
        "vin": "2T1BURHEXJC"
    },
    {
        "components": "AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/16/2020",
        "dateOfIncident": "01/17/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321289,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA COROLLA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 20V012000 (FUEL SYSTEM, GASOLINE) AND 20V024000 (AIR BAGS), HOWEVER, THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER BEV SMITH TOYOTA  (3350 S US HIGHWAY 1, FORT PIERCE, FL 34982, (844) 974-0333) WAS CONTACTED AND CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE MANUFACTURER WAS NOT CONTACTED OR MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.*CK  CONSUMER WAS NOTIFIED OF RECALLED BUT WAS DENIED THE LEMON LAW CLAIM. THERE WAS NO REMEDY FOR A FUEL PUMP.*JB",
        "vin": "2T1BURHEXJC"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "04/14/2020",
        "dateOfIncident": "05/15/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11321075,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA COROLLA. THE CONTACT STATED THAT THE VEHICLE HAS BEEN TO THE DEALER SEVERAL TIMES IN THE LAST YEAR FOR DIAGNOSIS AS WHEN THE BRAKE PEDAL WAS BEING DEPRESSED WHILE AT A STOP LIGHT THE VEHICLE WOULD JERK FORWARD HARD. THE CONTACT ALSO STATED THAT WHILE DRIVING AT APPROXIMATELY 20-25 MPH, SHE ATTEMPTED TO DEPRESS THE BRAKE PEDAL WHEN A SLIPPER GOT STUCK IN THE MAT GROVES AND THE VEHICLE ACCELERATED; CAUSING THE CONTACT TO REAR END THE VEHICLE IN FRONT OF HER. NO AIRBAGS DEPLOYED AND THE SEAT BELT FAILED TO RETRACT.  THE OTHER INDIVIDUAL INJURIES WERE UNKNOWN. THE CONTACT SUSTAINED A BRUISED CHEST, HER NOSE AND MOUTH WAS BLEEDING WHICH DID NOT REQUIRE MEDICAL ATTENTION. A POLICE REPORT WAS MADE. THE CONTACT MANAGED TO DRIVE THE VEHICLE TO HER RESIDENCE WHERE THE INSURANCE COMPANY WAS CONTACTED. THE VEHICLE WAS TAKEN TO A COLLISION CENTER WHERE THE PHYSICAL DAMAGE WAS REPAIRED. THE VEHICLE THEN WAS TAKEN TO THE DEALER ROSEVILLE TOYOTA (700 AUTOMALL DR, ROSEVILLE, CA 95661 (916) 782-2163) FOR DIAGNOSIS. THE CONTACT MENTIONED NHTSA CAMPAIGN NUMBER: 20V024000 (AIR BAGS) AS A POSSIBLE SOLUTION TO THE FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "2T1BURHE7JC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/06/2020",
        "dateOfIncident": "02/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320306,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2018 TOYOTA COROLLA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V024000 (AIR BAGS) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. CHARLES MAUND TOYOTA (8400 RESEARCH BLVD, AUSTIN, TX 78758), CONFIRMED THAT PARTS WERE NOT AVAILABLE TO PERFORM THE RECALL REPAIRS. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2T1BURHE5JC"
    },
    {
        "components": "AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/06/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320318,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA COROLLA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 20V024000 (AIR BAGS) AND 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PARTS TO DO THE RECALL REPAIRS WERE NOT YET AVAILABLE. THOUSAND OAKS TOYOTA (2401 THOUSAND OAKS BLVD, THOUSAND OAKS, CA 91362) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR.  THE MANUFACTURER WAS MADE AWARE OF THE ISSUES. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5YFBURHEXJP"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/02/2020",
        "dateOfIncident": "02/11/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320062,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA COROLLA. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 55 MPH, THE VEHICLE SHUDDERED AND STALLED. THE CONTACT STATED THAT THERE WAS NO WARNING LIGHTS ILLUMINATED. THE CONTACT PULLED OVER TO INSPECTED THE VEHICLE. THE VEHICLE FAILED TO START AFTERWARDS. THE VEHICLE WAS TOWED TO TOYOTA OF LAREDO LOCATED AT (6324 BOB BULLOCK LOOP, LAREDO, TX 78041) WHERE THE MECHANIC FOUND NO DEFECT WITH THE VEHICLE. THE CONTACT DISCOVERED THAT THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR.  THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND ACKNOWLEDGED THAT PARTS WERE UNAVAILABLE. THE MANUFACTURER AT FIRST DECLINED TO PROVIDE A LOANER VEHICLE BUT AFTER SEVERAL ADDITIONAL FAILURES, A LOANER WAS PROVIDED. THE VEHICLE REMAINED IN THE POSSESSION OF THE DEALER. THE FAILURE MILEAGE WAS UNKNOWN.  VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5YFBURHE1JP"
    },
    {
        "components": "AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/24/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319171,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2018 TOYOTA COROLLA. THE CONTACT STATED THAT THE FUEL WARNING LIGHT DISPLAYED ON THREE DIFFERENT OCCASIONS. THE CONTACT RESET THE FUEL CAP AND THE FUEL WARNING LIGHT RE-ILLUMINATES AFTER 40 ' 50 MILES OF BEING DRIVEN. IN ADDITION, THERE WAS A FUEL ODOR INSIDE THE VEHICLE. THE CONTACT LATER RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 20V120000 (FUEL SYSTEM,GASOLINE) AND 20V024000 (AIR BAGS) HOWEVER, THE PARTS TO DO THE REPAIRS WERE UNAVAILABLE. THE CONTACT WAS ALSO CONCERNED THAT THE AIR BAGS MIGHT DEPLOY WITHOUT IMPACT OR NOT DEPLOY DURING AN IMPACT DUE TO 2 OPEN RECALLS ASSOCIATED WITH THE VEHICLE. WESTBURY TOYOTA (1121 OLD COUNTRY RD, WESTBURY, NY 11590) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDIES DUE TO COVID-19. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR BOTH RECALL REMEDIES TO BE AVAILABLE. THE MANUFACTURER HAD BEEN NOTIFIED OF THE FAILURE AND WAS RECOMMENDED TO WAIT FOR ANOTHER RECALL NOTICE IN THE MAIL. THE FAILURE MILEAGE WAS 8,000. VIN TOOL CONFIRMS THAT PARTS NOT AVAILABLE. *DT*JB",
        "vin": "2T1BURHE7JC"
    },
    {
        "components": "AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/16/2020",
        "dateOfIncident": "03/16/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318224,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THESE NEED TO BE RESOLVED ASAP.  WHY IS THERE A DELAY?",
        "vin": "5YFBURHE8JP"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/15/2020",
        "dateOfIncident": "03/14/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318082,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM NOT SATISFIED WITH THAT, AFTER ALL I HAVE HAD MY CAR FOR 2 YEARS AND NOW YOU NOTICE THAT THERE IS AN ERROR IN THE AIRBAG?  THIS IS SERIOUS AND PEOPLE STILL DIED, AND EVEN THOUGH I HAVE TO WAIT FOR A SOLUTION TO FIX IT?  I USE MY CAR EVERY DAY TO WORK AND I'M AT RISK EVERY DAY.  HOW IS THE RISK I HAVE TAKEN FOR THESE PAST TWO YEARS?  YOU SHOULD INDEMNIFY THE CUSTOMER AND NOT SIMPLY SEND A LETTER THAT IS SEEKING A SOLUTION.  ON THE DAY I BOUGHT IT I BOUGHT A CAR THINKING IT WAS IN PERFECT CONDITION AND THEN I RECEIVED A NOTIFICATION THAT THERE IS A RISK, WHICH CAN BE SERIOUS TO MY LIFE AND THAT OF MY PASSENGERS, FAMILY OR FRIENDS.  TOTAL NEGLECT.",
        "vin": "2T1BURHE8JC"
    },
    {
        "components": "POWER TRAIN,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/11/2020",
        "dateOfIncident": "11/15/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317494,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA COROLLA. THE CONTACT STATED THAT WHEN STOPPED AT A RED LIGHT, THE VEHICLE SURGED FORWARD. NO WARNING INDICATORS WERE ILLUMINATED. THE CONTACT ALSO STATED THAT THE SEAT BELT WAS VERY HARD TO UNBUCKLE. THE VEHICLE WAS NOT TAKEN TO A DEALER FOR A DIAGNOSTIC. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND A CASE WAS OPENED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 30,000.",
        "vin": "5YFBURHE9JP"
    },
    {
        "components": "AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/05/2020",
        "dateOfIncident": "03/04/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316317,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA COROLLA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) AND 20V024000 (AIR BAGS) HOWEVER, THE PARTS TO DO THE RECALL REPAIRS WERE UNAVAILABLE. FRED ANDERSON TOYOTA OF COLUMBIA LOCATED AT (2136 SUNSET BLVD, WEST COLUMBIA, SC 29169) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIRS.  THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.*DT*JB",
        "vin": "5YFBURHE1JP"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "03/02/2020",
        "dateOfIncident": "02/25/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11315662,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SON AND I WERE IN A HEAD ON COLLISION. THE OTHER CAR WAS AT FAULT. SPEED FOR BOTH VEHICLES WAS AROUND 35 MPH. MY 11 YEAR OLD SON WAS IN THE REAR PASSENGER SEAT BUCKLED. I WAS DRIVING. I HAVE A FEW BRUISES BUT AM OK. MY SON IS NOT. HE HAS MULTIPLE FRACTURES TO HIS HEAD (RIGHT SIDE), RIGHT EYE SOCKET, SPINE (UPPER NECK AND BACK). AS YOU CAN SEE FROM THE PICTURES HE SHOULD NOT HAVE THESE INJURIES. THE INSURANCE ADJUSTER SAID I NEED TO CONTACT AN INVESTIGATOR TO SEE WHAT WAS WRONG WITH THE AIRBAG TO CAUSE THESE INJURIES.. WE ARE LOOKING AT WEEKS OF HOSPITAL AND INPATIENT REHAB FOR HIM.",
        "vin": "2T1BURHE8JC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/27/2020",
        "dateOfIncident": "02/26/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311973,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED AN EMAIL REGARDING THE RECALL CONCERNING THE AIRBAG. I TOOK IT IN FOR OIL CHANGE ON 2/26/202  AND ASKED REGARDING THIS MATTER AND THEY STATED THEY DO NOT HAVE THE PART AVAILABLE AND WILL CALL ME WHEN ITS AVAILABLE.",
        "vin": "2T1BURHE5JC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/14/2020",
        "dateOfIncident": "02/08/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309297,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INVOLVED IN AN ACCIDENT WHERE THE OTHER DRIVER HIT MY CAR ON THE FRONT LEFT SIDE, CLOSE TO MY DOOR AND THE AIRBAGS DID NOT GO OFF. I DON'T KNOW IF THERE'S ANY OTHER SENSORS IN THE BACK BUT I WAS BIT IN THE BACK AFTER AS WELL AND THE AIRBAGS STILL DID NOT GO OFF. I WAS DRIVING 30MPH ON A CITY STREET.",
        "vin": "2T1BURHEXJC"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/24/2020",
        "dateOfIncident": "01/17/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11301570,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE SEATBELT DOES NOT LOCK WHEN BRAKES ARE DEPRESSED WHILE COMING TO A STOP. DOES NOT HAPPEN EVERY TIME. DIFFICULT TO REPLICATE.",
        "vin": "5YFBURHEXJP"
    },
    {
        "components": "POWER TRAIN,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/21/2020",
        "dateOfIncident": "01/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300741,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA COROLLA. THE CONTACT STATED THAT WHILE THE VEHICLE WAS PARKED IN THE GARAGE, THE ELECTRIC FUEL PUMP STARTED ITSELF WHILE THE ENGINE WAS OFF. THE FAILURE RECURRED. THE CONTACT CALLED THE PRESTIGE TOYOTA DEALER (844-838-7075, LOCATED AT 1096 NJ-17, RAMSEY, NJ 07446) AND WAS TOLD TO BRING THE VEHICLE TO THE SHOP. THE CONTAC INSTEAD SENT A VIDEO RECORDING OF THE FAILURE. THE CONTACT WAS TOLD TO TAKE THE VEHICLE TO THE SHOP. THE CONTACT CALLED THE HALTERMAN'S TOYOTA DEALER (570-339-9129, LOCATED AT 1741 PARADISE TRAIL RTE 447, EAST STROUDSBURG, PA 18301) AND SCHEDULED AN APPOINTMENT FOR THE FOLLOWING DAY. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED THE CONTACT WITH A CASE NUMBER: 2001171560. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 5,500.",
        "vin": "2T1BURHE0JC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/17/2020",
        "dateOfIncident": "01/17/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300125,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTEST A HUMMING NOISE COMING FROM THE REAR OF THE CAR THE SOUND WAS COMING FROM THE ELECTRIC FUEL PUMP WHILE THE CAR WAS OFF IN THE GARAGE FOR 5 1/2 HOURS I START THE CAR & SHUT IT THE SOUND WENT AWAY HAPPENED ONE WEEK AFTER I PURCHASED THE CAR IM KEEPING MY EYE ON IT",
        "vin": "2T1BURHE0JC"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/16/2020",
        "dateOfIncident": "09/06/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299994,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WAS IN STATIONARY MODE ON A CITY STREET AND WAITING FOR THE RED LIGHT TO TURN GREEN. AFTER A FEW MINUTES, THE TURNED GREEN AND I ACCELERATED A LITTLE AS THE CAR BEGIN TO MOVE BUT OUT OF NOWHERE THE CAR TURNED OFF AND ALL SYSTEMS STOPPED, INCLUDING THE COMPUTER BOARD, BUT BEFORE ALL WENT BLANK THERE WAS A MESSAGE ABOUT SYSTEM ERROR WITH A TRIANGLE SYMBOL, AND I HAD TO MANUALLY ACTIVATE THE PARKING LEVER AS WELL AS PRESS THE BRAKES. THANKFULLY EVERYONE IN THEIR LANES NOTICED MY ODYSSEY AND MADE SPACE FOR THE OTHER UPCOMING CARS AS I ACTIVATED THE EMERGENCY FLASHING LIGHTS. HOWEVER, I TURNED THE CAR FULLY OFF BY TURNING THE KEY AND WAITED SOME MINUTES AS I WAS ADJUSTING TO THE SITUATION. I THEN TURNED THE CAR ON AGAIN AND WORKED. A FEW DAYS AFTER THE INCIDENT, I TOOK THE CAR TO THE DEALERSHIP AND THE STAFF MEMBER WHO ASSISTED ME SAID THAT THE SYSTEM'S RECORD SHOWED THAT THERE AS AN ERROR HISTORY BUT DID NOT SAY WHICH COMPONENT PART OR WHERE THE MALFUNCTION WAS LOCATED THAT CAUSED THE CAR'S SAFETY RISK IN REGARDS TO THE COMPUTER SYSTEM AND ENGINE TO STOP WITHOUT ANY NOTICE. THIS RESPONSE TO WHAT HAPPENED WAS NOT SATISFACTORY TO ME BECAUSE NOTHING WAS DONE AND NO PAPERWORK OR RECORD WAS GIVEN TO ME ABOUT THE SYSTEM CHECK OR REPORT. THIS INCIDENT AND UNKNOWN RESPONSE TO THE MALFUNCTION CAUSE HAVE MADE ME WORRY ABOUT THIS HAPPENING AGAIN IN THE FUTURE UNDER OTHER UNSAFE CIRCUMSTANCES AND THAT IT COULD CAUSE ME TO HAVE AN ACCIDENT.",
        "vin": "2T1BURHEXJC"
    },
    {
        "components": "ELECTRICAL SYSTEM,LANE DEPARTURE",
        "crash": true,
        "dateComplaintFiled": "12/27/2019",
        "dateOfIncident": "09/13/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11291652,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2018 TOYOTA COROLLA. WHILE THE CONTACT WAS ATTEMPTING TO ENTER HIGHWAY TRAFFIC, THE LANE DEPARTURE WHEEL ASSIST MALFUNCTION. THE LANE DEPARTURE WHEEL ASSIST ENGAGED WITHOUT BEING ACTIVATED BY THE DRIVER CAUSING THE VEHICLE VEERED LEFT AND RIGHT. THE CONTACT LOST CONTROL OF THE VEHICLE AND IT CRASHED INTO A WALL BARRIER. THE AMBULANCE AND POLICE DEPARTMENT ASSISTED THE DRIVER OUT OF THE VEHICLE. THE CONTACT SUSTAINED INJURIES TO THE RIGHT HAND, BACK, AND LEGS, WHICH REQUIRED MEDICAL ATTENTION. THE MANUFACTURER WAS CONTACTED AND WERE CONDUCTING AN INVESTIGATION. POLICE REPORT NUMBER: 19049540 WAS FILED. THE VEHICLE WAS DESTROYED AND TOWED. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE DEALER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 30,000.",
        "vin": "2T1BURHE9JC"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "12/18/2019",
        "dateOfIncident": "11/19/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289907,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA COROLLA. WHILE DRIVING MORE THAN 32 MPH, THE CONTACT WAS UNABLE TO HEAR THE LANE DEPARTURE ALERT. CONSUMER ALSO STATED SAME WARNING SOUND IS MADE IF A DOOR IS AJAR. THE CONTACT STATED THAT THE LANE DEPARTURE WARNING INDICATOR WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO GLEN TOYOTA (LOCATED AT 23-07 MAPLE AVE, FAIR LAWN, NJ 07410, (201) 791-3800), BUT THEY COULD NOT DUPLICATE THE FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 7,500.*DT*JB*LN*JB",
        "vin": "2T1BURHE3JC"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/08/2019",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287746,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR RECENTLY IS NOT SHIFTING PROPERLY. DRIVES AT HIGH RPMS AND IF I ACCELERATE TOO QUICKLY SAY I GET UP TO 80 MPH ON HIGHWAY CAR WON'T SHIFT INTO NEXT GEAR THE RPMS SUDDENLY DROP ALL THE WAY DOWN TO UNDER 1000 AND QUITS ACCELERATING UNTIL IT JUMPS BACK INTO GEAR. HAVE TO LET FOOT OFF THE GAS FOR IT TO SHIFT AND CRUISE CONTROL HAS BEEN NOT FUNCTIONING PROPERLY EITHER.",
        "vin": "2T1BPRHE7JC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/20/2019",
        "dateOfIncident": "11/19/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281247,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TODAY AT APPROXIMATELY 4PM NOV 19, 2019, I PARKED MY CAR IN A PARKING LOT AND TURNED OFF THE MOTOR, PUT IT IN PARK AND WHEN I PULLED THE EMERGENCY BRAKE INTO PLACE THE CAR LUNGED BACKWARD A LITTLE BUT STOPPED AS SOON AS THE EMERGENCY BRAKE WAS ENGAGED. I FILED A REPORT BACK ON OCTOBER 20, 2019, PLEASE REFER TO CASE #11271148. I AM BRINGING THE CAR TO THE TOYOTA DEALERSHIP ON SATURDAY, NOV 23, 2019, SO IT CAN BE CHECKED OUT AS TO WHY THE CAR IS JERKING WHEN IN PARK. I WANT TO REGISTER THIS COMPLAINT AS WELL. I JUST PICKED THE CAR UP FROM THE AUTOBODY SHOP FROM THE REPAIRS IT HAD DONE BECAUSE OF THE INCIDENT ON OCT 20, 2019. I DO NOT FEEL SAFE DRIVING THIS CAR.",
        "vin": "2T1BURHE1JC"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/26/2019",
        "dateOfIncident": "10/20/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271148,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SUNDAY, OCTOBER 20, 2019, APPROXIMATELY 3:10 PM I GOT INTO MY 2018 TOYOTA COROLLA, THE CAR WAS STATIONARY IN PARK, AND WAS NOT RUNNING ON A FLAT SURFACE. I REALIZED I FORGOT MY WALLET SO I GOT OUT OF THE CAR AND LEFT THE DRIVER'S DOOR OPEN. I RETRIEVED MY WALLET WITHIN 1 MINUTE AND WHEN I CAME OUT MY CAR WAS ROLLING SLOWLY ON THE FLAT DRIVEWAY WHERE I PARK EVERY DAY. I TRIED TO GRAB THE DOOR HANDLE TO SEE IF I COULD JUMP IN THE CAR TO STOP IT BUT IT PICKED UP SPEED AND WENT DOWN A SLIGHT INCLINE ACROSS THE YARD. THE DOOR HIT A TREE AND THEN THE CAR LANDED IN BUSHES. MY NEIGHBORS CAME RUNNING OVER BECAUSE THEY SAW THE ENTIRE INCIDENT. I WAS ABLE TO GET INTO THE CAR ON THE PASSENGER SIDE AND I STARTED THE CAR'S ENGINE SINCE IT WAS NEVER TURNED ON AND DROVE IT OUT OF THE BUSHES BACK ONTO THE FLAT DRIVEWAY.  THE CAR ROLLED WHILE THE GEAR WAS IN PARK AND WAS NOT RUNNING. EVERYONE IS NOT SURE WHY THAT WOULD HAPPEN. I'M ASKING TO SEE IF THERE IS A PROBLEM WITH THE TRANSMISSION OR THE GEAR SLIPPING OUT OF GEAR.  I CALLED MY INSURANCE THEY FILED A CLAIM BUT STATED IT WAS VERY STRANGE FOR THE CAR TO HAVE ROLLED AND TOLD ME TO FIND OUT IF THERE WAS A RECALL, ALSO THE ADJUSTER SAID IT WAS VERY STRANGE AS WELL FOR THE CAR TO ROLL IN PARK AND NOT RUNNING. THEY SUGGESTED IT MAY BE SOMETHING WITH THE COMPUTER SYSTEM.",
        "vin": "2T1BURHE1JC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/10/2019",
        "dateOfIncident": "10/08/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267698,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WAS DRIVING FINE FOR MONTHS, THEN OUT OF NOWHERE IT HAD A FUNNY SMELL INSIDE SO I PULLED OVER AND PARKED IT. WHEN I TRIED TO START IT UP AGAIN I DROVE 1 MINUTE DOWN THE STREET AND SHUT OFF. I WAS TOLD THAT MY ENGINE LOCKED UP BY TOYOTA, BUT IT WAS NOT THEIR FAULT OR MINES. BUT THAT I HAVE TO PAY TO FIX IT. THE CAR IS 2018 LESS THAN 25,000 MILES.",
        "vin": "2T1BURHE5JC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/29/2019",
        "dateOfIncident": "09/30/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258823,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE VEHICLE IS IN MOTION WHEN DARK OUTSIDE AUTO HIGH BEAMS DO NOT FUNCTION PROPERLY. WHEN PASSING A ONCOMING CAR WITH BRIGHTER THAN NORMAL HEADLIGHTS THE AUTO HIGH BEAMS DISENGAGE AND WILL NOT TURN ON FOR A VARYING AMOUNT OF TIME. THIS HAPPENS BOTH ON CITY STREETS, HIGHWAY, AND COUNTRY ROADS. THIS IS A SAFETY ISSUE DUE TO THE FACT OF AN INCREASED RISK OF COLLISION DUE TOO REDUCED VISIBILITY. IT ALSO ENHANCES THE RISK OF COLLISION WITH ANIMALS AT NIGHT ESPECIALLY WHEN DRIVING ON SECLUDED COUNTRY ROADS. WHEN CAR WAS TAKEN TO TOYOTA DEALER I WAS GIVEN MULTIPLE EXCUSES ON WHY IT WAS NOT WORKING. THEY KEPT THE CAR OVERNIGHT AND SAID THEY COULD NOT DUPLICATE PROBLEM. WHEN I SHOWED VIDEOS DEMONSTRATING THE PROBLEM AND SCENARIO OF WHEN IT HAPPENS THEY COULD NOT GIVE AN EXPLANATION ON WHY THEY DID NOT ENGAGE IN VARIOUS CIRCUMSTANCES.",
        "vin": "2T1BURHE2JC"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/22/2019",
        "dateOfIncident": "09/22/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257194,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRYING TO BACK UP IN AREA WITH A LOT OF YOUNG CHILDREN AROUND. WHEN I PUT THE VEHICLE IN REVERSE AND LOOKED AT THE CAMERA SCREEN, IT HAD COMPLETELY DIED. I HAVE BEEN UNABLE TO GET THE SCREEN TO WORK SINCE. IT DOES NOT DO ANY GOOD FOR THE NHTSA TO REQUIRE BACK UP CAMERA SYSTEMS IF THEY FAIL AFTER A FEW MONTHS. THE SAFETY BENEFIT OF REQUIRING A SYSTEM ON 2018 VEHICLES IF THE SYSTEM FAILS COMPLETELY BEFORE THE END OF 2019 IS NOT GOOD.",
        "vin": "2T1BURHE4JC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "09/11/2019",
        "dateOfIncident": "08/23/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254835,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2018 TOYOTA COROLLA. WHEN THE CONTACT PLACED HER VEHICLE INTO PARK, THE VEHICLE ACCELERATED WITHOUT WARNING AND THE TACHOMETER LEVEL INCREASED. THE CONTACT ATTEMPTED TO DEPRESS THE BRAKE PEDAL WITH FORCE USING BOTH FEET, BUT THE VEHICLE DID NOT RESPOND AND CRASHED INTO THE WALL OF A CONVENIENT STORE. THE AIR BAGS DID NOT DEPLOY. THERE WERE NO INJURIES. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO A COLLISION LOT WHERE IT WAS DEEMED A TOTAL LOSS. THE MANUFACTURER WAS CONTACTED AND PROVIDED CASE NUMBER: 1908261236. THE DEALER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS APPROXIMATELY 15,438.",
        "vin": "2T1BURHE4JC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/12/2019",
        "dateOfIncident": "07/25/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11243419,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD AN ACCIDENT AND THE AIRBAGS DO NOT DEPLOYED, I ASKED AT KENDALL TOYOTA COLLISION CENTER TO REVIEW WHAT IS THE POSSIBLE CAUSE, THEY DO NOT RESPONSE YET.",
        "vin": "5YFBURHE7JP"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/25/2019",
        "dateOfIncident": "03/03/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234706,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TAMARA INFLATOR. THE CRUISE CONTROL IN MY 2018 TOYOTA COROLLA HAS BEEN MESSED UP EVER SINCE I BOUGHT MY CAR LAST YEAR.I TOLD THE DEALER SHIP ABOUT IT THEY CLAIMED THEY ADJUSTED IT BUT IT STILL INCREASES MY SPEED GOING DOWN HILL AND I'VE GOT A SPEEDING TICKET BECAUSE OF IT.MY DAUGHTER ALSO CALLED TOYOTA MAIN HEAD QUARTERS BUT THEY SAID IF I WANTED IT FIX I WOULD HAVE TO PAY OUT OF MY POCKET..I WILL SET MY CRUISE CONTROL AT 60 ON THE HWY IF I GO DOWN A SMALL. HILL MY RPM AND SPEED GO UP.",
        "vin": "5YFBURHE8JP"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/03/2019",
        "dateOfIncident": "06/25/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229120,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS GOING TO HIS SECOND REPAIR OF PAINT FIRST WAS PAINT BUBLING AMD NOW PAINT PEELING OFF &#128580;. IT'S REALLY DISCOMFORT HAVE A CAR FROM BRAND NEW AND IS GOING TO BE PAINT &#128580;",
        "vin": "5YFBURHE2JP"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "06/24/2019",
        "dateOfIncident": "10/05/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222225,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA COROLLA. THE CONTACT STATED THAT THE FORWARD COLLISION AVOIDANCE SYSTEM WAS MALFUNCTIONING. IN TRAFFIC, WHEN THE ACCELERATOR PEDAL WAS FLOORED AND THE BRAKE PEDAL WAS RELEASED, THE VEHICLE FAILED TO ACCELERATE PAST 5 MPH, WHICH PRESENTED THE RISK OF A POTENTIAL CRASH. PALMER'S TOYOTA (470 SCHILLINGER RD S, MOBILE, AL 36695, (251) 639-0800) WAS NOTIFIED AND STATED THAT A DIAGNOSTIC APPOINTMENT NEEDED TO BE SCHEDULED TO TEST DRIVE THE VEHICLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 700. *BF  *AS",
        "vin": "5YFBPRHEXJP"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/24/2019",
        "dateOfIncident": "04/20/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203382,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "4/20/19, THE DRIVER INVOLVED WITH THIS VEHICLE LOST CONTROL AND HIT A CURB AT 25 MILE PER HOUR, WELL WITHIN THE SPEED LIMIT AT 45 MPH. AFTER HITTING THE CURB, THE VEHICLE SWERVED INTO A TREE. THE FRONT END OF VEHICLE HIT THE TREE AND THE ENTIRE FRONT END OF VEHICLE WAS SEVERELY DAMAGED BEYOND REPAIR. THIS IS CONSIDERED A \"TOTAL LOST.\" THE VEHICLE WAS EQUIPPED WITH FRONT AND SIDE AIRBAGS, BUT SURPRISINGLY NONE WAS DEPLOYED.",
        "vin": "5YFBURHE7KP"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/16/2019",
        "dateOfIncident": "03/15/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196619,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA COROLLA. WHILE OPERATING THE VEHICLE, THE CHECK ENGINE AND POWER STEERING WARNING INDICATORS ILLUMINATED. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE LOCAL DEALER (STONE MOUNTAIN TOYOTA, 4400 STONE MOUNTAIN HWY, MELBOURNE, GA) WAS NOTIFIED OF THE FAILURE. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 6,600.",
        "vin": "5YFBURHE7JP"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/19/2019",
        "dateOfIncident": "03/16/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190123,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2018 TOYOTA COROLLA CRUISE CONTROL IS DANGEROUS. WHEN CRUISE CONTROL IS ON, GOING DOWN A SLIGHT HILL, THE TRANSMISSION DOWNSHIFTS BUT THROTTLE DOES NOT REDUCE CAUSING CAR TO INCREASE SPEED 10-15 MPH WITH HIGH RPMS. AT BOTTOM OF INCLINE TRANSMISSION GOES TO HIGHER GEAR AND BRAKES ARE APPLIED VERY HARD CAUSING VEHICLE TO SUDDENLY AND VIOLENTLY SLOWDOWN 15-20 MPH.   IN THIS SITUATION IF CRUISE CONTROL IS NOT DISENGAGED THE CAR WILL GO WELL OVER THE SPEED LIMIT AND TO AN UNSAFE SPEED FOR THE ROADWAY. THE BRAKING ACTION IS SO SUDDEN AND VIOLENT IT'S DIFFICULT TO CONTROL THE VEHICLE AND HAS SEVERAL  TIMES IN A COUPLE OF MONTHS CAUSED ME TO VERY NEARLY GET REAR ENDED BY A VEHICLE BEHIND ME WHICH WAS NOT  ORIGINALLY FOLLOWING TOO CLOSE.   AS THE DANGEROUS CRUISE CONTROL STARTS ITS INCREASE IN SPEED THE VEHICLES BEHIND MAY INCREASE THEIR SPEED AND AS THEY ARE INCREASING SPEED MY CAR CRUISE CONTROL SYSTEM JAMS ON THE BRAKES AND CAUSE THE FOLLOWING CAR TO COME DANGEROUSLY CLOSE TO COLLISION. AS WELL THE OTHER DRIVER HAS ON AT LEAST ONE OCCASIONS BECAME ANGRY STARTED ROAD RAGING THINKING I HAD PURPOSELY BRAKE CHECKED.   THE 2018 TOYOTA COROLLA CRUISE CONTROL IS DANGEROUS, COULD CERTAINLY BE DEADLY BASED ON MY EXPERIENCE AND FURTHER IS VIRTUALLY UNUSABLE AS A PURCHASED FEATURE ON ANYTHING BUT A FLAT ROAD.    I'VE DRIVEN OVER 20 CARS IN MY LIFE AND AM VERY EXPERIENCED WITH CRUISE CONTROLS IN 6 DIFFERENT MANUFACTURERS CARS. THE CRUISE CONTROL ON MY 2018 TOYOTA COROLLA COULD CAUSE INJURY, LAWSUIT, ROAD RAGE WITH PERSONAL INJURY OR DEATH.   I'VE ALREADY HAD IT TO THE DEALER TWICE AND AM TAKING IT BACK THIS WEEK.",
        "vin": "5YFBURHE7JP"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/17/2019",
        "dateOfIncident": "02/26/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187384,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THEY ASKED ME TO COME TO TOYOTA OF DALLAS TO FILL OUT AN \"UNINTENDED ACCELERATION\" UA REPORT (SEE BELOW).     THE TECHNICIAN BECAME VERY ANGRY ABOUT THIS ISSUE AND TOLD ME THAT THE MANUFACTURER CREATED THE CAR THIS WAY. UNDER ALMOST ANY CIRCUMSTANCE, (GOING AROUND A SHARP CURVE, HEAVY TRAFFIC, ANY DOWNHILL OR UPHILL, WEATHER CONDITIONS, OR FOG) WHEN USING THE CRUISE CONTROL THE CAR WILL TRY TO SLOW IT SELF DOWN FROM SET SPEED AT 65 MPH, BY DROPPING INTO A LOWER GEAR, RAMPING UP THE RPM'S TO 5000 FORCING THE VEHICLE TO ACCELERATE 10 TO 15 MILES OVER THE SET SPEED WHICH WAS SET AT 65 MPH. IN THIS CASE, THE BRAKES WILL NOT STOP THIS ACCELERATION WHILE THE VEHICLE IS AMPING UPWARD. THE ONLY WAY TO STOP THE UNINTENDED ACCELERATION IS TO TURN OFF THE CRUISE CONTROL. HIGHWAY DRIVING FROM CARROLLTON, TEXAS TO WACO, TEXAS ON A CLEAR DAY. MY COMPANY HAS A POLICY THAT COMPANY VEHICLES SHOULD NOT EXCEED 70 MPH. IT IS A FIREABLE OFFENCE.",
        "vin": "5YFBURHE4JP"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/08/2019",
        "dateOfIncident": "11/20/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185007,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I CAN'T KEEP THE ICE BUILDUP OFF MY BACK TIRES DUE TO A PIECE OF PLASTIC HOLDING IT UP UNDER THE WHEEL WELLS. IT'S WEARING MY TIRES OUT FASTER. I HAVE EVEN PRESSURE WASHED IT AND STILL CAN'T GET THE ICE TO COME OUT! THIS IS GOING TO CAUSE MY WHEEL WELLS TO RUST OUT FASTER BY HOLDING IT UNDER MY WELLS. I HAVE ANOTHER COROLLA AND IT DOESN'T HAVE THAT PLASTIC IN THE FRONT PART OF THE REAR TIES!",
        "vin": "2T1BURHE4JC"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/21/2019",
        "dateOfIncident": "02/19/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181618,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER REAR SEAT BELT SNAPPED IN HALF AND RIPPED UP THE MIDDLE OF THE BELT. HALF OF THE SEAT BELT IS HANGING THERE STILL CONNECTED. THIS IS WERE MY 7 YEAR OLD SITS. I REPORTED THIS TO TOYOTA AND THEY SAID THEY WOULD NOT COVER IT THE COST IS OVER $400.00 AND THE BELT THE GUESS MUST HAVE BEEN STUCK OF GRABBED IN THE DOOR IN THE DOOR AND THAT MAKES IT EVEN MORE DEFECTIVE TO HAVE THE DOOR LATCH CLOSE TO THE BELT. I BELIEVE THE BELT IS DEFECTIVE AS THERE ARE SEVERAL SMALL LINES ON THE OTHER SIDE I HAVE HAD 5 TOYOTA'S AND NEVER HAD THIS PROBLEM! SUN TOYOTA NEW PORT RICHEY FLORIDA.",
        "vin": "2T1BURHE1JC"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/21/2019",
        "dateOfIncident": "02/19/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181645,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "IN PAST TOYOTA HAD A RECALL OF REAR PASSENGER SEAT BELTS OF 2.9 MILLION TOYOTA'S. I JUST NOTICED ON MY BRAND NEW TOYOTA COROLLA THAT MY 7 YEAR OLD SPECIAL NEEDS DAUGHTER , IS TORN AND RIPPED. SUN TOYOTA SAID IT WAS BECASUE THE BELT GOT CAUGHT IN THE DOOR. I HAVE A BUMPER TO BUMPER WARRANTY AND NEVER HAD THIS ISSUE WITH MY PAST 4 TOYOTA. THIS IS A DEFECT IN THE BELT AND WERE THE DOOR CAN CLOSE IN THE BELT. A CHILD CANNOT DO THIS DAMAGE. I AM REQUESTING THEY FIX IT FREE OF CHARGE . THERE ARE ALSO THIN SLICES OF THE STRAP ON THE OTHER SIDE OF THE TORN BELT.",
        "vin": "2T1BURHE1JC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/29/2019",
        "dateOfIncident": "01/20/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11172963,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "HIT A DEER AT APPROXIMATELY 60 MPH, FRONT END OF CAR WAS DESTROYED, WAS A TOTAL LOSS. AIR BAGS DID NOT DEPLOY AT ALL",
        "vin": "5YFBURHE8JP"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/11/2019",
        "dateOfIncident": "01/11/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166428,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RPM OF THE CAR JUMPS UPTO 4000 WHEN ATTEMPTING TO SLOW THE CAR ON DOWN HILLS. TOYOTA DEALERSHIPS ARE REFUSING TO ACKNOWLEDGE THE ISSUE BUT THERE ARE CASES MANY PEOPLE GOT THEIR CAR FIXED OR EXCHANGED. THIS PROVES THE ISSUE WHEN USING CRUISE CONTROL. THE IDEAL INTENT OF USING THE CRUISE CONTROL IS TO SAVE GAS MILEAGE AND EFFORT TO DRIVE THE CAR FOR LONG DISTANCES. I HAVE TO TRAVEL LONG DISTANCES TO WORK ON DAILY BASIS. I FEEL VERY UNCOMFORTABLE AND UNSAFE DRIVING THE CAR ON CRUISE. TOYOTA SHOULD ACKNOWLEDGE THE PROBLEM TO SAVE THE TRUST OF THE CUSTOMERS. THIS HAPPENS CONSISTENTLY. I AM TRYING TO CONTACT TOYOTA FOR THE ISSUE. I HOPE TO RECEIVE A POSITIVE RESPONSE.",
        "vin": "5YFBURHE0JP"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/29/2018",
        "dateOfIncident": "11/09/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164041,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DAUGHTER WAS INVOLVED IN A REAR END COLLISION WITH ANOTHER CAR THAT ABRUPTLY STOPPED TO TURN.  SHE WAS ONLY GOING 30 MPH AND HYDO-PLANNED INTO THE CAR AS A RESULT OF THE RAINY CONDITIONS.  THERE WAS MINIMAL DAMAGE DONE TO THE VEHICLE THAT SHE HIT BUT HER CAR SUSTAINED SUBSTANTIAL DAMAGE TO THE FRONT END WHICH CAUSED FRAME DAMAGE.  THE FRONT END OF THE CAR WAS SEVERELY DAMAGED BUT NONE OF THE AIR BAGS DEPLOYED DESPITE DIRECT DAMAGE TO COLLIDING INTO THE STOPPED VEHICLE.",
        "vin": "2T1BURHE5JC"
    },
    {
        "components": "SEAT BELTS,VEHICLE SPEED CONTROL,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/17/2018",
        "dateOfIncident": "12/17/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161629,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 TOYOTA COROLLA. CONSUMER WRITES IN REGARDS TO ALERT/ALARM FOR KEY AND SEAT BELT. *LD    THE CONSUMER STATED THE ALARMS WERE NOT LOUD ENOUGH AND DID NOT SOUND LONG ENOUGH.  *JS    THE CONSUMER STATED THE CRUISE CONTROL WAS INEFFECTIVE. THE CONSUMER STATED IT DID NOT MAINTAIN THE SET SPEED ON AN INCLINE AND DECLINE. THE CONSUMER WAS INFORMED BY THE DEALER AND MANUAL THE VEHICLE WAS OPERATING AS DESIGNED. THE CONSUMER WAS NOT SATISFIED WITH THIS RESPONSE.  *JS",
        "vin": "5YFBURHE1JP"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/02/2018",
        "dateOfIncident": "12/02/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11155482,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE IDLENED AT THE END OF THE STREET IN FROM OF APARTMENT BUILDING PARKING GARAGE AND CONFINED TO DISPOSE OF GARBAGE OUT OF THE DRIVER SIDE DOOR FOR OVER 30 MINUTES. THE DRIVER THEN BACKED UP AND DROVE AWAY LEAVING A MASSIVE PILE OF TRASH.",
        "vin": "JCF 3435"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/13/2018",
        "dateOfIncident": "10/13/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151184,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DOOR HANDLE DRIVER SIDE IS DIFFICULT TO OPEN AND IS DIFFICULT TO CLOSE WHEN INSIDE VEHICLE. I CAN NOT CLOSE DOOR ON DRIVER SIDE CORRECTLY OR IS STILL WILL NOT HOLD OR LOCK. I WILL TAKE VEHICLE TO AMIGO BODY SHOP FOR REPAIR. I WANT TO KNOW IF REPAIR IS WARRANTIED?",
        "vin": "2T1BURHE8HC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/02/2018",
        "dateOfIncident": "07/30/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 1,
        "numberOfInjuries": 1,
        "odiNumber": 11144852,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT STATED THAT THE DRIVER OWNED A 2018 TOYOTA COROLLA. WHILE DRIVING APPROXIMATELY 35 MPH, THE DRIVER LOST CONTROL OF THE VEHICLE AND CRASHED INTO AN EMBANKMENT. THE DRIVER'S AIR BAG FAILED TO DEPLOY. THE DRIVER WAS FATALLY INJURED DUE TO INJURIES TO THE HEAD, CHEST, AND UPPER BODY. THE CONTACT STATED THAT THE DRIVER MAY NOT HAVE BEEN WEARING A SEAT BELT. THE FRONT SEAT PASSENGER SUFFERED INJURIES TO THE CHEST, RIBS, AND COLLAR BONE, WHICH REQUIRED MEDICAL ATTENTION. THE COLUMBIA POLICE DEPARTMENT WAS PRESENT AND FILED REPORT NUMBER: 218158996. THE VEHICLE WAS TOWED TO THE DRIVER'S INSURANCE COMPANY AND DEEMED DESTROYED. THE VEHICLE WAS NOT DIAGNOSED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS NOT AVAILABLE. *DT UPDATED 12/04/18*JB",
        "vin": "5YFBURHE8JP"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/16/2018",
        "dateOfIncident": "07/25/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11140641,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA COROLLA. WHILE DRIVING 35 MPH, ANOTHER VEHICLE CRASHED INTO THE FRONT OF THE CONTACT'S VEHICLE. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS FILED. THE CONTACT DISLOCATED HER RIGHT SHOULDER, SUSTAINED BACK AND NECK INJURIES, AND BRUISES ON THE RIGHT KNEE, WHICH REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS TAKEN TO PAGE TOYOTA (21262 TELEGRAPH RD, SOUTHFIELD, MI 48033, (248) 352-8580) WHERE THE RADIATOR, FRONT BUMPER, FRONT LAMPS, HOOD, AND PASSENGER DOOR WERE REPLACED WITH REFURBISHED PARTS. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 22,705.",
        "vin": "2T1BURHE8JC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/15/2018",
        "dateOfIncident": "10/10/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11140432,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL- I WAS INVOLVED IN A SERIOUS FIVE CAR  ACCIDENT WHICH MY 2018 TOYOTA COROLLA'S AIRBAG DID NOT DEPLOY.",
        "vin": "5YFBURHE1JP"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/02/2018",
        "dateOfIncident": "09/29/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11132872,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA COROLLA. WHILE DRIVING 20 MPH, THE CONTACT'S VEHICLE WAS STRUCK BY ANOTHER VEHICLE ON THE FRONT AND DRIVER SIDES. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS FILED. THE CONTACT FRACTURED TWO VERTEBRAE IN THE NECK THAT REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS TOWED TO BALISE TOYOTA (1399 RIVERDALE ST, WEST SPRINGFIELD, MA 01089, (413) 306-3037), BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 3,300.",
        "vin": "2T1BURHE2JC"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/23/2018",
        "dateOfIncident": "09/20/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130831,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS WILL PROBABLY NOT MAKE THE CUT FOR BIG PROBLEMS, BUT I'M SENDING IT ANYWAY SINCE A GENERAL RUE OR ADVISORY ON DASH REFLECTIVITY MIGHT.    THE 2018 COROLLA TACHOMETER AND SPEEDOMETER HAVE A BRIGHTLY CHROMED BEVEL WITH A PARABOLIC CURVE OF ABOUT 1/4 INCH ALL AROUND THE DIAL THAT CAPTURES THE SUN FROM ALMOST ANY ANGLE AND REFLECTS IT BACK INTO THE DRIVER'S EYE.  LIKE ANY GOOD PARABOLA.  DO YOUNG ENGINEERS NOT KNOW THIS KIND OF BASIC GEOMETRY?  DO THEY NOT KNOW WE LOOKED AT THIS IN THE 50'S AND 60'S?  AS I WAS DRIVING HOME THURSDAY AND THE SUN WAS MODERATELY LOW AT ABOUT 530 PM, I STARTED NOTICING ABOUT A HALF DOZEN OF THOSE PURPLE YELLOW SUNBLIND SPOTS IN MY VISION.  THEY WERE IN VARIOUS STATES OF STRENGTH AND FADE.  I DROVE WITH MY HAND BLOCKING THE SUN FOR THE NEXT 15 MINUTES.  BECAUSE OF THE SHAPE OF THE CHROMED TRIM--PERFECT FOR THE COLLECTION OF LIGHT--I HAD TO HOLD MY HAND VERY CLOSE TO THE SPEEDOMETER TO BLOCK THE STRONG, FOCUSED REFLECTION OF THE SUN.   WAY MORE THAN \"GLARE.\"  VERY PERSISTENT REGARDLESS OF SIGNIFICANT CHANGES IN DIRECTION.",
        "vin": "2T1BURHE3JC"
    },
    {
        "components": "WHEELS,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/13/2018",
        "dateOfIncident": "09/13/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129286,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "GRINDING NOISE WHEN BRAKING AND REVERSING IN CAR UNDER 25 MILES ON ODOMETER. HAVE GONE TO SEVERAL DEALERSHIPS AND HAVE BEEN TLDTHAT I AM BRAKING TOO HARD (SERIOUSLY IN A NEW CAR??) & WINDOW PAEENGER SIDE FRONT MAKES NOISE WHILE GOING UP AND DOWN THEY SAID THEY LUBRICATED IT BUT NOW ITS MAKING MORE NOISE..",
        "vin": "5YFBURHE4JP"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/30/2018",
        "dateOfIncident": "09/06/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123438,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA COROLLA. THE CONTACT STATED THAT THE BRAKE PEDAL TRAVELED TO THE FLOORBOARD OR THE VEHICLE WOULD TAKE A FEW MINUTES TO STOP WHEN THE BRAKE PEDAL WAS DEPRESSED. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO ADRIEL TOYOTA RO GRANDE (PR-3, RO GRANDE, 00745, PUERTO RICO, 1-(787) 627-2424), BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 3,000.",
        "vin": "5YFBURHE0JP"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/23/2018",
        "dateOfIncident": "07/30/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121820,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA COROLLA. WHILE REVERSING AND DRIVING FORWARD, AN ABNORMAL NOISE WAS DETECTED COMING FROM THE BRAKES. THE CONTACT ALSO MENTIONED THAT THE VEHICLE VIBRATED WHEN DRIVING. THE VEHICLE WAS TAKEN TO LIPTON TOYOTA  (1700 W OAKLAND PARK BLVD, FORT LAUDERDALE, FL 33311, (954) 790-6137) WHERE THE CONTACT WAS INFORMED THAT THE VEHICLE WAS DESIGNED TO MAKE THAT NOISE. THE VEHICLE WAS TAKEN TO THE SAME DEALER A SECOND TIME AND WAS INFORMED THAT THERE WAS SPACE IN BETWEEN THE BRAKE PAD FOR WHICH THERE WAS NO REMEDY. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 200.   **TR  CONSUMER STATED IMMEDIATELY AFTER PURCHASE CONTINUOUS ABNORMAL NOISE. THERE'S ALSO NOISE AT TIMES WHEN I TURN ON THE AIR CONDITIONER WHICH I CAN'T IDENTIFY. MAYBE, AS IF THERE IS TOO MUCH STRESS ON THE ENGINE. THE CAR ALSO SOMETIMES VIBRATES WHILE DRIVING. IN ADDITION, WHEN I BOUGHT THE CAR, THE FRONT TIRE ON THE DRIVER'S SIDE WAS ALSO ALMOST FLAT, THEREFORE, CAUSING THE CAR TO KEEP PULLING TO ONE SIDE WHILE DRIVING. FURTHER, THE FRONT WINDOW ON THE DRIVER'S SIDE WAS/IS SQUEAKING. 8/12/18 SENSOR LIGHT KEPT FLASHING. 8/16/18 BRAKE PAD NOISE WAS OBSERVED. CAR COULD NOT BE REPAIRED BECAUSE CAR WAS NOT MAUALLY DESIGNED. UPDATED 10/30/18*JB",
        "vin": "5YFBURHE4JP"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "08/13/2018",
        "dateOfIncident": "07/15/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11119695,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2018 TOYOTA COROLLA. WHILE DRIVING 40 MPH, THE BRAKE PEDAL WAS DEPRESSED, BUT THE BRAKES FAILED TO ENGAGE. AS A RESULT, THE VEHICLE WAS INVOLVED IN A SIDE IMPACT COLLISION. THE AIR BAGS DEPLOYED. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO A SALVAGE YARD WHERE IT WAS DEEMED DESTROYED. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND THE CONTACT WAS INFORMED THAT AN INVESTIGATOR WAS ASSIGNED TO THE CASE. THERE WAS ONE INJURY THAT REQUIRED MEDICAL ATTENTION. THE CONTACT SUFFERED FROM A BROKEN STERNUM, RIGHT HIP INJURY, AND SEVERE PAIN. THE FAILURE MILEAGE WAS APPROXIMATELY 300. *TT  CONSUMER STATED CAR IS STILL NOT DESTROY. TOYOTA AND SAFECO INSURANCE ARE SENDING INVESTIGATOR  TO DETECT THE REASON FOR BRAKE FAILURE. MY WIFE WAS ALSO INJURED IN THIS WRECK WITH BACK INJURY. THE NEW CAR WHEN I BOUGHT ON JULY 6TH,2018 HAD, ALREADY MORE THAN 200 MILES ON IT, JUST 9 DAYS DRIVEN BARELY BEFORE THE BRAKE FAILURE ON JULY 15TH AROUND 10:45AM. UPDATED 10/22/18*JB",
        "vin": "5YFBURHE2JP"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "07/25/2018",
        "dateOfIncident": "06/16/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113749,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 TOYOTA COROLLA. CONSUMER WRITES IN REGARDS TO INAUDIBLE LANE DEPARTURE ASSIST. *LD  *JS",
        "vin": "2T1BURHE2JC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/29/2018",
        "dateOfIncident": "06/21/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104645,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN USING THE RADAR CONTROLLED CRUISE CONTROL, THE ENGINE WILL SOMETIMES REV TO OVER 4000 RPM. A TOYOTA FIELD ENGINEER TOLD ME THAT THIS IS ENGINE BRAKING, BUT THIS OCCURS WHEN THE CAR IS ON A LEVEL STRETCH OF HIGHWAY AT THE SET SPEED AND NO OTHER UNUSUAL CIRCUMSTANCES. THIS EXACT SAME PROBLEM OCCURS WITH MY WIFE'S 2017 COROLLA. I'VE READ A NUMBER OF COMMENTS ON THE TOYOTA OWNERS WEBSITE (HTTPS://WWW.TOYOTA.COM/OWNERS/COMMUNITY/ASK-AN-OWNER/QUESTION-DETAILS/ID/62752030). SOME HAVE EVEN SAID THEIR CARS SPEED UP WHEN THIS PHENOMENON HAPPENS. THIS HAS HAPPENED CONSISTENTLY EVERY TIME I'VE USED THE  CRUISE CONTROL SINCE I TOOK DELIVERY OF THE CAR ON 12/1/2017, AND IT HAPPENS MULTIPLE TIMES PER TRIP. THE DATE I ENTERED BELOW IN THIS FORM WAS ONLY THE LATEST OCCURRENCE.",
        "vin": "2T1BURHE6JC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/27/2018",
        "dateOfIncident": "05/18/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11098194,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BLIND  SPOT   CAN NOT  SEE ON  COMING  MOVING  VEHICLES  WHEN  BACKING IN A  PARKING  SPACE AND BACKING  OUT,  HIGHLY  POTENTIAL ACCIDENT  DESIGN  , OF THE REAR SEAT HEAD REST  TOO TALL BLOCKING  OVER HALF THE HEIGHT   OF THE  REAR  GLASS,  HUGE  BLIND  SPOT  FEEL TO TENSE  TO TRY TO PARK IT BY  BACKING  IN.,AND   BACK OUT  OF PARKING SPACE. HAD IT NOT  BEEN  FOR  ANOTHER  GOOD DEFENSIVE  DRIVER  THE  CAR WOULD HAVE HIT  BE, ONLY OWNED THIS CAR  LESS THAN A  MONTH  AND  TRIED TO GET  DEALER SHIP  TO  LET  ME HAVE A DIFFERENT  DESIGNED  CAR AND THEY REFUSED , ,CALLING  INSURANCE  COMPANY AND TALK TO THEM  AND SEE  IF I SHOULD  CONTINUE  DRIVING THIS  VEHICLE,  IF THEY SAY  NO  THEN  I'M TELLING TOYOTA  TO  COME AND GET IT.I'M NOT  PAYING  30,000 FOR AN UNSAFE CAR.TO  DRIVE.",
        "vin": "2T1BURHE4JC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/18/2018",
        "dateOfIncident": "04/07/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11088789,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CRUISE CONTROL SYSTEM IS DESIGNED SO THE ENGINE AND TRANSMISSION DOWN SHIFTS WHEN THE SYSTEM IS ENGAGED AND GOING DOWN HILLS. THIS PUTS MUCH MORE WEAR AND TEAR ON BOTH THE ENGINE AND TRANSMISSION. IN ADDITION TO THE DOWN SHIFT THE RPM GOES TO OVER 4000 IN AN ATTEMPT TO SLOW THE CAR. THIS IS COMPLETELY UNNECESSARY AND DRASTICALLY REDUCES GAS MILEAGE, WHICH IS EXACTLY OPPOSITE OF THE ORIGINAL INTENT OF THE CRUISE CONTROL WHICH WAS BETTER GAS MILEAGE AND PEACE OF MIND TO NOT SPEED. THE SPEED DOES GO UP 5 MILES PER HOUR WHEN THIS HAPPENS. BOTTOM LINE IS THE ENGINEERS AND THEIR BOSSES WHO APPROVED THIS SYSTEM ARE ALL IDIOTS AND SHOULD BE FIRED. YOU WOULD ASSUME YOU WOULD GET BETTER GAS MILEAGE WHEN GOING DOWN HILL WHEN THE ENGINE WOULD DISENGAGE BECAUSE YOU WOULD NEED LESS POWER AND NOT MORE TO MAINTAIN A CERTAIN SPEED. I WAS INFORMED BY THE DEALER THE CRUISE CONTROL IS DESIGNED TO OPERATE BY GEARING DOWN, I TOLD HIM NO MANUFACTURE IS THAT STUPID.HE THEN PROVED ME WRONG BY SHOWING ME THE MANUAL PROVING TOYOTA IS THAT STUPID.I WOULD HAVE NEVER PURCHASED THIS CAR HAD I KNOWN THIS FEATURE WAS DESIGNED IN THIS WAY. WHO KNOWS WHAT OTHER SYSTEMS IN THIS COROLLA ARE DESIGNED IN SUCH A STUPID MANNER. I WILL CERTAINLY NEVER BUY ANOTHER AUTO FROM THIS COMPANY.",
        "vin": "5YFBURHE6JP"
    }
]