[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/22/2022",
        "dateOfIncident": "08/15/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457861,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Toyota RAV4. The contact stated while driving at 30 MPH, the brake warning light and an unknown triangle warning light illuminated. The contact continued to drive the vehicle. The vehicle was taken to an independent mechanic but was not diagnosed or repaired. The vehicle was then taken to the dealer where it was diagnosed that rodents had been chewing through the soy-based wiring. The vehicle was repaired; however, the failure reoccurred seven months later. The vehicle was taken to the dealer where it was diagnosed that rodents had been chewing through the soy-based wiring again. The vehicle was not repaired. The manufacturer was not notified of the failure. The failure mileage was approximately 25,000. The VIN was not available.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/11/2022",
        "dateOfIncident": "03/09/2022",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456293,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owned a 2018 Toyota Rav4. The contact stated while driving approximately at 35 MPH, the vehicle suddenly shut down completely. Prior to the shutdown, the instrument panel continuously was flashing. The contact drove safely to the side of the highway. The contact noticed smoke and fire being exhausted from under the driver side of the engine. The contact notified 911, and the fire department arrived on the scene. The fire department extinguished the fire with water and a fire extinguisher. There was a fire department report filed. There were no injuries sustained. The vehicle was towed to a tow lot. The fire department and towing company informed the contact the vehicle was completely lost. The approximate failure mileage was 68,000",
        "vin": "2T3WFREV1JW"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/19/2022",
        "dateOfIncident": "04/15/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452976,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving on a 50 mph Highway with the cruise control on and no vehicles or anything in front of the car for more than a half a mile the vehicle braked suddenly as if the system sensed it was going to hit something. I pulled off the road shut the car off and restarted the car and it operated normally after that. I would be concerned of a rear Collision due to this occurring for no reason",
        "vin": "JTMWFREV5JJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/07/2022",
        "dateOfIncident": "02/04/2022",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450795,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owned a 2018 Toyota Rav4. The contact stated that while idling in the pharmacy drive-through line, smoke was suddenly present coming from under the hood of the vehicle. The vehicle was quickly parked before flames were seen coming from the engine compartment. The fire department was called to the scene and extinguished the flames. During the incident, the vehicle was destroyed. No injuries were reported. A fire report was taken at the scene. The cause of the fire was not yet determined.  The manufacturer and local dealer were notified of the incident. The failure mileage was 49,000",
        "vin": "JTMZFREV6JJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/06/2022",
        "dateOfIncident": "02/05/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450661,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I was told by the Toyota dealer that my vehicle was subject to a safety recall regarding the wrong size battery having been installed and the battery must be replaced with the correct size. I was also told that I must pay for the cost of the new battery and installation. I told the service rep that I should not have to pay for any safety recall repair. Despite my objection, I was charged and had to pay for the required safety recall repair.",
        "vin": "JTMNFREV4JJ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/20/2022",
        "dateOfIncident": "10/04/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448176,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I the vehicle used with 20000 miles the brakes were mushy And made noise like that old school bus with no brake pads at all I checked for any recalls the Run none and I contacted Toyota with no result I researched on the internet and found that it was a bad batch of brake pads on several years including my particular year of 2018 the brake pedal becomes mushy the brakes make a lot of bought noise and it's possible for the brake pedal to go all the way to the floor however there is no recall as of yet on this problem can you please help Thank you Bruce Long",
        "vin": "2T3BFREVXJW"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/10/2022",
        "dateOfIncident": "05/16/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446900,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Toyota RAV4. The contact stated that while driving at 30 MPH and attempting to pass another vehicle, the accelerator pedal was depressed but the vehicle failed to respond. The contact depressed the accelerator pedal all the way to the floorboard and the vehicle responded after approximately 5 seconds. There were no warning lights illuminated. The contact continued to drive the vehicle. The vehicle was taken to an unnamed dealer three times to be diagnosed; however, the mechanic found no issues with the vehicle. The contact stated that the failure had been reoccurring while driving. The contact stated that while he was driving 60 MPH on the interstate, the failure reoccurred. The contact depressed the accelerator pedal all the way to the floorboard, but the vehicle failed to respond. The contact veered to the side of the road for a moment, then he continued to drive the vehicle. The vehicle was next taken to Northshore Toyota Sales (68500 Hwy 190 Service Rd, Covington, LA 70433) who diagnosed that no issues were found. The manufacturer was notified of the failure and referred the contact to the dealer. The vehicle was not repaired. The failure mileage was approximately 11,489.",
        "vin": "2T3WFREV4JW"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/07/2022",
        "dateOfIncident": "12/01/2021",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446629,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "The contact owns a 2018 Toyota Rav4 equipped with an aftermarket Pacific Restyling heated seat kit, part #SH-R-05 which was installed on both the front driver and passenger seats by the dealer upon purchasing the vehicle as new. The contact indicated while operating the vehicle with the driver side seat heater turned on the driver noticed the seat became extremely hot to the touch and turned the heater off. Moments later an electrical burning odor was present inside the cabin of the vehicle. The vehicle was taken to the local dealer who discovered the aftermarket part had malfunctioned and overheated charring the driver side seat cushion. The cause of the failure was not determined. The manufacturer was not yet notified of the failure. The failure mileage was 18,000.",
        "vin": "JTMRFREV1JJ"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/24/2021",
        "dateOfIncident": "12/24/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444919,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "DUNLOP",
                "productModel": "SIGNATURE II",
                "productYear": "9999",
                "size": "225/65R17",
                "type": "Tire"
            }
        ],
        "summary": "I bought this car in 2018, I drive 4 miles per day more or less , I have only 25,486 miles and today during a regular inspection I found that my tires tread are on yellow 6/32\", just the front (where I have Front Wheel Drive). Not sure how driving only in town can quickly wear a tire, by the time I pay off this car I will be with an expensive bill for change the tires. I had an used Subaru for 5 years and I never had to change the tires during 5 years, and I drove way more than Toyota, had 89,000 when the gaskets blew off. Not sure why car/tires companies make crap products to make us pay often.",
        "vin": "JTMZFREV1JJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/24/2021",
        "dateOfIncident": "12/24/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444921,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving I have noticed that the car slow down the speed near other cars, I understand that is the accident prevention feature, but when I was stopped at red light, I press the accelerator lightly, the car sped off, I have my daughter in the car and she told me Why are you accelerating  mom? I told her I wasn't, my foot was off the accelerator and the car still speeding off. I pressed the breaks and it slow down. I do not feel safe with this car, but I have to use it, as I still have to finish paying it. My battery was replaced today, I had to pay for it, 3 years and gone! They told me it is because I do not drive much daily. My front tires are on yellow tread, not sure how driving 4-8 miles per day can cause all of this damage. I am so tired of car companies sell crappie cars. I had a Subaru before that almost burned (head gasket), of course, when I was finishing paying that happened. By the way I see by the time I finish paying Toyota, many things will need to be replaced, if I do not get into an accident because of weirdness of the car slowing down or speeding. For sure my next car won't be Toyota for safety reasons!",
        "vin": "JTMZFREV1JJ"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/23/2021",
        "dateOfIncident": "12/22/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444821,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Car moved onto gravel shoulder and side curtain airbags deployed. Was no accident or damage done to car, was also driving under 5 mph.",
        "vin": "2t3rfrev7jw"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/06/2021",
        "dateOfIncident": "11/04/2021",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442924,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owned a 2018 Toyota Rav4. The contact stated that while driving at 20-25 MPH and making a turn into a parking lot, the vehicle intermittently lost power steering and electrical power twice. The contact continued to drive and as she drove over a speed bump, the vehicle stalled and lost electrical power. There were no warning lights illuminated. The contact stated that she saw smoke coming out from underneath the hood of the vehicle. The contact quickly exited the vehicle and noticed that the vehicle was on fire. The contact did not sustain any injuries. The contact was able to extinguish the fire with the assistance of the fire department. A police report was filed. The vehicle was towed to a tow lot, where it was totaled. The  Chevrolet dealer who sold the vehicle to the contact was notified of the failure. The manufacturer was not notified of the failure. The approximate failure mileage was 107,000.",
        "vin": "2T3ZFREV2JW"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/04/2021",
        "dateOfIncident": "07/06/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442693,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I had been noticing since November 2020 a strange noise from the rear on the driver side anytime I parked the car, as it goes over a step about 2 inches in height when entering it. I took it to the dealer an explained them that it wasn't just the noise but that I could move with my hands the rear tire on the driver side back and forth.  They told me NO PROBLEM FOUND. Also, that day I did have a wheel alignment done just in case.  But I returned days later as it was not balance, the steering felt incorrect pulling right and left. And they tell me that the right front lower control arm needs replacement when the car has been driven 23,062 miles; I replaced it but the steering was still incorrect. I called TOYOTA (800) 331-4331 a case #210730001337 was opened. I was told to buy 3 new tires to correct the problem, I did it, yet the problem continues. I expected the dealer to do a wheel alignment after replacing the tires yet they lie about and they wanted me to drive away, I refused to do it and   called TOYOTA and offered to pay for it and finally they agreed on doing it free and they found out that the rear alignment was off. Poor craftsmanship of the rear suspension parts for sure. That weird noise on the rear continues, the steering pulls right and left which increases risk of losing control and eventual crash and injury.  I do trust the NHTSA to make things right do not be like BOEING and the FAA.",
        "vin": "JTMZFREV2JJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/24/2021",
        "dateOfIncident": "11/23/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441552,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving and heard a loud noise like ice cracking from the roof. The shade covering the moonroof started to vibrate. When I was able to safely pull over, I saw that the moonroof glass had exploded. There was no object that struck the car, but the glass was completely shattered. Pieces of glass flew off the roof before I was able to pull over, putting other drivers at risk. If the shade had not been closed, pieces of glass would have fallen on me.   In doing research, it looks like this has happened to many other Rav4 owners.   The vehicle passed its state inspection in June and had an oil change at an auto repair shop less than a month ago, and no warnings were given. There were no warning lamps, messages, or other symptoms, and I had not tried to operate the moonroof while driving--the glass just exploded.",
        "vin": "jtmrjrev6jd"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/18/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440878,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Toyota RAV4. The contact stated that upon exiting a parking lot, with the brake pedal depressed to the floorboard the vehicle independently accelerated without warning. The contact was forced to engage the parking brake to stop the vehicle. Once the vehicle was stopped, the contact was able to resume normal driving. After the initial failure, the contact experienced the failure on two separate occasions. The contact had taken the vehicle to the dealer however, the mechanic was unable to diagnose the failure. The vehicle remained in possession of the dealer. The manufacturer had been notified of the failure and informed her that there were no recalls on the VIN. The vehicle was not repaired. The failure mileage was approximately 18,000.",
        "vin": "2t3zfrev1jw"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/17/2021",
        "dateOfIncident": "11/14/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440763,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "One day, after the car was sitting in my garage for a week, I drove it and found that the driver side rear wheel stopped turning. I noticed grease on the inside wall of the rim of this wheel. The rim of the other wheels are clean. I tried a few more times wiggling it back and forth and the wheel was still stuck.  Two days later a tow truck driver came and he tried a few more times and was able to get the wheel freed. But then when driving it, there is noise from the wheel.",
        "vin": "JTMYFREV6JD"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/16/2021",
        "dateOfIncident": "11/15/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440730,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "This is the second time it has happened, the car completely shut off and nothing worked. The first time does happen our battery was two years old and we were told to change it. After changing the battery the car worked. Six months later the car completely shut off while driving. AAA came and said it was not an issue with the battery but rather the wiring. He played around with the wiring in the car somehow turned on. This is very dangerous because it happened on the freeway. There are some fault with the wiring on this model.",
        "vin": "JTMRFREV2jj"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/19/2021",
        "dateOfIncident": "10/19/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437287,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Multiple times the cars front left sensor when wet, after heavy rains, will beep and flash on dash for no reason. I turn off the back up assist function and the beeping stops. Also, the rav won't engage drive on occasion when going from park to drive. After waiting a bit of time, drive appears on dash and car will go. Just this Saturday (10-16-21) after this p to d problem occurred, the engine lost ALL POWER, and drive turned off In traffic. I had to push the car out of busy 3 lane traffic while my friend turned the wheel. after 10 minutes it again engaged and we drove it home. My fear is if this electric issue occurs when Iam going 70 mph, I may crash and injure myself or others. Dealer to look at. VERY SCARY!",
        "vin": "JTMDJREV5JD"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/14/2021",
        "dateOfIncident": "10/14/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436852,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The car lost the power and speed and got an error \"AWD sytem malfunction, 2WD mode engage, see dealer\". Car stopped and then did not restart. Itis dangerous situation where car lost the speed a d power the middle of the road in traffic.",
        "vin": "2t3bfrev7jw"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/13/2021",
        "dateOfIncident": "08/25/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11436562,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle sustained total loss due to unexplained deployment of side airbags when collision was limited to the front.  Toyota was asked to check and their response did not address my concerns about the unnecessary deployment.   I had expressed concern about the pre-collision warning/emergency braking systems in e-mails with my Toyota dealership well in advance of the accident.  It appeared to not be triggered although they said it was working.  The files/photos are on another device.  I can supply upon request.",
        "vin": "JTMWFREV1JJ"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/28/2021",
        "dateOfIncident": "09/05/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434711,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Was driving down the highway at 70 MPH and moon roof glass exploded out of nowhere. There were no warning signs and nothing struck the vehicle before the glass shattered.",
        "vin": "JTMWFREV8JJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/23/2021",
        "dateOfIncident": "08/24/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434084,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Toyota Rav4.  The contact stated while the vehicle was parked, the contact attempted to start the vehicle however, the vehicle would not start. The contact had the vehicle towed to a local dealer to be diagnosed. The contact was informed that the battery was drained and needed to be replaced. The dealer replaced the battery however, the failure recurred several weeks later. The vehicle was towed back to dealer who inspected the vehicle again and diagnosed that the battery was not charging correctly due to the high-power amp fuse being blown. The vehicle was not repaired. The manufacturer was made aware of the failure. The failure mileage was approximately 28,600.",
        "vin": "JTMZFREV9JJ"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/27/2021",
        "dateOfIncident": "08/16/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430736,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Michelin North America, Inc.",
                "productMake": "MICHELIN",
                "productModel": "LATITUDE TOUR HP",
                "productYear": "9999",
                "size": "225/65R17",
                "type": "Tire"
            }
        ],
        "summary": "Michelin latitude tour HP i-225/65r17 I am writing to you in order to let you know that  I bought this used Toyota Rav4 2018 with 28,000 miles. I was told that the tires were new. One of the tires was  not new and had already been fixed before, certainly not in a safe way. I just want you to know and report it to Toyota, I would have appreciated them if they had told me the truth since in that car I ride my daughters. Happy afternoon.",
        "vin": "2T3RFREV2JW"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL,FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "08/24/2021",
        "dateOfIncident": "08/10/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11430371,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I was turning into a parking spot at my doctor's office when my car engine revved up and sped through the doctor's office nearly hitting my doctor and another patient. My airbags did not deploy. I had my foot on the brake but it did not stop the car. The automatic emergency braking system and forward collision warning did not work. My car had to be towed and is now waiting to see if it can be fixed but with the safety features that I paid extra for, I'm not sure that I would even buy a new one of this particular model.  I came very close to killing my doctor and that patient!",
        "vin": "JTMDJREV1JD"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/23/2021",
        "dateOfIncident": "08/21/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430198,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Back up camera fills with Water. when it rains and cannot see from it til it dries out a few days after rain and even then it’s cloudy probsbly due to rain getting into it",
        "vin": "2t3jfrev0jw"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/12/2021",
        "dateOfIncident": "08/12/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428858,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The Electric Power System warning light came on for the first time and my car will not start.",
        "vin": "2T3ZFREV4JW"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "08/10/2021",
        "dateOfIncident": "06/09/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428580,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The first incident happened on June 9, 2021. I was turning right very slowly into a parking spot at a grocery store when the car suddenly accelerated rapidly, even when I depressed the brake very hard. My car hit a row of small trees that formed a border between the parking lot and the street. The impact was so hard that there was over $5,000 in damage to the front of the car. I was in shock as it felt like the car was out of control. The second incident July 27, 2021. Again, I was turning right to reach the exit of a parking garage at a medical clinic. I was going very slow because I was approaching the ticket booth to exit the parking garage. Just as I completed the turn, the car accelerated and lurched forward toward the arm that keeps cars from exiting. I was able to stop the vehicle by pressing the brake hard, and I did not hit the arm at the exit point. Again, it was shocking and very frightening for this to happen.",
        "vin": "JTMRJREV6JD"
    },
    {
        "components": "EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": true,
        "dateComplaintFiled": "07/21/2021",
        "dateOfIncident": "04/08/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425889,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The headlights on my Rav4 are dangerous. When driving at night there is a dark line with no visibility. There is no reaction time if  objects are in the roadway. I live in a rural area, on my way to work there was a pine tree that fell across the road way,I crashed straight into it. I did not even see it until I hit it.",
        "vin": "2T3RFREV9JW"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "07/19/2021",
        "dateOfIncident": "06/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425473,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Toyota RAV4. The contact stated when shifting gears to reverse, the back over prevention camera failed to function as designed. The contact stated he shifted the gear to park and back to reverse and the camera operated as designed. There was no warning light illuminated. The vehicle was not diagnosed nor repaired. A dealer was not contacted. The manufacturer had not been informed of the failure. The failure mileage was approximately 70,000.",
        "vin": "2T3WFREV6JW"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "07/14/2021",
        "dateOfIncident": "06/12/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11424863,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The Toyota RAV4 2018 car acceleration went out of control and crashed into a retaining wall.  The airbags exploded and the steering wheel airbag burst.  The car was totaled and is with State Farm.  I was blessed to still be alive the car speed out of control on its own.  I tried to push on the brakes but the car kept going.  The accident could have been worse.  No one else was injured only another car was hit.  I did reach out to Toyota and they said it could take 4-6 weeks for someone to look at the car.  I reach out to the dealer and waiting to hear back from the dealer.  The police department issued me a ticket, I have court on July 23, 2021.  State Farm insurance declared the car a total loss. No warning lamps or messages.  The first same incident happened on April 3, 2021, and on June 12, 2021, was the day of the accident. The incident and accident happened at the same location.   I would like to speak with someone at your organization. The car is at State Farm's collision place. I would like for your organization to look at the car.  I will call to make sure that the car is still at the collision place.",
        "vin": "JTMRFREV5JJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/11/2021",
        "dateOfIncident": "07/10/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424318,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 hybrid battery does not hold charge. Sometimes the battery dies even where it should be fully charged and driving. Drove 5 hours straight on 7/10. Does on the highway. The car battery has been dying almost from day 1 . This car is only 2 1/2 and only 20, 000 miles .",
        "vin": "JTMDJREV3JD"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/24/2021",
        "dateOfIncident": "06/24/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422115,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "When I tried to start my vehicle this morning after a store run. the car clicked multiple times and made a weird noise, then went dead. I popped my hood immediately and saw a hole the size of a quarter next to the battery terminal and smoke was coming out the hole.  I had driven it 40 miles before I had put it in park, and it drove fine before that.  I have showed multiple people pictures of the battery (including mechanics) and no one had ever seen anything like that. I decided to google to see if it's a known problem/recall on the Rav4 and found that the NHTSA was investigating the batteries due to similar instances.  Thankfully my car did not catch fire, and I was smart and decided not to start it again. Otherwise something bad could have happened.",
        "vin": "2T3RFREV9JW"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/07/2021",
        "dateOfIncident": "06/04/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11420037,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "06/04/21...I Had a Hit & Run Head On Collision(Side Swipe), As I Was Swerving To Avoid Oncoming Traffic & Get A Handle Of the Vehicle, No Warning Lights Came On. I Hit a Wall. My Front Nor Side Airbags Deployed. It What was A Very Forceful Hit From The Other Vehicle & Hitting The Wall. The Vehicle Is Being Inspected By My Insurance Adjuster Tomorrow.",
        "vin": "jtmrfrev3jd"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/19/2021",
        "dateOfIncident": "05/15/2021",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417783,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "We were driving when I made a right turn and suddenly the steering wheel locked on me and at the same time various warning lights lit up on my dashboard.  The car slowed and I was able to regain control of the steering wheel to pull over.  After driving a few miles further we once again came to a right turn and everything happened as before except with greater intensity.  We tried to straighten the steering wheel for control and were able to pull over into an empty parking lot.  By the time we came to a stop, which took all of just one or two minutes, smoke was coming out from under our hood.  We quickly got out of our car and opened the hood to see the battery in flames.  I called 911 while my husband poured his cup of water over the flames.  It stalled the fire but it continued to spark until help arrived.   I am certain if we had not had water the whole car would have caught on fire.   The car was towed to a Toyota dealership where we were told that their was an issue with battery installation.  At present it is being worked on but I have lost confidence in this vehicle  especially since we got no warning that there was a problem and we could have been badly injured or killed if the circumstances had been different and we had not been able to pull over and get out or have water with us.     We have since learned that this is an issue for many people who own this 2018 RAV4 vehicle.  I also learned there is no recall on this issue.  I hope that Toyota isn't waiting for someone to be seriously injured or die before they fix this problem.",
        "vin": "JTMZFREV5JJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/12/2021",
        "dateOfIncident": "05/11/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416227,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS WAITING AT THE TRAFFIC LIGHT TO TURN GREEN ONCE IT DID I PRESSED THE GAS PEDAL TO GO AND THE VEHICLE STALL AND LOST POWER COMPLETELY AND GAVE A MESSAGE SAYING POWER FAILURE AND A PICTURE OF A BATTERY AFTER THIS HAPPENED THE VEHICLE WAS ABLE TO START BACK UP",
        "vin": "2T3RFREV0JW"
    },
    {
        "components": "VEHICLE SPEED CONTROL,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "05/05/2021",
        "dateOfIncident": "04/30/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415226,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS ON CRUISE CONTROL, DUE TO A CAR IN FRONT, IT WAS DRIVING 10 MILE BELOW THE CRUISE CONTROL SPEED. A NEW CAR CAME IN BETWEEN MY CAR AND THE PREVIOUS CAR IN FRONT, MY CAR STARTED SPEEDING UP SUDDENLY. I HIT THE BREAK AND CANCELED CRUISE CONTROL IMMEDIATELY TO PREVENT CRASH. THIS HAS HAPPENED AT LEAST 6 TIMES DO FAR. ONLY SEEM TO HAPPEN RARELY WHEN SOME NEW OBJECT COMES IN BETWEEN.",
        "vin": "2T3RFREV6JW"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/11/2021",
        "dateOfIncident": "04/11/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407481,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STARTED STALLING WHOLE IN MOTION YESTERDAY.  I HAVEN'T THOUGHT TOO MUCH ABOUT IT.  TODAY IN MY 3RD DRIVE OF THE DAY AFTER I STOP AT A RESTAURANT, I START THE CAR TO THE SURPRISE IT JUST STALLED AND GIVE ME CHARGING SYSTEM MALFUNCTION    I TRY TO START IT AGAIN WITH NO LUCK.  I'M FAR FROM HOME   I CALL THE LOCAL DEALERSHIP AND IS CLOSED.  I WILL HAVE TO WAIT TOMORROW MORNING TO TOW THE CAR TO THEM.    I WASN'T EXPECTING THIS TO HAPPEN IN A TOYOTA VEHICLE ONLY 3 YEAR OLDER.   LAST YEAR THEY CHANGE THE BATTERY BECAUSE IT LET ME STRANDED   SOMETHING WRONG WITH THE ELECTRIC SYSTEM FOR SURE.",
        "vin": "2T3NFREV9JW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/03/2021",
        "dateOfIncident": "11/30/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406221,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE USE PURCHASED IN DEC '18. IN DEC '19 THE BATTERY WENT DEAD AND WAS REPLACED. TOYOTA SAID THE BATTERY HAD A BAD CELL.. IN APR '20 THE BATTERY WENT BAD AGAIN AND WAS REPLACED. TOYOTA SAID THE WRONG SIZE BATTERY WAS INSTALLED THE LAST TIME. IN AUG '20 THE BATTERY WENT BAD AGAIN AND WAS REPLACED, TOYOTA SAID IT WAS BECAUSE OF A GPS DEVISE THAT WAS INSTALLED BY THE SELLING DEALERSHIP AND WAS NEVER MADE AWARE TO THE BUYER. IN DEC '20 THE BATTERY WENT BAD AGAIN AND WAS REPLACED. THIS TIME TOYOTA SAID IT WAS BECAUSE THE CAR WAS NOT BEING DRIVEN ENOUGH. THE DRIVING PATTERN HAS BEEN THE SAME WITH THIS VEHICLE SINCE IT WAS PURCHASED. IF THAT WAS THE PROBLEM THEN WHY WAS IT NOT A PROBLEM IN THE FIRST YEAR OF OWNERSHIP. ALSO IT WAS NOT A PROBLEM WITH THE PREVIOUS VEHICLE THAT WAS USED AS A TRADE-IN ON THIS VEHICLE. THERE SEEMS TO BE AN OBVIOUS PROBLEM WITH THE ELECTRICAL SYSTEM OF THE VEHICLE.",
        "vin": "2T3RFREV5JW"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/29/2021",
        "dateOfIncident": "03/18/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11405343,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2018 TOYOTA RAV-4. WHILE DRIVING AT 55 MPH, ANOTHER VEHICLE FAILED TO YIELD WHILE TURNING INTO THE LEFT LANE COLLIDING INTO THE CONTACT'S VEHICLE. AS A RESULT, THE CONTACT CRASHED INTO ANOTHER VEHICLE ON THE PASSENGER SIDE OF THE VEHICLE. THE DRIVER SIDE CURTIN AIR BAG AND DRIVER FRONT AIR BAG FAILED TO DEPLOY. THE CONTACT HAD A FRACTURED A FINGER ON HER RIGHT HAND, CHEST CONTUSIONS AND RIGHT KNEE BRUISE. MEDICAL ATTENTION WAS RECEIVED. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED AND DEEMED TOTAL LOSS HOWEVER THE EVALUATION WAS NOT COMPLETED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE.  THE DEALER WAS NOT CONTACTED. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE APPROXIMATE FAILURE MILEAGE WAS 42,000.",
        "vin": "2T3DFREV0JW"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/29/2021",
        "dateOfIncident": "03/28/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405352,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE EVENING OF SUNDAY, MARCH 28TH, 2021 I WAS DRIVING ON INTERSTATE 84 IN IDAHO NEAR WENDELL, AT APPROXIMATELY 83 MPH WHEN THE SUNROOF OF MY 2018 RAV4 EXPLODED WITHOUT ANY WARNING. LUCKILY THE SHADE PANEL WAS DRAWN, SO NO GLASS DEBRIS WENT INTO THE CAR. MY HUSBAND WAS IN THE PASSENGER SEAT, AND OUR 16 YR OLD DAUGHTER WAS SITTING BEHIND HIM.     WHEN I FIRST HEARD THE EXPLOSION, I THOUGHT WE HAD A TIRE BLOWOUT, BUT I DIDN'T FEEL A PULL ON THE STEERING WHEEL. MY NEXT THOUGHT WAS THAT THE RV NEXT TO ME HAD A BLOWOUT, BUT THEY KEPT ON DRIVING. WE COULD HEAR A LOT OF WIND COMING FROM THE SUNROOF, SO I PULLED OVER AT THE NEXT EXIT, WHICH WAS CLOSE, AND ASSESSED THE SITUATION. THE SUNROOF WAS GONE! THE REMAINING GLASS AROUND THE EDGES WAS ALL CRACKED AND CURVED UPWARDS, SO IT WAS OBVIOUS THAT IT HAD EXPLODED FROM THE INSIDE OUT. THERE WAS ALSO A LOT OF GLASS DEBRIS INSIDE THE SHADE PANEL. NOBODY PULLED OVER AND APPROACHED US, SO WE DON'T BELIEVE THERE WERE ANY EYE WITNESSES.    WE WERE ON OUR WAY HOME TO BOISE AFTER SPENDING SPRING BREAK IN UTAH. WE CONTINUED DRIVING THE REMAINING 2 HRS. HOME, WITH MY HUSBAND HOLDING THE SHADE PANEL CLOSED, SINCE WE WERE AFRAID IT MY GET SUCKED OUT. THE WIND WAS PRETTY DEAFENING. THE WEATHER CONDITIONS AT THE TIME WERE CLEAR AND SUNNY, 75* WITH STRONG WINDS. WE WERE NOT AWARE OF ANY FLYING DEBRIS, NOR DID WE HEAR ANYTHING HIT THE CAR BEFORE THE EXPLOSION.",
        "vin": "JTMDJREV0JD"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/18/2021",
        "dateOfIncident": "03/16/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403717,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTING LATE AUG2020 THE DASHBOARD STARTING TO SHOW WARNING LIGHTS RANDOMLY AND INCONSISTENTLY. ALL WARNING LIGHTS DO NOT COME AT THE SAME TIME BUT WHEN TURNING THE EXTERNAL LIGHTS ON OTHER WARNING LIGHTS TURN ON AND SO FAR THE CAR HAVE STALLED MORE THAN 4 TIMES WHILE DRIVING UNDER 40 MPH. THE LAST 3 TIMES THE CAR STARTED RIGHT AFTER BEING PARKED AND BUT THIS LAST TIME IT DID NOT AND WHILE I WAS WAITING FOR A TOW ALMOST HAD AN ACCIDENT FROM BEHIND ME AS THE CAR THAT WAS COMING BEHIND ME STOPPED AND WAS HIT BY ANOTHER CAR BEHIND HIM. I TOOK IT TO THE DEALER AND SINCE IT IS OUT OF WARRANTY THEY WOULD NOT TOUCH IT AND ALL THEY DID WAS DISCONNECT THE BATTERY SO THE WARRANTING LIGHTS TURN OFF AND SEND ME BACK OUT AND WITH IN 15 MIN ON THE ROAD THE LIGHTS STARTED TO COMEBACK  ON AGAIN BUT THE CAR DID NOT DIE ON THE ROAD. THE CAR IS BARELY 3 YEARS OLD AND ONLY HAVE 14,500 MILES ON IT AND IT IS BECOMING VERY UNRELIABLE TO DRIVE.",
        "vin": "JTMWFREV1JJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/14/2021",
        "dateOfIncident": "04/22/2019",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402838,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR STARTED A FIRE ON THE ROAD WHILE IT WAS IN MOTION, AND AFTER I DROVE IT OVER A MILE ON A CITY STREET ON APRIL 22ND, 2019. I STOPPED THE CAR AND TURNED OFF THE CAR AFTER I SAW SMOKE CAME OUT OF THE HOOD IN FRONT OF DRIVER SIDE WINDSHIELD. I LEFT THE CAR IMMEDIATELY TO CALL FOR HELP. LESS THAN A MINUTE, AFTER I LEFT THE CAR, THE FIRE STARTED, THE FLAMES WENT UP TO 10 FEET HIGH IN A SHORT 2 MINUTES, IN LESS  THAN 10 MINUTES, BEFORE THE FIREMEN PUT FIRE OFF, THE CAR WAS BURNED TO THE FRAME WITH NOTHING LEFT INSIDE. THE CAR WAS DRIVEN A LITTLE OVER 6000 MILES AT THE TIME. TOYOTA HAS NOT COVERED ANY OF MY LOSS AND TAKEN THE RESPONSIBILITY.",
        "vin": "2T3BFREV2JW"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/10/2021",
        "dateOfIncident": "03/05/2021",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400275,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THERE IS A LITTLE SHAKES ON THE CAR AND A MESSAGE  APPEARED THAT THE ANTI LOCKING BRAKE FAILED.  I STOP THE VEHICLE AND I SAW SMOKE COMING FROM THE HOOD.  I TURNED OFF THE VEHICLE AND TOOK THE KEY FROM THE IGNITION.  A FIRE START COMING OUT OF THE  HOOD AND I TOLD MY WIFE TO GET OUT OF THE VEHICLE AND I GET OUT ALSO, THE DRIVER OF A VEHICLE BEHIND US CALLED THE FIRE DEPARTMENT AND IN A FEW MINUTES THE FIRE FIGHTERS ARRIVED AND START EXTINGUISHING  THE FIRE.  THE FIRE ENGULF THE WHOLE VEHICLE.",
        "vin": "2T3BFREV8JW"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/08/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399839,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IN MOTION. I TRIED TO ACCELERATE TO PASS ON OTHER VEHICLE AND ACCELERATION STALLED OUT. THIS HASS OCCURED ON 3 SEPARATE OCCASIONS. BUT IT IS NOT CONSISTANT ON ALL OCCASIONS.",
        "vin": "JTMZFREV5JJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/05/2021",
        "dateOfIncident": "02/28/2021",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399349,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA RAV4. THE CONTACT STATED WHILE DRIVING AT 55 MPH, WHEN THE VEHICLE STALLED. THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE CONTACT STATED SHE SAW SMOKE EXIT THE HOOD. THE CONTACT WAS ABLE TO PARK ON THE SIDE OF THE ROAD. THE VEHICLE WAS NOT DRIVABLE. THE VEHICLE WAS TOWED TO HER RESIDENCE. THE CONTACT CALLED LOCAL DEALER EASTERN SHORE TOYOTA (29732 FREDERICK BLVD, DAPHNE, AL 36526: (251) 250-0161) AND WERE MADE AWARE OF THE FAILURE. THE VEHICLE HAD NOT BEEN DIAGNOSED OR  REPAIRED. THE MANUFACTURER HAD BEEN INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 30,000.",
        "vin": "JTMZFREV8JJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/04/2021",
        "dateOfIncident": "02/25/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399097,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSTANT BATTERY FAILURE ON 2018 RAV 4.  REPLACED JAN 2020 AND AGAIN MARCH 2021.  ALL THE LIGHTS LIT UP, BELLS & WHISTLES THEN DEAD.  HAVE CALLED TRIPLE A SO MANY TIMES WE ARE OUT OF SERVICE UNLESS UPGRADE PLAN.  DEALER STATES CAR NOT DRIVEN ENOUGH (DESPITE DRIVEN SEVERAL TIMES PER WEEK) BUT DEALER WOULD NOT STATE HOW MUCH CAR SHOULD BE DRIVEN TO AVOID BATTERY FAILURE ISSUE.  ALSO NOTED SQUIRREL HAD BUILT NEST UNDER THE HOOD WITH INSULATION.  NOTIFIED DEALER OF ALL & THEY REPLACED BATTERY WHICH WAS NOT INCLUDED IN WARRANTY THAT IS ACTIVE.  VEHICLE WAS STATIONARY.  CONCERNED AS OTHERS HAVING SAME ISSUE AND SOME WITH BATTERY EXPLOSION/FIRE.  MY MOM IS ELDERLY AND CONCERNED ABOUT HER BEING STRANDED OUT AND ABOUT OR WORSE FIRE HAZARD.",
        "vin": "2T3RFREV5JW"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/01/2021",
        "dateOfIncident": "01/30/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11391044,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "1/30/2021 TRAVELING APPROX 74 MPH ON INTERSTATE IN LIGHT TRAFFIC AND LIGHT RAIN (HEAVY DRIZZLE) AND OUTSIDE TEMP AROUND 47 DEGREES. I WAS LISTENING TO AN AUDIOBOOK WHEN I HEARD A NOISE LIKE A POPPING SOUND AND THEN A ROAR AS WIND STARTED COMING IN THE CAR AND WHAT I NOW KNOW WAS THE SHATTERED GLASS FROM MY SUNROOF FALLING IN ON ME. SHATTERED GLASS FELL ON ME AND WHEN I MOVED IT WEDGED ITSELF BETWEEN ME AND MY SEAT MAKING IT UNCOMFORTABLE TO MOVE FOR FEAR OF BEING CUT BY THE GLASS.  IT WAS NOT A ROCK THE SUNROOF SPONTANEOUSLY EXPLODED.",
        "vin": "JTMDFREV0JD"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "01/30/2021",
        "dateOfIncident": "01/29/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390787,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAFFIC STOPPED ON THE HIGHWAY AND MY CAR DIDN'T. THE AUTOMATIC BRAKING SYSTEM STARTED BUT IT DIDN'T STOP. ALMOST EVERY AIRBAG DEPLOYED EXCEPT THE PASSENGER, IT WAS OFF. MY DASH READ THAT ABS FAILED CONTACT DEALER.",
        "vin": "2T3BFREV5JW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/16/2021",
        "dateOfIncident": "01/10/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388411,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WARNING LIGHT COMING ON WITH WARNING SOUND, THE DEALER CAN'T FIND THE PROBLEM TO REPAIR IT",
        "vin": "JTMRFREVXJJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/11/2021",
        "dateOfIncident": "01/07/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387451,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE DOWNSHIFTS 2X AT 40 MPH INTO A GEAR WHICH MAKES THE CAR LURCH AND THE RPMS GO FROM 2000 TO 4000.  HAPPENS DURING MILD ACCELERATOR DEPRESSION.  IF YOU ROMP ON THE GAS THIS DOES NOT HAPPEN.  WHEN IT DOES UPSHIFT THE ECO LIGHT COMES ON BUT THEN IT UPSHIFTS AGAIN.  THE SENSOR DOES NOT SELECT THE RIGHT GEAR FOR THE LOAD.",
        "vin": "JTMNFREV2JJ"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "12/18/2020",
        "dateOfIncident": "02/10/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384098,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LANE DEPARTURE WARNING BUZZER'S WARNING CANNOT BE HEARD ON THE ROAD WITH THE RADIO ON LOW VOLUME OR WITH A RADIO OFF BUT DRIVING ABOVE 75MPH DUE TO THE ROAD NOISE. MULTIPLE COMPLAINTS TO DIFFERENT DEALERS RESULTED IN COMMENTS THAT THE BUZZER WORKS AS DESIGNED. CALLS TO TOYOTA'S \"BRAND ENGAGEMENT ADVOCATE\" RESULTED IN ADVICE TO GO TO A DEALER. THEY HAVE NO AUTHORITY TO INSTRUCT THE DEALER TO REPLACE THE BUZZER. I UNDERSTAND THAT LDW IS MANDATORY FOR 5 STARS SAFETY RATING, BUT I CANNOT FIND THE SPECIFICATION FOR THIS SAFETY FEATURE.",
        "vin": "JTMJJREVXJD"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/04/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377924,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE AN AUTO SHIFT OFF FOR HIGH BEAM LIGHTS, I TURN MY HIGH BEAMS ON AND THEY DON'T WORK, AND WHEN I PULL THE SWITCH BACK LIKE I AM TRYING TO FLASH MY HIGH BEAMS AT SOMEONE THEY WORK BUT WHEN I TURN THEM ON TO KEEP THEM ON THEY DO NOT WORK AND MY AUTO HIGH BEAM LIGHT DOES NOT COME ON EITHER.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "JTMZFREV5JJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/27/2020",
        "dateOfIncident": "11/18/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376758,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I STOPPED THE VEHICLE ON A SMALL INCLINE WHILE THE GEAR SHIFT WAS IN DRIVE. I HIT THE POWER BUTTON (WHILE THE BRAKE WAS PRESSED) WITHOUT PUTTING THE CAR INTO PARK. WITH THE VEHICLE STILL IN DRIVE, AND NOT PROPERLY TURNED OFF, WHEN I REMOVED MY FOOT FROM THE BRAKE, MY VEHICLE ROLLED BACKWARDS SIX FEET.  LATER THAT DAY I TRIED TO RECREATE THE SAME SCENARIO AND IT HAPPENED AGAIN. IF YOU PRESS THE POWER BUTTON TO TURN OFF YOUR VEHICLE WHILE IT IS STILL IN DRIVE AND YOU TAKE YOUR FOOT OFF OF THE BRAKE, THE CAR WILL ACT AS THOUGH IT IS IN NEUTRAL AND ROLL DOWNHILL. I HAVE NOT TRIED WITH THE CAR FACING DOWNHILL/ROLLING FORWARDS.",
        "vin": "2T3DFREV5JW"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/06/2020",
        "dateOfIncident": "11/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11373424,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN REVERSE WITH FOOT ON BRAKE (STOPPED) THE VEHICLE WAS REAR ENDED. WHILE FOOT STILL ON BRAKE THE VEHICLE HAD UNCOMMANDED FORWARD ACCELERATION (ENGINE REVVED UP LIKE FOOT FLOORED THE GAS PEDAL). VEHICLE ACCELERATED FORWARD ~25 FT AND HIT THE FRONT OF ANOTHER VEHICLE (FOOT ON BRAKE PEDAL ENTIRE TIME). UPON IMPACT, THE VEHICLE HAD UNCOMMANDED ACCELERATION IN REVERSE (FOOT ON BRAKE PEDAL STILL). WAS ABLE TO TURN OF IGNITION AND PULL THE EMERGENCY BRAKE TO STOP THE VEHICLE AFTER MOVING ~25FT IN REVERSE. AT FINAL STOP, THE VEHICLE'S TRANSMISSION LEVER WAS IN THE DRIVE POSITION.   NOTE: TOW TRUCK DRIVER STARTED VEHICLE TO GO IN REVERSE A FEW FEET FOR POSITIONING. WITH ENGINE RUNNING, VEHICLE WAS PUT IN REVERSE AND GAS PEDAL PRESSED GENTLY. VEHICLE WENT IN REVERSE (< 2MPH) AS IT SHOULD. FOOT APPLIED TO BRAKE AND VEHICLE PUT IN PARK IN ONE MOTION. VEHICLE IN PARK AND FOOT ON BRAKE THE ENGINE BEGAN TO REV UP AGAIN. KEY WAS TURN OFF. VEHICLE TOWED.",
        "vin": "JTMBFREV5JJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/27/2020",
        "dateOfIncident": "10/20/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366770,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS A TOYOTA RAV4 2018.    ON OCTOBER 20, 2020, I WAS DRIVING MY CAR AROUND 60 MPH WITH MY SON ON A BRIGHT, SUNNY DAY IN ABOUT 80 DEGREE WEATHER ON HIGHWAY 605N JUST PAST HIGHWAY 60. OUT OF NOWHERE, WE WE HEARD A LOUD BURSTING NOISE THAT SOUNDED LIKE A GUNSHOT. THERE WEREN'T MANY CARS ON THE HIGHWAY AND I WAS DRIVING ON THE THIRD LANE FROM THE OUTER EDGE. WHEN I PULLED OVER, I NOTICED THE SUNROOF HAD COMPLETELY SHATTERED. WE HADN'T TRIED TO OPEN THE SUNROOF AT THE TIME OF THE INCIDENT NOR DID IT APPEAR THAT A ROCK OR OTHER OBJECT HIT THE SUNROOF.  ON OCTOBER 22, 2020, I TOOK MY CAR TO THE TOYOTA DEALERSHIP IN WESTMINSTER. THE DEALERSHIP SAID THAT THEY WERE NOT RESPONSIBLE FOR THE DAMAGE BUT WOULD CONTACT TOYOTA DIRECTLY TO SEE IF TOYOTA MANUFACTURER WOULD COVER THE COSTS. A FEW DAYS LATER, I WAS TOLD THAT TOYOTA MANUFACTURER WOULD NOT TAKE RESPONSIBILITY FOR THE SHATTERED SUNROOF. I WOULD NEED TO PAY FOR PARTS AND LABOR TO GET THE SUNROOF REPAIRED EVEN THOUGH THE INCIDENT WAS NO FAULT OF MY OWN. MY CAR HAS LESS THAN 10,000 MILES BECAUSE I BARELY DRIVE IT. MY CAR SPENDS MOST OF THE TIME PARKED INSIDE MY COVERED GARAGE. I TAKE EXTREMELY GOOD CARE OF MY CAR THAT IT DOESN'T EVEN HAVE ANY SCRATCHES ON IT.  UPON SEARCHING THE WEB, I NOTICED THERE WERE OTHER REPORTED INCIDENTS FROM PEOPLE WHO EXPERIENCED SHATTERED SUNROOFS FROM THEIR TOYOTA CARS. THESE TYPES OF INCIDENTS POSE A SERIOUS SAFETY ISSUE. AND WHAT SURPRISED ME EVEN MORE IS THAT TOYOTA IS NOT TAKING RESPONSIBILITY FOR RECALLING THE CARS THESE DEFEATS. I TRULY BELIEVE THAT TOYOTA SHOULD BE RESPONSIBLE FOR COVERING THE COST FOR REPAIRS FOR MY SUNROOF AND OTHER CARS THAT HAVE HAD SIMILAR TYPES OF DEFEATS.",
        "vin": "JTMNFREV7JJ"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/08/2020",
        "dateOfIncident": "09/06/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353747,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON A STREET TURNING LEFT ON GREEN YIELDING TO ONCOMING TRAFFIC. IN MOTION OF TURNING AND THE OTHER CAR WHO WAS COMING HEAD ON OVER 80MPH CLIPPING MY FRONT END MAKING MY CAR SPIN 360 DEGREES AND AIR BAGS DID NOT DEPLOY.",
        "vin": "2T3YFREV1JW"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/08/2020",
        "dateOfIncident": "09/08/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353870,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR IS FAILING TO SPEED UP PAST 60 UNLESS USING CRUISE CONTROL  THEN THE CAR USED A LOT MORE GAS THEN NORMAL. I ALSO TRIED TO PASS A CAR TO GET UP TO HIGHWAY SPEED AND WAS UNABLE TO, VERY DANGEROUS ON THE HIGHWAY. THEN THE CAR WOULD NOT GO PAST 40 I TRIED TO SWITCH FROM ECO TO SPORT TO NORMAL THINKING THAT MAYBE THE COMPUTER WAS CONFUSED BUT THAT DID NOTHING. SO AFTER TRYING TO SPEED UP MULTIPLE TIMES I GOT A HYBRID MALFUNCTION LIGHT AND TOLD TO PULL OVER. THIS HAS HAPPENED TO ME IN THE PAST AS WELL. TOYOTA DEALER WAS UNABLE TO DIAGNOSE ANY ISSUES WITH IT AND JUST RESET THE COMPUTER.",
        "vin": "JTMDJREV0JD"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/24/2020",
        "dateOfIncident": "01/07/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350890,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE KEYLESS IS NOT FRIENDLY FOR THE DEAF. NEED TO SOMETHING FOR THE RIGHT AND SAFE. THANK YOU.",
        "vin": "2T3RFREV4JW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/16/2020",
        "dateOfIncident": "07/26/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349726,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS CAR IN FEBRUARY 2018 AND ON FEBRUARY 2019 THE FIRST FAILURE OCCURRED. I WAS DRIVING WHEN THE ENGINE STOPPED AND \"CHARGING SYSTEM FAILURE\" WAS DISPLAYED ON THE DASH. WITH THIS FAILURE, THE OWNERS MANUAL SAYS TAKE IT TO THE DEALER. THE CAR DID START UP AND I WAS ABLE TO DRIVE HOME. THE SELLING DEALER COULD NOT FIND ANY PROBLEMS. I IGNORED THE SAME FAILURE A COUPLE MORE TIMES, BUT WITH THE LAST FAILURE, I TOOK THE CAR TO BALL TOYOTA, CHARLESTON, WV. THEY TOLD ME THAT THERE WAS 3 ERROR CODES, PO 1603,1604,1605,P219A AND MADE A REFERRAL TO TOYOTA, TAS CASE #202130026. TOYOTA TOLD THE DEALER TO REPLACE THE TANK SUB-ASSY. AND THE CANISTER ASSY.. I BELIEVE THAT THIS IS A DANGEROUS PROBLEM THAT I'M NOT SURE THEIR REPAIR WILL BE THE CORRECT FIX",
        "vin": "2T3ZFREV2JW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "08/11/2020",
        "dateOfIncident": "03/13/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348725,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE I GOT MY RAV 4 2018 I'VE HAD ISSUES WITH THE BRAKES. BOTH MY BROTHER AND MOTHER DRIVE THE CAR AND EXPRESS THE SAME ISSUE. I'VE BROUGHT IT TO TOYOTA NUMEROUS TIMES ONLY TO BE TOLD THEY CANNOT REPLICATE THE ISSUE AND THAT THE BRAKES ARE WORKING FINE. WHEN I'M PUSHING THE BRAKES DOWN THEY FEEL LIKE THEY'RE GOING TO THE FLOOR. THERE IS A TERRIBLE SCREECHING SOUND HEARD AS WELL.     I WAS IN AN ACCIDENT A FEW MONTHS AGO DUE TO THE BRAKES. I CALLED TOYOTA AND EXPRESSED MY CONCERNS AND THEY SENT AN INDEPENDENT INSPECTOR TO CHECK THE BRAKES. I RECEIVED AN EMAIL THAT STATED, \"WE DO NOT BELIEVE THE VEHICLE SUFFERS FROM A DEFECT IN MATERIALS OR WORKMANSHIP THAT SUBSTANTIALLY IMPAIRS ITS USE, VALUE OR SAFETY\". I'M UNSURE WHAT TO DO AT THIS POINT AS I'VE EXHAUSTED MY OPTIONS. I MAINTAIN EXCESSIVE DISTANCE FROM OTHER CARS BECAUSE I KNOW I HAVE TO START BRAKING WAY AHEAD OF TIME. ITS A MAJOR SAFETY HAZARD THAT NEEDS TO BE ADDRESSED.      CASE NUMBER: 2007132091",
        "vin": "2T3BFREVXJW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/09/2020",
        "dateOfIncident": "08/07/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11344204,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT THE CAR BRAND NEW IN JAN/2018. IN MARCH/2019, 18,000 MILES, BRAKES WERE MAKING LOUD NOISES. AT FIRST TOYOTA SAID IT WAS NORMAL, JUST MOISTURE. MONTH LATER I INSISTED BC IT GOT WORSE, SO FINALLY THE MECHANIC AT TOYOTA DROVE MY CAR AND AGREED. THEY CHANGED THE ROTORS AND PADS, NO CHARGE (AFTER SOME ARGUES). NOW CAR IS 35,000 MILES (AFTER 17,000 MILES), BRAKES ARE MAKING NOISES AGAIN. TOOK AT TOYOTA AND AT THAT TIME I HAD TO PAY. THAT'S RIDICULOUS! THEY SAY YOU SHOULD CHANGE PADS BETWEEN 35,000 AND 70,000 MILES.   RAV4 HAS PROBLEMS WITH THE BRAKES FOR SURE!",
        "vin": "JTMZFREV4JJ"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/24/2020",
        "dateOfIncident": "06/13/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341323,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "NOT SOON AFTER I LEASED MY RAV4 THE BRAKES STARTED GRINDING AS IF I NEEDED NEW BRAKES & EVERYTIME I WENT IN FOR MAINTENANCE THEY SAID NOTHING IS WRONG WITH THEM & THEY LOOK FINE. THE ROTORS ARE RUSTED JUST ON THE INNER PART ON BOTH REAR ROTORS & MY CAR IS GARAGED SO THERE ISNT ANY REASON WHY THEY SHOULD BE GRINDING OR SQUEALING. IT MAKES THE NOISE WHEN I'M IN MOTION. ALSO THE RADIO STATIONS ARE COMPLETE STATIC & I HAVE HAD 2 DIFFERENT TOYOTA DEALERS LOOK AT IT & THEY SAY NOTHING IS WRONG WITH THE WIRING BUT CAN'T FIGURE OUT WHY ALL MY STATIONS COME IN STATICALLY.",
        "vin": "JTMBFREV5JJ"
    },
    {
        "components": "SUSPENSION,STRUCTURE,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/08/2020",
        "dateOfIncident": "07/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338142,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 7/3/20 AT ABOUT 3 PM EDT I WAS PREPARING TO TURN LEFT AND EXIT MY  NEIGHBORHOOD. I WAS STOPPED. I PRESSED ON THE ACCELERATOR AND THE  VEHICLE SUDDENLY ACCELERATED STRAIGHT AHEAD AT A HIGH RATE OF SPEED. I WAS UNABLE TO STOP THE VEHICLE. I TRAVELLED ABOUT 100 TO 150 FEET, CLIMBED AN ENBANKMENT AND LANDED IN A SMALL WOODED RAVINE. I WAS ATTEMPTING TO EXIT MY NEIGHBORHOOD ONTO A PAVED ROAD.",
        "vin": "2T3YFREV3JW"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": true,
        "dateComplaintFiled": "06/14/2020",
        "dateOfIncident": "06/05/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328730,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "PULLED INTO DRIVEWAY AND HAD FOOT ON BREAK. GOING VERY SLOW TO PARK . WENT TO PUT CAR INTO PARK AND CAR LUNGED FORWARD AND HIT GARAGE. BACKED UP AND CAR WENT VERY FAST SO HAD TO MOVE FORWARD AGAIN OUT OF ROAD. PUT CAR INTO DRIVE AND CAT SURGED FORWARD AND OUT OF CONTROL. ABLE TO AVOID GARAGE BUT CAR WENT BESIDE GARAGE, AND INTO SLIGHT DROP OFF. I WAS ABLE TO STOP CAR BY FLOORING BREAK AND PUTTING INTO PARK. CALLED POLICE THEY MADE REPORT, CALLED ROADSIDE SERVICE AND TOWED TO DOWNEAST TOYOTA IN BREWER MAINE. IT'S NOW GOING TO HAVE INFORMATION PULLED AND RESEARCHED TO DETERMINE WHAT HAPPENED. NO PICTURES. A LOT OF DAMAGE TO FRONT AND MAYBE UNDERNEATH. CAR WENT OVER A CEMENT BLOCK.",
        "vin": "JTMBFREVXJJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/12/2020",
        "dateOfIncident": "06/11/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328545,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2018 TOYOTA RAV4 HAS 13,000 MILES.  DRIVING AT 20 MPH ON A ONE-LANE SECONDARY ROAD WHEN VEHICLE SPEED INCREASED ON ITS OWN.  STEPPING ON FOOT BRAKE HAD NO EFFECT.  ACCELERATION WAS CONSTANT AND NON-STOP.  ABOUT 30 SECONDS LATER, CAR SLOWED AS THOUGH MY FOOT HAD BEEN REMOVED FROM THE ACCELERATOR.  THE PROBLEM WAS - MY FOOT HAD BEEN CONSTANTLY ON THE BRAKE PEDAL.  THIS UNCONTROLLED ACCELERATION HAS HAPPENED ONLY ONCE BUT I ONLY DROVE IT TO GET HOME.  NOTE: FLOOR MATS WERE PROPERLY ANCHORED.  *TR",
        "vin": "2T3RFREV0JW"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "05/26/2020",
        "dateOfIncident": "09/18/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325919,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SEATBELT N THE BACK FOR CHILD DON'T CHIME WHEN KIDS ARE OUT OF SEAT AS MANUFACTURERS MADE.  *TR",
        "vin": "JTMWFREV3JJ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/16/2020",
        "dateOfIncident": "12/03/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321331,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE I BROUGHT THIS RAV4 WHEN I START DRIVING THE FIRST 5 MINUTES IN THE MORNING AND COLD WEATHER WHEN I STEP ON THE BRAKE IT'S MAKE NOISE AND WHEN I TOOK THE CAR IN FOR 5K,10K,15K AND 20K SERVICE I TOLD THEM ABOUT THE BRAKE AND THERE ANSWER WAS THAT'S NORMAL. FOR ME THIS IS A BRAND NEW CAR.  *TR",
        "vin": "2T3RFREV2JW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "04/14/2020",
        "dateOfIncident": "04/14/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321128,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD BEEN USING THE ADAPTIVE CRUISE CONTROL AT HIGHWAY SPEED ON THE WESTBOUND CA 134 IN GLENDALE/BURBANK, CA. I HAD TO MERGE INTO TRAFFIC FROM THE HOV LANE DISENGAGING THE CRUISE CONTROL. I THEN USED THE  AUTO TRANSMISSION TO SHIFT TO A LOWER GEAR TO GAIN MORE TORQUE IN CHANGING LANES WHEN THE CAR WENT INTO A STALL AND LOST ALL POWER. CONSEQUENTLY WE WERE REAR-ENDED BY ANOTHER CAR. OUR CAR WENT INTO A LOCKOUT AND HAD TO BE PUSHED TO THE SHOULDER BY THE CALIFORNIA HIGHWAY PATROL. I DON'T KNOW IF THIS WAS A RANDOM EVENT OR A GLITCH IN THE ON-BOARD COMPUTER.OR SOMETHING ELSE TOTALLY UNRELATED.  *TR",
        "vin": "JTMRJREV2JD"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/09/2020",
        "dateOfIncident": "04/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320662,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HIT A DEER TRAVELING AT 60MPH+ WHILE TRAVELING ON I-470.  THE AIRBAG DID NOT DEPLOY, I DID SEE AN ERROR ON THE STATUS DISPLAY OF A SAFETY SYSTEM FAILURE.  THE REPAIR SHOP FOUND THE FRONT SENSOR WAS CRUSHED IN THE COLLISION AND AMAZED THE AIRBAG DID NOT DEPLOY.  I AM CONCERNED THIS IS A FUNCTIONAL FLAW WITH THE VEHICLE AND COULD RISK THE SAFETY OF OCCUPANTS.  I HAVE PHOTOS OF THE VEHICLE IF NEEDED.",
        "vin": "JTMRJREV3JD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/05/2020",
        "dateOfIncident": "04/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320248,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS NEEDLE SHOWS EMPTY WHEN GAS TANK IS HALF FULL. THIS OCCURS WHEN AUTO IS STATIONARY, AND IN MOTION.",
        "vin": "2T3BFREV4JW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/23/2020",
        "dateOfIncident": "03/23/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319061,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "LANE DEPARTURE WARNING, SEAT BELT WARNING, PEDESTRIAN WARNING AND OTHER AUDITORY SAFETY FEATURE WARNINGS ARE NOT ADJUSTABLE AND THEREFORE MAY BE INADEQUATE IN PROVIDING THE INTENDED SAFETY FUNCTION.   THE MANUFACTURER SHOULD RETROFIT A CONTROL THAT MAKES IT POSSIBLE TO ADJUST THE SAFETY FUNCTION TO THE INDIVIDUAL NEEDS OF THE DRIVER.",
        "vin": "2T3RFREV5JW"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/05/2020",
        "dateOfIncident": "01/16/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316432,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY 2018 RAV4 IN NOVEMBER 2019. I HAD THE CAR FOR ABOUT 3 MONTHS WHEN I DROVE TO WORK, THE CAR ACTED SLUGGISH,  WAS PRESSING ON THE GAS PEDAL BUT WASN'T GOING FASTER. THEN I HAD TO GO TO BANK, MY CAR WOULDN'T MOVE THE RPMS WENT UP TO 5 BUT CAR DIDNT MOVE, FINALLY CAR JUMPED SO I PRESSED ON GAS AN IT TRIED TO STALL SO I LET OFF, THEN CAR ACTED LIKE IT HAD POWER AGAIN THE CAR DID THIS ALL THE WAY TO BANK. IT SAT IDEAL WHILE I WAS AT THE BANK I NOTICED THE CAR SMELLED GASSY, THEN IT DID THE SAME ALL THE WAY BACK TO WORK. WHEN I GOT BACK TO WORK I CALL THE DEALERSHIP IN ENID WHERE I GOT IT AND HE EVEN SAID I MAY BE MY FUEL PUMP. LATER THAT DAY MY CAR SEEMED FINE. NOW IT FEELS LIKE IT WILL JUMP, SLUGGISH, OR STALLS LIKE IT DOESN'T GET GAS WHEN I HAVE A FULL TANK. I HAD GREAT GAS MILEAGE NOW IT TAKES 20 BUCK FOR 20 MILES NO JOKE. I CALLED THE TOYOTA DEALERSHIP IN AMARILLO TX 4 DAYS AGO ABOUT CHANGING MY PUMP, SO SHOWS I HAD ISSUES LONG BEFORE I GOT SENT THE RECALL MESSAGE FROM A FRIEND. I CALL TOYOTA DEALERSHIP IN ENID OK WHERE I GOT THE CAR AND HAVE PLANS TO TAKE IT IN ON THE 19TH TO BE LOOKED AT.",
        "vin": "2T3BFREVXJW"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/03/2020",
        "dateOfIncident": "03/02/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315768,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VIEW OUT THE FRONT WINDSHIELD BECOMES OBSCURED WHEN THE SUN SHINES DIRECTLY TOWARD WINDOW BECAUSE THE FRONT OF THE DASH AREA BECOMES REFLECTED BACK IN THE WINDOW AND YOU CAN NO LONGER SEE DUE OUT THE WINDOW TO THE GLARE. I'VE NEARLY HIT PEDESTRIANS BECAUSE I COULDN'T SEE THEM WALKING IN FRONT OF MY CAR WHEN THIS IS HAPPENING.",
        "vin": "JTMRJREVXJD"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/26/2020",
        "dateOfIncident": "08/27/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311565,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WENT TO THE DEALERSHIP FOR ANOTHER REASON BUT I HAPPENED TO TELL THE SALESPERSON THAT I WAS VERY DISSATISFIED WITH THE FUEL SAVINGS. MY IN-TOWN AVERAGE IS 18.3 AND THE INTERSTATE FUEL ECONOMY IS 22.4 MPG. HE TOLD ME I SHOULD BE GETTING 30  MILES PER GALLON. NOT HAPPENING!!! I BOUGHT THIS SUV FOR TRAVELING. THAT'S NOT AN OPTION WITH THIS FUEL MILEAGE!",
        "vin": "2T3BFREV4JW"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/20/2020",
        "dateOfIncident": "05/23/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310436,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "NEXT DAY AFTER I BOUGHT THE VEHICLE, I BROUGHT THE SUV BACK TO THE DEALER (CENTENNIAL TOYOTA OF LAS VEGAS ) WITH PROBLEM ON THE GATE OPENER. DEALER REPLACED THE CONTROL MODULE IN THE REAR VIEW MIRROR BUT THE PROBLEM DID NOT GET RESOLVED. BROUGHT IT BACK TO THE DEALER AGAIN AND THE TECHNICIAN CAME WITH ME TO REPROGRAM THE CONTROL BUT CANT RESOLVED THE PROBLEM. I WAS TOLD THAT I NEED TO BUY A REMOTE CONTROL FOR THE GATE COMPATIBLE WITH THE SUV CONTROL SYSTEMS. WE HAVE TWO GATES WHICH MEANS T I HAVE TO BUY THE CONTROLS. I TRIED TO RETURN THE VEHICLE BUT THE NEXT DAY I FOUND THE VEHICLE IN MY DRIVE WAY, WITH A NOTE SAYING THE PROBLEM WAS ON THE GATE. STILL FURTHER MADE THE COMPLAIN TO THE MAIN TOYOTA MANUFACTURERS OFFICE TO NO AVAIL, STILL INSISTING THAT THE PROBLEM WAS IN THE GATE CONTROL. HOWEVER THE CONTROL BUTTON FOR THE GARAGE WORK PROPERLY. STILL THE PROBLEM IS UNRESOLVED AT THIS MOMENT.",
        "vin": "JTMDJREV3JD"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/19/2020",
        "dateOfIncident": "02/07/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310223,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AT AROUND 1:30 PM, FEBRUARY 7, 2020, ON A SUNNY AND WINDY DAY, I WAS DRIVING ON MD RTE. 32 HEADING TOWARDS COLUMBIA JUST PAST I-95, TRAVELING ABOUT 60 MPH. I WAS DRIVING NEXT TO A LARGE TRUCK AND BECAUSE THERE WAS A LOT OF WIND, AND THE TRUCK WAS BEING BLOWN BY THE WIND, I DECIDED TO DRIVE PASS IT. AFTER I HAD DRIVEN PAST THE TRUCK, I HEARD A VERY LOUD BANG RIGHT ABOVE MY HEAD AS IF SOMETHING EXPLODED. I DID NOT SEE ANYTHING AND THE CAR APPEARED TO BE OK, SO I KEPT DRIVING. BUT THEN I STARTED HEARING THE SOUND OF WHAT I THOUGHT WAS SOMETHING LIKE GRAVEL BOUNCING RIGHT ABOVE THE SLIDER THAT COVERS THE SUNROOF. BECAUSE I DID NOT KNOW WHAT JUST HAPPENED, I DECIDED TO HEAD HOME WHICH IS JUST A FEW MINUTES AWAY. WHEN I GOT HOME I SAW THAT THE SUNROOF GLASS WAS SHATTERED AND MOST OF THE GLASS WAS GONE.    I CALLED THE SERVICE DEPARTMENT OF THE COMPANY THAT SOLD ME THE CAR ABOUT GETTING THE SUNROOF REPLACED AND THEY TOLD ME THAT EVEN THOUGH THE CAR WAS ONLY 2 YEARS OLD AND HAD A THREE YEAR WARRANTY, THAT I SHOULD CALL MY INSURANCE AGENT.    I CONTACTED OUR INSURANCE AGENT AND SHE SAID TO CALL THE CLAIMS DEPARTMENT. SHE ALSO MENTIONED THAT SOMETHING MUST HAVE HIT THE SUNROOF. TO MY KNOWLEDGE NOTHING HIT THE SUNROOF TO CAUSE THE GLASS TO EXPLODE. I AM NOT AWARE OF ANY PREVIOUS CRACKS OR OTHER DAMAGE TO THE SUNROOF THAT WOULD HAVE WEAKENED IT.    I CALLED THE INSURANCE AGENT, AND WAS TRANSFERRED TO SUNROOF EXPRESS, THE COMPANY THAT HANDLES THE SUNROOF CLAIMS. I WAS REQUIRED TO PAY MY DEDUCTIBLE AND THEY SENT A NEW SUNROOF TO A REPAIR COMPANY NEAR ME AND THE SUNROOF WAS REPLACED. AT NO TIME DID ANY OF THESE COMPANIES ASK ME WHAT HAPPENED, WHICH ASTONISHED ME. NOR DID THEY SEEM SURPRISED AT THE OCCURRENCE. IT WAS LIKE THIS HAPPENS ALL THE TIME AND WE WANT TO BE EFFICIENT AND GET IT REPLACED FOR YOU AS QUICKLY AS POSSIBLE.",
        "vin": "JTMWFREV4JJ"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/15/2020",
        "dateOfIncident": "09/26/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309370,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SEAT BELTS DON'T CHIME WHEN UNLATCHED LIGHT ISN'T DISPLAYED",
        "vin": "JTMWFREV3JJ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/15/2020",
        "dateOfIncident": "02/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309442,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD THIS VEHICLE FOR 18,000 MILES NOW AND I HAVE NOTICED SERIOUS ISSUES WITH THE BRAKING SYSTEM. WHEN I APPLY THE BRAKES, I HAVE TO (ALMOST) COMPLETELY FLOOR THE BRAKE PEDAL IN ORDER FOR THE CAR TO STOP. I HAD A 2015 HONDA CR-V FOR THREE YEARS AND IT NEVER HAD ANY ISSUES LIKE THAT. IN OTHER WORDS, THE BRAKE PEDAL IS TOO SOFT COMPARED TO SIMILAR VEHICLES. THIS IS ESPECIALLY PROBLEMATIC FOR SHORTER DRIVERS (LIKE MY MOTHER) BECAUSE SHE HAS SMALL FEET AND SHE NEEDS TO LIFT HER ENTIRE FOOT TO TRANSITION BETWEEN THE GAS/BRAKE PEDALS, PUTTING HER AT A SLIGHT DISADVANTAGE. I CONTACTED THE TOYOTA DEALERSHIP REGARDING THIS ISSUE, BUT THEY TOLD ME THAT IT WAS NORMAL AND COULDN'T DO ANYTHING MAJOR ABOUT IT. THIS IS A MAJOR SAFETY HAZARD. I ALMOST RAN INTO A DEER ONE NIGHT ON A LOCAL ROAD BECAUSE I COULDN'T STOP THE CAR ON TIME. HIGHWAY BRAKING IS ALSO DIFFICULT, SO I HAVE TO MAINTAIN EXTRA DISTANCE. HOWEVER, WHEN USING DYNAMIC CRUISE CONTROL, THE CAR IS ABLE TO SUCCESSFULLY BRAKE IN ACCORDANCE TO THE VEHICLE TRAVELLING AHEAD OF ME.",
        "vin": "2T3BFREV0JW"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/02/2020",
        "dateOfIncident": "12/02/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306517,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS NOT PARTICULAR INCIDENT TO REPORT.  THE HEADLIGHT BEAMS ARE TO LOW ON LOW-BEAM USE, WITH A HARD EDGE AT THE TOP SO IT IS IMPOSSIBLE TO SEE FAR DOWN THE ROAD.  THE HIGH BEAM SETTING IT TOO HIGH, SO THE LIGHT GOES 30 FEET ABOVE THE ROADWAY, AND DOES NOT ILLUMINATE THE ROAD FURTHER AHEAD.  THIS IS A FAULTY DESIGN.  I WAS ABLE TO ADJUST THE BULB HOUSING TO LOWER THE HIGH BEAM SO IT ACTUALLY SHOWED MORE ROAD , AND THE PROBLEM OF DEER ON THE ROADWAY IN THE MOUNTAINS.  THERE SHOULD BE SEPARATE ADJUSTMENTS FOR HIGH/LOW BEAMS, AND THE LOWER BEAM SHOULD SHOW MORE ROADWAY AHEAD.",
        "vin": "JTMRJREV6JD"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/16/2020",
        "dateOfIncident": "12/23/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299733,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY RAV4 BRAND NEW MID/LATE YEAR 2018. IN DECEMBER AT APP. 10000 MILES I STARTED HAVING ISSUES WITH THE GEARS. SHIFTING FROM PARK TO ANY GEAR I WOULD HEAR A LOUD BANGING TYPE NOISE AND THE ENTIRE CAR WOULD JERK. ALONG WITH THAT ISSUES I HAVE NOTICED A DELAYED ACCELERATION AT GREEN LIGHTS SOMETIMES TO THE POINT WHERE I GET A TRACTION CONTROL LIGHT ONCE IT HAS KICKED IN OR EVEN JERKING WHILE FINDING THE CORRECT GEAR TO BE IN. ONCE I HAVE ACCELERATED AND LET OFF THE GAS, AND THEN RETURNED TO THE ACCELERATION PEDAL AFTER BRAKING OR JUST MOMENTARILY RESTING MY ANKLE WITH THE CAR AT SPEED, THE CAR WILL \"FISH FOR GEARS\" LIKE IT CANNOT DECIDE WHICH GEAR THE CAR SHOULD BE IN. WHEN GOING DOWNHILL AND LETTING OFF THE GAS IT WILL DOWNSHIFT, CAUSING THE CAR TO JERK. ALL THESE ISSUES HAPPEN OFTEN BUT COMPLETELY AT RANDOM. I HAVE TAKEN IT TO THE DEALER AND BROUGHT IT UP MULTIPLE TIMES DURING OIL CHANGES AND TIRE ROTATION, BUT THEY SAY THAT CANNOT DUPLICATE IT OR THAT IT IS JUST HOW THE CAR WORKS.",
        "vin": "JTMZFREV0JJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/14/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299245,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE TURNPIKE FROM FT. LAUDERDALE, FL  TO OCALA, FL, WHEN I  REACH THE KISSIMMEE AREA, THE DRIVER SIDE DOOR OPENED BY ITSELF.  I HELD THE DOOR WHILE CONTINUING TO DRIVE TO A SAVE AREA.  THIS WAS A CONSTRUCTION AREA, SO I DROVE FOR APPROXIMATELY 1 MILE OR 1-1/2 MILE AND ENTER BETWEEN THE CONSTRUCTION DRUMS TO PARK AND PROPERLY CLOSE AND LOCK THE DOOR.  IT WAS A VERY FRIGHTENING AND TENSE MOMENT.",
        "vin": "2T3ZFREV5JW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/19/2019",
        "dateOfIncident": "12/17/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290102,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ALONE AROUND 630PM DRIVING STRAIGHT EAST ON I10 TWIN SPANS IN THE LEFT LANE GOING 70ISH MPH WHEN I HEARD A LOUD POP SOUND. OVERHEAD I COULD HEAR A LITTLE WHISTLING AND RATTLING COMING FROM THE SUNROOF SHADE THAT WAS CLOSED. I QUICKLY GOT INTO THE RIGHT LANE AND SLOWED TO ABOUT 50 MPH. I IMMEDIATELY STOPPED AT THE TOYOTA DEALERSHIP FOR THEM TO REVIEW THE VEHICLE. THEY CLAIM A ROCK HIT THE GLASS, HOWEVER, THERE WAS NO ONE IN FRONT OF ME TO THROW UP A ROCK. IT WAS NOT RAINING. IT WAS SLIGHTLY WINDY. THIS OCCURRED ON TUESDAY, DECEMBER 17, 2019.",
        "vin": "2T3WFREV8JW"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/13/2019",
        "dateOfIncident": "12/13/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288964,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF EXPLODED WHILE DRIVING AT 65MPH & NO OTHER VEHICLES AROUND.THE DEALER WHERE THE VEHICLE WAS BOUGHT CLAIMS A ROCK CAUSED THE ISSUE AND WILL NOT PAY FOR THE REPAIR.",
        "vin": "2T3RFREV3JW"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/12/2019",
        "dateOfIncident": "11/28/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288606,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "IN THREE SEPARATE OCCASIONS SINCE PURCHASE JANUARY 16TH, 2018, THE ADAPTIVE CRUISE CONTROL HAS LOST TRACK OF AN SUV IN FRONT OF ME AND CONTINUED TO ACCELERATE. DRIVER HAD TO INTERVENE. FIRST INSTANCE WAS A BROWN PONTIAC AZTEC IN CLEAR WEATHER DAYTIME. SECOND OCCURRENCE WAS A BLUE CHEVY ENCORE IN CLEAR WEATHER DAYTIME. THIRD OCCURRENCE WAS A BLACK ESCALADE IN CLEAR WEATHER AT NIGHT.     VEHICLE CRUISE CONTROL WAS SET TO 70-80 MPH WITH THE CLOSEST DISTANCE SETTING.",
        "vin": "2T3DFREV6JW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/06/2019",
        "dateOfIncident": "10/10/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287441,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS AN UPDATE TO COMPLAINT # 11279255 FILED ON 11/10/2019. CAR STALLED UNEXPECTEDLY  WHILE DRIVING WITH \"CHARGING SYSTEM MALFUNCTION\" APPEARING ON THE DASH NEXT TO CHECK ENGINE LIGHT. AFTER TAKING CAR TO LOCAL TOYOTA DEALER IN CONSHOHOCKEN PA, THEY KEPT THE CAR ASKED QUESTIONS AND FINALLY FOUND A FAULTY VALVE IN THE GAS LINE THAT WAS  FLOODING THE VAPOR CANISTER WITH GAS. TOYOTA STEPPED UP AND ALONG WITH THE PERSISTENCE OF THIS DEALERSHIP IN DIAGNOSING THE PROBLEM, IT WAS RESOLVED. THIS ISSUE WAS A THREAT TO LIFE AS IF IT HAD HAPPENED 10 MINUTES LATER WHEN THE CAR WAS ON AN INTERSTATE, SOMEONE COULD HAVE BEEN KILLED OR SERIOUSLY INJURED.",
        "vin": "JTMRFREV9JJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/02/2019",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286289,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LANE DEPARTURE WARNING SYSTEM WORKS INTERMITTENTLY AT NIGHT ON A WET ROADWAY. THE VEHICLE WAS ON A FOUR LANE ROAD WITH TWO LANES IN EACH DIRECTION. SPEED WAS AROUND 45MPH. LANE DEPARTURE WARNING WORKS ABOVE APPROXIMATELY 32MPH. THE SYSTEM WOULD NOT RECOGNIZE THE WHITE SHOULDER LINE ON THE RIGHT HAND SIDE OF THE VEHICLE OR THE DOTTED WHITE LINE ON THE LEFT HAND SIDE OF THE LANE. THIS WAS THE SECOND TIME THIS HAD HAPPENED TO ME. THE OTHER TIME WAS APPROXIMATELY A MONTH AGO.",
        "vin": "2T3DFREV4JW"
    },
    {
        "components": "SERVICE BRAKES,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/24/2019",
        "dateOfIncident": "11/13/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282038,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I'M DRIVING AT SLOW SPEEDS THE ENGINE FEELS LIKE IT STALLED OR DOWNSHIFTED AND THE DISPLAY GETS DARK BUT CAR IS STILL 'ON', HOWEVER, IT WILL NO LONGER ACCELERATE.  THE STEERING SEEMS TO BE AFFECTED TOO.  UNFORTUNATELY, IT ONLY RESOLVED BY TURNING THE CAR OFF AND BACK ON, CAUSING TRAFFIC TO STOP OR SWERVE TO AVOID HITTING ME 3X THE PAST 2 WEEKS.",
        "vin": "JTMBFREVXJJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/12/2019",
        "dateOfIncident": "11/06/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279675,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE JERKS AND MAKES LOUD NOISE WHEN THE EV MODE TURNS ON MOMENTARILY AT 60 MILES PER HOUR. THIS USUALLY HAPPENS WHEN GOING DOWN HILL AND PRESSING ACCELERATOR AFTER RELEASED FOR A FEW MINUTES. THIS DOES NOT ALWAYS HAPPEN BUT WHEN IT DOES, FEELS LIKE THE REAR TIRE HAS BUSTED AND THE CAR IS BEING FORCED TO MOVE. IT HAS HAPPENED MULTIPLE TIMES NOW AND I HAVE REPORTED IT TO TOYOTA BUT THE DEALER CANNOT REPLICATE THE PROBLEM. IT HAS OCCURRED AT LEAST 8 TIMES SO FAR SINCE I BOUGHT THE VEHICLE IN SEPTEMBER 2018.",
        "vin": "JTMDJREVXJD"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/10/2019",
        "dateOfIncident": "11/10/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279255,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE CAR SHUTTERED THEN STOPPED WHILE IN TRAFFIC AND CHECK ENGINE LIGHT AND CHARGING SYSTEM MALFUNCTION ERROR MESSAGE APPEARED. I COASTED OVER TO SIDE OF ROAD. RESTARTED CAR TO GET HOME AND THIS SAME THING HAPPENED 3 MORE TIMES UNTIL I GOT HOME AND PARKED IT. WE RAN THE CAR IN THE DRIVEWAY AND THE SAME THING HAPPENED 3 MORE TIMES. SINCE IT IS SUNDAY AFTERNOON WILL HAVE TO CALL TOYOTA ON MONDAY. AFTER READING ONLINE ABOUT SIMILAR ISSUES...I'M AFRAID TO DRIVE THE CAR AGAIN. IT SEEMS TOYOTA HAS NO FIX OR HAS ACKNOWLEDGED IT AS A PROBLEM.",
        "vin": "JTMRFREV9JJ"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/29/2019",
        "dateOfIncident": "10/11/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11276932,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA RAV4. THE CONTACT STATED THAT WATER LEAKED ONTO THE FLOORMAT OF THE FRONT PASSENGER SIDE OF THE VEHICLE. THE VEHICLE WAS TAKEN TO PRIME TOYOTA BOSTON (617-469-1000, LOCATED AT 1605 VFW PARKWAY, WEST ROXBURY, MA 02132) WHERE IT WAS DIAGNOSED THAT A WATER HOSE FROM THE AIR CONDITIONER WAS BLOCKED. THE FAILURE CAUSED WATER FROM THE AIR CONDITIONER TO DRAIN ONTO THE FLOOR OF THE VEHICLE. THE HOSE WAS REPLACED; HOWEVER, THE TECHNICIAN INFORMED THE CONTACT THAT THE CARPET WOULD NEED TO BE REPLACED AT A COST. THE MANUFACTURER WAS MADE AWARE OF THE CARPET ISSUE AND STATED THAT IT WAS THE CONTACT'S RESPONSIBILITY. THE CARPET WAS NOT REPLACED. THE FAILURE MILEAGE WAS APPROXIMATELY 10,220.",
        "vin": "JTMRFREV3JJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/02/2019",
        "dateOfIncident": "10/10/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265529,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD LIGHTING IS INADEQUATE!!!!  UNABLE TO READ SPEEDOMETER AND OTHER INFO IN BRIGHT AMBIENT DAYLIGHT",
        "vin": "JTMDJREV2JD"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/13/2019",
        "dateOfIncident": "09/13/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254919,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 TOYOTA RAV 4. CONSUMER WRITES IN REGARDS TO ISSUE WITH EXTERIOR DUAL IMAGE SIDE VIEW MIRRORS. *LD    THE CONSUMER STATED RAIN OR FOG CAN CAUSE THE MIRROR TO APPEAR TO HAVE DOUBLE VISION.*JS",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/21/2019",
        "dateOfIncident": "08/20/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245516,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA RAV4. WHILE DRIVING 35 MPH, THERE WAS A GLARE FROM THE DASHBOARD THAT REFLECTED ONTO THE WINDSHIELD. THE FAILURE CAUSED VISION IMPAIRMENT, WHICH CAUSED THE CONTACT TO ALMOST STRIKE A PEDESTRIAN. THE CONTACT PLACED BLACK FELT OVER THE DASHBOARD TO CONCEAL THE GLARE. THE VEHICLE WAS TAKEN TO ACTON TOYOTA OF LITTLETON (221 GREAT RD, LITTLETON, MA 01460, 978-263-1500) WHERE THEY INFORMED THE CONTACT THAT THEY WERE UNAWARE OF THE FAILURE. THE CONTACT WAS REFERRED TO NHTSA. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS 10,000.",
        "vin": "2T3BFREV7JW"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/21/2019",
        "dateOfIncident": "08/20/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245579,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING SOUTH ON COUNTRY ROAD IN BRIGHT SUN. THE SUN WAS REFLECTING OFF THE HORIZONTAL DASHBOARD. CAUSING A REFLECTION OFF THE INSIDE OF THE WINDSHIELD. HAMPERING MY VISION, ALMOST CAUSING ME TO HIT A PERSON ON A BICYCLE.  MY VISION WAS IMPAIRED BY THE REFLECTING LIGHT FROM THE DASHBOARD ONTO THE INSIDE OF MY WINDSHIELD. PREVENTING A CLEAR VISION OF THE ROAD AHEAD OF ME. SEE PHOTOS.    I FIXED MY PROBLEM BY INSTALLING A BLACK FELT CLOTH AND LAYING IT ON THE DASHBOARD. THE SUN DOES NOT REFLECT FROM THE BLACK FELT. MY PROBLEM WAS SOLVED.",
        "vin": "2T3BFREV7JW"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/14/2019",
        "dateOfIncident": "02/20/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243973,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA RAV4. THE CONTACT STATED THAT THE HIGH BEAM HEADLIGHTS WERE FAULTY AND WOULD NOT OPERATE WHEN ACTIVATED. THE CONTACT DROVE THE VEHICLE TO DON JOSEPH TOYOTA (1111 W MAIN ST, KENT, OH 44240, (330) 673-2200), BUT THE FAILURE COULD NOT BE DUPLICATED AND NO FAILURE CODES WERE FOUND. THE CONTACT STATED THAT THE VEHICLE WAS REPAIRED FOUR TIMES WITHIN SIX MONTHS FOR THE SAME FAILURE, BUT THE FAILURE CONTINUED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THE REGIONAL TEAM WAS RESPONSIBLE FOR HANDLING THE SITUATION. THE FAILURE MILEAGE WAS 10,000.  *TR",
        "vin": "JTMRFREV7JJ"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/02/2019",
        "dateOfIncident": "04/24/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241408,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACK IN WINDSHIELD THAT EXPANDED TO COVER THE ENTIRE CENTER OF THE WINDSHIELD IN A LARGE CIRCULAR SHAPE. THE CAR HAD BEEN STATIONARY FOR A FEW HOURS WITH THE FIRST CRACK WAS NOTICED - UPON RETURNING TO THE VEHICLE, THE NEXT DAY THE SMALL CRACK WENT TO A CRACK OVER 6\" IN SIZE, WITHIN A FEW DAYS, THE CRACK WAS CIRCULAR AT COVERED THE ENTIRE MIDDLE SECTION OF THE VEHICLE.",
        "vin": "JTMRJREV9JD"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/15/2019",
        "dateOfIncident": "07/15/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232070,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SUDDEN SUNROOF EXPLOSION DRIVING ABOUT 10 OR 15 MIN.  JUST ENTERED I75 NORTH, WHEN LOUD EXPLOSION HEARD SOMETHING ROLLIN ON THE ROOF LOOKED AROUND NO PERSON ON THE HIGHWAY AND NO CARS OR TRUCKS NEAR ME AND REALIZED WHAT HAD OCCURED OFF AT NEXT EXIT WENT DIRECTLY TO MY TOYOTA DEALER",
        "vin": "JTMYFREVXJJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/15/2019",
        "dateOfIncident": "01/31/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232077,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SAME PROBLEM I HAD WITH THE 2014 RAV4 IS NOW HAPPENING WITH THE 2018 RAV4 STARTING FROM A  STOP AT A TRAFFIC LIGHT OR MAKING A TURN THE CAR FAILS TO MOVE FOR MOMENT AS IF YOU DID NOT STEP ON THE GAS AND I AM NOW AFRAID TO MAKE TURNS UNLESS AT A TRAFFIC LIGHT.",
        "vin": "JTMYFREVXJJ"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/18/2019",
        "dateOfIncident": "12/15/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221036,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA RAV4. WHILE DRIVING VARIOUS SPEEDS, THE DRIVER'S SIDE SEAT BELT FAILED TO REMAIN LATCHED. ALSO, ON OCCASION, THE DRIVER'S SEAT BELT FAILED TO OPEN AND RELEASE. THE SEAT BELT WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO LARRY H. MILLER TOYOTA PEORIA (8633 W BELL RD, PEORIA, AZ 85382, (480) 865-3990) TO BE DIAGNOSED, BUT THEY WERE UNABLE TO DUPLICATE THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 7,000.",
        "vin": "JTMYFREV4JD"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/12/2019",
        "dateOfIncident": "06/07/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219580,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUN ROOF SUDDENLY EXPLODED, WHILE WE WERE DRIVING 55 MILES AN HOUR, STRAIGHT, ON THE HIGHWAY.  LUCKILY WE HAD THE INNER ROOF SHIELD CLOSED, OTHERWISE THE BROKEN GLASS WOULD HAVE FALLEN INTO THE CAR AND ONTO THE DRIVER / PASSENGER, PUTTING US AT SERIOUS RISK OF AN ACCIDENT.  THERE WAS NO SIGN OF ANYTHING HITTING THE ROOF... AND AFTER WE PULLED OVER TO SAFETY, WE NOTICED THAT THE BROKEN GLASS THAT WAS STILL ATTACHED TO THE ROOF WAS BENT OUTWARDS (SEE ATTACHED PICTURES).  WHEN IT EXPLODED, WE WEREN'T OPENING ANY WINDOWS, IT WASN'T RAINING, AND THE OUTSIDE TEMPERATURE WAS ABOUT 70 DEGREES.  THE FAILURE HAPPENED OUT OF THE BLUE.",
        "vin": "JTMDJREVXJD"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/04/2019",
        "dateOfIncident": "05/18/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217851,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA RAV4. WHILE ATTEMPTING TO DRIVE THE VEHICLE, ALL THE WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO CHECKERED FLAG TOYOTA (LOCATED AT 5301 VIRGINIA BEACH BLVD, VIRGINIA BEACH, VA 23462, (757) 490-1111) WHERE IT WAS DIAGNOSED THAT THE SOY WIRES ATTRACTED RODENTS WHO WERE EATING THE WIRES. THE DEALER REPLACED THE WIRES. IN ADDITION, THE CONTACT STATED THAT THE WASHER FLUID HOSE WAS EATEN BY THE RODENTS. THE VEHICLE WAS TAKEN BACK TO THE DEALER WHERE THE WASHER FLUID HOSE WAS REPLACED. THE CONTACT WAS INFORMED THAT THEY COULD NOT USE ANYTHING ELSE TO PREVENT THE RODENTS FROM EATING THE WIRES AND ADVISED THE CONTACT TO GET AN EXTERMINATOR. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED CASE NUMBER: [XXX]. THE APPROXIMATE FAILURE MILEAGE WAS 17,000.     'PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'  *JS",
        "vin": "JTMDFREVXJD"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/28/2019",
        "dateOfIncident": "05/28/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210453,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED A CHANGE IN THE SUSPENSION OF MY VEHICLE. I WENT TO THE SUN TOYOTA DEALERSHIP FOR A ROUTINE OIL CHANGE AND TIRE BALANCING, AND ALSO A WHEEL ALIGNMENT. DEALER INFORMED ME THAT THE RIGHT TIRE CAMBER AND CASTER OUT OF SPECIFICATION. THEY ADJUSTED RIGHT FRONT CAMBER FROM -.9 TO .-3 ATTEMPT TO SHIFT RIGHT FRONT LOWER CONTROL ARM, NO CHANGE FOR CASTER. I WAS TOLD THAT I WILL NOT NOTICE THE DIFFERENCE AND THAT WAS THE BEST ADJUSTMENT THEY CAN DO. I CALLED THE TOYOTA CORPORATE NUMBER BECAUSE I FELT THAT THIS IS A DEFECT FROM TOYOTA AND SHOULD BE RESOLVED.",
        "vin": "JTMWFREV0JD"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/22/2019",
        "dateOfIncident": "01/28/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209342,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LINE DEPARTURE ALERT / STEERING ASSIST BUZZER IS NOT WORKING OR NOT LOUD ENOUGH TO BE HEARD.  OCCASIONALLY WHEN DRIVING FOR HOURS ON FREEWAYS I MAY GET DROWSY, SO I BOUGHT THE NEW RAV4 AND SPECIFICALLY CHOSE A MODEL WITH LDA/SA HOPING THAT IT ASSISTS ME. AFTER DRIVING OVER 1000 MILES BETWEEN THE CITIES, I AM COMPLETELY DISAPPOINTED WITH THIS FEATURE. IT SUPPOSED TO ALERT ME WHEN THE CAR DRIVES OVER THE LINES WITH A BUZZER AND GENTLE NUDGE TO THE STEERING WHEEL. I CANNOT HEAR THE BUZZER AND FEEL ANY ACTION ON THE STEERING WHEEL. I WENT TO THE CULVER CITY TOYOTA DEALER TWO TIMES IN ATTEMPTING TO HAVE THIS PROBLEM FIXED. BOTH TIMES I HAVE BEEN TOLD THAT THE SYSTEM WORKS AS DESIGNED. DURING A TEST DRIVE WITH THE MASTER TECHNICIAN, WITH RADIO OFF, AT SPEED LESS 50MPH, SO WITH THE MINIMAL ROAD NOISE, I COULD NOT HEAR THE BUZZER. I DO CLEARLY HEAR THE BUZZER OF THE PARKING SONAR OR PRE-COLLISION WARNING. SO THIS IS AT BEST USELESS FEATURE, AT WORST IT IS A DISTRACTION WHEN TRYING TO MAKE IT WORK AT A HIGHWAY.",
        "vin": "JTMJJREVXJD"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/09/2019",
        "dateOfIncident": "05/08/2019",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206563,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2018 TOYOTA RAV4. THE CONTACT STATED AFTER PARKING AND RETURNING TO THE VEHICLE IN THEIR GARAGE, SMOKE WAS SEEN COMING FROM THE VEHICLE. THE CONTACT QUICKLY ENTERED THE VEHICLE AND REVERSED THE VEHICLE OUT OF THE GARAGE.  THE FIRE DEPARTMENT WAS CALLED AND EXTINGUISHED THE FIRE. A POLICE REPORT WAS FILED. NO INJURIES WERE SUSTAINED. THE VEHICLE WAS DESTROYED BY THE FIRE. THE CONTACT CALLED FRANK FLETCHER TOYOTA (2209 S RANGELINE RD, JOPLIN, MO 64804 (417) 622-5447) AND WAS INFORMED THAT SINCE THE VEHICLE WAS MOVED THEY COULD OFFER NO ASSISTANCE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 48,000. THE VIN WAS NOT AVAILABLE.",
        "vin": "2T3JFREV8GW"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/08/2019",
        "dateOfIncident": "02/13/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206270,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA RAV4. WHILE DRIVING 20 MPH OR LESS, THE VEHICLE HAS STALLED WHEN THE ACCELERATOR PEDAL WAS RELEASED IN MOVING TRAFFIC 5 TIMES. THE FAILURE OCCURRED FOUR TIMES IN APRIL, 3 TIMES WHILE DRIVING TO WORK. THE CONTACT TOOK THE VEHICLE TO TOYOTA ESCONDIDO (231 E LINCOLN PKWY, ESCONDIDO, CA 92026, (760) 300-1112) TO BE DIAGNOSED AND THREE ABNORMAL CODES APPEARED, WHICH INDICATED ROUGH IDLING AND FAILURE WITH THE VEHICLE STARTING. THE MANUFACTURING WAS CONTACTED AND COULD NOT LOCATE A FAILURE. THE CONTACT WROTE TO THE DEALER'S OWNER AND REQUESTED THAT THEY EXTEND THE WARRANTY; HOWEVER, THE REQUEST WAS DENIED. THE MANUFACTURER PROMISED TO CALL THE CONTACT BACK, BUT DID NOT CALL. THE FAILURE MILEAGE WAS 8,652. *BF  CONSUMER STATED TOYTOA WAS UNABLE TO ESTABLISH A ROOT CAUSE.     'PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'*JB",
        "vin": "2T3ZFREV1JW"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/02/2019",
        "dateOfIncident": "04/02/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205338,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2018 TOYOTA RAV4 HAS STALLED 5 TIMES WHILE DRIVING ON CITY STREETS IN MOVING TRAFFIC, FIRST TIME IN FEB 2019 WHILE DRIVING HOME FROM WORK, IN APRIL THREE TIMES WHILE DRIVING TO WORK AND ONE TIME WHILE DRIVING HOME FROM WORK(RUSH HOUR).  ALL DOCUMENTED WITH TOYOTA. OCCURS WHEN I TAKE MY FOOT OFF THE GAS WHILE DRIVING, AND DIFFICULTY RESTARTING AFTER IT STALLS WITH LOSS OF POWER AND SPUTTERING.  'CHARGING SYSTEM MALFUNCTION' WARNING MSG APPEARED ON DASHBOARD(I TOOK PHOTO AND EMAILED TO TOYOTA). I FOLLOWED INSTRUCTIONS IN 2018 TOYOTAL RAV4 OWNER'S MANUAL \"STOP THE CAR IMMEDIATELY...CONTINUING TO DRIVE THE VEHICLE MAY BE DANGEROUS\".  HAD CAR TOWED TO TOYOTA IMMEDIATELY. 3 TROUBLE CODES WERE RECORDED P1603(ENGINE STALL), P1604 STARTABILITY MALFUNCTION, AND P1605(ROUGH IDLING), HOWEVER THEY WERE UNABLE TO DETERMINE ROOT CAUSE OF STALLING AND REFUSED TO KEEP MY CAR TO DO FURTHER ANALYSIS DESPITE THE FACT THAT I TOLD THEM I DID NOT FEEL SAFE DRIVING VEHICLE, AND MY CAR IS STILL UNDER COMPREHENSIVE WARRANTY COVERAGE. I CONTACTED CORPORATE, AND THEY RESTATED DEALER CONCLUSIONS AND WOULD NOT ALLOW ME TO SPEAK TO A FIELD TECH SPECIALIST.  I THEN EMAILED AND WROTE A LETTER TO VP SALES OF TOYOTA, ANDREW GILLELAND.  REP FROM EXECUTIVE OFFICE CALLED ME. I ASKED FOR TOYOTA TO PROVIDE ME WITH EITHER TRANSPORTATION ASSISTANCE AND A NO COST-TO-ME EXTENDED COMPREHENSIVE WARRANTY UNTIL THE UNDERLYING CAUSE IS DETERMINED AND WITHOUT FURTHER STALLING INCIDENCES, OR A REPLACEMENT VEHICLE. HE REFUSED, DESPITE ALL THE SIGNIFICANT POTENTIALLY DANGEROUS SAFETY ISSUES IN A VEHICLE WITH LESS THAN 9,200 MILES.  TOYOTA DOES NOT APPEAR TO BE CONCERNED WITH RELIABILITY, PEACE OF MIND, AND MOST OF ALL SAFETY. I HAVE A CASE # WITH TOYOTA. I RECENTLY DISCOVERED THERE ARE SEVERAL OTHER REPORTS ON THIS SITE WITH SAME STALLING ISSUES AS MY CAR.",
        "vin": "2T3ZFREV1JW"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/02/2019",
        "dateOfIncident": "04/02/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205340,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2018 TOYOTA RAV4 HAS STALLED 5 TIMES WHILE DRIVING ON CITY STREETS IN MOVING TRAFFIC, FIRST TIME IN FEB 2019 WHILE DRIVING HOME FROM WORK, IN APRIL THREE TIMES WHILE DRIVING TO WORK AND ONE TIME WHILE DRIVING HOME FROM WORK(RUSH HOUR).  ALL DOCUMENTED WITH TOYOTA. OCCURS WHEN I TAKE MY FOOT OFF THE GAS WHILE DRIVING, AND DIFFICULTY RESTARTING AFTER IT STALLS WITH LOSS OF POWER AND SPUTTERING.  'CHARGING SYSTEM MALFUNCTION' WARNING MSG APPEARED ON DASHBOARD(I TOOK PHOTO AND EMAILED TO TOYOTA). I FOLLOWED INSTRUCTIONS IN 2018 TOYOTAL RAV4 OWNER'S MANUAL \"STOP THE CAR IMMEDIATELY...CONTINUING TO DRIVE THE VEHICLE MAY BE DANGEROUS\".  HAD CAR TOWED TO TOYOTA IMMEDIATELY. 3 TROUBLE CODES WERE RECORDED P1603(ENGINE STALL), P1604 STARTABILITY MALFUNCTION, AND P1605(ROUGH IDLING), HOWEVER THEY WERE UNABLE TO DETERMINE ROOT CAUSE OF STALLING AND REFUSED TO KEEP MY CAR TO DO FURTHER ANALYSIS DESPITE THE FACT THAT I TOLD THEM I DID NOT FEEL SAFE DRIVING VEHICLE, AND MY CAR IS STILL UNDER COMPREHENSIVE WARRANTY COVERAGE. I CONTACTED CORPORATE, AND THEY RESTATED DEALER CONCLUSIONS AND WOULD NOT ALLOW ME TO SPEAK TO A FIELD TECH SPECIALIST.  I THEN EMAILED AND WROTE A LETTER TO VP SALES OF TOYOTA, ANDREW GILLELAND.  REP FROM EXECUTIVE OFFICE CALLED ME. I ASKED FOR TOYOTA TO PROVIDE ME WITH EITHER TRANSPORTATION ASSISTANCE AND A NO COST-TO-ME EXTENDED COMPREHENSIVE WARRANTY UNTIL THE UNDERLYING CAUSE IS DETERMINED AND WITHOUT FURTHER STALLING INCIDENCES, OR A REPLACEMENT VEHICLE. HE REFUSED, DESPITE ALL THE SIGNIFICANT POTENTIALLY DANGEROUS SAFETY ISSUES IN A VEHICLE WITH LESS THAN 9,200 MILES.  TOYOTA DOES NOT APPEAR TO BE CONCERNED WITH RELIABILITY, PEACE OF MIND, AND MOST OF ALL SAFETY. I HAVE A CASE # WITH TOYOTA. I RECENTLY DISCOVERED THERE ARE SEVERAL OTHER REPORTS ON THIS SITE WITH SAME STALLING ISSUES AS MY CAR.",
        "vin": "2T3ZFREV1JW"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/02/2019",
        "dateOfIncident": "04/02/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205342,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2018 TOYOTA RAV4 HAS STALLED 5 TIMES WHILE DRIVING ON CITY STREETS IN MOVING TRAFFIC, FIRST TIME IN FEB 2019 WHILE DRIVING HOME FROM WORK, IN APRIL THREE TIMES WHILE DRIVING TO WORK AND ONE TIME WHILE DRIVING HOME FROM WORK(RUSH HOUR).  ALL DOCUMENTED WITH TOYOTA. OCCURS WHEN I TAKE MY FOOT OFF THE GAS WHILE DRIVING, AND DIFFICULTY RESTARTING AFTER IT STALLS WITH LOSS OF POWER AND SPUTTERING.  'CHARGING SYSTEM MALFUNCTION' WARNING MSG APPEARED ON DASHBOARD(I TOOK PHOTO AND EMAILED TO TOYOTA). I FOLLOWED INSTRUCTIONS IN 2018 TOYOTAL RAV4 OWNER'S MANUAL \"STOP THE CAR IMMEDIATELY...CONTINUING TO DRIVE THE VEHICLE MAY BE DANGEROUS\".  HAD CAR TOWED TO TOYOTA IMMEDIATELY. 3 TROUBLE CODES WERE RECORDED P1603(ENGINE STALL), P1604 STARTABILITY MALFUNCTION, AND P1605(ROUGH IDLING), HOWEVER THEY WERE UNABLE TO DETERMINE ROOT CAUSE OF STALLING AND REFUSED TO KEEP MY CAR TO DO FURTHER ANALYSIS DESPITE THE FACT THAT I TOLD THEM I DID NOT FEEL SAFE DRIVING VEHICLE, AND MY CAR IS STILL UNDER COMPREHENSIVE WARRANTY COVERAGE. I CONTACTED CORPORATE, AND THEY RESTATED DEALER CONCLUSIONS AND WOULD NOT ALLOW ME TO SPEAK TO A FIELD TECH SPECIALIST.  I THEN EMAILED AND WROTE A LETTER TO VP SALES OF TOYOTA, ANDREW GILLELAND.  REP FROM EXECUTIVE OFFICE CALLED ME. I ASKED FOR TOYOTA TO PROVIDE ME WITH EITHER TRANSPORTATION ASSISTANCE AND A NO COST-TO-ME EXTENDED COMPREHENSIVE WARRANTY UNTIL THE UNDERLYING CAUSE IS DETERMINED AND WITHOUT FURTHER STALLING INCIDENCES, OR A REPLACEMENT VEHICLE. HE REFUSED, DESPITE ALL THE SIGNIFICANT POTENTIALLY DANGEROUS SAFETY ISSUES IN A VEHICLE WITH LESS THAN 9,200 MILES.  TOYOTA DOES NOT APPEAR TO BE CONCERNED WITH RELIABILITY, PEACE OF MIND, AND MOST OF ALL SAFETY. I HAVE A CASE # WITH TOYOTA. I RECENTLY DISCOVERED THERE ARE SEVERAL OTHER REPORTS ON THIS SITE WITH SAME STALLING ISSUES AS MY CAR.",
        "vin": "2T3ZFREV1JW"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/02/2019",
        "dateOfIncident": "04/02/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205343,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2018 TOYOTA RAV4 HAS STALLED 5 TIMES WHILE DRIVING ON CITY STREETS IN MOVING TRAFFIC, FIRST TIME IN FEB 2019 WHILE DRIVING HOME FROM WORK, IN APRIL THREE TIMES WHILE DRIVING TO WORK AND ONE TIME WHILE DRIVING HOME FROM WORK(RUSH HOUR).  ALL DOCUMENTED WITH TOYOTA. OCCURS WHEN I TAKE MY FOOT OFF THE GAS WHILE DRIVING, AND DIFFICULTY RESTARTING AFTER IT STALLS WITH LOSS OF POWER AND SPUTTERING.  'CHARGING SYSTEM MALFUNCTION' WARNING MSG APPEARED ON DASHBOARD(I TOOK PHOTO AND EMAILED TO TOYOTA). I FOLLOWED INSTRUCTIONS IN 2018 TOYOTAL RAV4 OWNER'S MANUAL \"STOP THE CAR IMMEDIATELY...CONTINUING TO DRIVE THE VEHICLE MAY BE DANGEROUS\".  HAD CAR TOWED TO TOYOTA IMMEDIATELY. 3 TROUBLE CODES WERE RECORDED P1603(ENGINE STALL), P1604 STARTABILITY MALFUNCTION, AND P1605(ROUGH IDLING), HOWEVER THEY WERE UNABLE TO DETERMINE ROOT CAUSE OF STALLING AND REFUSED TO KEEP MY CAR TO DO FURTHER ANALYSIS DESPITE THE FACT THAT I TOLD THEM I DID NOT FEEL SAFE DRIVING VEHICLE, AND MY CAR IS STILL UNDER COMPREHENSIVE WARRANTY COVERAGE. I CONTACTED CORPORATE, AND THEY RESTATED DEALER CONCLUSIONS AND WOULD NOT ALLOW ME TO SPEAK TO A FIELD TECH SPECIALIST.  I THEN EMAILED AND WROTE A LETTER TO VP SALES OF TOYOTA, ANDREW GILLELAND.  REP FROM EXECUTIVE OFFICE CALLED ME. I ASKED FOR TOYOTA TO PROVIDE ME WITH EITHER TRANSPORTATION ASSISTANCE AND A NO COST-TO-ME EXTENDED COMPREHENSIVE WARRANTY UNTIL THE UNDERLYING CAUSE IS DETERMINED AND WITHOUT FURTHER STALLING INCIDENCES, OR A REPLACEMENT VEHICLE. HE REFUSED, DESPITE ALL THE SIGNIFICANT POTENTIALLY DANGEROUS SAFETY ISSUES IN A VEHICLE WITH LESS THAN 9,200 MILES.  TOYOTA DOES NOT APPEAR TO BE CONCERNED WITH RELIABILITY, PEACE OF MIND, AND MOST OF ALL SAFETY. I HAVE A CASE # WITH TOYOTA. I RECENTLY DISCOVERED THERE ARE SEVERAL OTHER REPORTS ON THIS SITE WITH SAME STALLING ISSUES AS MY CAR.",
        "vin": "2T3ZFREV1JW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/17/2019",
        "dateOfIncident": "10/16/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11197027,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA RAV4. WHILE DRIVING, THE BRAKE PEDAL HAD TO BE DEPRESSED TO THE FLOORBOARD TO STOP THE VEHICLE. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS NOT TAKEN TO A DEALER OR INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 1,055.",
        "vin": "2T3RFREV1JW"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/03/2019",
        "dateOfIncident": "11/25/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193729,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE THE CAR WAS PURCHASED ON 11/25/2018, THE FRONT BRAKES CREAK WHILE ON DRIVE AND THE CAR PULLS TO THE LEFT. I TOOK IT TO THE DEALERSHIP AND THEY SAID NOTHING WAS WRONG WITH THE BRAKES. THEY ASKED THAT I WAIT UNTILL 500 MILES TO LOOK AT THE ALIGNMENT.  I TOOK IT IN AGAIN FOR THE BRAKES AND THE SERVICE MANAGER SAT IN THE CAR AND HE HEARD THE BRAKE NOISE. HE RAN IT THROUGH TESTS AND SAID NOTHING WAS FOUND. HE WAS GOING TO WAIT FOR A TOYOTA REPRESENTATIVE TO COME AND THEN THEY WOULD LOOK AT IT BEFORE ANYTHING WAS DONE. IT IS NOW APRIL AND THEY STILL HAVE NOT ADDRESSED THE BRAKE ISSUE. THEY DID ADJUST THE ALIGNMENT DURING THE TIME, BUT IT STILL PULLS TO THE LEFT. AFTER THE ALIGNMENT, THERE WAS A SLIDING GRINDING NOISE ON THE LEFT FRONT BRAKE. THE NOISES OCCUR WHEN YOU COME TO A STOP AND RELEASE THE BRAKES. BOTH ISSUES HAVE BEEN PRESENT SINCE THE CAR WAS PURCHASED HAVE NOT BEEN RESOLVED.",
        "vin": "2T3RFREV3JW"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/01/2019",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192834,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA RAV4. WHEN THE VEHICLE WAS TAKEN TO A CAR WASH, THE CONTACT NOTICED WATER LEAKING ONTO THE FRONT PASSENGER FLOOR. SUN TOYOTA (3001 US-19, HOLIDAY, FL 34691, (727) 310-3070) PERFORMED A TEST ON THE VEHICLE WITH THE SAME HIGH PRESSURE CAR WASH AND WAS ABLE TO DUPLICATE THE FAILURE. THE FAILURE ALSO OCCURRED WITH THREE SIMILAR VEHICLES THAT WERE TESTED. THE MANUFACTURER STATED THAT THE FAILURE WAS NOT DUE TO A DESIGN FLAW, AND ADVISED THE CONTACT TO USE A DIFFERENT CAR WASH UNTIL THEY COULD MAKE A DESIGN CHANGE. THE DEALER KEPT THE VEHICLE FOR 15 DAYS AND PROVIDED A LOANER VEHICLE. THE DEALER DID NOT REQUEST THE LOANER BACK UNTIL THE CONTACT HIRED AN ATTORNEY. THE MANUFACTURER STATED THAT THE DEALER HAD TO INDICATE THAT THERE WAS A DEFECT WITH THE VEHICLE. THE ATTORNEY WAS WAITING TO HEAR FROM THE DEALER. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS UNKNOWN. THE FAILURE MILEAGE WAS 400.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/16/2019",
        "dateOfIncident": "02/06/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187210,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTO LIGHT FEATURE DOES NOT WORK PROPERLY: ON MANY OCCASIONS (ABOUT 2-3 TIMES PER WEEK), WHILE CAR IS IN MOTION EARLY IN THE MORNING AND AT NIGHT, WITH THE HEADLIGHTS IN THE \"AUTO\" MODE AND THE AUTOMATIC HIGH BEAM FEATURE ENABLED.   WHEN STARTING THE CAR, THE AUTO LIGHT FUNCTION SEEMS TO BE DELAYED.  IT DOES NOT WORK INITIALLY BUT STARTS WORKING AFTER THE CAR IS IN MOTION FOR SEVERAL MINUTES.  THE AUTO LIGHT FEATURE IS NOT STAYING ON AFTER CAR IS IN MOTION AT NIGHT, LIGHTS TURN OFF BY THEMSELVES FOR A FEW SECONDS CAUSING ME TO DRIVE WITHOUT LIGHTS BEFORE THEY TURN THEMSELVES BACK ON. LUCKILY I WAS DRIVING SLOWLY, OTHERWISE IT COULD HAVE CAUSED A SERIOUS ACCIDENT.   I TOOK THE CAR TO THE DEALER A FEW TIMES TO FIX THE ISSUE BUT THEY COULDN'T FIGURE OUT THE CAUSE OF THE PROBLEM. NO SOLUTION.  THEY SUGGUESTED THAT I MANUALLY OPERATE THE LIGHTS.  I DO NOT THINK THAT I OR ANY OTHER CAR OWNERS SHOULD PAY MONEY FOR A BRAND NEW CAR THAT OFFERS CONVENIENCE FEATURES THAT DO NOT WORK.  I WAS TOLD THAT THERE IS A MECHANIC AT THIS PARTICULAR DEALERSHIP THAT OWNS THE SAME CAR MODEL AND IS HAVING THE SAME ISSUE WITH HIS CAR. THIS ISSUE IS NEW AND TO MY KNOWLEDGE, THERE IS NOT A TECHNICAL SERVICE BULLETIN.  ALSO, THERE ARE TIMES THAT I SMELL GAS IN THE CAR WHILE THE CAR IS IN MOTION. THE DEALER COULDN'T FIND ANY GAS LEAKS WHEN CHECKED.",
        "vin": "JTMZFREV0JJ"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/11/2019",
        "dateOfIncident": "01/23/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185930,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "REPEATEDLY, WHILE IN MOTION, WITH THE HEADLIGHTS IN THE \"AUTO\" MODE, AND THE \"AUTOMATIC HIGH BEAM FEATURE ENABLED (WHICH SWITCHES THE HEADLIGHTS FROM HIGH BEAM TO LOW BEAM AUTOMATICALLY BASED ON THE PRESENCE OF ONCOMING HEADLIGHTS/TAIL LIGHTS AHEAD/AMBIENT LIGHT LEVELS) THE AUTO HIGHBEAM FEATURE WILL DISABLE ITSELF, GENERALLY TIED TO THE PASSING OF A CAR WITH BRIGHT LIGHTS.  WHEN THIS FEATURE DISABLES ITSELF IT PREVENTS ALL USE OF HIGHBEAMS.  THE ONLY WAY TO GET HIGHBEAMS WHILE THE FEATURE IS \"DISABLED\" (EVEN IN COMPLETE DARKNESS) IS TO \"ROTATE\" THE STALK CONTROL AWAY FROM \"AUTO HEADLIGHT\" TO \"MANUAL HEADLIGHT\". THE FEATURE EVENTUALLY RE-ENABLES ITSELF, BUT USUALLY TAKES A NUMBER OF MINUTES, LEAVING ME WITHOUT THE SAFETY OF HIGHBEAMS FOR THAT PERIOD, UNLESS I GO THROUGH THE CUMBERSOME ACT OF TURNING HEADLAMPS TO \"MANUAL\".  THIS IS PARTICULARLY DANGEROUS DURING MY COMMUTE WHERE I DRIVE A NUMBER OF MILES ON UNLIT STATE ROADS.  I RELY ON HIGHBEAMS TO ALERT ME TO THE PRESENCE OF DEER AND OTHER ANIMALS CROSSING THE ROAD WHICH OCCURS ROUTINELY.  NOT HAVING HIGHBEAMS FOR A NUMBER OF MILES EXPOSES ME TO THE RISK OF NOT SEEING THESE HAZARDS IN TIME TO REACT PROPERLY.  IN ADDITION, HAVING TO DIVERT MY ATTENTION TO WHETHER THIS FEATURE HAS DISABLED ITSELF AND TAKING MANUAL ACTION TO CIRCUMVENT THE ISSUE IS A DISTRACTION WHILE MY FOCUS SHOULD BE ON POSSIBLE HAZARDS.  I HAVE REPORTED THE ISSUE TO TOYOTA.  CASE NUMBER [XXX] HAS BEEN ASSIGNED.  A TOYOTA CASE MANAGER CONTACTED ME AND STATED THAT SHE EXPERIENCES THE VERY SAME ISSUE WITH HER 2018 RAV4 BUT THERE ARE NO FIXES IDENTIFIED BY TOYOTA FOR THE ISSUE, SO THEREFORE THERE IS NOTHING SHE OR THE DEALER CAN DO.  I STRONGLY FEEL THIS IS A SAFETY ISSUE IN THAT THERE IS A RISK THAT AN ACCIDENT WILL OCCUR, POSSIBLY THE STRIKING OF A PEDESTRIAN, DUE TO POOR VISIBILITY OR DISTRACTION TRYING TO OVERRIDE THE FEATURE WHILE DRIVING.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TT",
        "vin": "2T3RFREV0JW"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/05/2019",
        "dateOfIncident": "02/24/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184379,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2018 RAV4 WINDSHIELD SPONTANEOUSLY CRACKED STARTING AT THE POINT WHERE THE WINDSHIELD CAMERA IS MOUNTED ON THE FRONT WITH REAR VIEW MIRROR ATTACHED.  WE DO NOT RECALL THAT ANYTHING HIT THE WINDSHIELD, AND THE CRACK APPEARED ON THE CAR OVERNIGHT WHILE PARKED IN OUR DRIVEWAY.  THE CRACK STARTS AT THE TOP OF THE WINDSHIELD WHERE THE SAFETY SENSE 2.0 CAMERA IS MOUNTED, AND EXTENDS DOWN ALMOST HALFWAY TO THE BOTTOM, AND THEN MAKES A 90 DEGREE TURN TOWARD THE DRIVER'S SIDE DOOR, EXTENDS FOR ABOUT 1 1/2 FT., AND THEN MAKES ANOTHER 90 DEGREE TURN DOWN TOWARD THE WINDSHIELD WIPER FOR APPROXIMATELY 3\".  THE PHOTO DOES NOT SHOW HOW LONG THE CRACK IS, BUT MOSTLY WHERE IT BEGINS.  WE HAVE ADDED RED LINES TO SHOW THE FIRST 90 DEGREE TURN, AND DOTTED LINE TO SHOW THE EXTENDED CRACK THAT IS NOT VISIBLE, AND THE 2ND 90 DEGREE TURN.  WE BELIEVE THAT THE WINDSHIELD DESIGN AND CONSTRUCTION IS FAULTY, AND WE UNDERSTAND THAT THE PRIUS MODEL IS ALREADY IN LEGAL TALKS WITH TOYOTA OVER THE SAME PROBLEM.  THIS SHOULD BE A RECALL BY TOYOTA, ALTHOUGH OUR TOYOTA DEALERSHIP IS NOT TAKING RESPONSIBILITY FOR THIS SPONTANEOUS CRACKED WINDSHIELD WHICH WE DID NOT CAUSE.  THE DEALERSHIP QUOTED A PRICE TO US FOR THEM TO REPLACE IT FOR JUST UNDER $1,600.  WE FEEL THAT THIS IS WRONG AND UNFAIR.",
        "vin": "2T3BFREV6JW"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/01/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183332,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR CAR IS BRAND NEW.  HOWEVER WE EXPERIENCED THAT BOTH FRONT DRIVER AND FRONT PASSENGER SEATS HAVE TERRIBLE BACK SUPPORT.  MY WIFE AND I BOTH SUFFER BACK PAINS AFTER SEATING FOR MORE THAN 10 MINUTES IN THE FRONT SEAT.",
        "vin": "JTMWFREV3JJ"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/01/2019",
        "dateOfIncident": "02/25/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183530,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A NEW XLE AND THE HEADLIGHTS ARE DANGEROUS. THESE ARE PROJECTOR HEADLIGHTS THAT CAST A VERY FOCUSED BEAM FORWARD. IT IS FRIGTENING WHEN YOU DRIVE IN SOME ROADS WITHOUT A LOT OF AMBIENT LIGHT. WITH THE LOW BEAMS ON, IT IS LIKE SOMEONE PAINTED THE TOP HALF OF MY WINDSHIELD BLACK. THERE IS LITTLE PERIPHERAL ILLUMINATION, SO I CAN SEE WHAT IS DIRECTLY IN FRONT OF ME, AND NOTHING ELSE. WHERE THE ROAD INCLINES DOWN, THE ILLUMINATION CUTS OUT JUST A FEW FEET OFF THE GROUND, BELOW THE LEVEL OF THINGS LIKE STOP SIGNS. THERE IS ABSOLUTELY NO PERIPHERAL ILLUMINATION RIGHT AT THE FRONT OF THE CAR, SO WHEN I TURN, I CAN'T SEE WHAT I'M TURNING INTO UNTIL IT'S DIRECTLY IN FRONT OF MY CAR, LIKE PEDESTRIANS.  TO MAKE MATTERS WORSE, THE DEALERSHIP TOLD ME NOT TO USE LED BULBS, BECAUSE IT COULD CAUSE ELECTRICAL ISSUES WITH THE CAR.",
        "vin": "JTMWFREV9JJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/28/2019",
        "dateOfIncident": "02/19/2019",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183106,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING TO WORK AROUND 740AM ON 287 SOUTH JUST PAST RT 24. DASHBOARD HAS \"4WD\" WARNING AND SMOKE COMING OUT FROM HOOD. I QUICKLY MOVED TO THE SHOULDER AND FIRE BROKE OUT BEFORE CAR CAME TO FULL STOP, ALL WITHIN ONE MINUTE. I BARELY ESCAPE THE CAR AND CALLED POLICE AND FIRE DEPT. THEY CAME AND PUT OFF THE FIRE. THERE ARE TWO EXPLOSIONS BEFORE THE FIRE WAS PUT OFF.",
        "vin": "JTMRFREV4JD"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/21/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181533,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "IF YOU DRIFT AWAY FROM ANOTHER VEHICLE OR OBSTACLE (PEDESTRIAN, BICYCLE, ETC) THAT IS ALSO DRIFTING INTO YOUR LANE, THE LDA SYSTEM (LANE DEPARTURE ASSIST, WHICH IS TOUTED AS A SAFETY FEATURE) WILL PULL YOU BACK TOWARDS THE OBSTACLE YOU ARE TRYING TO AVOID. CLEARLY THIS IS A SAFETY HAZARD AND SHOULD BE REMOVED AS A \"FEATURE\" FROM THE VEHICLE. TOYOTA SHOULD ALSO STOP CALLING THIS A SAFETY FEATURE.    SECONDLY, THE RADAR ASSISTED CRUISE CONTROL WILL START BRAKING IF IT SEES THE VEHICLE IN FRONT IS SLOWING DOWN. HOWEVER, IF THE SYSTEM THEN THINKS AN ACCIDENT IS IMMINENT, THE CRASH WARNING SHOWS UP AND THE CRUISE CONTROLLED BRAKING IS THEN DISABLED CAUSING THE VEHICLE TO STOP THE BRAKING PROCESS, AND THEREBY CAUSING A SAFETY HAZARD SINCE THE CAR WILL NOW COAST INTO THE OBSTACLE. AGAIN, THIS IS A SURPRISING AND TERRIBLE IMPLEMENTATION OF THIS SYSTEM THAT SHOULD BE REMOVED OR FIXED.",
        "vin": "2T3BFREV5JW"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/20/2019",
        "dateOfIncident": "02/17/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181327,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA RAV4. WHILE DRIVING APPROXIMATELY 65 MPH IN SNOW AND ICY CONDITIONS, THE WARNING MESSAGES SUDDENLY DISPLAYED INDICATING THAT THE BRAKES AND SAFETY FEATURES WERE NOT AVAILABLE, AND INSTRUCTED THE DRIVER NOT TO DRIVE THE VEHICLE. WHEN THE VEHICLE WAS TURNED OFF AND RESTARTED, IT RESUMED NORMAL OPERATION. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. LOVE TOYOTA (215 E. FAIRMOUNT AVE, LAKEWOOD, NY) WAS NOTIFIED OF THE FAILURE. THE MANUFACTURER WAS NOT NOTIFIED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 7,000.  *BF  CONSUMER LET THE CAR SIT FOR 15\", CLEARED THE ICE OFF. THE TECHNICIAN STATED FEATURE WERE SATELLITE ENABLED AND PROBABLY THE ICE INTERSECTED WITH THE SIGNALS.*JB",
        "vin": "2T3RFREV3JW"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/17/2019",
        "dateOfIncident": "02/13/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180636,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WINDSHIELD CRACKED ON THE PASSENGER'S SIDE.  NO POINT OF IMPACT (AS IF IT WAS STRUCK BY A ROCK).  THINKING IT MAY HAVE TO DO WITH THE WEATHER.",
        "vin": "2T3WFREV6JW"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/10/2019",
        "dateOfIncident": "02/06/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11176121,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE CAR JUST SHUT DOWN AND THE CODE READ CHARGING SYSTEM MALFUNCTION, WE HAD IT TOWED TO THE DEALERSHIP AND THEY ERASED THE CODES BUT THEY ACKNOWLEDGED THEY EXISTED HOWEVER THEY SAID THERE IS NOTHING WRONG AND WANT US TO CONTINUE DRIVING THIS VEHICLE WITH NO ASSURANCE IT WILL NOT HAPPEN AGAIN",
        "vin": "2T3WFREV6JW"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/30/2019",
        "dateOfIncident": "01/26/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173003,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS IN A PARKING SPACE; FOOT ON BRAKE.  WENT TO SHIFT THE VEHICLE INTO PARK AND IT ACCELERATED INTO THE GLASS / BUILDING I WAS PARKED IN FRONT OF.  AIR BAGS DID NOT DEPLOY.",
        "vin": "JTMRFREV3JJ"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/24/2019",
        "dateOfIncident": "08/04/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171814,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA RAV4. THE CONTACT STATED THAT THE FUEL WAS RUNNING OUT QUICKLY IN THE VEHICLE. IN ADDITION, THE EMISSION (ECO) WARNING INDICATOR ILLUMINATED CONTINUOUSLY. THE VEHICLE WAS TAKEN TO FRED ANDERSON TOYOTA (9101 GLENWOOD AVE, RALEIGH, NC 27617) AND LEITH TOYOTA (8005 CAPITAL BLVD, RALEIGH, NC 27616), BUT THEY FAILED TO DIAGNOSE THE VEHICLE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 6,900.",
        "vin": "2T3WFREV6JW"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/24/2019",
        "dateOfIncident": "01/23/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171821,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA RAV4. WHILE DRIVING APPROXIMATELY 60 MPH, THE CONTACT HEARD AN ABNORMALLY LOUD NOISE COMING FROM THE AREA OF THE MOON ROOF. SUDDENLY, THE MOON ROOF EXPLODED AND GLASS FELL ONTO THE DRIVER. THERE WERE NO INJURIES. THE VEHICLE WAS CAUTIOUSLY DRIVEN TO PRECISION TOYOTA OF TUCSON (700 W WETMORE RD, TUCSON, AZ 85705, (520) 795-5565) WHERE IT WAS DIAGNOSED THAT THE MOON ROOF NEEDED TO BE REPLACED. THE CONTACT WAS NOT PROVIDED A LOANER VEHICLE OPTION. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN AND FAILURE MILEAGE WERE NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/13/2019",
        "dateOfIncident": "01/11/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166720,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AUTO HIGH BEAM FEATURE HAS BEEN CHOOSING TO DISENGAGE AND TURN ITSELF OFF AT RANDOM. THERE ARE ALSO TIMES THAT AT NIGHT, UPON START-UP, THE AUTO HIGH BEAM SYSTEM WILL REFUSE TO ENGAGE (LIGHT SWITCH TURNED TO AUTO AND STALK PUSHED FORWARD, DRIVING OVER 25 MPH).",
        "vin": "2T3DFREV6JW"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/07/2019",
        "dateOfIncident": "01/04/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164997,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING MY 2018 TOYOTA RAV4 ON THE HIGHWAY WHEN THE SUNROOF GLASS EXPLODED. NO OTHER VEHICLES WERE ON THE HIGHWAY AT THE TIME AND NO ROCK OR OTHER OBJECT WAS INVOLVED IN CAUSING THE EXPLOSION.",
        "vin": "2T3WFREV0JW"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/02/2019",
        "dateOfIncident": "12/24/2018",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164698,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER PURCHASING OUR BRAND-NEW 2018 RAV4 FROM AUTHORIZED TOYOTA DEALER, WE WERE HEADING BACK HOME. ON OUR WAY, WE NOTICED BURNING SMELL FOLLOWED BY BLACK SMOKE FILLED FRONT SIDE OF THE CABIN. I QUICKLY MOVED MY CAR TO THE RIGHT SIDE PARKING LOT. WHILE CHANGING THE LANE I COULD NOT EVEN SEE THE RIGHT MIRROR BECAUSE OF THE BLACK SMOKE IN THE CABIN. AS SOON AS I PARKED THE CAR AND WE GOT OFF THE CAR,  WITHIN A FEW SECONDS FLAMES FROM THE HOODS WERE NOTICED  I CALLED EMERGENCY SERVICE (911) AND TO OUR DISBELIEF TO WATCH OUR NEW CAR BURNING IN FRONT OF US. IT WAS ONLY 15 MINS DRIVE FROM DEALER WHEN WE THE INCIDENT HAPPENED. IT TOOK ONLY 10 MINS TO SEE MY CAR WAS DESTROYED BY FLAMES. I COULD NOT GET ANYTHING OUT FROM FRONT OR BACK SEATS",
        "vin": "JTMWFREV1JJ"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/29/2018",
        "dateOfIncident": "11/27/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154684,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Yokohama Tire Corporation",
                "productMake": "YOKOHAMA",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "THE TOYOTA RAV4 WAS HEADING EAST ON I-10 FREEWAY NEAR SKY HARBOR AIRPORT ARIZONA.  A SUDDEN POP SOUND WITH STEERING PROBLEM FOLLOWED... LUCKILY IT WAS 11PM (11/27/2018) AND NO CARS AROUND, AND ABLE TO QUICKLY AND SAFELY DRIVING THE RAV4 TO THE SHOULDER OF FREEWAY.  ROADSIDE ASSISTANCE (PRE-PAID PROGRAM) DISPATCHED A TECHNICIAN TO REPLACE DEFECTIVE FRONT PASSENGER-SIDE TIRE WITH SPARE TIRE.",
        "vin": "JTMZFREV0HJ"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/27/2018",
        "dateOfIncident": "05/30/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154187,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA RAV4. WHILE DRIVING AT NIGHT OR AFTER DUSK, THE HEADLAMPS PROVIDED INSUFFICIENT ILLUMINATION TO OPERATE THE VEHICLE SAFELY. THE CONTACT WAS CONCERNED THAT THE FAILURE WAS DUE TO A FEATURE ON THE VEHICLE WHERE THE HEADLIGHTS DIM WHEN APPROACHING ONCOMING TRAFFIC. THE VEHICLE WAS TAKEN TO UEBELHOR TOYOTA (LOCATED AT 788 W 12TH AVE, JASPER, IN 47546, (812) 482-2222) TO BE DIAGNOSED AND THEY STATED THAT THE VEHICLE PERFORMED AS INTENDED. ADDITIONALLY, THE CONTACT STATED THAT THE ILLUMINATION WAS INADEQUATE IN RURAL AREAS, BUT WAS NOT AFFECTED IN AN URBAN SETTING. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE APPROXIMATE FAILURE MILEAGE WAS 4,200.",
        "vin": "JTMBFREV1JJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/10/2018",
        "dateOfIncident": "08/28/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150699,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 8/28/18 MY  RAV4 SUNROOF EXPLODED  ON HWY. 51   IN A 45MPH ZONE JUST NORTH OF MINOCQUA, WI, ABOUT 15 MI FROM MY HOME. I DO NOT HAVE A CELL PHONE SO DROVE HOME AND IMMEDIATELY CALLED TOYOTA RHINELANDER, WI  2018. AFTER EXPLAINING THE SITUATION AND. ASKING WHAT MY NEXT STEP SHOULD BE, I WAS TOLD TO CALL MY INSURANCE REP..AS THEY DID NOT COVER GLASS BREAKAGE. AFTER I GOT THE SUNROOF REPAIRED, I WROTE A LETTER TO TOYOTA HEADQUARTERS AND TOYOTA RHINELANDER DATED 9/16/18 OUTLINING MY CONCERNS.    MY REQUESTS WERE TWO-FOLD: 1) THAT THEY NEED ONLY TO REIMBURSE ME FOR MY MINIMAL REPAIR COSTS: ABOUT $350, AND 2) THAT SOMEONE TELL ME HOW, BY WHOM,  AND TO WHAT AGENCY THIS INCIDENT WOULD BE REPORTED. MY LETTERS WENT UNANSWERED.     I CONTACTED RHINELANDER ON OCT. 25, 2018 AND WAS ADVISED  TO CALL A HOT LINE NUMBER. I DID SO IMMEDIATELY AND WAS PROMISED A CALL THE NEXT DAY. I DID NOT RECEIVE A CALL BACK; A WEEK LATER I CALLED AGAIN AND WAS ASSIGNED A CASE MANAGER. THE END RESULT WAS A DENIAL OF MY REQUEST. AGAIN, THE REASON GIVEN WAS THAT THEY COULD NOT ASSESS THE SITUATION BECAUSE II DID NOT BRING HE CAR INTO TOYOTA FOR AN INSPECTION AFTER THE EXPLOSION (AND, NOBODY TOLD ME THAT I NEEDED TO DO THIS). I UNDERSTAND THE PERSON I TALKED WITH IS NO LONGER WITH THE COMPANY.    THE MOST IMPORTANT FACTOR HERE IS SAFETY.  HAD THE DOOR TO THE SUNROOF BEEN OPEN  , I COULD HAVE BEEN SPRAYED WITH GLASS, SERIOUSLY INJURED OR  INVOLVED IN A TRAFFIC COLLISION. THE DEAFENING NOISE ALONE WAS ENOUGH TO POSSIBLY CAUSE A SERIOUS MISHAP.THERE ARE MANY WEBSITES, INCLUDING CONSUMER REPORTS, THAT REPORT THESE EXPLOSIONS, YET I WAS TOLD BY RHINELANDER THAT THEY NEVER HEARD OF AN EXPLOSION, AND A STONE PROBABLY CAUSED THE INCIDENT.    I WILL BE HAPPY TO FURNISH A COPY OF MY LETTERS AND NOTES OR ANSWER ANY QUESTIONS. [XXX]  INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'  *PM",
        "vin": "JTMDFREV7JD"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/26/2018",
        "dateOfIncident": "10/13/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11143024,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAND NEW RECENTLY PURCHASED VEHICLE  AND THERE IS CONDENSATION IN BOTH HEAD LIGHTS",
        "vin": "JTMRFREV1JJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/09/2018",
        "dateOfIncident": "10/08/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139303,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE DIES TO IDLE SPEED AND THE CAR STOPS OR SLOWS DOWN. THE DEALERSHIP SAYS THIS IS BECAUSE OF A 4 CYLINDER ENGINE CONNECTED TO A 6 SPEED TRANSMISSION.  THERE HAVE BEEN SEVERAL TIMES WHEN I WENT TO ACCELERATE TO GET ON THE EXPRESSWAY AND THE CAR SLOWS DOWN.  THE PEOPLE BEHIND START BACKING UP AND ARE MAD.  I HAVE TO PULL TO SIDE AND LET THEM BY.  MY CHILDREN ARE INSTRUCTED TO SUE TOYOTA IF MY WIFE AND I DIE IN A CAR ACCIDENT.  THIS HAS TO BE A COMPUTER GLITCH. ITS VERY DANGEROUS.",
        "vin": "2T3RFREV4JW"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/09/2018",
        "dateOfIncident": "09/27/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139340,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA RAV4. WHILE DRIVING 75 MPH, THE SUN ROOF EXPLODED WITH A LOUD NOISE. THERE WERE NO INJURIES. THE VEHICLE WAS TAKEN TO LOWE TOYOTA OF WARNER ROBINS (LOCATED AT 375 S HOUSTON LAKE RD, WARNER ROBINS, GA 31088, (478) 971-5693). THE DEAKER STATED THAT THERE MAY HAVE BEEN A SMALL CRACK IN THE GLASS THAT COULD HAVE CAUSED THE EXPLOSION ONCE THE GLASS BECAME HOT. THE VEHICLE WAS NOT REPAIRED. THE VEHICLE WAS LATER TAKEN TO BEAMAN TOYOTA (LOCATED AT 1525 BROADWAY, NASHVILLE, TN 37203, (615) 251-8400), BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND OPENED CASE NUMBER: 1810023189. THE APPROXIMATE FAILURE MILEAGE WAS 4,400.",
        "vin": "JTMRFREV1JJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/06/2018",
        "dateOfIncident": "09/26/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11138818,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE RETURNING FROM DAYTONA BEACH, FL ON 09/26/2018 AND APPROX. 20 MILES FROM WARNER ROBBINS, GA WHEN WE HEARD WHAT SOUNDED LIKE A GUNSHOT.  WE WERE ON THE INTERSTATE IN MILD TRAFFIC WITH TEMPERATURE IN 80'S AND OVERCAST.  WE SAW NOTHING HIT OUR CAR AND NO BULLET HOLES, BUT KNEW THEIR WAS A LOT OF NOISE AND SOMETHING WAS WRONG.  WE PULLED BACK THE COVER ON OUR SUN ROOF AND SAW THE GLASS WAS SHATTERED AND RAISED UPWARD.  IT HAD EXPLODED.  WE WENT TO THE DEALER IN WARNER ROBBINS AND THEY SAID IT LOOKED LIKE IT COULD HAVE BEEN A SMALL CRACK IN THE GLASS.  A DEFECT.  THEY VACUUMED OUT THE GLASS AND COVERED IT WITH CARDBOARD, PLASTIC GARBAGE BAGS AND PUT MASKING TAPE ALL AROUND IT TO PROTECT US. (THEY OF COURSE DID NOT HAVE THE PART.)  THE HOTEL THERE ALLOWED US TO PARK UNDER THEIR ENTRANCE WHICH WAS COVERED AS IT WAS BEGINNING TO RAIN.  ON 09/27/2018 AS SOON AS WE GOT HOME TO NASHVILLE, TN WE WENT TO THE DEALER WE HAD PURCHASED THIS CAR FROM ONLY 4 MONTHS EARLIER ON 06/02/2018.  THEY HAVE REFUSED OUR CLAIM.  WE DON'T THINK THIS IS FAIR SINCE WE DIDN'T CAUSE THIS, BUT THAT SEEMS TO BE SOP IN THESE CASES.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/03/2018",
        "dateOfIncident": "05/15/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133116,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA RAV4. THE CONTACT COMPLAINED ABOUT A DESIGN FLAW WITH THE VEHICLE. WHILE DRIVING IN THE FOG, THE LOW BEAM HEADLIGHTS REFLECTED LIGHT BACK, WHICH BLINDED THE DRIVER AND MADE IT IMPOSSIBLE TO SEE AT NIGHT. THE VEHICLE WAS TAKEN TO TOYOTA OF POWAY (858-486-2900, LOCATED AT 13631 POWAY RD, POWAY, CA 92064) WHERE THE LIGHTS WERE CHECKED. THE TECHNICIAN STATED THAT NO ADJUSTMENT WAS NEEDED AND THAT THE VEHICLE WAS PERFORMING AS DESIGNED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THERE WAS NO RECALL. THE FAILURE WAS NOT REMEDIED. THE FAILURE MILEAGE WAS APPROXIMATELY 7,000.",
        "vin": "2T3RFREV5JW"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/01/2018",
        "dateOfIncident": "09/29/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132810,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON SATURDAY MORNING 9/29/18, I STOPPED AT A STOP LIGHT AND MY 2018 TOYOTA  RAV4 LOST ALL ENGINE POWER WHILE IN TRAFFIC. THE COMPUTER VIDEO SCREEN SHOWED THE MESSAGE \"CHARGING SYSTEM FAILURE\\MALFUNCTION\".  I THEN  ATTEMPTED TO RESTART THE VEHICLE AND IT DID NOT CRANK OVER, I WAITED A FEW SECONDS, MADE ANOTHER ATTEMPT , THE VEHICLE STARTED. I PULLED OVER AND PARKED THE VEHICLE, LOOKED UP THE ERROR MESSAGE IN THE CAR MANUAL AND IT INSTRUCTED ME THAT  IT WAS A SERIOUS PROBLEM AND TO TAKE THE VEHICLE IMMEDIATELY TO THE NEAREST TOYOTA DEALER. I THEN TOOK THE VEHICLE TO MY LOCAL DEALER, THEY RAN A VEHICLE DIAGNOSTIC REPORT, THEY FOUND NO ERROR MESSAGES OR VOLTAGE PROBLEMS WITH THE VEHICLE. THEY OFFERED NO REASON FOR THE LOSS OF VEHICLE POWER. THE SERVICE MANAGER STATED THAT THEY COULD ONLY DIAGNOSE THE VEHICLE SO FAR AND THAT THEY WOULD NEED  \"CORPORATE\" TO SEND SOMEONE OUT TO DO FURTHER DIAGNOSTICS ON THE BLACK BOX.  ON 10/1/18, I OPENED A PROBLEM REPORT WITH TOYOTA USA AND WAS GIVEN A CASE#.        .",
        "vin": "2T3BFREV9JW"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/28/2018",
        "dateOfIncident": "07/14/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132193,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2018 RAV4 IS EQUIPPED WITH DYNAMIC RADAR CRUISE CONTROL, A FEATURE WHICH I LIKE VERY MUCH LIKE WHEN TRAVELING ON INTERSTATE HIGHWAYS.  THIS FEATURE  AUTOMATICALLY DECELERATES MY VEHICLE TO MATCH THE SPEED OF THE VEHICLE AHEAD AND KEEPS YOU FOLLOWING AT A SAFE DISTANCE. HOWEVER, THE SAFETY ISSUE I HAVE DISCOVERED IS THAT WHEN THE VEHICLE AUTOMATICALLY DECELERATES, IT APPARENTLY DOES NOT ACTIVATE THE BRAKE LIGHTS AND THE VEHICLE BEHIND YOU IS NOT WARNED THAT YOU ARE SLOWING DOWN.  TWICE IN THE FIRST COUPLE MONTHS OF OWNING THIS VEHICLE, WHILE TRAVELING ON RELATIVELY STRAIGHT, FLAT, INTERSTATE HIGHWAYS, I HAD THE DYNAMIC RADAR CRUISE CONTROL ENGAGED AND THE VEHICLE IN FRONT OF ME REDUCED SPEED FAIRLY QUICKLY (FROM APPROXIMATELY 65 TO 45MPH) DUE TO ROAD CONSTRUCTION.  MY VEHICLE AUTOMATICALLY SLOWED ACCORDINGLY, BUT THE VEHICLE BEHIND ME DID NOT REALIZE I WAS SLOWING DOWN BECAUSE MY BRAKE LIGHTS DID NOT ACTIVATE AND I WAS VERY NEARLY REAR ENDED.  FORTUNATELY, SERIOUS ACCIDENTS WERE NARROWLY AVOIDED IN BOTH THESE INCIDENTS.   I BELIEVE THE DYNAMIC RADAR CRUISE CONTROL FEATURE IS VERY GOOD, VERY USEFUL FEATURE; HOWEVER, THE SYSTEM MUST BE MODIFIED TO ACTIVATE THE BRAKE LIGHTS WHEN THE VEHICLE AUTOMATICALLY DECELERATES.  ONE OF THE INCIDENTS OCCURRED IN JULY, 2018, AND THE OTHER IN AUGUST, 2018.  I HAVE DISCUSSED THE ISSUE WITH OUR LOCAL TOYOTA DEALER AND ALSO WITH THE TOYOTA CUSTOMER EXPERIENCE CENTER (800 331-4331).  THE LATTER ESTABLISHED A CASE NUMBER (1809280901).  I WISH TO ENSURE APPROPRIATE FOLLOW-UP OCCURS TO CORRECT THIS SAFETY ISSUE.",
        "vin": "JTMRFREV1JD"
    },
    {
        "components": "EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/25/2018",
        "dateOfIncident": "09/22/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131151,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED 2018 RAV 4 ADVENTURE THREE DAY'S AGO AND IT IS IMPOSSIBLE TO DRIVE AT NIGHT ON A ROAD WITH NO OTHER AVAILABLE LIGHTING.  EXTREMELY DANGEROUS.  IT APPEARS AS THOUGH A VEIL COVERS 1/2 TO 2/3 OF WINDSHIELD MAKING VISIBILITY NEARLY IMPOSSIBLE.  THE BEAM ANGLE OF THE HEADLIGHTS BARELY COVER THE ROAD IN FRONT OF YOU AND NOTHING ABOVE THE HEIGHT OF THE VEHICLE HOOD. YOU CAN SEE NOTHING IN FRONT OF YOU AND EVEN LESS ON THE SIDES OF THE ROAD.CHANGING THE SETTING FROM AUTO, ON AND HIGH BEAM TO NOT CHANGE RESULT.  I WANT TO RETURN THE VEHICLE. THERE IS NO POINT IN HAVING A VEHICLE YOU CAN ONLY DRIVE DURING THE DAY.  EXTREMELY DANGEROUS AND VERY DISAPPOINTING!   I HOPE NO ONE SUFFERS INJURY OR DEATH AS A RESULT OF THIS POOR DESIGN.",
        "vin": "2T3RFREV0JW"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/24/2018",
        "dateOfIncident": "09/22/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130873,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY RAV4 HAS VERY POOR LIGHTING AT NIGHT MAKING IT HARD TO SEE THE LINES ON THE ROAD. I JUST BOUGHT THIS VEHICLE NEW A FEW DAYS AGO BUT THE DEALERSHIP SAYS THAT THEY CANNOT FIND ANY DEFECTS WITH THE HEAD LIGHT BUT DOES AGREE THE LIGHT OUTPUT IS POOR.",
        "vin": "JTMRJREV5JD"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/24/2018",
        "dateOfIncident": "09/24/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131090,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA RAV 4 ACCELERATES ON IT'S OWN WHILE DRIVING I BROUGHT IT BACK TO DEALERSHIP AND I WAS TOLD THAT THE COMPUTER SHOWS THAT IT DIDN'T ACCELERATE ON IT'S OWN. IT HAS HAPPENED TWO MORE TIMES THE LATEST WAS TODAY SEPT 24. I AM AFRAID FOR MY SAFETY AND THE SAFETY OF MY FAMILY AND OTHER DRIVER BECAUSE ONCE IT TOOK ME THR A RED LIGHT A D TODAY I ALMOST HIT A TREE.",
        "vin": ""
    },
    {
        "components": "STRUCTURE,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/01/2018",
        "dateOfIncident": "08/26/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123950,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE BREAKING SYSTEM FAILED WHILE TRYING TO SLOW DOWN TO STOP A COUPLE HUNDRED FEET BACK FROM STOPPED VEHICLE SITTING AT REDLIGHT, THIS COMPLETELY RESULTED IN COLLISION ON AUGUST 26, 2018. THERE WAS ONLY APPROXIMATELY 500 MILES ON THE VEHICLE ORIGINALLY PURCHASED ON AUGUST 18, 2018",
        "vin": "JTMZFREV5JJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "08/30/2018",
        "dateOfIncident": "07/11/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11123536,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "HAZARDS OF THE PUSHBUTTON START:  THE ENGINE CAN BE TURNED OFF WHILE CAR IS STILL IN GEAR.....MINE WAS IN REVERSE, (I THOUGHT IT WAS IN P AS THERE IS NOT AN ALIGNMENT (R IS UP & TO THE RIGHT).....FIRST DAY I DROVE IT, JUMPED OUT, WAS KNOCKED DOWN, FRONT L TIRE ROLLED OVER MY LEG....NO WARNING, NO SAFEGUARD AGAINST THIS.......",
        "vin": ""
    },
    {
        "components": "STEERING,WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/25/2018",
        "dateOfIncident": "03/10/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122326,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TAMARA RECALL.  VEHICLE CONSTANTLY DRIFTS TO THE RIGHT SIDE. SEVERAL ATTEMPTS OF FIXING THE ISSUE HAVE BEEN MADE BY THE DEALERSHIP AND VEHICLE STILL CONTINUES TO PULL TO THE RIGHT. AT THIS POINT THE DEALERSHIPS DO NOT KNOW HOW TO FIX THE ISSUE. NO INJURIES HAVE BEEN SUSTAINED. THE MANUFACTURER HAS BEEN NOTIFIED. PLEASE FURTHER INVESTIGATE THIS PROBLEM.",
        "vin": "JTMRFREV4JD"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/22/2018",
        "dateOfIncident": "08/17/2018",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11121578,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY RAV4 CAUGHT FIRE IN THE MIDDLE OF THE NIGHT WHILE PARKED ON THE STREET IN FRONT OF MY HOUSE. IT HAD BEEN PARKED FOR 12+ HOURS. AFTER BURNING FOR ABOUT 10 MINUTES, IT EXPLODED WITH A FORCE SO GREAT THAT IT LIFTED THE CAR ONTO THE CURB, KNOCKED OVER A FIREFIGHTER, AND DAMAGED OUR BOAT PARKED 10 FEET ACROSS THE STREET. THE INSPECTOR FROM THE FIRE DEPARTMENT DETERMINED THE INITIAL FIRE WAS FROM FAULTY ELECTRICAL WIRING BUT SAID HE HAD NEVER SEEN A CAR EXPLODE IN HIS 25 YEARS ON THE FORCE. TOYOTA CONDUCTED THEIR OWN INVESTIGATION AND AGREED IT WAS ELECTRICAL BUT COULD NOT DETERMINE FAULT DUE TO THE SEVERITY OF THE DAMAGE",
        "vin": "2T3RFREV8JW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/20/2018",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121008,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA RAV4. WHILE DRIVING 35 MPH, THE BRAKE PEDAL WAS APPLIED AND MADE AN ABNORMAL GRINDING NOISE. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER (HALEY TOYOTA OF RICHMOND, 3600 LONAS PKWY, MIDLOTHIAN, VA 23112, (804) 545-7411) WHERE IT WAS DIAGNOSED THAT AN ALIGNMENT WAS NEEDED. THE VEHICLE WAS REPAIRED; HOWEVER THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED AND PROVIDED CASE NUMBER: 1808171087, BUT NO FURTHER ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS 21,500.",
        "vin": "2T3RFREV8JW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/13/2018",
        "dateOfIncident": "04/17/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119743,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR CONDITIONER / HEATER / VENTILATION SYSTEM IS IMPOSSIBLE TO OPERATE WITHOUT THE DRIVER TAKING THEIR EYES OFF THE ROAD.  THE RADIO IS VERY DIFFICULT TO OPERATE WITHOUT THE DRIVER TAKING THEIR EYES OFF THE ROAD.  THE VEHICLE REQUIRES DISTRACTED DRIVING.    THE HORN CANNOT BE SOUNDED BY PRESSING THE STEERING WHEEL SPOKES; THE DRIVER MUST TAKE A HAND OFF THE STEERING WHEEL AND PRESS THE CENTER HORN \"BUTTON\".  IF THERE IS A COLLISION AT THAT TIME, THE AIRBAG WILL EXPLOSIVELY FORCE THE DRIVER'S HAND INTO THEIR FACE.    THE SPEEDOMETER IS VERY SMALL AND IS HARD TO READ IN THE DAYTIME BECAUSE IT IS RECESSED, SHADED AND VERY DIMLY BACKLIGHTED.  THE FLAT PANEL DISPLAYS ARE MUCH BRIGHTER AND EASY TO READ IN THE DAYTIME.  THE NUMBERS ON THE SPEEDOMETER ARE MUCH TOO SMALL TO BE EASILY READ, AND SINCE THEY ARE SET UP AT 20-MPH INTERVALS THE EXACT SPEED IS IMPOSSIBLE TO DETERMINE.    THE RIGHT-HAND OUTSIDE MIRROR CREATES AN UNUSUALLY LARGE BLIND SPOT, MAKING IT DIFFICULT TO SEE WHAT IS TO THE RIGHT OF THE CAR.  THIS IS A SERIOUS SAFETY PROBLEM WHEN MAKING RIGHT TURNS ON RESIDENTIAL STREETS AND IN PARKING LOTS.    IT IS SHOCKING HOW DIFFICULT THIS CAR'S INSTRUMENT PANEL AND CONTROLS ARE TO USE, COMPARED TO VEHICLES MADE BETWEEN 1970 - 2013.",
        "vin": "JTMWFREV3JJ"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/13/2018",
        "dateOfIncident": "08/12/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119755,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DANGEROUS TO DRIVE AT NIGHT DUE TO PROJECTOR HEADLIGHTS BEAM PATTERN CUTOFF. WHILE DRIVING WITH LOW BEAM HEADLIGHTS ON AT NIGHT, TOP PART OF LIGHT BEAM PATTERN IS A STRAIGHT LINE LEFT TO RIGHT ACROSS FIELD OF VISION WITH ZERO LIIGHT ABOVE MIDPOINT FIELD OF VISION BOTTOM (ROAD) TO TOP (SKY). ESPECIALLY DANGEROUS WHEN DECENDING HILLS IN DARK AND ROAD AHEAD IS FLAT (OR HORIZONTAL) AS WELL AS DECENDING A DIP WHICH CLIMBS BACK UP. NOWHERE NEAR ENOUGH LIGHT ABOVE MID FIELD OF VISION. REQUIRES HIGHBEAMS SELECTED WHICH CANNOT ALWAYS BE SELECTED DUE TO ONCOMING TRAFFIC OR FOLLOWING SOMEONE WHERE IT WOULD BLIND THEM. HIGHER MODEL RAV4 TRIM LEVELS HAVE LED HEADLIGHTS WHICH TOYOA SHOULD RETROFIT ONTO XLE, LE, AND ANY OTHER MODELS AFFECTED. WORRIED ABOUT WIFE DRIVING WITH KIDS. 6 MONTHS INTO A 3YR LEASE.",
        "vin": "2T3RFREVXJW"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/28/2018",
        "dateOfIncident": "07/27/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114310,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLAMP PROVIDES DANGEROUSLY INSUFFICIENT ILLUMINATION WHILE DRIVING IN ANY OF THE FOLLOWING SITUATIONS:  DARK, CURVED, OR HILLY ROADS (SUCH AS US HIGHWAY 1 IN MARIN COUNTY, SKYLINE BLVD IN OAKLAND, CA).    1. VERY LITTLE PERIPHERAL ILLUMINATION ON CURVES  2. SHARP HORIZONTAL CUT-OFF RESULTS IN SHORT BEAM PROJECTION WHEN ASCENDING OR DESCENDING HILLS.     BOTH OF THESE OCCUR SIMULTANEOUSLY AND IS FRIGHTENINGLY DANGEROUS WHEN ASCENDING/DESCENDING ON CURVES.     THE NHTSA FORM ASKS FOR A DATE THIS OCCURRED.  PLS NOTE THIS IS ONGOING UNLESS A DEALER CAN MAKE SIGNIFICANT MODIFICATIONS TO THE BEAM SPREAD.      (THIS IS NOT A PROBLEM OF COURSE ON BRIGHTLY LIT ROADS.)",
        "vin": "JTMBFREV5JJ"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "07/09/2018",
        "dateOfIncident": "02/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110195,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS SOMETHING LOOSE IN THE DRIVERS SEAT THAT IS MOVING AROUND AND HITTING THE DRIVERS BACK.  THIS IS VERY DISTRACTING AND HAPPENS ALL THE TIME DURING DRIVING TAKING THE DRIVERS ATTENTION OFF THE ROAD.  THIS IS AN ON GOING ISSUE AND THE DATE IS JUST A ROUGH ESTIMATE OF WHEN IT STARTED.",
        "vin": "2T3RFREV2JW"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/29/2018",
        "dateOfIncident": "06/06/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104738,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST BOUGHT MY NEW TOYOTA RAV 4 2018 AND REALIZED THAT I CAN'T DRIVE IT AT NIGHT. MY WINDSHIELD TURNS DARK 1/3 TO 1/2 FROM THE BOTTOM AND CONTINUES ALL THE WAY TO THE TOP. IT'S ACTUALLY WORSE WHEN DRIVING HOME AND GOING UP MY UNLIT HILL WHEN INSTEAD OF MY BRIGHTS GOING ON AUTOMATICALLY, ONLY MY LOW LIGHTS ARE ON. I AM FRIGHTENED TO DRIVE MY CAR AND NOW REALIZE THAT THERE WERE ONLINE COMPLAINTS GOING BACK YEARS!",
        "vin": "JTMBFREV8JJ"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/29/2018",
        "dateOfIncident": "06/25/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104803,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WINDSHIELD DEVELOPED A VERY LARGE CRACK, THE CRACK APPEARED WHILE THE CAR WAS PARKED.  IT SEEMS TO HAVE STARTED FROM A TINY ROCK CHIP - THE CHIP WAS NOT PREVIOUSLY NOTED.  THE CRACK GREW SIGNIFICANTLY OVER THE COURSE OF 2 DAYS.    THE GLASS COMPANY HAS CONTACTED THE DEALERSHIP AND WAS ADVISED THAT THERE IS A NATIONWIDE BACKORDER FOR THE GLASS - 331 BACKORDERS AS OF TODAY, JUNE 30.  THEY DO NOT HAVE A DATE WHEN THE GLASS WILL BE AVAILABLE, POSSIBLY SEVERAL WEEKS TO SEVERAL MONTHS.  A LARGE BACKORDER IS CONCERNING AS IT WOULD SUGGEST A LARGE VOLUME OF PEOPLE EXPERIENCING THIS EXACT OR SIMILAR ISSUES WITH THE WINDSHIELD.",
        "vin": "2T3RFREV9JW"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/27/2018",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104208,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WINDSHIELD CRACKED AFTER BEING STRUCK BY A SMALL ROCK DURING NORMAL DRIVING AND THEN THE CRACK WENT ACROSS THE DRIVERS SIDE OF THE WINDSHIELD RIGHT ACROSS MY FIELD OF VIEW AS A DRIVER.  THE WINDSHIELD WAS CRACKED ON JUNE 1ST AND I CONTACTED 4 GLASS REPLACEMENT COMPANIES AND WAS TOLD THE PART WAS ON BACK ORDER 3 TO 8 WEEKS.  I CONTACTED THE DEALERSHIP AND TOYOTA AND I WAS TOLD THEY WILL ORDER THE PART.  I GOT CONTACTED ON JUNE 26 BY JOHN FROM TOYOTA THAT THE WINDSHIELD WAS IN AT COPELAND TOYOTA IN BROCKTON MA.  I CONTACTED THE GLASS COMPANY AND THEY WERE ADVISED THE PART WAS NOT IN AT COPELAND.  I CONTACTED TOYOTA TODAY AND WAS TOLD BY THEM THAT THEY WERE GIVEN THE INFORMATION FROM ANTHONY AT COPELAND TOYOTA THAT THE WINDSHIELD WAS IN.  I ASKED TO SPEAK WITH THE SUPERVISOR AT TOYOTA AND WAS TOLD THAT THEY WERE UNAVAILABLE.  I CURRENTLY HAVE A CRACKED WINDSHIELD THAT CAN'T PASS MASSACHUSETTS INSPECTION BECAUSE OF THE WINDSHIELD.  I HAVE NOW BEEN TOLD BY TOYOTA THAT THEY DO NOT KNOW WHEN THEY CAN GET ME A NEW WINDSHIELD.",
        "vin": "JTMBFREVXJJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/13/2018",
        "dateOfIncident": "04/13/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084991,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM VERY DISAPPOINTED. I BOUGHT A RAV4 2018 IN FEBRUARY OF THIS YEAR, IT HAS ONLY 1,900 MILES AND IS ALREADY AT THE DEALER AFTER TAKING MY KIDS TO SCHOOL I WENT BACK HOME AND I USUALLY DO I ACTIVATE THE VEHICLE ALARM BUT IT DID NOT WORK. THE KEYS DOES NOT ACTIVATE OR DIS-ACTIVATE THE VEHICLE ALARM AND WHEN THE CAR IS ON THE TIRE PRESSURE SIGN STARTED TO BLINK. THE DEALER STAFF SAID THAT ONE OF THE COMPUTER IS NOT WORKING RIGHT. AT THIS MOMENT THEY DON'T KNOW WHAT IS GOING ON AND IRONICALLY IS NOT TIME FOR THE FIRST PAYMENT YET.",
        "vin": "2T3ZFREV3JW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/05/2018",
        "dateOfIncident": "03/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076389,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS STATIONARY IN A DRIVEWAY FOR APPROXIMATELY 2 HOURS. AFTER PULLING AWAY FROM THE HOUSE, DASH PANEL INDICATORS WERE SHOWING MALFUNCTIONS ON BRAKE SYSTEMS, AWS, ETC. IT SHOWED THAT ALL COMPUTER SYSTEMS WERE MALFUNCTIONING. I DROVE IMMEDIATELY TO THE DEALER. INSPECTION SHOWED THAT THE WIRE HARNESS ON THE VEHICLE HAD BEEN CHEWED APART, OFF, AND INSULATION HAD BEEN REMOVED. I INVESTIGATED THE INTERNET ON THIS PROBLEM AND IT SEEMS THAT SEVERAL VEHICLE MAKES AND MODELS WERE AFFECTED. IT SEEMS THAT THE MANUFACTURES WERE USING A FOOD BASED INGREDIENT IN THE INSULATION OF THE WIRES, (SOY). THIS IS ATTRACTING RODENTS, (SQUIRRELS) TO THIS FOR FOOD. IT COULD HAPPEN ANYWHERE, PARKED AT THE POST OFFICE, GROCERY STORE, YOUR FRIENDS HOUSE, ETC.   MY VEHICLE ONLY HAS 980 MILES. I HAVE NEVER HAD THIS BEFORE. WHAT WOULD HAPPEN IF THE WIRES CATCH ON FIRE OR YOUR CAR STOPS ON THE FREEWAY BECAUSE OF THIS ISSUE. CAN THIS BE INVESTIGATED? AT THIS POINT, WHAT'S GOING TO KEEP THIS FROM HAPPENING AGAIN. WE'VE HAD SEVERAL TOYOTA VEHICLES IN THE PAST AND DID NOT HAVE ANY WIRE HARNESS PROBLEMS.",
        "vin": "JTMRFREV2JJ"
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/15/2018",
        "dateOfIncident": "02/04/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073038,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING STRAIGHT DOWN THE INTERSTATE AND MY SUNROOF EXPLODED RIGHT OVER MY HEAD. I WAS NOT TRYING TO OPEN IT, NOTHING IMPACTED IT, IT JUST EXPLODED AND THE GLASS SHATTERED EVERYWHERE INTO MY CAR AND ON MY HEAD. THE INTERSTATE WAS NOT ROUGH ROAD AND THE WEATHER CONDITIONS WERE SUNNY AND 50 DEGREES. AGAIN NO IMPACT FROM AND KIND OF WEATHER OR DEBRIS",
        "vin": "2T3RFREV6JW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/09/2018",
        "dateOfIncident": "01/30/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11071997,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE'S LDA (LANE DEPARTURE ALERT) COULD NOT BE HEARD AND NO VOLUME ADJUST. DEALER WON'T DO ANYTHING ABOUT IT CLAIMING THERE IS NO STANDARD LOUDNESS REQUIRED. YET, THE LDA IS PART OF TOYOTA SAFETY SENSE AND MARKETED AS ALERT FOR SAFE DRIVING ASSIST. MY VEHICLE IS 2 WEEKS OLD AND MISSED THE WARNING TWICE ALREADY. FALSE ADVERTISING BY TOYOTA AS SAFETY ALERT WHEN IT COULD NOT BE HEARD. DANGEROUS TO DEPEND ON IT.01/29",
        "vin": "2T3YFREV4JW"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/06/2018",
        "dateOfIncident": "01/02/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11060925,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ILLUMINATION PROVIDED BY THE HEADLIGHTS ON THE 2018 RAV4 XLE I PURCHASED ON DECEMBER 28, 2017 IS DANGEROUSLY UNSAFE TO DRIVE ON UNLIT RURAL ROADS.  SEE ATTACHED LETTER DATED JANUARY 6, 2017 AND PIC.  I HAVE MORE PICS AND SEVERAL VIDEOS, IF NEEDED. *JS    THE CONSUMER STATED THE HIGH AND LOW BEAMS, ON CURVES, NARROW, AND HILLY UNLIT ROADS, VISIBILITY WAS INADEQUATE. *JS  *JS    THE CONSUMER STATED THE MANUFACTURER WAS NOTIFIED AND ADVISED THE VEHICLE WAS OPERATING AS DESIGNED. *JS",
        "vin": "JTMRJREV6JD"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/27/2017",
        "dateOfIncident": "12/21/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11056950,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING IN A FAST FOOD DRIVE THROUGH.  IT WAS A STOP AND GO PACE BECAUSE THERE WERE AROUND 5 CARS BEFORE ME AND WAS TRAVELING APPROX 3 MPH.  I BEGAN TO PROCEED BUT THIS TIME AS I WENT TO APPLY MY BRAKES THEY WENT TO THE FLOOR AND I COULDN'T STOP THE CAR.  IN ORDER TO AVOID THE CAR IN FRONT OF ME I TURNED MY WHEEL TO THE RIGHT AND JUMPED THE CURB AND HIT A WALL.  THE VEHICLE WAS 3 DAYS OLD.",
        "vin": "2T3RFREV8JW"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/13/2017",
        "dateOfIncident": "11/13/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054484,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "FROM A DEAD STOP WHEN ACCELERATING THE VEHICLE WILL NOT SPEED UP IT ACTS LIKE ITS IN 6TH GEAR. TO GAIN CONTROL I NEED TO PUSH THE ACCELERATOR TO THE FLOOR & THEN IT SPEEDS UP ALMOST UNCONTROLLABLY. THIS HAPPEN AT 12 TIMES. SEE MY COMMENT BELOW THAT I SENT TO TOYOTA CORPORATE OFFICE.   I HAVE WANT I CONSIDER A SEVERE SAFETY ISSUE WITH MY 2018 RAV4 ([XXX]). UPON ACCELERATING FROM A STOP THE VEHICLE WILL NOT SPEEDUP IT ACTS LIKE IT IS IN 6TH GEAR TO GET IT GOING I HAVE PUT THE GAS PEDAL TO THE FLOOR AN THEN IT SOMETIME SHOOTS AHEAD ALMOST HITTING A VEHICLE IN FRONT OF ME. RECENTLY IT HAPPENED 3 TIMES IN A ROW TWICE I GOT IT TO RECOVER BUT THE THIRD TIME I NEEDED TO PULL OF THE HIGHWAY & RESTART THE ENGINE. THIS HAS HAPPEN AT LEAST 10 TIMES. PHILLIPS TOYOTA SERVICE SAID IT IS A FLY BY WIRE PROBLEM (COMPUTER CONTROLLED). MY FIRST VISIT PHILLIPS DID NOT EVEN WRITE A SERVICE REQUEST ON THE SECOND VISIT THEY DID, BUT ON 12/04/2017 THEY DID NOT AGAIN. THIS GOING TO CAUSE EITHER A REAR END OR FRONT ACCIDENT. WHEN ACCIDENTS HAPPEN LITIGATION USUALLY FOLLOWS. LETS GET THIS FIXED. PHILLIP TOYOTA SAID OTHER OWNERS HAVE HAD THIS SAME CONCERN. 12/04/201    [XXX]       CC: CONSUMER PROTECTION AGENCY          NATIONAL SAFETY CONSUL    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "SPJTMWFREV2"
    }
]