[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/29/2022",
        "dateOfIncident": "03/27/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458830,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Just like the other complaints with the brakes, I also received the error message \"“Braking Power Low, stop at a safe place”.  Also like the other complaints here, I went to the dealership where I purchased the car and they told me it is not covered and considered as a recall for my vehicle. EVEN though the same problems have been identified for the same make and vehicle under recall #18V211000.  I also called the Toyota Corporation and they said since my VIN number wasn't specifically affected, it's not part of the recall.  I don’t think it’s right that Toyota can say it is not covered simply because they haven’t identified it with my specific vin and or the manufacturer they used. This is horrible and obviously, there is an issue with the brake system that could lead to collisions.",
        "vin": "5TDJZRFH8JS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/28/2022",
        "dateOfIncident": "03/27/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458633,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "My car stopped working and the following error message showed up \"Braking Power Low, Stop in a Safe Place.\"   I have a photo of this error message.  When researching this error message, it MAY be related to NHTSA Campaign Number 18V-211.  The research I've done says on multiple  websites this error is related to brake booster pump.  The dealership is saying there was no such recall, but I was able to find the recall notice on this issue through the NHTSA website.  I would appreciate a phone call at [XXX].   Again, I have a photo of the error message that showed up on my dashboard.  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "5TDJZRFH8JS"
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/15/2022",
        "dateOfIncident": "03/15/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456817,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving down the highway at 11:30am MST going between 55-60 mps and my sunroof just popped and broke. Nothing hit us, there were barely even any cars around us at the time. It spontaneously combusted. Providing screenshots of the video I took immediately after it happened. You can even see how the glass is bowed out instead of inward, if it were hit by something.",
        "vin": "5TDDZRFHXJS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/01/2022",
        "dateOfIncident": "02/28/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454614,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle wouldn't start. Shows low break power stop the vehicle in a safe area. Luckily this happened when I was not driving. Breaks felt stuck.",
        "vin": "5TDKZRFH9JS"
    },
    {
        "components": "ENGINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/15/2022",
        "dateOfIncident": "02/08/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452146,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Toyota Highlander. The contact stated while driving 70 MPH, the check engine warning light illuminated informing the driver that the AWD system and stability were disabled. The vehicle was taken to the dealer where they diagnosed the failure of the sub-assembly and the water temperature sensor needed to be replaced. The contact stated that he was informed that the onboard computer disabled the system due to the weather. The dealer informed the contact that the parts were on national backorder. The dealer performed a temporary repair by placing plastic on the grill to keep cold air out; however, the failure reoccurred several times. The manufacturer was notified of the failure and informed the contact that the parts were not covered under warranty. The approximate failure mileage was 48,000.",
        "vin": "5TDDZRFH3JS"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/26/2022",
        "dateOfIncident": "01/05/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448983,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Toyota Highlander. The contact stated that while his wife was driving at various speeds, the brakes failed to operate as needed. The contact stated that “Pull Over Immediately/Vehicle Unsafe to Drive” was displayed on the instrument panel. The contact stated that his wife had to pump the brake pedal for the brakes to operate as needed. His wife took the vehicle to an independent mechanic who inspected the vehicle but found no defects with the braking system. Upon investigation, the contact discovered NHTSA Campaign Number: 18V211000 (Service Brakes, Hydraulic) which he linked to the failure. The manufacturer was notified of the failure and informed him that there were no recalls on the vehicle. The vehicle had yet to be repaired. The failure mileage was approximately 32,000.",
        "vin": "5tddzrfh3js"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/27/2021",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445074,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "1.)  Bluetooth connects without issue to iPhone (for both media and phone) however during a phone call (incoming/outgoing) the car system will drop the call after about 2 mins of talk time. The phone then disconnects from the car & will only re-pair once the system restarts.      2. )  The safety hazard is due to distracted, hands required operation of the phone due to Bluetooth system not working properly      3.)  The issue has been under 'warranty' for nearly 2 years at my dealer.  There is currently no resolution.  Dealer admits the fault is due to a compatibility issue of various vendors supplying the head unit, bluetooth/radio unit, and software.      4.)  At the instruction of the manufacturer, the dealer has refused to replace any hardware.",
        "vin": "5TDJZRFHXJS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/25/2021",
        "dateOfIncident": "11/24/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441667,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Sudden warning lights that the brake system is low.  The vehicle is inoperable.",
        "vin": "5TDJZRFH4JS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/19/2021",
        "dateOfIncident": "11/10/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440995,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Fuel pump was replaced last year in October 2020 and was out of warranty when incident happened. Vehicle stalled again in the middle of my drive and was stranded in the middle of a busy road. Fuel pump found to be failing per my mechanic.",
        "vin": "5TDYZRFH5JS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/19/2021",
        "dateOfIncident": "10/02/2020",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441052,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Toyota Highlander equipped with a tow package. The contact stated that after taking the vehicle in for service, he made the dealer aware that on the passenger’s side rear of the vehicle where the muffler tip came out from underneath the vehicle that the plastic piece above the muffler was melted from exhaust heat coming from the muffler while towing his trailer. The dealer documented the incident and forwarded the findings to the manufacturer. The contact did not receive a callback, so he contacted the dealer and was informed that the vehicle was out of warranty and therefore there was nothing to pursue. The contact was concerned that there would be severe damage done to the bumper and wiring harness from the exhaust heat. The manufacturer was made aware of the failure. The contact was still awaiting a response from the manufacturer. The vehicle was not repaired. The failure mileage was approximately 40,000. The VIN was not available.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/22/2021",
        "dateOfIncident": "10/22/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437782,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I bought this 2018 Toyota Highlander xle brand new from the dealer on 2018.My first brakes and rotors were changed by toyota dealer on march 2020 at  24000 miles and then the second time again brakes and rotors were changed december 2020 at 39000. Both time it was Toyota OEM parts. Now at 63000 these ae weare out i bought different company breaks and brembo rotors akebonno brakes. Each time it was more than $800 job. It looks like toyota is making very cheap break pads and rotors and for consumers are not getting what they say about their brakes and rotors. Which ia supposed to be 30000 miles. I am requesting someone to tale a look at this matter and save the consumers to spend less.  Thank you",
        "vin": "5TDJZRFH7JS"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/26/2021",
        "dateOfIncident": "09/26/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434415,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Unable to start vehicle twice.  In both instances, foot was placed on the brake before pressing Start button and brake was extremely stiff.  When Start button is pushed, electronics engage (control panel lights, A/C, etc.) but engine will not engage.  In the first incident, car had been stopped to refuel and would not restart.  Car had been started without incident and been running for approximately 20 minutes prior to stopping for refueling.  Tried to restart the engine for 20-30 minutes unsuccessfully and had to have vehicle towed to authorized Toyota dealer.  Dealer was unable to look at it for two days and was able to start engine on the first try two days later.  Dealer could not replicate problem.  In the second incident, car had been in a parking lot for two hours on a hot day.  Again, brake was extremely stiff, electronics engaged but engine would not start.  A message appeared Brake Power Low.  We shut off A/C and were able to restart the vehicle.  In both instances, the driver-side door was open to try and let hot air out - we don't know if this has any bearing on the issue.",
        "vin": "5TDKZRFH1JS"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/20/2021",
        "dateOfIncident": "02/13/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433660,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owned a 2018 Toyota Highlander. The contact stated the recall repair for NHTSA Campaign Number: 20V012000 (Fuel System, Gasoline) had been completed on the vehicle. The contact stated while her husband was driving 55-65 MPH, the vehicle inadvertently stalled. An unknown warning light was illuminated. The contact stated that her husband veered to the side of the road. The contact's husband was able to restart the vehicle. The vehicle was taken to the dealer who informed the contact's husband that they could not determine the cause of the failure; however, the computer onboard was reset. The contact stated that the failure recurred while driving. The contact's husband was able to restart the vehicle after several attempts however, the failure recurred several times while the contact's husband was taking the vehicle to the nearest dealer. The vehicle was taken to a second dealer - Lithia Toyota of Billings (1532 Grand Ave, Billings, MT 59102) who diagnosed that no issues were found and advised the contact's husband to trade-in the vehicle. The vehicle was not repaired and was traded. The manufacturer was notified of the failure but offered no assistance. The approximate failure mileage was 49,000.",
        "vin": "5TDDZRFH7JS"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "09/18/2021",
        "dateOfIncident": "09/11/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11433443,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Where the incident happened? The incident happened at the following google coordinates (39.21707240377137, -77.6491829535095) on an unpaved, but well-maintained road. When this incident took place? 09/11/2021 – around 10.30am Who is travelling with you? I was travelling with my wife (Vijaya) and Pet Dog (Leo). Both my wife and I have the seat belts on. How are the driving conditions? A bright and sunny morning with clear visibility, minimal wind and no rain. The road is totally dry. In a way perfect driving condition.  How the incident happened? A white truck came in the opposite direction and since the road is narrow I pulled my highlander to the right, where there is some loose gravel on the side of the road. When I pulled to the side I am almost at a standstill and after the truck had passed started moving the car towards the middle of the road. At this moment the Highlander suddenly started swiveling to the left, and the traction became very wobbly and when tried to apply brakes, brake did not work at all. In stead the car started going out of control on the left side and is about to crash into 2 large trees on the side of the car. At that time without having any control over the brakes, I tried to steer towards right and the car turned sharp towards right, crossed road and fell into a 15 feet ditch on the right side of the car. What is the Car behavior witnessed? Total loss of Breaks, self-acceleration, and unpredictable steering control. The whole incident might’ve happened in about 10-15 seconds. Neither the auto-braking nor the collision control has triggered. Not sure what triggered this behavior of the car. It appeared as if the car tried to auto-correct the traction and something malfunctioned.",
        "vin": "5TDJZRFH5JS"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/17/2021",
        "dateOfIncident": "09/17/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433316,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Toyota Highlander. The contact stated while driving 65 MPH, the steering wheel inadvertently locked. The warning message \"ETS Failure - Steering Will Be Harder to Steer\" appeared on the instrument panel. The contact stated he forcefully steered the steering wheel and veered to the side of the road. The contact turned off the vehicle and as he restarted the vehicle, the steering wheel was still significantly difficult to steer. The contact stated he was able to drive the vehicle to the nearest dealer, though the steering wheel was significantly difficult to steer. The dealer diagnosed the failure as a computer system malfunction. The manufacturer was notified of the failure and advised the contact that they would follow up with the dealer. The vehicle was not repaired. The approximate failure mileage was 1,000. The VIN was not provided.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/30/2021",
        "dateOfIncident": "07/20/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427223,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "On July 27, I was driving on a major multi-lane road going approximately 35 miles going to the  World Toyota for an oil change. All of a sudden, the vehicle decelerated to almost a stop. I gingerly navigated the vehicle to the side of the road. There was no warning that there was something wrong with the vehicle. After navigating to the side of the road a warning light appeared that said traction control is off.   I called World Toyota, told them what happened and they suggested that I get the vehicle towed if I felt I couldn’t drive it. I was about 1/4 mile away from the dealer. The vehicle was a safety hazard, therefore, I had the vehicle towed to the dealer.   On July 28, the World Toyota service advisor informed me that 2 of the 6 fuel injectors had failed—#s1 and 4. He advised me the best route would be to replace all 6 at a cost of $3500. He agreed with me that it is odd for fuel injectors to  fail on a vehicle with only 48K. We have driven this car very little since purchasing shortly before the COVID lock down in early 2020.  I spoke with customer relations at Toyota and they have offered to pay to replace the 2 failed injectors, but have refused to pay the installation costs.  I am concerned that the failure the injectors is a huge safely issue for Toyota Highlander owners. I saw where the injector issue has been discussed for 2019 model Highlanders.    Here is the information in the inspection report from dealer  [“ CUSTOMER STATES THE TRACTION CONTROL OFF LIGHT CAME ON AND THE CAR STARTED TO DECELEARATE AND THEN STARTED JERKING. VEHICLE TOWED IN. 1HR DIAGNOSTIC APPROVED.  remove intake manifold  OBSERVATIONS: MULTIPLE CODES FOR OPEN CIRCUIT TO DIRECT INJECTION.NEED TO REMOVE INTAKE MANIFOLD TO INSPECT FUEL INJECTORS”]  The information about which injectors failed was given to me by phone by my service advisor, Matthew Bailey. I uploaded the picture sent of mechanic working on vehicle.",
        "vin": "5tdjzrfh0js"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/24/2021",
        "dateOfIncident": "07/24/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426284,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving on the FWY at 67 MPH.I received “Braking Power Low, stop at a safe place”  I pulled over and went to a Toyota dealership and they told me it is not covered and considered as a recall for my vehicle. EVEN though the same problems have been identified for the same make and vehicle under recall #18V211000  Please help. I don’t think it’s right that Toyota can say it is not covered simply because they haven’t identified it with my specific vin and or the manufacturer they used.",
        "vin": "5tdkzrfh1js"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/26/2021",
        "dateOfIncident": "06/13/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422456,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Toyota issued a service bulletin for my vehicle in 2020 to address surging front brakes.  In April, 2020 my vehicle experienced surging that caused severe shimmy of the front of the entire vehicle in downhill braking at highway speed.   Kendall Toyota, Bend, OR replaced the entire front brake system under the bulletin. The mileage was approx. 26,500. That problem recurred about June 13, 2021 in the same circumstances. The mileage was approximately 36,500.  Kendall indicates that Toyota has not issued a new service bulletin covering this condition.  Kendall found all brake system parts to be in good condition, but noted that \"front rotors severely glazed. ... typically be (sic) due to heat caused by repeat high speed/downhill braking, or longer periods of brake applications while driving.\" Prior service records (every 5K miles) show no unusual brake wear/rotor glazing -- ever.",
        "vin": "5TDDZRFH6JS"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/14/2021",
        "dateOfIncident": "06/13/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420820,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Upon turning on the vehicle the brake peddle locked and the steering wheel. Message prompted \"braking power low, stop in safe place\". After that all electronic features failed and vehicle did not turn on at all. Vehicle wouldn't even lock. Mine and my families safety was at risk due to the fact that this could have happened while the vehicle was in motion and all steering and braking abilities are lost. The vehicle is scheduled to be seen. No warning signs/lampsor other symptoms where present prior to the incident.",
        "vin": "5TDKZRFH6JS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/10/2021",
        "dateOfIncident": "06/10/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420488,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Accordingly to Toyota vehicle Maintenance Schedule, the vacuum pump for the brake booster needs to be replaced as a regular maintenance or \"wear\" item every 120,000 miles.  This is a very expensive maintenance item (>$600 in parts, ~$1000 including labor and shop materials), that needs to be performed by a Toyota certified technician.  In addition to being very expensive, what will discourage many vehicle owners from performing this service, one may expect that many owners who perform their own vehicle maintenance or use independent mechanic shops will simply miss this service altogether.  Being a safety critical item, the vacuum pump should be designed to last the entire lifespan of the vehicle (just like other brake system components: ABS pump, vacuum booster, master cylinder, etc.).  The short lifespan of the vacuum pump and the requirement to replace it on a regular basis is indicative of a defective or deficient design.  Making the replacement of the vacuum pump a scheduled maintenance item is a just way for Toyota to avoid liability due to premature failures of a substandard safety component, especially in light that other brake system components are designed to last for the entire life of the vehicle, and are not considered wear items in the maintenance schedule (except for brake pads, of course).  Toyota should redesign the vacuum pump to increase its lifespan in-line with the rest of the brake system components, and perform the replacement under a safety recall or service campaign, at no cost to vehicle owners.",
        "vin": "5TDBZRFH3JS"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/07/2021",
        "dateOfIncident": "06/06/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419860,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Car is not properly wired to tow a trailer equipped with electric brakes.  Toyota advertises the Highlander as having 5000 lb towing capacity.  On the other hand, trailers weighing 3000 lb or more are required by law to be equipped with trailers brakes in most states.  However, the Highlander's towing wire harness does not include the necessary wiring and 7-pin connector to power trailer brakes.  Highlander OEM wiring harness only includes a 4-pin connector (which does not have output for a car-mounted brake controller nor 12V output to charge trailer's breakaway battery or power a trailer-mounted brake controller).  Toyota's claim that the Highlander is capable of towing 5000 lb, but not equipping the car with essential safety equipment to do so is an unsafe condition (and false advertising).  It could lead the car owners / operators to believe that it is acceptable to tow a 3000 lb or more trailer with the Highlander using the OEM 4-pin connector only, creating a serious safety hazard to themselves and other road users.  Toyota should either equip the Highlander with proper wiring harness and 7-pin connector that allows the use of an on-board brake controller, or withdraw the towing capacity claim.",
        "vin": "5TDBZRFH3JS"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/09/2021",
        "dateOfIncident": "04/04/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407315,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 TOYOTA HIGHLANDER VEHICLE WAS SITTING IN PARKING LOT UNTOUCHED  ( WARM SUNNY DAY) .  VEHICLE WAS PARKED .    OWNER USED THE REMOTE HATCH OPENING BUTTON ON THE KEY REMOTE.  WHEN THE HATCH/ LIFT GATE STARTED OPENING A LOUD CRACKING / BUSTING SOUND WAS MADE.  THE SPOILER WAS SEPARATING ON THE SIDES  FROM THE HATCH AS WELL.    UPON INSPECTION, THE INSIDE PLASTIC HATCH COMPONENT HOLDING THE GLASS WINDOW WAS CRACKED IN 2 PLACES AND THE METAL PIECE INSIDE HATCH WAS BENT.   THERE WAS DAMAGE TO THE TOP OF THE VEHICLE WHERE THE HATCH / LIFT GATE IS SUPPOSE TO SEPARATE HOWEVER HATCH WAS RUBBING UP AGAINST THE TOP OF THE VEHICLE.     THE SAFETY RISK , THE SPOILER LOCATED ON THE BACK OF VEHICLE ATTACHED TO THE HATCH , BECAME DETACHED FROM ITS MOUNTED POSITION.  THIS CAUSED THE SPOILER TO SEPARATE AND OBSTRUCT THE HATCH LIFT GATE.  SPOILER LOCATED ON BACK IS CAUSING THE LIFT GATE TO NOT OPEN AND WHEN OWNER OPENS THE HATCH THE DETACHED SPOILER WILL CAUSE DAMAGE TO HATCH /LIFT GATE.",
        "vin": "5TDJZRFH7JS"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM,BACK OVER PREVENTION",
        "crash": true,
        "dateComplaintFiled": "03/27/2021",
        "dateOfIncident": "01/10/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405147,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "1)  BIGGEST ISSUE: I BOUGHT MY SUV NEW. IT WAS ADVERTISED 30/28 MPG. MY AVERAGE MPG SINCE I BOUGHT IT IS 22-23.   2) IT SLIDES WITH BARELY ANY ICE OR RAIN. IT IS AWFUL. IT SLIDE BACKWARD DOWN A SMALL HILL LAST YEAR & CAUSED ME TO CRASH. POLICE RESPONDED BUT WERE TOO BUSY WITH OTHER INCIDENTS TO WRITE A REPORT. I HAD THOUSANDS OF DOLLARS IN DAMAGES & RENTAL CAR FEES FOR THE 5-6 WEEKS IT TOOK TO HAVE IT REPAIRED. I LIVE IN THE PNW AND HAVE DRIVEN IN SNOW 35 YEARS. I'VE NEVER HAD SUCH BAD PERFORMANCE. I HAD TO BY MICHELIN ICE TIRES THIS YEAR BC OUR SUV IS SO BAD IN SNOW & ICE. 3) I WAS IN A MINOR COLLISION IN A PARKING LOT BC I DIDN'T SEE ANOTHER CAR BACKING OUT AT THE SAME TIME AND THE COLLISION SENSOR DIDN'T GO OFF. MY SENSORS WERE CLEAN 4) WHEN THE SENSORS HAVE EVEN THE SMALLEST LAYER OF SNOW THEY STOP WORKING. THAT MAKES THE CRUISE CONTROL SYSTEM STOP WORKING TOO. VERY FRUSTRATING. THE RESULT OF THESE ISSUES IS AN INCREASE BY $800/MO OF MY AUTO INSURANCE. BEFORE THIS SUV I HADN'T EVEN HAD A SPEEDING TICKET IN 14 YEARS. DATE OF ACCIDENT LISTED IS APPROXIMATION. NOW I HAVE 2 COLLISIONS. WISH I HAD PURCHASED SOMETHING ELSE.",
        "vin": "5TDDGRFH0JS"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/02/2021",
        "dateOfIncident": "02/28/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 4,
        "odiNumber": 11398708,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA HIGHLANDER. THE CONTACT STATED THAT WHILE AT A STANDSTILL, ANOTHER VEHICLE DRIVING AT 50 MPH CRASHED INTO THE FRONT DRIVER SIDE OF VEHICLE. THERE WERE NO WARNING LIGHTS ILLUMINATED AND THE AIR BAGS FAILED TO DEPLOY. THERE WERE 5 INJURED REPORTED AND 3 NEEDED MEDICAL TREATMENT. A POLICE REPORT WAS FILED THE VEHICLE WAS TOWED TO POLICE LOT. THE MANUFACTURER WAS NOT INFORMED OF FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 33,000.",
        "vin": "5TDKZRFH1JS"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/26/2021",
        "dateOfIncident": "05/02/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398357,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 TOYOTA HIGHLANDER. CONSUMER WRITES REGARDING INABILITY TO HAVE RECALL PERFORMED DUE TO PARTS BEING UNAVAILABLE. *LD *JS",
        "vin": "5TDDZRFH6JS"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/25/2021",
        "dateOfIncident": "12/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397859,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA HIGHLANDER. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V682000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT HAD EXPERIENCED THE FAILURE WHEN THE CHECK ENGINE WARNING LIGHT ILLUMINATED AND THE VEHICLE FAILED TO START. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED HOWEVER, THE MECHANIC WAS UNABLE TO DUPLICATE THE FAILURE. THE BATTERY WAS REPLACED HOWEVER, THE FAILURE RECURRED AND OCCASIONALLY CAUSED THE VEHICLE TO STALL. TOYOTA OF ROCKWALL (1250 E I-30, ROCKWALL, TX 75087, (844) 358-4295) WAS CONTACTED AND INFORMED THE CONTACT THAT NO REMEDY WAS AVAILABLE FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 72,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TDZZRFH5JS"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/24/2021",
        "dateOfIncident": "02/15/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397688,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC HIGH BEAM SYSTEM SHUTS DOWN FOR NO REASON. THIS IS NOT THE NORMAL CYCLING (HIGH BEAMS ON/OFF WHEN TRAFFIC DETECTED) OF THE SYSTEM. ICON INDICATING SYSTEM IS ON DISAPPEARS AND CANNOT GET HIGH BEAMS TO OPERATE. THIS HAPPENS ON DARK STRAIGHT ROADS WITH NO OTHER TRAFFIC AROUND. DEALER STATES THAT THEY CANNOT EXPLAIN WHY THIS HAPPENS BUT THEY WILL NOT ADDRESS THIS ISSUE. TOYOTA HAS REPAIRED THIS EXACT SAME ISSUE ON THEIR LEXUS LINE (REPLACE TURN SIGNAL STALK) BUT REFUSES TO ADDRESS IT FOR THEIR TOYOTA MODELS. THIS SHOULD BE CONSIDERED A SAFETY ISSUE.",
        "vin": "5TDZARFH7JS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/15/2021",
        "dateOfIncident": "02/14/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396348,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR SUNROOF GLASS \"EXPLODED\" SUDDENLY WHILE DRIVING STRAIGHT ON A SMOOTH ROAD - NO ROCKS OR DEBRIS AROUND AND NORMAL COOL WINTER DAY ~25F.  DRIVING 70MPH ON MAINE I295 AT NOONTIME.  WE HAD BEEN DRIVING FOR TWO HOURS PRIOR TO THIS EVENT ALSO IN GOOD WEATHER AND GOOD ROAD CONDITIONS.  SOME GLASS BLEW OUTWARDS, AND MANY PIECES FELL ONTO THE PROTECTIVE COVER WHICH FORTUNATELY WAS CLOSED.  WE EVENTUALLY SLID THE COVER OPEN TO LOOK UP AND DISCOVERED WHAT HAPPENED.",
        "vin": "5TDJZRFHXJS"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/10/2021",
        "dateOfIncident": "02/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395551,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA HIGHLANDER. THE CONTACT STATED WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE STALLED WITHOUT WARNING. THE CONTACT STATED THAT THE FAILURE OCCURRED WHILE MOVING FROM A STOPPED POSITION. THE CONTACT STATED THAT OCCASIONALLY A JUMP WAS NEEDED TO START THE VEHICLE. OCCASIONALLY, THE VEHICLE WOULD RESTART AFTER WAITING FOR SEVERAL HOURS. THE CONTACT STATED THAT HE REPLACED THE BATTERY HOWEVER THE FAILURE PERSISTED. THE VEHCILE WAS TAKEN TO TOYOTA PLAZA MALL (2721 NOSTRAND AVE, BROOKLYN, NY 11210) WHERE NO FAILURE WAS DIAGNOSED HOWEVER, THE BATTERY WAS REPLACED AGAIN. THE MANUFACTURER WAS NOT CONTACTED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V682000 (FUEL SYSTEM, GASOLINE) AND BELIEVED THAT THE FAILURE WAS RELATED TO THE RECALL. THE PARTS WERE NOT YET AVAILABLE. THE FAILURE MILEAGE WAS 80,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TDJZRFH4JS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/31/2021",
        "dateOfIncident": "11/30/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390878,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "LIGHTS CAME ON FOR ENGINE WARNING -- LOW FUEL PUMP NEEDS TO BE REPLACED",
        "vin": "5TDYZRFH5JS"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/26/2021",
        "dateOfIncident": "01/26/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389968,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS IN MY DRIVEWAY BOTH TIMES THAT THIS HAS HAPPENED SO FAR. I WENT OUT FIRST THING IN THE MORNING TO START IT AND THE BRAKE PEDAL WAS EXTREMELY HARD WHEN I WENT TO PRESS THE PEDAL IN ORDER TO PUT THE ENGINE START BUTTON AND ALL OF THE ELECTRONICS TURNED ON BUT THE VEHICLE REFUSED TO START AND DISPLAYED A MESSAGE STATING \"BRAKING POWER LOW, STOP IN A SAFE PLACE. I FOUND A RECALL NOTICE THAT WAS SHARED ON THE TOYOTA FORUMS FOR THIS EXACT REASON; HOWEVER, MINE ISN'T INCLUDED IN THE RECALL ALONG WITH MANY OTHER PEOPLE THAT WERE ALSO EXCLUDED AND ARE HAVING THIS SAME PROBLEM, ACCORDING TO THE NUMBER OF COMPLAINTS ON THE TOYOTA AND LEXUS FORUMS. I HAVE ATTACHED A COPY OF THE RECALL THAT WAS POSTED ON THE FORUM ALONG WITH THE MESSAGE THAT WAS DISPLAYED WHEN MY HIGHLANDER WOULDN'T START. I KEPT TRYING FOR 10 MINUTES AND FINALLY USED THE REMOTE START TO START IT (WHICH MADE THE BRAKE PEDAL SOFT ENOUGH TO PRESS DOWN). I THEN TURNED OFF THE REMOTE START AND WAS THEN ABLE TO START IT LIKE NORMAL. HAD I NOT HAD REMOTE START, I WOULD HAVE HAD TO HAVE THE VEHICLE TOWED.",
        "vin": "5TDDZRFH9JS"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/25/2021",
        "dateOfIncident": "12/24/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389732,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTING BATTERY IS DEFECTIVE. MY TOYOTA DEALER STATED THE \"THIS IS A KNOW ISSUE WITH TOYOTA. THEY HAD A DEFECTIVE BATCH OF BATTERIES\".  THE ISSUE IS THAT THE REPLACEMENT BATTERIES ARE UNAVAILABLE, RENDERING THE CAR USELESS AS IT CANNOT BE STARTED. THE BATTERY DOES NOT HOLD A CHARGE. THIS IS COVERED UNDER THE NEW VEHICLE WARRANTY.",
        "vin": "5TDDGRFH5JS"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/21/2020",
        "dateOfIncident": "12/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384411,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS DRIVING ON STREET AND CHECK ENGINE LIGHT CAME ON. TOOK VEHICLE TO SERVICE PROVIDER AND IS RELATED TO RECALL. NO REMEDY FOR RECALL HAS BEEN DEVELOPED -- CURRENTLY DRIVING A LOANER CAR.",
        "vin": "5TDYZRFH5JS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/22/2020",
        "dateOfIncident": "10/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365828,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AN INSPECTION FOUND MY LEFT REAR BRAKE WAS SEVERELY WORN AT ONLY 21000 MILES.  THIS IS SO UNUSUAL I WANT TO REGISTER MY COMPLAINT.  ALL OF THE THREE BRAKES WERE ONLY LIGHTLY WORN.",
        "vin": "5TDJZRFH0JS"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/21/2020",
        "dateOfIncident": "09/17/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360211,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AS OF THIS DATE, MY 2018 TOYOTA HIGHLANDER HAS DELAYED ACCELERATION, HESITATION, JERKING, LURCHING, ERRATIC THROTTLE RESPONSES, ETC. WHILE ACCELERATING FROM A STOP. THIS HAS OCCURRED TWO TIMES TO DATE. I WAS ABLE TO PULL TO THE SIDE OF THE ROAD, SHUT OFF THE VEHICLE, RESTART AND THEN THE VEHICLE PERFORMED PROPERLY AFTER THAT. MY CONCERN IS WHAT MAY HAPPEN WHEN IT DOES IT AGAIN. NOTHING TO SHOW IN A PHOTO.",
        "vin": "5TDDZRFH5JS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/16/2020",
        "dateOfIncident": "09/08/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355380,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA HIGHLANDER HAULING A 2019 WINNEBAGO TRAVEL TRAILER. THE CONTACT NOTICED A LARGE CRACK ON THE TRAILER HITCH. THE VEHICLE WAS TAKEN TO BRENT BROWN TOYOTA (1400 SANDHILL RD, OREM, UT 84058) WHERE IT WAS DIAGNOSED HOWEVER, THE MECHANIC WAS UNABLE TO DETERMINE WHAT CAUSED THE CRACK TO THE HITCH ON THE TOYOTA. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 27,000. THE TRAILER MILEAGE WAS 1,000.",
        "vin": "5TDDZRFH3JS"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "09/15/2020",
        "dateOfIncident": "03/20/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11355055,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I CONTACTED TOYOTA AND COMPLAINED ABOUT THE SEAT AS IT GAVE INSTANT PAIN IN THE SPINE AND NECK AND VERY HARD TO DRIVE SITTING ON THE DRIVERS OR DRIVER SIDE PASSENGER SEAT. BEING TOO CURVEY IS NEITHER AGRONOMIC FOR ANY STANDARD SIZE HUMAN BEING NOR ALLOWS ANY REST TO THE BACKBONE. THE HEADREST IS VERY TILTED FORWARD, WHICH STRAINS THE SPINE AND NECK IMMEDIATELY. I HAD A TOYOTA HIGHLANDER 2005, AND I DIDN'T PAY MUCH ATTENTION TO ANY TEST DRIVE BECAUSE THE SEAT ON THE HIGHLANDER 2005 WAS VERY COMFORTABLE. BUT 2018 IS HORRIBLE TO DRIVE. I'M VERY MUCH REGRETTING BUYING SUCH A CAR THAT I CAN'T DRIVE WITHOUT HURTING MY SPINE AND NECK. THE TOYOTA SUPPORT SUGGESTED USING A CUSHION BETWEEN THE SEAT AND DRIVERS BACK, AND THE VENDOR OFFERED NO TO FIX THE ISSUE. I DON'T THINK I'LL EVER BUY FROM A BUSINESS THAT PUNISHES THE CUSTOMER THROUGH SELLING HORRIBLE PRODUCTS AND DECLINE TO TAKE THE RESPONSIBILITY TO FIX IT. I ENDED UP PAYING ABOUT $35000 FOR A NOT RIDABLE VEHICLE, AND I'M FEELING MISERABLE ABOUT IT.",
        "vin": "5TDZARFH7JS"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/31/2020",
        "dateOfIncident": "08/30/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352217,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WINDSHIELD CRACKED SPONTANEOUSLY AT TWO YEARS OLD.  THE VEHICLE WAS NOT EVEN MOVING AND NEVER GOT STRUCK WITH A STONE OR A VEHICLE DEBRIS.  THE CRACK IS VERY CLEAN AND LINEA WITHOUT ANY DENT AND STARTS FROM THE BOTTOM OF THE WINDSHIELD ALL THE WAY TO ONE-FOURTH OF THE HEIGHT OF THE WINDSHIELD ON THE PASSENGER FRONT SIDE.  NUMEROUS COMPLAINT ABOUT THIS PROBLEM IS LOGGED IN A TOYOTA CUSTOMER COMPLAINT WEBSITE ABOUT THE TOYOTA HIGHLANDER FROM 2016-2018 HAVING THE SAME PROBLEM.  PLEASE TELL TOYOTA TO FIX THIS PROBLEM.",
        "vin": "5TDJZRFH9JS"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/30/2020",
        "dateOfIncident": "08/30/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11352156,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SUV WAS IN A CRASH AND HIT A TREE MID FRONT BUMPER WITH SIGNIFICANT DAMAGE TO THE FRONT OF SUV. DAMAGE APPEARS TO BE FROM THE FRONT PASSENGER COMPARTMENT FORWARD.  DRIVER WAS WEARING SEATBELT AND NO AIRBAG DEPLOYED OF ANY KIND IN ANY AREA OF THE SUV. DRIVER HIT THE STEERING WHEEL AND WAS INJURED. VEHICLE WAS IN FORWARD MOTION AT AN UNKNOWN RATE OF SPEED . WAITING TO SEE IF SUV WILL BE A TOTAL LOSS VIA INSURANCE COMPANY. COMPONENT  SYSTEM THAT APPEARS TO BE S CAUSE OF THIS SAFETY ISSUE IS THE AIR BAG SYSTEM.",
        "vin": "5TDZZRFH8JS"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/25/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351130,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA HIGHLANDER. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE). THE CONTACT CALLED AN UNKNOWN TOYOTA DEALER, LOCATED IN FAIRFIELD, CA, AND IT WAS CONFIRMED THAT THE PARTS WERE NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR.  THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/21/2020",
        "dateOfIncident": "08/21/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350691,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA HIGHLANDER. THE CONTACT STATED WHILE DRIVING 35 MPH, THE VEHICLE STALLED ON SEVERAL OCCASIONS WITH THE CHECK ENGINE WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO ROUTE 22 TOYOTA (109 US-22, HILLSIDE, NJ 07205, (973) 287-4741), BUT WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS CONTACTED AND REFERRED CONTACT TO NHTSA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE). THE FAILURE MILEAGE WAS 20,000. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "5TDJZRFH9JS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/17/2020",
        "dateOfIncident": "08/17/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349828,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENTLY DURING NORMAL DRIVING CONDITIONS, THERE EXISTS INSTANCES WHERE BRAKE HYDRAULIC FAILURE OCCURS.  AT TIMES THE \"BRAKE\" INDICATOR LIGHT WILL ILLUMINATE ASSOCIATED WITH INCREASED BRAKE PEDAL FEEL.  BRAKING POWER IS REDUCED.  ALSO, DRIVER DISPLAY SCREEN DISPLAYS \"BRAKING POWER LOW\" WARNING INDICATION.  AFTER STOP AND PLACING IN PARK, BRAKE HYDRAULIC POWER RETURNS AND OPERATE AS NORMAL.",
        "vin": "5TDYZRFH4JS"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/17/2020",
        "dateOfIncident": "08/17/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349484,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 TOYOTA HIGHLANDER. CONSUMER WRITES IN REGARDS TO FUEL PUMP SAFETY RECALL. *LD    THE CONSUMER STATED THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME COMPLETING THE RECALL REPAIR. *JS",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/12/2020",
        "dateOfIncident": "08/12/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348834,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA HIGHLANDER. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. AN UNKNOWN DEALER WAS CONTACTED AND CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.*DT*JB",
        "vin": "5TDDZRFH8JS"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/12/2020",
        "dateOfIncident": "12/12/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348839,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2018 TOYOTA HIGHLANDER EXPERIENCED 4 DIFFERENT EPISODES OF SPONTANEOUS ACCELERATION WHILE ON LOCAL HIGHWAYS, 3 BEING ON RESUMPTION OF SPEED WHILE USING CRUISE CONTROL AND THE 4TH NOT WHILE ON CRUISE CONTROL.THERE ARE 10 OTHER ELECTRONIC TYPES OF MALFUNCTIONS NOT INVOLVING SAFETY ISSUES.  PER THE LEMON LAW OF WA STATE, THE MATTER WAS TAKEN TO ARBITRATION.  THE ARBITRATER FOUND IN MY FAVOR AND AWARDED ME A NEW REPLACEMENT HIGHLANDER.  TOYOTA HAS ASKED FOR A JURY TRIAL.  I THEREFORE CONTINUE TO DRIVE A VEHICLE THAT COULD CAUSE A DANGEROUS, POTENTIALLY FATAL CAR.    I CAN SUPPLY FURTHER DOCUMENTATION SHOULD YOU WANT IT.",
        "vin": "5TDJZRFH4JS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/24/2020",
        "dateOfIncident": "07/23/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341257,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AS MY HUSBAND WAS DRIVING WITH THE SUNROOF CLOSED (THE GLASS AND MATERIAL PART). HE HEARD A LOUD EXPLOSION. IT WAS THE SUNROOF IMPLODING. HE OPENED THE MATERIAL PART AND GLASSED RAINED DOWN. THERE WAS NO OBJECT THAT FELL DOWN, TO SHOW IT WAS HIT. ALSO, NO MARK FROM THE INSIDE TO INDICATE IT WAS HIT FROM INSIDE THE CAR. THIS TOOK PLACE WHILE MY HUSBAND WAS DRIVING ON THE 794 BRIDGE IN MILWAUKEE, WI.",
        "vin": "5TDKZRFH1JS"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/17/2020",
        "dateOfIncident": "07/16/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339882,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC HIGH BEAM FUNCTION SHUTS DOWN ERRATICALLY LEAVING CAR WITH NO HIGH BEAMS. NECESSARY TO TURN OFF AUTOMATIC FUNCTION TO USE HIGH BEAMS. THIS HAPPENS WHILE IN MOTION @ 30-35 MPH ON A COMPLETELY DARK ROAD AND WITH NO ONCOMING OR LEADING TRAFIIC TO TRIGGER FUNCTION TO SHUT DOWN HIGH BEAMS.",
        "vin": "5TDZARFH7JS"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/08/2020",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338202,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA HIGHLANDER. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE).  THE CONTACT STATED AFTER STARTING THE VEHICLE, THE VEHICLE IDLED ROUGH. THE LOW-PRESSURE WARNING LIGHT WAS ILLUMINATED. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED AVONDALE TOYOTA (10005 W, PAPAGO FWY, AVONDALE, AZ 85323, (877) 554-6890) AND WAS INFORMED THAT PARTS WERE NOT AVAILABLE FOR THE RECALL REPAIR. THE CONTACT WAS OFFERED A LOANER VEHICLE BUT DECLINED THE OFFER. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 9,000. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "5TDKZRFH2JS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/23/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330271,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RECALL WAS POSTED ON JANUARY 13. TOYOTA DID NOT NOTIFY US UNTIL MID MAY. THERE IS STILL NO REMEDY. IT IS MORE THAN 6 MONTHS. OUR HIGHLANDER IS SITTING IN A TOYOTA SERVICE CENTER FOR OVER A MONTH. WE NEED THEM TO REMEDY THE SITUATION IMMEDIATELY. TOYOTA RENTED A CAR FOR US BUT WE ARE PAYING EXTRA FOR INSURANCE ON THE RENTAL- $400 A MONTH. CAN YOU FIND OUT WHY IT'S TAKING THEM  SO LONG TO COME UP WITH A REMEDY? THANK YOU.  *TR",
        "vin": "5TDJZRFH8JS"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/10/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328189,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA HIGHLANDER. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. HOLMAN TOYOTA (1301 NJ-73, MT LAUREL TOWNSHIP, NJ 08054) WAS CONTACTED AND CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR.  THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TDJZRFH4JS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/06/2020",
        "dateOfIncident": "06/05/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327495,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS ONLY 2YEARS BUT I FOUND OIL ARE LEAKING.  I HAD CHECK UP AT LOCAL BODY SHOP AND THEY FOUND OUT THAT OIL LEAKS VACUUM PUMP SO I NEED TO REPLACE.  *TR",
        "vin": "5TDBZRFH2JS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/29/2020",
        "dateOfIncident": "04/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326434,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAD PROBLEMS ACCELERATING TWO TIMES FROM AFTER BEING STOPPED AT A STOP LIGHT. IT WAS ROUGH, DASH LIGHTS FLASHED QUICKLY AND I WAS UNABLE TO SEE WHICH LIGHTS WERE FLASHING. AS I COULD NOT RECREATE THE PROBLEM AFTER THAT, I WASN'T SURE ABOUT BRINGING IT TO THE DEALER. TWO WEEKS LATER I RECEIVED MY NOTICE ABOUT THE FUEL PUMP BEING RECALLED. NOW THE CAR IS AT THE DEALERSHIP. I REFUSE TO DRIVE AN UNSAFE CAR. TOYOTA HAS NOT SUPPLIED A TIMELY FIX. THE CAR HAS LESS THAN 20,000 MILES ON IT. TOYOTA SHOULD BUY THE CAR BACK.  *TR",
        "vin": "5TDJZRFHXJS"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/29/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326465,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA HIGHLANDER. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE MANUFACTURER AND TOYOTA OF SLIDELL LOCATED AT 300 BEACH RD, SLIDELL, LA, WERE NOTIFIED OF THE FAILURE BUT OFFERED NO ASSISTANCE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TDYZRFH7JS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/29/2020",
        "dateOfIncident": "05/05/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326480,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MAY 5, 2020 I STOPPED AT A RED LIGHT IN THE LEFT TURN LANE, AFTER JUST HAVING A 20K MAINTENANCE PERFORMED ON MY 2018 HIGHLANDER XLE.  AFTER THE LIGHT TURNED GREEN, I ACCELERATED AND AS I WAS ENTERING THE INTERSECTION, THE VEHICLE ABRUPTLY STALLED.  IT WAS NOT A SMOOTH DECELERATION, BUT RATHER A JOLTING AND ABRUPT, SLAMMING DECELERATION, ALMOST SCREECHING TO A HALT.  LUCKILY, THE CAR BEHIND ME SLAMMED ON THEIR BRAKES AND DID NOT HIT ME.  ENGINE LIGHTS CAME ON, AND AFTER THE CAR WAS STOPPED COMPLETELY, IT RESTARTED AND I DROVE INTO THE NEAREST PARKING LOT.  HAD I AND THE CARS BEHIND ME BEEN TRAVELING FASTER, IT'S LIKELY THAT I WOULD HAVE BEEN REAR-ENDED.  THE STOPPING FORCE WAS ENOUGH TO SLAM ME INTO MY SEATBELT.  I CALLED TOYOTA SERVICE AND THEY RECOMMENDED THAT I TURN OFF THE AUTO-START FUNCTION EVERY TIME I DRIVE THE VEHICLE, WHICH I HAVE DONE.  THIS APPEARS TO BE DIRECTLY RELATED TO THE SAFETY RECALL 20TA02, WHERE THE LOW-PRESSURE FUEL PUMP MAY STOP OPERATING.  THE VEHICLE IS IN AN EXTREMELY UNSAFE DRIVING CONDITION AND I'M VERY DISAPPOINTED THAT TOYOTA HAS NOT ROLLED OUT THE RECALL REPAIR SOONER.  I'M LUCKY THAT I WAS THE ONLY OCCUPANT IN THE VEHICLE, AND IF THIS HAPPENED ON THE FREEWAY WITH MY FAMILY IN THE CAR, THE RESULTS COULD HAVE BEEN CATASTROPHIC.  *TR",
        "vin": "5TDJZRFH2JS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/26/2020",
        "dateOfIncident": "05/25/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326062,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2018 TOYOTA HIGHLANDER, ME AND MY FAMILY INCLUDING MY 4 YEAR OLD SON WERE TAKING A DRIVE UP TO NEVADA CITY. WE LIVE IN CALIFORNIA AND WHEN WE GOT ON THE ROAD AND TRIED TO COME TO A STOP ON THE HIGHWAY AND THE STEERING WHEEL AND BRAKES  STARTED TO SHAKE. WE DECIDED TO PULL OVER AND AS WE PULLED OVER THE CAR STALLED, WE PUT THE CAR IN PARK AND TRIED TO TURN IT ON WITH NO LUCK LEFT IT OFF FOR A COUPLE MINUTES AND STILL NO LUCK AN ERROR CAME ON THAT SAID LOW BREAKING POWER. WE HAD RECEIVED A RECALL NOTICE SO WE CALLED TOYOTA AND THEY STATED THEY WOULD NEED TO CHARGE US ABOUT 200 DOLLARS TO CHECK THE CAR. TOOK THE CAR IN AND THEY DECIDED TO KEEP OUT CAR UNTIL THERE IS A RESOLUTION FOR THE RECALL WHICH THEY SAID COULD TAKE 3 TO 4 MONTHS. JUST UNETHICAL FOR TOYOTA TO CHARGE US FOR A PROBLEM THAT IS COMPLETELY OUT OF OUR CONTROL NOT ONLY THAT BUT 4 MONTHS TO FIX A RECALL ERROR IS JUST RIDICULOUS. NOW WE'RE TERRIFIED TO DRIVE THE CAR ESPECIALLY WHEN OUR 4 YEAR OLD SON IN THE CAR. CONTACTED TOYOTA MANUFACTURER AND THEY WERE REALLY UNWILLING TO HELP GAVE US A RUN AROUND AND WE DIDN'T COME TO A RESOLUTION ABOUT THE PROBLEM. THEY DIDN'T OWN UP TO THE PROBLEM AND WE WERE LEFT WITH MORE UNANSWERED QUESTIONS.  *TR",
        "vin": "5TDJZRFH1JS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/18/2020",
        "dateOfIncident": "04/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325069,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE VEHICLE WAS HAVING ISSUES BRAKING AS IT WOULD NOT WANT TO COME TO A STOP. THE ENGINE LIGHT WOULD TURN ON INDICATING ISSUE BUT WOULD DISAPPEAR FROM DASHBOARD. THERE WAS AT TIMES THAT ACCIDENT WOULD ALMOST OCCUR DUE TO NOT BEING ABLE TO PROPERLY STOP. DURING THE TIME OF DRIVING THIS OCCURRED ON A HIGHWAY WHILE IN MOTION. TOOK VEHICLE TO DEALERSHIP AND COMPUTER WOULD NOT REGISTER THE ISSUE AS THE ENGINE LIGHT WAS NO LONGER ACTIVATING. EMPLOYEES TOOK VEHICLE FOR TEST DRIVER AND DETERMINED SOMETHING WAS WRONG AS HE COULD ALSO SENSE AN ISSUE WITH BRAKING. VEHICLE WAS LEFT AT THE DEALERSHIP FOR REPAIRS.  *TR",
        "vin": "5TDZZRFH7JS"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/13/2020",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324403,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA HIGHLANDER. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE.  A DEALER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL SHOWED NO RECALL ASSOCIATED WITH THE VIN.",
        "vin": "5TDJZRFH4JS"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/12/2020",
        "dateOfIncident": "01/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324276,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA HIGHLANDER. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED GREG LEBLANC TOYOTA, 220 S HOLLYWOOD RD, HOUMA, LA 70360, (985) 876-7210, AND WAS INFORMED THE PART WAS NOT AVAILABLE FOR THE REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TDZZRFH0JS"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/08/2020",
        "dateOfIncident": "01/22/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323886,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BLIND SPOT MONITOR ON PASSENGER SIDE WORKS INTERMITTENTLY WHEN DRIVING, ESPECIALLY ON INTERSTATE HIGHWAYS.  *TR",
        "vin": "5TDJZRFH2JS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/06/2020",
        "dateOfIncident": "04/28/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323522,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA HIGHLANDER. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. MUNGENAST ALTON TOYOTA (850 E HOMER ADAMS PKWY, ALTON, IL 62002) WAS CONTACTED AND CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TDJZRFH3JS"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/05/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323327,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA HIGHLANDER. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. BAYSIDE TOYOTA (105 AUTO DR, PRINCE FREDERICK, MD 20678, (410) 535-1500) AND THE MANUFACTURER WERE MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TDDZRFH3JS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/05/2020",
        "dateOfIncident": "05/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323354,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA HAS NO REMEDY FOR FUEL PUMP RECALL.WITH AIRLINE TRAVEL NO GOOD WITH COUVID19,HOW CAN I SAFELY DRIVE 700-880 MILES KNOWING CAR COULD STALL AT HIGH SPEEDS? I COULD GET REAR ENDED ON INTERSTATE!  WHY CAN'T TOYOTA COME UP WITH QUICK REMEDY?  NOTHING HAS HAPPENED YET TO THE VEHICLE!!  *TR",
        "vin": "5TDJZRFH9JS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/02/2020",
        "dateOfIncident": "01/20/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323056,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "LEARNED OF RECALL IN JAN. 2020--SINCE THEN TOYOTA HAS NOT PROVIDED A REMEDY FOR THIS RECALL BASED ON DIRECT CONTACT WITH TOYOTA, THE DEALERSHIP I PURCHASED VEHICLE FROM,NTHSA AND MEDIA---I HAVE VERY LIMITED USE OF VEHICLE BECAUSE OF  THE CHANCE FOR ACCIDENTS AND BEING STRANDED IF VEHICLE SHUTS DOWN,WOUKD LIKE TOYOTA BUY BACK VEHICLE",
        "vin": "5TDJZRFH7JS"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/23/2020",
        "dateOfIncident": "04/22/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321996,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA HIGHLANDER. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. A DEALER WAS NOT MADE AWARE OF THE ISSUE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TDJZRFHXJS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/20/2020",
        "dateOfIncident": "07/09/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321689,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA HIGHLANDER. THE CONTACT STATED THAT UPON MAKING A COMPLETE STOP, THE VEHICLE HESITATED TO MOVE FORWARD WHEN DEPRESSING THE ACCELERATOR. THE FAILURE OCCURRED INTERMITTENTLY WITHOUT WARNING. THE CONTACT THEN RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED LAKELAND TOYOTA (2925 MALL HILL DR, LAKELAND, FL 33810) AND WAS INFORMED THAT THE VIN WAS NOT INCLUDED IN THE RECALL. THE MANUFACTURER HAD NOT BEEN NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 25,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TDKZRFH2JS"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/19/2020",
        "dateOfIncident": "04/17/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321569,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WIFE'S HIGHLANDER GOING BACK TO DEALERSHIP FOR THE SECOND TIME DUE TO WINDSHIELD WIPERS NOT WORKING",
        "vin": "5TDDZRFH3JS"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/17/2020",
        "dateOfIncident": "03/16/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321401,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "PHONE SYSTEM CUTS OUT AND DOESN'T DOWNLOAD CONTACTS. BEING TOLD TOYOTA IS DOING UPDATE. THIS HAS BEEN TOLD TO ME 6-8 TIMES. I CONTINUALLY TAKE THE CAR IN FOR SERVICE.   I WAS NEVER CONTACTED ABOUT A FUEL PUMP RECALL THAT CAN CAUSE A CRASH. I FOUND THE RECALL MYSELF. TO THIS DATE I HAVE NOT RECEIVED NOTICE OF THE RECALL. I FORCED TOYOTA TO GIVE ME A RENTAL CAR AND NOT A TOYOTA. THAT WAS ON MARCH 16TH. TO THIS DATE THERE IS NO FIX AND MY CAR IS SITTING IN FLORIDA. TOYOTA REFUSED TO ALLOW ME TO LEAVE IT AT THE DEALERSHIP EVEN THOUGH I LIVE IN DELAWARE. I WAS ALSO TOLD WHEN THEY DO HAVE A FIX I WOULD NEED TO GET THE CAR INTO THE DEALERSHIP WITHIN 10 DAYS, NO MATTER WHAT THE STATE OF THE COUNTRY IS. THEY WILL CANCEL MY RENTAL IF I DON'T.   I DO NOT FEEL SAFE IN THIS CAR ANY LONGER SINCE I CONTINUE TO GET LIES FROM THEM ABOUT THE PHONE ISSUE AND NO INFORMATION ABOUT A RECALL. HOW DO I PROCEED WITH A COMPLAINT TO YOU AND IS THE LEMON LAW VIABLE?  *TR",
        "vin": "5TDDZRFHXJS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/25/2020",
        "dateOfIncident": "03/25/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319219,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA HIGHLANDER. THE CONTACT DISCOVERED THAT THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR.  THE MANUFACTURER NOR THE DEALER HAD BEEN NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TDJZRFH3JS"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/02/2020",
        "dateOfIncident": "01/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315649,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ISSUES WITH HANDS-FREE DEVICE WORKING INTERMITTENTLY. PHONE BEING USED IS IPHONE 11 MAX AND WHEN CONNECTED IT SEEMS THAT RADIO AND HANDS FREE WILL GO OFF UNTIL THEY REBOOT THEMSELVES.",
        "vin": "5TDKZRFH8JS"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/28/2020",
        "dateOfIncident": "02/23/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11312018,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SLAMMED ON THE BREAKS AND THE CAR KEPT GOING AND CRASHED INTO ANOTHER CAR INFRONT OF ME. THERE WAS AT LEAST 300 FEET DISTANCE FROM THE TIME I SLAMMED ON THE BREAKS TILL THE CRASH. I WAS GOING ON HIGHWAY ABOUT 50 MPH.",
        "vin": "5TDBZRFH6JS"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/05/2020",
        "dateOfIncident": "01/25/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11307214,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE INVOLVED IN A MOTOR VEHICLE ACCIDENT ON 01/25/2020 WHERE WE EXPERIENCED A FRONT IMPACT COLLISION, AND THE AIRBAGS DID NOT DEPLOY.  WE WERE IN MOTION IN THE LEFT TURNING LANE OF A TWO LANE ROAD, THE ADVERSE VEHICLE PULLED OUT FROM A PARKING LOT ON THE RIGHT, CROSSED TWO LANES OF TRAFFIC RIGHT INTO THE FRONT OF OUR VEHICLE CAUSING US TO COLLIDE.  THE FORCE OF THE COLLISION WAS SO HARD THAT THE ENGINE MOUNT ON THE TOP SIDE HAS BROKEN AWAY FROM THE ENGINE, I PROJECTED FORWARD AND MY GLASSES FLEW FROM MY FACE.  MY WIFE AND I HAVE BUMPS AND BRUISES, ISSUES WITH OUR BACKS, SHOULDER AND WRIST PAIN.  DURING THE IMPPACT THE AIRBAGS FAILED TO DEPLOY.  THE INSURANCE ADJUSTER HAS DECLARED THE VEHICLE A TOTAL LOSS.  WHEN WE SPOKE WITH THE BODY SHOP THEY STATED THAT THEY COULD NOT BELIEVE THAT THE AIRBAGS DID NOT GO OFF WITH THIS TYPE OF IMPACT.",
        "vin": "5TDDGRFHXJS"
    },
    {
        "components": "SUSPENSION,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/30/2020",
        "dateOfIncident": "01/25/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11303022,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS IN PARK AND ROLLED.  IT PICKED UP SPEED AS IT CONTINUED TO ROLL AND THERE WEREN'T ANY OCCUPANT. THIS TOOK PLACE IN A DRIVEWAY. THE VEHICLE ROLLS WHILE THE EMERGENCY BRAKE IS ON ALLL THE TIME AS WELL.",
        "vin": "5TDJZRFHXJS"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "01/29/2020",
        "dateOfIncident": "01/28/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11302878,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INVOLVED IN A MOTOR VEHICLE ACCIDENT ON 1/28/20 WHERE I SUSTAINED A DIRECT, FRONT IMPACT COLLISION, AND THE AIRBAGS FAILED TO DEPLOY. I WAS IN MOTION ON A CITY STREET, ACCELERATING FORWARD THROUGH A GREEN-LIT INTERSECTION WHEN A LARGE DODGE RAM TRUCK TURNED IN FRONT OF ME CAUSING OUR VEHICLES TO COLLIDE. THE IMPACT WAS SO HEAVY THAT IT CAUSED MY BODY TO PROJECT FORWARD AND UPWARDS. MY SON'S GLASSES FLEW OFF HIS FACE AND ALL CUPS IN CUP HOLDERS FLEW ACROSS THE CAR. MY SON COMPLAINED OF THE SEATBELT HURTING HIS SHOULDER, AND I SUSTAINED BRUISES ON MY LEGS AND ARMS. UPON THIS IMPACT, NO AIRBAGS WERE DEPLOYED. THIS CAR WAS DETERMINED BY THE ADJUSTER TO BE A TOTAL LOSS. THE INSURANCE INVESTIGATOR STATED HE WAS 'SHOCKED' THE AIRBAGS DID NOT DEPLOY ON SUCH A 'GNARLY' COLLISION. THE INSURANCE ADJUSTER REPORTED THAT HE WAS 'FLABBERGASTED' THE AIRBAGS DID NOT DEPLOY DUE TO THE SEVERITY OF THE IMPACT.",
        "vin": "5TDJZRFH6JS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/19/2020",
        "dateOfIncident": "05/03/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300292,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "PRE COLLISION SYSTEM AS ADVERTISED DOES NOT FUNCTION. IT DOES NOT WARN NOR SELF BRAKE FOR IMMINENT COLLISIONS WITH VEHICLES NOR PEDESTRIANS SHOULD DRIVER FAIL TO REACT  MANUALLY IN TIME. SELF TESTS USING LARGE CARDBOARD BOXES HAVE VERIFIED THIS. TOYOTA  REFUSES TO REMEDY PROBLEM NOR RECOGNIZE OWNER TEST. NON FUNCTIONAL SINCE NEW, 5/2/18. SEVERAL DEALERS AND TOYOTA CUST. SERVICE CONTACTED & COMPLAINT IGNORED.  ALL INSTANCES VEHICLE IN MOTION ON PUBLIC ROADWAYS. BOX TEST IN MOTION IN PARKING LOT.",
        "vin": "5TDKZRFH9JS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/17/2020",
        "dateOfIncident": "01/10/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300137,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BLUETOOTH KEEPS TURNING OFF SO I AM NOT ABLE TO USE MY PHONE HANDSFREE",
        "vin": "5TDJZRFH3JS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/17/2020",
        "dateOfIncident": "10/02/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300186,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BLUETOOTH CONNECTIVITY DOES NOT WORK FOR OWNERS OF IPHONE 11 PRO MAX WITH THIS MAKE MODEL AND YEAR OF VEHICLE. I HAVE CONTACTED BOTH APPLE AND TOYOTA TO TRY TO RECTIFY THIS ISSUE, AS IT DIRECTLY IMPAIRS THE SAFE DRIVING OF THIS VEHICLE DUE TO NO ACCESS TO THE HANDS FREE FEATURES. I HAVE COMPLIED WITH EACH COMPANY'S DIRECTIVES AND NOTHING HAS CORRECTED THE ISSUE. I AM BEING TOLD BY APPLE THAT TOYOTA NEEDS TO UPDATE ITS BLUETOOTH SOFTWARE, AND BEING TOLD BY TOYOTA THAT IT IS AN APPLE ISSUE. I AM TIRED OF THE RUN AROUND AND I WANT THIS FIXED.",
        "vin": "5TDJZRFH4JS"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/13/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299133,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEMS WITH MY 2018 TOYOTA HIGHLANDER ([XXX])     1 ) LANE DEPART INDICATOR:SOMETIMES DOESN'T WORK UNTIL I'VE DRIVEN 1 OR 2 OR 4 MILES. SOMETIMES IN EVERY TRIP STOPS WORKING AS WELL AS ACTIVATES WHEN MAYBE A FOOT FROM LANE MARKERS ON BOTH SIDES OF THE CAR  2) CLIMATE CONTROL: USUALLY DOES NOT RETAIN MEMORY OF FAN SPEED, CONTROL OF PASSENGER SIDE TEMP, AND AIR FLOW DIRECTION WHEN RESTARTING THE CAR. WHEN TEMP SET ON, E.G. 69 TEMP IN CAR IS ~76-80.  WHEN AIRFLOW SHOWS THE FLOW AIMED AT WINDSHIELD & FEET, MOST OF THE AIR FLOW COMES TO MY TORSO WITH MINIMAL FLOW TO OTHER 2 SITES.  3) NEED COFFEE BREAK MESSAGE: HAS COME ON TWICE WHEN ON A LONG TRIP, DISAPPEARING AFTER ~ A MINUTE, BUT SEVERAL TIMES CAME ON AFTER DRIVING ONLY 2-4 MILES.   4) FAULTY RESUMPTION OF SPEED: WHEN THE SPEED CONTROL WAS SET AT 50 MPH (ONCE) OR 60 MPH (ONCE) AND I TOGGLED THE CONTROL TO RESUME SET SPEED THE CAR SPED UP WELL BEYOND WHAT IT WAS SET AT. I HAD TO DISENGAGE THE SPEED CONTROLLER TO STOP THE ACCELERATION. HAPPENED AGAIN ~3 WEEKS AGO WHEN SPEED SET AT 35, AND WHEN I TOGGLED IT RESUME SPEED IT ROARED AHEAD UNTIL IT REACHED 45 MPH.   5) DOOR HANDLE LOCKING MECHANISM; NOT AS SENSITIVE TO LOCKING WHEN TOUCHED AS IT WAS WHEN CAR WAS NEW. UNLOCKING WHEN TOUCHING HANDLE WORKS FINE.  6) MOTOR TURNOFF WHEN AT STOPLIGHT: SELDOM WORKS.  WHEN IT DOES IT TURNS ITSELF OFF AFTER AS LITTLE AS 30 SECONDS EVEN THO PRESSURE ON BRAKE PEDAL IS CONSTANT.  8) (NON-ELECTRONIC PROBLEM) THE TRANSPARENT PLASTIC COVER OVER THE DASH CONTROL SETTINGS IS DETERIORATING - - CAN?T SEE THRU IT VERY WELL IN CERTAIN WAYS THE LIGHT HITS IT   9) SPEEDOMETER READING PROBLEM: WHEN CRUISE CONTROL IS WORKING, THE DIGITAL READOUT FOR THE SPEED IS USUALLY 1-2 MPH LOWER THAN WHAT THE SPEEDOMETER DIAL SAYS IT IS.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "5TDJZRFH4JS"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/06/2020",
        "dateOfIncident": "01/04/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297298,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SLOWLY (3-5MPH) MOVING TOWARD EXIT RAMP FROM HOSPITAL PARKING LOT.  TRIED TO BRAKE BEFORE TURNING RIGHT ONTO RAMP, BUT SERVICE BRAKE DIDN'T RESPOND  --  FELT LIKE I WAS JUST POUNDING THE FLOOR.  VEHICLE CONTINUED TO COAST.  I TURNED IT ONTO EXIT RAMP.  DURING COAST DOWN RAMP THE MULTI-FUNCTION DISPLAY SHOWED \"LOW BRAKE POWER\" OR \"BRAKE POWER LOW\".  VEHICLE SPEED REMAINED RELATIVELY CONSTANT.  I SHIFTED INTO R (REVERSE), THINK THAT NO HARM WOULD COME TO TRANSMISSION AT THAT SPEED, BUT NOTHING HAPPENED; COAST REMAINED CONSTANT.  LUCKILY NO VEHICLES WERE IN FRONT OF MINE AND NONE WERE COMING ON RT 25 BRIGHTON AVE WESTBOUND IN PORTLAND ME, SO I WAS ABLE TO STEER THE COASTING VEHICLE TO A SLOW STOP ALONG THE ROAD'S EDGE (BUT STILL HALFWAY INTO THE TRAVEL LANE).  THEN THE MULTI-FUNCTION DISPLAY TOLD ME THAT THE VEHICLE'S ENGINE HAD BEEN TURNED OFF (NOT BY ME).  A CITY BUS CAME ALONG ABOUT ONE MINUTE LATER;  IF IT HAD COME BY ONE MINUTE BEFORE THAT THERE WOULD HAVE BEEN A COLLISION WITH MY VEHICLE.     AFTER WAITING TO RECOVER FROM THE SHOCK OF THAT EVENT, I STARTED THE VEHICLE AND TESTED THE BRAKES, AND THEY SEEMED NORMAL AND THERE WERE NO UNUSUAL LIGHTS ON MESSAGES ON THE VEHICLE DISPLAYS.  I TRIED DRIVING IT CAREFULLY, AND IT SEEMED NORMAL, SO I DROVE IT OFF BRIGHTON AVE AND ULTIMATELY GOT IT HOME IN BUXTON WITHOUT ANY MORE ADVERSE EVENTS.   TODAY I LOOKED AT THE BRAKE FLUID RESERVOIR AND IT WAS NORMAL (1/4 INCH BELOW MAX). I'M HAVING IT TOWED TO THE DEALERSHIP WHERE I BOUGHT IT ON MARCH 1, 2018 AND WILL NOT DRIVE IT AGAIN UNTIL THEY TELL ME IT HAS BEEN FIXED.",
        "vin": "5TDBZRFH0JS"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/09/2019",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11267384,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN PULLING INTO A PARKING PLACE, SLOWLY, WITH RIGHT FOOT ON THE BRAKE, GETTING READY TO STOP BEFORE THE CURB, THE CAR ACCELERATED, JUMPED THE CURB GOING OVER THE SIDEWALK AND HIT THE BUILDING.  MY RIGHT FOOT WAS STILL ON THE BRAKE WHEN IT STOPPED. THIS HAPPENED IN A DOCTORS OFFICE PARKING LOT.  AIR BAGS DID NOT INFLATE.",
        "vin": "5TDKZRFH4JS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/02/2019",
        "dateOfIncident": "09/29/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265593,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN FILLING THE VEHICLE WITH GAS, AFTER THE GAS PUMP SHUTS OFF, GAS COMES SURGING BACK OUT OFF THE FILLER NECK WITH ENOUGH FORCE TO SPLASH ON WHOMEVER IS FILLING THE VEHICLE. THIS HAPPENS AT MULTIPLE GAS STATIONS AND DIFFERENT PUMPS WITH DIFFERENT FLOW RATES. EACH TIME, THE HANDLE IS EITHER BEING HELD BY HAND OR BY LATCH ON PUMP HANDLE. WHEN THE TANK IS FULL, PUMP SHUTS OFF AND GASOLINE HAS CEASED TO FLOW FROM THE NOZZLE, THE GASOLINE THEN IMMEDIATELY SURGES BACK OUT OF THE VEHICLE. THERE IS ENOUGH GAS THAT COMES BACK OUT TO MAKE A PUDDLE ON THE GROUND. DEALER DIAGNOSED AND REPLACED A FAULTY VENT VALVE. AFTER TWO MONTHS THE PROBLEM IS HAPPENING AGAIN. HAVE PROVIDED VIDEO EVIDENCE TO THE DEALER. DEALER REFUSES TO ESCALATE OR RECOGNIZE IT AS A SAFETY CONCERN. REFUSES TO PROVIDE LOANER VEHICLE WHILE VEHICLE IS DIAGNOSED AND REPAIRED. DUE TO THE NATURE OF THIS SAFETY ISSUE AND HIGH PROBABILITY OF CONTAMINATION FROM GASOLINE AND ENVIRONMENTAL CONCERNS COMPOUNDED BY THE RECURRENT NATURE OF THIS ISSUE, I FEEL THIS NEEDS TO BE ELEVATED EXPEDIENTLY.",
        "vin": "5TDDGRFH3JS"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/25/2019",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254952,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 TOYOTA HIGHLANDER. CONSUMER WRITES IN REGARDS TO VEHICLE COLLISION SAFETY FEATURES FAILURE TO OPERATE. *LD  *JS",
        "vin": "5TDKZRFH9JS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/26/2019",
        "dateOfIncident": "08/24/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246467,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR SUNROOF ON OUR CAR SHATTERED FOR NO APPARENT REASON ON 8/24/19 WHILE WE WERE DRIVING ON THE FREEWAY (I-15 IN NORTHERN UTAH, AROUND 8PM). THERE WAS NO EVIDENCE OF AN IMPACT FROM A FOREIGN BODY WHEN WE WERE ABLE TO PULL OFF AND INVESTIGATE. INITIALLY THE GLASS WAS CRACKED BUT INTACT, BUT WHEN WE CONTINUED DOWN THE ROAD, THE PIECES STARTED FALLING INTO THE CLOTH COVER. WE CONTACTED OUR LOCAL TOYOTA DEALER TODAY (8/26/19) AND THE SHOP MANAGER TOLD MY HUSBAND THAT THIS WAS THE SECOND INCIDENT HE'D HEARD OF WITH A 2018 HIGHLANDER THIS MONTH.",
        "vin": "5TDDGRFH0JS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/26/2019",
        "dateOfIncident": "04/12/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246577,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR TOYOTA HIGHLANDER STARTED SHOWING SYMPTOMS OF \"SOFT BRAKE PEDAL\" IN 4.2019 - NOTHING WAS FOUND ON DIAGNOSTIC AT DEALERSHIP. SYMPTOMS OF \"SOFT BRAKE PEDAL CONTINUED TO HAPPEN. VEHICLE WENT INTO DEALERSHIP AGAIN IN 7.2019 AND WAS DIAGNOSED W/MASTER CYLINDER BRAKE FITTING LOOSE - FITTING TIGHTENED AND BRAKE SYSTEM FLUSHED. SYMPTOMS RETURNED WITHIN 2 DAYS AND WAS BROUGHT BACK TO DEALERSHIP - CASE OPENED WITH TOYOTA ENGINEERING AND MASTER CYLINDER REPLACED. PICKED UP VEHICLE FOLLOWING DAY BUT SYMPTOMS OF \"SOFT BRAKE PEDAL\" RETURNED 2 DAYS LATER. REPLICATION OF \"SOFT BRAKE PEDAL\" UNABLE.TO BE REPLICATED/DIAGNOSED AT DEALERSHIP. VEHICLE STILL \"UNSAFE AND HAZARDOUS\" TO DRIVE. AWAITING FOLLOW UP WITH TOYOTA.",
        "vin": "5TDDZRFH1JS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/16/2019",
        "dateOfIncident": "08/15/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244347,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE BRAKE ASSIST VACUUM PUMP FAILS TO PROVIDE ADEQUATE VACUUM FOR THE POWER BRAKE VACUUM ASSIST. RESULTING IS A LOSS OF BRAKING POWER. A BRAKE LIGHT ILLUMINATES INTERMITANTLY ON THE DASH PANEL AND POSSIBLY AN AUDIO WARNING AND ERROR MESSAGE. PLUS NO ERROR CODES ARE STORED IN MEMORY FOR FUTURE DIAGNOSIS. THIS HAPPENS WHETHER ON A RURAL ROAD, CITY STREET OR HIGHWAY. A PREVIOUS RECALL WAS ISSUED FOR THE 2018 TOYOTA HIGHLANDER FOR THIS SAME ISSUE BUT NOT FOR THIS SPECIFIC HIGHLANDER.",
        "vin": "5TDDZRFH4JS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/15/2019",
        "dateOfIncident": "08/06/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244138,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING INTO GRAND TETON NP OUR HIGHLANDER'S SUNROOF EXPLODED LOUDLY IN WHAT APPEARED TO BE A SPONTANEOUS FASHION. NO SIGN OF A ROCK OR OTHER ROAD DEBRIS WAS SEEN OR FOUND. FORTUNATELY, OUR SUN SHADE WAS CLOSED AND WE WERE NOT SHOWERED WITH GLASS. WE WERE TRAVELING ABOUT 45MPH AND THE WEATHER WAS SUNNY AND MILD AT ABOUT 68 DEGREES.",
        "vin": "5TDJZRFH5JS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/15/2019",
        "dateOfIncident": "08/15/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244183,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AT TIMES, THE BRAKES SEEM TO RANDOMLY LOCK UP. ALMOST LIKE THE PRESSURE IN THE BRAKE LINE IS AT FULL.",
        "vin": "5TDDGRFH2JS"
    },
    {
        "components": "STEERING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/07/2019",
        "dateOfIncident": "07/09/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242252,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL LEATHER IS PEELING AND CAUSING ISSUES WITH GRIP. HAVE A 5 YEAR OLD AND FEEL VERY UNSAFE DRIVING OUR HIGHLANDER WITH 20K ON IT THAT TOYOTA CLAIMS IS COSMETIC ISSUE. TRANSMISSION SHUDDERS VERY BADLY GOING UP HILLS AND ALMOST STALLS OUT.",
        "vin": "5TDYZRFH7JS"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/14/2019",
        "dateOfIncident": "07/10/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231682,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "LAST YEAR  02/22/2018 /3,168 MILES,  I HEAR A BANG/NOISE FROM REAR OF MY  HIGHLANDER ROAD ROUGH ONLY THEY FIXED.    THIS YEAR 07/102019 /12,780 MILES SAME PROBLEM",
        "vin": "5TDJZRFH2JS"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/11/2019",
        "dateOfIncident": "03/13/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230971,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA HIGHLANDER. WHILE DRIVING VARIOUS SPEEDS AND DEPRESSING THE ACCELERATOR PEDAL, THE VEHICLE WOULD NOT IMMEDIATELY RESPOND. APPROXIMATELY TWO SECONDS AFTER DEPRESSING THE ACCELERATOR PEDAL, THE ENGINE REVVED AND THE VEHICLE ABRUPTLY ACCELERATED FORWARD. THE VEHICLE WAS TAKEN TO CONICELLI TOYOTA (550 W. RIDGE PIKE, CONSHOHOCKEN, PA) ON SEVERAL OCCASIONS, BUT NO FAILURE WAS FOUND. THE CONTACT STATED THAT THE FAILURE CONTINUED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 3,450.  *AS    THE CONSUMER STATED THE VEHICLE WAS TAKEN BACK TO THE DEALER 6 TIMES FOR THE SAME DEFECT. *TR",
        "vin": "5TDJZRFH1JS"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/09/2019",
        "dateOfIncident": "05/31/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230390,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SPONTANEOUSLY EXPLODING PANORAMIC SUNROOF.I WAS DRIVING ON A TWO-LANE HIGHWAY ALONE ON THE ROAD MAY 31, 2019 AT APPROXIMATELY 4:30PM.I HAD MY SUNROOF COVER CLOSED AND WAS TRAVELING THE POSTED SPEED LIMIT OF 65 MPH WITH CRUISE CONTROL TURNED ON.I HEARD A VERY LOUD AND SHARP NOISE, I THOUGHT IT MIGHT BE A GUNSHOT.IT STARTLED ME QUITE A BIT, I WAS LUCKY TO BE THE ONLY CAR ON THE ROAD BECAUSE IF I HAD BEEN IN TRAFFIC AND HAD SWERVED FROM THE SHOCK OF THE NOISE,I MIGHT HAVE BEEN INVOLVED IN AN ACCIDENT.I LOOKED AROUND AND CHECKED ALL OF MY WINDOWS, NONE WERE BROKEN.I THEN THOUGHT A TIRE HAD BLOWN, BUT I HAD NOT LOST ANY HANDLING, SO I CONTINUED ALONG THE HIGHWAY STILL WONDERING WHAT HAD HAPPENED.ABOUT 10 MINUTES LATER I WAS STOPPED AT A TRAFFIC LIGHT, SURROUNDED BY OTHER CARS AND AGAIN HEARD A VERY LOUD AND SHARP GUNSHOT SOUNDING NOISE.I AGAIN LOOKED ALL AROUND MY CAR AND DID NOT SEE ANY DAMAGE.BUT AT THIS POINT I WAS SURE SOMETHING WAS WRONG WITH MY CAR AND DECIDED TO PULL OVER AT THE NEXT SPOT TO GET OUT AND INSPECT MY CAR.WHEN THE LIGHT TURNED GREEN AND I DROVE AWAY FROM THE INTERSECTION, I HEARD A SOUND AKIN TO ICE CUBES IN A GLASS AND KNEW THAT IT WAS BROKEN GLASS.AGAIN, I COULDN'T SEE ANY DAMAGE.I PULLED OVER AND LOOKED AT THE ROOF OF MY CAR, THE REAR SUNROOF WAS SHATTERED INTO TINY PIECES LAYING ON THE SUNROOF COVER.I BELIEVE THE SUNROOF GLASS IS DEFECTIVE OR IMPROPERLY ENGINEERED AND FEEL IT IS A DANGER.THE TOYOTA DEALERSHIP BLAMED IT ON A ROCK, BUT FROM THE ADDITIONAL RESEARCH I HAVE DONE, IT IS NOT AN ISOLATED INCIDENT AND THERE IS GROWING CONCERN SURROUNDING THE SAFETY OF THESE TYPES OF SUNROOFS IN ALL TYPES OF AUTOMOBILES.I FILED AN INSURANCE CLAIM TO COVER THE DAMAGE; BUT FEEL THAT TOYOTA SHOULD TAKE RESPONSIBILITY FOR THE DAMAGE AND FEEL VERY ANXIOUS NOW DRIVING MY CAR.I DO NOT FEEL IT IS SAFE AND WORRY CONSTANTLY ABOUT THE GLASS SPONTANEOUSLY BREAKING AGAIN.",
        "vin": "5TDDZRFH6JS"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/27/2019",
        "dateOfIncident": "03/18/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210159,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "APON ACCESLARATION , CAR HESITATE FOR A FEW SECOND, RPM GOES TO 5000 UNTIL VEHICLE SLOWLY START TO MOVE. FEELS LIKEW THER IS NO PROPER SYNCH BETWEEN ENGING AND TRANSMISSION. DANGEROUS WHEN PASSING OR AVOIDING A VEHICLE AHEAD OF YOU. THE SAME ISSUE WHILE  USING  THE CRUSE CONTROL, IT JUMPS FROM A FEW RPMS TO 5K + THAT ALWAYS I HAVE TO BRAKE TO AVID RAMMING A CAR AHEAD OF ME. BRAKES GET SOF THAT I HAVE TO PUMP IT A FEW TIMES. MILEAGE IS 1780 MILES.",
        "vin": "5TDJZRFH9JS"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/21/2019",
        "dateOfIncident": "03/20/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209035,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AND LIGHT STAY BLINKING",
        "vin": "5TDKZRFHXJS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/16/2019",
        "dateOfIncident": "05/03/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208119,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MUSTY SMELL IN THE VEHICLE SINCE NOVEMBER OF 2018, VEHICLE BROUGHT TO DEALERSHIP EARLY APRIL 2019 WITH NO RESOLUTION. VEHICLE RETURNED TO DEALERSHIP EARLY MAY 2019. WATER FOUND UNDER PASSENGER CARPET ALONG WITH MOLD. ADVISED BY TOYOTA NO DEFECTIVE PARTS AND THERE IS NOTHING THEY CAN DO.",
        "vin": "5TDJZRFHXJS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "05/03/2019",
        "dateOfIncident": "12/04/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205430,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PRE-COLLISION SYSTEM FAILED TO ASSIST IN AVOIDING AN ACCIDENT WHEN THE CAR IN FRONT OF ME STOPPED SUDDENLY IN TRAFFIC ON A HIGHWAY.  SINCE THE REPAIR, THE BRAKE WARNING INDICATOR LIGHT ON THE SPEEDOMETER SIDE OF THE INSTRUMENT CLUSTER INTERMITTENTLY ILLUMINATES AND THE BRAKE PEDAL PULSES AS IF THE ABS SYSTEM IS ENGAGING. ONCE IT STOPPED ME SUDDENLY WHILE DRIVING DOWN A BUSY CITY STREET.  WENT FROM 35 TO 0 VERY SUDDENLY.  I HAVE TAKEN THIS TO 2 DEALERS AND THEY SAY THERE IS NOTHING WRONG.  THE SYSTEM DOES NOT INDICATE AN ERROR EVEN THOUGH THE LIGHT IS ON AND THEY TESTED WHILE IT WAS ON.  I CAN RECREATE THE ISSUE BY ACCELERATING QUICKLY WHILE TURNING LEFT.  SOMETIMES IT HAPPENS WHEN GOING STRAIGHT, BUT THE ONLY WAY TO GUARANTEE IT WILL HAPPEN IS TO TURN AND ACCELERATE QUICKLY.  NEITHER OF THE 2 DEALERS I HAVE TAKEN IT TO HAVE FOUND THE ISSUE AND TOYOTA CUSTOMER CARE STOPPED CALLING ME BACK.",
        "vin": "5TDJZRFH1JS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/25/2019",
        "dateOfIncident": "01/22/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203750,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "JANUARY 22, 2019 WHILE DRIVING APPROXIMATELY 75 MPH  ON THE INTERSTATE THE PANORAMIC SUNROOF GLASS EXPLODED IN MY CAR.   SOUNDED LIKE A SHOTGUN WHEN OFF AND THE PRESSURE I FELT IN MY BACK, I THOUGHT I GOT SHOT.   GLASS TOTALLY BLEW OUT OF THE CAR WITH ONLY A COUPLE INCHES LEFT AROUND THE SIDES.  NO ROCKS OR ANYTHING HIT IT.  FILED A POLICE REPORT.",
        "vin": "5TDYZRFHXJS"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/22/2019",
        "dateOfIncident": "02/08/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11202999,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN HIT BREAKS HARD... I HEAR A BANG/NOISE FROM REAR OF MY HIGHLANGER. ( DEALERSHIP ADMIT THIS IS ABNORMAL SOUND BUT THEY CAN'T DO ANYTHING ABOUT IT). TRANSMISSION SHIFT ROUGHLY, NOT SMOOTH SHIFTING. IF CAR IS IN DRIVE AND IM HOLDING BREAKS CAR REAR STARTS MAKING BANGING NOISE N START SHAKING. SO FAR MY CAR HAS ONLY 20K MILES ON IT . SUSPENSION IS PRETTY STIFF DOESN'T HELP WHILE DRIVING OVER POST HOLES.",
        "vin": "5TDBZRFH3JS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/22/2019",
        "dateOfIncident": "03/20/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190851,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED A HESITATION WITH THE VEHICLE WHEN I PRESSED THE GAS PEDAL. ON ONE INCIDENT ON I-288 I PRESSED THE GAS TO PASS A CAR AND IT HESITATED AND THE RPM JUMPTED TO 51/2. FINALLY THE CAR ENGAGED SO I COULD PASS. I THOUGHT IT WAS GOING TO BLOW UP. ON THE WAY HOME ON I-295 IT REPEATED AGAIN ONLY THIS TIME THE  RPM JUMPED TO 4. THIS WAS ON 3/20 AND THE DEALER STILL HAS THE VEHICLE AND CAN'T FIGURE OUT THE PROBLEM. THE SERVICE MANAGER DID DRIVE IT WITH ME AND FELT THE HESITATION.",
        "vin": "5TDBZRFHXJS"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/21/2019",
        "dateOfIncident": "03/21/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190636,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "EARLY TODAY, 3/21/19, WAS ALERTED THAT MY HATCHBACK WAS OPEN. THE CAR HAD BEEN LOCKED FOR SEVERAL HOURS, BUT WHEN I CAME OUTSIDE I WAS TOLD BY A FRIEND THAT THE HATCH HAD JUST OPENED ON IT'S OWN. ABOUT AN HOUR LATER, I WAS DRIVING AFTER DARK AND RECEIVED A BLINDSIDE MIRROR ALERT--THE CLOSEST CAR WAS AT LEAST TWO CAR LENGTHS IMMEDIATELY BEHIND ME IN THE SAME LANE. SHORTLY AFTER, THE CAUTION LIGHT CAME ON, BEEPED, THE ECO LIGHT CAME ON, IT BEEPED AGAIN AND THE ECO LIGHT WENT OFF. ABOUT 40 MINUTES LATER, I HAD THE BRIGHT HEADLIGHTS ON WITH THE AUTO DIM ENACTED. THE HEADLIGHTS WENT OUT, THE DASH LIGHTS WENT OUT, THE RADIO STAYED ON, AND THE NAVIGATION SCREEN GOT VERY BRIGHT. I HAD TO RETURN THE LIGHT CONTROL ON THE SIGNAL SWITCH AWAY FROM THE SETTING AND THEN BACK TO GET THE HEADLIGHTS AND DASH LIGHT TO COME BACK ON. ALL EVENTS EXCEPT HATCH WERE WHEN VEHICLE IN MOTION. HATCH OPENED WHILE PARKED AND EMPTY. ALL EVENTS WERE WITHIN APPROXIMATELY 2 HOURS OF EACH OTHER. 10000 MILE SERVICE HAD JUST BEEN COMPLETED 3/15/19 WITH NO CONCERNS NOTED.",
        "vin": "5TDJZRFH8JS"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/16/2019",
        "dateOfIncident": "03/16/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187225,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE XLE FRONT PASSENGER  SEAT SITS VERY HIGH, CAUSING MY HEAD TO BRUSH UP AGAINST THE CEILING. THIS IS WILL CAUSE HEAD AND POSSIBLY NECK INJURIES IN THE EVENT OF A COLLISION. I'M NOT PARTICULARLY TALL AT 5'10', BUT ANYONE TALLER WILL HAVE A WORSE PROBLEM. THERE IS NO WAY TO LOWER THIS SEAT.  I DON'T WANT TO SUFFER A HEAD INJURY JUST BECAUSE THE SEAT IS VERY HIGH.",
        "vin": "5TDJZRFH8JS"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/13/2019",
        "dateOfIncident": "03/13/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186677,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DEAR SIR.    UNIT CAN NOT BE CHANGED.  THE UNIT CAN NOT BE CHANGED FROM  F TO &#8451;.    I HAVE BEEN LIVING IN CELSIUS TEMPERATURE ENVIRONMENT FOR MORE THAN 50 YEARS AND HAVE RECENTLY EMIGRATED TO THE UNITED STATES.    BY THE WAY, MY CAR CAN NOT SEE THE CELSIUS TEMPERATURE.    SO, I HAVE TO CALCULATE THE FAHRENHEIT TEMPERATURE IN DEGREES CELSIUS FOR A SHORT TIME EACH TIME TO KNOW THE CURRENT CELSIUS TEMPERATURE.    (CALCULATED SIMILARLY TO CELSIUS TEMPERATURE = (FAHRENHEIT - 30) / 2)    I CAN NOT CONCENTRATE ON DRIVING WHILE CALCULATING THE CELSIUS TEMPERATURE,   AND I HAVE TO CONCENTRATE ON THE CALCULATION. (DURING THE SHORT TIME)    I KNOW THAT A CAR ACCIDENT HAPPENS IN A VERY SHORT TIME.    I WAS REGULARLY CHECKED AT A TOYOTA DEALERSHIP TODAY.  (5,000 MILES FREE SERVICE)    I CAN NOT CHANGE THE UNIT TO CELSIUS TEMPERATURE WHEN I START REGULAR INSPECTION.  I ASKED YOU TO CHECK.    AFTER COMPLETING THE REGULAR CHECK, THE SERVICE CONSULTANT ANSWERED ME \"I CAN NOT CHANGE TO CELSIUS.\"    SO, I ASKED AGAIN WHY NOT.  A SERVICE CONSULTANT REPLIED,   \"A CAR PRODUCED IN THE UNITED STATES RECENTLY HAS NO CHANGE IN CELSIUS.\"    SO, I AM WRITING THIS ARTICLE.  THE TOYOTA SERVICE CONSULTANT SAYS THAT THE 2018 TOYOTA HIGHLANDER, PRODUCED IN THE UNITED STATES, IS UNCHANGED IN UNITS OF CELSIUS.    PLEASE MAKE SURE THAT NEW CARS PRODUCED IN THE FUTURE CAN BE CHANGED IN UNITS OF CELSIUS TEMPERATURE.  (FOR REFERENCE, THE UNITS ARE CHANGED FROM 'MILE' TO 'KM'.)    I WOULD LIKE TO RECEIVE A REPLY BY EMAIL    THANK YOU, SIR.  *TR",
        "vin": "5TDDZRFH3JS"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/11/2019",
        "dateOfIncident": "02/25/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185734,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS ARE REALLY DIM MAKING IT DIFFICULT TO SEE AT NIGHT.  WHEN I AM NEXT TO OTHER VEHICLES, THEIR HEADLIGHTS LIGHT UP THE ROAD IN FRONT OF ME AT LEAST 80% MORE THAN MY HEADLIGHTS.  PHYSICALLY, THE HOUSING LOOKS DEFECTIVE BECAUSE IT IS CLOUDY.  PERHAPS A RECALL SHOULD BE ISSUED.  I HAVE HAD THE CAR SINCE MAY 2018 BUT NEVER DROVE DURING NIGHT / DARK HOURS UNTIL MY SHIFT RECENTLY CHANGED.",
        "vin": "5TDYZRFH0JS"
    },
    {
        "components": "WHEELS,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/03/2019",
        "dateOfIncident": "02/09/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183795,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR VIBRATION AT 40MPH AND UP AND BRAKE VIBRATION TOO .",
        "vin": "5TDYZRFH6JS"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/02/2019",
        "dateOfIncident": "02/28/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183683,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MICHELIN TIRES DEFECTIVE TRACTION. TOYOTA AND MICHELIN REFUSES TO HELP WITH DEFECTIVE TIRES. MONRO MUFFLER DEEMED TIRES UNSAFE.",
        "vin": "5TDJZRFH7JS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/21/2019",
        "dateOfIncident": "02/21/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181714,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "LOW POWER BRAKING POWER LIGHT COMES ON AND VEHICLE WILL NOT START. OWNED FOR JUST 6 MONTHS WITH JUST OVER 2000 MILES . THIS HAPPENED WHILE PARKED IN MY DRIVEWAY.",
        "vin": "5TDJZRFH9JS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/20/2019",
        "dateOfIncident": "02/19/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181267,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER CAR HAS BEEN DRIVEN, IS OFF AND SITTING IN LOCKED GARAGE AFTER ABOUT 2 HOURS A LOUD BUZZING SOUND CAN BE HEARD WHICH EVENTUALLY CHANGES TO A LOW SEMI BUZZING (ALMOST LIKE A COMPUTER DOWNLOADING AND A FAN TO COOL IT DOWN). I'VE CONTACTED THE SERVICE DEPARTMENT AND LEFT A DETAILED MESSAGE, BUT NO RESPONSE. I'M AWARE OF CYBER SECURITY, AND SINCE MY HUSBAND WORKS FOR DOE (WAPA), IT WORRIES ME. MY HUSBAND ALTERNATES WEEKLY ON DRIVING THE HIGHLANDER OR THE 2000 TACOMA. WHEN HE DOESN'T DRIVE THE HIGHLANDER THERE IS NO NOISE, WHEN HE DOES THE BUZZING SOUND HAPPENS. THIS IS TOO COINCIDENTAL. IS THIS NORMAL? THE SOUND APPEARS LOUDEST BY THE RIGHT REAR WHEEL WELL. IT NORMALLY HAPPENS AFTER 11:00 P.M. AND COMPLETES BEFORE 11:30 P.M., HOWEVER, OVER THE PAST 4 DAYS THE SCHEDULE HAS CHANGED. TONIGHT IT RAN FROM 8:00 P.M. TO 8:35 P.M.  WHAT IS GOING ON WITH OUR NEW VEHICLE? IS IT SAFE FOR MY HUSBAND TO DRIVE?",
        "vin": "5TDZZRFH6JS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/03/2019",
        "dateOfIncident": "07/27/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173757,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE THE FIRST DAY OF OWNERSHIP (07/27/2018, THIS VEHICLE HAS THE VERY PUNGENT ODOR OF ANTIFREEZE COMING FROM OUTSIDE THE VEHICLE, DRIVER SIDE.AFTER THE ENGINE REACHES NORMAL OPERATING TEMPERATURE. THERE ARE NO VISIBLE SIGNS OF COOLANT LEAKING, EITHER ON THE PAVEMENT OR INSIDE THE ENGINE COMPARTMENT. THERE IS NO ODOR INSIDE THE CAR INDICATING A LEAKING HEATER CORE. THE CAR IS ONLY EIGHT MONTHS OLD AND 4800 MILES.THIS VEHICLE HAS BEEN TAKEN TO THE DEALERSHIP THREE TIMES WITH NO SOLUTION YET.",
        "vin": "5TDYZRFH0JS"
    },
    {
        "components": "UNKNOWN OR OTHER,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "01/22/2019",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171376,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN VEHICLE IS IN MOTION BLIND SPOT MONITORING SYSTEM INTERMITTENTLY DETECTS VEHICLES AND HAS CAUSED ME TO CUTOFF VEHICLES THAT ARE ON THE PASSENGER SIDE DUE TO NO DETECTION.  DEALER IS UNABLE TO DO ANYTHING SINCE THERE IS NO SYSTEM FAILURE BUT IT IS A SAFETY ISSUE AND WILL CAUSE DRIVERS TO CUTOFF OR TURN INTO VEHICLES THAT ARE IN THERE BLIND SPOTS.  THIS HAPPENS ON CITY AND HIGHWAY DRIVING AND CAN FAIL AT ANYTIME WITHOUT NOTICE.",
        "vin": "5TDDZRFH8JS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "01/15/2019",
        "dateOfIncident": "01/12/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170114,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING THE WINTER OR WHEN THE ROAD IS WET OR MUDDY, THE RADAR CONTROLLED CRUISE CONTROL , AND OTHER SAFETY FEATURES SHUT DOWN. THIS RESULTS IN DANGER TO THE PASSANGERS WHO ARE TOLD ON THE IN DASH SCREEN TO STOP AND CLEAN THE SENSORS. MY BACK UP CAMERA WAS CLOUDED AND DID NOT SHOW A CAR  BEHIND ME AND I BACKED INTO IT RESULTING IN COSTLY REPAIRS.",
        "vin": "5TDBZRFH4JS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/02/2019",
        "dateOfIncident": "10/22/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164450,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED BRAND NEW TOYOTA HIGHLANDER 2018 ON OCT. 20, 2018 BUT THE RATTLE (CLICKING) NOISE FROM PASSENGER DOOR SIDE (B-PILLAR). I CAN HEAR THE NOISE MOSTLY WHILE I AM DRIVING ON THE HIGHWAY. I DO NOT HAVE ANY CRASH AND ACCIDENT.",
        "vin": "5TDJZRFH6JS"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/01/2018",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11155391,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INCIDENT INVOLVES A 2018 TOYOTA HIGHLANDER V6 AWD THAT WAS PURCHASED NEW ON JUNE 1, 2018.  AS MY 12 YEAR OLD SON WAS BUCKLING HIMSELF INTO THE 2ND ROW DRIVER-SIDE SEAT TODAY, THE SEAT BELT RIPPED APART IN HIS HANDS. THE SUDDEN-MOTION LOCKING MECHANISM NEVER ENGAGED, AND NO UNDUE FORCE (EXCEPT FOR WHAT ONE WOULD EXPECT FROM A NORMAL 12 YEAR OLD) WAS APPLIED WHEN PULLING THE SEATBELT FROM ITS STOWED POSITION. WHEN I PERSONALLY INSPECTED THE REMAINING SEVEN (7) SEATBELTS, BOTH THE 3RD ROW DRIVER-SIDE AND PASSENGER-SIDE SEATBELTS FAILED UNDER MINIMAL STRESS (FAR LESS THAN MY FULL BODY WEIGHT OR STRENGTH).",
        "vin": "5TDJZRFH0JS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/28/2018",
        "dateOfIncident": "11/27/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154634,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER VEHICLE HAS WARMED UP ENGINE RPM SPEED DROPS TO NEAR 500 WHEN BRAKE ENGAGED AT STOP LIGHTS AND VEHICLE IDLES ROUGH AND ATTEMPTS TO STALL. SHIFTING TO NEUTRAL BRINGS RPM SPEED BACK UP AND IDLES SMOOTH AGAIN. PROBLEM OCCURS DAILY OVER LAST TWO MONTHS. VEHICLE IS NEAR NEW, 1750 MILES. AUTO STOP START FEATURE IS NOT ENGAGED. TAKEN TO DEALER WHO ADVISED NO PROBLEM FOUND. RETURNING TO DEALER AGAIN FOR ANOTHER TRY AND HOPEFULLY BETTER RESULTS.",
        "vin": "5TDJZRFH4JS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/06/2018",
        "dateOfIncident": "11/06/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11149707,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF EXPLODED WHILE DRIVING ~ NO INCIDENT OF FLYING DEBRIS",
        "vin": "5TDYZRFHXJS"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/30/2018",
        "dateOfIncident": "10/30/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144123,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RADIO SHORTED OUT DISABLING ALL COMPUTER APPS I WAS TOLD BY MIDTOWN TOYOTA IT WILL TAKE A WEEK FOR NEW RADIO TO ARRIVE",
        "vin": "5TDJZRFH1JS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/17/2018",
        "dateOfIncident": "09/26/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141081,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA HIGHLANDER. THE CONTACT NOTICED FLUID LEAKING FROM THE ENGINE. THE VEHICLE WAS TAKEN TO TOYOTA OF BOWIE (16700 GOVERNOR BRIDGE RD, BOWIE, MD 20716) WHERE IT WAS DIAGNOSED THAT THE ENGINE GASKET WAS NOT SEALED CORRECTLY. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 4,200. THE VIN WAS NOT PROVIDED.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/13/2018",
        "dateOfIncident": "08/11/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129327,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A  NEW TOYOTA HIGHLANDER FROM MASSEY TOYOTA IN KINSTON, NC IN MAY OF 2018. ON AUGUST 11, 2018, THE REAR HATCH GLASS SPONTANEOUSLY EXPLODED AND FELL OUT OF THE CAR WHILE IT WAS SITTING UNTOUCHED IN THE DRIVEWAY OF THE OWNERS HOME. THE WEATHER WAS CLEAR AND WARM. TOYOTA INITIALLY REFUSED TO COVER THIS UNDER THE TOYOTA NEW CAR WARRANTY, HOWEVER FINALLY THEY AGREED TO COVER THE WINDOW.  A FEW DAYS LATER MY WIFE STARTED NOTICING A SQUEAK AND RUBBING NOISE COMING FROM THE BACK HATCH WHEN THE CAR WAS WAS WARM FROM THE SUN. AFTER TAKING THE CAR BACK NUMEROUS TIMES TO THE DEALER. THE TOYOTA SERVICE DEPARTMENT DISCOVERED THAT THE BACK HATCH/BACK DOOR WAS RUBBING NEAR THE SPOILER AREA OF THE HING, AT SUCH A FORCE TO CAUSE PAINT TO COME OFF THE AREA. THE SERVICE MANAGER AGREED THAT THIS WAS A MANUFACTURER DEFECT AND THAT TOYOTA WAS REQUIRED TO COVER THIS NEW CAR DEFECT. HOWEVER, AFTER HAVING THE CAR FOR 2 WEEKS TOYOTA REFUSED TO COVER THE MANUFACTURE DEFECT. IN CONCLUSION, THE 2018 TOYOTA HIGHLANDER MODEL HAS A DEFECT THAT RESULTS IN THE BACK REAR DOOR & SPOILER TO RUB AND RESULTS IN THE BACK HATCH GLASS BREAKING AND EVEN FURTHER DAMAGE TO THE PAINT AND BODY OF THE VEHICLE.  TOYOTA HAS SHOWN A THEY CAN NOT BE TRUSTED TO FULFILL THEIR OBLIGATION TO NEW CAR CUSTOMERS.",
        "vin": "5TDJZRFH7JS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/29/2018",
        "dateOfIncident": "08/05/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123309,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED NOTIFICATION OF OF SAFETY RECALL FOR HIGHLANDER 2018 NHTSA RECALL NO 18V-211 VACUUM PUMP.   CAR WAS TESTED AT DEALER ON JUN 13TH, AND IT WAS DETERMINED THAT THE VEHICLE NEED THE REPAIR.  VACUUM PUMP NEEDS TO BE REPLACED.  REPLACEMENT PART WAS ORDERED BUT IT HAS NOT BEEN AVAILABLE, ITS BEEN 10 WEEKS.  THE CAR PRESENTED FAILURE FOR THIS PROBLEM 4 WEEKS AGO.  IT IS NOT LONGER SAFE TO DRIVE IT.   TOYOTA HAS NOT PROVIDED AN ESTIMATE REPAIR DATE, CAR IS AT THE DEALERSHIP SINCE AUGUST 6TH.",
        "vin": "5TDJZRFH6JS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/23/2018",
        "dateOfIncident": "05/20/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121898,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA HIGHLANDER. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V211000 (SERVICE BRAKES, HYDRAULIC); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. PRICE TOYOTA (168 N DUPONT HWY, NEW CASTLE, DE 19720, (302) 322-8600) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "5TDDZRFH0JS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/29/2018",
        "dateOfIncident": "07/29/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114440,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD JUST MADE A LEFT HAND TURN. I WASN'T GOING MORE THAN 40 MPH. I DIDN'T HAVE ANY CARS NEXT TO ME OR IN FRONT OF ME WHEN I HEARD A LOUD EXPLOSION.  I PULLED OVER BECAUSE I ASSUMED SOMETHING HIT MY CAR, BUT DIDN'T SEE ANY BODY DAMAGE. I STARTED DRIVING AGAIN AND COULD HEAR AIR COMING IN LIKE A WINDOW WAS DOWN WHEN I REALIZED IT WAS COMING FROM MY SUNROOF. I PULLED BACK THE SUN SHADE TO LOOK AT THE SUNROOF WHEN I SAW MY SUNROOF WAS SHATTERED. I PULLED OVER AGAIN TO LOOK AT IT AND DIDN'T SEE ANY ROCK OR OBJECT THAT WOULD HAVE BROKEN THE SUNROOF. THE SUNROOF HAD A HOLE AND THE GLASS WAS SOLDERED THROUGHOUT. IT ACTUALLY EXPLODED ON OWN.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/20/2018",
        "dateOfIncident": "07/18/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112614,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BLIND SIDE MONITOR, BSM, ON THE PASSENGER SIDE DOES NOT WORK! IT DOES NOT CONSISTENTLY DETECT LARGE SEMI-TRUCKS, LARGE PICKUP TRUCKS, SOME SUV VEHICLES AND RANDOM CARS. THE BSM ON THE DRIVER'S SIDE OF THE VEHICLE WORKS VERY WELL. I HAVE BEEN TOLD BY THE TOYOTA DEALERSHIP THAT THIS IS HAPPENING TO 2018 COROLLA'S AND ALSO THE HIGHLANDER.  THIS IS VERY DANGEROUS SINCE THE SYSTEM DOES NOT SHOW A LARGE VEHICLE IN YOUR BLINDSPOT AS ADVERTISED AND COULD LEAD TO A SERIOUS ACCIDENT.      I PRESENTED THE SERVICE DEPARTMENT OF TOYOTA VIDEO FILES SUBSTANTIATING BY CONCERNS AND THE IMMEDIATELY CALLED FOR A TOYOTA CORPORATION FTS WHO REQUESTED MY VEHICLE FOR THEIR REVIEW.  THE SERVICE MANAGER STATED THAT THEY DID INDEED REPLICATE THE FAILURE MODE WITH THE TOYOTA CORPORATION REPRESENTATIVE BUT THE TOYOTA REPRESENTATIVE SAID THE SYSTEM IS WORKING AS DESIGNED!  SO TOYOTA HAS A BSM THAT WILL NOT SENSE A SEMI-TRUCK IN YOUR BLIND SPOT ON THE PASSENGER SIDE BUT WILL ON THE DRIVE SIDE. I PERCEIVE THAT TO BE A PROTECT TOYOTA LIABILITY RESPONSE NOT A SAFETY ISSUE FOCUS.      I HAVE SEVERAL VIDEO FILES DOCUMENTING THE BSM NOT WORKING WHICH I WOULD BE WILLING TO SHARE.  THE FILES ARE MOV FORMAT AND NOT A FORMAT LISTED AS UPLOAD ABLE IN YOUR SYSTEM.      THE BSM MONITOR HAS NOT WORKED APPROPRIATELY SINCE I PURCHASED THE VEHICLE MARCH 8, 2018.  THE DENIAL BY THE TOYOTA FTS WAS WEDNESDAY, JULY, 18, 2018.",
        "vin": "5TDDZRFH1JS"
    },
    {
        "components": "AIR BAGS,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "07/09/2018",
        "dateOfIncident": "07/07/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110346,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY INVOLVED IN AN ACCIDENT WHEN GOING IN REVERSE.  THE SRS ALARM MALFUNCTIONED  AND THE AIRBAGS DID NOT DEPLOY.  THE REVERSE BRAKING SYSTEM DID NOT INDICATED THAT I WAS CLOSE TO THE OBJECT.",
        "vin": "5TDJZRFH5JS"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "07/02/2018",
        "dateOfIncident": "05/12/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11105159,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS RECENTLY IN A VEHICLE ACCIDENT IN MY 2018 TOYOTA HIGHLANDER WITH THE PRE-COLLISION SYSTEM. THE PRE-COLLISION SYSTEM WAS WORKING WELL THROUGH OUT OUR TRIP BUT UNFORTUNATELY DID NOT WORK WHEN IT WAS MOST NEEDED. WE WERE INVOLVED IN A PILE UP ON INTERSTATE I-5 GOING AT LEAST 45MPH AND NOTICED THAT THE PRE-COLLISION SYSTEM THAT IS SO MUCH BEING ADVERTISED DID NOT WORK AT ALL. THERE WAS NO WARNING WHAT SO EVER AND DEFINITELY DID NOT BREAK ON IT'S OWN AS ADVERTISED. AT THE TIME OF THE HIT THE AIRBAGS DEPLOYED A LITTLE TO LATE AT LEAST THE PASSENGER ONE WHERE I WAS SITTING. I AM AWARE THAT WE SHOULD NOT RELY ON THOSE ITEMS BUT I SURE WISH IT WOULD HAVE WORKED THE WAY IT WAS INTENDED TO DO SO.",
        "vin": "5TDBZRFH1JS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/28/2018",
        "dateOfIncident": "06/11/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104476,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 11, 2018 I WAS DRIVING MY 2018 TOYOTA HIGHLANDER (THAT WAS PURCHASED ON JANUARY 31, 2018) ON I-40 NEAR BURLINGTON, NC WHEN THE MOONROOF ON MY CAR SUDDENLY SHATTERED.  I HAD THE VISOR CLOSED ON THE MOONROOF SO NO GLASS ENTERED THE CABIN.  THE ENTIRE MOONROOF SHATTERED AND THERE WAS A HOLE TOWARDS THE REAR OF THE MOONROOF.  IT WAS A CLEAR DAY AND THE PAVEMENT WAS LEVEL.  I DID NOT SEE ANY OBJECTS FROM THE ROAD APPROACH MY CAR PRIOR TO THE MOONROOF SHATTERING.  LATER THAT DAY I TOOK THE VEHICLE TO MY CAR DEALER AND WAS TOLD THAT IT LOOKED LIKE AN IMPACT HAD CAUSED THE MOONROOF TO SHATTER.  I HAD THE MOONROOF REPAIRED BY THE DEALER AT A COST OF $968.  I LEARNED FROM RESEARCH ON THE INTERNET THAT THERE HAVE BEEN NUMEROUS INCIDENTS OF SHATTERING SUNROOFS/MOONROOFS INVOLVING MULTIPLE MANUFACTURERS.  I REPORTED THE SITUATION TO TOYOTA'S NATIONAL CUSTOMER SERVICE CENTER.  I EXPRESSED MY CONCERN ABOUT HOW THE MOONROOF CAN SHATTER ON THE SUNROOF WHEN I DID NOT SEE ANYTHING THAT COULD HAVE CAUSED THAT TYPE OF DAMAGE AND THAT I WAS AWARE THAT TOYOTA AND OTHER MANUFACTURERS HAD EXPERIENCED PROBLEMS WITH SUNROOFS/MOONROOFS.  I PROVIDED PHOTOGRAPHS OF THE MOONROOF.  AFTER INITIAL BEING TOLD THAT MY SITUATION WOULD BE HANDLED AT NO CHARGE TO ME, I WAS DIRECTED TO A CUSTOMER SERVICE REPRESENTATIVE WHO I WAS TOLD WAS SPECIFICALLY ASSIGNED TO ADDRESS THESE TYPES OF CLAIMS.  THAT REPRESENTATIVE ADVISED ME THAT THE MOONROOF SHATTERING WAS CAUSED BY AN \"OUTSIDE INFLUENCE\" AND THAT TOYOTA WAS NOT RESPONSIBLE FOR FIXING THE MOONROOF.  HE FURTHER ADVISED THAT THERE WAS NO \"PROGRAM\" IN EXISTENCE THAT WOULD ALLOW MY VERHICLE TO REPAIRED AT NO CHARGE TO ME.  I ASKED THE REPRESENTATIVE IF TOYOTA'S POSITION WAS THAT THE MOONROOF WAS FUNCTIONING PROPERLY WHEN IT SHATTERED BASED ON SOME UNKNOWN AND UNDEFINED \"OUTSIDE INFLUENCE\" AND I WAS THAT IT WAS NOT THE CASE.",
        "vin": "5TDKZRFH7JS"
    },
    {
        "components": "AIR BAGS,ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/25/2018",
        "dateOfIncident": "01/18/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103870,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA SINNE",
        "vin": "5TDDZRFOJS8"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/17/2018",
        "dateOfIncident": "06/15/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102251,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A ROAD WITH TWO LANES SOUTHBOUND. NO ONE WAS IN FRONT OF ME IN EITHER LANE.  A CAR WAS IN THE PROCESS OF MAKING A RIGHT TURN FROM THE SHOULDER.  IT WAS NOT ON THE HIGHWAY NOR WAS IT HEADED BACK TOWARD THE HIGHWAY.  THE PRE-COLLISION SYSTEM ATTEMPTED TO BRING ME TO A SCREECHING HALT WITHOUT WARNING AND FOR NO APPARENT REASON.  I SUDDENLY WENT FROM 65 MPH TO ABOUT 20 MPH.  FORTUNATELY, THERE WAS NO ONE BEHIND ME.  THEY WOULD HAVE BEEN AS SHOCKED AS I WAS BY THE ACTION OF MY VEHICLE AND PROBABLY WOULD HAVE REAR-ENDED ME.",
        "vin": "5TDKZRFH1JS"
    },
    {
        "components": "STEERING,WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/07/2018",
        "dateOfIncident": "06/02/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11100337,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE CANNOT BE ALIGNED. THIS IS A VERY DANGEROUS DRIVING CONDITION. ESPECIALLY ON WET ROADS. TOYOTA HAS HAD 5 PLUS ATTEMPTS TO CORRECT THIS.VEHICLE WAS DRIVEN BY 2 TOYOTA HEADQUARTERS SPECIALIST. THEY DEEMED THE VEHICLE SAFE TO DRIVE. 48HRS AFTER IT WAS TAKEN TO ANOTHER DEALERSHIP. THIS DEALERSHIP FOUND THE FRONT DRIVER SIDE WHEEL TOE OUT SEVERELY. THEY CORRECTED THE MISALIGNMENT. AT LEAST ON PAPER THATS THE WAY IT LOOKED UNTIL ON MY WAY HOME FROM THE DEALERSHIP THIS VEHICLE PULLED ME INTO ON COMING TRAFFIC.",
        "vin": "5TDBZRFH1JS"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/22/2018",
        "dateOfIncident": "05/22/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097295,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA HIGHLANDER. WHILE DRIVING 55 MPH, ANOTHER VEHICLE PULLED IN FRONT OF THE CONTACT'S VEHICLE IN INCLEMENT WEATHER AND SPLASHED WATER ONTO THE FRONT END OF THE VEHICLE. AS A RESULT, THE CRUISE CONTROL MALFUNCTIONED AND THE CONTACT'S VEHICLE EXPERIENCED UNINTENDED ACCELERATION. THE FAILURE OCCURRED WITHOUT WARNING. THE DEALER (PERUZZI TOYOTA, 2601 BETHLEHEM PIKE, HARTFIELD, PA) WAS CALLED AND A DIAGNOSTIC APPOINTMENT WAS SCHEDULED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 12,000.",
        "vin": "5TDJZRFH0JS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/09/2018",
        "dateOfIncident": "05/09/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092758,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A 2018 TOYOTA HIGHLANDER FROM A DEALERSHIP BRAND NEW APPROXIMATELY ONE MONTH AGO.  THE CAR HAS LESS THAN 1500 MILES ON IT.  I WAS DRIVING ON THE FREEWAY AND MY REAR PASSENGER TIRE BLEW OUT.  THERE IS A HOLE IN THE TIRE. THERE IS NO OBJECT IN THE TIRE AND I DIDN'T SEE ANYTHING THAT I RAN OVER. THERE IS NO DAMAGE TO THE BODY OR THE TIRE WELL.",
        "vin": "5TDJZRFH5JS"
    },
    {
        "components": "SUSPENSION,WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/01/2018",
        "dateOfIncident": "05/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091212,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK MY 2018 HIGHLANDER TO HAVE THE 5000 MILE SERVICE DONE. UPON ENTERING THE SERVICE DEPARTMENT I SPOKE WITH ONE OF THE CERTIFIED TECHNICIANS. I TOLD HIM MY VEHICLES IS PULLING TO THE LEFT. THEY THEN DID A ALIGNMENT AND TIRE ROTATION. AFTER LEAVING MIKE WOOD TOYOTA OF UNIONTOWN I NOTICED THAT MY VEHICLE WAS NOW PULLING TO THE RIGHT. WHEN I GOT HOME I EXAMINED THE TIRES CLOSELY ONLY TO NOTICE THE TIRES WERE CUPPED AND STARTING TO FEATHER OUT ON THE INNER AND OUTTER EDGES. I THEN SCHEDULED ANOTHER APPOINTMENT TWO DAYS LATER SHOWING THE DEALERSHIP SERVICE DEPARTMENT MY FINDINGS. THE SERVICE TECH GOT IN AND TOOK A RIDE WITH ME. HE ALSO DROVE MY 18 HIGHLANDER. HE OBSERVED MY VEHICLE PULLING AND THE CUPLING AND FEATHERING OF MY TIRES. HE STATED THAT THE TIRES SHOULD NOT HAVE DONE THAT IN 5000 MILES. I AM WAITING NOW TO SEE IF TOYOTA IS GOING TO REPLACE MY TIRES. OR IF THE TIRES ARE DEFECTIVE",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/22/2018",
        "dateOfIncident": "02/23/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080839,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "PCS (PRE COLLISION SYSTEM) AND PEDESTRIAN DETECTION SYSTEM DO NOT FUNCTION AS ADVERTISED BY THE MANUFACTURE AND ASSURED BY THE DEALER. THERE IS NO INDICATION OR ANY EVIDENCE THAT SUCH A SYSTEM EXISTS IN THE CAR. THEREFORE, IT GIVES YOU A FALSE SENSE OF SECURITY.",
        "vin": "5TDJZRFH7JS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/27/2018",
        "dateOfIncident": "01/26/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065366,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING ON HIGHWAY 78 BY STONE MOUNTAIN AND HEARD A LOUD BANG. THE CAR BEHIND ME SIGNALED TO ME TO STOP. HE SAID SOMETHING FLEW OFF MY CAR AND HIT HIS WINDSHIELD. I COULD NOT IMMEDIATELY FIGURE OUT WHAT HAD HAPPENED. I DECIDED TO LOOK AT THE SUNROOF AND DISCOVERED THAT IT HAD SHATTERED. THIS HAPPENED ABOUT 11:30 PM THE SAME DAY I BOUGHT THE CAR.",
        "vin": "5TDKZRFH5JS"
    }
]