[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/16/2022",
        "dateOfIncident": "03/15/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456959,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Toyota Tacoma. The contact stated that after her husband parked the vehicle at a private property and shifted into gear and releasing the clutch, the rear passenger’s side tire locked up. The driver stated no warning light was illuminated. The driver and his son manually replaced the 8 springs, 8 retainers, and 8 pins on the rear brakes. The vehicle was not diagnosed. A dealer was not contacted. The manufacturer had not been informed of the failure. The failure mileage was approximately 102,500.",
        "vin": "5TFCZ5AN9JX"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/28/2022",
        "dateOfIncident": "02/28/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454500,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving on 3 lane interstate, with the adaptive cruise control on, while passing a semi truck the front collision brake system activated. I was doing 72 miles an hour when it happened. The result was almost got rear-ended by another vehicle when my truck applied the brakes unexpectedly. The semi did not cross into my lane. My lane was clear. 0",
        "vin": "3TMCZ5AN6JM"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/04/2022",
        "dateOfIncident": "01/22/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450428,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The paint is peeling off the top sections of both of my trucks rear doors. The paint appears to be peeling away down to either the primer or possibly the bare metal. This trucks paint code is 040 super white.",
        "vin": "3TMDZ5BNXJM"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/05/2022",
        "dateOfIncident": "01/02/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446346,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "My 2018 tacoma has recently started leaking from the ceiling of the cab in the back seat. It is dripping water from melted snow onto the seat, causing a continuously damp seat.",
        "vin": "3tmcz5an4jm"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/17/2021",
        "dateOfIncident": "11/19/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444211,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving down the road and was passing a truck. CEL and TRAC OFF lights came on and truck went into limp mode. Could not accelerate and truck was slowing down. Had to pull over turn truck off and restart and it ran fine until I duplicated the passing and push on the accelerator. Had codes check and was showing misfires on cylinder 3. I changed the spark plugs and checked the coils which were good. Next day was I was driving and truck had the same problems and eventually died and would not restart. I took it to the toyota dealer and they checked numerous things and had found #1 cylinder intake value was leaking. They suggested to replace the entire motor at a cost of $12,000. I declined and took it to another mechanic to see if the head just needed replacing. In that time I found others were having the same problem and it was a malfunctioning part in the intake manifold. https://www.tacomaworld.com/threads/2016-tacoma-in-limp-mode-fixed.659782/ This is the forum were I found the problem and it fixed it. A piece of it was holding my intake valve open and that was the cause of it not starting and the leaking valve. I went and showed the Toyota dealer and they were not aware of that problem. I would like it to get posted so others don't get con into putting a new motor if it has the same problem. It seems everyone that has this issue is around 17 and 18 year models and all ranges of mileage.",
        "vin": "5tfsz5an6jx"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/29/2021",
        "dateOfIncident": "11/03/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442000,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Started noticing vibration on smooth roads a few weeks ago, as if tires were misaligned. Independent service center was able to reproduce the problem and found both rear shocks were cracked, with fluid leaking. Vehicle has not been inspected by anyone else, has not been repaired yet (but parts are being ordered), and is available for inspection. No warning lamps or messages appeared. This vehicle has not been driven off-road, only on smooth roads and highways.",
        "vin": "5TFAZ5CN2JX"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/21/2021",
        "dateOfIncident": "10/13/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437594,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I got in a car accident another car hit me T-bone right between the driver a d passenger door sideairbags weren’t deployed at all the incident cause me to jump into de sidewalk run over a sign and neither of the frontbags were deployed either the hit cause me to hit my head to the side window reason I got a concussion and been having headeaches since the day of the accident October 13th 2021 the car that hit me run a red light and must have been over 25 miles per hour cause the other car end it up been flipped over",
        "vin": "3TMCZ5AN8JM"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/06/2021",
        "dateOfIncident": "10/06/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435653,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Rear driver seatbelt retracts but won’t reel back up. After replacing it, shop recognized the ineffective nature of the other side.  Safety of my children at risk.  Inspected by independent shop and dealer.  No warning lights.  Symptoms include less effective",
        "vin": "5tfcz5an1jx"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/19/2021",
        "dateOfIncident": "09/16/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433518,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "When pressing the brake it takes about 1/4 th of pressing the brake down before the brakes engage.",
        "vin": "3TMCZ5AN6JM"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/14/2021",
        "dateOfIncident": "01/13/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432862,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Toyota Tacoma. The contact received notification of NHTSA campaign number: 20V012000 (Fuel system, gasoline) however, the part to do the recall repair was unavailable. The contact called the local dealer who confirmed that the part was not yet available. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not made aware of the issue. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "3TMCZ5AN4JM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/31/2021",
        "dateOfIncident": "04/16/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431209,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2018 Toyota Tacoma. The contact stated that while driving over 40 MPH, the brake pedal was depressed, and the vehicle failed to stop in a timely manner. The contact stated that there was no collision. The vehicle was taken to the dealer where the front driver’s and passenger’s side brake linings, brake pads, and rotors were replaced. The manufacturer was not notified of the failure. The failure mileage was approximately 20,000.",
        "vin": "5TFCZ5AN31X"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/13/2021",
        "dateOfIncident": "07/11/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428940,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Two wires under the glove compartment start to smoke than I turn off the truck. Notice the wires burned.  The ac no longer works",
        "vin": "3TMAZ5CNXJM"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "08/10/2021",
        "dateOfIncident": "07/31/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428603,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 Toyota Tacoma problem. I purchased the truck in October of 2018.  On July 31, 2021 @ 3:50 pm While driving home I was in cruise control @ 82 mph when the display showed malfunction. The truck went from 82 mph to 60 within seconds again. A car behind me was able to change lanes to avoid an accident. The trucks display readings were Malfunction of headlight, radar cruise control unavailable & Lane departure alert malfunction and visit the dealer. After getting home I shut the truck off and restarted it. The malfunctions had cleared again. I made an appointment with the dealership for August 5, 2021.They worked with Toyota representatives to trying to solve the problem but couldn’t identify it. The conclusion was when it happens again bring it to the dealership (if possible) before shutting it off so they can do a diagnostic test while the truck is still running and showing the malfunction display.  Luckily, when  it occurred I was on a road with every little traffic.  My problem now is that I don’t trust driving it using cruise control in normal traffic or at night not knowing if the headlights will shut off or the cruise control will shut down.   This is the second time this has occur. The first time was in Aug 2019. I took to the dealer but they couldn’t identify the problem. My thought at the time was it may have been a one time event but it was not.  I have pictures of the truck’s displaying the malfunctions on both events.",
        "vin": "5tfcz5an4jx"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/02/2021",
        "dateOfIncident": "01/15/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406135,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA TACOMA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CALLED GERMAIN TOYOTA OF COLUMBUS (5711 SCARBOROUGH BLVD, COLUMBUS, OH 43232, (614)666-6586) AND IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "3TMCZ5AN2JM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/30/2021",
        "dateOfIncident": "02/16/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405527,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 TACOMA AUTOMATIC TRANSMISSION SHUDDERS, HESITATES AND MISSES AT SPEEDS BETWEEN 35-60 MPH. THIS HAPPENS CONSTANTLY. SLIGHT PEDAL AND LOW RPM'S IN 5TH AND 6TH GEAR IS WHEN IT'S MOST NOTICEABLE. ON OCCASION, THERE IS A MORE SERIOUS MISS, WHICH FEELS AS IF YOU HAVE TURNED THE IGNITION OFF AT 50MPH AND THEN RIGHT BACK ON.  THIS DOES NOT HAPPEN FREQUENTLY, 4 OR 5 TIMES IN THE 20,000 MILES I'VE DRIVEN IT.    THE SHUDDER HAS BEEN LOOKED AT BY TOYOTA ON 3 OCCASIONS, AND HAS BEE SHRUGGED OFF AS A \"TYPICAL CHARACTERISTIC OF THE VEHICLE\".  TOYOTA NORTH AMERICA MADE AN APPOINTMENT FOR ME TO SEE THE SERVICE MANAGER WHO RODE WITH ME AND FELT THE SHUDDER AND MISSING.  HE HAD ME TEST DRIVE A 2019 V6 AUTOMATIC OFF ROAD AND IT ALSO HAD THE SHUDDER AND MISSING IN THE SAME RANGE.    THE FINAL OUTCOME WAS THAT IT IS A CHARACTERISTIC OF THE VEHICLE AND THERE IS NOTHING THAT CAN BE DONE.  THE FUEL PUMP RECALL WAS DONE.  THE POWER TRAIN WAS RE-FLASHED.  NO CHANGE IN THE CONDITION.  IT IS VERY UNNERVING AND DISAPPOINTING THAT THEY CONSIDER THIS CONDITION ACCEPTABLE.",
        "vin": "5TFCZ5AN8JX"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/11/2021",
        "dateOfIncident": "03/11/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400290,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA DEALER KNOWINGLY SOLD ME A 2018 40K MILES TACOMA WITH AN OPEN RECALL REGARDING FAILING LOW PRESSURE FUEL PUMP THAT CAN STALL AT HIGH SPEED. THIS WAS NOT DISCLOSED AT TIME OF PURCHASE. WE LIVE A GREAT DISTANCE FROM DEALER ON A REMOTE ISLAND MAKING RETURNING TO DEALER A CONSIDERABLE HARDSHIP. DEALER KEEPS SAYING 'PART IS COMING IN A COUPLE DAYS' WOULD LIKE TO CLEAR THIS UP ASAP .",
        "vin": "5TFAZ5CN2JX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/17/2021",
        "dateOfIncident": "02/12/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396609,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA TACOMA. THE CONTACT STATED THAT WHILE DEPRESSING THE ACCELERATOR PEDAL, THE VEHICLE STARTED SHAKING. THE CONTACT STATED OCCASIONALLY THE VEHICLE FAILED TO START. THERE WAS NO WARNING LIGHT ILLUMINATED. THE CONTACT THEN RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V682000 (FUEL SYSTEM, GASOLINE) AND THE VEHICLE WAS TAKEN TO CHUCK PATTERSON TOYOTA (200 EAST AVE, CHICO, CA 95926) WHERE THE FUEL PUMP WAS REPLACED HOWEVER, THE REPAIR FAILED TO CORRECT THE FAILURE. THE CONTACT CALLED ANOTHER DEALER HANLEES DAVIS TOYOTA (4202 CHILES RD, DAVIS, CA 95616) AND INFORMED THEM OF THE FAILURE. THE CONTACT WAS INFORMED THAT DUE TO THE PANDEMIC THERE WAS NO TECHNICIAN AVAILABLE TO TEST DRIVE THE VEHICLE FOR A DIAGNOSTIC TESTING. THE VEHICLE WAS NOT TAKEN TO A DEALER. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 31,000.",
        "vin": "3TMAZ5CN0JM"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "01/28/2021",
        "dateOfIncident": "01/22/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390591,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INVOKED IN A FRONT END COLLISION MY BRAKES DIDN'T STOP FAST ENOUGH MY PEDAL WENT DOWN TO THE BOTTOM FLOOR AND MY TPS RADAR COLLISION WARNING DIDN'T ACTIVATE WHAT CAN I DO ?",
        "vin": "3TMCZ5AN4JM"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/19/2021",
        "dateOfIncident": "01/18/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388819,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING VEHICLE ON  A SIDE STREET GOING APPROX 20 MILES PER HOUR . CAR STARTED SHAKING AND LOST MAJORITY OF POWER. WAS ABLE TO GET CAR BACK TO RESIDENCE  (ONLY  GOT  A COUPLE OF BLOCKS AWAY) WHEN HEADING TO DESTINATION. HAD VEHICLE TOWED NEXT DAY TO SAME  DEALERSHIP WHO HAD RECENTLY REPLACED FUEL PUMP UNDER A RECALL   (PAPERWORK FOR THIS RECALL IS WHAT WAS EXPERIENCED /STALLING  DANGERS) . DEALERSHIP TOLD US NOT FUEL PUMP BUT WIRING HARNESS NEEDED REPLACEMENT BECAUSE  RODENTS ATE THE WIRING  ( SOY BEAN COVERING ON NEWER VEHICLES )AND ENGINE LOST POWER BECAUSE OF THIS . THANK GOODNESS NOT ON A HIGHWAY GOING 75 MPH. WHEN THIS HAPPENED AS WE VERY WELL COULD OF BEEN . TOLD WE NEED TO DETER THESE RODENTS FROM CONTINUING ANY MORE DAMAGE . WONDER WHY COMPANY WOULD USE A PRODUCT . THANK YOU.",
        "vin": "5TFCZ5AN3JX"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/07/2020",
        "dateOfIncident": "11/19/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378335,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2018 TOYOTA TACOMA PICK UP TRUCK WHILE DRIVING ESPECIALLY ON THE HIGHWAY HAS A SKIP OR HESITATION THAT RANDOMLY HAPPENS IT'S LIKE A MISFIRE IN THE ENGINE IT'S MUCH MORE NOTICEABLE WHEN I HAUL MY CAMPING TRAILER UP HILLS TOOK IT TO THE DEALER A NUMBER OF TIMES IN THE LAST TIME THE SENIOR TECH TOOK IT FOR A DRIVE  AND ACKNOWLEDGED THAT THERE WAS AN ISSUE AS L HAD EXPLAINED THE REPORT SAYS HE CALLED TOYOTA AND THAT IS A DEFECT ON THE 2018 V6 TOYOTA TACOMA'S IS A VERY DANGEROUS IT FEELS LIKE IT'S GOING TO STALL AT TIMES ESPECIALLY IF YOU'RE HAULING A TRAILER THAT'S OVER 5000 POUNDS UPHILL",
        "vin": "5TFSZ5AN7JX"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/17/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364862,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS WAS A RECALL DATED JANUARY 13, 2020.  I FEEL DUE TO THE NATURE OF THIS RECALL THAT A REMEDY SHOULD HAVE HAPPENED BY NOW. BUT RECALL INCOMPLETE AS OF 10/17/2020.    SUMMARY:  THE SUBJECT VEHICLES ARE EQUIPPED WITH A LOW-PRESSURE FUEL PUMP WHICH MAY STOP OPERATING. IF THIS WERE TO OCCUR, WARNING LIGHTS AND MESSAGES MAY BE DISPLAYED ON THE INSTRUMENT PANEL, AND THE ENGINE MAY RUN ROUGH. THIS MAY RESULT IN A VEHICLE STALL, AND THE VEHICLE MAY BE UNABLE TO BE RESTARTED.    SAFETY RISK:  IF A VEHICLE STALL OCCURS WHILE DRIVING AT HIGHER SPEEDS, THIS COULD INCREASE THE RISK OF A CRASH.",
        "vin": "5TFAZ5CN2JX"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/16/2020",
        "dateOfIncident": "01/08/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364634,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL IS ISSUED IN JANUARY 2020, HOWEVER TOYOTA IS NOT MAKING THE REPLACEMENT PARTS AVAILABLE TO THE PUBLIC TO REPAIR VEHICLE  TOYOTA RECALL NOTICE # 20TA02",
        "vin": "5TFRX5GN8JX"
    },
    {
        "components": "SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/11/2020",
        "dateOfIncident": "03/12/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363749,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL ISSUES HAVE BEEN REPORTED VIA PHONE CALLS AND EMAILS TO DEALERSHIP SINCE MARCH-2020 BUT HAVE YET TO RECEIVE ANY ASSISTANCE ON MATTERS FOR TWO RECALLS, ONE IN DEC2018 FOR THE BRAKE MASTER CYLINDER AND ANOTHER IN JAN2020 FOR THE LOW PRESSURE FUEL PUMP.  BRAKES ARE ALWAYS MAKING A LOUD NOISE ESPECIALLY ON REVERSE.",
        "vin": "5TFAZ5CN3JX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/02/2020",
        "dateOfIncident": "03/11/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362336,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA TACOMA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE VEHICLE WAS TAKEN TO GATEWAY TOYOTA (395 ROUTE 37 EAST, TOMS RIVER, NJ 08753) AND WAS REJECTED TO BE SERVICED DUE TO THE PART NOT BEING AVAILABLE FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND PROVIDED A CASE NUMBER. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "3TMCZ5AN6JM"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/30/2020",
        "dateOfIncident": "09/30/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361988,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA TACOMA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. AN UNKNOWN DEALER WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT YET AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TFAZ5CNXJX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/28/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361605,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA TACOMA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. LONGO TOYOTA (3534 N. PECK RD., EL MONTE, CA 91731) WAS CONTACTED AND CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TFCZ5AN0JX"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/27/2020",
        "dateOfIncident": "02/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361415,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT THE RECALL BACK IN FEBRUARY FOR THE FUEL PUMP AND I'M STILL WAITING FOR THEN TO FIX IT.",
        "vin": "5TFCZ5AN8JX"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/24/2020",
        "dateOfIncident": "03/10/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360873,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE MANUFACTURER HAS EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REMEDY (SEE BELOW).  MY TRUCK HAS BEEN SITTING IN MY DRIVEWAY (PER THE INSTRUCTION OF AUTONATION FORT MYERS) SINCE MARCH 10, 2020.  I WAS PROVIDED A RENTAL THROUGH AUTONATION IN FORT MYERS, FL (AT THEIR EXPENSE) UNTIL THE REMEDY WAS AVAILABLE TO CONSUMERS.  I WAS ADVISED THAT THE REMEDY WOULD BE AVAILABLE AT THE END OF MARCH, BEGINNING OF APRIL.  THEN I WAS ADVISED THAT IT WOULDN'T BE UNTIL THE END OF SEPTEMBER, MIDDLE OF OCTOBER.  MEANWHILE, MY TRUCK IS SITTING IN MY DRIVEWAY ACCUMULATING ADDITIONAL ISSUES BECAUSE I WAS INSTRUCTED NOT TO DRIVE IT.  I WAS ALSO ADVISED THAT MULTIPLE VEHICLE TYPES HAVE ALREADY BEEN REMEDIED AND THAT TACOMA'S HAVE NOT.     JAN 13,2020  MANUFACTURER RECALL NUMBER: 20TB02  NHTSA RECALL NUMBER: 20V012  RECALL STATUS: RECALL INCOMPLETE, REMEDY NOT YET AVAILABLE  SUMMARY  THE SUBJECT VEHICLES ARE EQUIPPED WITH A LOW-PRESSURE FUEL PUMP WHICH MAY STOP OPERATING. IF THIS WERE TO OCCUR, WARNING LIGHTS AND MESSAGES MAY BE DISPLAYED ON THE INSTRUMENT PANEL, AND THE ENGINE MAY RUN ROUGH. THIS MAY RESULT IN A VEHICLE STALL, AND THE VEHICLE MAY BE UNABLE TO BE RESTARTED.",
        "vin": "3TMCZ5AN9JM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/21/2020",
        "dateOfIncident": "01/21/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360214,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICE RECEIVED IN JANUARY OF 2020 THAT MY 2018 TOYOTA TACOMA PICKUP TRUCK HAS A DEFECTIVE FUEL PUMP THAT IS LOCATED IN THE FUEL TANK (NHTSA SAFETY RECALL NO. 20V-012).  IT IS NOW SEPTEMBER 21ST, 2020 AND STILL NO FIX FOR THIS PROBLEM.  THIS IS UNACCEPTABLE.  WHY HAS THIS PROBLEM NOT BEEN RESOLVED?",
        "vin": "5TFRZ5CN0JX"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/17/2020",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355499,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ROUGH START WHEN ENGINE IS COLD OR WARM",
        "vin": "5TFCZ5AN7JX"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/17/2020",
        "dateOfIncident": "02/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355536,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A RECALL NOTIFICATION FROM TOYOTA ABOUT A PROBLEM WITH THE LOW FLOW FUEL PUMP IN FEBRUARY OF 2020 AND THERE STILL ISN'T A REMEDY. THIS NEEDS TO BE ADDRESSED. WHEN IT WAS RECALLED BECAUSE IT HAS A CHANCE TO STALL OUT WHILE DRIVING AT HIGHER SPEEDS. AND PEOPLE LIKE MYSELF DON'T HAVE ANOTHER VEHICLE TO DRIVE WHILE TOYOTA TAKES THERE TIME IN DEVELOPING A REMEDY. IT SEEMS LIKE TO ME ITS TAKING TO LONG TO GET THE REMEDY. ITS BEEN OVER 6 MONTHS. HOW IS THIS POSSIBLE.",
        "vin": "3TMCZ5AN4JM"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/17/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355543,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA TACOMA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. NEITHER THE DEALER NOR THE MANUFACTURER WERE MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3TMCZ5AN4JM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/17/2020",
        "dateOfIncident": "01/02/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355625,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "GOT A RECALL FORM TOYOTA BACK IN JANUARY ON A FUEL PUMP ISSUE  AND HERE IT IS IN SEPT AND STILL HAVE NOT BEEN NOTIFIED THAT THERE IS A FIX",
        "vin": "3TMAZ5CN1JM"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/16/2020",
        "dateOfIncident": "09/11/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355358,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DESIGN DEFECT RESULTING IN INABILITY TO OPEN HOOD. BATTERY FAILED (SUBSEQUENTLY REPLACED BY DEALER UNDER WARRANTY) BUT COULD NOT OPEN HOOD TO JUMP START. TOW OPERATOR COULD NOT OPEN HOOD EITHER, SO VEHICLE HAD TO BE TOWED TO DEALERSHIP. PER DEALER EMPLOYEE, DESIGN DEFECT RESULTS IN HOOD BUMPERS EASILY GOING OUT OF ADJUSTMENT, PREVENTING ABILITY TO OPEN HOOD. THIS IS AN EXTREME SAFETY ISSUE, SINCE IN A VEHICULAR ACCIDENT WHEN FUEL IS OR MAY BE LEAKING, THE BATTERY MUST BE DISCONNECTED  TO PREVENT A FIRE, ESPECIALLY WHEN OCCUPANTS ARE STUCK IN WRECKAGE PENDING EMS ARRIVAL. I HAVE HAD THIS HAPPEN TO ME, LIKELY SAVING LIVES AND CERTAINLY PREVENTING CATASTROPHIC BURNS. THE BUMPER IS CLEARLY DESIGNED THIS WAY AS A COST-SAVINGS MEASURE, SO THAT THE BUMPER CAN BE USED FOR VARIOUS MODELS AND MAKES. THE BUMPER'S DESIGN HAS ALMOST UNLIMITED ADJUSTMENT, AND EASILY COMES OUT OF ADJUSTMENT. THIS DEFECT CAN BE EASILY CORRECTED BY SECURING THESE BUMPERS WITH AN ADHESIVE OR OTHER MEANS.",
        "vin": "5TFAZ5CNXJX"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/14/2020",
        "dateOfIncident": "01/02/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354939,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "A PROBLEM WITH THE FUEL PUMP ON MY 2018 TOYOTA TACOMA WAS IDENTIFIED IN EARLY 2020. IT IS NOW SEPTEMBER 2020 AND I HAVE YET TO RECEIVE NOTICE THAT MY VEHICLE CAN BE SCHEDULED FOR REPAIR OR REPLACEMENT. IN THE MEANTIME I CONTINUE TO DRIVE A VEHICLE THAT HAS THE POTENTIAL FOR STALL OR POSSIBLE CRASH IF THE ENGINE QUITS.",
        "vin": "3TMCZ5AN0JM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/10/2020",
        "dateOfIncident": "05/05/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354312,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SAFETY ISSUE WITH FUEL PUMP. STALLS WHILE IM DRIVING. WAS NOTIFIED ABOUT IT A COUPLE MONTHS AGO BUT HAVENT HEARD ANYTHING ELSE.",
        "vin": "5TFSZ5AN8JX"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/06/2020",
        "dateOfIncident": "09/04/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353438,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WAS PUT IN REVERSE IN ORDER TO GET OUT OF A PARKING SPACE. AS I TURNED THE WHEEL AS IT WAS IN REVERSE THE CAR BEGAN TO ACT WEIRD AND THE BRAKES DID NOT SEEM TO WORK. I PUMPED THE BRAKES 3 TIMES, BUT IT WAS TOO LATE AND THE CAR PARKED BEHIND ME WAS HIT. I WAS GOING SLOW WHEN I REVERSED, HOWEVER MY WHOLE BUMPER SNAPPED OFF AND MY TAILLIGHT SHATTERED. THE TRUCK SEEMED TO HAVE ACCELERATED WITHOUT THE GAS PEDAL BEING USED....THE BRAKES SEEMED TO WORK JUST FINE AFTER, HOWEVER DEALERSHIP TOLD ME THERE WEREN'T ANY CODES INDICATING A LOSS OF BRAKES. THERE WAS NO FLUID OR LEAKAGE ON THE COMPARTMENT EITHER. EVERYTHING WAS FINE I WAS TOLD, BUT IT DOESN'T SEEM TO ADD UP FOR ME. THIS TRUCK WAS SECOND-HAND FROM THE DEALERSHIP, SO I AM NOT SURE IF IT WAS PART OF THE TRUCKS THAT HAD A RECALL ON BRAKES. THE CURRENT RECALL ON IT HAD TO DO WITH THE PUMP WHICH THERE IS NO REMEDY FOR.",
        "vin": "5TFAX5GN9JX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/03/2020",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352995,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA TACOMA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE MANUFACTURER CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. A DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. *BF *AS",
        "vin": "5TFAX5GN2JX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/02/2020",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352759,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA TACOMA. THE CONTACT STATED WHILE DRIVING 35 MPH, WHILE DEPRESSING THE ACCELERATOR PEDAL THE VEHICLE HESITATED. THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE CONTACT CONTINUED DRIVING TO HIS DESTINATION. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE CONTACT CALLED BRUNSWICK AUTO MART (3031 CENTER RD, BRUNSWICK, OH 44212; (330) 273-3300) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER HAD NOT BEEN MADE AWARE OF THE ISSUE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. THE FAILURE MILEAGE WAS 6,500.",
        "vin": "5TFRX5GN7JX"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/01/2020",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352533,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2018 TOYOTA TACOMA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (AIR BAGS) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CALLED NEW COUNTRY TOYOTA OF SARATOGA SPRINGS (3002 NY-50, SARATOGA SPRINGS, NY 12866; (518) 584-7272) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER HAD NOT BEEN MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3TMDZ5BN6JM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/31/2020",
        "dateOfIncident": "01/11/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352233,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL 20TB02 ISSUED IN JANUARY 2020. WHEN WILL THERE BE A REMEDY? NHTSA RECAL # 20V012.",
        "vin": "5TFSZ5AN8JX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/24/2020",
        "dateOfIncident": "08/24/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350971,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA TACOMA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. AN UNKNOWN DEALER WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT YET AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3TMGZ5AN0JM"
    },
    {
        "components": "STEERING,EXTERIOR LIGHTING,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/18/2020",
        "dateOfIncident": "08/18/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350164,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AS WE WERE TRAVELING ON 441 SOUTH TO ATHENS GEORGIA TO DOCTOR MY 2018 TOYOTA TOCOMA WITH VIN# ON FILE LOST POWER AT THE SPEED OF 65 MPH AND IF I HAD NOT BEEN A FORMER SHERIFF DEPUTY AND A SPECIAL INVESTIGATOR AND HAD NOT BEEN TRAIN IN HOW TO HANDEL A VEHICLE IN STRESS IT WOULD HAVE BEEN TRAGICALLY DEVASTATED FOR MY WIFE AND MYSELF THIS REMEDY THAT'S UNDER RECALL NEEDS TO BE TAKEN CARE OF ASAP OR OWNERS SHOULD BE REIMBURSED OR GIVING ANOTHER VEHICLE BEFORE THERE IS A DEATH REPORTED!!! MY CONTACT 407 577 5262 OR BOBBYFORBES1959@GMAIL.COM",
        "vin": "5TFCZ5AN1JX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/11/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348685,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA TACOMA. THE CONTACT RECEIVED NOTIFICATION OF A NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER PRECISION TOYOTA OF TUCSON (700 W WETMORE RD, TUCSON, AZ 85705) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.*DT*JB",
        "vin": "3TMAZ5CN5JM"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/10/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348419,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA TACOMA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE.  THE CONTACT CALLED FRONTIER TOYOTA (23621 CREEKSIDE RD, VALENCIA, CA 91355; (661) 255-7575) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3TMAZ5CNXJM"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/10/2020",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348461,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE MAY STALL WHILE DRIVING. IS THE RECALL FOR THE FUEL PUMP. THAT NEEDS REPLACING. I GET WARNING LIGHTS. THE CHECK ENGINE LIGHT  GOES ON. I ALSO GET A LOW FUEL PRESSURE LIGHT THAT ALSO GOES ON. I'VE GOTTEN THE RECALL NOTICE A YEAR  AGO. AND EVERY TIME I GO TO TOYOTA FOR AN OIL CHANGE THEY SAY THAT THERE'S NO FIX YET FOR THE PROBLEM. ITS BEEN A YEAR ALREADY. WHAT ARE THEY WAITING FOR . FOR ME TO STALL WHILE AM DRIVING AND KILL SOMEONE OR ME. UNACCEPTABLE , AM SICK AND TIRED OF TALKING TO THE DEALER. THEY SEEM TO HAVE NO ATTENTION OF FIXING THIS DANGEROUS RECALL",
        "vin": "5TFAX5GN9JX"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/29/2020",
        "dateOfIncident": "05/12/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342029,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEVERAL OCCASIONS MY CAR HAS LOST POWER AND STARTED IDLING VERY LOW IN TRAFFIC. THERE HAS BEEN AN OPEN RECALL FOR SEVERAL MONTHS FOR THIS PROBLEM AND TOYOTA HAS NOT FIXED IT.",
        "vin": "5TFDZ5BN2JX"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/29/2020",
        "dateOfIncident": "05/04/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342117,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUCK HESITATES AT LOWER RPMS AND FEELS VERY SLUGGISH. SOMETHING NEEDS TO BE DONE ABOUT THIS! SEVEN MONTHS IS TO LONG!",
        "vin": "3TMAZ5CN7JM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/25/2020",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341453,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "IN AUGUST 2018, I  PURCHASED NEW,  A 2018 TOYOTA TACOMA SR5, 4 DOOR, 2 WHEEL DRIVE, AUTOMATIC TRANSMISSION.  THE TRANSMISSION JERKS/DELAYS/STAGGERS AT SPEEDS OF MID-30'S, MID-40'S, AND AROUND 65 MPH.  THIS STARTED AROUND 8000 MILES.  OCCURS WITH OR WITHOUT CRUISE CONTROL ON.  IT HAS BEEN TO THE DEALER FOR 8 ASSESSMENTS OR REPAIRS FOR THIS ISSUE.  RECENTLY, THE TRANSMISSION DID NOT CHANGE GEARS UNTIL 4000 RPMS WHILE I WAS PULLING A SMALL UTILITY TRAILER.  WE HAD TO TRAVEL AT LESS THAN SAFE HIGHWAY SPEEDS UNTIL PULLING OVER.  THIS ALMOST RESULTED IN AN ACCIDENT.  THE PROBLEM IS CONSTANT AND REPRODUCIBLE.  THE SERVICE MANAGER AT THE LOCAL DEALERSHIP CLAIMS THIS HAPPENS IN SOME, BUT NOT ALL 2018 TACOMAS.  THIS IS A SAFETY ISSUE.",
        "vin": "3TMAZ5CN8JM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/23/2020",
        "dateOfIncident": "01/07/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341094,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A FUEL PUMP RECALL, THE FUEL PUMP DOESN'T WORK PROPERLY AND MAY RESULT IN A CRASH. TOYOTA HAS FAILED TO FIX ISSUE IN A REASONABLE AMOUNT OF TIME. IT HAS BEEN MORE THAN 7 MONTHS.",
        "vin": "5TFCZ5AN0JX"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/21/2020",
        "dateOfIncident": "05/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340647,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "IN JANUARY 2020 NOTIFIED CUSTOMERS OF CERTAIN VEHICLES THAT MAY HAVE LOW-PRESSURE FUEL PUMP ISSUES. IN MAY 2020 I WAS NOTICED MY MAIL THAT MY 2018 TACOMA TRUCK WAS ONE OF THE VEHICLES AFFECTED BY THE SAFETY RECALL FOR A LOW-PRESSURE FUEL PUMP PROBLEM AND THAT A REMEDY WOULD COME SOON. TOYOTA STATES THAT THEY ARE NOT ABLE TO FIX THE PROBLEM UNTIL APPROXIMATELY SEPTEMBER 2020. THIS IS TOTALLY UNACCEPTABLE, ESPECIALLY SINCE THEY CONTINUE TO MANUFACTURE VEHICLES WITH FUEL PUMPS. ARE THOSE FUEL PUMPS HAVING NO ISSUES? IF SO, THEN HOW ABOUT REPLACING FUELS PUMPS OF EXISTING CUSTOMER VEHICLES.",
        "vin": "3TMCZ5AN4JM"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/17/2020",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339951,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA TACOMA. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE STALLED WITHOUT WARNING. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. STEPHEN WADE TOYOTA (150 HILTON DR, ST. GEORGE, UT 84770) WAS CONTACTED AND CONFIRMED THAT THE PART WAS NOT AVAILABLE FOR THE RECALL REPAIR. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 7,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3TMDZ5BN5JM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/16/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339709,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AS OF JANUARY 13TH, 2020 TOYOTA ISSUED THE FOLLOWING RECALL INFORMATION ABOUT MY 2018 TOYOTA TACOMA (MANUFACTURER RECALL NUMBER20TB02/NHTSA RECALL NUMBER20V012):   \"THE SUBJECT VEHICLES ARE EQUIPPED WITH A LOW-PRESSURE FUEL PUMP WHICH MAY STOP OPERATING. IF THIS WERE TO OCCUR, WARNING LIGHTS AND MESSAGES MAY BE DISPLAYED ON THE INSTRUMENT PANEL, AND THE ENGINE MAY RUN ROUGH. THIS MAY RESULT IN A VEHICLE STALL, AND THE VEHICLE MAY BE UNABLE TO BE RESTARTED. SAFETY RISK: IF A VEHICLE STALL OCCURS WHILE DRIVING AT HIGHER SPEEDS, THIS COULD INCREASE THE RISK OF A CRASH.\"    I FREQUENTLY CHECKED THE STATUS OF THIS RECALL (BOTH BY CHECKING THE NHTSA SITE AND CALLING MY LOCAL TOYOTA DEALERSHIPS) AND AS OF TODAY, JULY 16TH, 2020, MORE THAN HALF A YEAR AFTER THE RECALL WAS ANNOUNCED, THIS RECALL REMAINS UNADDRESSED AND IS LISTED AS \"RECALL INCOMPLETE, REMEDY NOT YET AVAILABLE\" ON THE NHTSA WEBSITE. GIVEN THE SAFETY RISKS, 6+ MONTHS IS AN INAPPROPRIATELY LONG TIME NOT TO OFFER CONSUMERS A REMEDY WHILE WE ARE STILL DRIVING OUR VEHICLES. THIS IS MY ONLY VEHICLE AND I DO NOT HAVE THE OPTION TO AVOID DRIVING IT WHILE I AWAIT A SAFETY REMEDY.",
        "vin": "3TMCZ5ANXJM"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/06/2020",
        "dateOfIncident": "03/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337708,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA TACOMA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. DON MCGILL TOYOTA (11800 KATY FWY, HOUSTON, TX 77079) WAS CONTACTED AND CONFIRMED THAT PARTS WERE NOT YET AVAILABLE FOR THE RECALL REPAIR. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3TMCZ5AN6JM"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/02/2020",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337088,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 6 SPEED MANUAL V6 3.5L TRD OFF ROAD TACOMA HAS HESITATIONS AND BUCKS WHEN YOU APPLY THROTTLE IN THE LOWER RPM 1000 TO 2000 RANGE TO ACCELERATE AND ALSO HAS POOR THROTTLE RESPONSE WHEN DOWN SHIFTING TO SLOW AND MAKE A TURN ONTO A SIDE STREET. YOU HAVE TO APPLY ALMOST 3/4 THROTTLE TO GET THE RPM TO COME TO WHERE YOU CAN REV MATCH TO THE APPROPRIATE GEAR. IT MAKES FOR A JERKY RIDE FOR PASSENGERS AND SEEMS HARD ON THE DRIVETRAIN. NO DEALER FIX IS AVAILABLE. CLUTCH PEDAL ALSO SQUEAKS ON WARMER DAYS.  *TR",
        "vin": "5TFCZ5AN8JX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/01/2020",
        "dateOfIncident": "06/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331964,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA TACOMA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT CALLED TOYOTA OF RIVERSIDE LOCATED AT 7870 INDIANA AVE, RIVERSIDE, CA 92504, (951)-588-2172, AND IT WAS CONFIRMED THAT PARTS WERE NOT AVAILABLE FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3TMAZ5CN1JM"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/01/2020",
        "dateOfIncident": "03/02/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331991,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA TACOMA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. PARKS TOYOTA OF DELAND (1701 S WOODLAND BLVD, DELAND, FL 32720) AND SEMINOLE TOYOTA (1160 RINEHART RD, SANFORD, FL 32771) WERE CONTACTED AND CONFIRMED THAT PARTS WERE NOT YET AVAILABLE FOR THE RECALL REPAIR. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3TMAZ5CN5JM"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/29/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331479,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA TACOMA. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE DROVE ROUGH WITHOUT WARNING. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. TOYOTA OF NEWNAN (2 HERRING RD, NEWNAN, GA 30265) WAS CONTACTED AND CONFIRMED THAT THE REMEDY PART WAS NOT AVAILABLE. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS APPROXIMATELY 23,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TFRX5GN8JX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/22/2020",
        "dateOfIncident": "06/21/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330004,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "HITACHI SHOCKS CAN'T HANDLE DAMPENING REQUIREMENTS CAUSING THE TIRES TO LOSE CONTACT WITH THE ROADWAY - REDUCING TRACTION, BRAKING ABILITY, AND STABILITY.  MY 10 YEAR OLD SON CAN COLLAPSE THE SHOCK WITH 1 HAND - NEVER MIND A VEHICLE THAT WEIGHS 4,000+ LBS.      IF THERE IS ANY TYPE OF LOAD - WHEN HITTING A BUMP THE TRUCK BOUNCES DOWN THE ROAD - WHERE YOU MUST BE EXTREMELY CAREFUL TO KEEP THE TRUCK TRACKING STRAIGHT.  THIS IS MOST SEVERE ON THE HIGHWAY.      NONE OF THE VEHICLES WE HAVE OWNED IN THE PAST 30 YEARS EXHIBITED THIS SEVERE SUSPENSION SHORT FALL.   THE ONLY TIME YOU MAY EXPERIENCE THIS IS AFTER SOMETHING IN THE SUSPENSION HAS FAILED OR WORN OUT.   NOT ON A VEHICLE WITH UNDER 30K MILES ON IT.   *TR",
        "vin": "5TFCZ5AN0JX"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/22/2020",
        "dateOfIncident": "06/22/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330006,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 TACOMA TRD SPORT MANUAL TRANSMISSION - THIS HAS BEEN GOING ON SINCE DAY 1 - ENGINE HESITATION IN 1ST AND MOST NOTICEABLE IN SECOND GEAR.   THE TRUCK HESITATES AND SURGES DURING LIGHT AND MODERATE ACCELERATION - FEELING LIKE AN EXTREME LEAN RUNNING CONDITION.  THIS PUTS THE DRIVER AND OTHER PEOPLE AROUND YOU AT RISK WHEN PULLING OUT INTO TRAFFIC OR HIGHWAY.     IF YOU SHIFT A TOUCH EARLY INTO SECOND GEAR THE TRUCK OCCASIONALLY BOG ( STARVE FOR FUEL )HEAVILY - WHERE YOU MUST EITHER BE PATIENT, SLIP THE CLUTCH PRESS ON THE ACCELERATOR HARDER, OR DOWNSHIFT.       THE HESITATION IS THERE ALL THE TIME AND MORE NOTICEABLE WITH ANY LOAD UP ANY INCLINE.     THIS IS DANGEROUS AND THE DRIVER MUST BE PREPARED AT ALL TIMES TO DOWN SHIFT, SLIP THE CLUTCH, AND MUST KNOW ABOUT THE HESITATION.      MY CO-WORKERS AND FRIENDS HAVE DRIVEN WITH ME AND CAN'T BELIEVE TOYOTA HASN'T FIXED IT YET.      MY SON CAME HOME FROM DRIVING IT - SAYING ITS HESITATING SEVERELY.    THIS HAS BEEN GOING ON SINCE DAY 1 AND GETTING WORSE.  *TR",
        "vin": "5TFCZ5AN0JX"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/15/2020",
        "dateOfIncident": "06/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328947,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AT ABOUT 40MPH ON A COUNTRY ROAD WITH NO VEHICLES IN FRONT OR BEHIND ME AND THE WARNING TO BRAKE ALONG WITH THE ASSOCIATED BEEPING AND RED BLINKING LIGHTS ON THE DASHBOARD APPEARED. THIS WENT AWAY AFTER ABOUT 2 SECONDS. IT WAS LIKE THE VEHICLE SENSED A CAR IN FRONT OF ME THAT I WAS GOING TO HIT BUT THERE WAS NOTHING IN FRONT OF ME WHATSOEVER. THE BRAKES NEVER ENGAGED BUT THE WARNING CAUSED ME TO JUMP. IF I WAS IN A CONGESTED AREA OR ON THE HIGHWAY IT COULD HAVE CAUSED ME TO LOSE CONTROL OR SWERVE INTO SOMEONE/SOMETHING.  *TR",
        "vin": "5TFDZ5BN8JX"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/09/2020",
        "dateOfIncident": "12/13/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327904,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "IN DECEMBER OF 2019 MY TRUCK STALLED ON THE HIGHWAY UNDER NORMAL OPERATING CONDITIONS AND NEARLY CAUSED ME TO REAR END THE PERSON IN FRONT OF ME AS I LOST SIGNIFICANT BRAKE PRESSURE. I IMMEDIATELY CALLED THE DEALERSHIP BUT THEY CLAIMED TO HAVE NEVER HEARD OF THE ISSUE. ONE MONTH LATER, A RECALL IS ANNOUNCED. HERE WE ARE IN JUNE (HALF A YEAR LATER) AND I WORRY EVERY TIME I DRIVE MY TRUCK THAT THIS MAY HAPPEN AGAIN. WHEN WILL TOYOTA BE HELD RESPONSIBLE FOR REPLACING THE FUEL PUMPS IN THESE VEHICLES BEFORE SOMEONE IS KILLED?!  *TR",
        "vin": "3TMCZ5AN6JM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/07/2020",
        "dateOfIncident": "11/29/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327639,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "II BOUGHT THE 1998 TACOMA AT THE TOYOTA DEALER IN JOHNSON CITY, TN. IN NOV 2019--I SUSPECT THE DEALERSHIP KNEW ABOUT THE FUEL PUMP PROBLEM WHEN I BOUGHT IT . I AM 64 YEARS OLD AND TAKING THE TRUCK ON A VACATION FROM JOHNSON CITY TO EMERALD ISLE N.C. IN AUGUST 2020--VERY CONCERNED ABOUT DRIVING ON THIS TRIP--I ALSO THOUGHT I HAD A WONDERFUL TRUCK AND AM VERY DISAPPOINTED HAVING TO DRIVE IT WITH THE SAFETY ISSUE-THIS HAPPENED WHEN I BOUGHT THE VEHICLE ONE DAY IN NOV. 2019",
        "vin": "3TMCZ5ANXJM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/07/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327651,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS HAD A RECALL FOR THE FUEL PUMP SINCE JANUARY. SO FAR TOYOTA DOES NOT HAVE A FIX. IT IS DANGEROUS TO DRIVE WITH THIS PROBLEM AND SHOULD NOT TAKE 6 MONTHS FOR THEM TO FIND A FIX.",
        "vin": "3TMDZ5BN5JM"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/02/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326964,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA TACOMA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. TREASURE COAST TOYOTA (5101 SE FEDERAL HWY, STUART, FL 34997 (772) 283-8300) WAS CONTACTED AND CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE MANUFACTURER WAS CONTACTED AND MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TFCZ5AN9JX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/14/2020",
        "dateOfIncident": "04/20/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324530,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA TACOMA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. JOHN O'NEIL JOHNSON TOYOTA (2900 MS-39, MERIDIAN, MS 39301, (601) 485-1620) WAS CONTACTED AND CONFIRMED THAT THE PART WAS NOT AVAILABLE FOR THE RECALL REPAIR. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT ATTEMPTED TO REACH THE MANUFACTURER HOWEVER, THE ATTEMPT WAS UNSUCCESSFUL. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TFAZ5CN3JX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/12/2020",
        "dateOfIncident": "01/30/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324274,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA TACOMA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. JS HUNTINGTON MOTORS (370 OAKWOOD RD, HUNTINGTON STATION, NY 11746, (631) 271-6212) WAS CONTACTED AND CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE MANUFACTURER WAS CONTACTED AND MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. *LN  CONSUMER STATED VEHICLE WAS CONTINUOUSLY STALLING WITHOUT WARNING CAUSING A LOSS OF POWER STEERING.*JB*DT*JB",
        "vin": "5TFCZ5AN0JX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/08/2020",
        "dateOfIncident": "05/07/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323839,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA TACOMA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. A DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCE A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3TMCZ5AN6JM"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/24/2020",
        "dateOfIncident": "04/24/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322204,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA TACOMA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER AND DEALER WERE NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "5TFCZ5AN7JX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/23/2020",
        "dateOfIncident": "09/15/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322020,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA TACOMA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT STATED THAT AT START UP, THE RPM FLUCTUATED WITH THE BRAKE PEDAL DEPRESSED. AN UNKNOWN WARNING LIGHT WAS ILLUMINATED. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 12,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3TMCZ5AN5JM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/23/2020",
        "dateOfIncident": "03/17/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322083,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN INTERSTATE I85 IN ATLANTA GEORGIA AND MY VEHICLE JUST SHUT DOWN AND WOULD NOT START BACK UP",
        "vin": "5TFCZ5AN1JX"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/21/2020",
        "dateOfIncident": "01/07/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321846,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "RUNS ROUGH, FEELS LIKE IT'S GOING TO STALL WHEN I ACCELERATE. SPORADIC",
        "vin": "5TFCZ5AN0JX"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/01/2020",
        "dateOfIncident": "04/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319988,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2018 TOYOTA TACOMA WITH AN OPEN RECALL ON THE FUEL PUMP. THE SAFETY RISK IS THAT THE VEHICLE MAY STALL AT HIGHER SPEEDS. THIS RECALL CAME OUT IN JANUARY 13, 2020, BUT THERE STILL ISN'T A REMEDY TO THE ISSUE. MY DAILY COMMUTE IS ON THE HIGHWAY APPROXIMATELY 40 MILES ONE WAY. I FEEL VERY UNSAFE IN MY TOYOTA TACOMA AS THIS VEHICLE IS MY DAILY DRIVER. IT IS NOW APRIL 1, 2020 AND TOYOTA HAS YET TO RELEASE ANY FIX OR REMEDY TO CORRECT THIS SAFETY RECALL. HOW LONG DOES TOYOTA HAVE TO REMEDY THE ISSUE AND WHAT ARE MY OPTIONS AT THIS POINT WITH THE VEHICLE?",
        "vin": "3TMCZ5ANXJM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/05/2020",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316226,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA TACOMA. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 40 MPH, THE VEHICLE STALLED. THE CONTACT STATED THAT THERE WAS AN UNKNOWN WARNING LIGHT ILLUMINATED. THE VEHICLE WAS ABLE TO RESTART. THE FAILURE RECURRED THREE TIMES. THE VEHICLE WAS TAKEN TO JOHNSTONS TOYOTA LOCATED AT (5021 NY-17M, NEW HAMPTON, NY 10958) HOWEVER, THE MECHANIC WAS UNABLE TO DUPLICATE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED THE CONTACT A CASE NUMBER. THE APPROXIMATE FAILURE MILEAGE WAS 10,100.",
        "vin": "5TFSZ5AN4JX"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/05/2020",
        "dateOfIncident": "02/29/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316270,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER SITTING OUT IN SUB-ZERO TEMPERATURES FOR SEVERAL HOURS, THE VEHICLE REFUSED TO START DUE TO APPARENT FUEL STARVATION. AFTER MULTIPLE ATTEMPTS,AND REPEATED DEPRESSION ON THE ACCELERATOR PEDAL,FUEL WAS EVENTUALLY DELIVERED AND THE VEHICLE  STARTED.",
        "vin": "3TMDZ5BN6JM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/11/2020",
        "dateOfIncident": "02/11/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308606,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A LETTER FROM TOYOTA OFFERING ME $100 BECAUSE THEY 'ACCIDENTALLY' MISREPRESENTED THE SAFETY RATINGS OF MY 2018 TOYOTA TACOMA.  THE LETTER STATES THAT THE RATINGS WHICH WERE 4 AND 5 STARS ON THE WINDOW STICKER FROM YOUR ORGANIZATION HAVE BASICALLY BEEN ALL CHANGED TO NOT RATED.  THIS CONCERNS ME BECAUSE ONE OF THE REASONS I CHOSE THE VEHICLE WAS BECAUSE OF THE SAFETY RATING BY YOUR ORGANIZATION FOR ME AND MY FAMILY.  NOW THERE ARE NO RATINGS OTHER THAN ROLLOVER WHICH IS RATED AT 4 STARS.  I'VE ATTACHED A PICTURE OF THE WINDOW STICKER WITH VIN NUMBER BLOCK AS REQUESTED AS WELL AS THE PORTION OF THE LETTER THEY SENT.  I CAN PROVIDE COPIES OF BOTH UPON REQUEST..  I'M SURE YOU ARE WELL AWARE OF THIS ISSUE AND A CALL TO TOYOTA WAS UNEVENTFUL AS THEY TRIED TO OFFER ME $100 TO OVERLOOK THIS.  I'D LIKE TO KNOW WHAT RECOURSE I HAVE IN THIS MATTER.",
        "vin": "5TFSZ5AN4JX"
    },
    {
        "components": "POWER TRAIN,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/07/2020",
        "dateOfIncident": "01/31/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307824,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE STALLS INTERMITTENTLY.  IT IS AS IF THE TRACTION CONTROL SYSTEM IS CUTTING THROTTLE INPUT FOR 1-2 SECONDS.  THIS OCCURS IN HEAVY STOP AND GO TRAFFIC.  SPECIFICALLY, IF ACCELERATING TO 10-15 MILES PER HOUR, THEN STOPPING, THEN ATTEMPTING TO ACCELERATE AGAIN, THE TRUCK SUFFERS AN ENGINE STALL.  THE TRACTION CONTROL DASHBOARD INDICATOR DOES NOT LIGHT UP DURING THIS OCCURRENCE; HOWEVER, THE ENGINE PERFORMS VERY SIMILAR TO INSTANCES WHEN THE TRACTION CONTROL DOES OPERATE.  THE STALL ALSO OCCURS WHEN SLOWING DOWN TO TURN INTO DRIVEWAYS, ETC.  THERE IS NO REQUIRED INTERVENTION TO CORRECT THIS ISSUE; IT SIMPLY LASTS 1-2 SECONDS, THEN OPERATES AS NORMAL.  THE VEHICLE WAS TAKEN TO TWO DIFFERENT DEALERSHIPS (BOTH TOYOTA).  NEITHER WAS ABLE TO REPLICATE THE ISSUE.  I WAS TOLD THE VEHICLE DID NOT HAVE ANY ERROR CODES AND THERE WAS NOTHING THAT REQUIRED SERVICE.  THIS EVENT HAS HAPPENED APPROXIMATELY FIVE TIMES IN THE LAST 30 DAYS (DECEMBER 2019-JANUARY 2020).",
        "vin": "5TFSX5ENXJX"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/06/2020",
        "dateOfIncident": "02/05/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307450,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AUTOMATIC BRAKING SYSTEM (ABS) ENGAGES WHEN ROAD SURFACES ARE SNOWY OR SLICK. WHEN THIS HAPPENS, I CANNOT STOP THE VEHICLE WITHIN A REASONABLE DISTANCE. THE ABS TAKES OVER AND THE CAR COASTS INDEFINITELY. I HAVE NEVER BEEN IN AN ACCIDENT IN 40 YEARS OF DRIVING, AND HAVE NOW HAD THREE NEAR MISSES OVER THE LAST TWO WINTERS DUE TO THE ABS.",
        "vin": "3TMCZ5ANXJM"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/30/2020",
        "dateOfIncident": "01/29/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302999,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2018 TACOMA HAD A CHECK ENGINE LIGHT COME ON, THEN THE TRAC LIGHT CAME ON. CRUISE CONTROL QUIT WORKING AND ENGINE RUNS ROUGH. WHEN DRIVING, VEHICLE BEGINS TO LOSE ACCELERATION AND CHECK ENGINE LIGHT BEGINS FLASHING. WHEN IDLING, ENGINE RUNS WITH WITH A MISS, AND WHEN DRIVING, AT LOWER SPEEDS THE VEHICLE SHUDDERS AS IF ITS LOSING POWER.",
        "vin": "3TMCZ5AN7JM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/24/2020",
        "dateOfIncident": "03/31/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301674,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA TACOMA. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE COLLISION AVOIDANCE SYSTEM ACTIVATED WITHOUT A VEHICLE IN CLOSE PROXIMITY. THE CONTACT STATED THAT THE LANE ASSIST WARNING LIGHT ALSO WAS INOPERABLE. THE VEHICLE WAS TAKEN TO BILL WRIGHT TOYOTA LOCATED AT 5100 GASOLINE ALLEY DR, BAKERSFIELD, CA 93313, (661)398-8697, TO BE DIAGNOSED. THE MECHANIC WAS UNABLE TO RETRIEVE A FAULT CODE OR DUPLICATE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND INFORMED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 3,000.",
        "vin": "3TMAZ5CNXJM"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/24/2020",
        "dateOfIncident": "07/02/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301693,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA TAKOMA. THE CONTACT STATED THAT WHILE DRIVING AND ACCELERATING, A WARNING MESSAGE IN THE INSTRUMENT PANEL STATED THAT THE BRAKE AND ACCELERATOR WAS DEPRESSED AT THE SAME TIME. THE VEHICLE LOST MOTIVE POWER. MARIETTA TOYOTA (750 COBB PKWY S, MARIETTA, GA 30060, (470)938-8430) WAS CONTACTED AND AN APPOINTMENT WAS SCHEDULED WHICH WAS STILL PENDING. THE CONTACT STATED THAT THE FAILURE WAS INTERMITTENT. THE MANUFACTURER WAS NOT CONTACTED OR INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS 21,039.",
        "vin": "5TFAX5GN0JX"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/17/2020",
        "dateOfIncident": "01/17/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300086,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN SLOWING DOWN BEFORE MAKING A LEFT TURN ACROSS TRAFFIC, AFTER THE VEHICLE COMES TO A CRAWL OR STOP AND THEN I ACCELERATE TO TURN LEFT ACROSS TRAFFIC, THE ENGINE HESITATES FOR 1 TO 2 SECONDS BEFORE ACCELERATING.  I TOOK MY 2018 TOYOTA TACOMA TO MY DEALER AND THEY WERE ABLE TO REPLICATE THE PROBLEM.  A RE-SET OR UPGRADE TO THE COMPUTER HAS NOT FIXED THE PROBLEM.  THERE IS A GREAT DEAL OF DISCUSSION OF THIS ISSUE AT HTTPS://WWW.TACOMAWORLD.COM/THREADS/3RD-GEN-STALLING-IN-INTERSECTION-UPDATE.459540/.",
        "vin": "3TMDZ5BN3JM"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/15/2020",
        "dateOfIncident": "12/27/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299461,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE HAVE BEEN SEVERAL TIMES I HAVE GONE OUT TO MY TACOMA THAT I CAN HEAR THE FUEL PUMP RUNNING ON IT'S OWN. I HEARD IT RUNNING ONE EVENING, WHILE NO KEYS WERE INSERTED AND THE TRUCK WAS LOCKED UP.    THE TRUCK RUNS ROUGH MOST OF THE TIME AND I HAVE PROBLEMS WITH IT STALLING AND NOT WANTING TO START BACK UP AGAIN. IT WILL TAKE 3 TO 4 TIMES TURNING THE TRUCK OVER BEFORE IT WILL RELUCTANTLY WILL START UP. ALSO THE TRACTION CONTROL BUTTON DOES NOT WORK ANYMORE AND THE DIFFERENTIAL BUTTON WHEN PUSHED ON DOES NOT ENGAGE THE DIFFERENTIAL.  ALL OF THESE ISSUES HAVE STARTED AT DIFFERENT TIMES. THE FUEL PUMP RUNNING WHEN NO ONE INSIDE IT HAS JUST THE MONTH BEEN NOTICED AS WELL AS THE BUTTONS. THE STALLING STARTED TO BE NOTICED ABOUT 4 MONTHS AGO AND I AT FIRST THOUGHT IT WAS DUE TO IT BEING NOT BROKE IN OR ME NOT GIVING IT ENOUGH GAS, BUT IT IS ALMOST EVERY TIME NOW WHEN I BACK UP OR GO FORWARD IT CAN STALL.",
        "vin": "5TFCZ5AN3JX"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/10/2020",
        "dateOfIncident": "01/10/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298338,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A LOUD WHISTLE THAT COMES FROM THE DRIVER AND PASSENGER DOOR WHEN DRIVING ABOVE 55 MPH",
        "vin": "3TMCZ5AN4JM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/13/2019",
        "dateOfIncident": "05/20/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288807,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TRANSMISSION ISN'T WORKING PROPERLY. IT DOESN'T SHIFT WHEN IT SHOULD OR IT DOWNSHIFTS WHEN IT SHOULDN'T. WHEN I AM USING CRUISE CONTROL IT'S STAYS IN LOW GEARS WAY TO LONG AND REEVES THE ENGINE VERY HIGH. ONCE I TAKE IT OFF CRUISE CONTROL IT GETS BETTER BUT STILL ISN'T RIGHT. THIS HAS HAPPENED SINCE I PURCHASED THE VEHICLE IN 2018.",
        "vin": "3TMCZ5AN4JM"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/02/2019",
        "dateOfIncident": "07/10/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286427,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING UNDER VARIOUS SPEEDS THE TRUCK WILL VIOLENTLY JOLT FORWARD. A STOP CONTROL MALFUNCTION WARNING APPEARS, THE TRACTION CONTROL, AND THE CHECK ENGINE LIGHT WILL ILLUMINATE. THE TRUCK WILL IMMEDIATELY ENTER LIMP MODE WHICH WILL NOT ALLOW THE TRUCK TO SHIFT ABOVE 3/4TH GEAR. THIS ISSUE HAS OCCURRED 8 TIMES SINCE THE VEHICLE HAS BEEN PURCHASED AND TOYOTA IS REFUSING TO COVER THE REPAIRS UNDER THE POWER TRAIN WARRANTY.",
        "vin": "3TMDZ5BN0JM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/26/2019",
        "dateOfIncident": "11/11/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282546,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO COME OFF AND ON OFF. THIS IS A DISTRACTION AS YOU DRIVE TRYING TO FIGURE OUT HOW TO RECONNECT YOU DEVISE",
        "vin": "5TFCZ5ANXJX"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/22/2019",
        "dateOfIncident": "11/22/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281876,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A CLUNK NOISE COMING FROM PASSENGER SIDE AT START UP. THE NOISE SEEMS TO BE COMING FROM UNDERNEATH THE TRUCK.",
        "vin": "5TFAZ5CN2JX"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/13/2019",
        "dateOfIncident": "11/12/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279873,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE EXHIBITS A STUMBLING CONDITION AND LOSS OF POWER WHEN APPLYING HEAVY THROTTLE TO ACCELERATE FROM A STOP OR SLOW VEHICLE SPEEDS. WHILE DRIVING UNDER MODERATE THROTTLE AT APPROX. 45-60MPH THE VEHICLES ENGINE FEELS AS IF IT IS MISFIRING AND NOT RUNNING ON ALL CYLINDERS WITH A HEAVY DELAY IN THROTTLE RESPONSE WHEN THE THROTTLE IS APPLIED TO INCREASE VEHICLE SPEED.      ISSUE HAS BEEN BROUGHT UP WITH MULTIPLE TOYOTA DEALERSHIPS AND ALSO WITH TOYOTA CORP CUSTOMER SERVICE. THERE IS A SOFTWARE FLASH TO CORRECT THIS ISSUE BUT TOYOTA REFUSES TO OFFER IT TO CUSTOMER WITH MANUAL TRANSMISSIONS BECAUSE THEIR TSB'S DO NOT LIST THAT MANUAL TRANS.     THERE IS A 145 PAGE FORUM THREAD REGARDING THIS ISSUE WHERE CUSTOMERS ARE RESORTING TO FLASHING THEIR TRUCKS ON THEIR OWN TO AVOID THE DANGEROUS DRIVING CONDITION THESE TRUCKS ARE EXHIBITING.     HERE IS A LINK TO THE THREAD:   HTTPS://WWW.TACOMAWORLD.COM/THREADS/SOFTWARE-UPDATE-FOR-THE-MANUAL.562550/    TSB 1 LISTING CONDITION:   HTTPS://TOYOTATALK.COM/WP-CONTENT/UPLOADS/2018/07/TACOMA-T-SB-0062-18.PDF    TSB 2 LISTING CONDITION:  HTTPS://TOYOTATALK.COM/WP-CONTENT/UPLOADS/2018/07/TACOMA-T-SB-0058-18.PDF",
        "vin": "5TFCZ5AN9JX"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/12/2019",
        "dateOfIncident": "11/08/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279470,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "3RD GENERATION TACOMA AC CONDENSATION OUTLET TUBE IS POSITIONED OVER THE TACOMA FRAME RAIL.  THEREFORE CONDENSATION DRIPS RIGHT ONTO THE FRAME RAIL EVENTUALLY CAUSING RUST.  I HAVE NOTIFIED TOYOTA OF THE MATTER TO REQUEST A FIX.",
        "vin": "3TMCZ5AN6JM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/21/2019",
        "dateOfIncident": "10/02/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270078,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "FEELS VERY UNDER POWERED FOR A V6 ENGINE. THE PICK UP SEEMS DETERIORATING AFTER FEW MONTHS OF APPLYING TRANSMISSION PROGRAMMING UPGRADE. DOESNT FEEL CONFIDENT TO PASS OR MERGE TO A BUSY HIGHWAY.",
        "vin": "3TMCZ5AN5JM"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/21/2019",
        "dateOfIncident": "10/21/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270081,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE OWNED MY TOYOTA TACOMA FOR 18 MONTHS AND MY RADIO HAS HAD PROBLEMS EVERY SINCE I BOUGHT IT. TOYOTA SUPPOSEDLY HAS RAN TESTS ON IT EVERY TIME I BROUGHT IT IN AT 5,000 MILE OIL CHANGES AND TIRE ROTATIONS. IT STILL RANDOMLY CUTS OFF AND TAKES FOREVER TO COME BACK ON. IT ALSO WILL END A CALL WHILE I'M ON THE PHONE WITH SOMEONE OR DISCONNECT MY PHONE WHILE I'M ON THE PHONE WITH SOMEONE AND WON'T CONNECT BACK. TODAY I TOOK IT UP THERE AND I JUST HIT 37,000 MILES TODAY AND NOW THEY WANT TO TELL ME I NEED A NEW RADIO BUT IT'S NOT UNDER WARRANTY AFTER I HIT 37,000 MILES SO I WILL HAVE TO PAY FOR IT MYSELF. IT IS NOW BEING TAKEN UP WITH TOYOTA SINCE I HAVE TOLD THEM ABOUT IT SINCE I BOUGHT THE TRUCK.",
        "vin": "3TMAZ5CN7JM"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/18/2019",
        "dateOfIncident": "05/10/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269430,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 TOYOTA TACOMA I4, WHEN COOL OR COLD ENGINE OR TRANSMISSION WILL STALL & STUMBLE WHILE ACCELERATING YOU CAN BE SMOOTH OR AGGRESSIVE & IT WILL OCCUR, IT HAS ALSO OCCURRED WHEN IT HAS BEEN VERY HOT OUTSIDE 85-95 DEGREES AND OCCURS EVEN AT NORMAL ENGINE OPERATING TEMPERATURE.   THE TRANSMISSION ALSO WILL DOWN SHIFT TO 4TH GEAR FOR NO APPARENT REASON WHILE CRUISING @ 55-65MPH ON FLAT AND LEVEL ROADS, IT ALSO CONSTANTLY HUNTS 4 GEARS. I HAVE BEEN TO TOYOTA DEALERSHIP SEVERAL TIMES AND THE CANT DUPLICATE THE ISSUE. I HAVE BEEN TOLD BY TOYOTA THAT BECAUSE MY TRUCK IS A (4 CYLINDER)  THAT THEY ARE NOT AS MANY ON THE ROAD AS THE V6'S MODELS SO TOYOTA ENGENEERING WONT EVEN LOOK INTO THE PROBLEMS THAT I HAVE BEEN EXPERIENCING. THEY JUST SAY THAT'S NORMAL TOYOTA PERFORMANCE.",
        "vin": "5TFAX5GN2JX"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/18/2019",
        "dateOfIncident": "10/03/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269441,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE CONTINUES TO HAVE BRAKE SHUDDER WHILE DECELERATING FROM FREEWAY SPEEDS. AS THE BRAKES HEAT UP, THE BRAKE SHUDDER GETS MORE AND MORE PRONOUNCED. I HAVE HAD THIS VEHICLE IN TO THE DEALERSHIP FOR MAINTENANCE ON THIS ISSUE 5 TIMES IN THE LAST 6 MONTHS TO ADDRESS THE ISSUE. TSB HAS BEEN DONE TO ADDRESS REAR AXLE ISSUES, ALL RECALLS HAVE BEEN COMPLETED AND REAR DRUMS WERE REPLACED UNDER WARRANTY ONCE. VEHICLE IS STILL UNDER MANUFACTURER'S 2YR/25,000 MILE TOYOTACARE WARRANTY, BUT MANUFACTURER REFUSED TO REPLACE THE DRUMS/ROTORS. I HAVE TAKEN THE VEHICLE TO A DIFFERENT SHOP AND HAD FRONT ROTORS/PADS REPLACED, ALONG WITH THE REAR DRUMS AND THERE IS STILL A VIBRATION COMING FROM THE BRAKES WHILE DECELERATING. PLEASE ADVISE.",
        "vin": "3TMAZ5CN1JM"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "09/17/2019",
        "dateOfIncident": "09/15/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256082,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA TACOMA. WHILE DRIVING 72 MPH WITH THE CRUISE CONTROL ACTIVATED, THE SPEED ERRONEOUSLY INCREASED TO MORE THAN 90 MPH. ALSO, THE COLLISION AVOIDANCE SYSTEM MALFUNCTIONED AND DID NOT SLOW DOWN OR STOP THE VEHICLE WHEN APPROACHING A SECOND VEHICLE. IN ADDITION, WHILE THE CRUISE CONTROL WAS ACTIVATED, THE VEHICLE WOULD SUDDENLY DECELERATE AFTER THE CRUISE CONTROL ERRONEOUSLY DEACTIVATED. THE CAUSE OF THE FAILURES WAS NOT DETERMINED. THE LOCAL DEALER (CHATHAM PARKWAY TOYOTA, 7 PARK OF COMMERCE WAY, SAVANNAH, GA) WAS CONTACTED. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT INDICATED THAT THE VEHICLE WAS PREVIOUSLY SERVICED TO REPAIR A WAVE RADAR SENSOR. THE FAILURE MILEAGE WAS 12,957.",
        "vin": "3TMAZ5CN6JM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/10/2019",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254322,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TAILGATE DOSE NOT OPEN AFTER A TINY ROCK GOT IN THE DOOR HINGE IT SHOULD BE RE CALL  TRUCKS ARE MADE FOR HAULING . AND SHOULD WORK FIND SINCE IT'S ONLY 10 MONTHS OLD.  IT'S A 2018 TOYOTA TACOMA .",
        "vin": "5TFRX5GN1JX"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/10/2019",
        "dateOfIncident": "03/06/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254374,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUCK VIBRATE AS IF IT HAS BIG OFF ROAD TIRES, THE VIBRATION IS VERY STRONG FORM 15 OR 20 MPR AT TIMES IS SO STRONG THAT THE DASHBOARD  MAKE NOYCE AND THE FRONT PASSENGER SEAT MAKES NOYCE.  IN THE MORNING AND SOMETIMES AT ANY TIME THE ENGINE IS KING OF MISSING FOR SMALL TIMES, MISSING , LIKE GOING AND STOPPING THE ENGINE NEASE.  ALL THIS HAPPENING IN CITY DRIVING OR HWY.  ALL HIS HAPPENS ON AND OFF .",
        "vin": "5TFAZ5CN3JX"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/05/2019",
        "dateOfIncident": "08/06/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253492,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "HE TRUCK IDLE SPEED MANAGEMENT UNDER LOAD FROM COLD START IS ERRATIC. IF I PUT VEHICLE INTO REVERSE TO BACK OUT OF GARAGE IDLE SPEED JUMPS 200-300 RPM AND JERKS BEFORE SETTLING DOWN. IF I TURN THE STEERING WHEEL AT CREEP SPEED (ENGINE AT IDLE) IDLE SPEED JUMPS 200-300 RPM. I TOOK TO DEALER 8/7/19 AND DEALER SAYS NO PROBLEM FOUND.  THIS ONLY HAPPENS WHEN COOLANT TEMP IS STONE COLD. IT HAS DONE THIS SINCE NEW.",
        "vin": "3TMCZ5AN8JM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/22/2019",
        "dateOfIncident": "08/22/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245892,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD AN APPOINTMENT TO TAKE MY VEHICLE IN FOR A RECALL, SHOWED UP TO DO THE RECALL ON THE DRIVE, SERVICE ADVISOR SAID THEY CAN'T DO THE RECALL ON MY VEHICLE. WHY CALL AND EMAIL ABOUT THE RECALL ON MY VEHICLE TO HAVE ME DRIVE TO THE DEALERSHIP TO BE TOLD NO. WASTE OF TIME. THE RECALL ON MY VEHICLE IS \"SPECIAL SERVICE CAMPAIGN K0B (REMEDY NOTICE) - CERTAIN 2018 ' 2019 MODEL YEAR TACOMA AND TUNDRA - MILLIMETER WAVE RADAR SENSOR\". I'VE HAD THE VEHICLE COME TO A STOP AND HAD THE BRAKE LIGHT ON IN THE MORNING WITH MORNING DEW, HAPPENED A FEW TIMES IN THE LAST COUPLE MONTHS.",
        "vin": "3TMCZ5ANXJM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/21/2019",
        "dateOfIncident": "08/21/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245553,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "POSSIBLE OIL LEAKS IN THE REAR DIFFERENTIALS AND KNOCKING SOUND WHEN CHANGING FROM PARKING TO DRIVE AND TURNING THE WHEELS. SOUNDS SEEMS TO COME FROM THE FROM AXLE, WHEN STRAIGHTEN THEM . EX. BACKING UP FROM A PARKING AND TURNING YOUR TIRES, YOU CAN HEAR A SOUND COMING FROM THE FRONT.",
        "vin": "5TFAZ5CN2JX"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/15/2019",
        "dateOfIncident": "07/15/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232156,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HOOD BULGE ON THE TRD HAS SEVERE GLARE WHEN THE SUN IS RAISING OR SETTING. MANY TIMES I HAVE ROUNDED A CORNER AND THE SUN REFLECTS OFF THE HOOD BULGE AND BLINDED ME. TODAY I WAS ALMOST IN AN ACCIDENT. THIS HAPPENS WHEN STATIONARY OR IN MOTION ON A CITY STREET OR A HIGHWAY.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/11/2019",
        "dateOfIncident": "07/10/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230918,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH LASER CRUISE CONTROL ON, VEHICLE WILL SUDDENLY SLAM ON THE BRAKES AND RELEASE WITH NO OTHER VEHICLES IN FRONT OF IT. THIS HAS HAPPENED 8 OR 9 TIMES IN THE TIME I HAVE OWNED THE TRUCK. I HAVE TAKEN IT BACK TO THE DEALER 4 TIMES FOR THIS PROBLEM, ONLY TO BE TOLD THAT THEY CANNOT DUPLICATE IT AND NOTHING WAS DONE TO REPAIR THE PROBLEM. THE NEXT DAY I RECEIVED A RECALL NOTICE TO BRING THE TRUCK TO TOYOTA TO REPAIR A FRONT SENSOR FOR THIS PROBLEM. I BROUGHT THE TRUCK IN TO THE DEALER AND THEY SAID THAT WATER WAS GETTING INTO THE FRONT GRILL SENSOR AND THEY GLUED A PIECE OF RUBBER/FOAM OVER THE SENSOR. A FEW DAYS LATER THE SAME THING HAPPENED AGAIN. MY WIFE AND I ARE AFRAID TO EVEN DRIVE THE TRUCK AND TOYOTA HAS SAID EVERYTHING IS OK. THE SECOND PROBLEM IS WITH LASER CRUISE ON AND SET AT 75 MILES AN HOUR TRAVELING UP A GRADE, THE VEHICLE WILL DOWNSHIFT INTO THIRD GEAR RUNNING THE TACH TO 300 RPM'S OVER THE REDLINE. TOYOTA SAYS THAT THIS IS FINE AND THE TRUCK HAS A GOVERNER TO KEEP THE TRUCK FROM OVER REVVING 300 RPM'S ABOVE REDLINE AT 5800 RPM. I EXPLAINED THAT IN THE OWNERS MANUAL IT SAYS TO NEVER RUN THE ENGINE TO REDLINE. AGAIN TOYOTA SAYS THIS IS NORMAL AND THAT THEY WILL NOT FIX THE PROBLEM. REDLINE IS 5500 RPM.",
        "vin": "5TFRX5GN1JX"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/14/2019",
        "dateOfIncident": "05/29/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219930,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "PRE COLLISION SYSTEM CAME ON",
        "vin": "3TMDZ5BN7 J"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/07/2019",
        "dateOfIncident": "06/06/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218501,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN SITTING ON A HILL, WHEN YOU MOVE FROM THE BRAKE TO THE GAS THE TRANSMISSIN (AUTOMATIC) APPEARS TO GO IN NEUTRAL AND THE TRUCK WILL ROLL BACKWARDS A WAYS BEFORE THE TRANSMISSION ENGAGES AGAIN. I TOLD A SERVICE TECH AT DEALERSHIP ABOUT IT AND HE SAID THEY ALL DO IT AND THERE IS NO FIX. HE ASKED ME IF I HAD IT IN THE MOUNTAINS YET AND I TOLD HIM NO AND HE SMILED AT ME SO NOW I AM SCARED TO GO INTO THE MOUNTAINS. THIS COULD BE A PROBLEM IN HEAVY TRAFFIC OR VERY DANGEROUS IN AN OFF ROAD SITUATION. THE TECH SAID THEY HAVE HAD 4 OTHERS  IN THIS WEEK FOR THE SAME PROBLEM. THEY GIVE ME AN APPT. FOR NEXT WEEK SO THEY CAN PUT MY TRUCK ON THE LIST.",
        "vin": "5TFSZ5AN4JX"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/04/2019",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217829,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA TACOMA. WHILE DRIVING VARIOUS SPEEDS, THERE WAS A VIBRATION IN THE BRAKE PEDAL WHEN IT WAS DEPRESSED. THE BRAKE PEDAL WAS APPLIED AND TRAVELED TO THE FLOORBOARD. THE VEHICLE FAILED TO RESPOND. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO JEFF WYLER TOYOTA OF SPRINGFIELD (2237 W 1ST ST, SPRINGFIELD, OH 45502, (937) 525-4642) WHERE IT WAS DIAGNOSED THAT THE ROTORS NEEDED TO BE ROTATED, RESURFACED, AND THE DRUMS NEEDED TO BE REPAIRED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS CONTACTED AND PROVIDED CASE NUMBER: 1905151322. NO FURTHER ASSISTANCE WAS PROVIDED. THE CONTACT STATED THAT THE FAILURE WAS SIMILAR TO NHTSA CAMPAIGN NUMBER: 18V888000 (SERVICE BRAKES, HYDRAULIC). THE CONTACT REQUESTED  DIAGNOSTIC TESTING ON THE MASTER CYLINDER. THE FAILURE MILEAGE WAS APPROXIMATELY 14,900.",
        "vin": "5TFCZ5ANXJX"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/24/2019",
        "dateOfIncident": "05/24/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209775,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST CALLED MY DEALER FOR A 6 MONTH SERVICE APPT AND WAS INFORMED ABOUT A RECALL ON MY VEHICLE THAT IS NOT SHOWN IN YOUR WEBSITE TOOL.  MY TOYOTA TACOMA 2018 WAS RECALLED FOR \"KOB MILLIMETER RADAR SENSOR\" WHICH REPORTEDLY COULD AFFECT BRAKING.  YOUR SITE IS NOT REPORTING THIS RECALL ON MY VEHICLE BUT THE DEALER IS.",
        "vin": "3TMDZ5BN7JM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/14/2019",
        "dateOfIncident": "03/06/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207631,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR TAKES TIME TO STOP COMPLETELY AFTER PRESSING THE BREAK.",
        "vin": "5TFAX5GNXJX"
    },
    {
        "components": "STEERING,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/11/2019",
        "dateOfIncident": "05/07/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206996,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SURGES WHEN STEERING WHEEL IS TURNED, ALSO IS HESITANT TO SHIFT GEARS ON HIGHWAY. FRUSTRATING AS IT IS DIFFICULT TO DRIVE EFFICIENTLY WHEN YOUR CAR DOES NOT SHIFT AS EXPECTED. TIRING TO DRIVE IN THIS WAY.",
        "vin": "3TMCZ5AN2JM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/11/2019",
        "dateOfIncident": "12/12/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207028,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CLUTCH FOR THE MANUAL TRANSMISSION STAYS AT THE FLOOR WHEN DEPRESSED IN COLD WEATHER. BELOW 20 DEGREES F. IT BECOMES VERY DANGEROUS TO DRIVE. I HAVE TO WAIT FOR ALL TRAFFIC TO CLEAR BEFORE TRYING TO PULL OUT ONTO A LARGE ROAD AS I DON'T KNOW WHEN OR IF THE CLUTCH WILL ENGAGE. THE DEALER WON'T TOUCH IT AS THEY DO NOT HAVE A SERVICE BULLETIN FROM TOYOTA REGARDING THE ISSUE.",
        "vin": "5TFCZ5AN2JX"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/22/2019",
        "dateOfIncident": "04/17/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11202841,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING THE TRUCK AND IT JUST TOOK OFF 'LIKE A RUNAWAY VEHICLE OVER 100 MPH\" AND IT DID THIS TWICE.I WAS DRIVING ON EXPRESSWAY APPROX 65 MPH.  MY INJURY IS THAT I AM PARANOID TO DRIVE THIS TRUCK.  THE TRUCK DOES WHAT IT WANTS.",
        "vin": "5TFCZ5AN8JX"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/18/2019",
        "dateOfIncident": "04/17/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11197114,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA TACOMA. WHILE DRIVING APPROXIMATELY 65 MPH WITH THE CRUISE CONTROL ACTIVATED, THE VEHICLE SUDDENLY ACCELERATED TO OVER 100 MPH. THE VEHICLE WAS TAKEN TO SUBURBAN TOYOTA (35200 GRAN RIVER AVE, FARMINGTON HILLS, MI) WHERE IT WAS DIAGNOSED THAT THE FAILURE WAS DUE TO A FAULTY SENSOR. THE VEHICLE WAS NOT REPAIRED. THE CONTACT INDICATED THAT THE FAILURE OCCURRED ON MULTIPLE OCCASIONS. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 19,500.",
        "vin": "5TFCZ5AN8JX"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/03/2019",
        "dateOfIncident": "02/25/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193706,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I FEEL THAT THE TOYOTA DEALER IN WAIPAHU, HAWAII IS UNABLE TO REMEDY THE DEFECT IN REGARDS TO RECALL NO. 18V-888.  I RECEIVED THE RECALL REMEDY NOTICE IN THE MAIL, I THEN CALLED OUR DEALERSHIP SERVICE DEPARTMENT THE VERY NEXT DAY ON 2/25/19. I WAS TOLD THE PART WAS ON BACK ORDER AND THEY HAD NO ESTIMATED TIME OF ARRIVAL FOR THE PART.  I ASKED FOR A PHONE CALL THAT DAY TO SATISFY MY CONCERN ON NO ETA FOR THE PART SINCE THIS RECALL AFFECTS MY BRAKE PERFORMANCE.  NO CALL WAS RECEIVED.  ON 3/27/19, I CALLED AGAIN AND WAS TOLD I HAD TO KEEP CALLING SINCE THEY HAVE NO IDEA IN REGARDS TO THE  ETA FOR THE PART.  SECONDLY, I CANNOT BE PUT ON A WAITING LIST SINCE I NEED TO BE AT THE REMEDY LEVEL.  I WAS CONFUSED SINCE OUR RECALL STATES IT IS A REMEDY NOTICE WHICH I EXPLAINED I ALREADY HAD.  I WAS PUT ON HOLD ONLY TO BE TOLD SHE MADE A MISTAKE AND THAT A MANAGER WILL CALL ME BACK THE SAME DAY.  NO CALL WAS RECEIVED.  TODAY IS 4/3/19 AND I STILL HAVE NOT RECEIVED A CALL.  I FEEL THAT THIS IS NOT VERY REASONABLE SINCE THIS RECALL AFFECTS BRAND NEW TRUCKS (2018-2019).  HOW CAN THIS REPAIR BE PUSHED BACK WHEN IT AFFECTS YOUR BRAKE PERFORMANCE?  SECONDLY, HOW CAN YOU SEND OUT A REMEDY NOTICE, HAVE A CUSTOMER MAKE CONTACT RIGHT AWAY, AND STATE THAT THERE ARE ALREADY NO PARTS AVAILABLE FOR THE RECALL.",
        "vin": "3TMAZ5CN2JM"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/22/2019",
        "dateOfIncident": "03/22/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190990,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "PRE-COLLISION WARNING SYSTEM IS FAULTY. THE SYSTEM ENGAGES WHEN NOTHING IS IN FRONT OF THE VEHICLE TO MERIT WARNINGS OR ENGAGING THE BRAKES AUTOMATICALLY. HOWEVER, THE SYSTEM DOES NOT ENGAGE WHEN THE TRUCK IS EXTREMELY CLOSE TO THE WALL OF A GARAGE. UNFORTUNATELY THERE IS NO WAY TO TURN OFF THIS FEATURE AND IT WILL ULTIMATELY RESULT IN AN ACCIDENT WHICH MAY BE FATAL.",
        "vin": "3TMCZ5AN8JM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/21/2019",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190546,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING THE CAR WHEN THE ENGINE IS COMPLETELY COLD AND SHIFTING MAINLY FROM 2ND AND UP, THE TRANSMISSION HESITATES WHEN GOING INTO GEAR. ONCE THE TRUCK IS WARMED UP TO NORMAL OPERATING TEMPS, IT DOESN'T DO IT ANYMORE",
        "vin": "3TMAZ5CN1JM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/21/2019",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190554,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN BRAKING, STARTING TO COME TO A STOP AND WHEN THE TRUCK DOWN SHIFTS JUST BEFORE 1ST, THERE IS A VIBRATION BEFORE IT FULLY STOPS.",
        "vin": "3TMAZ5CN1JM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/04/2019",
        "dateOfIncident": "01/05/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184026,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAND NEW TACOMA HAS A STICKING BRAKE PEDAL THAT STICKS IN THE PEDAL'S NEUTRAL POSITION. IT NEEDS MORE FORCE TO PRESS IT AT RANDOM TIMES. THIS ISSUE STOOD OUT WHILE I WAS DRIVING IN THE MOUNTAINS ON A DIRT ROAD AND CAME ACROSS SOME ICE. I JUST NEEDED TO APPLY MINIMAL PRESSURE ON THE BRAKES TO KEEP FROM SPEEDING UP AS I WAS GOING DOWNHILL OVER THE ICE. THERE WAS NO AREA TO TURN AROUND IN THIS LOCATION AND WOULD NOT BE ABLE TO MAKE IT BACK UP THE HILL DUE TO THE ICE. WHEN I DEPRESSED THE BRAKE PEDAL, IT STUCK AT FIRST THEN POPPED DOWNWARD MAKING ME APPLY MORE PRESSURE THAN I WANTED TO. THE BRAKES ENGAGED WITH MORE FORCE CAUSING ME TO NOT BE FULLY IN CONTROL AS I BEGAN TO SWERVE WITH THE BRAKES LOCKING UP PRIOR TO THE ABS KICKING IN (TIRES LOCK FOR THE ABS TO WORK). I'VE TAKEN THE VEHICLE TO THE DEALERSHIP 3 TIMES AND VOICED THE SAFETY CONCERN. THEY DID INSPECT IT, HOWEVER, I WAS TOLD EACH TIME THE VEHICLE FUNCTIONS AS IT SHOULD, PER MANUFACTURER SPECS. CASE FILED DIRECTLY WITH TOYOTA CORPORATE ALSO HAD NO RESOLUTION. ONE VISIT STATED ANOTHER VEHICLE ON THE LOT HAD THE SAME CONCERN.",
        "vin": "3TMCZ5AN1JM"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/28/2019",
        "dateOfIncident": "02/28/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183303,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION STICKS AT 3,500 RPM AT 50, FAILS TO PROPERLY SHIFT, HAS A DELAY WHEN TRYING TO ECELERATE, THEN A SURGE OF HORSE POWER AND STICKS AT HIGH RPM. IT SEEMS LIKE THE TIMING IS OFF ON AN AUTOMATIC. NOT EVEN 10,000 MILES ON MY TRUCK.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/27/2019",
        "dateOfIncident": "06/11/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180790,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 TOYOTA TACOMA. CONSUMER WRITES IN REGARD TO A MANUFACTURING DEFECT AND SAFETY HAZARD. CONSUMER STATES VEHICLE ENGINE NOT PROPERLY CIRCULATING OIL WHEN ASCENDING HILLS. *AS  *TR",
        "vin": "5TFCZ5AN9JX"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/23/2019",
        "dateOfIncident": "02/12/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182077,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN APPLYING BRAKES, BRAKE PEDAL WENT ALL THE WAY TO THE FLOOR. VEHICLE IS NOT EVEN 1 YEAR OLD YET AND BRAKES SHOULD NOT BE HAVING PROBLEMS.",
        "vin": "5TFSZ5AN2JX"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/10/2019",
        "dateOfIncident": "02/09/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11175974,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL GAUGE ON THE DASHBOARD ITS NOT READING CORRECTLY THE TANK AMOUNT OF FUEL. WHEN ITS FULL OF GASOLINE THE GAUGE ON THE DASHBOARD GAVE ME WRONG READINGS MARKING AS EMPTY OR 1/4 OF THE FUEL TANK.",
        "vin": "3TMDZ5BN5JM"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/04/2019",
        "dateOfIncident": "08/04/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174317,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE HAS A 5 TO 8 SECOND DELAY IN ENGINE RESPONSE THAT MAY CAUSE  A FATALITY. TOYOTA CORP HAS BEEN CONTACTED AND REFUSES TO DO ANYTHING ABOUT IT",
        "vin": "3TMBZ5DN7JM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/24/2019",
        "dateOfIncident": "01/23/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171806,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA TACOMA. WHILE THE CONTACT WAS ATTEMPTING TO PARK IN HIS GARAGE, THE BRAKES MALFUNCTIONED AND THE VEHICLE CRASHED INTO A WALL. THERE WERE NO INJURIES. THE MANUFACTURER WAS CONTACTED AND STATED THAT THE VEHICLE WAS NOT INCLUDED IN A RECALL AND PROVIDED A CASE NUMBER. THE CONTACT PLANNED TO HAVE THE VEHICLE TOWED TO CROWN TOYOTA OF LAWRENCE (3430 IOWA ST, LAWRENCE, KS 66046, (785) 843-7700) FOR DIAGNOSTIC TESTING. THE FAILURE MILEAGE WAS 4,500.",
        "vin": "3TMCZ5AN1JM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/21/2018",
        "dateOfIncident": "07/18/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162977,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "FOUND METAL SHAVINGS IN THE ENGINE WHEN CHECKING OIL LEVEL ON THE DIP STICK WHEN THE CAR ONLY HAD 1,000 MILES. THE NEXT DAY I WENT TO TELL THEM AND THEY SAID IT WAS NORMAL BUT I ASKED FOR AN OIL CHANGE AND ASKED FOR MY FILTER AND OIL BACK WHEN THEY WERE DONE. ON THE REPORT THEY GAVE ME THEY SAID THEY DID NOT FIND ANY METAL SHAVINGS BUT ON MY FILTER I FOUND MANY, I STILL HAVE THE FILTER AND OIL JUST INCASE I NEED PROOF. TILL THIS DAY I STILL CAN SEE METAL SHAVINGS WHICH WORRIES ME I FOUND THIS IN OTHER TACOMAS TOO AND I DONT KNOW WHY THEY ALWAYS SAY IT'S NORMAL WHEN IT'S NOT.",
        "vin": "3TMAZ5CN6JM"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/16/2018",
        "dateOfIncident": "12/15/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161776,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER SHIFTING INTO REVERSE FROM PARK AND START BACKING UP THERE IS A 'CLUNK' NOISE FROM UNDER THE THE VEHICLE AND 'CLUNK' HAPPENS AGAIN ONCE YOU BRAKE IN REVERSE. VEHICLE INCONSISTENTLY SHIFTS WHILE DRIVING AT NORMAL CITY SPEED LIMITS.",
        "vin": "3TMCZ5AN3JM"
    },
    {
        "components": "STEERING,POWER TRAIN,SEATS",
        "crash": false,
        "dateComplaintFiled": "12/03/2018",
        "dateOfIncident": "05/22/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11155811,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VIBRATION IN STEERING WHEEL AND SEAT WHEN DRIVING BETWEEN 10-30MPH AND BRAKING BETWEEN 10-30MPH. THIS IS A NEW 2018 TACOMA ACCESS CAB WITH ONLY 4000 MILES. TSB 0171 AND 0023 ADDRESS THE SAME PROBLEM????",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/02/2018",
        "dateOfIncident": "11/29/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11155497,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SURGES BETWEEN 40-50MPH, VEHICLE HE A 4 SOD AUTOMATIC WITH 2 ELECTRONIC OVERDRIVES, MONRONEY LABEL STATED 6SPD AUTOMATIC. VEHICLE STICKS IN IT LAST GEAR 4TH SOMETIMES LOCK IN 1ST OD RPMS ARE HIGH, MILEAGE IS 4 MPG LESS THAN LISTED. VEHICLE STUTTERS, DOESN'T ACCELERATE WELL WHEN TRANSMISSION LOCKS",
        "vin": "3TMAZ5CN3JM"
    },
    {
        "components": "STEERING,SUSPENSION,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/19/2018",
        "dateOfIncident": "11/17/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152625,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE NOT PAID ONE LONTH YET AND IT HAS 2000 MILES ON IT. WHILE DRIVING ON ROUGH OR SENI ROUGH ROAD THERE IS A NOISE IN THE FRONT SUSPENSION LIKE A RATTLE OF A CAN OR LOOS METAL PLATE. BROUGHT IT FOR WARRANTY CHECK AND THEY SAID IT IS THE BRAKE PADS BUT THIS NOISE KEEPS ON EVEN WHEN BRAKE IS PRESSED.",
        "vin": "5TFAZ5CN4JX"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/16/2018",
        "dateOfIncident": "11/13/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152028,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SAFETY ISSUE REGARDING THE TOYOTA TACOMA V6 WITH 6SPD AUTOMATIC. SLUGGISH FROM A STANDSTILL, IF STARTING FROM A COAST, THERE IS A DEALY UNTIL IT ACCELERATES, THE VEHICLE DOWNSHIFTS ABRUPTLY INTO 4TH GEAR IF A GUST OF WIND OR ANY INCLINE CROSSOVER, BRIDGE, OVERPASS OCCURS. THE VEHICLE WILL LOCK DOWNSHIFT TO 4TH RAMP UP RPM'S TO 3300 AND ABOVE, AFTER CRESTING THE 3300 RPMS STILL OCCURS, IT WILL EVENTUALLY UPSHIFT INTO 5TH GEAR, BUT WILL HOLD 5TH GEAR AT 55MPH AND ABOVE SOMETIMES INDEFINITELY, OTHER TIMES, FOR MILES THEN SHIFT INTO 6TH, ALL THE WHILE DRIVING ON A FLAT SURFACE. IT IS UNSAFE, CANNOT PROPERLY TOW ANYTHING, AND SUBSEQUENTLY, THE MPG'S ARE SUBSTANTIALLY LESS THAN POSTED DUE TO THE DEFECTS WITH THE TRANSMISSION. TOYOTA FORUMS ARE UP TO 145 PAGES OF UNHAPPY TACOMA OWNERS SUFFERING THE SAME ISSUES, WHILE TOYOTA TAKES THE STANCE IT IS NORMAL. THESE PROBLEMS OCCUR EVERY TIME I DRIVE ON THE HIGHWAY.",
        "vin": "3TMAZ5CN3JM"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/16/2018",
        "dateOfIncident": "10/13/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152067,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCELERATION DELAY/HESITATION, UNP? TRY TELLING A DRIVER WHAT TO DOREDICTABLE AND DANGEROUS COMPUTER TRANSMISSION COMBINATION.    I NOW HAVE JUST OVER 4000 MILES ON MY 2018 TOYOTA TACOMA OR 4X4 DCSB. PURCHASED IN JULY, GOT A SOFTWARE UPDATE IN AUGUST AT ABOUT 1100 MILES. WHILE THE THROTTLE RESPONSE IMPROVED POST UPDATE, THE HUNTING FOR GEARS AND WHAT GEAR DO I BELONG IN CONFUSION HAS NOT REALLY IMPROVED. I MIGHT HAVE BEEN ABLE TO LIVE WITH SOME OF THE GEAR HUNTING/CONFUSION, BUT THE ONE ISSUE THAT JUST KILLS ME EVERY TIME, IS A DELAY FROM PRESSING THE PEDAL UNTIL THE VEHICLE ACCELERATES WHEN I AM IN A COAST AT APPROXIMATELY 15-25MPH. I CAN LITERALLY PRESS THE PEDAL, COUNT 1, 2..AND THEN THE TRUCK REVS AGGRESSIVELY AND KICKS INTO GEAR AS IF IT'S NOW OVERCOMPENSATING FOR THE DELAY AS OPPOSED TO WHAT SHOULD HAVE JUST BEEN A GRADUAL INCREASE IN SPEED. THIS DOESN'T HAPPEN EVERY TIME, BUT IT HAPPENS OFTEN ENOUGH THAT IT IS AN OBVIOUS FLAW AND IT HAS NEVER IMPROVED POST UPDATE. AND ONCE AND JUST ONCE, I PRESSED THE PEDAL AND IT JUST DIDN'T REACT AT ALL, IT WAS JUST DEAD, THEN I RELEASED IT AND PRESSED AGAIN AND IT ACCELERATED. I HAVE NEVER IN MY ENTIRE 24 YEARS OF DRIVING EXPERIENCED A DEAD PEDAL UNTIL THIS BRAND NEW 2018 TACOMA.    THE UPDATE I AM REFERENCING FLASHES THE COMPUTER OF THE TRUCK AND THE SAME CALIBRATION ID WAS RELEASED TO COMBAT A NUMBER OF ISSUES KNOWN BY TOYOTA.  THE TOYOTA SERVICE BULLETIN ID'S FOR THIS UPDATE ARE 0062-18, 0058-18, 0125-18.",
        "vin": "3TMCZ5AN6JM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/06/2018",
        "dateOfIncident": "09/12/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11149582,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CROSSING STREET GOING STRAIGHT EASTBOUND ON GREEN LIGHT, ROAD CONSTRUCTION GOING ON. TRUCK STOPPED COMPLETELY ON MIDDLE OF ROAD, THINKING THERE WAS A CAR IN FRONT OF ME. NO VEHICLE IN FRONT JUST SHADOW OF THE BRIDGE, THAT MADE CAR STOP AUTOMATICALLY. BY THEN NORTH TRAFFIC STARTED MOVING GOT HIT. WERE IN A 5 VEHICLE ACCIDENT.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/06/2018",
        "dateOfIncident": "07/09/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11149646,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION LOCKS OUT IN 4TH GEAR, MID SPEED SURGE, SURGE AT IDLE WHEN TURNING THE WHEELS. CRUISE CONTROL DOESN'T FUNCTION IT WILL INCREASE RPM'S ON A FLAT ROAD.",
        "vin": "3TMAZ5CN3JM"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEAT BELTS,SEATS",
        "crash": false,
        "dateComplaintFiled": "10/15/2018",
        "dateOfIncident": "10/03/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11140422,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA HAS AN ISSUE WHERE THERE SERVICE TECHNITIANS, DEALERS AND CUSTOMER SERVICE REPRESENTATIVES CANNOT TELL THE DIFFERENCE BETWEEN NHTSA MANDATED SEAT BELT INDICATORS AND OPTIONAL INDICATORS.    I HAVE REPORTED AN ISSUE WHERE THE SEAT WILL NOT SLIDE CORRECTLY AND THAT THE SEAT BELT SENSOR AND OPTIONAL ALERT SYSTEM SEEMS TO BE MALFUNCTIONING.      THE OPTIONAL SEAT BELT INDICATOR MALFUNCTIONS AND CAUSES A PROLONGED AUDIO DISTRACTION TO THE DRIVER THAT INTERFERES WITH THE ROLL THAT OTHER SAFETY FEATURES SUCH AS REVERSE SENSORS, ETC. CANNOT BE DISTINGUISHED.    TOYOTA ALLOWS THE DEALER TO TURN OFF THE DISTRACTING OPTIONAL CHIMES, BUT THE DISCRETION IS LEFT TO THE DEALER AND NOT THE DRIVER WHICH POSES RISK TO PEDESTRIANS, DRIVERS AND PASSENGERS.    THE MAJOR PROBLEM IS THAT THE FAILURE TO UNDERSTAND THE DIFFERENCE BETWEEN THE MANDATORY ALERT SYSTEM AND THE OPTIONAL ALERT SYSTEM MEANS THAT DEALERS ARE IGNORING CUSTOMER REQUESTS TO MUTE THE OPTIONAL ALARM INCREASING THE RISK OF DISTRACTION TO AN UNACCEPTABLE LEVEL.",
        "vin": "3TMCZ5AN1JM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/11/2018",
        "dateOfIncident": "08/20/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139649,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA TACOMA. WHEN THE CONTACT ATTEMPTED TO DRIVE THE VEHICLE, THE GEAR SHIFTER KNOB BECAME LOOSE. THE VEHICLE WAS TAKEN TO STEWART TOYOTA (LOCATED AT 3400 I-145, CORSICANA, TX 75110, (903) 874-6556) AND REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 145.",
        "vin": "5TFAX5GN0JX"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/12/2018",
        "dateOfIncident": "07/14/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129173,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING WITH ALL TSS (TOYOTA SAFETY SENSE) SYSTEMS ENABLED (AS IS THE ONLY DEFAULT SETTING ON THIS TRUCK)  WITH THREE PASSENGERS (MY YOUNG FAMILY) AT ABOUT 50 MPH ON A SOMEWHAT CURVY MOUNTAIN ROAD.  THE TRUCK'S PCS (PRE COLLISION SYSTEM) SLAMMED ON MY BRAKES ERRONEOUSLY WHEN A CAR (NOT IN MY PATH OR LANE) ON A CURVE WAS SLOWING TO TURN OFF ONTO THE SHOULDER.  THE TRUCK DROPPED SPEED RAPIDLY AND UNEXPECTEDLY UNTIL I PRESSED THE ACCELERATOR HARD, AND COULD HAVE CAUSED A REAR END COLLISION HAD ANOTHER VEHICLE BEEN FOLLOWING ME.  THE TOYOTA PCS SYSTEM IS NOT READY TO BE USED SAFELY ON PUBLIC ROADS, AND NEEDS TO BE RECALLED OR DISABLED EASILY AS A DEFAULT SETTING BEFORE SOMEONE GETS INJURED OR KILLED!",
        "vin": "5TFCZ5AN0JX"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/07/2018",
        "dateOfIncident": "08/29/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128061,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN APPLYING THE BRAKES WHILE DRIVING THE VEHICLE AT ANY SPEED THE VEHICLE VIBRATES. WAS MADE AWARE THAT THE REAR AXLE WAS DEFECTIVE AND WAS RECALLED BY TOYOTA. TOYOTA IS AWARE OF THE SITUATION AND CONTINUES TO PUT THESE VEHICLES OUT IN PUBLIC WITH NO DISCLOSURE TO THE CONSUMER.",
        "vin": "3TMAZ5CN3JM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/04/2018",
        "dateOfIncident": "08/31/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11124349,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA TACOMA. WHILE DRIVING APPROXIMATELY 30 MPH AND ATTEMPTING TO STOP THE VEHICLE, THE BRAKE PEDAL EXTENDED TO THE FLOORBOARD WHEN IT WAS DEPRESSED AND THE STOPPING DISTANCE WAS EXTENDED. IN ADDITION, THE BRAKE SENSOR INDICATOR ILLUMINATED. THE VEHICLE WAS TOWED TO AUTOLAND TOYOTA (170 US 22, SPRINGFIELD, NJ 07081), BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 1,500.",
        "vin": "3TMGZ5AN4JM"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/23/2018",
        "dateOfIncident": "07/05/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112959,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2018 TOYOTA TACOMA HAS A PRE-COLLISION SYSTEM THAT DOES NOTHING MORE THAN BEEP LOUDLY AT THE DRIVER WHEN IT \"THINKS\" I NEED TO BRAKE.  IT IS OVERLY SENSITIVE AND SERVES AS A DANGEROUS DISTRACTION WHENEVER I AM IN HEAVY TRAFFIC.  AS AN EXAMPLE, ON TIGHT CITY ROADS WITH CARS PARKED ON BOTH SIDES IT DETECTS THE CARS ON BOTH SIDES AND CONSTANTLY GOES OFF.  IT DETECTS GUARDRAILS AND SIGNAGE ON CURVES.      I WAS TOLD BEFORE I BOUGHT IT THAT IT CAN BE SHUT OFF, BUT THAT WAS NOT REALLY TRUE.  IT CAN ONLY BE TURNED OFF FOR THE DURATION OF THE DRIVE.  IT RESETS TO ON AT FULL SENSITIVITY WHENEVER I RESTART THE TRUCK.  IT IS EXTREMELY UNSAFE, AS IT DISTRACTS ME IN TRAFFIC AND DRAWS MY ATTENTION AWAY FROM THE ROAD AND TO THE DASHBOARD EVERY TIME IT BEEPS. SO, I HAVE TO GO INTO THE DASH MENU AND SHUT IF OFF EVERY TIME I START THE CAR, OR I'M FORCED TO FIDDLE WITH IT ON THE FLY IN TRAFFIC.  IT IS UNCONSCIONABLE TO PUT SOMETHING LIKE THAT IN A VEHICLE AND NOT ALLOW THE DRIVER THE OPTION TO PERMANENTLY DISABLE IT.  I COMPLAINED TO TOYOTA (CASE#1807122684) AND TOLD THEM THAT THIS REPRESENTS A SERIOUS DEFECT/DESIGN FLAW AND THAT EVENTUALLY IT WAS GOING TO CAUSE ME OR SOMEONE ELSE TO GET IN AN ACCIDENT, AND THEY DIDN'T CARE.  THEY MAINTAIN THAT SOMEHOW CONSTANTLY DISTRACTING THE DRIVER IS A SAFETY FEATURE AND THAT THE TRUCK IS SUPPOSED TO DO THIS.      AS MORE OF THESE FEATURES BECOME STANDARD THE NTSB HAS TO REGULATE THEM AND FORCE MANUFACTURERS TO CONSIDER THAT NOT ALL DRIVERS ARE THE SAME.  THERE ARE PEOPLE THAT ARE VERY SENSITIVE TO BEEPS AND ALARMS AND THESE DEVICES ARE THE OPPOSITE OF HELPFUL IN THOSE CASES.  THEY ARE DANGEROUS.  MAYBE THIS \"FEATURE\" HELPS SOME DRIVERS, BUT TO ME IT IS AN ACCIDENT WAITING TO HAPPEN.  THERE NEEDS TO BE A WAY FOR THE DRIVER TO PERMANENTLY DISABLE THESE TYPES OF FEATURES AND MAINTAIN CONTROL OF THE VEHICLE",
        "vin": "5TFSZ5AN0JX"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/10/2018",
        "dateOfIncident": "05/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110480,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT TRUCK BRAND NEW. WITHIN A COUPLES OF WEEKS NOTICED RANDOM SHUDDERING VIBRATION WHEN DRIVING THE VEHICLE NOT AROUND 35-45 MPH. TOOK IT TO TOYOTA. THEY STATED THEY COULD NOT IMITATE THE ISSUE. SHUDDERING IS WORSE AND CONSISTENT AROUND 35-50 MPH. CURRENTLY AROUND 2000 MILES ON ODOMETER. SCHEDULED ANOTHER APPT WITH TOYOTA THIS WEEK.",
        "vin": "3TMAZ5CN9JM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/30/2018",
        "dateOfIncident": "06/28/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104866,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "AROUND 12:30PM ON 6/28 MY TOYOTA TACOMA 2018 VIN# [XXX] STARTED TO BLINK THE CHECK ENGINE LIGHT AND IT WAS FOLLOW BY THE ENGINE SHAKING AND NOT TAKING GEARS UP THEREFORE VERY SLOWLY ACCELERATING UP TO THE 40MPH. SEEING ALL THIS I DECIDED TO HEAD TO THE DEALERSHIP BIG HORN IN GLENWOOD SPRINGS, CO AT ABOUT 1:00PM FROM MY HOUSE IN BASALT, CO. BUT AS THE PROBLEM PERSISTED I HAD TO STOP IN EL JEBEL, CO AND CALL BOTH THE DEALER AND TOYOTA ROADSIDE ASSISTANCE. MY FIRST ATTEMPT TO RECEIVE SERVICE FROM BOB ADAMS TRUCKING RESULTED IN A TWO HOUR WASTE OF TIME, BY THEM CANCELING SERVICE AND SAYING IT WAS ME WHO CANCEL. BY THIS TIME I ALREADY SPOKE TO BOTH DAWN AT SERVICE AND GUEST RELATIONS.         3:30 HOURS HAVE PASSED BY AND HERE I AM STILL SITTING BY THE SIDE OF A DANGEROUS BUSY HIGHWAY STARVING AND THIRSTY IN A 95 DEGREES SUMMER DAY AND TOYOTA HAS NOT STILL DO THE BEST THEY CAN TO TAKE ME OUT OF THIS SITUATION. A BRAND NEW $38,000 TRUCK THAT I HAVEN?T EVEN MAKE THE FIRST PAYMENT IS STUCK IN THE ROAD. MY TRUST AND LOVE FOR THE BRAND AND ITS SERVICES HAS BEEN LOST. HOW CAN I TRUST TO DRIVE MY FAMILY SAFE THINKING IN THE BACK OF MY HEAD THAT THIS CAN POSSIBLY HAPPEN AGAIN?        VALLEY TOWING 24HR IS FINALLY HERE TO PICK UP THE TRUCK AT 4:30PM ALMOST 4 HOURS AFTER I MADE MY FIRST CALL TO TOYOTA ROADSIDE ASSISTANCE.    3 DAYS HAS PASSED BY AND THEY STILL HAVE THE TRUCK IN THE DEALER NOT KNOWING WHAT IS THE PROBLEM.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "3TMCZ5AN5JM"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/03/2018",
        "dateOfIncident": "04/19/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091524,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 TOYOTA TACOMA. WHILE DRIVING APPROXIMATELY 70 MPH, BOTH THE DRIVER AND PASSENGER SIDE REARVIEW MIRRORS FAILED TO REMAIN IN PLACE AND WOULD INDEPENDENTLY TURN INWARDS. THE VEHICLE WAS TAKEN TO CONICELLI TOYOTA OF SPRINGFIELD (860 BALTIMORE PIKE, SPRINGFIELD, PA 19064, (484) 479-2410), BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 2,800. *TT",
        "vin": "5TFCZ5AN8JX"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/08/2018",
        "dateOfIncident": "03/02/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11078250,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "A MONTH AFTER I LEASE THE VEHICLE THE CHECK ENGINE LIGHT CAME ON ONE DAY AFTER WORK.",
        "vin": "3TMAZ5CN1JM"
    }
]