[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/27/2022",
        "dateOfIncident": "01/27/2022",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449170,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "BEETLE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Driver and passenger windows go down all by themselves without the key even being in the ignition. Yes it is available to be fixed. My safety could be at risk if the window goes down and i'm not at home and some stranger lets themselves in my car and waits for my return. I've gone to break and i go out to my car and the window is half down. Dealership replaced something related to the windows unknown to exactly what. No bells or whistles its happened at least 6 times now once on the passenger side the rest on the drivers side. Started when it got really really cold out.",
        "vin": "3VW5DAAT1JM"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "10/08/2021",
        "dateOfIncident": "10/08/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436111,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "BEETLE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "At normal speeds driving down the road traction control will come on and break the vehicle and jerk the steering  Will.",
        "vin": "3VWJD7AT0JM"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/12/2021",
        "dateOfIncident": "09/10/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432645,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "BEETLE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 Beetle with 2.0 TSI. Vehicle is extremely well maintained and all work has been done by VW dealers. This is not our primary vehicle and, as a result, it only has about 8600 miles.  Stopped at a store for a few minutes. Vehicle would not restart. Many fault lights appeared on the dash (e.g., battery, check engine, EPC). Pushed vehicle into another area of the parking lot where there was more room in case it needed to be towed. Waited a few minutes and tried to restart. Vehicle sputtered and seemed to be running on only 1 or 2 cylinders for a few seconds. Gave it a little gas, all lights went off, full engine power resumed. Sat there a few minutes evaluating engine performance, everything seemed fine.  Decided to head to the dealership instead of going home. After about 2 miles engine stopped running. Many fault lights appeared including battery, EPC, check engine, and so many others I can’t even recall. Had almost no steering. Struggled to coast vehicle to shoulder. Weather was very hot and traffic was heavy, not a pleasant situation or place to get stranded. Waited a minute or two. Tried to restart. Vehicle coughed, sputtered, and shook like it was only running on 1 cylinder. Shut vehicle off and sat. Tried to restart 2 or 3 more times without success. On next attempt vehicle sputtered to life, lights went off, and full power resumed. Tested engine performance and it seemed fine. EPC light came on.  Still heading to the dealership. Got another 1.5 miles or so. EPC and check engine light came on. Another engine failure. Super heavy traffic on a 6-lane highway. Luckily I had enough speed to coast off the road and into a dirt parking lot. Many fault lights on the dash. Waited a few minutes. Tried to restart vehicle, no luck. Vehicle was towed to closest VW dealership.   Absolutely terrifying and horrific 3 hours.",
        "vin": "3VW5DAAT5JM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/20/2021",
        "dateOfIncident": "06/02/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421571,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "BEETLE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "Center dash screen goes black occasionally which prevents using the backup camera, radio, and phone. Sometimes it will reboot by itself after several minutes, other times I have to shut the car off, wait, and restart the car. It doesn’t always reboot the first time.  This has happened at least 6 times.",
        "vin": "3VWSD7AT7JM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/03/2021",
        "dateOfIncident": "03/02/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398926,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "BEETLE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 VOLKSWAGEN BEETLE. THE CONTACT STATED THAT THE DRIVER'S AND PASSENGER'S SIDE WINDOWS WOULD LOWER AND RAISE INDEPENDENTLY, AND WITHOUT WARNING. THE CONTACT STATED THAT THE EPC WARNING LIGHT WAS ILLUMINATED AND THE VEHICLE LOSS POWER WHEN LIGHT ILLUMINATED. THE VEHICLE WAS NOT TAKEN TO A DEALER OR INDEPENDENT MECHANIC TO BE DIAGNOSED. THE MANUFACTURER WAS NOT INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 38,000.",
        "vin": "3VWFD7AT8JM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/04/2020",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297097,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "BEETLE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SIDE WINDOW IS DEFECTIVE. THE WINDOW SHUTTERS UP & DOWN ALL BY ITSELF, BOTH IN PARK, AND WHILE DRIVING. WHEN IT DOES THIS, I CAN'T SHUT THE WINDOW USING THE WINDOW UP & DOWN BUTTON. THE WINDOW GOES DOWN 1/2 WHILE DRIVING AND THEN LOCKS. I HAD IT TO TYNANS DEALERSHIP IN AURORA CO 3 TIMES NOW. THEY REPLACED THE LOCKING MECHANISM BACK IN OCT. IT HELPED FOR ABOUT A MONTH. NOW IT IS DOING IT AGAIN. THERE ARE TIMES I HAVE GONE INTO THE STORE, CAME BACK OUT, AND MY WINDOW WAS DOWN 1/2 WAY - AND I NEVER ROLLED IT DOWN! I NEVER LEAVE MY WINDOWS DOWN WHILE AWAY FROM THE CAR.  I WISH I COULD ATTACH VIDEO - HERE IS THE YOUTUBE LINK:     HTTPS://WWW.YOUTUBE.COM/WATCH?V=_Q6OWMB_F5I",
        "vin": "3VWSD7AT4JM"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/30/2019",
        "dateOfIncident": "09/12/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258975,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "BEETLE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WINDOW KEEPS SHUTTERING UP & DOWN AFTER GETTING IN THE CAR AND SHUTTING THE DOOR WITH IGNITION ON.. THE WINDOW DOESN'T CLOSE ALL THE WAY, AND THE AUTO DOOR LOCK DOESN'T WORK. THE WINDOW SHUTTERS UP & DOWN ALL ON ITS OWN. BROUGHT CAR TO DEALERSHIP THEY REPLACED THE DOOR LOCK. THIS STILL DID NOT FIX THE PROBLEM. I HAVE A VIDEO SHOWING THE ISSUE AFTER THE DOOR LOCK WAS REPLACED.",
        "vin": "3VWSD7AT4JM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/16/2018",
        "dateOfIncident": "08/15/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129732,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "BEETLE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE PURCHASING MORE THAN 7 MONTHS AGO, VEHICLE'S BLIND SPOT MONITORING SYSTEM FAILS TO RECOGNIZE APPROACHING VEHICLES AND DOES NOT HAVE AN AUDIBLE ALERT INSIDE THE VEHICLE MAKING IT NEARLY UNUSABLE AND UNSAFE. REAR-CROSS TRAFFIC ALERT SYSTEM GOES CRAZY (INCESSANT BEEPING) AND UNEXPECTEDLY WHEN VEHICLE IS SHIFTED INTO REVERSE. EVEN IF THERE ARE NO VEHICLES AROUND AND THERE IS NOTHING SURROUNDING THE VEHICLE THE SYSTEM WILL GO OFF AND BEEP FRANTICALLY. REAR-CROSS TRAFFIC ALERT FREQUENTLY WILL NOT IDENTIFY OR WARN OF VEHICLES PASSING BEHIND, SUCH AS WHEN TRYING TO BACK OUT OF A PARKING SPACE. VEHICLE'S IN-DASH DISPLAY WILL PERIODICALLY GO BLACK WHEN VEHICLE IS STARTED. VEHICLE'S RADIO SYSTEM WILL DISPLAY RANDOM CHARACTERS FOR THE SONG OR ARTIST, OR DISPLAY THE SAME SONG AND ARTIST FOR 10 MINUTES OR LONGER EVEN THOUGH THE SONG, ARTIST, OR STATIONS HAVE CHANGED. VEHICLE HAS BEEN TAKEN TO THE DEALER MULTIPLE TIMES WITHOUT SUCCESS. VW CORPORATE WAS CONTACTED AND RESPONDED QUICKLY AND WITH CONCERN, BUT DEALER WAS STILL UNABLE TO RESOLVE THE ISSUES.",
        "vin": "3VW5DAAT5JM"
    }
]