[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/08/2022",
        "dateOfIncident": "03/08/2022",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455718,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact leased a 2019 Audi A3. The contact received notification of NHTSA Campaign Number: 21V198000 (Air Bags) however, the part to do the recall repair was not yet available. The local dealer was contacted. Additionally, the contact called a second dealer, Audi Pembroke Pines (15000 Sheridan St, Pembroke Pines, FL 33331) and a third dealer, The Collection  Audi (200 Bird Rd, Coral Gables, FL 33146) who also confirmed that  the part to do the recall repair was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue and informed the contact that they would follow up with her. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "WAUAUGFF5KA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/13/2022",
        "dateOfIncident": "03/22/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447339,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Audi A3. The contact received notification of NHTSA Campaign Number:  21V198000 (Air Bags) however, the part to do the recall repair was unavailable. The contact stated that the dealer confirmed that only five parts were received per week. The contact was informed that she could not be added to the waiting list. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue but was unable to confirm when parts would be available. The contact stated that the air bag warning light was illuminated indicating that the passenger’s side air bag had failed. Additionally, the sensors had started to malfunction. The approximate failure mileage was 40,000. Parts distribution disconnect.",
        "vin": "wauaugff5k1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/28/2021",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434696,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact leased a 2019 Audi A3. The contact stated that the passenger’s side air bag warning light had failed to operate as needed. The contact then received a notification for NHTSA Campaign Number: 21V198000 (Air Bags) however, the part for the recall repair was unavailable. The dealer had been notified about the recall and confirmed that the parts were not yet available. The manufacturer had been notified of the recall. The contact stated that the manufacturer had exceeded a reasonable amount of time for the repair. The failure mileage was unknown. VIN tool confirms parts are not available.",
        "vin": "wauaugffxk1"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "05/11/2021",
        "dateOfIncident": "05/09/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416083,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY CAR WITH MY FRIEND IN THE PASSENGER SEAT. ALL OF A SUDDEN CAR STARTED MADE A BEEPING SOUND AND MY DASHBOARD SAID SOMETHING ABOUT SAFETY FEATURE BEING TURNED OFF/LIMITED. ALSO THE PASSENGER AIRBAG OFF LIGHT TURNED ON EVEN WHEN THE PASSENGER SEAT WAS OCCUPIED. THE VEHICLE WAS ALREADY IN MOTION. THIS CREATED AN UNSAFE SITUATION AS PASSENGER AIRBAG WAS OFF  WHEN IT SHOULD NOT HAVE BEEN. THE PASSENGER OCCUPANT DETECTION SYSTEM (PODS) DETECTED A MALFUNCTION AND SWITCH OFF THE PASSENGER AIRBAG EVEN THOUGH THE SEAT WAS BE OCCUPIED. I REACHED OUT TO AUDI REGARDING THIS AND THEY SAID THAT SINCE THE REPAIR IS NOT AVAILABLE YET I WILL HAVE TO WAIT. THE NHTSA RECALL NUMBER FOR THIS ISSUE IS 21V198. THE MANUFACTURER RECALL NUMBER IS 69BY. I HAVE ATTACHED THE LATEST VIDEO OF THIS SITUATION. IF YOU LOOK AT THE VIDEO IT SHOWS THAT THE PASSENGER SEAT IS OCCUPIED AND STILL THE PASSENGER AIRBAG OFF LIGHT IS ON. THIS IS THE 3RD OCCURRENCE OF THIS ISSUE. I USE MY CAR DAILY AND SINCE THE REPAIR IS NOT AVAILABLE YET THIS MAKES MY CAR UNSAFE ON THE ROAD.",
        "vin": "WAUAUGFF7KA"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/02/2021",
        "dateOfIncident": "03/02/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398794,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2019 AUDI A3 ON JANUARY 18, 2021 (VIN [XXX]) FROM AUDI DENVER. I REPLACED THE WINDSHIELD 2/19/2021, WAS TOLD THE WINDSHIELD HAD BEEN REPLACED AT LEAST ONCE BEFORE (2/2020 AT THE DEALERSHIP) AND 2 WEEKS AFTER REPLACING THE WINDSHIELD, HAVE A NEW CRACK THAT IS QUICKLY SPREADING. 4 UNREPAIRABLE WINDSHIELDS WITH ONLY 11K MILES ON THE VEHICLE?      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "WAUJEGFF3KA"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/09/2020",
        "dateOfIncident": "06/06/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327937,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON NJ TURNPIKE ON A 75 MILE TRIP BACK HOME AND AFTER INTO 55 MILES OF THE TRIP, THE VEHICLE COMPLETELY LOST POWER..  I WAS GOING ABOUT 65 MILES OR SO AND IT WAS EXTREMELY SCARY AND DANGEROUS.  WITH THE GRACE OF GOD, I WAS ABLE TO USE THE MOMENTUM TO MAKE IT TO A SIDE LANE BETWEEN THE TRAVEL LANES AND MERGE LANE OFF OF THE RAMP, THE ARE CAR LOST SO MUCH POWER AND TRYING TO  MANEUVERING AROUND  TRAFFIC  THAT  I WAS NOT EVEN ABLE TO MAKE IT TO THE SAFETY SIDE LANE.  THE CAR  HAS TO BE TOWED TO THE EXIT.   AUDI TOOK IT TO THEIR LOCAL  DEALER.  THE CAR IS A 2019 MODEL WITH 12946 MILES ON THE ODOMETER.  THE VEHICLE WAS TOWED TO AUDI DEALER IN FREEHOLD NJ AND I UNDERSTAND FROM THE TOW DRIVER THAT DAY BEFORE SAME MAKE AND MODEL, YEAR OF ANOTHER SIMILAR VEHICLE WITH THE EXACT SAME PROBLEM HAS BEEN TOWED TO AUDI IN EDISON NJ.  *TR",
        "vin": "WAUJEGFF2K1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/28/2019",
        "dateOfIncident": "06/19/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11251937,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2019 AUDI A3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V474000 (AIR BAGS). THE CONTACT CALLED AN UNKNOWN DEALER AND WAS INFORMED THAT THE PART WAS NOT AVAILABLE. THE MANUFACTURER WAS CONTACTED AND DID NOT KNOW WHEN THE PART WOULD BE AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WAUBEGFF3K1"
    }
]