[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/20/2021",
        "dateOfIncident": "10/19/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437536,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving on the highway at 60mph, my sunroof exploded very unexpectedly and very loudly. It shattered along the front and sides but not anywhere at the center. Sunroof was closed and had only been used 1 time in the month I had the vehicle. Nothing hit me as no vehicles were anywhere near.    The dealership managment is saying it had to be caused externally yet their own technicians said it was defective.",
        "vin": "Zaspakbn5k7"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/22/2021",
        "dateOfIncident": "01/30/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397289,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 ALFA ROMEO STELVIO. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THE VEHICLE HAD AN OIL CHANGE. AFTER LEAVING THE INDEPENDENT MECHANIC, THE CONTACT WAS DRIVING AT 65 MPH APPROACHING AN INTERSECTION, THE ANI-COLLISION WARNING LIGHT ILLUMINATED. THE CONTACT APPLIED THE BRAKE PEDAL WHICH FAILED TO OPERATE CORRECTLY AND BECAME DIFFICULT TO DEPRESS CAUSING THE CONTACT TO CRASH INTO THE VEHICLE LOCATED IN FRONT OF HER VEHICLE. NO AIR BAGS DEPLOYED. NO INJURIES SUSTAINED. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO A COLLISION SHOP AS THE VEHICLE WAS ASSISTED FOR DAMAGES WITH THE CONTACT INSURANCE COMPANY. TO VEHICLE THEN WAS TOWED TO HER RESIDENTS AND THEN TOWED AGAIN TO ALFA ROMEO OF WESTBURY 928 JERICHO TPKE, WESTBURY, NY 11590 (888) 411-8719 WHERE IT WAS AWAITING REPAIR OPTIONS. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND STARTED AN INVESTIGATION HOWEVER WAS UNABLE TO DUPLICATE THE CAUSE OF FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 6,300.*LN*JB",
        "vin": "ZASPAKBN8K7"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/30/2020",
        "dateOfIncident": "06/21/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331758,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY CAR IN JAN. 2020.  ON JUNE 21, 2020, I AWOKE TO MY ALARM GOING OFF.  I TRIED TO USE MY KEY FOB TO TURN THAT ALARM OFF AND IT DID. NOT WORK.  THE ALARM STOPPED AND I HAD TO USE THE HARD KEY TO ENTER MY CAR.  THE CAR WOULD NOT START AND I HAD TO GET A JUMP FROM AAA.  THE CAR WAS NEW WITH LESS THAN 3000 MILES ON IT.  I TOOK IT TO THE DEALER TO FOR A DIAGNOSTIC AND THEY KEPT IT FOR 5 DAYS.  THEY HAD TO REPLACE THE BCM.  THE BCM WAS LISTED AS PROBLEM IN PRIOR YEAR VERSIONS OF THIS VEHICLE.  THIS APPEARS TO BE A CONTINUING PROBLEM WITH THIS VEHICLE.  THE VEHICLE WAS PARKED AND WAS NOT BEING DISTURBED WHEN THE ALARM WENT OFF.",
        "vin": "ZASPAKBN0K7"
    },
    {
        "components": "STEERING,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/08/2020",
        "dateOfIncident": "04/07/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320525,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A HIGHWAY AROUND 3 AM IN DARK ENVIRONMENT, GOING AT 63MPH, THE VEHICLE COMPLETELY SHUT OFF IN LESS THAN 1 SECOND WITH NO WARNING AT ALL. BRAKES FAILED, STEERING FAILED, ENGINE SHUT OFF, ALL GAUGES INCLUDING SPEEDOMETER AND TACHOMETER STOPPED FUNCTIONING, ALL ELECTRICAL RELATED FUNCTIONS FAILED, HEADLIGHT AND TAILLIGHT SHUT OFF, UNABLE TO TURN ON HAZARD LIGHT. RIGHT AFTER THE COMPLETE FAILURE, I TRIED TO RESTART THE VEHICLE ON THE HIGHWAY WHILE STILL IN MOTION BUT THE VEHICLE WAS COMPLETELY UNRESPONSIVE. THE VEHICLE IS BARELY STEERABLE WITH THE STEERING ASSIST FAIL AND HAD TO SWITCH FROM THE LEFT LANE TO THE RIGHT LANE WITH NO TURN SIGNALS ON, AND HAD TO COAST TO A HIGHWAY EXIT BECAUSE OF THE BRAKES AND ENGINE FAILURE. AFTER STOPPING AT THE EXIT, I WAS UNABLE TO TURN ON THE HAZARDS LIGHT AND ALL DOORS ARE LOCKED EXCEPT THE DRIVER SIDE DOOR, THEN I CALLED ROADSIDE ASSIST FOR HELP, THE VEHICLE WAS THEN TOWED AWAY.",
        "vin": "ZASPAKBN8K7"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "05/20/2019",
        "dateOfIncident": "04/23/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11208662,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2019 ALFA ROMEO STELIO. THE CONTACT RECEIVED NOTIFICATION OF THE NHTSA CAMPAIGN NUMBER: 19V148000 (FORWARD COLLISION AVOIDANCE, SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER FERRARI AND MASERATI (525 SOUTH LAKE DESTINY DRIVE, ORLANDO, FL 32810 (407)-667-43000) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE. THE CONTACT HAD EXPERIENCED A FAILURE. THE CONTACT STATED THAT WHILE DRIVING AT 45 MPH, THE BRAKE PEDAL WAS DEPRESSED BUT FAILED TO ENGAGE CAUSING THE FRONT OF THE VEHICLE TO CRASH INTO ANOTHER VEHICLE WITHOUT WARNING. THE AIR BAGS DEPLOYED. A POLICE REPORT WAS FILED. THE CONTACT HAD A MINOR INJURY TO HIS RIGHT SHOULDER BUT MEDICAL ATTENTION WAS NOT SOUGHT. THE OTHER DRIVER OF THE VEHICLE SUSTAINED UNKNOWN INJURIES AND IT WAS UNKNOWN IF MEDICAL ATTENTION WAS REQUIRED. THE VEHICLE WAS TOTALED AND TOWED ON THREE OCCASIONS TO 2 COLLISION CENTERS AND A SALVAGE LOT. THE SAME DEALER WAS CONTACTED ABOUT THE RECALL PARTS THAT WERE NOT AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND OPENED AN INVESTIGATION WITH CASE NUMBER 58350517. THE FAILURE MILEAGE WAS 3,000. THE PARTS DISTRIBUTION DISCONNECTED.",
        "vin": "ZASPAKBN9K7"
    }
]