[
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": true,
        "dateComplaintFiled": "11/26/2019",
        "dateOfIncident": "11/21/2019",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282538,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "VIEW",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THE MAIN WIRE HARNESS GOING TO THE ENGINE RUNS ALONG THE FIREWALL BEHIND THE WINDOW WIPER MOTOR AND IT WAS RUBBING AGAINST IT CAUSING IT TO CUT THROUGH THE HARNESS COVERING AND IT SHORTED OUT THE WIRING TO THE RIGHT CYLINDER BAND. THE ENGINE SHUT OFF IN THE MIDDLE OF THE HIGHWAY WITH NO WARNING. THIS HAPPENED SEVERAL TIMES WHILE WE TRIED TO GET THE VEHICLE OUT OF THE ROAD TO SAFETY AND WE WERE INVOLVED IN A MINOR ACCIDENT, FORTUNATELY NO ONE WAS HURT. THE MECHANIC FOUND THE PROBLEM AFTER BEING TOLD TO CHECK THE HARNESS AS THIS IS A COMMON ISSUE. THE CAMPER ONLY HAS APPROXIMATELY 3000 MILES. I FEEL THIS IS AN EXTREMELY DANGEROUS SITUATION AND COULD CAUSE A SERIOUS ACCIDENT IF IT WERE TO OCCUR UNDER DIFFERENT CONDITIONS.",
        "vin": "WDAPF4CC9H9"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/27/2018",
        "dateOfIncident": "07/17/2018",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122749,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "VIEW",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "THREE OF THE ORIGINAL WHEELS IN MY 2017 MERCEDES SPRINTER BASED 2018 WINNEBAGO MOTORHOME HAVE FAILED DUE TO AIR LEAKING FROM NEAR THE WELDED PORTION OF THE STEEL RIMS.  TWO OF THESE WHEELS HAVE BEEN REPLACED, ONE BY MERCEDES AND ONE BY WINNEBAGO.  SEE DOCUMENTATION.        ON 07-17-18, TIRE PRESSURE IN THE INNER REAR WHEEL, DRIVER SIDE WAS 30 PSI. FILLED THE TIRE AND DROVE 120 MILES HOME. (3191 MILES)    ON 07-18-18 I TOOK THE RV TO LES SCHWAB TIRE CENTER IN HAMILTON, MT.  AFTER SUBMERGING THE WHEEL, THEY DETERMINED THAT THE AIR WAS LEAKING FROM THE WELDED JOINT IN THE WHEEL.     ON 07-25-18,  I TOOK THE WHEEL TO DEMAROIS MERCEDES-BENZ IN MISSOULA, MT FOR EVALUATION OF THE WHEEL.  THE DEALER FOUND A CRACKED WELD ON THE WHEEL THAT CAUSED THE AIR LEAK.  ON 08-01-18, THE MERCEDES-BENZ DEALER REPLACED THE WHEEL AT NO CHARGE. (WHEEL #1)    ON 08-13-18, IN APPLE VALLEY, MN, THE PASSENGER SIDE INNER REAR TIRE PRESSURE WAS 30 PSI.   (5744 MILES)    ON 08-14-18 AT THE WINNEBAGO PLANT, THEIR TIRE TECH INSPECTED THE WHEEL AND FOUND A LEAK AT THE WELD IN THE WHEEL (SAME AS WHEEL #1)  WINNEBAGO REPLACED THE WHEEL AT NO CHARGE.  (WHEEL #2)    ON 08-16-18, AT CHAMBERLAIN SD, THE AIR PRESSURE IN THE OUTER REAR PASSENGER SIDE TIRE WAS 25 PSI.  WHEN THE WHEEL WAS SUBMERGED, AIR BUBBLES CAME FROM THE SEAM NEAR THE WELDS.  I HAD A TUBE PUT IN THE TIRE.  (WHEEL #3)  6113 MILES.    I NOTICED EACH WHEEL FAILURE WHEN CHECKING TIRE PRESSURES BEFORE DRIVING EACH MORNING.   ((NOTE:  YOUR FORM DID NOT PERMIT ME TO UPLOAD TWO DOCUMENTS SO I SENT THE ONE FROM MERCEDES-BENZ DEALER THAT FIRST DISCOVERED CRACKED WELDS.  ANOTHER FORM FROM WINNEBAGO CONFIRMED THE PROBLEM ON THE SECOND WHEEL.",
        "vin": "WDAPF4CC1H9"
    },
    {
        "components": "EQUIPMENT,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/17/2018",
        "dateOfIncident": "01/22/2018",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11088710,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "VIEW",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2018 WINNEBAGO VIEW EQUIPPED WITH A KIDDE FIRE EXTINGUISHER, MODEL NUMBER: H110G. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V782000 (EQUIPMENT) AND CONTACTED THE WINNEBAGO MANUFACTURER AT 641-585-3535 ON FEBRUARY 6, 2018. THE RV MANUFACTURER REFERRED THE CONTACT TO THE KIDDE MANUFACTURER. THE KIDDE MANUFACTURER WAS CONTACTED AT 7-855-262-3540 AND INFORMED THE CONTACT THAT THEY WOULD MAIL A REPLACEMENT FIRE EXTINGUISHER WITHIN TWO WEEKS. THE CONTACT STATED THAT SHE WAITED THIRTY DAYS, BUT HAD NOT RECEIVED THE REPLACEMENT FIRE EXTINGUISHER. THE KIDDE MANUFACTURER WAS CALLED BACK AND INFORMED THE CONTACT THAT THEY HAD THE WRONG MAILING ADDRESS FOR HER. THE ADDRESS WAS CORRECTED AND VERIFIED BY THE CONTACT. THE CONTACT WAS INFORMED THAT THE REPLACEMENT FIRE EXTINGUISHER WOULD BE MAILED TO HER ON MARCH 5, 2018. THE CONTACT STILL HAD NOT RECEIVED THE NEW FIRE EXTINGUISHER. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPLACEMENT PART. A LOCAL WINNEBAGO DEALER WAS NOT CONTACTED. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "8BNPF4CC6GE"
    }
]