[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/19/2022",
        "dateOfIncident": "01/12/2022",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448127,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I received a yellow alert that the auto start/stop was malfunctioning. I continued to drive 8 miles until another message was displayed on the instrument panel that stated: \"electrical system malfunction\" with a yellow battery icon. A few seconds later the same \"electrical system malfunction\" with a red battery icon appeared. I then had numerous failure warnings on other car systems such as driver assistance sensors and steering; the display screens started to flash on and off. I slowly guided the car to a complete stop and called Audi Roadside Assistance for towing to my local Audi dealer.",
        "vin": "WAUL2AF25KN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/10/2021",
        "dateOfIncident": "11/04/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439956,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving on highway, had complete electrical system failure. Received red message that said “electrical system malfunction”. Car went totally black and completely shut down within 2 minutes. I had to navigate 3 lanes to pull over with completely black cockpit after car shut down. Audi service says it’s the “starter generator”. Service said there is a chance of fire with moisture ingress in the starter generator. Apparently it’s a known issue with over 60 units on back order from their supplier Continental (no promise date available). Concerned this is a serious safety issue and will cause somebody to have a crash due to car shutting down and potential for electrical fire.",
        "vin": "WAUL2AF20KN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/28/2021",
        "dateOfIncident": "10/25/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438559,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving on highway. There was a message \"Electric system malfunction\" with a yellow battery icon. A few seconds late the same message \" electic system malfunction\" with a red battery icon then the vehicle completely stoped on the highway .",
        "vin": "WAUM2AF24KN"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/02/2021",
        "dateOfIncident": "08/28/2021",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431540,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I was slowing down to stop at a traffic light when a message was displayed on the instrument panel that says \"Electrical System Malfunction\" with a yellow battery icon. A few seconds later the same \"Electrical System Malfunction\" with a red battery icon. Then the vehicle came to a complete stop and was inoperable. There was almo smoke coming from the hood near the positive battery terminal. The smoke had an electrical smell to it. I had no opportunity to pull over and was stuck in the middle of a very busy road right at the stop line of the traffic light. My family and I had to exit the vehicle with traffic on both sides of us and get to the side of the road safely. There was no prior indication that there was a problem, this happened all within about 5-10 seconds and I had no time to try and pull over to safety.  I have found other complaints about this vehicle that are similar (see under the reliability section on Consumer Reports). The dealer identified the issue as an \"internal failure\" of the generator and 48v battery system, but had no explanation as to why it happened nor can they guarantee it will not happen again.",
        "vin": "WAUM2AF28KN"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/07/2021",
        "dateOfIncident": "03/02/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406975,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I PARK MY CAR FOR HOURS AND TRY TO DRIVE AGAIN, I GET VERY LOUD NOISE EVERY TIME I BRAKE. AND AFTER 2-3MINUTES LATER NOISE IS GONE. (DAYTIME AND NIGHT TIME)  WHEN I GO TO AUDI SERVICE . THEY TOLD ME ITS NORMAL . BUT I NEVER THIS HAPPEND BEFORE.   I'M ASHAMED THAT PEOPLE LOOK AT ME WHENEVER I HEAR THIS SOUND. EVEN CARS THAT ARE MORE THAN 10 YEARS OLD DON'T SOUND LIKE THIS, BUT I'VE HAD THIS PHENOMENON NOT LONG AFTER I BOUGHT IT.",
        "vin": "WAUD8AF21KN"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/23/2021",
        "dateOfIncident": "02/21/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397561,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SUNDAY FEBRUARY 21, 2021 AT ABOUT 330PM ON RT 30 IN AMSTERDAM NY WE WERE DRIVING IN STOP AND GO TRAFFIC LESS THAN 30MPH. AS THE CAR IN FRONT OF ME STARTED TO SLOW IN TRAFFIC I STARTED TO BRAKE MY A6, AT ABOUT 20MPH AND ABOUT 1.5 CAR LENGTHS BEHIND THE CAR IN FRONT OF ME THE AUDI PRESENSE COLLISION WARNING SCREEN ACTIVATED WITH A RED SCREEN IN THE DRIVER'S CLUSTER AND A \"CHIME\" THE CAR THEN WENT INTO EMERGENCY COLLISION STOPPING MODE...CAR'S ANTILOCK BRAKES ACTIVATED BRINGING MY CAR TO A COMPLETE STOP IN TRAFFIC. TRAFFIC IN FRONT OF ME NEVER STOPPED AND I WAS AT A DISTANCE THAT I HAD COMPLETE CONTROL OF MY CAR WITH MORE THAN ENOUGH DISTANCE TO SLOW OR STOP MY CAR SAFELY. THE CAR BEHIND ME CAME WITHIN INCHES OF REAR ENDING MY CAR. I'M SPECULATING THAT THE DRIVER BEHIND ME DID NOT EXPECT ME TO STOP DEAD IN TRAFFIC ANYMORE THAN I DID. TRAFFIC CONDITIONS AND DISTANCE DID NOT WARRANT THE PRESENSE TO WARN AT ALL LET ALONE ACTIVATE THE EMERGENCY COLLISION RESPONSE BRAKING. THIS IS THE THIRD MALFUNCTION OF SAFETY SYSTEMS I HAVE REPORTED TO NHTSA RE: MALFUNCTIONS OF ADVANCED SAFETY SYSTEMS. AUDI USA IS UNRESPONSIVE.",
        "vin": "WAUE8AF28KN"
    },
    {
        "components": "LANE DEPARTURE,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/10/2021",
        "dateOfIncident": "08/25/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395583,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AUGUST 25, 2020 TRAVELING WB ON I-90 [MASS TURNPIKE] PASSING AND 18 WHEEL TRACTOR TRAILER WITH AN UNMARKED WHITE BOX TRAILER. TRUCK 'WEAVED' TO THE LEFT INTO MY DRIVING LANE AS I WAS OVERTAKING IT. I SWERVED TO THE LEFT TO AVOID CONTACT OF MY 2019 AUDI A6 PREMIUM PLUS AT ABOUT THE A PILLAR AND THE REAR WHEEL AREA OF THE BOX TRAILER. IN MY EVASIVE ACTION THE CAR'S LANE KEEPING ASSISTANT ACTIVATED AS I WAS ABOUT TO CROSS THE LINES ON MY LEFT SIDE TO AVOID THE TRUCK, THE CAR TOOK CONTROL OF THE STEERING AND AGGRESSIVELY STEERING THE CAR BACK AT THE TRACTOR TRAILER. I BRAKED THE CAR AS HARD I COULD TO AVOID COLLISION WITH THE BOX TRAILER. NONE OF THE COLLISION WARNING SYSTEM ACTIVATED AND THE CAR'S SENSORS AND CAMERAS DID NOT RECOGNIZE THAT I WAS TRYING TO AVOID A HIGH SPEED COLLISION WITH THE TRACTOR TRAILER. I BROUGHT THE CAR TO THE DEALERSHIP [AUDI ALBANY, LATHAM NY] AFTER RETURN FROM MY TRIP TO HAVE SAFETY SYSTEMS CHECKED. NO FAULT CODES WERE DETECTED.",
        "vin": "WAUE8AF28KN"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/26/2020",
        "dateOfIncident": "04/09/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351469,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE SUFFERS FROM A SOMETIMES DANGEROUS ACCELERATION LAG. THE TIME IT TAKE BETWEEN PRESSING THE GAS PEDAL AND THE TIME THE CAR STARTS TO MOVE IS EXCESSIVE AND IN CERTAIN SITUATIONS, DANGEROUS.    IT'S ESPECIALLY EVIDENT IN CONDITIONS WHERE YOU'RE TRYING TO ACCELERATE FROM A LOW RPM SPEED (SLOW TRAFFIC, \"CALIFORNIA\" STOP, ETC) TO JOIN FASTER TRAFFIC OR MERGE IN. A PERFECT EXAMPLE IS TRYING TO GO FROM A SLOW MOVING HIGHWAY LANE TO A FASTER ONE. YOU PICK YOUR SPOT, THEN GO FOR IT. THE CAR SITS FOR 1-2 SECONDS...THEN IT GOES. THE FIRST FEW TIMES IT HAPPENED IT WAS DANGEROUS. I HAVE HAD TO ADJUST MY DRIVING TO MAKE SURE I DO NOT END UP IN A SITUATION WHERE A STANDARD THROTTLE RESPONSE WOULD BE REQUIRED.    ADDITIONAL EXAMPLES OF CIRCUMSTANCES WHERE THE LAG CAN CAUSE THE DRIVER TO INADVERTENTLY ENTER INTO AN UNSAFE SITUATION:  -TURNING LEFT ACROSS TRAFFIC  - IN-TOWN MERGE OR LANE CHANGE  - TURNING RIGHT TO JOIN FASTER TRAFFIC",
        "vin": "WAUM2AF27KN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/20/2020",
        "dateOfIncident": "07/23/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350427,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS A LANE KEEPING ASSISTANT WHICH IS AGGRESSIVE. CAR DOESN'T ALLOW YOU TO PASS PARKED VEHICLE SUCH AS A UPS DELIVERY TRUCK, PEDESTRIANS OR BICYCLISTS WITHOUT TRYING TO STEER YOU BACK TOWARD THE OBJECT, VEHICLE OR BICYCLIST YOU'RE TRYING TO PASS BY PULLING TO THE LEFT TOWARD CENTER ROADWAY LINES. ALMOST STRUCK A UPS TRUCK AFTER CAR ABRUPTLY STEERED CAR BACK TOWARD THE STOPPED TRUCK, ALSO OCCURED TWICE WHILE PASSING BICYCLISTS AND ONCE WITH A PEDESTRIAN. I ALSO HAD TROUBLE MERGING ONTO AN INTERSTATE HIGHWAY AT HIGH SPEED, SIGNAL LIGHTS DID NOT OVERRIDE THE LLANEKEEPING ASSIST AND I LITERALLY HAD TO FIGHT WITH THE STEERING WHEEL TO ENTER THE HIGHWAY...CAR FINALLY CROSSED THE LINES AT A POINT WHERE I WAS RUNNING OUT OF RAMP. CAR HAS BEEN RETURNED TO DEALERSHIP NUMEROUS TIME, FOUND FAULT CODES WITH CAMERAS AND CAR WAS REPROGRAMMED. PROBLEM IS NOT RESOLVED AND VERY DANGEROUS. AUDI CORPORATE UNRESPONSIVE. I HAVE MANUALLY DISABLED THE SYSTEM. NOTE: REPORTED DATE BELOW IS THE DATE THE CAR WOULD NOT MERGE ONTO I87 SOUTH IN ALBANY NY. NUMEROUS OTHER OCCURENCES OVER THE LAST SEVERAL MONTH. AUDI ALBANY SERVICE DEPARTMENT HAS NUMEROUS REPAIR ORDERS. CAR IS IN AUDI CORPORATE REMEDATION AS A LEMON BUT NO CONCLUSION YET. CAR SHOULD BE INVESTIGATED AND RECALLED SERIOUS HAZARD TO PEDESTRIANS AND BICYCLISTS.",
        "vin": "WAUE8AF28KN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/12/2020",
        "dateOfIncident": "07/15/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348831,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2019 A6 3.0T QUATTRO WITH A SAFETY ISSUE WHEN EXITING THE DRIVER DOOR WHILE AUTO IS IN PARK WITH ENGINE RUNNING. I BROUGHT THIS TO THE ATTENTION OF THE DEALER ON 15 JULY WITH AUDI TECH SERVICE SUGGESTING TO REPLACE DOOR LATCH AND STATING VEHICLE OPERATES \"NORMALLY AS DESIGNED\" WHEN COMPARED TO SIMILAR VEHICLE. THE SAFETY ISSUE STILL EXISTS WITH HAVING TO PULL DOOR LATCH TWO, THREE AND FOUR TIMES TO EXIT THE AUTO AND OCCASIONALLY HAVING TO KILL THE ENGINE TO EXIT. THIS IS NOT NORMAL. THREE WITNESSES FROM THE DEALERSHIP VERIFIED MY STRUGGLING TO EXIT MY AUTO WHILE IN PARK. I WAS TOLD THE 2019 A6S AND A8S HAVE THIS ISSUE AND THE A8 ON THE DEALERSHIP FLOOR IS WORSE THAN MINE.  I CONTACTED AUDI CARE ADVOCATE LINE ON 27 JULY AND A CASE # WAS CREATED. SINCE THEN I HAVE CONTACTED SEVERAL TIMES WITH ABSOLUTELY NO RESPONSE. MY AUDI DEALERSHIP SAID NO AUDI CONTACT WAS MADE TO THEM, AS I WAS LED TO BELIEVE WOULD TAKE PLACE BY THE ADVOCATE.  AS A 30+ YEAR HUGELY POSITIVE AUDI CUSTOMER WITH MY PRESENT A6 AS MY 11TH AUDI YOU CAN IMAGINE MY DISAPPOINTMENT IN AUDI'S LACK OF CONCERN AND LACK OF RESPONSE.  I HAVE SINCE POSTED ON THE AUDI USA FACEBOOK AND WAS IMMEDIATELY ASKED TO PM THEM.    I BELIEVE THE DRIVER DOOR HAS A \"DESIGN FLAW\" WHICH CAUSES AN ISSUE WITH THE NEED TO EXIT IN AN EMERGENCY.  AUDI IS REFUSING TO TAKE RESPONSIBILITY AND HAS CLAIMED TO HAVE \"DOCUMENTED\" MY \"SENTIMENTS AND FEEDBACK\".   AUDI CORPORATE IS IGNORING AND DISMISSING WHAT SEEMS TO BE A HORRIFIC NEW DESIGN FLAW.  VERY SCARY!!",
        "vin": "WAUL2AF27KN"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/19/2020",
        "dateOfIncident": "06/12/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329769,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AT A STOP LIGHT THE ENGINE WILL SHUT OFF COMPLETELY REQUIRING YOU TO RESTART THE CAR.  THIS HAPPENS INTERMITTENTLY AND HAPPENS WHEN THE AUTO ON/OFF IS ON OR OFF.  LEADS TO DANGEROUS SITUATIONS WHEN IN CITY TRAFFIC OR STOPPED AT A RED LIGHT ON HIGHWAY.  TWO TRIPS TO AUDI AND THERE ARE NO ERROR CODES ON THE ENGINE TO DIAGNOSE THE ISSUE.  MAKES FOR VERY NERVOUS DRIVING WHEN EVERY STOP LIGHT MAY CAUSE YOUR CAR TO STALL.  MOST RECENT ISSUE THE CAR WOULD RE-START AND IMMEDIATELY STALL, AND THEN STARTED SHAKING VIOLENTLY.  *TR",
        "vin": "WAUE8AF24KN"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/15/2020",
        "dateOfIncident": "01/15/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299645,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I ACQUIRED THIS CAR (2.0T) TWO NIGHTS AGO AND ON THREE OCCASIONS (SO FAR) THE ENGINE COMPLETELY STALLS WHEN THE CAR COMES TO A STOP. NOT THE TYPICAL AUTO ON/OFF FEATURE FUNCTION. I HAVE TO RESTART THE IGNITION AND PUT THE CAR IN DRIVE AGAIN. ONCE, EVEN IN THE MIDDLE OF RUSH HOUR TRAFFIC. SO FAR, THE ONLY CONSISTENT SCENARIO IS WHEN I AM ON THE SECOND LEG OF A TRIP. FOR EXAMPLE, I GET IN THE CAR AT MY OFFICE, DRIVE TO A STORE OR DAYCARE. GET BACK IN THE CAR, START UP, DRIVE A COUPLE OF MILES AND THE CAR SHUTS DOWN AT A COMPLETE STOP. VERY UNNERVING ON A BRAND NEW CAR WITH LESS THAN 200 MILES ON IT. I'VE LOOKED ACROSS THE INTERNET AND IT SEEMS TO BE QUITE A WIDESPREAD ISSUE FOR VW AND AUDI DRIVERS OF RECENT MODEL CARS. THIS IS A SAFETY CONCERN AND NEEDS TO BE ADDRESSED.",
        "vin": "WAUD8AF26KN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/15/2019",
        "dateOfIncident": "09/13/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268751,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED ANEW AUDI A6 ON SEP 11, 2019. IN THE FIRST 2 WEEKS, FIVE DIFFERENT TIMES, THE \"START STOP SYSTEM\" FAILED TO WORK PROPERLY. I WOULD BE STOPPED AND WHEN I TRIED TO START AGAIN THE ENGINE WOULD DIE. IN ORDER TO START THE CAR BACK UP, I HAD TO PUT THE CAR IN PARK AND RESTART USING THE START BUTTON. THIS RESULTED IN AN UNSAFE CONDITION. THE FIRST TIME, I WAS ON A STEEP INCLINE AND THE CAR STARTED TO ROLL BACKWARDS. ANOTHER TIME A FIRE TRUCK WAS TRYING TO GET THROUGH ON A TWO LANE ROAD AND I COULD NOT GET THE CAR STARTED BACK UP TO PULL FURTHER OVER ON THE ROAD. THE CAR HAS BEEN TO SERVICE TWICE. THEY COULD NOT FIND THE PROBLEM. THE SERVICE DEPARTMENT KEPT AND DROVE THE CAR BUT THIS START STOP ISSUE DID NOT OCCUR AGAIN. I HAVE BEEN DRIVING THE CAR SOME FOR THE LAST TWO WEEKS AND HAVE NOT HAD THIS PROBLEM OCCUR AGAIN.",
        "vin": "WAUE8AF28KN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/23/2019",
        "dateOfIncident": "09/21/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257546,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS ISSUE HAPPENS WHEN THE CAR IS STOPPED AND THE AUTO STOP/START FEATURE HAS STOPPED THE ENGINE.  MOST COMMONLY AT A STOP LIGHT AT A MAJOR CITY INTERSECTION, WHERE THE LIGHTS ARE LONGER.  WHEN THE SYSTEM ATTEMPTS TO RESTART THE ENGINE, IT ROUGH IDLES AND THEN THE DRIVE SYSTEM SHUTS DOWN THE ENGINE, CAUSING YOU TOO LOSE ALL POWER.  THIS LEAVES YOU STRANDED, AND RISKS CAUSING SOMEONE TO REAR-END YOUR VEHICLE IF THE LIGHT CHANGES.  PUTTING THE CAR IN PARK, TURNING OFF THE IGNITION, AND THEN TURNING THE IGNITION BACK ON RESUMES ENGINE FUNCTION.  THIS HAS HAPPENED MULTIPLE TIMES.  SO FAR THE SERVICE CENTER HAS BEEN UNABLE TO IDENTIFY THE ROOT CAUSE.",
        "vin": "WAUL2AF26KN"
    },
    {
        "components": "AIR BAGS,STRUCTURE,ENGINE",
        "crash": true,
        "dateComplaintFiled": "09/05/2019",
        "dateOfIncident": "08/08/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11253328,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 6 WEEK OLD AUDI A6 WAS TOTALED WHEN I WAS DRIVING 20 MPH!  I LOOKED DOWN TO CHECK MY ODOMETER, AND WITHIN THAT TIME, NO WARNING SIGNALS , BRAKES, ETC. ALERTED ME!  THIS CAR HAD ALL THE BELLS AND WHISTLES!  THAT MORNING I WAS ON A TREE LINED DRIVE TO THE TENNIS COURTS!  NO ALERTS!  HIT A TREE AND ALL AIR BAGS DEPLOYED!  TREMENDOUS IMPACT FOR 20 MPH!  I WAS ALL BANGED UP, CAR TOTALED!  I AM STILL IN DISBELIEF...THOUGHT I HAD THE WORLD'S SAFEST CAR.  HAS ANYONE ELSE HAD A PROBLEM???",
        "vin": "WAUM2AF28KN"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/27/2019",
        "dateOfIncident": "07/27/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11235252,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE, WHICH I HAVE OWNED SINCE FEBRUARY OF 2019,  WAS STATIONARY. AS I OPENED THE TRUNK LID BY PULLING UP ON THE HANDLE, I LEANED SLIGHTLY INTO THE TRUNK TO VIEW AN OBJECT. AT THIS POINT, THE LID STARTED TO CLOSE, TOUCHING THE BACK OF MY HEAD AND NECK. THE EXACT SAME THING HAPPENED LATER IN THE DAY TO ANOTHER PERSON.",
        "vin": "WAUM2AF20KN"
    },
    {
        "components": "STEERING,TIRES,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/12/2019",
        "dateOfIncident": "11/21/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186086,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2019",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "TURANZA T",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "AUDI WESTMONT LEASED ME A BRAND NEW 2019 A6 LAST NOVEMBER 12, 2018.  THEY CLAIM \"ALL\" OF AUDI'S 2019 A6'S COME WITH \"SUMMER TIRES\" ON THEM AND GETTING AN \"ALL SEASON\" OR \"WINTER\" TIRE IS NOT POSSIBLE UNLESS I PAY ANOTHER $2,690.83 FOR FOUR MORE \"WHEELS AND WINTER TIRES\".  I DROVE THE VEHICLE FOR TWO MONTHS ON THEIR \"SUMMER TIRES\" BRIDGESTONE TURANZA T005 SUMMER TIRES.  ON TWO SEPARATE OCCASIONS WITH LESS THAN ONE INCH OF SNOW ON THE GROUND, I TOTALLY LOST CONTROL OF THE CAR WHILE BRAKING.  MY WIFE REFUSED TO RIDE AGAIN WITH ME WITH THE TIRES THAT CAME WITH THE CAR.  I FINALLY WENT BACK IN AND HAD TO PURCHASE FROM THEM FOUR NEW SOTOZERO3 WINTER TIRES AND FOUR NEW WHEELS.  I NOW HAVE 8 NEW TIRES AND 8 NEW WHEELS.  MY COMPLAIN IS WITH AUDI, NOT THE DEALER.  SELLING OR LEASING THESE VEHICLES WITH SUMMER TIRES ONLY IN A GEOGRAPHICAL AREA THAT EXPERIENCES WINTERS SUCH AS SUBURBAN CHICAGO, IS A DISASTER WAITING TO HAPPEN.  AUDI NEEDS TO BE STOPPED BEFORE SOMEONE DIES.  THANK YOU!",
        "vin": "WAUM2AF28KN"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": true,
        "dateComplaintFiled": "03/09/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11185595,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "STOP ENGINE OIL PRESSURE TOO HIGH LIGHT COMES ON DEALER DOES NOT HAVE SOLUTION. ENGINE COULD BLOW DURING OPERATION AND CAUSE ACCIDENT. VEHICLE RECALL NEEDED",
        "vin": "WAUM2AF2XKN"
    }
]