[
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "09/26/2019",
        "dateOfIncident": "05/20/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258340,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR PURCHASED FEBRUARY 2019 BRAND NEW. WHEN SEAT COOLING, THE BACK OF THE DRIVER AND PASSENGER SEATS HEAT UP IN ALL  COOLING  MODES FROM HIGH TO LOW. RETURN VENTS ON BACK SIDE OF DRIVER/PASSENGER SEATS BLOW OUT VERY HOT AIR PROVIDING SAFETY CONCERN IF TOUCHED BY PASSENGER. INFRARED THERM. PERSONALLY PURCHASED AND RECORDED A LOG OF SEAT TEMPS FOR OVER A MONTH. RETURN VENTS ON BACK OF BOTH SEATS REACHED A MAXIMUM OF 132FON DRIVERS SIDE AND 129F ON PASSENGER. ON AVERAGE, INFRARED THERM. SHOWED DRIVER/ PASSENGER  BACK OF SEATS MEASURING AVG 92-96 DEGREES F. ON OCASSION COOLING SEATS WORK WITH NO ISSUE BUT USUALLY OCCURS 15 MINUTES INTO DRIVING WITH COOL ON. WHEN SEAT COOLING TURNED OFF, SEATS/VENTS COOL OFF. WHEN TURNED BACK ON SEATS/VENTS HEAT UP. CAR SERVICED BY DEALERSHIP THREE TIMES FOR THIS PROBLEM. AFTER NOTIFYING GM CUSTOMER RELATIONS WITH CERTIFIED LETTER, A GM SERVICE ENGINEER WAS SENT TO ASSESS MY CAR ISSUES ON THE THIRD TIME. PER INVOICE 10644 9/24/19,  GM SERVICE ENGINEER CONFIRMED THERE WAS AIR BEING TRAPPED IN FOAM OF BACK SEAT CAUSING RETURN AIR VENTS TO HEAT UP. HE MEASURED THE BACK SEATS TO HEAT TO 81F AFTER TWO TEST RUNS ONLY WITH A DIGITAL THERMOMETER. HIS CORRECTION IS REMOVAL OF OPEN CELLED FOAM IN BACK OF DRIVER AND PASSENGER SEATS AND REPOSITIONED THEN REMOVED HOT AIR EXHAUST PORTS ON LF/RF SEAT BACK COOLERS. NOTES COOLING SEATS OPERATE AS DESIGNED. I AM NOT COMFORTABLE WITH REMOVAL OF MANUFACTURERS DESIGN PARTS FOR FUNCTIONING OF CAR. HAVE CONFIRMED OTHER CADILLAC SUV OWNERS HAVE HEATING ISSUES WITH RETURN VENTS IN A 2016 SUV SERVICED BY SAME DEALERSHIP AND PROBLEM STILL OCCURS. ALSO,  2019 ESCALADE ESV LOANER PROVIDED TO ME EXHIBITS EXACT SAME ISSUES AS THOSE REPORTED IN MY CAR WITH HEAT IN BACK OF SEATS AND RETURN VENTS DURING COOLING SEATS ACTIVATED.",
        "vin": "1GYS4CKJ6KR"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/26/2019",
        "dateOfIncident": "06/15/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11235177,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS COMPLAINT APPLIES TO THE 2017-2019 CADILLAC ESCALADE.  THE HEADLIGHTS ON THESE VEHICLES ARE BLINDINGLY BRIGHT -- ENOUGH TO BE A SAFETY HAZARD.  THEY ARE WAY TOO BRIGHT IF THEY SHINE DIRECTLY IN YOUR EYES  OR SIDE MIRROR WHILE DRIVING A CAR. THEY ARE AN UNUSUAL DESIGN, WITH VERTICALLY STACKED POINTS OF TINY INDIVIDUAL LIGHTS, WHICH I BELIEVE CAUSES THIS PROBLEM.  I RECENTLY READ THAT PEDESTRIAN FATALITIES HAVE SIGNIFICANTLY INCREASED LATELY, PARTICULARLY AT NIGHT.  I BELIEVE THIS IS DUE TO THE INCREASINGLY BRIGHT SUV HEADLIGHTS, PARTICULARLY ON LUXURY SUV'S.  THE ESCALADE IS THE WORST, DUE TO THE UNUSUAL LIGHT DESIGN; BUT OTHERS ARE ALMOST AS BAD.  IF THEY SHINE IN YOUR EYES -- FOR EXAMPLE, DRIVING UPHILL AS ONE OF THESE IS COMING DOWN THE HILL IN THE OTHER LANE -- IT IS LITERALLY IMPOSSIBLE TO SEE ANY PEDESTRIAN TO THE SIDES, PARTICULARLY IF THE PERSON IS WEARING BLACK.  THIS HAPPENS FREQUENTLY AT ONE BUSY INTERSECTION IN MY TOWN.   IF YOU WANT TO REDUCE PEDESTRIAN DEATHS, THERE NEEDS TO BE GREATER REGULATION OF THE BRIGHTNESS OF VEHICLE HEADLIGHTS, PARTICULARLY ON TRUCKS.    THANK YOU FOR THE CONSIDERATION OF THESE COMMENTS.[XXX]  INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'  *PM",
        "vin": ""
    }
]