[
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/22/2021",
        "dateOfIncident": "12/20/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444659,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2019",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Ewr Volpe Acme Inc.",
                "productMake": "TBD",
                "productModel": "TBD",
                "productYear": "9999",
                "type": "Vehicle"
            }
        ],
        "summary": "In attempt to change a flat tire (front passenger side), I loosened the 5 lug nuts (1/4-turn), raised the vehicle (Buick Regal Sportback) and the jack collapsed to one side at the hinge points at both ends of the threaded shaft as I was about to remove the 5th lug nut.   Note the slotted connections at the hinge/pivot points (see attached photo).",
        "vin": "W04GL6SX1K1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/24/2021",
        "dateOfIncident": "08/09/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430256,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "After shifting the vehicle into park and shutting off the engine I get a warning light on the dash that says shift to park. Even though the vehicle is already in park.",
        "vin": "W04GR6SX3K1"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/11/2021",
        "dateOfIncident": "11/03/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395682,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR PASSENGER TIRE WENT OUT OF BALANCE TO SUCH A DEGREE THAT THE ENTIRE CAR WAS RATTLING, MIRRORS SHAKING, AT HIGHWAY SPEEDS.  VIBRATION VISIBLE TO OBSERVERS OUTSIDE AND FOLLOWING THE VEHICLE.  AFTER MULTIPLE ATTEMPTS TO BALANCE THE MECHANIC REMOVED THE TIRE FROM THE WHEEL AND FOUND THAT THE \"QUITE RUNNING FOAM\" HAD SEPARATED FROM THE INSIDE OF THE TIRE.  REMOVING FOAM SOLVED THE ISSUE.  ABOUT A MONTH LATER FRONT PASSENGER TIRE WENT OUT OF BALANCE, AGAIN, NOTICEABLE AT HIGHWAY SPEEDS.  NOT WILLING TO RISK BEING STRANDED AWAY FROM HOME, I HAVE NOW PERSONALLY PAID, WITH SOME RELIEF FROM GM, TO HAVE ALL FOUR TIRES REPLACED WITH NON-QUIET RUNNING TIRES.  I DID A QUICK SEARCH, AND IF YOU LOOK AT THE FIRST COMMENT IN THIS \"HOW TO REPAIR\" ARTICLE YOU WILL SEE OTHERS HAVE HAD THIS PROBLEM TOO.  HTTPS://GM-TECHLINK.COM/?P=8677",
        "vin": "W04GV8SX5K1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/29/2020",
        "dateOfIncident": "12/07/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11312213,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED VEHICLE BELIEVING IT DID NOT HAVE THE AUTO STOP FUNCTION.  IT WAS NOT WORKING WHEN I PURCHASED IT, THE SALESMAN SAID THERE WAS NONE, AND THERE IS NOT A SHUT OFF BUTTON.  AFTER DRIVING 600 MILES, THE AUTO STOP STARTED WORKING.  A GM REPRESENTATIVE TOLD ME THERE ARE CERTAIN CRITERIA THAT MUST BE MET BEFORE THE AUTO STOP STARTS TO WORK ON A NEW VEHICLE.  ONE OF THOSE IS THAT THE VEHICLE MUST BE DRIVEN OVER 600 MILES BEFORE IT STARTS TO WORK.  THIS IS NOT DISCLOSED ANYWHERE TO THE PURCHASER OF THE VEHICLE.  I WOULD NOT HAVE PURCHASED A VEHICLE THAT HAS AUTO STOP WITHOUT THE BUTTON TO SHUT IT OFF.  WHEN IT STARTED TO WORK, I HAD JUST EXITED A GAS STATION AND PULLED UP TO A RED LIGHT AT AN INTERSECTION FOR AN OVERPASS ACROSS A BUSY HIGHWAY.  THE ENGINE SHUT OFF WHEN I CAME TO A COMPLETE STOP.  IT SCARED ME BECAUSE I THOUGHT MY CAR BROKE DOWN.",
        "vin": "W04GV8FXXK1"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/19/2020",
        "dateOfIncident": "01/17/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310082,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN GOING BACK AND FORTH WITH GM CUSTOMER SERVICE AT 866-790-5600. I PURCHASED THE CAR 11/23/18 BRAND NEW WITH 12 MILES ON IT. I HAD TO TAKE THE CAR TO GET IT SERVICED DUE TO KEPT HEARING SOMETHING SIMILAR TO THE BRAKES KEEP SCRUBBING, IN WHICH I THE DEALERSHIP ORDERED THE PARTS AND GAVE ME A LOANER VEHICLE, 8/31/19 I COMPLAINED WHEN I WENT INTO THE DEALERSHIP TO GET MY OIL CHANGED THAT THE RADIO SCREEN WOULD JUST GO BLACK, AND THAT THE AIR CONDITIONER SYSTEM WOULD BE IN OFF POSITION AND IT WOULD JUST KEEP BLOWING ON HIGH. I WAS TOLD TO BRING THE CAR BACK IN. DUE TO NO TECHS AVAILABLE ON SATURDAY. EVERYTHING STARTED WORKING AGAIN. 1/6/2020 I TOOK THE CAR IN BC AC STARTED BACK DOING THE SAME THING RUNNING WHEN OFF, SOS WAS MALFUNCTIONING  EMERGENCY CALLS ALL DAY AND NIGHT EVERY 5-10 MINS HEAD UNIT SCREEN STAYS ON SERVICE SCREEN AND COULDNT BE CHANGED, THE SCREENS KEPT SWITCHING SCREENS WITHOUT BEING TOUCHED. TALKED WITH SERVICE MANAGER AT DEALERSHIP HAD TO DEACTIVATE THE ONSTAR AND TAKE THE CAR BACK WHEN THEY RECEIVED A LOANER CAR. THEY CLEANED BUTTON AND SAID THEY ORDERED THE PART ITS ON BACK ORDER. 2/10/20 IM DRIVING MY VEHICLE AND ALL OF A SUDDEN THE CAR SLOWS DOWN AND STOPS IN THE MIDDLE OF THE STREET IN WHICH THE SCREEN READ REDUCED ENGINE POWER. I WAS NOT FAR FROM DEALERSHIP TOOK IT BACK YET AGAIN. I WAS GIVEN A LOANER CAR THE ACCELERATOR PEDAL POSITION SENORS HAD TO BE REPLACED ACCELERATOR PEDAL WITH POSITION SENOR ASSEMBLY REPLACEMENT ENGINE CONTROLS AND FUEL. 2/14/20 WENT AND OIL CHANGE COMPLETED THAT NEXT DAY ANOTHER ISSUE ON 2/17/20 THE RADIO SCREEN GOES OUT AND THE AC/HEAT IS ON FULL BLAST AND CANT TURN OFF. THE SAME ISSUES I WAS HAVING 1/6/2020 HAVE BEGAN YET AGAIN. I WAS CONTACTED BY GM AND TOLD THEY WOULD ORDER THE PART THAT WAS SAME PART THAT WAS ON BACK ORDER. MY CAR IS STILL UNDER WARRANTY HAPPENING WHILE I AM DRIVING. I HAVE A LOT OF PICS",
        "vin": "W04GL6SX6K1"
    },
    {
        "components": "STRUCTURE,SEATS",
        "crash": false,
        "dateComplaintFiled": "09/11/2018",
        "dateOfIncident": "09/09/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128715,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN A CHILD IS LOCKED INTO THE TRUNK OF THIS VEHICLE HE/SHE WILL BE PERMANENTLY TRAPPED INSIDE. THERE IS NO EMERGENCY PROCEDURE FOR EGRESS. THERE IS NO CABLE NO BUTTON. NOT ACCEPTABLE.",
        "vin": "W04GL6SX8J1"
    }
]