[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/08/2021",
        "dateOfIncident": "09/25/2021",
        "fire": false,
        "manufacturer": "Carry-On Trailer Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439798,
        "products": [
            {
                "manufacturer": "Carry-On Trailer Corp.",
                "productMake": "CARRY-ON",
                "productModel": "ENCLOSED CARGO TRAILER",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 Carry-On Cargo Trailer. The contact stated that after purchasing the trailer he noticed a safety defect on the security fastener that secured the wooden frame floor panel to the metal frame. The contact was concerned that while carrying a load that a hard-braking event would cause the load to shift and damage the trailer. The trailer was not diagnosed or repaired. The manufacturer was made aware of the failure. The failure mileage was approximately 2,000.",
        "vin": "4ymbc1215mt"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/24/2019",
        "dateOfIncident": "05/22/2019",
        "fire": false,
        "manufacturer": "Carry-On Trailer Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209645,
        "products": [
            {
                "manufacturer": "Carry-On Trailer Corp.",
                "productMake": "CARRY-ON",
                "productModel": "ENCLOSED CARGO TRAILER",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 CARRY-ON TRAILER (NA). WHILE COASTING INTO A REST STOP, THE TRAILER BRAKE WIRING FAILED. THE CONTACT CHECKED UNDERNEATH THE TRAILER AND NOTICED THAT THE BRAKE WIRES WERE DETACHED DUE TO THE AXLE RUBBING UP AGAINST THE FRAME. THE VEHICLE WAS NOT TAKEN TO A DEALER OR AN INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING. THE CONTACT STATED THAT HE REPAIRED THE VEHICLE HIMSELF. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 2,600. *DT *DT   CONSUMER STATED WIRE DIRECTLY OVER THE AXLE U-BOLT. TRAILER FRAME DAMAGE WHERE THE AXLE U-BOLT IMPACTED. BRAKE AND OTHER WIRE WERE CAUGHT BETWEEN THE AXLE U-BOLT AND FRAME SEVERED.  CONSUMER ALSO FOUND SEVERED BROKEN WIRE.  CARFAX CANNOT PROCESS THIS REQUEST. *JB *DT *TR *DT*JB *DT*JB *BF",
        "vin": "4YMBC1426KN"
    }
]