[
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "01/07/2022",
        "dateOfIncident": "10/25/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11446655,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "On the morning of October 25, 2021 at approximately 7:05 am, I was fixing to leave to go to work.  The carport light was on, so I open the door to my car, slid into the driver’s seat, started the car up and the lights came on.  As I was starting to get out of the car to go turn the carport lights off, I realized the car was going backwards.  I tried to get back into the driver’s seat to try to stop the car but I was unable to do so.  The door knocked me down on the concrete floor of the carport and the front left tire ran over both my legs.  The car continued to go backwards, the door hit the column between the carport bays but continued to travel backwards down our approx. 11-foot paved drive way, crossed the dirt road and stopped when the back of the car went into the deep ditch that runs along the dirt road at that point. When my husband arrived, the car was still running and the lights were on. The man driving the wrecker for the local EMA Director and my husband all looked at the gear shift and the car was in PARK.",
        "vin": "5GAERBKW3KJ"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "09/03/2021",
        "dateOfIncident": "09/03/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431582,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Waited for train to pass and gate to raise at railroad crossing, then started to cross tracks. The car went halfway across the tracks, then the forward collision warning and automatic emergency braking activated, stopping us on the tracks. Tried again to move forward, but the collision alert and auto braking immediately activated for a second time, bringing us to a stop again. Finally was able to very slowly make my way through the crossing. I was on the tracks for 30-60 seconds.  No train was approaching and it was only my wife and me in the car, but if I'd had six passengers with me and another train had approached, I am not sure I would have been able to get everyone out of the car in time.  Note that there were no obstacles in front of the vehicle, but the sun was at a low angle from the front of the car and the sunlight was dappled through the treetops on the other side of the crossing (there's a left-hand curve after the crossing), creating a \"moving\" glare through the windshield.",
        "vin": "5GAEVCKW5KJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/04/2021",
        "dateOfIncident": "07/31/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427746,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Rear door with the automatic open/close feature. While accessing the rear portion of the vehicle (looking in boxes, accessing under floor storage compartment,etc) I have experienced on several occasions where the door starts to close. I was able to turn around, push the door upwards and the door stopped closing and reversed to the open area. This happened to our Buick Enclave that we own in Canada. The dealer was able to find on Buick's database where this was documented and the suggested solution was to \"turn this feature off using the \"control knob located in the driver's door\". My wife and I are 80 and this feature was one of the reasons that we purchased this model new in May 2020. So solution that Buick has offered is not the greatest. However, my wife is disabled and if the rear door had started to close on her, I do not think that she could have stopped the door from coming down. I will be notifying the Canadian highway vehicle association of this problem. But seems to me that Buick has a problem with the design of this system and is not addressing it. Are you aware of this problem with Buick Enclaves 2018 -2021 in the USA? [XXX]  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "5GAEVBKW7KJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/20/2021",
        "dateOfIncident": "07/13/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425610,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Buick Enclave. The contact stated while driving downhill, he shifted to a lower gear and was depressing on the brake pedal however, the vehicle inadvertently accelerated. The contact also stated that the RPM was very high. The contact stated no warning light was illuminated. The contact stated he continued driving but had to stop 5 times to allow the vehicle to cool down. The contact took the vehicle to the local dealer. The mechanic found no failure with the vehicle. The contact stated that the failure persisted. The manufacturer had not been informed of the failure. The failure mileage was approximately 30,000. Contact was on top of Pikes Peak in Colorado. The fast idle has the engine revved to high so that when foot was off the brake on a 5-8% slope the car accelerates to 6500RPM with in 250 feet taking the car to 30MPH in low gear. Consumer had to push on the brakes constantly, all the way down the mountain which caused the brakes to severely overheat. Park ranger measured the temperature of the brakes at 375 degrees F it was after consumer had stopped to allow them to cool 3 times in about 4 miles. The car will idle at 950RPM stopped and will lurch forward when foot was off the brake. Driving on the highway speeds its fine but not on switchback mountain roads.",
        "vin": "5GAERBKW1KJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/08/2021",
        "dateOfIncident": "01/08/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387192,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HUSBAND HAD THE KEY IN HIS POCKET UPSTAIRS IN OUR HOUSE.  IT ACCIDENTALLY ACTIVATED AT SOME POINT BY HIS BENDING /SITTING.  THE CAR REMOTELY STARTED AND WE DID NOT HEAR IT.  ONLY BECAUSE OUR PETS BECAME UPSET DID WE DISCOVER THE RUNNING CAR IN OUR CLOSED GARAGE.  WE WERE ABLE TO TURN IT OFF AND VENT THE GARAGE OF CO ACCUMULATION.",
        "vin": "5GAERBKW5KJ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/02/2020",
        "dateOfIncident": "06/18/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377410,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SEAL AROUND THE TIMING CHAIN WAS LEAKING RIGHT FROM THE FIRST DAY WE BOUGHT THE CAR. THE CAMSHAFT WAS ALSO PITTED AND REPLACED. IT WAS FIXED BY THE DEALER UNDER WARRANTY. THIS ALSO HAPPENED ON OUR 2009 BUICK ENCLAVE. IT LEAKED A LARGE AMOUNT OF OIL THAT COULD HAVE CAUSED MAJOR ENGINE DAMAGE.",
        "vin": "5GAEVAKW0KJ"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/29/2020",
        "dateOfIncident": "10/31/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376929,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD THIS NEW CAR JUST OVER FOR 1 YEAR, IM PRIOR SERVICE MILITARY AND WAS ABLE TO PURCHASE THIS 2019 BUICK ENCLAVE FOR ME ON FATHER'S DAY  LAST YEAR BECAUSE PUR OTHER CAR BROKE DOWN ON A FAMILY ROAD TRIP. SO I GARAGE MY VEHICLES I NOTICED A OIL LEAK ON THE GARAGE I DIDN'T WANT TO THINK IT WAS FROM THIS CAR SO I WATCHED IT SEEMED TO BE INTERMEDIATE AT TIMES BUT RECENTLY GOT WORSE SO I TOOK IT IN TOLD THEM AND THEY SAID IT WAS A BAD OIL FILTER BUT THE OIL FILTER IS OPPOSITE SIDE OF THE CAR FROM WHERE THIS LEAK IS DRIPPING ON MY DRIVER'S SIDE.  SO I JUST WENT UNDER THERE TO SEE WHAT I COULD FIND I TOO WAS A MECHANIC IN THE ARMY AND OUTSIDE AS A CIVILIAN AFTER SO I LOOKED TOOK ME 5 SECONDS TO LOCATE IT THAT IS THE PICTURE OF THE LEAK. THEN I NOTICED RUST CRACKS ON MY FRAME SO I LOOKED MORE AND DISCOVERED THE RUST CRACKS ARE ON THE BOTTOM AND TOPSIDE OF THE FRAME. SO I DID SOME RESEARCH AND SAW COMING UP IN DEC A RECALL IS GOING TO HAPPEN FOR CRACKED FRAMES ON THE BUICK ENCLAVE 2020 BUT STARTING FROM BUILD DATE'S 3 MONTHS AFTER MINE WAS BUILT BUT MINE SHOWS ALL THE SYSTEMS OF THAT RECALL BUT ISN'T INCLUDED. ALSO I HAD A ISSUE WITH THE STARTER STOP MY FAMILY AND I WERE STOPPED AT A RED LIGHT ON A CITY STREET WITH A CAR INFRONT OF US WHEN THE ENGINE STOPPED NORMALLY THEN WHEN IT TURNED BACK ON MY RPM KEPT GOING UP LIKE YOUR PUSHING THE EXCELLORATOR PEDDLE BUT I WASN'T BECAUSE MY FOOT WAS ON THE BRAKE WHEN I LOOK DOWN I EASED UP A BIT ON THE BRAKE AND IT SHOT FORWARD ON ME I DIDN'T HIT THE CAR INFRONT OF ME BECAUSE I DEPRESSED HARDER ON THE BRAKE TO HOLD IT. THATS WHEN I STARTED LOOKING AND SAW THIS RECALL SOON TO COME OUT.",
        "vin": "5GAERBKWXKJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/08/2020",
        "dateOfIncident": "10/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363476,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BROKEN REAR SUNROOF CLIP TO HOLD SUNROOF SHUT CLOSE THERE IS NO REPLACEMENT PART AND SUNROOF STAYS OPEN!! PART WAS MADE OUT OF PLASTIC  AND IM SURE MORE PEOPLE HAVE BROKEN THEIRS TOO ESPECIALLY IF THEY HAVE KIDS",
        "vin": "5GAERDKW0KJ"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/27/2020",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326219,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 BUICK ENCLAVE. THE CONTACT WAS CONCERNED ABOUT A MANUFACTURER'S DEFECT IN THE DESIGN OF THE PASSENGER'S SIDE KICK PANEL. THE CONTACT STATED THAT THE DESIGN MAY CAUSE INJURIES TO THE PASSENGER'S FEET. TWO UNKNOWN DEALERS WERE CONTACTED AND INFORMED OF THE CONTACT'S CONCERN. THE CONTACT WAS INFORMED THAT THE PANEL WAS DESIGNED TO MANUFACTURER'S SPECIFICATIONS. THE KICK PANEL WAS NOT REPLACED. THE MANUFACTURER WAS CONTACTED AND INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS 3,000.",
        "vin": "5GAERDKW8KJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/21/2020",
        "dateOfIncident": "01/16/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300704,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN VEHICLE REENGAGING FROM AUTO START/STOP DURING STOPS IN TRAFFIC AND/OR LIGHTS/SIGNS, SLAMMING INTO GEAR AFTER REMOVING FOOT FROM BRAKE, PRIOR TO PUSHING GAS PEDAL. HAPPENS IN HIGHWAY TRAVEL (IF HAVING TO COME TO A STOP) AND CITY TRAVEL. DEALERSHIP REPLACED AUXILIARY FLUID ACCUMULATOR AND ADDED FLUID TO TRANSMISSION. OWNER NOW REALIZES FLUID SPOTS IN DRIVEWAY ARE WHERE VEHICLE MUST HAVE BEEN LEAKING SOME FLUID.",
        "vin": "5GAERDKWXKJ"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/15/2020",
        "dateOfIncident": "01/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299634,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE 2ND ROW PASSENGER'S SEAT BELT IS NOT BOLTED TO THE FRAME. WHILE DRIVING THIS RENTAL CAR ON VACATION, THE PANELING FELL OFF REVEALING THAT THE SEAT BELT SPOOL WAS HANGING LOOSE AND NOT MOUNTED TO THE FRAME. BASED ON WHAT I CAN SEE FROM THE THREADS, IT APPEARS NEVER TO HAVE BEEN CONNECTED (AS OPPOSED TO BEING SNAPPED OFF).    THIS IS A RENTAL, BUT I DON'T TRUST THE AGENCY TO REPORT THIS APPROPRIATELY SO DOING SO MYSELF. HOW THIS HAS GONE UNNOTICED FOR 12K MILES IS BEYOND ME.",
        "vin": "5GAEVAKWXKJ"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/08/2019",
        "dateOfIncident": "07/15/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267071,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 BUICK ENCLAVE. WHILE DRIVING 35 MPH, THE CONTACT BECAME DISTRACTED WHILE MAKING A RIGHT TURN AND CRASHED INTO A TELEPHONE POLE. THE AIR BAGS DID NOT DEPLOY. THERE WERE NO INJURIES AND A POLICE REPORT WAS NOT FILED. THE CRASH OCCURRED IN FRONT OF THE CONTACT'S INSURANCE COMPANY WHERE THE VEHICLE WAS INSPECTED AND TOWED TO THE CONTACT'S RESIDENCE. THE FRONT END OF THE VEHICLE WAS DAMAGED. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT TO CALL NHTSA TO FILE A COMPLAINT. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE VEHICLE WAS REPAIRED BY AN INDEPENDENT MECHANIC. THE FAILURE MILEAGE WAS APPROXIMATELY 7,712.",
        "vin": "5GAERCKW5KJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/15/2019",
        "dateOfIncident": "04/14/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231900,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER THE VEHICLE IS STARTED, WITH THE ENGINE RUNNING, IF A DOOR IS CLOSED OR OPENED/CLOSED ANYTHING PLUGGED INTO THE AUX OUTLET WILL SHORT OUT AND RESET (I.E. RADAR DETECTOR WILL REBOOT AS IF POWER SUPPLY WAS INTERRUPTED) AND/OR IF THE FACTORY INSTALLED DVD PLAYERS ARE POWERED ON, THEY WILL TURN OFF.  DOES NOT QUALIFY UNDER THE LEMON LAW BECAUSE GM HAS BEEN INVESTIGATING A SIMILAR ISSUE SINCE 01/24/2019 WITH NO CURRENT RESOLUTION OR PATH FORWARD.  GM ADVISES DEALERS TO ATTEMPT NO REPAIRS AT THIS TIME AND EXPECT THE CONSUMER TO \"LIVE\" WITH A POTENTIAL ELECTRICAL SHORT IN THE VEHICLE.  GM PIT5653 EXPLAINS A PORTION OF THE ISSUE, BUT NOT ALL.  PIT5653 APPLIES TO (10) DIFFERENT GM MANUFACTURED VEHICLES.",
        "vin": "5GAERDKW3KJ"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/05/2019",
        "dateOfIncident": "06/05/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218167,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING AT HIGHWAY SPEEDS CAR SUDDENLY SHIFTED ITSELF INTO NEUTRAL AND COULD NOT BE ENGAGE BACK TO ANY DRIVE GEARS. BRAKES WERE INOPERABLE AND ACCELERATOR WAS IN OPERABLE.  FINALLY CAME TO A STOP BY COASTING TO THE SHOULDER AND WAITING FOR SPEED TO DROP FAR ENOUGH TO GET VEHICLE TO GO INTO PARK.",
        "vin": "5GAEVAKW1KJ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/03/2019",
        "dateOfIncident": "04/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193521,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTE:  MILEAGE IS 1240 MILES, JUST PURCHASED THREE MONTHS AGO WITH 54 MILES ON IT AND SHIPPED TO GERMANY (DOD CIVILIAN). WHILE IN EUROPE, I AM USING THE VEHICLES' \"METRIC\" SETTING (KPH VERSUS MPH), WHICH SWITCHES THE SPEEDOMETER TO READ KPH AND AUTO TUNES THE ENGINE TO THE APPROPRIATE LEVELS TO MATCH KPH.   I HAVE BEEN DRIVING THIS VEHICLE FOR THE LAST THREE WEEKS UNTIL THE ISSUE HAPPENED LAST NIGHT AROUND 1830 HOURS CET.      ISSUE:  WHILE ACCELERATING AND TUNING LEFT FROM A STOP (STOP LIGHT WITH THE CITY), THE ENGINE SUDDENLY LOSS POWER THEN JERKED INTO A LOWER GEAR, BUT SOMEHOW GOT STUCK IN 3RD GEAR RESTRICTING MAX SPEED OF ABOUT 25-30 MPH RUNNING AT 5000 RPMS. AFTER SEVERAL ATTEMPTS TO STOP, START, AND PROCEED, I FOUND THE VEHICLE SEEM TO BE SLIPPING WHEN SHIFTING FROM 2ND TO 3RD GEAR, BUT WOULD NOT GO BEYOND 3RD GEAR CAUSING THE ENGINE TO STRAIN AND REV AT AN UNSAFE LEVELS. TRIED SEVERAL TIMES TO SHIFT TO \"L\" TO MANUALLY ENGAGE THE ENGINE, BUT IT KEPT CHANGING BACK TO \"D\" AUTOMATIC.  ALSO NOTED THAT WHEN THE VEHICLE REACHES THE NEXT PROGRAMMED GEAR SHIFT (E.G. 2ND GEAR TO 3RD GEAR) IT THEN JERKS, STALLS FOR ABOUT 2-3 SECONDS, THEN SUDDENLY ENGAGES 3RD GEAR RUNNING AT EXTREMELY HIGH RPMS AND NEVER SHIFTS BEYOND THAT. NOW CHECK ENGINE LIGHT IS ON.  VEHICLE HAS NEVER BEEN IN AN ACCIDENT, DAMAGED, OR WRECKED.",
        "vin": "5GAEVBKW1KJ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/18/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187439,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT BRAKES LOCKING UP AT ANY SPEED. REPLACED THE MASTER CYLINDER . 48 HOURS LATER IT HAPPENED AGAIN",
        "vin": "KL4CJ1SMOKB"
    }
]