[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/16/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383692,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LACROSSE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2019 BUICK LACROSSE E-SHIFT (VIN#[XXX]). OVER THE LAST 4-5 MOS. I HAVE HAD 3 INCIDENTS WHERE THE E-SHIFT MECHANISM HAS GONE INTO PARK WITHOUT TOUCHING THE SHIFT CONTROL.  1. FIRST OCCURRENCE -  APPROX. 5 MONTHS AGO CAR WAS IN DRIVE AT VERY SLOW SPEED ENTERING PARKING SLOT WITH FOOT LIGHTLY DEPRESSED ON BRAKE.  CAR CHANGED TO PARK ON IT'S OWN.  STOPPED ABRUPTLY, GEARS GRINDING, JERKING ME TOWARD STEERING WHEEL.  2.  SECOND OCCURRENCE - AROUND 10/10/20, CAR WAS IN DRIVE, FOOT LIGHTLY DEPRESSED ON BRAKE, WAITING TO MAKE LEFT TURN AT STOP LIGHT.  CAR CHANGED TO PARK ON IT'S OWN.  AGAIN THE CAR STOPPED ABRUPTLY, GEARS GRINDING, JERKING ME TOWARD STEERING WHEEL.  I SCHEDULED APPOINTMENT WITH DEALER MAINTENANCE ON 10/13/20.  THEY COULD NOT REPLICATE THE PROBLEM.  ASKED FOR ME TO RETURN THE CAR SO THEY COULD HAVE OVERNIGHT.  DUE TO COVID ESCALATION HAVE NOT SCHEDULED APPT.  3. THIRD OCCURRENCE -  ON 12/11/2020, I WAS WAITING AT A RED LIGHT, CAR IN DRIVE, FOOT FULLY DEPRESSED ON BRAKE, AND THE CAR SHIFTED TO PARK ON IT'S OWN.  I HEARD THE CAR LOCKS CLICK, AND WONDERED WHAT CAUSED THAT.  WHEN LIGHT CHANGED AND I TRIED TO ACCELERATE, THE CAR DID NOT MOVE, AND IT WAS THEN I NOTICED IT WAS IN PARK.  I INTEND TO TAKE THE CAR BACK TO THE DEALER FOR THEM TO SEE IF THEY CAN REPLICATE.  THEY HAD NOTHING IN THEIR DATABASE ON 10/13/2020 REFLECTING OTHER COMPLAINTS.  I'M SOMEWHAT SKEPTICAL THEY CAN REPLICATE DUE TO THE RANDOM OCCURRENCES.  BUT IT DEFINITELY SEEMS TO BE IN THE SHIFT PARK COMPONENT OF THE CAR  I AM NOW VERY HESITANT ABOUT DRIVING THIS CAR.  SINCE IT HAPPENS RANDOMLY, AND ABRUPTLY, WITH NO FOREWARNING, I AM CONCERNED FOR MY SAFETY.  MY QUESTIONS ARE:  1.  HAS ANYONE REPORTED A SIMILAR PROBLEM TO YOUR GROUP?  2.  WHAT OTHER INFORMATION DO YOU REQUIRE?  3.  WHAT OTHER ACTIONS SHOULD I TAKE?   4.  WHAT OTHER GROUPS CAN I CONTACT TO INQUIRE ABOUT THE PROBLEM?    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1G4ZP5SZ7KU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/28/2020",
        "dateOfIncident": "01/31/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361466,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LACROSSE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "OCCASIONALLY THERE IS A LOUD SOUND IN THE CABIN OF WATER SLOSHING BACK AND FOURTH UNDER THE DASHBOARD.  SOME DAYS IT WILL HAPPEN WHEN THE ENGINE STARTS.  OTHER TIMES, IT IS AFTER DRIVING SEVERAL MILES.  SOMETIMES IT HAPPENS A FEW DAYS IN A ROW.  OTHER TIMES IT WILL GO A WEEK WITH NO NOISE.  THE GM MECHANIC VERIFIED THAT THE COOLANT LEVEL IS FINE.  IT HAPPENS WHEN THE CAR IS STATIONARY OR MOVING.  I HAVE NOT HEARD IT AT HIGH SPEEDS.",
        "vin": "1G4ZP5SZXKU"
    }
]