[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/08/2020",
        "dateOfIncident": "08/04/2020",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11344104,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "EMERGENCY BRAKE SOMETIMES DOES NOT RELEASE AND YOU HAVE TO DISASSEMBLE IT AT THE REAR HUB TO RELEASE IT.THIS HAPPENS WHEN THE VEHICLE IS STOPPED. THIS PROBLEM HAS HAPPENED SEVERAL TIMES TO ME, I KNOW OF SEVERAL OTHER PEOPLE ALSO, DIFFERENT MODELS AND YEARS",
        "vin": "2BXNBDD20KV"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/11/2020",
        "dateOfIncident": "07/02/2020",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338776,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRONIC PARKING BRAKE MALFUNCTIONS AND FAILED TO EITHER ENGAGE OR DISENGAGE. FAILURE TO ENGAGE PREVENTS THE VEHICLE FROM ROLLING AFTER STARTING AND IN GEAR. FAILURE TO ENGAGE ALLOWS THE VEHICLE TO ROLL AFTER STOPPING, TURNING THE ENGINE OFF, AND RELEASING THE MANUAL FOOT BRAKE. IN ORDER TO STABILIZE THE VEHICLE FROM MOVING IF THE EBRAKE WILL NOT ENGAGE, THE RIDER MUST RELEASE THE MANUAL FOOT BRAKE, WHILE ATTEMPTING TO PREVENT THE VEHICLE FROM ROLLING, AND PLACE A CHOCK UNDER TIRE(S). IN ORDER TO PREVENT THE RIDER FROM BEING STRANDED IF THE EBRAKE FAILS TO DISENGAGE, THE RIDER MUST STABILIZE THE VEHICLE FIRST, MANUALLY REMOVE THE REAR BRAKE SPRING, AND LOOSEN THE BRAKE CABLE NUTS TO RELEASE BRAKE CABLE TENSION. THIS REQUIRES A SPRING TOOL AND TWO 12MM WRENCHES. WHILE THIS WILL ALLOW THE RIDER TO NOT BE STRANDED, IT CREATES A HAZARD WHEN THE RIDER ARRIVES AT THEIR DESTINATION AND MUST PARK THE VEHICLE.",
        "vin": "2BXNBDD20KV"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/01/2019",
        "dateOfIncident": "06/22/2019",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228808,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 CAN-AM SPYDER RT. WHILE INSPECTING THE VEHICLE, THE CONTACT DISCOVERED THAT THE TURN SIGNALS WERE ILLUMINATED, BUT WERE NOT VISIBLE TO ONCOMING VEHICLES. THE CONTACT ALSO STATED THAT THE DAYTIME RUNNING LAMPS FAILED TO TURN OFF. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. A DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 400.",
        "vin": "2BXREDD25KV"
    }
]