[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/15/2022",
        "dateOfIncident": "03/14/2022",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456785,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE ESV",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle caught on fire while owner was driving. Owner reported small puff of black smoke prior to fire.",
        "vin": "1GYS4KKJ1KR"
    },
    {
        "components": "UNKNOWN OR OTHER,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "09/29/2021",
        "dateOfIncident": "01/05/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434898,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE ESV",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "When the battery goes low the gear change from park to neutral . That happen to my vehiculo I found few feet outside brim my parking space and it was the gear in neutral",
        "vin": "1GYS3JKJ9KR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/15/2019",
        "dateOfIncident": "12/27/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268683,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE ESV",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY PRIMARY CONCERN WHEN SHOPPING FOR THIS VEHICLE WAS SAFETY, SO INSTEAD OF PURCHASING THE COMPARABLE GMC DENALI, I CHOSE THE CADILLAC WITH THE PREMIUM LUXURY TRIM LEVEL. THE CADILLAC WEBSITE ADVERTISED, AND THE AUTONATION CADILLAC WEST PALM BEACH SALESMAN ASSURED ME, THAT THE PREMIUM LUXURY PACKAGE INCLUDED 'LOW SPEED FORWARD AUTOMATIC BRAKING.' THIS SAFETY FEATURE WAS IMPORTANT TO ME AND WAS NOT AVAILABLE ON THE GMC DENALI.    AFTER PURCHASING THE VEHICLE, THERE WERE UNRELATED ISSUES WHICH PROMPTED ME TO BRING THE CAR IN FOR SERVICE SEVERAL TIMES. THROUGH THAT PROCESS, I LEARNED THAT MY VEHICLE WAS NOT EQUIPPED WITH 'LOW SPEED AUTOMATIC BRAKING' EVEN THOUGH THE REST OF THE FEATURES OF THE PREMIUM LUXURY TRIM LEVEL APPEAR TO BE INCLUDED. THE SERVICE TECHNICIAN INFORMED ME DURING MY LAST VISIT THAT MY VEHICLE WAS NOT IN FACT EQUIPPED WITH 'LOW SPEED AUTOMATIC BRAKING.'    I WRITE YOU THIS LETTER BOTH AS A FRUSTRATED CONSUMER, BUT ALSO AS A CONCERNED CITIZEN. I CAN ONLY WONDER HOW MANY OTHER CUSTOMERS ARE DRIVING AROUND THINKING THEIR VEHICLE IS EQUIPPED WITH 'LOW SPEED AUTOMATIC BRAKING.' I ESCALATED MY CONCERN TO GENERAL MOTORS IN JULY 2019, BUT THEY DENIED MY REQUEST TO INVESTIGATE THIS ISSUE ON JULY 17, 2019. I ALSO CONTACTED THE DEALERSHIP (AUTONATION) BUT HAVE BEEN UNSUCCESSFUL IN RESOLVING THIS AS THEY HAVE BEEN LARGELY UNRESPONSIVE.   GENERAL MOTORS AND CADILLAC CONTINUE THEIR DECEPTIVE ADVERTISING TACTICS TO THIS DAY. IF YOU TO VISIT THEIR WEBSITE, YOU WILL FIND THE  INCONSISTENCY BETWEEN THE DIFFERENT TRIM LEVELS OF THIS VEHICLE. THE TERMINOLOGY IS DECEPTIVE AND CONFUSING TO THE AVERAGE CONSUMER. THERE IS A SAFETY FEATURE CALLED 'LOW SPEED FORWARD AUTOMATIC BRAKING' AND ONE CALLED 'FORWARD/REVERSE AUTOMATIC BRAKING.' NOT ONLY IS THE DIFFERENCE BETWEEN THESE 2 FEATURES CONFUSING TO A LAY PERSON, BUT MY SALESMAN DIDN'T KNOW THERE WAS A DIFFERENCE.   *JS",
        "vin": "1GYS3JKJ4KR"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/06/2019",
        "dateOfIncident": "09/23/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11266568,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE ESV",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ALL ELECTRONIC SAFETY FEATURES WERE ENGAGED, VEHICLE FAILED TO SLOW DOWN PROPERLY, EVEN WITH LAST MINUTE HARD BREAKING BY DRIVER, VEHICLE CRASHED AND REAR ENDED ANOTHER VEHICLE.  DASHCAM FOOTAGE AVAILABLE UPON REQUEST.",
        "vin": "1GYS3JKJ1KR"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/27/2019",
        "dateOfIncident": "02/27/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182807,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE ESV",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS ARE FAR TOO BRIGHT.  THEY ARE BLINDING AND CAUSE TOO MUCH GLARE.  THE HEADLIGHTS CAUSE ME TO HAVE TO LOWER MY MIRRORS. THE TAILLIGHTS ARE ALSO WAY TOO BRIGHT.  WHEN I AM STUCK BEHIND THIS CAR, I AM BLINDED AND I AM SO ANGRY.  ALL HEADLIGHTS MUST BE A SOFT COLOR THAT IS EASY ON THE EYES OF THE DRIVERS IN FRONT AND BEHIND.",
        "vin": ""
    }
]