[
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/13/2022",
        "dateOfIncident": "08/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447307,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Recall N212329840, N182206310, N182206311.  We have received these recalls for the heater block heater cord for our 2019 Chevrolet Silverado Duramax Diesel.  The dealership removed the cord without having a replacement available.  We have made several attempts to have this cord replaced per the recall notice but to no avail. GMC continues to fail to provide a replacement cord or heater block unit.  This part is essential for the Duramax diesel engine to perform in cold climates. Without the heater block functioning the diesel engine will not function properly. We feel this is a safety issue for the maintaining the engine as designed and the occupants of the vehicle. The engine may eventually start in cold climates but start to fail as you drive it because the engine block is not warmed and the fuel will gel. This will cause the truck to stop running as you are driving it. We would like to have NHTSA to investigate why the heater blocks/cords are not available.",
        "vin": "1GC1KTEY3KF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/11/2022",
        "dateOfIncident": "01/23/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446987,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "vehicle often dose Regen (burning of diesel exhaust for emissions).  When vehicle is in regen, outside of the truck, there is a strong odor of burnt rubber mixed with toxic fumes.  It is more noticeable on the passenger side rear  under the right rear tire.  You can also smell exhaust gasses inside the vehicle",
        "vin": "1GC1KSEY4KF"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "11/22/2021",
        "dateOfIncident": "07/21/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441315,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Chevrolet Silverado 2500. The contact received notification of NHTSA Campaign Number: 21V496000 (Equipment) however, the part to do the recall repair was unavailable. The vehicle was taken to the local dealer and it was confirmed that parts were not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was notified of the issue however, no further assistance was provided. The contact was concerned about the vehicle not starting in the cold weather. The contact had not experienced a failure. VIN tool confirms parts not available.",
        "vin": "1GC1KSEY1KF"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/15/2021",
        "dateOfIncident": "09/25/2021",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436966,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle caught fire in engine compartment and caught rest of truck on fire .",
        "vin": "1GC1KREG9KF"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/19/2021",
        "dateOfIncident": "02/16/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397045,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY LOSING CHARGE   ENGINE WILL NOT CRANK  INTERMITTENT AMMETER SHOWING BELOW NORMAL VOLTAGE   DEALERSHIP IS REPLACING ALL BATTERY AND ALTERNATOR CABLES UNDER WARRANTY   DEALERSHIP IS REPLACING IGNITION KEY SWITCH",
        "vin": "2GB2CREG5K1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/05/2021",
        "dateOfIncident": "01/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11394787,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 CHEVROLET SILVERADO 2500. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 55 MPH, THE DRIVER'S AND PASSENGER'S SIDE FRONT AND REAR SIDE CURTAIN AIR BAGS ERRONEOUSLY DEPLOYED, CAUSING THE DRIVER TO LOSE CONTROL OF THE STEERING AND DRIVE OFF THE ROADWAY. DURING THE INCIDENCE, THE DRIVER SUSTAINED AN INJURED NECK AND SKIN BURNS. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO THE LOCAL DEALER DANIELS CHEVROLET LOCATED AT 365 E MAIN ST, SWAINSBORO, GA 30401 WHO WAS UNABLE TO DETERMINE THE CAUSE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 19,000. THE VIN WAS NOT AVAILABLE.*DT",
        "vin": ""
    },
    {
        "components": "STEERING,POWER TRAIN,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/21/2021",
        "dateOfIncident": "11/19/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389212,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERE SHAKE WHEN BRAKING AT HIGH SPEEDS, FUEL TANK FAILED (VEHICLE WAS SPEWING DIESEL) - IT TOOK 3 MONTHS TO GET A NEW TANK, TRANSFER CASE HAS FAILED MULTIPLE TIMES. WE HAVE BEEN HAVING THESE PROBLEMS SINCE THE DAY WE PICKED UP THE TRUCK.I HAVE SERVICE RECORDS SHOWING ALL THE REPAIRS. GM IS AWARE OF THE PROBLEMS BUT CLAIM 'THERE IS NOTHING THEY CAN DO BUT WAIT FOR A FIX'.",
        "vin": "1HTKJPVM2KH"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/17/2020",
        "dateOfIncident": "11/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374988,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUCK WAS ISSUED A RECALL FOR THE ENGINE BLOCKER HEATER WHICH WAS PERFORMED.   SINCE THAT RECALL WAS PERFORMED I KEEP GETTING LOW COOLANT WARNINGS ON THE DASH IN ERROR.    THE VEHICLES WAS TAKEN BACK TO DEALER AND EVERYTHING WAS CHECKED.   THEY REFILLED THE SYSTEM JUST INCASE THERE WAS AN AIR POCKET BUT THEY WARNED ME ABOUT 4 OUT OF 10 PEOPLE THAT HAVE THE RECALL PERFORMED CONTINUALLY GET A LOW COOLANT LIGHT.    THE TRUCK WAS FINE FOR 2 MONTHS AND NOW I'M BACK TO HAVING THE LOW COOLANT LIGHT ON.   THE COOLANT LEVEL LOOKS FINE.   I CALLED THE DEALER AND THEY SAID GM KNOWS ABOUT IT BUT NO FIX IS AVAILABLE BECAUSE THROWING PARTS AT IT LIKE A NEW RESERVOIR TANK AND COOLANT SENSOR DOESN'T SEEM TO FIX THE ISSUE.   WE'RE BEING TOLD TO SIMPLY IGNORE THE WARNING DISPLAYED ON THE DASH FOR NOW.      TO ME IT IS TOTALLY UNACCEPTABLE THAT THE \"FIX\" FOR THE ENGINE CLOCK HEATER RECALL HAS NOW CREATED A SECONDARY ISSUE THAT HAS NOT BEEN ADDRESSED.   SINCE YOU HAVE THE DATABASE OF VINS THAT WERE PART OF THE ENGINE BLOCK HEATER RECALL I ASK THAT YOU REACH OUT TO THOSE PEOPLE THAT HAVE HAD THE FIX PERFORMED AND FIND OUT HOW MANY ARE NOW HAVING A LOW COOLANT ISSUE AS A RESULT OF THAT REPAIR BEING MADE.",
        "vin": "1GC1KTEY6KF"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/07/2020",
        "dateOfIncident": "09/06/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353513,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AT LIWER SPEEDS MY TRUCK KEEPS SURGING FORWARD. I ONLY HAVE 9500 MILES ON IT AND IS ONE YEAR OLD. UNDER NORMAL BRAKING IT WORKS FINE, BUT AT LOWER SPEEDS IT IS A BEAR TO STOP. YESTERDAY I ALMOST MISSED MY TURN BECAUSE IT SURGED FORWARD, AND LAST WEEK IT OVERSHOT THE INTERSECTION BY A FEW FEET BECAUSE IT SURGED AHEAD.",
        "vin": "1GC1KTEY8KF"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/29/2020",
        "dateOfIncident": "07/09/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11342170,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JULY 9 2020 AT APPROXIMATELY 1900 ENROUTE HOME FROM WORK, FOR REASONS UNKNOWN, DRIVER, (MY 26 Y/O SON ) LOST CONSCIOUSNESS AND SUBSEQUENTLY LOST CONTROL OF VEHICLE (2019 CHEVROLET SILVERADO 2500HD CREW CAB LONG BED 4X4) WHILE IN MOTION HEADING SOUTHWEST ON A 2 LANE NON DIVIDED LOCAL RURAL ROAD. VEHICLE CROSSED CENTER LINES AND UNOCCUPIED ONCOMING LANE AND TRAVELED OFF THE ROAD AT 1022 TAMARAC RD, BRUNSWICK, NY AND STRUCK A GROUP OF TREES DEAD CENTER OF FRONT END SHEARING ALL TREES OFF AT IMPACT. DRIVER BECAME ALERT AT FIRST IMPACT. TREES CAME TO REST ON ROOF OF CAB.  ***THERE WAS SOME SMOKEY POWDER BUT NO AIR BAGS IN THE CAB COMPARTMENT DEPLOYED. *** A SMALL BURNT TEAR NOW EXISTS IN THE HEADLINER OVER THE STEERING WHEEL THAT APPEARS THE AIR BAG ACTUATOR MAY HAVE MISFIRED.  PROPERTY OWNERS/ RESIDENTS WHERE CRASH OCCURRED COMPELLED DRIVER TO EXIT VEHICLE DUE TO UNKNOWN SOURCE OF WHAT APPEARED TO BE SMOKE. PROPERTY OWNERS CALLED 911. DRIVER WALKED TO AND WAS TRANSPORTED TO HOSPITAL BY AMBULANCE. DRIVER SUFFERED SOME INTERNAL BLEEDING AND NUMEROUS CONTUSIONS AND ABRASIONS FROM SEATBELTS AND IMPACT WITH STEERING COLUMN. VEHICLE WAS UNDRIVEABLE AND NEEDED TO BE RECOVERED AND TOWED ON FLATBED TRUCK FROM SCENE.",
        "vin": "1GC1KREGXKF"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/16/2020",
        "dateOfIncident": "05/28/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339685,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2019",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Michelin North America, Inc.",
                "productMake": "BFGOODRICH",
                "productModel": "LT275/65R20 126/123S TL ALL TERRAIN T/A KO LRE  RWL GO",
                "productYear": "9999",
                "size": "LT275/65R20",
                "type": "Tire"
            }
        ],
        "summary": "WHILE OPERATING VEHICLE, ENTERING INTERSTATE I STARTED TO EXPERIENCE UNCONTROLLABLE VIBRATION IN THE REAR OF MY VEHICLE. THE PASSENGER REAR TIRE HAD SUDDENLY LOST TREAD WITHOUT WARNING. THE TIRE IN QUESTION IS LT275/65R20 BFGOODRICH ALL TERRAIN T/A KO2. LUCKILY I WAS ABLE TO REMAIN IN CONTROL OF VEHICLE OTHERWISE THIS COULD HAVE EASILY RESULTED IN LOSS OF CONTROL OF VEHICLE AND WORST CASE FATALITY. THE TIRE IN WHICH LOST TREAD CAUSED $3400-3700 IN DAMAGES, LEFT ME WITHOUT A FULL SET OF TIRES THAT WERE AT ONLY HALF LIFE AND A VEHICLE THAT HAS SAT FOR A MONTH AND A HALF DUE TO SAID DAMAGES. TO THIS DATE MICHELIN NORTH AMERICA HAS NOT FOLLOWED THROUGH TO RIGHT THIS WRONG IN ITS PRODUCTS. THIS INCIDENT OCCURRED ON MAY 28TH AND WAS HANDLED IN A MATTER OF HOURS ON MY END. MICHELIN HAS CONTINUOUSLY DRAGGED THEIR FEET THROUGH THE ENTIRE PROCESS WHICH TOOK THEM A MONTH AND A HALF TO COME TO THE CONCLUSION THAT IT WAS NOT THEIR PROBLEM BUT MY PROBLEM. THE CUSTOMER SERVICE THAT WAS CONTACTED WAS ON AVERAGE HARD TO WORK WITH AND PROVIDED VERY LITTLE DIRECTION AND INSIGHT THAT THIS WOULD BE RESOLVED IN A TIMELY MANNER. WHEN BEING TRANSFERRED TO THE CLAIMS DEPARTMENT IT WAS AN EVEN WORSE EXPERIENCE WITH VERY LITTLE COMMUNICATION, INDIVIDUALS THAT RARELY ANSWERED PHONE CALLS AND STAFF THAT HAS NO CARE FOR THE CUSTOMERS THAT RELY ON MICHELIN PRODUCTS.",
        "vin": "1GC1KTEG3KF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/28/2020",
        "dateOfIncident": "09/25/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326308,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE SURGES WHEN LETTING OUT OF THE PEDAL AND COMING TO A STOP. I HAVE BEEN TOLD BY THE CHEVY SERVICE DEPARTMENT  THAT THEY DON'T SEE IT. THE RPM'S DROP AND PICK BACK UP 3-6 TIMES WITH NO FOOT ON THE PEDAL SLOWING DOWN TO A STOP. IT HAPPENS ALL THE TIME. FOR THEM NOT TO SEE A PROBLEM IS RIDICULOUS.  *TR",
        "vin": "1GC1KTEY1KF"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/11/2020",
        "dateOfIncident": "05/09/2020",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324112,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE COMPARTMENT FIRE WITH VISIBLE FLAMES. DRIVING ON A GRAVEL ROAD APPROXIMATELY 10 MILES PER HOUR. STOPPED TO CHECK OUT THE ROAD CONDITIONS AHEAD AND THERE WAS SMOKE COMING OUT OF THE DRIVERS SIDE FRONT WHEEL WELL. TURNED THE TRUCK OFF. OPENED THE HOOD AND THERE WERE VISIBLE FLAMES BEHIND THE ENGINE NEAR THE FIRE WALL. WE PUT THE FIRE OUT WITH BOTTLED WATER.  *TR",
        "vin": "1GC1KTEY5KF"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/02/2020",
        "dateOfIncident": "04/23/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323066,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER PICKING UP MY TRUCK FOR A  TSB REPAIR 5095411 THEY SAY   DRIVING HOME USING EXHAUST BRAKE GOING DOWNHILL ABOUT 65-70 YOU FEEL A POP OR BANG. HAPPENED ABOUT 3 TIMES BY THE TIME I GET DOWN THE HILL.",
        "vin": "1GC1KTEY5KF"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/02/2020",
        "dateOfIncident": "02/26/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323067,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER PICKING UP TRUCK FROM DEALER FOR FIRST OIL CHANGE. NOTICED A RATTLING SOUND SEEMS TO BE COMING FROM BELL HOUSING AREA.  DEALER SAYS ITS A DIESEL THATS THE WAY THEY SOUND..SOUNDS LIKE SOMETHING IS ROLLING AROUND IN BELL HOUSING",
        "vin": "1GC1KTEY5KF"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/02/2020",
        "dateOfIncident": "04/25/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323064,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN HILL ABOUT 65-70 I TURNED THE EXHAUST BRAKE ON AND THE TRUCK MADE A BIG BANG NOISE AND THEN SOUNDED LIKE SOMETHING WAS GRINDING. THEN WENT INTO LIMP MODE LIGHT ON DASH CAME ON TOO. I MADE IT HOME BUT WENT TO PUT IN REVERSE AND NOTHING, NO REVERSE",
        "vin": "1GC1KTEY5KF"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/19/2020",
        "dateOfIncident": "03/18/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318681,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES ON TRUCK WAS ENGAGING WITHOUT PRESSING ON THE BRAKE PEDAL.  THIS WORN DOWN THE BRAKE PADS.  BRAKE COMPANY SAID THE PUMP FAILED CAUSING THIS TO HAPPEN.",
        "vin": "1GC1CREG2KF"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/16/2020",
        "dateOfIncident": "11/20/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309550,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "NOVEMBER 20, 2019 WITH ONLY 1380 ON THE NEW 2019 SILVERADO.  WHILE LEAVING A PARKING GARAGE IN THE MORNING IN RENO, NEVADA IT WAS 28 DEGREES. WHEN DRIVING OUT THE TRANSMISSION SEEMED TO HAVE LOST CONNECTION.  THE ENGINE WAS RUNNING BUT THE TRANSMISSION WAS NOT ENGAGING.  I FEATHERED THE THROTTLE AND IT REENGAGED. AFTER ENTERING THE STREET I TRAVELLED ABOUT 300 TO 600 FEET AND THE TRANSMISSION WENT TO SHIFT BUT NEUTRALIZED.  AGAIN, I FEATHERED THE THROTTLE AND IT ENGAGED AGAIN.  AT ABOUT 2500 MILES THE TRANSMISSION DID IT AGAIN.  THE DEALERSHIP SAID THAT THEY HAVE CONTACTED CHEVROLET ABOUT THE PROBLEM,BUT CHEVROLET DOES NOT HAVE A FIX FOR IT.  THE DEALERSHIP SERVICE ADVISOR TOLD ME THAT IN THE FUTURE TO START THE VEHICLE AND LET IT RUN FOR 3-5 MINUTES BEFORE DRIVING THE VEHICLE.",
        "vin": "2GC2KSEG8K1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/13/2020",
        "dateOfIncident": "01/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309024,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "GM RECALL ON BLOCK HEATER CORD. THIS HAS BEEN OPEN FOR OVER 1 YEAR, AND I HAVE NOT HEARD ANYTHING ABOUT THE FIX.   SURELY THEY HAVE FIGURED OUT WHAT TO DO TO FIX PROBLEM!  RE: NHTSA# 19V328",
        "vin": "1GC1KREY6KF"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/02/2020",
        "dateOfIncident": "10/01/2019",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11296698,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 CHEVROLET SILVERADO K2500HD. THE CONTACT STATED THAT WHILE DRIVING AT SPEEDS OF APPROXIMATELY 35 MPH OR HIGHER, THEY WOULD NOTICE THAT THE VEHICLE WOULD BEGIN TO EMIT SPARKS FROM THE REAR END. THE FAILURE OCCURRED ON THREE OCCASIONS. THE CONTACT WAS CONCERNED THAT THE FAILURE COULD RESULT INTO A FIRE. THE CONTACT TOOK THE VEHICLE TO THE DEALER (COLONIAL CHEVROLET LOCATED AT 12420 JEFFERSON DAVIS HWY, CHESTER, VA 23831; PHONE NUMBER 804-748-646) WHO WERE UNABLE TO IDENTIFY THE CAUSE OF THE FAILURE. THE FAILURE CONTINUED TO OCCUR. THE CONTACT RETURNED THE VEHICLE TO THE DEALER WHO THEN SPOKE WITH GM AND WAS ADVISED TO PLACE THE VEHICLE INTO REGION MODE AND IF THEY DID NOT NOTICE THE SPARKS THAN THEY WERE ABLE TO RETURN THE VEHICLE TO THE OWNER. THE VEHICLE HAD NOT BEEN REPAIRED. THE CONTACT HAD NOT CONTACTED THE MANUFACTURER. THE APPROXIMATE FAILURE MILEAGE WAS 5,235.",
        "vin": "1GC1KTEY2KF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/16/2019",
        "dateOfIncident": "04/25/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268881,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 CHEVROLET SILVERADO 2500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V328000 (ENGINE). THE CONTACT CALLED ANTELOPE VALLEY CHEVROLET AT 855-790-7876 (LOCATED AT 1160 MOTOR LN, LANCASTER, CA 93534) AND WAS INFORMED THAT THE VEHICLE WAS NOT INCLUDED IN THE RECALL. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "1GC1KTEY7KF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/15/2019",
        "dateOfIncident": "10/13/2019",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268508,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2019 CHEVROLET SILVERADO 2500. WHILE PULLING INTO THE DRIVEWAY, THE ENGINE COMPARMTMENT CAUGHT FIRE. THE FIRE SPREAD AND BURNED THE ENTIRE VEHICLE. THE POLICE AND FIRE DEPARTMENTS WERE PRESENT. THE FIRE WAS EXTINGUISHED BY THE FIRE DEPARTMENT. THE DRIVER WAS ABLE TO EXIT THE VEHICLE BEFORE THE FIRE SPREAD. THERE WERE NO INJURIES. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE DEALER WAS NOT NOTIFIED. THE MANUFACTURER WAS CONTACTED. THE CONTACT WAS INFORMED ONLINE THAT THE MANUFACTURER DECIDED NOT TO MAIL THE RECALL LETTER BECAUSE NO ONE WAS INJURED OR KILLED, AND THERE WAS NO REMEDY FOR THE FAILURE. THE VEHICLE WAS DESTROYED. THE VEHICLE REMAINED AT THE CONTACT'S HOME. THE FAILURE MILEAGE WAS 5,000.",
        "vin": "1GC1KTEY6KF"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/19/2019",
        "dateOfIncident": "07/15/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256720,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IN TOWN AND SLOWING DOWN THE TRANSMISSION DOWN SHIFTS AND MAKES A LOUD CLUNK NOISE JUST BELOW 10 MPH AND ETHER THE TRANSMISSION OR REAR DIFFERENTIAL LOCK UP AND MAKE THE REAR TIRES LOCK UP FOR ABOUT ONE SECOND. THIS HAPPENS MORE DURING THE FIRST DRIVE IN THE MORNING BUT WILL HAPPEN ANYTIME WITH NO WARNING. I AM VERY WORRIED ABOUT TOWING WITH IT.  ## VIN PASSED ## , ##",
        "vin": "1GC1KTEY6KF"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/10/2019",
        "dateOfIncident": "09/07/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254349,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 CHEVROLET SILVERADO 2500. WHILE ATTEMPTING TO ACCELERATE FROM A STOP, THERE WAS A CLICKING SOUND COMING FROM THE STEERING WHEEL. THE CONTACT STATED THAT THE TRACTION CONTROL WARNING INDICATOR ILLUMINATED FOR APPROXIMATELY TWO SECONDS AND THERE WAS A RESISTANCE IN THE STEERING WHEEL. PELLEGRINO CHEVROLET (LOCATED AT 1000 GATEWAY BLVD, WESTVILLE, NJ 08093, (856) 432-4015) WAS CONTACTED BY PHONE AND AN APPOINTMENT WAS SCHEDULED TO HAVE THE VEHICLE DIAGNOSED, WHICH WAS STILL PENDING. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE APPROXIMATE FAILURE MILEAGE WAS 7,533.",
        "vin": "2GC2KREG3K1"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/06/2019",
        "dateOfIncident": "06/06/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218360,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 CHEVROLET SILVERADO 2500. THE CONTACT STATED THAT THERE WAS AN UNSTABLE CONDITION CONCERNING THE OEM TIRES. THE CONTACT WAS UNCERTAIN IF THE FAILURE WAS RELATED TO WHEEL DIMENSIONS OR THE SUSPENSION. THE CONTACT WAS UNABLE TO SCHEDULE A REPAIR WITHIN A REASONABLE TIMEFRAME WITH CHEAP CHEVROLET (714 W WATER ST, FLEMINGSBURG, KY 41041, (606) 845-2261) AND KERRY CHEVROLET (7500 ALEXANDRIA PIKE, ALEXANDRIA, KY 41001,  (859) 474-2826); HOWEVER, THE CONTACT WAS INFORMED THAT THE TWO REAR TIRES AND FRONT DRIVER'S SIDE TIRE MAY NEED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "1GC1KTEY0KF"
    },
    {
        "components": "ELECTRICAL SYSTEM,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "05/03/2019",
        "dateOfIncident": "04/26/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205567,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 CHEVROLET SILVERADO 2500. THE CONTACT RECENTLY PURCHASED THE VEHICLE. WHEN THE CONTACT ATTEMPTED TO EXIT THE DRIVEWAY, THE REARVIEW CAMERA SCREEN WENT BLANK. THE CONTACT HAD TO REVERSE BACK INTO THE DRIVEWAY, PLACED THE VEHICLE INTO PARK, AND THE CAMERA WORKED AGAIN. ALSO, \"SERVICE REAR VISION SYSTEM\" APPEARED ON THE INSTRUMENT PANEL. THE VEHICLE WAS TAKEN TO BALISE CHEVROLET OF WARWICK (1338 POST RD, WARWICK, RI 02888, (877) 214-6563) TO BE DIAGNOSED, BUT THE TEST PRODUCED NO RESULTS. THE FAILURE COULD NOT BE DUPLICATED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT TO BRING THE VEHICLE TO THE DEALER. THE FAILURE MILEAGE WAS 20.",
        "vin": "3GCPYCEH3KG"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/19/2019",
        "dateOfIncident": "03/06/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190070,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 CHEVROLET SILVERADO 2500. WHILE DRIVING 65 MPH, A LOUD EXPLOSIVE NOISE WAS HEARD FROM THE ENGINE COMPARTMENT AND THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE VEHICLE DECELERATED AND WAS COASTED OVER TO THE SIDE OF THE ROAD. WHEN THE VEHICLE WAS POWERED OFF AND RESTARTED, THE FAILURE RECURRED. THE CONTACT WAS ABLE TO DRIVE THE VEHICLE AT A LOW SPEED TO HER RESIDENCE. THE VEHICLE WAS LATER TAKEN TO PETERSON CHEVROLET BUICK CADILLAC (LOCATED AT 12300 W FAIRVIEW AVE, BOISE, ID 83713, (280) 323-5000) WHERE IT WAS DIAGNOSED THAT THE SENSOR CONNECTED TO THE TRANSMISSION FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED TEN MINUTES AFTER LEAVING THE DEALER. THE VEHICLE WAS TAKEN BACK TO THE DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 3,000.",
        "vin": "1GC1KUEY8KF"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/18/2019",
        "dateOfIncident": "12/20/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180875,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN VEHICLE IS ACCELERATING ANYWHERE FROM 30-50 MPH, THE TRUCK LOSES POWER FOR SEVERAL SECONDS, AND STARTS SPUTTERING OR CHUGGING. THE RPM ON THE DASH STARTS BOUNCING UP AND DOWN. THIS GOES ON FOR SEVERAL SECONDS AND TRUCK SLOWS DOWN. IT THEN GOES AWAY AND CAN CONTINUE DRIVING. HOWEVER, WHEN TOWING TRAILERS, THE EFFECT IS ONLY INCREASED AND THE TRUCK SLOWS DOWN EVEN MORE.",
        "vin": "1GC1KTEY8KF"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/18/2019",
        "dateOfIncident": "09/20/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180877,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN VEHICLE IS ACCELERATING ANYWHERE FROM 30-50 MPH, THE TRUCK LOSES POWER FOR SEVERAL SECONDS, AND STARTS SPUTTERING OR CHUGGING. THE RPM ON THE DASH STARTS BOUNCING UP AND DOWN. THIS GOES ON FOR SEVERAL SECONDS AND TRUCK SLOWS DOWN. IT THEN GOES AWAY AND CAN CONTINUE DRIVING. HOWEVER, WHEN TOWING TRAILERS, THE EFFECT IS ONLY INCREASED AND THE TRUCK SLOWS DOWN EVEN MORE.",
        "vin": "1GC4KXY6KF1"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/17/2019",
        "dateOfIncident": "02/04/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180622,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAND NEW, ONE MONTH OLD TRUCK HAS EXCESSIVE PAINT CHIPPING. MY TRUCK HAS ONLY 4500 MILES AND I HAVE OVER 20 SPOTS WHERE MY PAINT IS CHIPPED OR PEELING. I HAVE SEEN HUNDREDS OF OTHER PEOPLE ONLINE (SOME THAT WERE ABLE TO GET THE ISSUE RECALLED) WITH THE SAME PROBLEM.  I DO NOT FIND IT ACCEPTABLE AS PAINT SHOULD LAST AT LEAST 4 YEARS WITHOUT THE AMOUNT OF CHIPPING AND PEELING I'M EXPERIENCING.  I HAVE CALLED JUST ABOUT EVERY DEALER WITHIN 80 MILES OF ME, THEY ALL TELL ME THEY UNDERSTAND THERE IS A PAINT ISSUE, BUT NONE OF THEM WILL DO ANYTHING ABOUT IT.",
        "vin": "1GC1KUEY6KF"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/23/2019",
        "dateOfIncident": "01/16/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171670,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "SEE NHTSA ID NUMBER 10126955 MANUFACTURER COMMUNICATION NUMBER PIT5341C    THERE IS NO WAY TO TURN OFF THE AUTO DOOR LOCKS FEATURE.    5 ADULTS WERE ON A SKI TRIP, 4 ENTERED THE VEHICLE AND ONE WAS DELAYED.  NEITHER DRIVER OR OTHER OCCUPANTS NOTICED 1 WAS MISSING AND AND DEPARTED.  THE ONE PASSENGER WAS LOCKED OUT OF THE VEHICLE AND HANGING ON TO THE DOOR HANDLE AS THE VEHICLE WAS DRIVEN OUT OF THE PARKING LOT!  AFTER THIS EVENT, I WISH THE DOOR WOULD HAVE OPENED AND THE PASSENGER COULD HAVE JUMPED IN.  THE DRIVER WOULD HAVE NOTICED AND LET THE PASSENGER IN, NO PROBLEM.   AS THE ULTIMATELY RESPONSIBLE DRIVER, I WISH I COULD HAVE OPENED / UNLOCKED THE DOOR, HOWEVER THE TRUCK LOCKED IT AUTOMATICALLY (UNKNOWN TO THE DRIVER).      IS THERE AN NHTSA REGULATION THAT REQUIRES DOORS TO LOCK AUTOMATICALLY?",
        "vin": "1GC1KSEY8KF"
    }
]