[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/24/2022",
        "dateOfIncident": "03/24/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458215,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The rear window is separating from the convertible top on my vehicle.  There is an NHTSA ID: 10137486 for models up to 2017, but mine is a 2019 and doing the same thing as this.",
        "vin": "1G1FB3DS1K0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/30/2021",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434985,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Chevrolet Camaro. The contact stated while driving at various speeds, while steering the vehicle wobbled without warning. The contact stated that the wobble occurred with the rear wheels. The contact stated that the inside tread on the rear tires was worn and the tires needed to be replaced. The contact had taken the vehicle to a dealer where they performed a diagnostic test and found no failure with the vehicle. As the failure persisted, the rear tires were replaced for a second time. The contact took the vehicle back to the dealer and provided the same result. The contact then took the vehicle to Advantage Chevrolet of Bridgeview (8200 S Harlem Ave, Bridgeview, IL 60455) where he was informed that the four wheels were loose, the lower control arm needed to be replaced and a four-wheel alignment was performed. The contact had the vehicle serviced by the dealer; however, the failure persisted, and the contact replaced all four tires. The manufacturer was not notified of the failure. The vehicle was not repaired. The failure mileage was approximately 30,000.",
        "vin": "1g1fh1r78k0"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/05/2021",
        "dateOfIncident": "11/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386735,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR SOMETIMES WILL NOT START. KEY FOBS HAVE BEEN REPLACED NEW FROM CHEVROLET DEALER ALSO NEW BATTERY AND MULTIPLE CHEVROLET DEALERS CAN NOT FIND A PROBLEM BUT MANY TIMES THE CAR WILL NOT START.",
        "vin": "1G1FB3DS7K0"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/06/2020",
        "dateOfIncident": "09/21/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363009,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ABS & ESC LIGHT KEEPS COMING ON & OFF ON THE DASH NOW THE HOOD OPEN MESSAGE IS POPPING ON & OFF NOT ALLOWING ME TO LOCK MY DOORS BECAUSE IT TRIGGERS THE THEFT ALARM. VEHICLE IS LEFT UNLOCKED 24/7 DUE TO THIS ELECTRICAL ISSUE IT SEEMS WATER HAS SEEPED INTO LEFT HEADLIGHT BECAUSE MOISTURE IS IN THERE. THIS HAPPENS WHEN THE VEHICLE IS STATIONARY & MOVING. VEHICLE WAS PUT IN THE SHOP HOOD SENSOR MATCHED WAS CHANGED 3X STILL NOT WORKING",
        "vin": "1G1FB1RS1K0"
    },
    {
        "components": "STEERING,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/05/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362903,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2019 CAMARO SS2 BRAND NEW SHUT DOWN AND RESTARTED 3 TIMES WHILE IN MOTION. THEN I STOPPED KILLED ENGINE AND IT WOULDN'T RESTART, COULDN'T TURN ON FLASHERS, COMPLETELY DEAD. I FINALLY OPENED DRIVER DOOR AND CLOSED AND WAS ABLE TO START IT. THE STEERING QUIT WHILE PARKING, AND PERIODICALLY THE CAR WONT LOCK. DEALER SAID NOTHING WRONG, NO CODES",
        "vin": "1G1FH1R78K0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/07/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327596,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TRANSMISSION HAS AN ISSUE WHERE IT IS DIFFICULT TO SHIFT INTO 2ND GEAR AND SOMETIMES WHEN SHIFTING INTO SECOND GEAR, IT KICKS ME OUT AND PLACES ME IN NEUTRAL. THE HOUSING ON THE TRANSMISSION AND THE TRANSMISSION IS DEFECTIVE AND THE CHEVROLET DEALERS DO IT WANT TO HELP ME!",
        "vin": "1G1FG1R75K0"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/13/2019",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288903,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 CHEVROLET CAMARO. WHILE DRIVING APPROXIMATELY 80 MPH, THE ENGINE SUDDENLY STALLED. THE VEHICLE WAS TOWED TO GILLMAN CHEVROLET (1801 INDUSTRIAL WAY, SAN BENITO, TX) WHERE IT WAS DIAGNOSED THAT THE LIFTERS INSIDE THE ENGINE FAILED AND THE ENGINE NEEDED TO BE REPLACED. THE ENGINE WAS REPLACED AND THE FAILURE WAS REMEDIED. ALSO, WHILE THE VEHICLE WAS IN REVERSE, THE BACKUP CAMERA WOULD NOT DISPLAY AN IMAGE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURES. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 1,000.",
        "vin": ""
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/17/2019",
        "dateOfIncident": "10/16/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11269130,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 CHEVROLET CAMARO. WHILE DRIVING APPROXIMATELY 50 MPH, THE DRIVER ATTEMPTED TO TURN THE VEHICLE TO MAKE A RIGHT TURN. THE CONTACT STATED THAT THE BRAKE PEDAL WAS DIFFICULT TO DEPRESS. THE CONTACT LOST CONTROL OF THE VEHICLE AND STRUCK A POLE. THE DRIVER'S AIR BAG FAILED TO DEPLOY. THE DRIVER SUFFERED BACK INJURIES THAT DID NOT REQUIRE MEDICAL ATTENTION. THE ONSTAR SYSTEM PROVIDED AN ALERT THAT THE ANTI-LOCK BRAKE SYSTEM AND STABILITRAK WERE DEFECTIVE AND THE VEHICLE SHOULD BE SERVICED WITHIN SEVEN DAYS. ONSTAR DETECTED THE BRAKE FAILURE THE DAY AFTER THE CRASH. THE VEHICLE WAS TOWED AND A POLICE REPORT WAS FILED. THE MANUFACTURER WAS CONTACTED AND PROVIDED CASE NUMBER: 95584814713. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE DEALER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 9,000. *LN*JB",
        "vin": "1G1FB1RX6K0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/08/2019",
        "dateOfIncident": "08/07/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242442,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING STRAIGHT ON AUGUST 7, 2019 JUST OFF OF SHORT CUT ROAD (JUST A REGULAR STREET) SOMETIME AFTER 3PM AND BEFORE 4PM IN MARYLAND WITH MY SUNROOF NOT FULLY OPENED (FIRST STAGE).  IT WAS NOT RAINING.  WHILE DRIVING, I HEARD A VERY LOUD SOUND AS IF A GUN WENT OFF.  I THEN WAS SHATTERED WITH GLASS.  I LOOKED UP AND COULD SEE STRAIGHT THROUGH AND SAW THAT THE SUNROOM SHATTERED.  I STOPPED AND LOOKED AT THE DAMAGE.  BASICALLY, THE SUNROOF JUST EXPLODED.  THE CAR WAS NOT HURT OTHER THAN THE SUNROOF.  GLASS WAS EVERYWHERE INSIDE THE CAR AND ON ME.  I WAS NOT HURT AND I PROCEEDED BACK HOME.   I CALLED MY INSURANCE COMPANY GEICO WHEN I GOT HOME ON AUGUST 7, 2010.  TODAY, I TOLD PEOPLE AND THEY TOLD ME TO GO TO YOUR WEBSITE AND PUT IN COMPLAINT.  I WILL BE CALLING THE DEALERSHIP TODAY.  I HAVE NO PHOTO.",
        "vin": "1G1FH1R78K0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/12/2019",
        "dateOfIncident": "07/12/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231478,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TODAY IN THE MORNING, I WAS DRIVING ON THE HIGHWAY TO WORK AND AS I WAS DRIVING AT ABOUT 45 MPH, I HEARD A CLUNK SOUND UNDER THE CAR AND THE ENGINE LIGHT CAME ON. I SLOWED DOWN AND STOPPED AT A TRAFFIC LIGHT  AND THEN I BEGIN TO DRIVE AGAIN AND I NOTICED THAT MY CAR WAS DRIVING AT A HIGH RPM  AND IT SEEMED LIKE WAS STUCK AT A SHIFT AND IT DIDN'T WANT TO CHANGE GEARS SO I SLOWED DOWN PULLED INTO AN ENTRANCE AND TURNED OFF MY VEHICLE I LOOKED UNDER THE CAR AND I DIDNT SEE ANYTHING WRONG; NO LEAKS OR NOTHING. I TURNED IT BACK ON AND DROVE IT TO AUTO PARTS TO SEE HAVE THEM RUN A CHECK ENGINE LIGHT TEST AND 3 CODES CAME UP WHICH WAS P0964, P0966, AND P0700. AFTER THAT I TOOK IT BACK HOME AT A SLOW SPEED AND LEFT IT THERE UNTIL I GOT BACK HOME FROM WORK. I STARTED MY CAR UP AND DIDNT SEE THE CHECK ENGINE LIGHT ON ANYMORE. I CALLED MY DEALERSHIP TO HAVE IT SERVICED AND CHECKED.",
        "vin": "1G1FF1R72K0"
    }
]