[
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/14/2022",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456599,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Chevrolet Corvette. The contact stated that while driving at various speeds, the low tire pressure warning light would illuminate on the instrument panel. The contact stated that she added air to the tires however, the low tire pressure warning light remained illuminated. The contact had taken the vehicle to an independent mechanic where they diagnosed the cause of the failure as cracks in the rear passenger’s and driver’s side wheels. The manufacturer had yet to be notified of the failure. The vehicle had yet to be repaired. The failure mileage was approximately 10,000.",
        "vin": "1g1yw2d72k5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/30/2022",
        "dateOfIncident": "01/30/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449488,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 Corvette Grand Sport  August 2021 - Driver side rear wheel cracked losing pressure rapidly making continued driving dangerous.  Instructed by a local dealership to drive at minimum speed to the dealership to prevent the degradation and potential catastrophic failure of the wheel and/or tire.  Drove to a local dealership where the wheel was inspected and confirmed to be cracked.  Wheel was replaced with a new OEM GM Corvette wheel.  January 2022 - Passenger side front wheel cracked losing pressure rapidly making continued driving dangerous. Immediately drove the vehicle home and parked it until I could confirm the problem.  Have not driven it since and will being the process of replacement within the week (01/30/2022).",
        "vin": "1G1YX2D71K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/15/2021",
        "dateOfIncident": "05/25/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443938,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Chevrolet Corvette. The contact stated while driving 65 MPH, the passenger’s side rear tire low-pressure warning light illuminated. The contact stopped at a service station and added air to the tire and proceeded to drive however, the warning light illuminated again. The contact took the vehicle to a local tire shop who inspected the vehicle and diagnosed the failure as a cracked rim. The contact took the vehicle to the local dealer and it was confirmed that the rim was cracked. The rim was replaced. The contact stated that several months later the failure recurred on the driver’s side rear wheel. The contact took the vehicle to AutoNation Chevrolet Valencia (23649 Valencia Blvd, Santa Clarita, CA 91355, (661) 200-9107) and it was determined that the rim was cracked. The rim was replaced. The contact was concerned that the failure would return. The manufacturer was made aware of the failure. The failure mileage was approximately 17,000.",
        "vin": "1g1yy2d73k5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/24/2021",
        "dateOfIncident": "11/24/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441573,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Chevrolet Corvette. The contact stated that while driving at 25 MPH, the low tire pressure warning light illuminated. The contact stated that he added air to the tires however, the low tire pressure warning light illuminated again. The contact stated that he then took the vehicle to an independent mechanic who diagnosed the failure as a driver's side rear cracked rim. The vehicle was not repaired as he was waiting to transport it to the dealer. The manufacturer was notified of the failure and advised the contact to take the vehicle to a Chevrolet dealer for diagnosis. The failure mileage was 6,500.",
        "vin": "1G1YU2D63K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/04/2021",
        "dateOfIncident": "10/26/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439377,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "During routine service at my Chevy dealership, both passenger side wheels were bent (out-of-round), requiring repair, at 20,793 miles.  This is the send time the passenger rear wheel was found to be bent, requiring repair.",
        "vin": "1G1YY2D75K5"
    },
    {
        "components": "POWER TRAIN,WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/27/2021",
        "dateOfIncident": "10/07/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438419,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Chevrolet Corvette. The contact stated while driving 45 MPH, the RPM decreased to 1,200 and the vehicle started to shudder and shake. The contact was able to continue to drive the vehicle to the residence. The contact took the vehicle to a local dealer to be inspected. The dealer performed a transmission flush to fix the failure however, the failure persisted. The contact took the vehicle back to the local dealer who inspected the vehicle and diagnosed the vehicle with 3 bent wheels. The wheels were not replaced. The manufacturer was not made aware of the failure. The failure mileage was approximately 4,399. Per the dealership, the bent wheels are not covered under warranty and the problem is the result of normal wear-and-tear. However, I found numerous complaints on the internet stating GM made the wheels with inferior material that is \"cast, rather than forged, and is of insufficient strength to withstand the torque and power input from the drivetrain,\" I am now scared to drive the car because the bent wheels or a safety hazard and will more than likely start to crack which could result in causing a wreck. At this time the only way to correct the failure is to purchase new wheels if I wish to continue to drive the car and prevent from being a safety hazard or causing a collision.",
        "vin": "1g1yy2d79k5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/16/2021",
        "dateOfIncident": "10/15/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436983,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The front rims are bent",
        "vin": "1G1YY2D77K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/04/2021",
        "dateOfIncident": "09/28/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435425,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "OEM wheels fail. Thousands of online reports of 2015-2019 Corvette C7 Grand Sport and Z06 models wheels cracking without incident. My wheel is available for inspection. Safety was risked by having a wheel crack, loose air pressure and fail under normal operating load, potentially causing a crash. This issue has been reported to GM, has countless incidents also reported and can be easily confirmed at any dealer. My vehicle is currently at the dealer and has been inspected by their professionals. No symptoms prior to failure. No other damage has been noted or reported by the dealership to this wheel or tire.",
        "vin": "1G1YR2D68K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/21/2021",
        "dateOfIncident": "09/12/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433799,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle has 6900 miles on it, started to vibrate badly while driving on highway. Car has not been in any accidents and carefully driven. Dealer says the two rear wheels are bent.This could lead to cracking of wheels and/or loss of control of the vehicle. Vehicle is still under 36 month/36,000 mile bumper to bumper warranty.  GM will not cover cost to replace and assumes no responsibility.",
        "vin": "1G1YY2D7XK5"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/17/2021",
        "dateOfIncident": "09/14/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433410,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Bad smell of gas while parked in garage. Looked underneath and was leaking fuel.  Looked online early c7 corvette 15-18 has a special recall for the fuel receiver and tank because it was leaking. Gm actually extended one of the warranties because of it.   Brought my car to the dealer and said it's not covered under the extended warranty that gm gave. I was 18 days out of my bumper to bumper 3yr 36k miles and gm agreed to pay 90% and me 10%.",
        "vin": "1g1y13d77k5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/07/2021",
        "dateOfIncident": "08/03/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428146,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The rim cracked from the outside edge and progressed until air begin to leak. The dealer will not replace the rim unless you bought a tire and rim policy. But the manufacture of the tire does warrantee the tire and the dealer knows that to be the case. So the dealer knows the rims are the problem. I have researched and many others have the very same problem with their Corvette rims cracking until air is lost. These rims are definitely improperly designed and they should be recalled.",
        "vin": "1g1yd2d76k5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/17/2021",
        "dateOfIncident": "02/26/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425271,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "In February 2021, my Chevy dealer service department found that both of my rear wheels were bent and had to be repaired.  My Corvette had 13,319 miles on it and I had never run off road or hit a major pot hole to cause this level of damage.  The service technician said that this was 'common' on 2017 to 2019 Corvette Grand Sport and Z06 OEM wheels.  Additionally, the wheels would probably 'crack'  in the future and need to be replaced.  I find this totally unacceptable that GM (Chevy) would design and manufacture defective wheels on a sports car, or any of their vehicles.",
        "vin": "1G1YY2D75K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/10/2021",
        "dateOfIncident": "06/05/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420494,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Upon tire change, 3 cracks noted in right passenger wheel.   Problem diagnosed at Discount Tire (1475 Austin Hwy, San Antonio, TX 78209) on 6/5/2021.     No known obvious road hazards or incidents that could have explained wheel fractures.   Due to severity of wheel cracks, it was not even safe to drive home from Discount Tire (per the technicians there).  There was concern for eminent wheel failure that would risk loss of control of car and injury to self/others.  Car was left there until new wheel can be ordered and shipped.    Upon review of internet, this is a recurring problem owners of this model of Corvette have been reporting.   There is concern for design issues, wheel selection, and tire selection leading to repeated wheel failures.  More wheel failures are expected in the future raising concerns for potential safety risks.",
        "vin": "1G1Y12D76K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/28/2021",
        "dateOfIncident": "04/12/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414280,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED NEW TIRES FOR MY 2019 CORVETTE GRAND SPORT AND WHEN THE TIRE SHOP REMOVED MY OLD TIRES I WAS INFORMED THAT (3) OF THE WHEELS WERE CRACKED AND (1) REAR WHEEL WAS CRACKED IN TWO PLACES. I HAD NO CHOICE BUT TO PURCHASE A SET OF (4) NEW WHEELS WITH ONLY 32,430 MILES ON THE CAR.",
        "vin": "1G1Y12D71K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/25/2021",
        "dateOfIncident": "03/11/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404817,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS TAKEN TO A LOCAL DEALER TO HAVE 4 NEW TIRES INSTALLED.  UPON INSTALLATION THE DEALER DISCOVERED BOTH REAR RIMS WERE CRACKED (1 COULD NOT HOLD AIR) AND ONE FRONT RIM WAS BENT.  THE DEALER WILL NOT COVER THE WHEELS AND MY WHEEL INSURANCE WILL NOT COVER ANYTHING BUT OEM PARTS.  I SECURED FORGED WHEELS AS I AM CONCERNED ABOUT MY SAFETY BY REPLACING THE SAME RIMS THAT CAME WITH THE CAR.  THE CAR WAS STATIONARY WHEN THE PROBLEM WAS DISCOVERED.  I AM AFRAID TO DRIVE THE CAR WITH THE OEM WHEELS.  GM IS CLAIMING DRIVING BEHAVIOR AND/OR POTHOLES.  I HAVE BEEN DRIVING CORVETTES ON AND OFF SINCE 1986 AND NEVER HAD ANY CRACKED RIMS.  IN ALL THAT TIME MY DRIVING HABITS HAVE NOT SUDDENLY CHANGED. SECONDLY, IT IS HIGHLY UNLIKELY THAT I WOULD HAVE THREE DEFECTIVE RIMS ALL AT THE SAME TIME SIMPLY DUE TO POT HOLES.  AFTER CONDUCTING RESEARCH MY STRONGEST BELIEF IS THAT SINCE THE RIM IS CAST AND NOT FORGED IT LACKS THE STRENGTH NEED FOR A PERFORMANCE VEHICLE AND THAT THE CRACKS ARE FATIGUE CRACKS WHICH OCCUR OVER TIME.  FURTHER, THERE IS NO SENSOR OR WARNING SYSTEM TO LET YOU KNOW THE CRACKS ARE PRESENT.  IN ADDITION, THE PROBLEM IS MAGNIFIED IN THAT THE CRACKS ARE ON THE INSIDE OF THE RIM AND NOT VISIBLE WHEN LOOKING AT THE WHEEL.  IT IS MY BELIEF THAT THERE WILL BE FATALITIES ATTRIBUTABLE TO THIS DEFECT.  I AM UPLOADING EVERYTHING I SENT TO MY INSURER WHO INFORMED ME THAT THEY CANNOT COVER AFTER MARKET WHEELS, EVEN THOUGH THEY WERE LESS EXPENSIVE.  PS:  I CANNOT TELL FROM YOUR FILE UPLOAD IF BOTH FILES WERE LOADED.",
        "vin": "1G1YR2D6XK5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/15/2021",
        "dateOfIncident": "02/21/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403057,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 CHEVROLET CORVETTE. THE CONTACT STATED WHILE DRIVING 45 MPH, THERE WAS AN INTENSE VIBRATION THROUGHOUT THE VEHICLE. THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER COASTAL CHEVROLET CADILLAC NISSAN (8519 OCEAN HWY SUITE 1, PAWLEYS ISLAND, SC 29585, (843) 894-008) WHERE IT WAS DIAGNOSED WITH NEEDING THE FOUR WHEELS NEEDING TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS INFORMED OF FAILURE. THE MANUFACTURER STATED THAT THE VEHICLE WAS NOT UNDER WARRANTY. THE FAILURE MILEAGE WAS APPROXIMATELY 2,200.*DT*JB",
        "vin": "1G1YY2D73K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/11/2021",
        "dateOfIncident": "01/04/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400309,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY VEHICLE IN OCTOBER OF 2019. ON, OR ABOUT JANUARY 4, 2021, MY RIGHT REAR WHEEL STARTED TO LOSE AIR. I ASSUMED THAT THE TIRE NEEDED TO BE REPAIRED OR REPLACED. I TOOK MY VEHICLE TO A TIRE SHOP AND THEY COULD NOT FIND ANYTHING WRONG WITH THE TIRE. AFTER FURTHER INVESTIGATION, A HAIR-LINE CRACK WAS DISCOVERED IN THE WHEEL. THERE WAS NO INDICATION OF AN IMPACT, OR DAMAGE ON THE SURFACE OF THE WHEEL ( ON THE INSIDE THE WHEEL NOR THE OUTSIDE OF THE WHEEL). MY CAR IS UNDER WARRANTY, SO I TOOK THE VEHICLE TO NELSON HALL CHEVROLET IN MERIDIAN FOR REPLACEMENT UNDER WARRANTY. I WAS INFORMED BY THE SERVICE TECHNICIAN THAT SHE HAD TO GET APPROVAL FROM GENERAL MOTORS BEFORE THEY COULD REPLACE THE WHEEL ON MY VEHICLE. GENERAL MOTORS REFUSED TO REPLACE THE WHEEL ON MY VEHICLE. I CALLED GENERAL MOTORS MYSELF AND FILED A COMPLAINT AND TO APPEAL THEIR DECISION NOT TO REPLACE MY WHEEL. AFTER REPEATED ATTEMPTS, GENERAL MOTORS STILL REFUSED TO REPLACE THE WHEEL ON MY VEHICLE. I HAVE A VEHICLE THAT IS UNDER WARRANTY, THAT I CAN NOT ENJOY BECAUSE OF GENERAL MOTORS' REFUSAL TO HONOR THE WARRANTY ON MY VEHICLE. PLEASE NOTE, THAT I HAVE NOT BEEN IN AN ACCIDENT, NOR IS THERE ANY DAMAGE ON THE SURFACE OF THE WHEEL. THIS IS A FACTORY OR A DESIGN DEFECT...I KEEP THE VEHICLE IN MY GARAGE.",
        "vin": "1G1YV2D76K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/11/2021",
        "dateOfIncident": "10/31/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400365,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TAKING THE CAR OUT FOR A TEST RIDE I NOTICED THE TIRE PRESSURE LIGHT WAS ON. DEALER SAID IT WAS BECAUSE OF THE WEATHER. I PURCHASED THE CAR AND A FEW DAYS HAD PASSED AND THE LIGHT WAS STILL ACTIVE. I TOOK IT BACK TO THE DEALER NUMEROUS TIMES TO RECTIFY THE SITUATION. AFTER NUMEROUS ATTEMPTS THE SERVICE DEPARTMENT INSPECTED FURTHER AND REALIZED MY WHEEL WAS BENT AND CRACKED.  AFTER SOME RESEARCH I HAD FOUND NUMEROUS COMPLAINTS ABOUT THE C-7 CORVETTES, SPECIFICALLY THE GRAND SPORT AND Z06 MODELS WHERE THIS HAPPENS ALL THE TIME DUE TO THE WHEELS NOT BEING FORGED.",
        "vin": "1G1YY2D78K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/03/2021",
        "dateOfIncident": "02/15/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399000,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE LESS THAN 5000 MILES ON MY 2019 CORVETTE ZO6 AND BECAUSE OF A VIBRATION I HAD MY TIRES AND RIMS CHECKED FOR BALANCING. I FOUND OUT THE DRIVERS FRONT AND BOTH REAR RIMS MUST BE BENT THAT WAS DETECTED ON THE BALANCING MACHINE. I HAVE NOT HIT ANY POTHOLES AND HAVE BEEN VERY CAREFUL AS THIS IS MY DREAM CAR. OF COURSE I'M VERY DISAPPOINTED ESPECIALLY AFTER READING SEVERAL OTHER OWNERS WITH SIMILAR PROBLEMS!",
        "vin": "1G1YT2D6XK5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/26/2021",
        "dateOfIncident": "05/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398103,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "II NOTICED UNEVEN AND EXCESSIVE TIRE WEAR SO I TOOK MY 2019 CORVETTE GRAND SPORT IN AND THE TECHNICIAN POINTED OUT CRACKS IN BOTH REAR WHEELS, AT ABOUT 15,000 MILES OF NORMAL DRIVING. I HAD THE TIRES REPLACED AND A 4 WHEEL ALIGNMENT. AFTERWARDS THE TIRES WOULD NOT MAINTAIN AIR PRESSURE SO I HAD TO REPLACE THE WHEELS.",
        "vin": "1G1YY3D76K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/25/2021",
        "dateOfIncident": "02/12/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397849,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "GAINING A LOT OF ATTENTION OVER THE LAST SEVERAL YEARS BY C7 (2014-2019) CHEVROLET CORVETTE OWNERS, IS THE ISSUE OF WHEEL RIMS CRACKING, SPECIFICALLY ON THE Z06 AND GRAND SPORT MODELS.  I HAVE BEEN READING A LOT OF ARTICLES REGARDING THIS ISSUE AND WHILE NOT CURRENTLY EXPERIENCING THE ISSUE WITH MY 2019 CORVETTE, I'M CONCERNED THAT I WILL EVENTUALLY EXPERIENCE THE PROBLEM.  I WOULD LIKE TO KNOW WHETHER OR NOT THE NHTS COMMISSION WILL BE LOOKING INTO THIS PROBLEM.  GM HAS ALREADY STATED THAT THIS ISSUE IS NOT RELATED TO DEFECTIVE EQUIPMENT.",
        "vin": "1G1YY2D79K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/02/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394361,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WHEEL ON MY 2019 GRAND SPORT HAS TWO CRACKS IN THE RIM THAT LEAKS AIR.  THE CAR HAS 11600 MILES AND IS DRIVEN CAREFULLY THIS SEEMS TO BE A CURRENT PROBLEM FOR GM FOR GRAND SPORT AND Z06 MODEL TRIMS",
        "vin": "1G1YY2D74K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/29/2021",
        "dateOfIncident": "06/10/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390645,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK CORVETTE TO THREEWAY CHEVROLET IN BAKERSFIELD ON 6/9/20 FOR ALIGNMENT AND WAS TOLD THAT ALL FOUR TRIMS ARE BENT AND CRACKED. AND EVEN THOUGH IT HAS BUMPER TO BUMPER WARRANTY,  THEY WON'T COVER THE TRIMS. I HAVE SINCE SPOKEN WITH THE MANAGER OF THREEWAY, AND HE AGREED THAT IT IS A MANUFACTURER DEFECT AND SHOULD BE COVERED. HE SAID , NO WAY SOMEONE COULD BEND AND CRACK ALL 4 TIMES, AND NOT CAUSE ALOT OF DAMAGE TO CAR, AND AIRBAGS WOULD DEPLOY. CAN YOU HELP ME PLEASE.",
        "vin": "1G1YW2D78K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/21/2021",
        "dateOfIncident": "10/11/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389252,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2019 CHEVROLET GRAND SPORT CORVETTE  IN MY NEIGHBORHOOD, IN OCTOBER 2020. MY TIRE PRESSURE WARNING LIGHT CAME ON. I WAS ABLE TO DETERMINE MY RIGHT REAR TIRE PRESSURE HAD DROPPED PRECARIOUSLY. I HAVE RUN FLAT MICHELIN TIRES AND WAS ABLE TO DRIVE HOME SAFELY. I INFLATED MY TIRE TO 30LBS PSI AND PARKED IT IN MY GARAGE. THE NEXT DAY I CHECKED MY TIRE PRESSURE OF ALL 4 TIRES AND ONCE AGAIN MY RIGHT REAR TIRE WAS LOW. IT WOULD NOT HOLD AIR. I CALLED CRISWELL CHEVROLET WHERE I PURCHASED MY CAR. THEY ASKED IF I COULD DRIVE MY CAR TO THEIR FACILITY IN MARYLAND. I LIVE IN NEW JERSY AND I DIDNT FEEL SAFE DRIVING MY CAR UNDER THE CIRCUMSTANCES TO THEM. THE SERVICE DEPARTMENT WAS VERY FAMILIAR WITH THE CRACKED / BENT WHEEL ISSUE AFFECTING C7 GRAND SPORT AND Z06 CORVETTES. I WAS ADVISED TO GO TO A LOCAL CHEVROLET DEALERSHIP AND HAVE THEM INSPECT MY WHEELS. I TOOK IT TO GLOBAL CHEVROLET IN NORTH PLAINFIELD ,N.J.. UPON INSPECTION, THEY DETERMINED I HAD A CRACKED RIGHT REAR WHEEL AND IT NEEDED TO BE REPLACED..  I DID /DO NOT ABUSE MY CAR.",
        "vin": "1G1YZ2D74K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/13/2021",
        "dateOfIncident": "01/13/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387904,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK WHEELS AND TIRES TO A TIRE SHOP TO HAVE THE WHEELS RECONDITIONED AFTER THE SAME SHOP HAD SCRATCHED THEM DURING INSTALLATION OF NEW TIRES. MANAGER HAS ADVISED ME THAT THE WHEEL RECONDITIONING SHOP HAS TOLD HIM THAT ALL FOUR WHEELS ARE BENT AND WILL HAVE TO BE TRUED BEFORE THEY ARE REPAINTED. RECONDITIONING SHOP TOLD HIM THAT THEY SEES IT A LOT WITH CORVETTE WHEELS. LESS THEN 10K MILES ON THE CAR.",
        "vin": "1G1YX2D75K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/05/2021",
        "dateOfIncident": "12/31/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386639,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FOUND TWO CRACKS IN REAR OEM WHEEL CAUSING LOSS OF AIR PRESSURE. WAS DRIVING THE CAR TO GET NEW TIRES AS I THOUGHT I HAD AN ISSUE WITH A TIRE.  APPARENTLY THOUSANDS OF LATE MODEL GRAND SPORT AND 06 CORVETTES WITH THIS SAME ISSUE",
        "vin": "1G1YY2D75K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/01/2021",
        "dateOfIncident": "12/28/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386013,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 12/28/2020 I FOUND THAT THERE WAS ONLY 3 POUNDS OF PRESSURE IN THE RIGHT REAR TIRE.  DISCOUNT TIRE FOUND A CRACK ON THE INSIDE EDGE OF THE RIM THAT WAS LEAKING AIR.  THEY SAID THERE WAS NO INDICATION OF IMPACT OR DAMAGE TO THE TIRE OR THE RIM.",
        "vin": "1G1YS3D60K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/31/2020",
        "dateOfIncident": "12/28/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385786,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING INTERSTATE 75 ATLANTA SPEEDS70+MPH HEAVY TRAFFIC --  RF MICHELIN PILOT SPORT A/S 3+ 285/30/ZR19(94Y) DOT 4MLW00UX (2819) PURCHASED 4  NEW FROM DEALER AT DELIVERY -- 24K MILES NOW--  ALERT SYSTEM SHOWED RF TIRE DEFLATING 35 TO 0.WAS ABLE TO RUN ON THE ZR TIRE TO NEXT INTERSTATE EXIT. TIRE SIDEWALL WAS SPLIT IN MULTIPLE PLACES ABOUT AN 1/2 INCH DOWN FROM RIM. ON FURTHER INSPECTION THE RR MICHELIN PILOT SPORT A/S 3+ 335/25/ZR20(99Y) DOT 4MZR00VX(3019) SHOWED THE SAME CONDITION NOT LEAKING AIR YET. TOTALLY UNSAFE TO CONTINUE BACKED UP TRAFFIC TRUING TO GET FROM EXPRESS LANE TO EXIT OFF .RETURNED BOTH TIRES TO DEC TALLAHASSEE FL  CURRENT THREAD 6/32.",
        "vin": "1G1YY2D70K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/12/2020",
        "dateOfIncident": "09/03/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383117,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WHEELS THAT CAME WITH THE 2019 C7 ZR1 -4 WHEELS BENT MULTIPLE TIMES MAKING THE CAR UNABLE TO BALANCE ALL 4 WHEELS. THIS MAKES THE CAR VIBRATE. I BOUGHT A SECOND SET OF OEM WHEELS WITH THE SAME ISSUE HAPPENING. THE DEALER WOULD NOT COVER THIS ISSUE. MY DEALER PURCHASED WHEEL PACKAGE ALSO DENIED MY CLAIM. THE CAR CAN NOT BE DRIVEN WITHOUT EXTREME VIBRATIONS. THERE WAS NO SIGNIFICANT INCIDENT THE CAR JUST SLOWLY BEGAN TO VIBRATE AND THE WHEELS COULD NOT BE BALANCED CORRECTLY BECAUSE OF WOBBLE IN THE WHEELS. TWO SETS OF WHEELS.",
        "vin": "1G1Y42D90K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/10/2020",
        "dateOfIncident": "11/25/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11382950,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FACTORY WHEELS ARE DEVELOPING HAIRLINE CRACKS.  I HAVE NEVER HAD THIS ISSUE IN ANY PREVIOUS CAR, FACTORY OR AFTERMARKET WHEELS",
        "vin": "1G1YY2D74K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/24/2020",
        "dateOfIncident": "10/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376162,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A PROBLEM WITH THE OEM WHEELS ON MY 2019 CORVETTE Z06 BENDING/WARPING/CRACKING UNDER NORMAL DRIVING CONDITIONS.  I HAVE SPENT MONEY HAVING THE WHEELS \"STRAIGHTENED\".  I PAID TO REPLACE ONE WHEEL THAT WAS CRACKED AND LOST AIR PRESSURE.   I CONTACTED CHEVROLET/GM ABOUT THE PROBLEM.  THEY INDICATE THAT IT IS A ROAD HAZARD ISSUE.  I COULD BELIEVE THIS IF IT WAS ONLY 1 OR 2 WHEELS, BUT NOT ALL 4.  THIS IS THE SUBJECT OF AT LEAST ONE CLASS ACTION LAWSUIT.  I SEE REPORTS OF WHEELS LOSING AIR PRESSURE.  APPARENTLY A BENT WHEEL CAN FATIGUE AND CRACK CAUSING LOSS OF TIRE PRESSURE.  THE SYMPTOMS OF THE BENT WHEEL APPEAR AS ROAD NOISE AND ARE NOT OBVIOUS TO THE EVERYDAY DRIVER.",
        "vin": "1G1YU2D65K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/19/2020",
        "dateOfIncident": "11/08/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375359,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 CHEVROLET CORVETTE. THE CONTACT STATED WHILE DRIVING 55 MPH, THERE WAS AN ABNORMAL VIBRATION IN THE STEERING WHEEL AND THE FLOORS. THE CONTACT ALSO STATED THE FRONT PASSENGER'S SIDE TIRE AND REAR PASSENGER'S AND DRIVER'S SIDE TIRES WERE ALSO VIBRATING. THERE WERE NO WARNING LIGHTS ILLUMINATED. THE CONTACT STATED HE CONTINUED DRIVING TO HIS DESTINATION. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER - HIGHWAY CHEVROLET BUICK GMC (100 S FORD DR, EL PASO, IL 61738; (309) 270-1847) WHERE THE MECHANIC ATTEMPTED TO BALANCE THE TIRES AND PROVIDE AN ALIGNMENT. THE CONTACT STATED THAT THE FAILURE PERSISTED. THE VEHICLE WAS TAKEN TO A TIRE SHOP AND THE CONTACT WAS INFORMED THAT THE FRONT PASSENGER'S SIDE RIM AND REAR PASSENGER'S AND DRIVER'S SIDE RIMS WERE BENT. THE VEHICLE WAS REPAIRED. THE MANUFACTURER HAD NOT BEEN INFORMED OF FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 12,000.*DT*AS*DT*JB",
        "vin": "1G1YY2D75K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/06/2020",
        "dateOfIncident": "07/25/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373506,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD BEEN FEELING VIBRATIONS WHILE DRIVING AFTER ONLY A FEW MONTH OF OWNERSHIP.  I TOOK CAR TO DEALER FOR SERVICE ON 26JULY2019 (6369 MILES) AND WAS TOLD IT WAS BRAKE ROTORS, WHICH WERE TURNED.  THE PROBLEM DID NOT GO AWAY.  I TOOK IT IN AGAIN ON 25JAN2020 (12811 M) AND ON 12FEB2020 (13700 M).  DEALER REPLACED BRAKE ROTORS BUT SMALL VIBRATIONS DID NOT GO AWAY.  ON 17FEB2020 (13928 M), I HAD TIRES REPLACED IN AN ATTEMPT TO RESOLVE VIBRATIONS.  VIBRATIONS BECAME STRONGER OVER TIME.  ON 4NOV2020 (20678 M) I TOOK CAR TO DISCOUNT TIRE AND HAD WHEELS BALANCED.  I WAS TOLD ALL FOUR WHEELS ARE OUT OF ROUND BUT R/R IS THE WORST BENT AT .025 AND THE L/R IS ALSO BENT AND CRACKED.   THIS IS A HIGH PERFORMANCE VEHICLE THAT I DO NOT RACE OR MISTREAT.  THE WHEELS SHOULD DEFINITELY BE STRONG ENOUGH FOR STREET USE WITHOUT RISK OF BENDING OR BREAKING.  I NOW HAVE UNSAFE WHEELS ON A HIGH PERFORMANCE VEHICLE.",
        "vin": "1G1YY2D7XK5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/29/2020",
        "dateOfIncident": "06/10/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11367018,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL FOUR RIMS ARE BENT AND CRACKED. THIS IS TRUE FOR ALMOST ALL 2015 TO 2019 GRAND SPORT AND Z06 CORVETTE'S. THERE ARE MULTIPLE CLASS ACTION LAWSUITS FILED AGAINST GMC AS OF TODAY'S DATE. THE RIMS ARE DEFECTIVE AND GMC KNOWS THEY ARE. BUT REFUSES TO FIX THEM. I PAID OVER 50,000 CASH FOR MY 2019 GRAND SPORT, AND IT SITS IN THE GARAGE WITH 2 FLAT TIRES. DON'T WANT TO DRIVE IT AT OF FEAR SOMETHING MAY HAPPEN. I HAVE SPOKEN WITH GMC SEVERAL TIMES, THEY REFUSE TO HELP. CAN YOU PLEASE HELP ME?",
        "vin": "1G1YW2D78K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/28/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366847,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "IN LESS THAN TWO YEARS, THIS VEHICLE HAS HAD TWO CRACKED RIMS AND FOUR BENT RIMS.  IN RESEARCHING THE ISSUE ONLINE, I HAVE FOUND THAT THIS IS A MAJOR PROBLEM, PRIMARILY FOR 2014-2019 CORVETTE GRAND SPORT AND Z06 OWNERS HAVE WITH THE ALUMINUM-ALLOY WHEELS. A CRACKED WHEEL POSES A SAFETY RISK AS IT COULD PUNCTURE A TIRE WHILE DRIVING.  GM HAS DONE NOTHING TO STAND BY THEIR PRODUCT, ALTHOUGH THESE CARS HAVE A BUMPER TO BUMPER WARRANTY.  THERE ARE CLASS ACTION SUITS THAT HAVE BEEN FILED.  THERE HAS BEEN NO SPECIFIC INCIDENT THAT ATTRIBUTE TO MY RIMS HAVING THESE PROBLEMS.  IT IS NOT AN EVERDAY CAR FOR ME AND I SELDOM DRIVE IT.",
        "vin": "1G1YW2D72K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/28/2020",
        "dateOfIncident": "05/05/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366854,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON RECEIVING MY 2019 GRAND SPORT FROM THE DEALER BY TRUCKING COMPANY, ALL 4 WHEELS WERE WARPED/BENT. I REALIZED THIS WHEN I WENT TO DRIVE IT FOR THE FIRST TIME AND AROUND 50 MPH THE CAR STARTED TO SHIMMY/SHAKE. I TOOK IT TO MY LOCAL CHEVROLET DEALER AND THEY PUT IT UP ON THE RACK AND SHOWED ME ALL 4 WHEELS WHERE SPINNING WARPED. I HAVE VIDEOS OF ALL 4 WHEELS.",
        "vin": "1G1YX2D79K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/28/2020",
        "dateOfIncident": "10/23/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366907,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH REAR WHEELS ARE BENT",
        "vin": "1G1YP2D60K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/16/2020",
        "dateOfIncident": "10/13/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364618,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR IS 2 YEARS OLD AND ONLY HAS 4,900 MILES. THE LEFT REAR WHEEL HAS 2 SMALL CRACKS. THE RIM WAS NOT DAMAGED BY ANY ROAD CONDITIONS. THE RIM WILL NO LONGER HOLD AIR AND IS STRUCTURALLY UNSOUND. THE CAR IS DRIVEN TO CAR SHOWS AND SUNDAY DRIVES, IT IS NOT ABUSED.*DT*JB",
        "vin": "1G1YX3D73K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/15/2020",
        "dateOfIncident": "08/19/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364597,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH REAR WHEELS ON MY 2019 CORVETTE GRAND SPORT ARE CRACKED. ONE WHEEL HAD A CRACK REPAIRED AT AROUND 24,000 MILES BEFORE I PURCHASED IT IN JANUARY 2020. IN AUGUST 2020 AT ABOUT 28,500 MILES, ONE REAR TIRE STARTED LOSING PRESSURE. UPON INSPECTION, THE WHEEL WAS FOUND TO BE CRACKED IN TWO PLACES.   IT CRACKED AT THE SAME SPOT WHERE IT WAS REPAIRED AND AT A DIFFERENT LOCATION.  THE OTHER REAR WHEEL WAS HOLDING AIR,  BUT WAS FOUND TO BE CRACKED AS WELL.  THAT WHEEL WAS NEVER REPAIRED BEFORE. THERE WAS NO ACCIDENT AND NO POT HOLES OR ROAD HAZARDS HIT TO CREATE THESE CRACKS. I DRIVE THE SAME WELL MAINTAINED ROADS THAT I DROVE MY 2006 CORVETTE ON FOR 120,000 MILES WITHOUT IT EVER CRACKING A WHEEL. BOTH REAR WHEELS CRACKED  IN THE 4,500 MILES THAT I HAVE DRIVEN THE CAR.  THIS REPRESENTS A SAFETY HAZARD.  AS OF TODAY, I WAS INFORMED THAT CHEVROLET ONLY OFFERS THE SAME CAST ALUMINUM WHEEL THAT HUNDREDS OF OTHERS HAVE ALSO REPORTED CRACKING OR BENDING AS A REPLACEMENT.",
        "vin": "1G1YY2D70K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/14/2020",
        "dateOfIncident": "09/09/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364319,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DANGEROUS VIBRATION AS DRIVING AND BRAKING AT 6000 MILES. AFTER DEALER CLAIMED IT WAS BRAKES, PADS AND MY BAD DRIVING, REPLACED BOTH.  DIDN'T FIX THE PROBLEM AND IT EVEN GOT MUCH WORSE OVER THE NEXT 6000 MILES. I TOOK IT TO ANOTHER DEALER FOR HELP AND FOUND THAT I HAVE 2 WARPED WHEELS. BOUGHT WHEEL AND TIRE PROTECTION PLAN AT THE TIME OF PURCHUSE BUT THEY WOULDN'T COVER THE WHEELS AS THE DAMAGE WASN'T FROM ROAD HASSARDS OR DRIVING. BUT GM WON'T COVER AS THEY SAY IT IS DRIVING AND ROAD DAMAGE. GM KNOWS OF THE WHEEL FLAWS FROM OTHER COMPLAINTS BUT WON'T STAND BY THEIR PRODUCT.",
        "vin": "1G1YY2D7XK5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/14/2020",
        "dateOfIncident": "10/12/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364328,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT REAR TIRE LEAKING AIR.  PRESSURE WOULD FALL FROM 32PSI TO 14PSI IN ONLY TWO DAYS. TIRE REPAIR SHOP REPORTED GOOD TIRE, BUT NOTED 3 CRACKS ON INSIDE RIM OF WHEEL AT TIRE BEAD.  CHEVROLET DEALERSHIP NOTED CRACKS AND SUBMITTED FOR WARRANTY WORK WHICH WAS DENIED.  ONLY 16706 MILES ON 19 MONTH OLD CAR.",
        "vin": "1G1YY2D78K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/14/2020",
        "dateOfIncident": "04/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364343,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 CHEVROLET CORVETTE EQUIPPED WITH MICHELIN TIRES, TIRE LINE: PILOT SUPER SPORT, TIRE SIZE: P335/25/ZR20, DOT: 4M2R00RX. THE CONTACT STATED THAT THE TREAD ON THE REAR PASSENGER'S SIDE WAS INSTALLED BACKWARDS. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC AND THE CONTACT WAS INFORMED THAT THE PASSENGER'S SIDE REAR WHEEL WAS CRACKED. THE CONTACT WAS INFORMED THAT THE VEHICLE WAS UNSAFE AND SHOULD NOT BE DRIVEN. THE CONTACT STATED THAT HE WAS INFORMED OF A CLASS ACTION LAWSUIT ON THE WHEELS. GREGG YOUNG CHEVROLET, INC (17750 BURT ST, OMAHA, NE 68118, (800) 951-5257) DISMISSED THE CONTACT'S CONCERN AND SUGGESTED THAT THE WHEEL WAS POSSIBLY CRACKED WHILE DRIVING OVER A POTHOLE. THE DEALER PROMISED A CALLBACK HOWEVER, THE CONTACT HAD NOT YET RECEIVED A CALLBACK. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DENIED ANY KNOWLEDGE OF THE ISSUE. THE WHEEL WAS NOT REPAIRED NOR REPLACED. THE FAILURE MILEAGE WAS 5,800.",
        "vin": "1G1YS3D69K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/14/2020",
        "dateOfIncident": "10/12/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364386,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I BEGAN HAVING RIM PROBLEMS SHORTLY AFTER PURCHASING MY 2019 CORVETTE IN SEPTEMBER 2018.  THE CAR HAD A VIBRATION AND MY TIRE STORE SHOWED ME HOW ONE OF THE WHEELS WAS OUT OF ROUND, SO I ORDERED A NEW RIM.  SEE UPLOADED PHOTO 0948. MY NEXT PROBLEM WITH VIBRATION OCCURRED WITH THREE OF THE RIMS BEING OUT OF ROUND, SO I TOOK IT TO A WHEEL REPAIR SHOP TO HAVE THEM STRAIGHTENED.  SEE UPLOADED PHOTO 0949.  LATER ON, VIBRATION CROPPED UP AGAIN, AND I HAD ONE OF THOSE THREE WHEEL AGAIN STRAIGHTENED, PLUS WELDED IN TWO PLACES TO REPAIR AIR LEAKING CRACKS IN THE RIM, SO THE RIM WOULD HOLD AIR.  SEE UPLOADED PHOTO 0950.  STILL LATER, THAT RIM BEGAN LEAKING AIR AGAIN, SO I HAD THE TIRE SHOP AGAIN STRAIGHTEN AND WELD THE LEAKING CRACK.  SEE UPLOADED PHOTO 0969.  STILL LATER, ANOTHER RIM WOULD NOT HOLD ANY AIR PRESSURE FOR LONGER THAN ABOUT FOUR HOURS, SO AGAIN THAT RIM WENT TO THE REPAIR SHOP TO BE WELDED.  SEE UPLOADED PHOTO 0972.  IN SUMMARY, IT SEEMS LIKELY THESE CORVETTE RIMS, WHICH COME WITH LOW PROFILE TIRES, ARE SUBJECT TO LOADS WHICH A CASTING CANNOT ABSORB WHEN ROLLING OVER POTHOLES, SPEEDBUMPS, AND OTHER ROAD ANOMALIES.  WITH A NORMAL PROFILE TIRE, THIS WOULD UNLIKELY TO BE A PROBLEM, BUT WITH LOW PROFILE TIRES, THE RIMS ARE ONLY TWO INCHES FROM ANY ROAD ANOMALY.  THEREFORE, THE CORVETTE RIMS SHOULD PROBABLY BE MANUFACTURED USING A FORGING PROCESS, RATHER THAN A CASTING PROCESS.  OR, THE CORVETTES SHOULD BE DESIGNED TO USE NORMAL PROFILE TIRES INSTEAD OF LOW PROFILE TIRES.",
        "vin": "1G1YY2D72K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/14/2020",
        "dateOfIncident": "09/26/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364395,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2019 CORVETTE WAS PURCHASED ON SEPTEMBER 20, 2018.  I DROVE HOME THINKING I WOULDN'T HAVE ANY REPAIR OR REPLACEMENT PROBLEMS FOR SOME TIME ON THIS NEW CAR.  A FEW DAYS LATER, AS I'M READING THE OWNER'S MANUAL, THERE ARE ABOUT FOUR OR FIVE PLACES IN THIS THICK MANUAL THAT SAYS MY TIRES ARE \"SUMMER ONLY\" TIRES, AND THAT IT COULD BE HAZARDOUS TO DRIVE ON THESE TIRE IN COLD OR WET WEATHER.  WELL, SUMMER ENDED ONLY ABOUT 2-3 DAYS AFTER I PURCHASED THE CAR, SO I IMMEDIATELY FELT UNSAFE DRIVING ON THE SUMMER ONLY TIRES.  I WENT TO MY TIRE STORE AND BOUGHT A SET OF ALL-WEATHER TIRES.  SEE UPLOADED PHOTO 0973.  I THINK IT IS UNREASONABLE FOR ALL NEW CORVETTES TO ONLY COME WITH SUMMER ONLY TIRES!  NONE OF THE DEALERS I NEGOTIATED WITH FOR THIS CAR WOULD DELIVER MY CAR WITH ALL SEASON TIRES!  LATER, RELATED TO MY COMPLAINT NUMBER 11364386 PERTAINING TO CORVETTE RIM DEFICIENCIES, I HAD TO PREMATURELY REPLACE EACH OF THE FOUR NEW ALL SEASON TIRES, ONE BY ONE, DUE TO RIM PROBLEMS CAUSING TIRE IRREGULARITIES WHERE THE TIRES MEETS THE RIMS.  THERE WAS LOTS OF TREAD LEFT, BUT DAMAGE TO EACH OF THESE TIRES WHERE THEY CONTACTED THE OUT OF ROUND RIMS.",
        "vin": "1G1YY2D72K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/14/2020",
        "dateOfIncident": "10/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364409,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2019 CORVETTE GRAND SPORT HAS HAD ISSUES WITH THE RIMS FROM DAY ONE. CURRENTLY THERE IS LES THAN 10,000 MILES. EACH RIM HAS BENT & NOW WE HAVE A CRACKED RIM (ABOUT 1 1/2 INCH LONG). THE FIRST TIME THIS HAPPENED WE HAD ONLY DRIVE THE CAR ABOUT 500 & WAS TOLD WE HAD 2 BENT RIMS. THIS HAPPENED THE FOLLOWING YEAR AND AGAIN THIS YEAR. BUT THIS TIME WE HAVE A 1 1/2 INCH CRACK ON THE RIM. WHEN WE DISCUSS THIS WITH THE DEALERSHIP WE WERE TOLD THAT GM WOULD NOT COVER ANY COSTS RELATED TO THE RIMS. THESE CAST RIMS ARE VERY WEAK, WHICH COULD CAUSE A LIFE THREATING ACCIDENT. THANKFULLY, IT HASN'T HAPPENED TO US. BUT I HAVE NOW SPENT ALMOST $1000 TO FIX THEM. SINCE THIS WILL OCCUR EVERY YEAR THAT I DRIVE IT. I MOST LIKELY WILL HAVE TO BUY NEW RIMS AT A COST OF ABOUT $1,250 PER RIM. CONSIDERING THE COST OF ANY CORVETTE YOU WOULD THINK THAT GM WOULD EITHER COVER THE COST TO REPLACE. OR WOULD HAVE PROVIDED FORGED RIMS FOR A VEHICLE OF THIS TYPE AS PART OF THE CORVETTE. I WOULD THINK THAT GM WOULD HAVE CONSIDERED THE SAFETY FEATURE ON A PERFORMANCE VEHICLE AND PROVIDED A MUCH STRONGER RIM.",
        "vin": "1G1YY2D72K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/13/2020",
        "dateOfIncident": "06/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364097,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A NEW 2019 CORVETTE GRAND SPORT, AFTER DRIVING IT A SHORT TIME I NOTICED A VIBRATION. I HAD THE TIRES AND WHEELS CHECKED OUT AND WAS TOLD ALL 4 OF MY WHEELS WERE BENT AND I NEEDED NEW WHEELS. I BOUGHT AFTER MARKET WHEELS BECAUSE I HAD HEARD ABOUT THE THE PROBLEM OF WHEELS COMING OUT BENT FROM THE MANUFACTURER, AND GENERAL MOTORS WAS NOT HONORING THE BUMPER TO BUMPER WARRANTY ON THE WHEELS.",
        "vin": "1G1YY2D7XK5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/13/2020",
        "dateOfIncident": "08/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364110,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 CHEVROLET CORVETTE. THE CONTACT STATED THAT THE PASSENGER'S SIDE REAR TIRE WAS LEAKING AIR. THE CONTACT TOOK THE VEHICLE TO A TIRE SHOP WHERE HE WAS INFORMED THAT THE REAR PASSENGER'S SIDE WHEEL WAS CRACKED AND NEEDED TO BE REPLACED. THE CONTACT HAD THE WHEEL REPLACED OUT OF POCKET. THE CONTACT THEN TOOK THE VEHICLE TO MEDVED CHEVROLET (11001 W INTERSTATE 70 FRONTAGE RD N, WHEAT RIDGE, CO 80033) WHERE THEY INSPECTED THE VEHICLE AND MADE A REQUEST TO THE MANUFACTURER TO HAVE THE VEHICLE COVERED UNDER WARRANTY. THE DEALER THEN NOTIFIED THE CONTACT THAT THE MANUFACTURER REFUSED TO COVER THE FAILURE UNDER WARRANTY. THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 7,000.",
        "vin": "1G1YU2D60K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/13/2020",
        "dateOfIncident": "06/17/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364165,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "3 BEND RIMS WERE OBSERVED WITH NO APPARENT REASON. BRAND NEW VEHICLE WITH LESS THAN 8000 MILES, DRIVEN ON GOOD HIGHWAYS ONLY. IT SEEMS TO ME A LOW QUALITY MATERIALS USED ON THE RIMS, VERY UNSAFE AND UNPLEASANT FOR A $76000 DOLLAR CAR.",
        "vin": "1G1YY2D7XK5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/12/2020",
        "dateOfIncident": "09/27/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363868,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 9212 MILES, MY LOW TIRE PRESSURE INDICATOR CAME ON. I TOOK THE VEHICLE TO NORTHWEST TIRE, BISMARCK, ND. THEY REMOVED THE WHEEL AND FOUND THAT THE RIM WAS CRACKED. THE VEHICLE IS STILL UNDER FACTORY WARRANTY, ON 9-29-2020,  I TOOK IT TO THE KUPPER CHEVROLET, MANDAN ND. THEY INSPECTED THE VEHICLE, FOUND NO DAMAGE.   OTHER THAN THE CRACKED WHEEL. THEY CALLED GENERAL MOTORS FOR A WARRANTY REPAIR, WHICH GM DECLINED.",
        "vin": "1G1YY3D76K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/12/2020",
        "dateOfIncident": "07/28/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363883,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I FIRST NOTICED SOMETHING WAS OFF WITH MY 2019 CORVETTE GRAND SPORT WHEN IT BEGAN TO VIBRATE, SHIMMY, AND SHUTTER WHEN I WOULD DRIVE ABOVE 30 MPH.  LATER THAT SAME DAY MY CAR BEGAN TO HAVE A SLOW LEAK IN THE REAR DRIVER SIDE TIRE, I FIGURED I CAUGHT A NAIL OR SOMETHING FROM THE ROAD.  I INSPECTED THE TREAD AREA OF THE TIRE AND DID NOT SEE ANY VISIBLE MARKINGS THAT COULD CAUSE A LEAK.  I INSPECTED MY WHEELS WITHIN THE INSIDE WHEEL WELL AND NOTICED A CRACK IN THE BACK DRIVER SIDE RIM.  I TOOK MY CAR TO A NEARBY GENERAL MOTORS DEALER AND WAS TOLD THAT THIS WOULD NOT BE COVERED UNDER WARRANTY AND WOULD HAVE TO PAY FOR A REAR RIM.  MY CAR IS BARELY DRIVEN, RELATIVELY NEW, WITH LOW MILES AND I DID NOT RECALL HITTING ANYTHING IN THE ROAD NOR HAVE ANY ROAD/CURB RASH TO ANY OF MY WHEELS.      RECENTLY, I SEARCHED ONLINE AND SAW AN ARTICLE POSTED IN A CORVETTE FORUM THAT CORVETTE Z06 AND GRAND SPORT OWNERS FILED A CLASS ACTION LAWSUIT AGAINST GENERAL MOTORS FOR DEFECTIVE WHEELS THAT ARE PRONE TO DEFORM AND CRACK, WITHOUT ANY IMPACT DAMAGE.  LIKE OTHER CORVETTE OWNERS I WAS TOLD THAT I WAS RESPONSIBLE FOR THE REPLACEMENT OF THE RIM AND HAD NO CHOICE BUT TO REPLACE IT WITH ANOTHER FACTORY RIM OR PURCHASE A SET OF COMPARABLE AFTERMARKET RIMS AT ~$6K.  THESE RIMS ARE A HUGE SAFETY CONCERN AS THEY COULD PUNCTURE THE TIRES, CAUSE ADDITIONAL AIR LEAKS, AND POSSIBLE TIRE BLOWOUTS.  GENERAL MOTORS SHOULD BE HELD ACCOUNTABLE TO REPLACE THESE DEFECTIVE RIMS AS THEY ARE PUTTING THEIR CUSTOMERS IN HUGE RISK OF POSSIBLE INJURY OR DEATH TO THE OWNERS AS WELL AS OTHER MOTORISTS ON THE ROAD.",
        "vin": "1G1YY2D78K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/12/2020",
        "dateOfIncident": "08/18/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363930,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TWO DIFFERENT OCCASIONS I HAVE HAD CRACKED WHEEL RIMS ON MY 2019 CORVETTE. BOTH TIMES I WAS DRIVING AT 65MPH AND A VIBRATION OCCURRED AND ALMOST LOST CONTROL OF THE CAR. I WENT DIRECTLY TO THE CHEVY DEALERSHIP AND BOTH TIMES THEY TOLD ME THERE IS NO DEFECT ON THE RIMS AND THEY REFUSED TO REPLACE THEM. SOMEONE WILL BE SERIOUSLY INJURED AND POSSIBLY DIE. CHEVY NEEDS TO REPLACE THESE FAULTY RIMS.UNACCEPTABLE!!! I'M HOPING NTSB WILL ADDRESS THIS PROBLEM BEFORE SOMEONE IS SERIOUSLY HURT.",
        "vin": "1G1YW2D7XK5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/11/2020",
        "dateOfIncident": "07/17/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363842,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VIBRATION STARTED A FEW MONTHS AGO THAT FELT LIKE WHEELS OUT OF BALANCE.  HAD READ ABOUT ISSUES WITH BENT AND/OR CRACKED WHEELS ON GRAND SPORTS.  BROUGHT CAR TO THE DEALER, AND ALSO A TIRE COMPANY.  BOTH DETERMINED 3 OF 4 WHEELS WERE VISIBLY BENT WHEN ROTATED ON THE BALANCING MACHINE (I COULD SEE IT AS WELL).  THE FOURTH WAS NOT PERFECT, BUT BETTER. THE CAR IS USED ON REGULAR ROADS, NEVER ON A TRACK, AND AT MOST HAS ONLY ENCOUNTERED ROUGH ROAD PATCHES. CAR ONLY HAS 4,500 MILES ON IT.",
        "vin": "1G1Y12D72K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/10/2020",
        "dateOfIncident": "08/27/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363672,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT REAR WHEEL CRACKED IN TWO PLACES. NOTICED AIR LEAK IN AUGUST 2020. OCCURRED DURING NORMAL DRIVING. NO RECOLLECTION OF ANY IMPACT SUFFICIENT TO CRACK WHEEL. INSPECTION REVEALED CRACKS ACROSS INNER RIM OF WHEEL. REPLACED ALL FOUR WHEELS AS PRECAUTION SINCE ISSUE APPARENTLY PREVALENT ACROSS ENTIRE C7 CORVETTE MODEL LINE.",
        "vin": "1G1YY2D79K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/10/2020",
        "dateOfIncident": "10/14/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363727,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ROUTINE INSPECTION DURING SERVICE REVEALED THAT THE LEFT REAR WHEEL HAD DEVELOPED A CRACK AT THE BEAD ON THE INBOARD EDGE.  NO OTHER DAMAGE OR DEFECT WAS NOTED ON THE WHEEL AT THAT TIME.  THE WHEELS WERE REMOVED FROM SERVICE AND REPLACED WITH AFTERMARKET FOR SAFETY.",
        "vin": "1G1YY2D78K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/05/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362780,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE NEWER C& CORVETTES, ESPECIALLY THE Z06 AND GRAND SPORT MODELS ARE EXTREMELY SUSCEPTIBLE TO CRACKED RIMS.  I RECENTLY HAD TO PAY $170 TO HAVE A RIM A CRACKED AND LEAKING RIM WELDED TO FIX NUMEROUS CRACKS. THIS REPAIR WAS UNSUCCESSFUL AND THE LEAKING HAS BEGUN AGAIN.      WHEN MOTORTREND MAGAZINE CONDUCTED AN EXTENDED TEST OF THE C7 CORVETTE GRAND SPORT CORVETTE, IT HAD NO LESS THAN SIX SEPARATE RIM PROBLEM INCLUDING EITHER BENT OR CRACKING PROBLEMS. THE CRACKED RIMS REQUIRED VERY EXPENSIVE REPLACEMENTS, NOT COVERED UNDER WARRANTY. THERE IS AN EXISTING CLASS ACTION LAWSUIT ABOUT THIS CONTINUING PROBLEM. THIS PROBLEM OCCURS ON BOTH CITY STREET AND ON HIGHWAYS WHILE THE CAR IS IN MOTIONS AND COULD BE DISASTROUS IF THE RIM WERE TO TOTALLY FRACTURE AT  HIGHWAY SPEEDS.     HERE IS A LINK TO A COMMENT ABOUT THIS PROBLEMS.     HTTPS://WWW.CORVETTEBLOGGER.COM/2019/05/10/ANOTHER-LAWSUIT-FILED-AGAINST-GM-OVER-CRACKED-CORVETTE-WHEELS/",
        "vin": "1G1YY2D75K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/03/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362537,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "3 BENT WHEELS AFTER 9500 MILES, 2 REAR AND PASSENGER FRONT  TERRIBLE SHAKING AND INSTABILITY  UNSAFE TO DRIVE  MUST REPLACE WITH AFTER MARKET WHEELS",
        "vin": "1G1YY3D77K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/01/2020",
        "dateOfIncident": "09/21/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362200,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "REPAIRED RIGHT REAR TIRE FOR A NAIL AND DISCOUNT TIRE INFORMED ME OF A CRACKED TIRE RIM. I TOOK CAR TO A AUTHORIZED CHEVROLET DEALER. THEY SAID MY 2019 GRAND SPORT CORVETTE WITH 9300 MILES WARRANTY DID NOT COVER THE RIM. I WAS LOSING TIRE PRESSURE AND THAT'S WHEN I WAS TOLD OF THE CRACKED RIM. AT MY EXPENSE I'M REPLACING THE RIM $985.10",
        "vin": "1G1YY3D74K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/24/2020",
        "dateOfIncident": "08/27/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360920,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED A RHYTHMIC VIBRATION AND WENT TO CHEVROLET DEALER TO INVESTIGATE. OEM REAR WHEELS HAVE WARPED OUT OF ROUND. CHEVROLET MECHANIC DID NOT FIND PHYSICAL DAMAGE BUT COULD SEE THAT THEY DID NOT SPIN IN A CIRCULAR MANNER. GM WILL NOT HONOR THE BUMPER TO BUMPER WARRANTY. THIS CAR HAS 6,700 MILES ON IT AND HAS NOT BEEN ABUSED IN ANY MANNER. A VEHICLES WHEELS MUST BE ABLE TO SUPPORT NORMAL ROAD CONDITIONS WITHOUT WARPING, BREAKING OR LEADING TO CATASTROPHIC FAILURE",
        "vin": "1G1YX2D72K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/13/2020",
        "dateOfIncident": "09/09/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354775,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKED REAR DRIVERS WHEEL ON 2019 CORVETTE Z06. JUST STARTED TO LOSE AIR PRESSURE. REMOVED WHEEL TO FIND THAT IT WAS CRACKED",
        "vin": "1G1YR2D60K5"
    },
    {
        "components": "STEERING,STRUCTURE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/03/2020",
        "dateOfIncident": "08/30/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352904,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE OWNER OF A 2019 CORVETTE ZR1.  I WAS DRIVING WHEN I HEARD A LOUD RATTLE SOUND COMING FROM THE FRONT BUMPER AREA.  DURING THIS TIME THE FRONT END OF MY CAR BECAME HARD TO CONTROL.  I SLOWED DOWN, PARKED THE CAR AND INSPECTED THE FRONT END.  UPON INSPECTION I SAW THAT MY FRONT SPLITTER HAD NEARLY DISCONNECTED FROM MY CAR.  I TRIED TO DRIVE SLOWLY AND MAKE IT HOME BUT THE SPLITTER WAS SCRAPING AND I DIDN'T FEEL THAT IT WAS SAFE.  I ALSO DIDNT WANT TO CAUSE ANY MORE DAMAGE.  UPON INSPECTION FROM A SHOP IT WAS FOUND THAT THE CENTER SUPPORT BRACKET THAT HOLDS THE FRONT SPLITTER ON PROPERLY WAS NEVER INSTALLED ON MY DURING PRE-DELIVERY INSPECTION.  AFTER SPEAKING WITH SEVERAL OTHER ZR1 OWNERS THAT THIS HAS HAPPENED TO WE NOW BELIEVE THAT SOME CHEVY DEALERS ARE FORGETTING TO PUT THIS CENTER SUPPORT BRACKET ON DURING PRE-DELIVERY INSPECTION WHICH WE BELIEVE CREATES A VERY DANGEROUS SITUATION.  WE HAVE INFORMED CHEVY ABOUT THIS SAFETY ISSUE BUT THEY HAVE NOT RESPONDED.",
        "vin": "1G1Y32D96K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/03/2020",
        "dateOfIncident": "09/03/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353019,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH APPROXIMATLY 12,000 MILES THE DEALER TOLD ME THE LR WHEEL WAS BENT WHEN I HAD IT IN FOR NEW TIRES. AT 13,600 MILES WHEN IN FOR ALIGNMENT I HAD TO REPLACE THE RF WHEEL DUE TO A CRACK. NOT COVERD UNDER WARRANTY, NO SERIOUS POT HOLE HITS, JUST NORMAL ROAD DRIVING. BASED ON NUMEROUS COMPLAINTS ON FOURMS THIS SEEMS TO BE HAPPENING EXCESSIVLY ON THE WIDE WHEEL EQUIPPED CORVETTES.",
        "vin": "1G1YZ2D79K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/31/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352396,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MUCH LIKE MANY OF THE HUNDREDS OF OTHER CORVETTE GRAND SPORT (C7) OWNERS WITH BENT OR CRACKED WHEEL COMPLAINTS, MY CAR HAS FALLEN VICTIM TO GM'S DEFECTIVE DESIGN ACCORDING TO THE CORVETTE SPECIALIST AT MY LOCAL DEALERSHIP AND AN INDEPENDENT INSPECTOR HIRED BY MY THIRD PARTY WARRANTY COMPANY TO REVIEW MY DAMAGE CLAIM.  ALL FOUR WHEELS ON MY VEHICLE HAVE SUFFERED, \"CATASTROPHIC\" DAMAGE ACCORDING TO THE INVESTIGATION DONE BY AN UNBIASED THIRD PARTY AND REPORTED TO THE WARRANTY COMPANY, WHO SUBSEQUENTLY HAVE DENIED MY CLAIM FOR COVERAGE.  ALL FOUR WHEELS ARE BENT ON THE INSIDE OF THE BARREL, WITH ONE ALSO BEING CRACKED (LEFT REAR WHEEL).  ACCORDING TO THE INDEPENDENT INSPECTORS REPORT, THE DAMAGE WAS NOT CAUSED BY A ROAD HAZARD, BUT BY A DEFECTIVE OEM DESIGN.  NOT ONLY IS THIS A MAJOR SAFETY HAZARD THAT SHOULD NOT BE HAPPENING TO A BRAND NEW $75,000 VEHICLE, GM AND OTHER REGULATORY / GOVERNING BODIES ARE DRAGGING THEIR FEET ON TAKING MEANINGFUL ACTION, PLACING LIVES AT DIRECT RISK.  AS HUNDREDS OF OTHERS HAVE REPORTED, GM IS DENYING COVERAGE ACROSS THE BOARD, AND AVOIDING ACKNOWLEDGEMENT OF A DESIGN ISSUE WHILE OWNERS ARE HUNG OUT TO FOOT A $3600 BILL TO REPLACE A SET OF WHEELS.  THIS DAMAGE IS DUE TO REGULAR, DAILY DRIVING ON ROADS THAT ARE NOT MAINTAINED TO THE HIGHEST QUALITY, SUCH AS THOSE FOUND IN THE MIDWEST, WHICH IS WHERE THIS VEHICLE HAS BEEN DRIVEN.  I HAVE VIDEOS OF THE DAMAGE TO EACH WHEEL (WHEELS ON A ROADFORCE BALANCING MACHINE) I CAN PROVIDE ON REQUEST, AND I'M CERTAIN THE INDEPENDENT INSPECTORS REPORT (WHICH CONTAINED EXTENSIVE VIDEO AND PHOTOGRAPHIC EVIDENCE) CAN ALSO BE OBTAINED BY SOMEONE OF AUTHORITY.",
        "vin": "1G1YY2D72K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/10/2020",
        "dateOfIncident": "08/09/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348426,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WHEELS ON MY 2019 CORVETTE GRAND SPORT ARE CRACKING.  THE DEALERSHIP AND GM DON'T SEEM TO BE INTERESTED IN FIXING THEM. THIS CAR IS DRIVEN ON THE HIGHWAY, NEVER TRACKED AND NEVER DRIVEN HARD. THE WHEELS SHOULD BE ABLE TO STAND UP TO REGULAR DRIVING AS WELL AS THE TRACK SINCE THEY PROMOTED IT AS A TRACK READY CAR. SO FAR THE WHEELS ARE HOLDING AIR BUT FOR HOW LONG I DON'T KNOW. AND HOW SAFE IS IT TO BE DRIVING AROUND ON CRACKED WHEELS?  I AM AWARE THAT THIS IS A HUGE PROBLEM WITH GM AND THEY SHOULD BE TAKING CARE OF LOYAL CUSTOMERS.",
        "vin": "1G1Y12D74K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/02/2020",
        "dateOfIncident": "07/31/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342780,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "II WENT TO HAVE NEW TIRES INSTALLED AND THE TWO REAR WHEELS WERE CRACKED. TOOK THE VEHICLE BACK TO THE DEALER AND THEY FOUND THAT THE WHEELS WERE BENT AND CRACKED. NOW THE TIRES WILL NOT MAINTAIN AIR PRESSURE. DEALERSHIP SAID THIS WAS NOT COVERED IN BUMPER TO BUMPER WARRANTY.",
        "vin": "1G1YY3D76K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/31/2020",
        "dateOfIncident": "07/31/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342555,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT REAR TIRE WOULD NOT HOLD AIR TOOK TO SHOP THEY FOUND A 3 INCH CRACK ON INSIDE OF RIM TOOK TO CHEVY BECAUSE ITS A SAFETY ISSUE THEY SAY ITS NOT THERE PROBLEM ON A 2019 CORVETTE IF RIM BREAKS OR SPLITS APART COULD CAUSE DEATH",
        "vin": "1G1YN2D62K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/28/2020",
        "dateOfIncident": "07/27/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341772,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT REAR RIM AND FRONT RIGHT RIM ARE WEARING OUT TIRES OM THE INSIDE TO WHERE TIRE IS NO GOOD BUT HAS PLENTY OF LIFE OVER 75 PERCENT OF TIRE HAD ALIGNMENT DONE ON CAR GARAGE SAID ALIGNMENT IS NOT OUT SAID ITS GOTTA BE THE RIMS WHERE THERE SO WIDE THEY WARP AND CAUSING WEAR ON INSIDE",
        "vin": "1G1YN2D62K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/20/2020",
        "dateOfIncident": "02/03/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340326,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED FEELING A HARMONIC VIBRATION AT ABOUT 3000 MILES.  REPLACED RIGHT FRONT TIRE DUE TO FOREIGN OBJECT IN TREAD.  ASKED THE DEALER TO LOOK INTO THE VIBRATION AND WAS TOLD ALL 4 WHEELS WERE BENT.  DEALER INDICATED THAT THEY HAD CONTACTED GM AND THAT IT WAS A NON WARRANTY ITEM.  THE VEHICLE HAS BEEN DRIVEN NORMALLY ON REGULAR ROADS WITHOUT POTHOLES OR HEAVES",
        "vin": "1G1YW2D70K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/20/2020",
        "dateOfIncident": "07/05/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340422,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "3 BENT RIMS ON A CAR THAT IS PLEASURE DRIVEN WITH ONLY 6,555 MILES.",
        "vin": "1G1YX2D79K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/08/2020",
        "dateOfIncident": "07/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338148,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 CHEVROLET CORVETTE. THE CONTACT STATED THAT THE VEHICLE SHUDDERED WHILE DRIVING. THE VEHICLE WAS TAKEN TO VADEN CHEVROLET POOLER LOCATED AT 300 OUTLET PARKWAY, POOLER, GA 31322, TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE SET OF WHEELS WERE BENT. THE DEALER SUBMITTED A CLAIM TO THE MANUFACTURER HOWEVER, THE WHEELS WERE NOT COVERED UNDER WARRANTY. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE WHEELS WERE NOT REPLACED. THE FAILURE MILEAGE WAS 15,597.",
        "vin": "1G1YU2D67K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/06/2020",
        "dateOfIncident": "06/29/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337734,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK MY NEW 2019 CHEVROLET GRAND SPORT CORVETTE, PURCHASED MAY 27 2020, TO THE DEALER FOR 500 MILE OIL CHANGE. INFORMED DEALER I HAD VIBRATION AT 65 MPH AND UP TO  75 MPH (MAYBE HIGHER). DEALER INFORMED ME THAT ALL 4 WHEELS ARE BENT OUT OF SPEC. DEALER REFERRED TO GM CORPORATE FOR WARRANTY CLAIM. GM DECLINED THE CLAIM. I FOLLOWED THE GM RECOMMENDED BRAKE IN PROCEDURE, DID NOT HIT ANYTHING, NO HARD BRAKING, NO WIDE OPEN THROTTLE, NO BURNOUTS, ETC. THE MAJORITY OF THE 500 MILE WAS ALL INTERSTATE VARYING THE SPEED FROM 55 MPH TO 75 MPH.",
        "vin": "1G1YY2D76K5"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/08/2020",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327702,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 CHEVROLET CORVETTE. THE CONTACT STATED THAT WHILE ATTEMPTING TO MOVE THE VEHICLE AFTER THE VEHICLE WAS PARKED, THE FRONT BRAKES FAILED TO RELEASE. THE FAILURE OCCURRED AFTER THE BRAKES BECAME WET FROM THE RAIN. ADDITIONALLY, THE SHIFTER CABLE FRACTURED AND THE TRANSMISSION WAS UNABLE TO BE SHIFTED INTO GEAR. THE VEHICLE WAS TAKEN TO SUBURBAN CHEVROLET OF CLINTON LOCATED AT 1070 WEST US 12, CLINTON, MI 49236, HOWEVER, THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURES. THE FAILURE MILEAGE WAS 100.",
        "vin": "1G1YY2D76K5"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/04/2020",
        "dateOfIncident": "04/30/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323272,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY A8 TRANSMISSION IN MY 2019 CORVETTE BEGAN TO SHIFT IRREGULARLY AT 6K MILES, 10 MONTHS.  IT SOUNDS LIKE IT'S GRINDING ROCKS WITH QUARTERS. IT AT THE DEALERSHIP WHO VERIFIED IT'S THE TORQUE CONVERTER WHICH HAS CAUSED 'COLLATERAL DAMAGE'",
        "vin": "1G1YB2D7XK5"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/19/2020",
        "dateOfIncident": "04/07/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321553,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LAP-SHOULDER BELT WILL NOT REMAIN IN THE  SEAT BELT GUIDE AS IT SHOULD.  THEREFOR THE SEAT BELT DOES NOT FIT OVER THE SHOULDER AND ACROSS THE CHEST OF SMALLER ADULTS OR OLDER CHILDREN AS REQUIRED TO KEEP THEM SAFE IN THE EVENT OF A COLLISION.  THE SEAT BELT COMES OUT OF THE GUIDE WHEN MOVING AND AT TIMES WHEN STATIONARY.  THE GAP IN THE GUIDE IS TOO LARGE.  THIS PROBLEM APPEARS TO BE SO PREVALENT THAT AN AFTER MARKET CLIP IS ON THE MARKET TO HOLD THE SEAT BELT INTO PLACE.",
        "vin": "1G1YM2D70K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/30/2020",
        "dateOfIncident": "02/14/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319690,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "NEW CORVETTE HAD BENT THE RIGHT REAR RIM ON A SMALL BUMP IN PAVEMENT. SPEED WAS 20-25 MPH. RIM AND TIRE BOTH LOOKED VISUALLY FINE UNTIL THE CAR WAS RAISED AND WHEEL TURNED BY HAND REVELING A WOBBLE IN RIM. THIS CAUSED THE CAR TO VIBRATE ON THE ROAD. MADE A REPORT WITH GM TO DOCUMENT KNOW ISSUES WITH WEAK RIMS.",
        "vin": "1G1YV2D77K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/24/2020",
        "dateOfIncident": "12/30/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319130,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY CAR AS NEW FROM F.H. DAILEY (1ST TITLE WITH WARRANTY ON \"CAPTURED TEST FLEET\").  AS I DROVE HOME I REALIZED A LOT OF VIBRATION AND TRACKING ISSUES WITH THE CAR.  THE NEXT MORNING I TOOK THE CAR TO COSTCO TO AIR UP THE TIRES.  ALL PRESSURES WERE DIFFERENT AND FAR OFF THE REQUIRED 30 COLD PSI.  I NOTICED THE BALANCING WEIGHTS WERE MISSING FROM THE FRONT WHEELS.  I TOOK THE VEHICLE TO ABEL CHEVROLET TO CHECK THE WHEELS FOR SAFETY, AND IT WAS DISCOVERED ALL (4) WHEELS WERE BENT AND COULD NOT BE TRUE BALANCED.  THE DEALERSHIP AND GM REFUSED TO REPLACE THESE WHEELS, WHICH PRESENTS A SAFETY ISSUE ON A HIGH PERFORMANCE ZR1 CORVETTE.    3339 MILES HAD BEEN PLACED ON THIS VEHICLE, AS EXECUTIVE VALIDATION BUILT,CORVETTE.  ABEL CHEVROLET DETERMINED THAT THE CORVETTE WAS LIKELY \"TRACKED\" , CAUSING THE BENT RIMS/WHEELS, DAMAGED BY THE RAISED APEX(S) OF THE TRACK SURFACE.  I ATTACHED THE SERVICE INVOICE WITH TECHNICIAN OBSERVATIONS.  IT WAS DEMONSTRATED TO ME, THE IRREGULAR GYRATION OF THE WHEELS ON THE BALANCING MACHINE.  ABEL CHEVROLET IS A CORVETTE CENTRIC SERVICE CENTER FOR GM VEHICLES.",
        "vin": "1G1Y52D94K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/03/2019",
        "dateOfIncident": "11/25/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286531,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH 4600 MILES ON THE CAR ON SMOOTH ROADS HERE IN AZ I HAVE 2 BENT FRONT RIMS. I HAVE NOT CHECKED THE REARS YET.",
        "vin": "1G1YW2D74K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/25/2019",
        "dateOfIncident": "11/04/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282289,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 CHEVROLET CORVETTE. ON SEVERAL OCCASIONS, THE CONTACT BECAME AWARE OF HAIRLINE CRACKS TO THE REAR RIMS DUE TO LOW TIRE PRESSURE. THE VEHICLE WAS TAKEN TO RAY CHEVROLET (716 W SUMMERS DR, ABBEVILLE, LA 70510, (337) 385-9999) TO BE INSPECTED; HOWEVER, THE DEALER WAS UNABLE TO REMOVE THE TIRE FROM THE RIM DUE TO ITS SIZE. THE CONTACT WAS ADVISED TO HAVE THE VEHICLE TAKEN TO A TIRE SERVICE LOCATION THAT HAS THE PROPER TOOLS. THE WHEEL WAS REPAIRED, BUT THE FAILURE RECURRED ONCE THE CONTACT ARRIVED HOME. THE MANUFACTURER WAS CONTACTED AND NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 15,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/09/2019",
        "dateOfIncident": "10/31/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279099,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2X FLAT TIRES ON THE REAR R WHEEL. DEALER SAYING RIM IS \"CRACKED\" DUE TO ROAD HAZARDS/DRIVER USE. GM BLAMING \"WEAR AND TEAR\", GM CURRENTLY IN LAWSUIT FOR FAULTY RIMS THAT \"CRACK\" WITH EVERYDAY USE. DEALER CHARGING ME FULL PRICE TO FIX WHEEL. MULTIPLE CALLS HAVE BEEN MADE TO GM FOR THIS ISSUE WITHOUT RESOLVE. NEW RIM COST:936$. VEHICLE HAS 10100 MILES, NO TRACK/STREET RACING.",
        "vin": "1G1YW2D74K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/01/2019",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277482,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A CRACKED RIGHT REAR WHEEL ON MY CAR.  IT IS CRACKED IN TWO PLACES ON THE INNER RIM.  THE WHEEL IS ALSO WARPED.  THE WHEEL IS LEAKING AIR FROM MY TIRE, THEREFORE MAKING IT UNSAFE TO DRIVE.",
        "vin": "1G1YY2D72K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/25/2019",
        "dateOfIncident": "09/20/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271118,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN THE ROAD AT NIGHT, I HIT A POT HOLE WITH THE RIGHT FRONT AND RIGHT REAR TIRE. AFTER STRIKING THE HOLE AN IMMEDIATE VIBRATION THROUGH OUT THE CAR STARTED. NEXT DAY I RAISE THE FRONT AND REAR WHEELS OFF THE FLOOR AND SPUN THE WHEELS WITH A BOARD NEXT TO THE SIDE OF THE TIRE. BOTH WHEELS WHEN TURNING WOBBLE AGAINST THE BOARD INDICATING A BENT RIM. CLAIM # CM-1943186 HAS BEEN SUBMITTED TO MY WHEEL INSURANCE POLICY. MANY W",
        "vin": "1G1YY2D75K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/24/2019",
        "dateOfIncident": "08/29/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270884,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A NEW 2019 Z 06 CORVETTE PURCHASED NEW BY MYSELF. I HAVE 2400 MILES ON IT AND NOTICED A VIBRATION WHILE DRIVING. I WENT TO DISCOUNT TIRE TO HAVE TIRES BALANCED AND WAS TOLD MY RIGHT FRONT AND REAR RIMS WERE BENT AND IT WAS DANGEROUS TO DRIVE AS THEY WILL LIKELY SPLIT IF I KEEP DRIVING ON THEM. THIS IS DANGEROUS AND NEEDS TO BE REMEDIED! THERE ARE FAR TOO MANY RIMS WITH SAME PROBLEM TO BE JUST TO DRIVERS FAULT FROM HITTING A POTHOLE. THIS IS THE ONLY CAR I HAVE OWNED THAT HAS HAD THIS PROBLEM. I HAVE OWNED 5 OTHER LATE MODEL CORVETTES AND PUT A LOT OF MILES ON THEM WITH NO WHEEL PROBLEMS ON THESE SAME ROADS. I HAVE A 2016 CAMARO WITH FACTORY RIMS AS WELL WITH 15K MILES ON IT AND NEVER HAD A PROBLEM EITHER. I HAVE A 2018 XT5 CADILLAC AS WELL WITH NO WHEEL ISSUES. ALL ON SAME ROADS DAILY.  IT IS NOT JUST COINCIDENTAL THAT THESE WHEELS ARE FAILING FOR ME AND THOUSANDS OF OTHER OWNERS. ARE WE TO WAIT UNTIL SOMEONE HAS A WHEEL FAILURE AND CRASHES AND DIES BEFORE WE ADDRESS THIS ISSUE? EVEN LOSING AIR IN THE TIRE AND SITTING ON THE SIDE OF THE ROAD WAITING FOR ROAD SERVICE CAN BE VERY DANGEROUS. THERE IS NO EXCUSE FOR GM NOT TO ADDRESS THIS PROBLEM NOW BEFORE ANYONE IS SERIOUSLY INJURED OR KILLED AS A RESULT OF THIS DEFECT! PLEASE DO SOMETHING NOW! SINCERELY, [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *CC *TR",
        "vin": "1G1YS2D63K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/17/2019",
        "dateOfIncident": "10/07/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269165,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER 9,000 MILES, THE REAR DRIVER SIDE WHEEL WAS LEAKING AIR. UPON INSPECTION BY COMMUNITY CHEVROLET DEALER IN BURBANK, THE WHEEL WAS CRACKED IN A HANDFUL OF PLACES. THE DEALER CONCLUDED THAT THERE WAS NO MISUSE DAMAGE AND SUBMITTED THE REIMBURSEMENT CLAIM TO CHEVROLET HQ. HQ DENIED THE CLAIM TO REPLACE THE FAULTY WHEEL.",
        "vin": "1G1YW2D72K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/25/2019",
        "dateOfIncident": "07/20/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258031,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CORVETTE, 2019 ZO6: FOUR (4) BENT WHEELS AND ONE (1) BENT/CRACKED WHEEL IN LESS THAN 4000 MILES OF NORMAL DRIVING. THESE ARE ALL CAST ALUMINUM WHEELS THAT ARE TOO SOFT TO WITHSTAND NORMAL ROADS AND NORMAL DRIVING. I AM WORRIED ONE MAKE CRACK AT HIGH SPEED AND CAUSE A CRASH.",
        "vin": "1G1YS2D63K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/25/2019",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258154,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 CHEVROLET CORVETTE. UPON INSPECTION, THE CONTACT DISCOVERED THAT THE INNER SECTION OF THE REAR DRIVER'S SIDE WHEEL/RIM WAS CRACKED. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. MATICK CHEVROLET (14001 TELEGRAPH RD, REDFORD, MI) WAS CONTACTED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 5,800.",
        "vin": "1G1YW2D73K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/17/2019",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256079,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEELS BENDING AND CRACKING.",
        "vin": "1G1YW3D71K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/12/2019",
        "dateOfIncident": "09/07/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255109,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A NEW 2019 CORVETTE Z06 BACK IN FEBRUARY 2019. AS OF SEPT 07, 2019 I HAD APPROXIMATELY 3,000 MILES ON THE VEHICLE, THE MAJORITY OF WHICH WERE HIGHWAY MILES FROM A ROAD TRIP BETWEEN MI AND THE EAST COAST. I GOT AN UNEXPECTED \"LOW TIRE PRESSURE\" MESSAGE ON MY IP WHILE DRIVING DOWN A SMOOTH ROAD. I AIRED UP THE TIRE AND INSPECTED IT FOR A PUNCTURE BUT FOUND NOTHING. USING SOAPY WATER, I DETERMINED I WAS LEAKING AROUND THE INNER SIDE OF THE RIM. I BROUGHT THE VEHICLE IN FOR SERVICE TO FIND THE ALUMINUM DIE CAST RIM HAD A SIGNIFICANT CRACK IN IT RESULTING IN THE LEAK. THE DEALERSHIP REPORTED THE CONDITION, WITH PICTURES, TO THEIR WARRANTY OFFICE WHO ASKED FOR ADDITIONAL MEASUREMENTS TO DETERMINE IF THE TIRE WAS OUT OF ROUND WHICH I AM SURE THEY WERE HOPING TO ATTRIBUTE TO SOME SORT OF ABUSE. I UNDERSTAND THE RESULTS TO HAVE BEEN WITHIN GM SPECIFICATION WHICH IS NO SURPRISE AS I DRIVE THIS CAR VERY CAREFULLY AND AVOID ROUGH ROADS. GM HAS SINCE RESPONDED THAT THEY WILL NOT COVER THIS UNDER THEIR 3YR/36K MILE BUMPER TO BUMPER WARRANTY. I DID AN ODI SEARCH FOR THIS CONDITION AND THERE ARE SOME100+ COMPLAINTS FOR THIS EXACT ISSUE. THIS IS OBVIOUSLY A SAFETY CONCERN AND GM NEEDS TO RECOGNIZE THIS AND RECALL THESE RIMS BEFORE PEOPLE ARE INJURED. I AM BESIDE MYSELF THAT GM WOULD TREAT THEIR CUSTOMERS THIS WAY, ESPECIALLY GIVEN THESE VEHICLES PRICE OUT NEAR $90,000. I HAVE ORDERED A NEW RIM WHICH I AM INFORMED WILL COST ~$1,100 ONCE INSTALLED. SINCE THE RIM IS BEING REPLACED WITH THE SAME DEFECTIVE PRODUCT, I CAN ONLY EXPECT THE LIKELIHOOD OF ANOTHER INCIDENT. I AM VERY DISAPPOINTED WITH GM AND WILL NOT BE BUYING ANY FUTURE CORVETTES!!!",
        "vin": "1G1YR2D60K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/23/2019",
        "dateOfIncident": "07/26/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246130,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2 REAR TIRE RIMS HAVE CRACKED. UP THE SIDE AND ACROSS  PART OF THE BARREL..  2 FRONT TIRE RIMS ARE OUT OF ROUND.",
        "vin": "1G1YY2D71K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/21/2019",
        "dateOfIncident": "08/17/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245570,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 CHEVROLET CORVETTE. WHILE WASHING THE VEHICLE, THE CONTACT NOTICED THAT THE REAR PASSENGER TIRE WAS MISSING A WHEEL WEIGHT. THE CONTACT DROVE THE VEHICLE TO BACHMAN CHEVROLET (9650 BLUEGRASS PKWY, LOUISVILLE, KY 40299, (502) 499-6161) WHERE THEY ASSURED HIM THAT THE WHEEL WAS BALANCED; HOWEVER, THE REAR PASSENGER TIRE HAD A BENT RIM. UPON RESEARCH, THE CONTACT DISCOVERED THAT A BENT RIM COULD RESULT IN THE RIM CRACKING OVER TIME WHILE TRAVELING AT HIGH SPEEDS, WHICH COULD ULTIMATELY LEAD TO TIRE FAILURE. THE CONTACT REFUSED TO PURCHASE A NEW RIM. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 10,400. *JB",
        "vin": "1G1Y52D90K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/19/2019",
        "dateOfIncident": "08/12/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245024,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BENT LEFT FRONT WHEEL. THIS OCCURRED WITH NO OTHER VISIBLE DAMAGE  AND I HAVE NOT HIT ANY POT HOLES OR ROAD DEBRIS.",
        "vin": "1G1YX2D78K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/12/2019",
        "dateOfIncident": "07/19/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243286,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ATTEMPTING TO BALANCE TIRES, FOUND FRONT RIGHT WHEEL BENT.  UNABLE TO PROPERLY BALANCE IT UNTIL REPAIRED.  POSES SAFETY RISK IF THE WHEEL BREAKS OR FURTHER BENDS.",
        "vin": "1G1YY3D7XK5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/05/2019",
        "dateOfIncident": "07/24/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241847,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "OEM CHROME WHEELS.  THREE ARE BENT, CAUSING VIBRATION.  NO KNOWN CAUSE, DIDN'T HIT ANY CURB, OBSTACLE, LARGE POTHOLE.  DISCOUNT TIRE OBSERVED THE ISSUE WHILE TRYING TO BALANCE THE WHEELS.",
        "vin": "1G1YX3D79K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/31/2019",
        "dateOfIncident": "07/16/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240796,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TIRE ON THE REAR PASSENGER SIDE HAD A LEAK SO WE TOOK IT TO THE DEALER AND FOUND A CRACK IN THE RIM. WE PARKED IN THE GARAGE AND WAITED FOR THE NEW RIM. THE CAR DID NOT MOVE UNTIL I TOOK IT BACK TO THE DEALER TO GET IT FIXED. WHEN THEY TOOK THE RIM OFF THEY CHECKED ALL THE OTHER TIRES AND FOUND THE REAR DRIVERS RIM WAS CRACKED IN 4 PLACES AND THE PASSENGER SIDE HAD AN OTHER CRACK. THE DEALER SAID IT WAS A FACTORY DEFECT IN THE RIMS. GM WILL NOT COVER THE EXPENSE AND THE CAR IS STILL UNDER THE BUMPER TO BUMPER WARRANTY. WE HAD PLANNED ON TAKING THE CAR ON VACATION TO YELLOWSTONE. I ASKED THE DEALER WHAT COULD HAVE HAPPENED AND HE SAID WE WOULD NOT HAVE MADE IT AND I WOULD NOT BE STANDING THERE TALKING TO THEM. THERE WAS NO DAMAGE TO THE TIRES. THE CAR HAD BEEN SITTING IN THE GARAGE NOT MOVING BECAUSE WE WERE ON VACATION IN YELLOWSTONE.",
        "vin": "1G1YY2D72K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/20/2019",
        "dateOfIncident": "07/11/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233550,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "7/11/19 - TRAVELLING ON THE INTERSTATE WITH APPROXIMATELY 1700 MILES ON A 2019 CORVETTE GRAND SPORT I STARTED TO NOTICE A VIBRATION WHILE TRAVELLING AROUND 65 MPH ON THE INTERSTATE. THE VEHICLE NOW HAS 3000 MILES ON IT AND THE VIBRATION HAS BECOME WORSE SO THAT IT IS NOTICEABLE AT ANY SPEED.  THE VIBRATION CAN BE FELT THROUGH THE ENTIRE VEHICLE, AS WELL AS THROUGH THE STEERING WHEEL.  LOOKING AT THE STEERING WHEEL WHILE DRIVING ON A STRAIGHT SMOOTH ROAD IT IS POSSIBLE TO WATCH THE STEERING WHEEL VIBRATE.  ON A LONG ROAD TRIP THE VIBRATION IN THE STEERING WHEEL ALSO STARTED TO CAUSE NUMBNESS IN MY HANDS. 7/15/19 - MY FIRST COURSE OF ACTION WAS TO HAVE THE WHEELS CHECKED FOR BALANCE, SHIFTED OR BROKEN BELT IN THE TIRE.  THE TIRE REPAIR FACILITY SAID THE BALANCE AND TIRES LOOKED GOOD. (NO CHARGE) 7/18/19 - NEXT STEP WAS TO HAVE THE ALIGNMENT CHECKED.  AFTER A MINOR ADJUSTMENT TO THE FRONT END ALIGNMENT THE VIBRATION PERSISTED. (RECEIPT IS CURRENTLY IN VEHICLE AT DEALERSHIP) 7/19/19 - NEXT I TOOK THE VEHICLE TO THE DEALERSHIP.  THEY HAVE INFORMED ME THAT ALL SUSPENSION AND STEERING COMPONENTS ARE GOOD, BUT ALL 4 WHEELS ARE BENT.  THEY ALSO MENTIONED THAT THERE IS NO DAMAGE TO THE TIRES OR WHEELS FROM AN OUTSIDE OBJECT SUCH AS A CURB OR ROAD DEBRIS.  (DEALERSHIP IS TO BE COMPLETING DOCUMENTATION ON 7/22/19 REGARDING POSSIBLE WARRANTY AND SAFETY CONCERN COMMUNICATION TO GENERAL MOTORS)  MY CONCERN IS THAT THE VIBRATION WILL CONTINUE TO GET WORSE AND CONTROLLING THE VEHICLE WILL BECOME INCREASINGLY DIFFICULT.  *TR  COMPLAINT DOES NOT MATCH CARFAX VEHICLE INFO. *JB",
        "vin": "1G1YY2D75K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/18/2019",
        "dateOfIncident": "07/03/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232982,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER JUST 3,910 MILES THE TIRES WERE WORN PAST THE POINT OF INSPECTION. GM HAS SAID THIS IS NORMAL WEAR, IF NOT FOR THE ANNUAL INSPECTION STICKER I WOULDN'T HAVE GIVEN THESE TIRES A SECOND THOUGHT. TIRES WORN OUT IN JUST 3,910 MILES IS A SAFETY HAZARD AND TO THINK THAT 3-4 SETS OF TIRES ANNUALLY FOR SOMEONE WHO WOULD DRIVE THIS TO WORK DAILY IS JUST RIDICULOUS.HOW CAN A MANUFACTURER INSTALL SUCH A TIRE ON A STREET DRIVEN AUTOMOBILE?    THERE IS NO WARNING THAT THESE TIRES PREMATURELY WEAR ON THE SALES LITERATURE OR INSTRUCTED BY THE DEALER.",
        "vin": "1G1YS2D61K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/14/2019",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231720,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKED RIGHT REAR WHEEL DIAGNOSED AFTER LOSING AIR ON A DAILY BASIS",
        "vin": "1G1YX2D7XK5"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/08/2019",
        "dateOfIncident": "07/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229989,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS OF POWER STEERING ASSIST AT 198, 213, 268, 305, AND 314 MILES. VEHICLE WAS PURCHASED NEW ON JUNE 29, 2019 AND NOW HAS 322 MILES ON IT.  INCIDENTS OCCURRED WHILE BACKING OUT OF A DRIVEWAY, CHANGING LANES ON THE HIGHWAY AT 50 MPH, ON A HIGHWAY CURVE AT 55 MPH, ON A RESIDENTIAL STREET AT 25 MPH, AND COMING TO A STOP IN A TURN LANE.  DEALER I WENT TO AFTER THE SECOND OCCURRENCE RESET THE CODE (CO47A) AND SENT ME ON MY WAY.  POWER STEERING ASSIST WOULD RETURN AFTER TURNING THE CAR OFF AND RESTARTING IT.  SYMPTOMS ARE THE SAME AS ON GM RECALL N182182760 AND NHTSA CAMPAIGN # 19V086000",
        "vin": "1G1YY2D77K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/15/2019",
        "dateOfIncident": "06/14/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220300,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SAT STILL FOR THREE DAYS AND WHEN I WENT TO DRIVE IT, THE COMPUTER TOLD ME THAT MY LEFT REAR TIRE WAS DEFLATED TO ONLY 14 PSI INSTEAD OF 30 PSI. THEY ARE RUN FLAT TIRES, SO YOU CAN'T TELL IF THEY ARE FLAT. TOOK IT TO A CORVETTE MECHANIC AND WHEN HE REMOVED THE WHEEL, HE FOUND A GOOD SIZE CRACK IN THE INSIDE OF THE WHEEL AND AIR WAS LEAKING FROM THAT CRACK. I TOOK IT TO A DEALER AFTER I FILLED IT BACK TO 30 PSI AND ORDERED A NEW WHEEL. THIS MORNING I CHECKED THE COMPUTER AND THE PSI IS DOWN TO 20 OVERNIGHT. I HAVE NOT HIT ANY POTHOLES OR RACED THE CAR. THERE IS NO OTHER DAMAGE TO THE WHEEL OR TIRE.",
        "vin": "1G1Y12D73K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/13/2019",
        "dateOfIncident": "06/12/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219834,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2 CORVETTE Z06 WHEELS ARE BENT AFTER ONLY 2200 MILES OF DRIVING. 11 WEEKS OLD.",
        "vin": "1G1YR3D68K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/16/2019",
        "dateOfIncident": "05/08/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207989,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I FELT VIBRATION IN MY WHEELS AND HEN I TAKEN 3 OF MY RIMS WERE BENT I SWITCH THEM AND PAID OVER 2K 3 WEEKS AFTER MY RIMS ARE BENT AGAIN ON MY 2019 Z06 CORVETTE I THINK THIS SHOULD BE SAFETY  ISSUE AND GM SHOULD RECALL THIS RIMS AND REPLACE THEM WITH OTHER STRONGER RIMS I ONLY HAVE 2900 MILES ON THE CAR",
        "vin": "1G1YS2D66K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/14/2019",
        "dateOfIncident": "05/11/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207525,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BENT REAR WHEEL ON MY 2019 GS CORVETTE, VEHICLE BEGINS VIBRATING, SHAKING  AT 25 MPH  UNABLE TO DRIVE , DEALER FOUND BENT  DRIVERS SIDE REAR TIRE SEVERELY BENT WHEN , ONLY 3200 MILES ON VEHICLE. DEALER IS REPLACING WHEEL, AND ALSO( AT MY URGING) TIRE AT  PRESENT. PROBLEM IS THE RIMS ARE SCARCE AND MAY TAKE DAYS TO FIND REPLACEMENT. MEANWHILE, UNABLE TO DRIVE $75000.00 CAR! I HAVE RESEARCHED THIS PROBLEM AND FOUND THIS PROBLEM WITH THESE CAST ALUMINUM WHEELS ARE WIDESPREAD.",
        "vin": "1G1YY2D73K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/13/2019",
        "dateOfIncident": "05/09/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207159,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "SECOND TIME IN 3 MONTHS THAT THE RIMS HAVE BENT WHILE DRIVING.  I HAD A 2017 CHEVY CORVETTE WHICH WAS REPURCHASED DUE TO MANUFACTURING DEFECT AND NEVER HAD THIS PROBLEM.  THE FIRST TIME CAR HAD 600 MILES AND 2 RIMS BENT WHEN ENCOUNTERING A POTHOLE.  THIS TIME, CAR NOT REPAIRED YET, HAS 1100 MILES AND ANOTHER RIM BENT DRIVING.  THE SLIGHTEST IMPERFECTION IN THE ROADWAY CAUSES THESE RIMS TO BEND.    I BELIEVE THESE RIMS ARE BEING MANUFACTURED POORLY.  BOTH TIMES I WAS TRAVELING ON A HIGHWAY.",
        "vin": "1G1YN2D68K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/11/2019",
        "dateOfIncident": "03/08/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207046,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BENT WHEEL DISCOVERED WHEN TIRES WERE SWITCHED AT 144 MILES. BENT WHEEL NOTED ON RECEIPT FOR NEW TIRES. DEALERSHIP REFUSED TO ACKNOWLEDGE BENT WHEEL. SHOULD BE COVERED UNDER NEW CAR WARRANTY. BENT WHEELS CAN RESULT IN CRACKED WHEELS WITH ADDITIONAL DRIVING. HAVE VIDEOS OF BENT WHEEL ON BALANCER.",
        "vin": "1G1YZ3D78K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/18/2019",
        "dateOfIncident": "04/18/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11197262,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DEVELOPED SLOW LEAK ON FRONT DRIVERS SIDE TIRE. LATER DIAGNOSED AT DEALER AS CRACKED WHEEL. I BELONG TO CORVETTE FORUM AND MANY MEMBERS ARE HAVING SIMILAR ISSUES. THIS IS A SAFETY HAZARD AND NEEDS TO BE ADDRESSED",
        "vin": "1G1YX2D74K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/14/2019",
        "dateOfIncident": "04/13/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196092,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKED LEFT REAR WHEEL RIM INNER EDGE REQUIRING WHEEL REPLACEMENT",
        "vin": "1G1YY2D77K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/14/2019",
        "dateOfIncident": "03/12/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196095,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKED RIGHT REAR WHEEL",
        "vin": "1G1YY2D77K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/08/2019",
        "dateOfIncident": "03/25/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194539,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR HAS 3K ON IT AND TOOK IT TO THE DEALER FOR A SLIGHT VIBRATION ONLY TO BE TOLD NOT ONE BUT (4) WHEEL WERE BENT. THIS IS MY 5TH CORVETTE, NEVER HAD AN EPISODE SO VIOLENT AS TO BEND (4) WHEELS AND I DRIVE THIS CAR EVERY DAY",
        "vin": "1G1YY2D78K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/07/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194507,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I EXPERIENCED THREE CRACKS IN MY REAR PASSENGER SIDE WHEEL AFTER OWNING THE CAR 6 MONTHS AND NOT HITTING ANY POT HOLES.  THERE WAS NO DAMAGE TO THE TIRE AT ALL.",
        "vin": "1G1YZ2D71K5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/04/2019",
        "dateOfIncident": "04/03/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193742,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "UNLIKE MY REAR-LEFT WHEEL (SEE COMPLAINT #11192823) WHICH HAS FOUR CRACKS AND LOSES ABOUT 24 PSI PER DAY, MY RIGHT-REAR WHEEL ISN'T LOSING ANY AIR (YET). HOWEVER I PULLED THE IT OFF TONIGHT AND DISCOVERED TWO CRACKS DEVELOPING ON IT AS WELL. AGAIN, AS IN THE LEFT-REAR WHEEL, THERE ARE NO BUMPS OR BRUISES ON THE RIM AT THE POINTS OF FAILURE.",
        "vin": "1G1YZ2D77H5"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/14/2019",
        "dateOfIncident": "09/28/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180116,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE MAKES A BUMPING , GRINDING METALIC NOISE WHEN TURNING SLOWLY IN EITHER DIRECTION. OR IN REVERSE. IT HAS BEEN SEEN BY TWO DEALERS ON THREE SEPARATE OCCASIONS. THE LAST TIME I WAS GIVEN A BULLETIN (#14-03-10-001D) 3-2-17, FROM CHEVROLET STATING THAT THIS WAS TYPICAL OF MANY CORVETTES DUE TO \"ACKERMANN EFFECT\" CAUSING TIRE CHATTER WHEN TURNING SLOWLY AT A TIGHT ANGLE. MY VEHICLE DID NOT EXHIBIT THIS PROBLEM UNTIL APPROX.1,000 MILES AND HAS PROGRESSIVELY GOTTEN WORSE AND IT NOW HAS OVER 4,000 MILES ON THE ODOMETER. I HAVE DRIVEN THIS CAR IN A DRIVING RAIN WITH SLICK PAVEMENT, AND THE NOISE IS EVEN LOUDER, SO THAT IF TIRE CHATTER WERE THE PROBLEM, I WOULD THINK THAT THE NOISE WOULD GO AWAY, OR AT LEAST LESSEN SOMEWHAT. IT DID NOT. IT IS MY OPINION THAT AT SOME POINT, THIS CAR'S FRONT SUSPENSION WILL BREAK, POSSIBLY CAUSING AN ACCIDENT.",
        "vin": "1G1YB2D76K5"
    }
]