[
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/12/2021",
        "dateOfIncident": "10/01/2021",
        "fire": false,
        "manufacturer": "Cruiser RV",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436440,
        "products": [
            {
                "manufacturer": "Cruiser RV",
                "productMake": "CRUISER RV",
                "productModel": "SHADOW CRUISER",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Cruiser RV Shadow Cruiser RV. The contact received notification of NHTSA Campaign Number: 21V428000 (Equipment) however, the part to do the recall repair was unavailable. The local dealer was not yet contacted. The contact called the number listed on the recall notice and left a message but received no return call. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The contact had not experienced the failure. Parts distribution disconnect.",
        "vin": "5RXDB2229KN"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/07/2019",
        "dateOfIncident": "06/20/2019",
        "fire": false,
        "manufacturer": "Cruiser RV",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242377,
        "products": [
            {
                "manufacturer": "Cruiser RV",
                "productMake": "CRUISER RV",
                "productModel": "SHADOW CRUISER",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO IDENTICAL TOW TRAILER RV\"S MADE BY CRUISER RV 2018 &2019 MODEL 225RBS SHADOW CRUISER. SEVERE AXLE FAILURES ON BOTH TRAILERS AFTER APPROX 2,000 MILES USE.SEVERE CAMBER & TIRES OUT OF ALIGNMENT,SEVERE TIRE WEAR EXPOSING STEEL BELTS.BOTH CAMPERS HAVE CRACKED FRAMES ABOVE AXLE/SPRING MOUNTS.THE SAME AXLE ON THE 2018 TRAILER REPLACED LAST YEAR BY DEALER BUT FAILED AGAIN THIS YEAR SAME PROBLEM. THE 2019 TRAILER AXLES FAILED TWO MONTHS AFTER INITIAL PICKUP DATE OF APRIL 16, 2019. NOTE IT'S A BRAND NEW TRAILER! I CALLED CRUISER RV AND TOLD THEM OF THE AXLE FAILURE, THEY WOULD ONLY REPLACE THEM WITH AXLE TRAILERS CAME WITH.DEALER INSPECTED BOTH TRAILERS STATING BOTH AXLES ON BOTH TRAILERS HAVE FAILED AND THEY WOULD REPLACE THEM WITH STRONGER AXLES.DURING AXLE REPLACEMENT IT WAS DISCOVERED THAT BOTH TRAILERS HAVE CRACKED FRAMES ABOVE THE SPRING MOUNTS REQUIRING WELDING STEEL PLATES OVER CRACKS. FLAGG RV THE DEALER HAS HELPED US BUT MY SISTER AND I ARE VERY CONCERNED ABOUT THE SAFETY OF OTHERS WITH THESE DEFECTIVE TRAILERS AS THEY PRODUCE THOUSANDS OF THESE EACH YEAR AND ARE DANGEROUS ON THE ROAD. OUR CAMPERS ARE EXACTLY THE SAME MAKE & MODEL ONE CONSECUTIVE YEAR APART. WE HAVE PICTURES WE CAN SUBMIT UPON REQUEST. CAN BE SENT FROM I PHONE.NAME OF CAMPERS: SHADOW CRUISER, 225RBS. MANUFACTURED BY CRUISER RV. NOTE: AXLE PROBLEMS DON'T SHOW UNTIL APPROX. 2,000 MILES ARE DRIVEN.     ## VIN PASSED ## , ##",
        "vin": "5RXDB2521K1"
    }
]