[
    {
        "components": "POWER TRAIN,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/04/2022",
        "dateOfIncident": "02/08/2022",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459629,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "DYNAMAX",
                "productModel": "ISATA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Traveling on a busy interstate, traffic limited to one lane because of construction.  Traffic stopped, instructed by law enforcement to turn off vehicle to wait.  Shortly after, traffic started moving but our vehicle would not start.  After stopping traffic for about 15 minutes the vehicle finally started. Incident repeated at a gas station, stopped for gas, filled up, when complete would not start, once again after 15 minute wait it started. Dealer unable to get the problem to repeat.  Onboard diagnostic computers didn't record the fault.  Mercedes Benz corporate will not do anything to assist getting the issue fixed until repeated by the dealer. Researched online and found video of someone else with exact problem and solution.  Many comments of others with same issue. We have owned this vehicle for about 500 of its 10000 miles.",
        "vin": "WDAPF4CC4H9"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/19/2020",
        "dateOfIncident": "10/16/2020",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365163,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "DYNAMAX",
                "productModel": "ISATA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD 2 FRONT WHEEL SIMULATORS SEPARATE FROM THE WHEELS WHILE OPERATING SAID VEHICLE AT HIGHWAY SPEEDS. PRIOR TO EACH TRIP I PERSONALLY INSPECTED THE WHEEL SIMULATORS FOR PROPER ATTACHMENT AND SECURITY.  MY CONCERN IS THE HAZARD THESE FAILURES TO OTHER MOTORISTS ON THE HIGHWAY AS WELL AS THE EXPENSE OF REPLACEMENT.   DEALER SHIP PARTS CLERK STATES ( OFF THE RECORD) THAT THEY SELL APPROXIMATELY 50 OF THESE WHEEL SIMULATORS PER YEAR.",
        "vin": "WDAPF4CC4J9"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/03/2020",
        "dateOfIncident": "09/18/2020",
        "fire": true,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362526,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "DYNAMAX",
                "productModel": "ISATA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POSITIVE BATTERY CABLE FOR COACH BATTERIES FELL ON TO THE DRIVE LINE AND STARTED A FIRE WHICH MELTED THE ANTI-LOCK BRAKING SYSTEM AND CAUSED FURTHER DAMAGE UNDER THE COACH.  THE FIRE WAS PUT OUT VERY QUICKLY AT THE SHOP WHERE THEY WERE GOING TO HOOK UP A TOW BAR ON THIS NEW RV.  (THEY HAD FULLY PREPARED THE TOW VEHICLE AND THIS WAS TO BE THE FINAL STEP)   IT IS UNKNOWN WHEN THE INCIDENT BEGAN TO OCCUR BUT THE FIRE MOST LIKELY STARTED AS THE RV WAS BEING DRIVEN FROM OUR HOME IN MEADOW VISTA CA TO ONE STOP TRUCK SHOP IN SACRAMENTO CA.  THE FIRE STARTED A FEW MINUTES AFTER THE RV WAS PARKED IN THE PARKING LOT AND MY SON HAD LEFT THE SCENE. A POTENTIALLY DEADLY PROPANE AND DIESEL FUEL EXPLOSION WAS AVOIDED BY THE QUICK AND DECISIVE ACTIONS OF THE OWNERS OF ONE STOP TRUCK SHOP.  THE FOLKS WHO SOLD US THE RV MENTIONED WE'D PROBABLY LEFT THE PARKING BRAKE  ENGAGED WHILE DRIVING ... WHICH WAS UNTRUE AND COULD LEAD TO FURTHER DENIAL OF A MAJOR ISSUE THAT COULD HAVE BEEN DEADLY TO THE OCCUPANTS AND ANYONE WITHIN THE DISTANCE OF WHAT COULD HAVE BEEN A PROPANE AND DIESEL FUEL EXPLOSION.  TO THIS POINT, EVEN THOUGH CLEARLY A WARRANTY ISSUE, BOTH FOREST RIVER AND DIMARTINI RV THEY HAVE MADE NO ATTEMPT TO RESOLVE THE ISSUE EVEN THOUGH THEY HAD THE COACH AT THEIR SHOP FOR SEVERAL DAYS. THEY DEMANDED WE TURN OVER TO INSURANCE EVEN THOUGH THE COACH IS UNDER WARRANTY.   EVENTUALLY THE INSURANCE COMPANY TOWED THE COACH TO MERCEDES BENZ OF ROCKLIN CA WHERE THE TECHNICIAN CONFIRMED THE DANGEROUS AND POSSIBLY DEADLY ISSUE.",
        "vin": "WDAPF4CC9H9"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/03/2020",
        "dateOfIncident": "08/03/2020",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342994,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "DYNAMAX",
                "productModel": "ISATA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "NHTSA RECALL: 19V902  DYNAMAX - FOREST RIVER AND DEALER NETWORK ARE UNABLE OR UNWILLING TO SCHEDULE A TIMELY APPOINTMENT TO ADDRESS THE ABOVE REFERENCED RECALL. DEALS DO NOT WANT TO SCHEDULE THE WORK PROMPTLY BECAUSE WE DID NOT PURCHASE THE UNIT FROM THEM. FOREST RIVER INDICATES THEY CAN NOT MODIFY A DEALERS SCHEDULE. NUMEROUS CALLS AND EMAILS TO  FOREST RIVER WARRANTY AND CORPORATE COMPLIANCE OFFICE TO RESOLVE. NO LUCK.",
        "vin": "WDAPF4CC8J9"
    }
]