[
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/24/2022",
        "dateOfIncident": "03/11/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458088,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The tracklight on my 2019 Dodge Durango is no longer working. The whole light on the liftgate of the vehicle which is a big part of the brake warning to other vehicles. Which can very likely cause an accident at anytime since the corners of the tail light arent as visible. The vehicle has been evaluated by an independent service center and I was quoted over $1,000 to fix something that is very critical in the safety of a vehicle in my opinion. No warning from the vehicle at all the only reason it was noticed was because another driver that was behind me stopped at a gas station where I stopped and let me know my brake light was out and I was in fear the rest of the ride home that I would get pulled over and cited for something that shouldnt be my problem or responsibility to fix when its clearly a design flaw. I hope Dodge does the right thing and makes a recall on this matter since I have seen this is a very common problem and through searching on the internet I come to find out its due to water entering the light fixture and causing a shortage in the light. If Dodge doesnt do something about this I can see a lot of lawsuits coming to them due to the reason that the neglect can cause someone to get into an accident being as not everyone can afford to pay over $1,000 for repairs.",
        "vin": "1C4SDJCT5KC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/04/2022",
        "dateOfIncident": "02/27/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455260,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Rear tailight assembly retaining internally after rain/washing, shorting out LED light system and not illuminating",
        "vin": "1C4SDJGJ8KC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/23/2022",
        "dateOfIncident": "02/11/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453570,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owned a 2019 Dodge Durango. The contact stated that while the driver was traveling at an undetermined speed a crash occurred. During the crash, the vehicle sustained severe front-end damage and was destroyed but the airbags did not deploy. No further information was available. A police report was taken at the scene and the vehicle was towed away. No injuries were reported. The local dealer was contacted regarding the failure. The manufacturer was not yet contacted. The failure mileage was 13,000.",
        "vin": "1C4RDJFG1KC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/14/2022",
        "dateOfIncident": "01/13/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447461,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Dodge Durango. The contact stated that while driving her vehicle, she was pulled over by a police officer who informed her that neither the rear taillights nor the license plate light was illuminating as needed. The contact stated there was no warning light illuminated. The contact stated that she then had an independent mechanic inspect her vehicle and was informed that the taillights had shorted out due to rain leaking through the seals of the taillight assemblies. The contact stated she then contacted the dealer and was informed that there was a manufacturer issue and that there was no recall for the failure. The contact stated that she was informed by the dealer that repairing the vehicle would be an out-of-pocket expense. The contact stated that she was referred by the dealer to call NHTSA. The approximate failure mileage was 40,000.",
        "vin": "1C4RDJAG4KC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/11/2022",
        "dateOfIncident": "01/11/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447102,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The rear spoiler is coming detached from the lift gate. It's a recall for 2021 durango but not for the 2019 but mine is loose and rattling horribly and I'm afraid it'll fly off and hit another vehicle",
        "vin": "1C4RDHDG2KC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/28/2021",
        "dateOfIncident": "11/22/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441860,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Water gets in the rear middle racetrack tailgate light and caused the partial burnout of the LED tailgate lights.  This is a 2019 Dodge Durango VIN [XXX] with only 17,000 miles. This is a safety issue and from what I read online it will lead to other lighting/electrical issue in the future.  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "1C4RDJDG0KC"
    },
    {
        "components": "POWER TRAIN,ENGINE,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "10/29/2021",
        "dateOfIncident": "10/26/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438596,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 Didge Durango. Purchased used with c.22k miles on the clock. Have driven c2.5k miles and the following has happened 3 times. When accelerating the car seems to lose power momentarily and then gets stuck in third gear. Cannot shift up or down. After parking and restarting the engine the issue is resolved but the check engine light comes on. Goes off sometimes after a few hours, sometimes after 1 or 2 days",
        "vin": "1C4SDJCT5KC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/31/2021",
        "dateOfIncident": "08/25/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431240,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "On a recent 9hr drive to home the headlights got so dim that I needed to turn on the fog lights to be able to cautiously continue the drive to home. The low voltage and low headlight output makes driving at night a very dangerous situation and can come on quickly. The voltage on the cars digital display varied between 12.2 and 12.3 volts. The halogen headlights are designed for 13.8 volts. The vehicle has been checked by two Dodge dealer and they both have stated it is within the specifications of the Dodge Star Online Publication # S2008000031 REV. A which is attached. There were no warning lights or codes displayed.  Dealer # 1 said they have solved this complaint before with changing the headlight assemblies to LED headlights at a cost of $1,700 to $2,000.   This was reported to Chrysler under case number 80419497 and I was told I Will Not hear back from Chrysler.",
        "vin": "1C4RDJDG1KC"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "08/26/2021",
        "dateOfIncident": "08/24/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11430676,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Dodge Durango. The contact stated while driving at 55 MPH, the headrest air bag inadvertently deployed and hit her on the back of the head. There were no warning lights illuminated. The contact stated she continued to drive the vehicle and made a stop when she exited the highway. The contact sustained whiplash but did not seek medical assistance. The vehicle was not diagnosed nor repaired by an independent mechanic or dealer. The dealer and the manufacturer were not notified of the failure. The approximate failure mileage was 60,000.",
        "vin": "1C4SDHCT9KC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/23/2021",
        "dateOfIncident": "08/23/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11430151,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Tail lights have a pointy edge that has cause injuries twice, when walking-by to close to the vehicle, I have severely injury my arm and back (see attached pictures).  This happens when truck door is opened only.  Pics 1 & 2 are showing the pointy edge of the tail light, Pic 3 is the most recent injury and Pic 4 is a scar from the previous injury.",
        "vin": "1C4RDJDG8KC"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/06/2021",
        "dateOfIncident": "08/05/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427974,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The start/stop warning light came on for the second time on my 2019 Durango. I had both batteries replaced the first time and now, at 18,500 miles it came on again even though I drive it daily on both highway and local roads. This time, the warning only came on once but the start/stop feature was affecting the performance of the truck. There would be a lag when I would start to drive again, which was dangerous because if you’re making a quick turn or merge, that little delay was significant in safely timing the turn. Also, it would jerk the wheel abruptly upon restarting.  And then the truck died completely. Leaving my husband and daughter stranded. Thank god my infant and I were home because this would’ve been even worse with a baby in tow and or if I was on my way to pick up my older daughter somewhere. He said all the lights and alarms on the dash went bezerk and then the truck wouldn’t start at all.  The battery strain from the start/stop must have drained the main battery enough to make the computer system go crazy and completely shut down. The tow truck driver couldn’t get any power to truck and now we were left having to get towed to the dealership right after service closed, with the truck being completely unlocked and dead and the driver side window open.",
        "vin": "1C4RDJDGXKC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/13/2021",
        "dateOfIncident": "06/12/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420727,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Every 2000 miles, vehicle won’t and keeps asking me for an anti-theft code. I have had it serviced at least 7 times and I have not had the vehicle a year. Every time I take it in they just replaced the battery and the battery cell and it works fine for about a month then it shuts down again",
        "vin": "1C4RDJDG2KC"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/23/2021",
        "dateOfIncident": "09/30/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418211,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "On May 7, 2021, I was informed by Champion Dodge in Indianapolis, Indiana that a water intrusion point was discovered on my new Dodge Durango.  The service department determined that the antenna had a faulty antenna gasket causing water to get into the vehicle through the antenna since I purchased it in September 2019.  To date, my vehicle has been in the shop for about 70 days, always returned to me as \"unable to duplicate\" after the vehicle accelerating by itself, the LED panel malfunctioning repeatedly, the highlights coming on by themselves, and the instrument panel going out multiple times and the backup camera not engaging just to name a few problems I've had.  All this Dodge dealer did with this major discovery was to replace the antenna and return the vehicle to me as safe.  I feel this situation is not safe as water has been getting into the electrical car components of my vehicle since 2019, and this cannot be a safe situation but Doge refuses to buy back this vehicle as a Lemon or even with this new information they still refuse. My Dodge has experienced electrical problems from day one of my purchase of this vehicle. I have had ongoing safety issues with this vehicle all to do with electrical problems. I think this is a very unsafe situation for this vehicle to be on the road.",
        "vin": "1C4RDJAG3KC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/21/2021",
        "dateOfIncident": "01/04/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413259,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MY WAY TO LABOR & DELIVERY, MY STEERING WHEEL LOCKED UP, A LIGHT AND MESSAGE CAME ON THAT SAID, \"POWER STEERING UNAVAILABLE\". I COULD NOT TURN LEFT OR RIGHT AND SINCE I WAS ALREADY TURNING LEFT WHEN IT LOCKED UP AND WENT STRAIGHT, I NEARLY HIT ALL THE CARS PARKED ON THE SIDE OF THE STREET. WHEN I LEFT THE HOSPITAL, THE LIGHT WAS OFF. A WEEK LATER, THE LIGHT CAME BACK ON AND STAYED ON. THE STEERING WHEEL LOCKED AGAIN AS WE WERE DRIVING DOWN A MAIN ROAD AND WE ALMOST HIT THE CAR IN THE LANE NEXT TO US BECAUSE WHEN IT LOCKED UP, IT SNATCHES THE WHEEL FROM WHEREVER WE HAVE IT TO A LOCKED STRAIGHT POSITION. THIS IS UNACCEPTABLE WHEN YOU ARE PREGNANT WITH 3 CHILDREN IN THE BACK. I SHOULD NOT HAVE TO WORRY ABOUT CRASHING INTO PEOPLE WITHOUT NOTICE. WE GOT IT CHECKED OUT AND THEY SAID THE ELECTRIC STEERING RACK NEEDED TO BE REPLACED FOR A WHOPPING $4500. ON A 2019 VEHICLE, THAT IS UNACCEPTABLE. IT IS NOT SAFE TO DRIVE AND NOW I HAVE BEEN WITHOUT A VEHICLE FOR 3 MONTHS NOW BECAUSE EVERYONE KEEPS TELLING US THAT THE PART IS ON BACK ORDER.",
        "vin": "1C4SDJCT7KC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/09/2021",
        "dateOfIncident": "04/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407177,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER IS ENTERING THE REAR 'RACE TRACK' TAIL LIGHT / BRAKE LIGHT OF 2019 DODGE DURANGO WHICH IS CAUSING THE LED LIGHTS WITHIN TO BURN AND/OR SHORT OUT. THE LIGHT IS NOT CRACKED AND WAS NEVER DAMAGED TO CAUSE THIS ISSUE.     DODGE IS ADVISING THIS IS NOT A RECALL ISSUE AND COST WOULD BE APPROXIMATELY $1200-$1500 TO REPLACE.",
        "vin": "1C4RDJAG2KC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/19/2021",
        "dateOfIncident": "03/14/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403914,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE CHANGING BOTH OF THE FRONT TURN SIGNAL BULBS FOR THE 2ND TIME, IN LESS THAN A YEAR OF OWNERSHIP, I DECIDED TO CHECK FOR BURNT / BROKEN FILAMENTS. THE RIGHT SIDE BULB FILAMENT WAS BROKEN. THEN I NOTICED THAT BOTH BULBS HAD BURNED CONNECTOR PRONGS AT THE BASE OF THE BULB (SEE PHOTOS), WHERE THEY PLUG INTO THE SOCKET. I COULD NOT SEE IF THERE WAS ANY OF THE SAME DAMAGE TO THE SOCKETS. BOTH REPLACEMENT BULBS ARE WORKING PROPERLY AT THIS TIME.",
        "vin": "1C4RDJDG5KC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/15/2021",
        "dateOfIncident": "03/15/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403105,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION SOUNDS AND FEELS LIKE IT IS WINDING UP AND THEN SHIFTS HARD. THIS GENRALLY HAPPENS RIGHT AFTER I TAKE OFF. IT ALSO SOUNDS LIKE IT WINDS UP AT SPEED AND THEN DOESN'T SHIFT INTO OVERDRIVE, EVEN THOUGHT IT SHOWS THAT IT IS IS GEAR 8. THIS IS NOT A ONE TIME OCCURRENCE, IT HAPPENS EVERYDAY. THIS POSES A SAFETY ISSUE S THIS IS A POLICE PATROL VEHICLE AND HAS TO RUN AT HIGH RATES OF SPEED FROM TIME TO TIME. IF THE TRANSMISSION LOCKS UP AT A HIGH RATE OF SPEED THIS COULD BE VERY CATASTROPHIC.",
        "vin": "1C4SDJFT0KC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/12/2020",
        "dateOfIncident": "08/12/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348939,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE VISITING MISSISSIPPI FROM INDIANA, IN JULY, I KEPT GETTING A \"POWER STEERING UNAVAILABLE\" \"NEED SERVICE\". I CALLED AND WAS GOING TO TAKE IT TO A SHOP THERE BUT THE MESSAGE WENT AWAY THE NEXT DAY. WE MADE IT BACK HOME TO INDIANA AND I IMMEDIATELY MADE AN APPOINTMENT AND DROPPED MY VEHICLE OFF. THEY CALLED THE NEXT DAY AND SAID THE MESSAGE NEVER CAME UP FOR THEM, SO THEY RESET THE SYSTEM TO PREVENT IT FROM HAPPENING. THEY SAID THE PART IS VERY EXPENSIVE SO IF THE ISSUE ISN'T GOING ON WHILE THEY HAVE THE VEHICLE THEN THEY CAN'T JUST REPLACE IT. FAST FORWARD TO TODAY. WHILE DRIVING ON THE HWY WITH 2 OF MY CHILDREN THE MESSAGE POPS UP AGAIN AND POWER STEERING WENT OUT. VERY SCARY. THANKFULLY I WAS ABLE TO GET US HOME SAFE BUT YURNING THE WHEEL WAS ALMOST IMPOSSIBLE. I PLAN TO CALL THE DEALERSHIP IN THE MORNING, BUT THIS IS RIDICULOUS AND VERY DANGEROUS.",
        "vin": "1C4RDJAG4KC"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/01/2020",
        "dateOfIncident": "05/23/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342697,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I WAS DRIVING THE FRONT PARK SENSOR LIGHT CAME ON IT ALSO SAY I NEED SERVICE DONE TO FIT THE PROBLEM.",
        "vin": "1C4SDJCT1KC"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/08/2020",
        "dateOfIncident": "07/02/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338167,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JULY 2, 2020, I WAS DRIVING MY DODGE DURANGO UP AN ISOLATED STEEP MOUNTAIN ROAD IN THE SIERRA NEVADA AT ABOUT 20 MPH WHEN IT SUDDENLY STALLED ON A STEEP GRADE IN THE ROAD. I WAS ABLE TO APPLY THE EMERGENCY BRAKES TO PREVENT THE CAR FROM ROLLING BACKWARDS. THERE WERE NO ENGINE WARNING LIGHTS ILLUMINATED ON THE INSTRUMENT PANEL AND THE CAR HAD BEEN OPERATING AT NORMAL TEMPERATURE.  AFTER TRYING TO THE RESTART THE CAR, THE ENGINE AT FIRST BEGAN TO OPERATE, THEN ALMOST IMMEDIATELY HESITATED AND DIED. I TRIED AGAIN WITH THE SAME RESULTS, AND EVEN ATTEMPTED TO APPLY THE GAS PEDAL TO NO AVAIL. AS SOMEONE WITH SOME PREVIOUS MECHANICAL EXPERIENCE, IT SEEMED TO ME THAT IT WAS A FUEL DELIVERY PROBLEM. THE CAR HAD NEARLY HALF A TANK OF GAS HOWEVER.  I POPPED THE HOOD AND OBSERVED NOTHING OUT OF THE ORDINARY THAT WOULD INDICATE ANY PROBLEMS. THERE WAS OIL IN THE CRANKCASE AND AMPLE COOLANT. MY WIFE AND I DECIDED TO WAIT AND LET THE ENGINE AND VEHICLE COOL DOWN SINCE IT WAS OVER 90 DEGREES OUTSIDE AIR TEMPERATURE.   AFTER ABOUT 20 MINUTES, I RESTARTED THE CAR WITHOUT PROBLEM AND CONTINUED ON MY WAY. THE CAR HAD PREVIOUSLY BEEN IN AUTOMATIC MODE BUT HAD SHIFTED TO THE LOWER GEARS. I DECIDED TO PUT THE TRANSMISSION IN MANUAL MODE AND KEEP THE CAR IN 1ST AND 2ND GEAR  DUE TO THE STEEP TERRAIN. WE HAD NO PROBLEMS THE REST OF THE WAY.   WE WERE BEYOND CELL PHONE RANGE ON A VERY ISOLATED ROAD AND IT WOULD HAVE BEEN VERY DIFFICULT TO OBTAIN A TOW, SO I AM VERY GRATEFUL THE CAR CONTINUED TO OPERATE AFTER OUR INITIAL PROBLEM. HOWEVER, WE WOULD LIKE TO KNOW IF THIS PROBLEM WILL OCCUR AGAIN OR WHETHER HAVING THE TRANSMISSION IN AUTOMATIVE MODE ON A STEEP GRADE PLAYED ANY ROLE.",
        "vin": "1C4RDHAG4KC"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/17/2020",
        "dateOfIncident": "06/17/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329447,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR COMPLETELY SHUT OFF ON ME WHILE TAKING A RIGHT TURN INTO MY DRIVEWAY. IT DIED AT THE END OF MY DRIVEWAY. IT TURNED BACK ON AFTER I PUT IT IN PARK AND RESTARTED THE ENGINE. THANKFULLY THIS DID NOT HAPPEN ON A BUSY ROAD IN TOWN OR ON A HIGHWAY. WHEN I ALSO TURN MY CAR ON, MY STEREO SOMETIMES WORK AND SOMETIMES DOESN'T . IT DOES THIS A LOT. IS ANY ONE HAVING THE SAME ISSUES? MY CAR HAS JUST A LITTLE OVER 11K MILES AND SHOULDN'T BE HAVING THIS ISSUE.  *TR",
        "vin": "1C4RDJAG7KC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "02/11/2020",
        "dateOfIncident": "12/02/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11308582,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS HIT BROADSIDE IN THE LEFT FRONT WHEEL AREA, DRIVING AT APPROXIMATELY 30 MPH, THE OTHER VEHICLE WAS TURNING LEFT ACROSS TWO LANES.  THE AIRBAGS DID NOT DEPLOY RESULTING IN NECK AND SHOULDER INJURIES.  THE SUSPENSION WAS SEVERLY DAMAGED ALONG WITH SIGNIFICANT BODY DAMAGE",
        "vin": "1C4SDJCT7KC"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/03/2020",
        "dateOfIncident": "01/03/2020",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306810,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I ARRIVED HOME AND PARKED MY CAR UNDER MY CARPORT AT 8:30 P.M.  AT 12:20 A.M.  I HEARD LOUD POPPING NOISES AND SMELLED SMOKE.  I WENT OUTSIDE TO SEE MY 2019 DODGE DURANGO WITH 9,012 MILES ON FIRE.  THE HOOD OF THE TRUCK WAS FULLY ENGULFED WITH FIRE.  THIS FIRE CAUGHT ONTO THE HOUSE AND MY NEIGHBOR'S HOME.",
        "vin": "1C4RDHAGXKC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/01/2019",
        "dateOfIncident": "06/16/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11283196,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS WOULD COME ON WHEN THE HEADLIGHT SWITCH IS IN THE OFF POSITION WHILE IN PARK AND WHILE IN MOTION, AND STAY ON; DURING NIGHT TIME DRIVING HEADLIGHTS WOULD INTERMITTENTLY GO OFF IN THE ON POSITION WHILE IN MOTION. SEVERAL ATTEMPTS BY DEALER REPAIR PERSONNEL TO FIND A REMEDY WERE UNSUCCESSFUL.   IT WAS LATER DISCOVERED THAT THE AFTERMARKET REMOTE START INSTALLED BY A THIRD PARTY WAS WIRED INCORRECTLY. THE DEALER INSTALLED A FACTORY REMOTE START AND THE ISSUE APPEARS TO BE RESOLVED.",
        "vin": "1C4RDJDG1KC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/25/2019",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11282340,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED THE CAR BRAND NEW HAD 500 MILES ON WHEN IT WAS INVOLVED IN PASSENGER FRONT COLLISION AND THE AIRBAGS NEVER DEPLOYED.HE CAR WAS TRAVELING AROUND 40 MPH WHEN A VEHICLE PULLED OUT IN FRONT OF IT CAUSING A TOTAL LOSS . WE CONTACTED DODGE AND THEY SENT A INSPECTOR OUT TO RECOVER THE 'BLACK BOX' WE WERE NEVER CONTACTED WITH WHAT THE FINDINGS WERE OR THE REASON THE AIR BAGS NEVER DEPLOYED.",
        "vin": "1C4RDJAG1KC"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/19/2019",
        "dateOfIncident": "10/15/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280975,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES DO NOT FEEL ADEQUATE WHEN TOWING A TRAILER.    THE REAR OF THE VEHICLE DROPS DRAMATICALLY WHEN A COMBINED 6000LB BOAT AND TRAILER WHEN HITCHED TO THE FACTORY EQUIPPED TOWING PACKAGE.  I WOULD NOT DRIVE THE VEHICLE WITH THIS CONDITION",
        "vin": "1C4RDJAG3KC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/19/2019",
        "dateOfIncident": "10/31/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281110,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER DROPPING OFF MY OLDEST DAUGHTER AT PRESCHOOL, I DROVE FOR ROUGHLY 2.5 MILES AND PARKED THE CAR, I SUFFERED A TOTAL LOSS OF POWER STEERING. THE TRUCK HAS A COMPLETELY ELECTRIC STEERING SYSTEM. THIS OCCURRED 10/31/2019. ON THIS DATE I TOOK THE VEHICLE TO THE LOCAL DEALERSHIP FOR DIAG. THEY CALLED 11/1/2019 AND STATED THAT IT NEEDED A NEW STEERING RACK. IT IS NOW 11/19/2019 AND THE PART IS STILL ON BACK ORDER. CHRYSLER KEEPS PUSHING THE DATE BACK. I STILL DO NOT HAVE THE VEHICLE BACK AND NOT DEFINITIVE DATE OF RETURN. IF THIS WOULD'VE HAPPENED WITH MY DAUGHTERS IN THE CAR WHILE DRIVING DOWN THE ROAD IT WOULD'VE CAUSED A SERIOUS CRASH.",
        "vin": "1C4RDJDG5KC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/04/2019",
        "dateOfIncident": "10/29/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278085,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO/GPS SCREEN CONSTANTLY POPS-UP WEATHER ALERTS WHILE DRIVING FOR LOCATIONS 100'S OF MILES AWAY AND IRRELEVANT TO THE DRIVER. ALERT COMPLETELY OBSTRUCTS THE SCREEN REQUIRING HUMAN INTERVENTION AND DISTRACTION TO CLEAR THE ALERT. ALERTS CANNOT BE DISABLED AND HAPPEN SO OFTEN THAT THE NUISANCE IS A DISTRACTION TO DRIVING AND OPERATING THE VEHICLE.",
        "vin": "1C4SDJCT8KC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/26/2019",
        "dateOfIncident": "10/15/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271269,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST SUBMITTED A COMPLAINT ABOUT THE DASHBOARD FLICKERING WHEN I HIT A BUMP ON I-95 AND THE VEHICLE ACCELERATING ON ITS OWN.  THE VEHICLE HEADLIGHTS ALSO WENT OUT DURING THIS SAME INCIDENT ON THIS DAY.",
        "vin": "1C4RDJAG3KC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/26/2019",
        "dateOfIncident": "10/15/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271268,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY NEW DURANGO ON I-95 NORTH FROM FREDERICKSBURG, VA TO WOODBRIDGE, VA, WHEN I HIT A BUMP ON THE HIGHWAY AND THE ENTIRE DASHBOARD FLICKERED VERY FAST ABOUT 15 TO 20 TIMES, THEN THE CAR ACCELERATED ON ITS OWN AND THEN QUICK ACCELERATING ON IT'S OWN.",
        "vin": "1C4RDJAG3KC"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/16/2019",
        "dateOfIncident": "10/15/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268880,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 10/15/19 I WAS RETURNING MY VEHICLE TO LUSTINE CHRYSLER JEEP DODGE IN WOODBRIDGE, VA FOR ENGINE KNOCKING AND TRANSMISSION THUMPING WHEN (I'M PRETTY SURE I HIT A BUMP ON THE HIGHWAY) AND THE WHOLE ELECTRONIC DASHBOARD FLICKER VERY FAST AND THE VEHICLE ACCELERATED ON ITS OWN.  I ARRIVED AT THE DEALERSHIP, THEY VERIFIED A MALFUNCTION CODE AND SENT ME HOME TO RETURN ANOTHER DAY BECAUSE THEY DIDN'T HAVE ANY LOANER VEHICLE TO GIVE ME.  I HAVE LOUD ENGINE KNOCKING, THUMPING TRANSMISSION AND THE AC BLOWER DIDN'T WORK OCTOBER 1, 2019.",
        "vin": "1C4RDJAG3KC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/14/2019",
        "dateOfIncident": "09/30/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268236,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEPTEMBER 30, 2019, I PURCHASED A NEW THE NEW 2019 DODGE DURANGO VIN I SUBMITTED.  DRIVING OFF THE LOT, I HIT A BUMP IN THE ROAD AND THE DASHBOARD AND HEADLIGHTS WENT OUT.  THE HEADLIGHTS WERE ON \"AUTO.\"  IT WAS DARK.  I HAD TO MANUALLY SWITCH THE SELECTOR SWITCH TO THE \"ON\" POSITION AND THE HEADLIGHTS DID COME ON.  ACCORDING TO THE DEALER, THE VEHICLE INDICATED ONE BAG TRIP.  I JUST PICKED THE VEHICLE UP ON SATURDAY, OCTOBER 12, 2019.  I ALSO HAVE ENGINE KNOCK.",
        "vin": "1C4RDJAG3KC"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/21/2019",
        "dateOfIncident": "09/09/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257074,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "GLASS SUNROOF EXPLODED WITHOUT ANYTHING HITTING IT.",
        "vin": "1C4SDJCT6KC"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/20/2019",
        "dateOfIncident": "08/20/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245262,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE IS A 2019 DODGE DURANGO THAT THE ENGINE LIGHT CAME ON. I TOOK IT TO THE DEALERSHIP AND THEY SAY THAT THERE IS A VACUUM LEAK AT THE ENGINE DEFINED BY THE EVAP (EVAPORATIVE EMISSION SYSTEM).",
        "vin": "1C4RDHDG1KC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/07/2019",
        "dateOfIncident": "07/06/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229966,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RADIO VOLUME RANDOMLY DOES NOT WORK. ON START UP IT WILL SOMETIMES BE VERY QUIET AND THE SEACH/SCAN BUTTON WILL ONLY SCAN BACK AROUND TO THE STATION IT WAS ON AND MANUALLY ENTERING A RADIO STATION WILL BRING IT UP BUT THE RECEPTION IS HORRIBLE AND NO VOLUME. SOMETIMES IF YOU SWITCH BETWEEN AM FM IT WILL FIX ITSELF BUT NOT ALWAYS.",
        "vin": "1C4RDJDG0KC"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/17/2019",
        "dateOfIncident": "04/17/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11197060,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 4.17.19 WHILE I AM DRIVING THE CAR WITH MY FAMILY ( 3 PEOPLE ) FROM LIMA LINDA  TO RANCHO CUCAMONGA , WE HAD TOTAL 3 X EPISODES OF  THE ENGINE OFF SUDDENLY WITHOUT GIVING WARNING AT ALL. WHAT REALLY SCARE US THE CAR STOP AT ALL SUDDEN DUE TO ENGINE OFF WHEN WE ARE DRIVING ON FREEWAY 10.",
        "vin": "1C4RDHAG0KC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/03/2019",
        "dateOfIncident": "02/12/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193531,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "RE: UCONNECT SCREEN. CONSTANT WEATHER ALERT POP-UPS WHILE DRIVING, REQUIRING DRIVER TO TOUCH SCREEN TO DELETE. AS MANY AS 3 PER 5 MIN PERIOD. DISTRACTED DRIVING DANGER. THIS FEATURE CAN NOT BE DISABLED BY OWNER. CHRYSLER DODGE DEALER, UCONNECT COMPANY UNWILLING TO CORRECT. THESE WEATHER ALERTS ARE NOT EVEN FOR MY COUNTY. THE POP-UPS COVER THE SCREEN AND RENDER THE SCREEN USELESS.",
        "vin": "1C4SDHCT1KC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/17/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180645,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPLAINT INVOLVING CHECK ENGINE LIGHT ON I PURCHASED A CAR JANUARY 19, 2019 13 DAYS LATER MY CHECK ENGINE SIGN CAME ON I CALLED EASTCHESTER CHRYSLER JEEP DODGE 4007 BOSTON RD BRONX NY 10466 AND THEY HAD ME DROP OFF THE CAR FEB.1,2019 AND I GOT THE CAR BACK FEBRUARY .4,2019 THEY TOLD ME THEY DTC PO452 AND MUST REPLACE ESIM AND REASSEMBLED. 10 DAYS LATER FEB.13 THE CHECK ENGINE LIGHT COMES ON AGAIN I TAKE THE CAR BACK FEB15,2019 AND THEY TELLING ME THEY FIND NOTHING WRONG WITH THE CAR AND I ASK IF THE ENGINE LIGHT IS ON AND THE TOLD ME KNOW THEY TURNED IT OFF THEY STILL HAVE MY CAR AND TOLD ME MONDAY FEB.18,2019 THEY WILL HAVE SOME ONE TO LOOK MORE INTO IT I TOLD THEM TO PLEASE MAKE SURE THAT THE LIGHT DOESN'T COME BACK ON I JUST GOT THE CAR AND ALREADY HAVING PROBLEMS WITH IT AND IT IS A BRAND NEW CAR. IS THERE ANYWAY I CAN GET A NEW ONE?",
        "vin": "1C4SDJCT6KC"
    }
]