[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/14/2021",
        "dateOfIncident": "09/05/2021",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432969,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "DUTCHMEN",
                "productModel": "COLEMAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Keystone Coleman Travel trailer. The contact stated while driving 55 MPH, the passenger’s side rear tire assembly and axle detached from the trailer. The contact pulled over to the side of the roadway and had the vehicle towed to a local dealer to be diagnosed. The contact was informed that the axle bearing needed to be replaced. The vehicle was not repaired. The manufacturer was made aware of the failure. The failure mileage was approximately 1,000.  A “voluntary” recall was done by Dutchmen for other models of campers similar to this one, but not including this one, where they were being shipped out of the factory with inadequate lube in the wheel bearings causing failure.. See link below for info on NHSTA campaign number 18V843. https://oemdtc.com/1793/18-340-insufficient-grease-on-bearings-may-cause-failure-2019-keystone-cougar-outback-passport-springdale-bullet-hideout-2019- dutchmen-aerolite-atlas-recreational-trailers",
        "vin": "4YDT17F13KH"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/15/2020",
        "dateOfIncident": "06/11/2019",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349557,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "DUTCHMEN",
                "productModel": "COLEMAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE DIFFICULTY STOPPING MY NEW TRAVEL TRAILER, I HAVE LEARNED DUE TO THIS SUBSTANDARD BRAKING ACTION, THAT THESE UNITS AXLES ARE UNDERSIZED FOR THE 10,000# GVW.  IT HAS TWO 4400# AXLES EQUIPPED WITH 3500# BRAKES ON EACH. I HAVE TO SET THE BRAKE CONTROLLER AT MAXIMUM TO FEEL ANY EFFECT FROM THE TRAILER BRAKES.  WHEN MANUALLY ACTIVATING THE BREAKAWAY DEVICE THE TRAILER DOES NOT STOP.  I COMPLAINED TO THE DEALER SINCE IT WAS NEW A YEAR AGO BUT DESPITE NUMEROUS ATTEMPTS, THEY FAILED TO CORRECT IT ULTIMATELY STATING WE'VE DONE ALL WE CAN DO. COME TAKE IT HOME. I FEEL THAT IT IS UNSAFE TO TOW THIS VEHICLE, ESPECIALLY IN A PANIC STOP OR A BREAKAWAY SITUATION.  IT IS MY OPINION, (REINFORCED BY 2 PEER REVIEWS AND COMPARISONS TO COMPARABLE SIZED TRAILERS) THAT THE TRAILER (NOT JUST MINE, BUT ALL COLEMANS OF THIS SIZE CLASS) ARE NOT SAFE TO TOW ON THE ROADS.  I REALIZE IT IS MY FIGHT BUT I AM LOOKING FOR DOT STANDARDS THAT ADDRESS THE MINIMUM RATING OF THE AXLES AND BRAKING SYSTEMS ON TRAVEL TRAILERS.  THESE TRAILERS ARE ALSO A DANGER TO INNOCENT TRAVELERS SHOULD AN EXTREME EVENT OCCUR!! ONE CAN IMAGINE THE RESULTS OF THE LOSS OF CONTROL OF THESE QUITE LARGE IN SUMMER TRAFFIC.*DT*JB*DT*JB",
        "vin": "4YDT31425KH"
    }
]