[
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "12/02/2019",
        "dateOfIncident": "12/02/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11286237,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 DODGE CARAVAN. CONSUMER WRITES IN REGARDS TO HEAD REST FLIPPING DOWN STRIKING WIFE IN HEAD LEAVING A SMALL HEMATOMA. *LD    THE CONSUMER STATED THE STOW N GO SEATS WERE INSTALLED IN THE SECOND ROW.THE CONSUMER'S WIFE SAT IN THE SECOND ROW PASSENGER SIDE. SHE PULLED A LEVER ATTEMPTING TO ADJUST THE SEAT AND THE ENTIRE SEAT JERKED FORWARD WITH A HEAVY IMPACT. *JS",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/12/2019",
        "dateOfIncident": "06/12/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219567,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL HAS A SUPPORT BRACKET AT THE BOTTOM WHERE IS YOU ARE NOT CAREFUL YOU CAN GET YOUR FINGER STUCK IN THE WHEEL AND YOU ARE NOT GOING TO GET IT OUT EASILY.  I DID THIS BY ACCIDENT AND HAD A DIFFICULT TIME GETTING MY FINGER FREE WHILE TRYING TO STEER THE VAN.  ALSO THE SPACE AROUND THE HORN BUTTON IS SUCH IF YOU HAVE BUTTONS ON A SPORT'S JACKET THOSE BUTTONS CAN GET CAUGHT UNDER THE HORN BUTTON AND MAKES CONTROLLING THE STEERING WHEEL ALMOST IMPOSSIBLE.  SO WHEN TURNING THE WHEEL IF ANY OF THESE CONDITIONS HAPPEN YOU MIGHT NOT HAVE THE CONTROL OF THE STEERING THAT ONE WOULD NEED.  I JUST LOOKED AT THE DODGE SITE AND THEY STILL ARE USING THE SAME DESIGN ON THE STEERING WHEEL.   IT HAS HAPPENED TO BE VERY MUCH BUT WHEN I AM MORE AWARE OF THIS AND I DO NOT WEAR THAT JACKET WHILE DRIVING THIS VAN.",
        "vin": "2C4RDGBG3KR"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "05/15/2019",
        "dateOfIncident": "04/17/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11207646,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ABOVE VEHICLE WAS A RENTAL VEHICLE BEING DEMONSTRATED TO ME TO SHOW THE AMOUNT OF REAR LUGGAGE SPACE AVAILABLE.  WHEN THE RENTAL REPRESENTATIVE WAS  DEMONSTRATING THE REAR SEAT STOWAGE SYSTEM HE INADVERTENTLY RELEASED WHAT APPEARED TO BE AN UNNECESSARILY STRONG REAR ROW SEAT BACK RELEASE SPRING WHICH KICKED THE SEAT BACK DOWN HARD AND FAST  ENOUGH TO HIT ME IN THE HEAD, SCRAPE AND BRUISE MY FACE AND HEAD, DAMAGE MY GLASSES, KNOCK ME TO THE FLOOR OF THE VAN AND AND CAUSE A CONCUSSION, WHICH I WAS TREATED FOR IN THE HOSPITAL EMERGENCY ROOM. A SIGNIFICANT CONCERN OF MINE IS THAT THE DOCTOR AND A NURSE IN THE HOSPITAL SAID THAT THE APPARENT FORCE WITH WHICH THE SEAT HIT MY HEAD WOULD HAVE SERIOUSLY INJURED A POSSIBLY KILLED A SMALL CHILD. FROM MY VANTAGE POINT AS A RETIRED ENGINEER WITH 40+ YEARS OF EXPERIENCE, THERE IS NO REASON TO DESIGN A SEAT BACK THAT WILL CLOSE WITH THAT LEVEL OF FORCE WITH NO ADDED IMPETUS. THIS APPEARS TO BE A SERIOUS DESIGN FLAW OF WHICH OWNERS AND THE MANUFACTURER SHOULD BE MADE SHOULD BE MADE AWARE. I DO HAVE MEDICAL RECORDS, PHOTOGRAPHS OF MY HEAD AND A NOTE FROM THE RENTAL COMPANY REPRESENTATIVE ADMITTING THAT I WAS INJURED. PHOTOGRAPHS OF MY HEAD AND MEDICAL RECORDS CAN BE SUPPLIED IF NEEDED, BUT ARE NOT PRESENTLY ON MY COMPUTER. *DT*JB",
        "vin": "2C4RDGEG3KR"
    }
]