[
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/07/2020",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297589,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250 SD",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 FORD F-250 SD. WHILE DRIVING APPROXIMATELY 50-70 MPH, ESPECIALLY OVER UNEVEN PAVEMENT, THE VEHICLE SHOOK VIOLENTLY. THE CONTACT STATED THAT THIS WAS ALSO KNOWN AS THE DEATH WOBBLE. THE CONTACT TOOK THE VEHICLE TO EARNHARDT FORD (LOCATED AT 7300 W. ORCHID LN, CHANDLER, AZ 85226, 833-735-9304) WHERE IT WAS DETERMINED THAT THE STEERING AND SHOCK RESISTANCE SYSTEM NEEDED TO BE REPAIRED. THE DEALER INFORMED THE CONTACT THAT A PART CALLED THE SHIMMY SHOCK  NEEDED TO BE REPLACED; HOWEVER, IT WOULD TAKE APPROXIMATELY 4-8 WEEKS BEFORE THEY COULD RETRIEVE THE PART. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 15,000. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/03/2020",
        "dateOfIncident": "01/02/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11296954,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250 SD",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 FORD F-250 SD. WHILE DRIVING APPROXIMATELY 70 MPH, THE VEHICLE SUDDENLY BEGAN TO SHAKE AND VIBRATE VIOLENTLY AFTER DRIVING OVER A BUMP IN THE ROAD. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. NORTH PARK LINCOLN (9207 SAN PEDRO AVE, SAN ANTONIO, TX) WAS NOTIFIED OF THE FAILURE. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 3,500.",
        "vin": "1FT7W2BT0KE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/11/2019",
        "dateOfIncident": "10/12/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231098,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250 SD",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT THIS TRUCK AT JOE COTTON FORD SET UP TO PULL A KEYSTONE HALF TON COUGAR 29RKS AND IT CAME WITH A STICKER FO PAYLOAD OF 2029 LB. TOOK IT TO CAT SCALE AND HAD MYSELF , 34 GAL DIESEL AND A BED COVER OF 125 LB IN IT . SCALE SAID IT WEIGH 8340 OR PAY LOAD OF 1760 LB NOT SAME AS TIRE STICKER STATED. WHICH IS RIGHT AS I WANT TO BE LEGAL TO CARRY THIS TRAILER. TOLD BY FORD DEALER IT CAN HAUL THIS TRAILER NO PROBLEM? WHY ARE THE WEIGHTS DIFFERENT AND ARE THEY SAFE TO USE THERE OR CAT SCALE S",
        "vin": "1FT7W2BT4KE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/15/2019",
        "dateOfIncident": "01/15/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170132,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250 SD",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER DOOR LATCH FREEZES.  HASN'T HAPPENED YET ON OTHER DOORS, BUT THEN THEY ARE NOT USED MUCH.  OCCURS DURING WET/COLD/BELOW FREEZING WEATHER.  TRUCK IS NEW, 3600 MILES. FIRST TIME DOOR OPENED BUT WOULD NOT LATCH CLOSED AGAIN.HARD CLOSURE OF DOOR AND MULTIPLE LOCK/UNLOCK ATTEMPTS FREED LATCH AND IT WORKED.  SECOND TIME, 48 HOURS AFTER FIRST.   REPEATED ABOVE PROCESS AND DOOR LATCHED.  THIRD TIME WAS THIS MORNING (1/15/19) .  SEVERAL INCHES OF SNOW AND TEMPERATURES WELL BELOW FREEZING.  FIRST ATTEMPT THIS MORNING, THE DOOR UNLOCKED AND THEN WOULD NOT CLOSE.  SPRAYED ALCOHOL INTO DOOR LATCH AND DOOR LATCHED CLOSED, AND THEN WOULD NOT REOPEN. USED MANUAL KEY TO FREE UP FROZEN LOCK MECHANISM.  THIS IS THE SAME PROBLEM THAT FORD ISSUED FSA 18N03 TO PREVIOUS YEAR F150 AND F250 TRUCKS TO FIX SAME ISSUE BUT THE FSA HAS NOT YET BEEN APPLIED TO 2019 MODEL YEARS, EVEN THOUGH IT APPEARS FORD DID NOT FIX THE ROOT CAUSE OF THE ISSUE FOR THE 2019 F250 MODELS. VEHICLE WAS STATIONARY.",
        "vin": "1FT7W2BT3KE"
    }
]