[
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/26/2022",
        "dateOfIncident": "03/25/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458437,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 Ford Escape SEL.  Left and right front headlamps simultaneously stopped working during nighttime driving.  Dangerous safety issue.  Dashboard headlamp green symbol continued to display headlamps were functioning properly.  There was no warning symbol.  Vehicle electrical issue was repaired at dealership at no charge.  I am aware of an identical problem occurring on a similar 2019 Ford Escape SEL.  My belief is the headlamp failure is not a random issue and is a serious safety defect that has not been addressed by Ford Motor Company.",
        "vin": "1FMCU9HD3KU"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/26/2022",
        "dateOfIncident": "03/21/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458438,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 Ford Escape SEL. Left and right front headlamps simultaneously stopped working during nighttime freeway driving. Dangerous safety issue. Dashboard headlamp green symbol continued to display headlamps were functioning properly. There was no warning symbol. Vehicle electrical issue was repaired at dealership at no charge. I am aware of an identical problem occurring on a similar 2019 Ford Escape SEL. My belief is the headlamp failure is not a random issue and is a serious safety defect that has not been addressed by Ford Motor Company.",
        "vin": "1FMCU9HD2KU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/14/2022",
        "dateOfIncident": "02/20/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456595,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Ford Escape. The contact stated while her husband was driving at an unknown speed, the check engine warning light illuminated. The contact took the vehicle to an independent mechanic, where it was diagnosed with needing the spark plugs and ignition coil to be replaced. The vehicle was not repaired. The contact took the vehicle to the local dealer, where it was diagnosed with needing the engine to be replaced. The vehicle was not repaired. The contact stated that the check engine warning light turned off but then illuminated again. The contact took the vehicle to another independent mechanic, where it was diagnosed with needing the spark plugs and ignition coil to be replaced. The vehicle was repaired. The contact took the vehicle to another local dealer; Garber Ford (3380 US-17, Green Cove Springs, FL 32043: (904) 264-2442) where it was diagnosed with needing the engine to be replaced. The vehicle was not repaired. Upon investigation, the contact associated the failure with Ford service bulletin # 21-2269, however the VIN was not included. The manufacturer had been informed of the failure. The failure mileage was approximately 83,000.",
        "vin": "1FMCU0GD3KU"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/04/2022",
        "dateOfIncident": "03/01/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455159,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTI PRO CONTACT",
                "productYear": "9999",
                "size": "235/45R19 95H",
                "type": "Tire"
            }
        ],
        "summary": "The contact owns a 2019 Ford Escape equipped with Continental Tires, Tire Line: Pro Contact, Tire Size: 235/45/19, DOT Number: 436E647LB3818. The contact stated that while driving at various speeds, the front-end of the vehicle would shake and vibrate. Upon inspection, it was discovered that the front driver’s and passenger’s side tires had experienced tread separation. The cause of the failure was not determined. The manufacturer and local dealer were notified of the failure but no assistance was offered. The failure mileage was 40,600.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/23/2022",
        "dateOfIncident": "02/13/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453678,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Ford Escape. The contact stated that while driving, the vehicle failed to accelerate over 60 MPH. The check engine warning light was illuminated. The vehicle was examined by an independent mechanic who replaced the spark plugs and indicated that coolant was present inside the combustion chamber of the engine. The vehicle was not repaired and continued to exhibit failure. The local dealer and manufacturer were notified of the failure. An appointment was scheduled to have the vehicle serviced by the dealer. The failure mileage was 75,000.",
        "vin": "1FMCU0GD0KU"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/11/2022",
        "dateOfIncident": "02/04/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451541,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "My vehicle is 2 yrs old and began having purge valve issues. Upon trying to fix the problem, I found that the part is on back order with no parts available anywhere in my region. Also while trying to locate the purge valve, part number: Gv6z9d289e, I found that several other people were also trying to locate the part indicating this is an issue in several vehicles.  The vehicle vapor locks upon fueling possibly resulting in future engine damage.",
        "vin": "1FMcu0gd8ku"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/05/2022",
        "dateOfIncident": "01/28/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450537,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTI PRO CONTACT",
                "productYear": "9999",
                "size": "235/45R19 95H",
                "type": "Tire"
            }
        ],
        "summary": "Continental ContiproContact 235/45R19 95H on 2019 Ford Escape Titanium. Tires were factory original with approximately 35,000 miles. Approximately 4/32” tread remaining.  DOT A3E6 47LB 0119  Was just turning onto the interstate on-ramp (from MD-543 SB onto I-95 NB) traveling about 15-20 mph and heard a large pop noise and the car begin to pull hard to the right. Pulled onto the shoulder. Upon checking, front passenger tire was completely flat. Replaced with spare and returned home.  Further inspection of the tire revealed a 2” rupture in the sidewall. Tire pressures had been checked and verified (tires at cold pressure) approximately three hours prior to event. No TPMS warnings prior to event. Outdoor temperatures were around 35°F. No indication of other abnormal wear or damage.",
        "vin": "1FMCU9J98KU"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/27/2022",
        "dateOfIncident": "01/24/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449136,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "https://static.nhtsa.gov/odi/tsbs/2019/MC-10169807-0001.pdf  My coolant is leaking into my cylinder.  Making my car misfire and have P0301 code. Cylinder and spark plugs have been replaced. But error is still coming and coolant get lower every day.  This needs to be recalled as many people are having this issue.  Its not our fault and shouldn't have to pay to replace the short block and engine for a car's manufacturing issues.  The car doesn't run right and its very pricey to fix.",
        "vin": "1FMCU9GD4KU"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/26/2022",
        "dateOfIncident": "11/30/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448975,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Ford Escape. The contact stated while driving at an undisclosed speed, the check engine warning light illuminated and remained illuminated. The contact drove to the gas station and while refueling, there was an abnormal fuel odor coming from the vehicle. After restarting and driving the vehicle back to the residence, the fuel odor inside the cabin of the vehicle was extremely strong, causing the contact to have a headache. The contact took the vehicle to a local dealer who inspected and diagnosed the failure as the emission evap valve was not properly separating the fuel inside the fuel tank. The vehicle was not repaired because the local dealer did not have the parts needed to perform the repair. The manufacturer was made aware of the failure. The failure mileage was approximately 46,000.",
        "vin": "1fmcu0j93ku"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/13/2022",
        "dateOfIncident": "01/07/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447328,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "It was  power steering failure while in operation. The vehicle has been inspected by a mechanic, who cleared the error code, but the problem persists. It is an internal failure in the power steering.  THE CONSUMER STATED THE POWER STEERING FAILED WHILE THE VEHICLE WAS EING DRIVEN.. THE MANUFACTURER WAS CONTACTED BUT, DID NOT OFFER ANY ASSISTANCE DUE TO THE VEHICLE BEING 5 DAYS OUT OF WARRANTY.",
        "vin": "1FMCU9GD8KU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/18/2021",
        "dateOfIncident": "05/15/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440977,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Bought new March 2019; May 2020, with 32,000 miles, had a coolant leak and had to replace engine; about 6 weeks later needed anew flywheel and about 2 months after that needed some of the oxygen sensors replaced.",
        "vin": "1FMCU0HD6KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/18/2021",
        "dateOfIncident": "11/16/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440978,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I was stopped and when I stepped on the gas pedal to make my turn my car's engine accelerated at full force, stepping on the brake It wouldn't stop the car. I put the car in neutral and was able to pull over break and put it in park. It was as if the car was possessed and took me for a wild ride. I called the dealership they checked it out no dash lights came on no nothing so they were unable to detect any problem. I had my car for almost 3 years I'm an experienced driver and nothing ever happened to me like this before. The dealership tried to tell me my mat must have been stuck under my gas pedal which I know is not true due to I look down at my gas pedal while trying to break and if it was stuck under my gas pedal like they're saying my car wouldn't accelerate I would have trouble pushing the gas and making it go so nothing makes sense.",
        "vin": "1FMCU9GD9KU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/19/2021",
        "dateOfIncident": "10/17/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437303,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Our check engine light came on in our 2019 Ford Escape, which has 80,000 miles. It overheated with no warning. We took it to the dealership who informed us the coolant leaked and caused a crack in the engine between the 2nd and 3rd cylinders and said the engine needs to be completely replaced.",
        "vin": "1FMCU9HD4KU"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "09/27/2021",
        "dateOfIncident": "09/27/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11434584,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Ford Escape. The contact stated that while attempting to remove a safety seat located on the rear driver's side seat, the contact pulled the lever to move the seat but the seat collapsed on the contact's hand. Medical attention was received for the contact's fractured wrist. The vehicle was not diagnosed nor repaired. The dealer and manufacturer were not made aware of the failure. The failure mileage was approximately 37,900",
        "vin": "1fmcu9hd5ku"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/15/2021",
        "dateOfIncident": "09/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433129,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "At 44,000 miles Engine began to idle badly on startup and misfire.  Engine light came on during drive home after work.  Stopped vehicle and had it towed to the nearest Ford Dealer.  Dealer Service Technician checked codes and reported P0304 cylinder 4 miss fire.  Dealer Technician replaced and replaced all four sparks plugs and used 446676 cleaner to clean throttle body, intake, fuel injectors and valve.  Few days later engine light returned, took vehicle back to Ford Dealer.  Ford Technician checked and road tested vehicle and stated 446676 cleaner may not have finished cleaning systems and that was the cause of the engine light.  A few days later engine began to idle badly on startup and misfire again.  Then saw white smoke came from the exhaust on startup.  Two weeks earlier just had vehicle service maintenance completed by the Ford Dealer.  Invoice #233228 and #782806.",
        "vin": "1FMCU0HD7KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/06/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431885,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Twice in a 90 day period, the plastic shielding plates on the underside of the car, skid plates, have come loose, and started dragging on the road.  I was able to do a temporary repair with duct tape and bungee cords until I could get to the local Ford dealer for repair.  The Ford dealer's Service Dept. stated the plastic pins that hold the plates become worn, and fail.  They said even in the oil changing process, they frequently have to replace the pins. This problem should be fairly easy to remedy by inserting metal female screw threaded receptacles into the areas the plastic pins fit into, and metal male threaded bolts to screw into them.",
        "vin": "1FMCU9J90KU"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "08/10/2021",
        "dateOfIncident": "08/07/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428498,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving along in a Eagle Grove. Iowa when my Escape's collision assist was shut off, then the traction control light started to come on and off. i tried to shut it off with a button but it wouldn't listen. Also my engine acted like it was dying I could only go about 5 miles per hour. I found a parking lot, pulled in and shut the car off hoping the computer would reset. I waited a bit, tried the Escape and everything was fine. I drove off. This Escape was in a car crash in Feb.2021 the brakes failed and my son was driving we hit another SUV. Now I wonder if someone shut off our brakes. I am scared now, I think someone is trying to harm me.",
        "vin": "1FMCU9HD7KU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/06/2021",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428003,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Ford Escape. The contact stated that in November of 2020 the engine was replaced under an unknown recall. The contact stated while driving at approximately 60 mph, the vehicle stalled without warning. The contact stated that after attempting and restarting the vehicle several times, the vehicle was taken to the dealer and the contact was informed that the VIN was under a recall. The vehicle was repaired. The contact stated that approximately 8 months later the failure recurred while driving approximately 35 mph. The vehicle was restarted and driven to the dealer. The mechanic was unable to determine the cause of the failure. The failure recurred while driving 55 mph. The vehicle was returned a third time to the dealer however, a repair was not performed. The manufacturer was made aware of the failure and opened a case. The approximate failure mileage was 14,000. Consumer stated case number [XXX] was opened by Ford corporate.  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).”",
        "vin": "1fmcu9hd7ku"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/05/2021",
        "dateOfIncident": "08/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427846,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Engine began to idle badly on startup and misfire. White smoke came from exhaust on startup. Coolant levels started to decrease. Engine is burning coolant that has leaked into the cylinders due to a defect in the casting of the engine block. Dealership is now saying car needs an entire new engine block. Obviously the previous recall that was addressed did not solve the issue.",
        "vin": "1FMCU9GD3KU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/25/2021",
        "dateOfIncident": "07/24/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426358,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I was stopped at a traffic light and when I went to resume driving the steering froze and a steering assist warning light came on the dash. I turned the engine off and restarted the wheel turned and locked again. I then drove the car back to the dealer service(7/24/21). They said they would look at it on Monday7/26/21.   Vehicle has 83,000 miles. Purchased new at Mullinax Ford New Smyrna Beach.",
        "vin": "1FMCU0F71KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/20/2021",
        "dateOfIncident": "05/31/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421546,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The inside door panel clips have broken and now the door is unopenable",
        "vin": "1FMCU0F7XKU"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/17/2021",
        "dateOfIncident": "03/15/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421290,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Ford Escape. The contact stated that after receiving a maintenance check-up by her mechanic, she was informed that only 50% of her tread remained on all four tires. A few months later, the contact noticed that all four tires were shredding and that small holes had developed around each tread. The contact then took the vehicle back to her mechanic where they contacted the tire manufacturer. The tire manufacturer informed her that her vehicle was not under NHTSA Campaign Number: 21V155000 (TIRHotES). The dealer nor the vehicle manufacturer have yet to be notified of the failure. The vehicle had yet to be repaired. The failure mileage was 21,034.",
        "vin": "1fmcu9j90ku"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/24/2021",
        "dateOfIncident": "04/06/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413646,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR AXLE SEEMS TO HOP & IT FEELS LIKE GRINDING OF DIFFERTIAL & BANGING NOISE WITH VIBRATION. DURING ACCELERATION ( EVEN SLOWLY) THIS OCCURS LEFT OR/& RIGHT AXLE SLIPS & BANGS, VERY UNNERVING !!! THIS HAPPENS STARTING OUT VERY SLOWLY LEFT OR RIGHT.",
        "vin": "1FMCU9G95KU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/04/2021",
        "dateOfIncident": "02/14/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406307,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR HAS HAD TWO TRANSMISSION FAILURES WITH LESS THAN 5,000 MILES DRIVEN. BOTH TIMES THE ALERT SYSTEM ACTIVATED \"SERVICE ASAP\". THE CAR BECAME STUCK BETWEEN NEUTRAL AND DRIVE, MAKING IT UNSAFE TO DRIVE.",
        "vin": "1FMCU9HD1KU"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/01/2021",
        "dateOfIncident": "03/17/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405903,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST RECENTLY BOUGHT THIS VEHICLE AND NOW I HAVE A SMALL HOLE IN THE UPPER SIDEWALL OF THE TIRE. THE VEHICLE HAS A LOT OF TREAD STILL LEFT ON THE TIRES ( 9/32). THE HOLE IS TO SMALL TO BE FROM ANY FOREIGN OBJECT ON THE ROAD. I NOW HAVE TO BUY NEW TIRE EVEN THOUGH I SEE YOU HAVE OPEN RECALLS ON OTHER FORD ESCAPE MODELS FROM THE SAME YEAR. THAT RECALL FOR THOSE MODELS ARE FOR SMALL HOLES IN THE TIRE DUE TO AN INCORRECT HEATING PROCESS AT THE MANUFACTURER.",
        "vin": "1FMCU0GD6KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "03/30/2021",
        "dateOfIncident": "02/17/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11405524,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2019 FORD ESCAPE. THE CONTACT STATED THAT WHILE  EXITING THE RAMP FROM THE FREEWAY GOING ABOUT 20 MPH. THE CONTACT WENT TO DEPRESS THE BRAKE PEDAL  WHICH FAILED TO ENGAGED PROPERLY AS ANOTHER VEHICLE WAS STOPPED AT THE STOP SIGN. THE CONTACT TRIED TO AVOID A COLLISION WITH THE VEHICLE AND TURNED THE STEERING WHEEL LEFT WHERE A MEDIAN WAS PRESENT WENT OVER THE MEDIAN HOWEVER AN ONCOMING VEHICLE WAS COMING AND CRASHED INTO THE VEHICLE. THE FRONT PASSENGER AND DRIVER SIDE AIRBAGS DEPLOYED. THE CONTACTS WIFE HAD SUSTAINED A BROKEN REST ON HER LEFT ARM, CHEST, AND RIMS. MEDICAL ATTENTION WAS CONTACTED AND HAD TAKEN THE CONTACT WIFE TO THE HOSPITAL WHERE THE CONTACT WIFE STAY UP TO 24 HOURS BEFORE SHE WAS RELEASED. THE CONTACT DID NOT SUSTAIN ANY INJURIES. THE VEHICLE WAS TOWED BY THE CONTACT INSURANCE COMPANY TO A COLLISION LOT WHERE THE ADJUSTER DEEMED THE VEHICLE  A TOTAL LOSS. STAMFORD FORD 212 MAGEE AVE, STAMFORD, CT 06902 (203) 357-0357 WAS CONTACTED AND INFORMED THE CONTACT THAT NO RECALL WAS UNDER THE VIN. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 1,300.*DT",
        "vin": "1FMCU0J90KU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/17/2021",
        "dateOfIncident": "03/17/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403563,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY 2019 FORD ESCAPE INTO A FORD GARAGE TO GET A OIL CHANGE AND WAS TOLD MY REAR BRAKES ARE REALLY BAD AND SHOULD BE SERVICED ASAP. THEY COULD NOT UNDERSTAND HOW THE BRAKES COULD BE SO WORN OUT SINCE THERE IS ONLY 14500 MILES ON IT. THEY STATED THAT THERE IS NOTHING MECHANICAL THAT CAUSED THIS AND THERE ISN'T ANYTHING THEY CAN DO ABOUT IT. THEY ALSO STATED IT MUST BE MY DRIVING &#128545; RIDING THE BRAKES OR DOUBLE BREAKING! I AM 62 YEARS OLD, I THINK I KNOW HOW TO DRIVE! I ALSO TOOK THE VEHICLE TO MY MECHANIC AND CONFIRMED THE BRAKES ARE BAD AND IS ALSO PUZZLED HOW THIS OCCURRED. I'M UPSET THAT WITH A NEW VEHICLE AND I HAVE TO SPEND SO MUCH ON REPAIRS. IT IS STILL UNDER WARRANTY AND SHOULD BE COVERED!",
        "vin": "1FMCU9GD2KU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/02/2021",
        "dateOfIncident": "02/27/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398750,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED VEHICLE IN OCTOBER OF 2019, IN FEBRUARY 2020 HAD ENGINE LIGHT COME ON AND THE CODE P0496 WHICH IS A PURGE VALVE ERROR AND TOOK TO SERVICE AND THEY STATED THAT FORD HAD TO HAVE THIS HAPPEN TWICE, SO ON MARCH 17, 2020, IT HAPPENED AGAIN AND WAS TAKEN TO SERVICE AGAIN AND IT WAS REPLACED.  ALMOST 1 YEAR LATER, ON FEBRUARY 27,2021 THE CHECK ENGINE LIGHT CAME ON AND  WAS TAKEN BACK TO SERVICE  ON MARCH 2 AND WAS REPLACED AGAIN. NO RECALLS ON THIS VEHICLE , BUT THERE SHOULD BE. THIS SHOULD HAVE HAPPENED ON A NEW VEHICLE NOR SHOULD IT CONTINUE TO HAPPEN! IT IS NOW ON ITS 3 RD PURGE VALVE!!!",
        "vin": "1FMCU9GD0KU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/26/2021",
        "dateOfIncident": "02/24/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398067,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WILL OCCASIONALLY LOCK AND UNLOCK ITSELF AS IT IS BEING DRIVEN. AS IT LOCKS AND UNLOCKS ITSELF, IT BRIEFLY ACTIVATES THE HAZARD LIGHTS AS WELL. THE VEHICLE IS KEYLESS IGNITION, AND THE KEY FOB IS PLACED IN THE CENTER CONSOLE AREA WITH NOTHING CONTACTING IT. WHEN IT OCCURS, IT IS QUITE FREQUENT, AND SEEMS TO NOT BE AFFECTED BY MOISTURE, SPEED OR TEMPERATURE, NOR BY CITY OR HIGHWAY DRIVING.",
        "vin": "1FMCU9GD4KU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/10/2021",
        "dateOfIncident": "04/28/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395532,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT USED ESCAPE IN APRIL. DIDN'T DRIVE MUCH SINCE I LIVE IN TOWN. TOOK A HOUR DRIVE FROM HOME.ENGINE STARTED MISFIRING AND CAR WAS JERKING. TOOK TO DEALERSHIP. THEY HAD FOR TWO WEEKS. SAID WAS SOLENOID IN TRANSMISSION AND REPLACED IT. PICKED UP, TOOK HOME. DROVE 3 DAYS LATER, STARTED DOING SAME THING. DROVE NEXT DAY AND CAR QUITE RUNNING 1 BLOCK FROM HOUSE. TRIED TO START BUT STARTED MISSING AND QUIT. HAD CAR TOWED TO DEALERSHIP. THEY HAD FOR 2 WEEKS. SAID CAM SHAFT AND CRANK SHAFT SENSOR WERE BAD AND REPLACED THEM. THEY TEST DROVE OVER 400 MILES WITH NO PROBLEMS. PICKED UP AND DROVE LESS THEN 5 MILE AND STARTED MISFIRING AGAIN. TOOK BACK TO DEALERSHIP. THEY SAID IT WAS ALTERNATOR.THEY REPLACED AND IT TOOK THREE WEEKS TO GET BACK. A COUPLE OF DAY LATER I DROVE 2 MILES TO GAS STATION, FILLED UP AND GOT ON INTERSTATE. BY FIRST EXIT(2-3 MILES) IT STARTED MISSING AGAIN. DROVE TO SECOND EXIT TO GET OFF INTERSTATE SINCE I DIDN'T TRUST. TOP SPEED ON INTERSTATE WAS 45 MPH. OIL LIGHT STARTED FLASHING AS IF CAR WAS STALLING. TOOK BACK TO DEALERSHIP. THEY SAID THEY DIDN'T KNOW WHAT WAS WRONG. THEY HAVE HAD FOR GOING ON 4 WEEKS WITH NO WORD ON WHAT THEY FOUND. CAR HAD 27,939 MILES WHEN WE BOUGHT KNOW HAS 30,030 MILES. HAD SINCE APRIL OF 2020 AND WAS BEEN IN SHOP 11 WEEK.",
        "vin": "1FMCU9G99KU"
    },
    {
        "components": "ELECTRICAL SYSTEM,WHEELS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/22/2021",
        "dateOfIncident": "01/20/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389410,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY 2019 FORD ESCAPE BRAND NEW IN EARLY SPRING OF 2019. SHORTLY AFTER PURCHASING MY ESCAPE I DID NOTICE SOME SLIPPAGE OF THE TRANSMISSION. I PLANNED ON GOING BACK TO THE DEALER SO THEY COULD CHECK IT OUT, BUT UNFORTUNATELY I BECAME ILL, AND THEREFORE IT SLIPPED MY MIND. I WAS IN AND OUT OF THE HOSPITAL FOR THE NEXT SEVERAL MONTHS, BUT AS SOON AS I FELT WELL ENOUGH I COULD NOT WAIT TO DRIVE MY NEW CAR AGAIN. MY FIRST TRIP WAS ACTUALLY TO MY ONCOLOGIST OFFICE, BUT I WAS EXCITED JUST TO BE DRIVING. ON MY WAY THERE, HOWEVER, MY CAR JERKED ME TO THE LEFT CAUSING ME TO RUN OFF THE ROAD. I WAS RIGHT IN FRONT OF MY DOCTOR'S OFFICE, SO I PARKED AND WENT ABOUT MY BUSINESS. WHEN I MY APPOINTMENT WAS OVER, AND I CAME BACK OUT I NOTICED I HAD A FLAT TIRE. IT REALLY SURPRISED ME, BECAUSE EVEN THOUGH I DID HAVE THE WEIRD INCIDENT I MENTIONED PREVIOUSLY, I DIDN'T THINK IT WOULD CAUSE MY TIRE TO BLOW OUT. SO, I HAD THE TIRE REPLACED, AND LIFE WENT ON. SHORTLY AFTER THAT, I STARTED HAVING PROBLEMS STARTING MY CAR. I HAD IT TOWED TO THE DEALER FOR THE FIRST TIME 11/19/19, MY CAR WAS TOWED TO THE DEALER 1/20/21 WITH THE SAME PROBLEM. I ADMIT, I DO NOT DRIVE MY CAR MUCH THESE DAYS, BUT I DO MAKE AN EFFORT TO START IT ALMOST EVERYDAY, AND LET RUN FOR 20 MINUTES. WHEN I PURCHASED THE ESCAPE, I WAS EXPECTING TO HAVE TO DRIVE TO THE MEDICAL ONCE OR TWICE A MONTH. I AM SURE EVERYONE IS DRIVING LESS BECAUSE OF THE CORONA VIRUS. I REALLY FEEL NERVOUS GOING OUT BECAUSE OF MY VEHICLE AND CORONA. I HAVE CALL ROADSIDE ASSISTANCE MORE SINCE I BOUGHT THE 2019 ESCAPE, THAN MY OWN MOTHER. ONE LAST THING. I DID MENTION THE TRANSMISSION SLIPPING THE FIRST TIME I HAD IT TOWED BACK TO THE DEALER, AND THEY SAID WHEN THEY TEST DROVE IT AFTER REPLACING THE BATTERY, IT DROVE FINE, BUT I RECORDED THE MILEAGE WHEN I WENT TO PICK IT UP, AND THE MILEAGE WAS THE SAME AS IT WAS WHEN I DROPPED IT OFF.",
        "vin": "1FMCU0J97KU"
    },
    {
        "components": "STEERING,POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/13/2021",
        "dateOfIncident": "12/29/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387961,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 FORD ESCAPE TITANIUM STEERING WHEEL SHAKES/VIBRATES HEAVY & MAKES A LOUD NOISE FROM CAR (ALMOST SOUNDS LIKE A BAD LOUD MUFFLER SOUND) AT SPEEDS OF 35 MPH & 45MPH WHEN THE GAS PEDDLE IS LEVELED AT SPEED AND ALSO DOES THE SAME WHEN GOING UP AN INCLINE AT THE SAME SPEEDS. ALSO TRANSMISSION  SLIPS BETWEEN 1 & 2 GEARS INTERMITTENTLY.  VERY BUMPY RIDE IN THE BACK WHEN GOING 70 MPH ON THE HIGHWAY. THESE ISSUES HAPPEN WHEN ON LOCAL ROADS & HIGHWAY RAMPS. DEALER REPAIR HAS CHECKED SEVERAL TIMES. FIRST FEW TIMES THEY COULD NOT REPLICATE THE ISSUE. DECEMBER 29, 2020 FINALLY GOT THE ISSUE TO REPLICATE AND PUT A TICKET DIRECTLY INTO FORD. I CHECKED BACK ON 1/7/2021 SINCE I BARE THE HEARD FROM THE DEALER SERVICE REP. AT THAT TIME SHE STILL DIDN'T HAVE AN ANSWER TO A RESOLUTION TO FIX THE FAULT. I CALLED TODAY 1/13/2021 AND THE DEALER REPAIR SERVICE REP SAID IT WAS A CHARACTERISTIC OF THE MODEL BECAUSE THEY INFORMED FORD ON THE TICKET THEY TESTED ANOTHER 2019 ESCAPE WITH THE SAME ENGINE & TRANSMISSION AND IT HAD THE SAME FAULT.  CAR WAS MANUFACTURED 3/2019.  PLEASE NOTE I HAVE PURCHASED BRAND NEW FORD ESCAPES IN 2002, 2005, 2009, 2017 & 2019. I KNOW HOW THE ENGINE & TRANSMISSION OF A FORD ESCAPE SHOULD PREFORM.  I STILL HAVE MY 2009 ESCAPE AND IT PREFORMS BETTER THEN THIS 2019...COMPARABLE ENGINES & TRIM PACKAGE. THE FAULTS THIS 2019 IS HAVING ARE NOT CHARACTERISTICS OF A CAR THEY ARE CLEARLY ISSUES WHERE PARTS NEED TO BE REPLACED OR REPAIRED TO OPERATE PROPERLY.  FORD NEEDS TO DO THE RIGHT THING AND FIND WHAT IS CAUSING THE ISSUE AND REPAIR IT CORRECTLY.",
        "vin": "1FMCU9J95KU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/13/2021",
        "dateOfIncident": "01/11/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387833,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS SIDE SWIPED IN OUR 2019 FORD ESCAPE. THE SIDE CURTAIN AIRBAGS AND THE DRIVER'S SEAT AIRBAG DEPLOYED. THE DRIVER'S SEAT AIRBAG CAUGHT THE LEFT SLEEVE ON FIRE. SHE WAS SITTING STILL AT A STOP LIGHT WAITING TO TURN LEFT WHEN SHE WAS SIDE SWIPED.",
        "vin": "1FMCU0F70KU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/29/2020",
        "dateOfIncident": "11/27/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385495,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT THIS CAR AS CERTIFIED PRE OWNED FROM A FORD DEALER WITH 28K MILES. APPROX. 4 WEEKS AFTER PURCHASE THE ENGINE STARTS RUNNING ROUGH AND CHECK ENGINE LIGHT CAME ON WITH AN ERROR CODE P0303 MISFIRE. TOOK IT TO DEALER AND THEY DIAGNOSED COOLANT IN CYLINDER 3 WITH THE FIX BEING A NEW SHORT BLOCK ENGINE REPLACEMENT.  IT WAS STILL UNDER WARRANTY BUT VERY FRUSTRATING THIS HAPPENED TO A CAR WITH LOW MILES.  AFTER DOING RESEARCH THIS IS A VERY COMMON PROBLEM WITH THE FORD 1.5 LITER ENGINE.",
        "vin": "1FMCU9GD7KU"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/13/2020",
        "dateOfIncident": "11/06/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374600,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR HATCH DOES NOT FULLY LATCH WHEN USING THE REMOTE OR THE BUTTON ON THE HATCH",
        "vin": "1FMCU9HD2KU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/29/2020",
        "dateOfIncident": "09/29/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361867,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM NOT SURE IF THIS IS THE BEST FORUM BUT I WAS UNABLE TO FIND A BETTER WAY. I WAS INFORMED OF A RECALL TO MY VEHICLE. I CALLED THE LOCAL DEALER ON TUESDAY SEPTEMBER 29, 2020. HASSETT FORD 3530 SUNRISE HWY, WANTAGH, NY 11793. THE DEALER REUSED  TO MAKE AN APPOINTMENT STATING THEY ARE NOT TAKING ANY NEW CUSTOMERS. I CALLED THE FORD MOTOR COMPANY, CUSTOMER SERVICE WHO TOOK MY INFORMATION PLACED ON HOLD WITH CALL ENDING WITH THANK YOU FOR CALLING FORD AND A CUSTOMER SURVEY. WONDERING HOW TO HAVE SAFETY RECALL PERFORMED?",
        "vin": "1FMCU9GD3KU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/05/2020",
        "dateOfIncident": "07/19/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353322,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS STARTING VEHICLE, IT SHUDDERED AND STOPPED WHEN PUT IN REVERSE, RESTARTED VEHICLE AND THEN PUT IN DRIVE, TRIED TO PRESS GAS PEDAL AND CAR WOULD NOT GO ABOVE 25 MPH BEFORE CHECK ENGINE LIGHT CAME ON, TOWED TO DELAERSHIP WAS INFORMED IT HAD COOLANT LEAKING AND NEEDED ENGINE REPLACED  28,200 MILES",
        "vin": "1FMCU0GDXKU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/24/2020",
        "dateOfIncident": "04/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350834,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CHANGING REVERSE OR FORWARD, THERE IS A LOUD THUMP AS IF SOMEONE OR SOMETHING HAS HIT THE CAR",
        "vin": "1FMCU9GD8KU"
    },
    {
        "components": "SEAT BELTS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/22/2020",
        "dateOfIncident": "08/21/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350773,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 7000 MILES THE CAR STARTED MISSFIRENING AND WOULDN'T RUN THE DEALER SAID IT WAS A SPARK PLUG NOW WE ARE AT 29000 MILES LESS THEN A YEAR LATER AND IT'S MISSFIRENING AGAIN THIS TIME IT HAPPENED WHILE ENTERING A BUSY STREET AND ALMOST CAUSED US TO GET REAR-ENDED DUE TO THE CAR NOT ACCELERATING AS EXPECTED. ALSO THE PASS FRONT SEAT BELT DOES NOT KEEP PROPER TENSION IF YOU LEAN FORWARD THEM SIT BACK THE SEAT BELT WILL HAVE SLACK IN IT UNTIL YOU MESS WITH IT TO GET IT TO GO BACK IN.",
        "vin": "1FMCU9GD4KU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/18/2020",
        "dateOfIncident": "08/18/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349473,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 FORD ESCAPE. CONSUMER WRITES IN REGARDS TO TRANSMISSION FAILURE. *LD    THE CONSUMER STATED THE TRANSMISSION LEVER HAD FAILED. THE VEHICLE WAS TAKEN TO THE DEALER AND STATED THAT LEVER COULD NOT BE REPAIRED. *JS",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/24/2020",
        "dateOfIncident": "05/20/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341240,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTING APPROXIMATELY OF APRIL OF THIS YEAR, NOTICED THAT THE CAR WAS SURGING AND \"MISSING\" ON START.  THOUGHT IT MAY HAVE BEEN A SPARK PLUG OR SUCH GOING BAD AND IT WASN'T HAPPENING WITH EVERY START.  THEN MIDDLE OF MAY, IT WAS DAILY ON EVERY START AND WAS SURGING HARDER AND SPUTTERING.  THE TACHOMETER WOULD EVEN RISE AND FALL IN QUICK SUCCESSION.  ON MAY 20TH, THE ENGINE LIGHT CAME ON AND TOOK IT TO MY DEALERSHIP.  BEFORE EVEN LOOKING AT MY VEHICLE, AFTER DESCRIBING TO THEM WHAT WAS HAPPENING, THEY ALREADY KNEW WHAT WAS WRONG AND WHAT THE REMEDY WOULD BE.  THEY STILL PUT MY CAR ON THE COMPUTER AND LOOKED IT OVER, BUT CAME OUT WITH THE CONCLUSION THAT THE ENGINE WOULD NEED REBUILT.  FAST FORWARD 2 MONTHS LATER, FINALLY GOT ALL THE PARTS IN TO REBUILD THE ENGINE, HOWEVER MY DEALERSHIP IS SMALL AND DO NOT HAVE A LOANER VEHICLE FOR ME AT THIS TIME.  I AM UNDERSTANDING OF THAT.  BUT THE CAR IS NOW DOING THIS ON EVERY START REGARDLESS IF I JUST STOPPED AT THE POST OFFICE FOR 5 MINUTES.  THIS MORNING, IT SPUTTERED HARD AND THEN SHUT OFF FOR THE FIRST TIME.  IT IS ALSO AFFECTING HOW IT SHIFTS FROM P TO D AND CAN TELL A DIFFERENCE WHEN TAKING OFF FROM A STOP.  CALLED FORD TO SEE IF THEY ACKNOWLEDGED THIS ISSUE, THEY KEPT CIRCLING BACK TO THE DEALERSHIP AND THE IMPENDING REPAIR.  I FINALLY STATED THAT I JUST WANTED TO KNOW IF FORD WAS ACKNOWLEDGING THIS ISSUE AND WAS REFERRED TO A REGIONAL CUSTOMER SERVICE MANAGER NAMED JESSICA.  SHE CALLS AND WAS LESS THAN FRIENDLY AND KEPT THROWING THE WORD \"RECALL\" AROUND, BUT THERE IS NO ACTIVE RECALL.  SHE KEPT SAYING THAT MY VEHICLE WAS GETTING REPAIRED FOR A RECALL, AND I TOLD HER NO, IT IS GETTING REPAIRED BECAUSE I REPORTED ISSUES WITH MY VEHICLE.  I'M OVER IT.  I DO NOT FEEL SAFE IN MY VEHICLE AND HAVE READ OTHER COMPLAINTS THAT OTHERS HAVE HAD TO HAVE MULTIPLE REBUILDS OF THEIR ENGINE AND THE PROBLEM NEVER SOLVED.",
        "vin": "1FMCU9GD8KU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/22/2020",
        "dateOfIncident": "06/21/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330042,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON THE HIGHWAY, ALL OF A SUDDEN WARNING COMES ON STATING, \"CAR IS OVERHEATING STOP ENGINE NOW.\" CAR STARTED TO SHAKE AND STEERING WHEEL STARTED TO SHAKE. PULLED TO THE SIDE OF THE HIGHWAY. CHECK ENGINE LIGHT IS RED. POLICE OFFICER PULLED ASIDE TO ASSIST. OPENS HOOD OF THE CAR. OFFICER VISIBLY SEES COOLANT IS BELOW THE MINIMUM LINE. THE OFFICER GOES TO HIS CAR TO RETRIEVE COOLANT. WHEN THE OFFICER UNSCREWED THE COVER OF THE COOLANT FLUID HOLDER, THE FLUID RAISED BY ITSELF TO MAXIMUM LINE. OFFICER DID NOT ADD MORE COOLANT. STARTED THE CAR AND ENGINE LIGHT GOES FROM RED TO YELLOW. I WAS ABLE TO COAST THE CAR HOME BUT VERY SLOWLY.  *TR",
        "vin": "1FMCU9HD7KU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/08/2020",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327858,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "JERKING AND THROWING PASSENGERS FORWARD.  *TR",
        "vin": "1FMUC0GD8KU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/25/2020",
        "dateOfIncident": "02/15/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325884,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN YOU HIT THE BUTTON TO CLOSE THE LIFTGATE IT DOESN'T USUALLY LATCH. MANY TIMES I HAVE TO MANUALLY CLOSE IT BECAUSE WHEN I PUSH THE BUTTON THE LIFTGATE WILL CLOSE DOWN BUT IT WON'T LATCH. I HAVE TAKEN THE VEHICLE TO A FORD DEALER 2X. THE FIRST TIME THEY CONFIRMED THE ISSUE AND REPLACED A MECHANISM THAT CONTROLS THE LIFTGATE. THE PROBLEM CAME BACK LESS THAN 1 WEEK LATER. WHEN I TOOK IT BACK THEY CLAIMED IT ALWAYS LATCHED WHEN THEY TESTED, AND DIDN'T DO ANYTHING TO IT. MEANWHILE, I TOOK IT HOME AND IT STILL WON'T LATCH WHEN I TRY TO CLOSE IT WITH THE BUTTON. VEHICLE IS ALWAYS OFF, PARKED, WHEN I TRY TO CLOSE THE LIFTGATE.  THE ONLY ODD THING I NOTICED IS IF I KEEP THE DRIVER SIDE DOOR OPEN WHEN I PUT THE BUTTON TO CLOSE THE LIFTGATE THEN FOR SOME REASON THE LIFTGATE LATCHES, PROBABLY 8/10 TIMES.",
        "vin": "1FMCU9J94KU"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "05/13/2020",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11324414,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2019 FORD ESCAPE. THE CONTACT STATED WHILE DRIVING 35 MPH, WHEN THE HILL ASSIST MODE INDEPENDENTLY ACTIVATED WITHOUT BEING ON A HILL. THE CONTACT STATED THE VEHICLE STARTED TO APPLY THE BRAKES INDEPENDENTLY CAUSING THE VEHICLE TO HESITATE. THE CONTACT ALSO STATED THE STEERING WHEEL SEIZED, CAUSING HER TO LOSE CONTROL OF THE VEHICLE AND CRASHED INTO A GUARD RAIL. THE AIR BAGS DID NOT DEPLOY. THE CONTACT STATED THE FRONT DRIVER SIDE SEAT BELT PRETENSIONER FAILED TO ENGAGE, CAUSING HER TO IMPACT THE DASHBOARD/RADIO WITH HER HEAD. THE CONTACT STATED MEDICAL ATTENTION WAS REQUIRED DUE TO THE FACT THAT SHE LOST CONSCIENCES AND SUFFERED A CONCUSSION. THE CONTACT ALSO STATED THAT SHE HAS A TINGLING SENSATION IN BOTH LEGS AND HAS LOST SENSATION IN BOTH ARMS. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO AN AUTO SHOP. THE CONTACT STATED THE INSURANCE COMPANY DEEMED THE VEHICLE TOTALED. THE CONTACT CALLED LOCAL DEALER RAMP MOTORS (4869 NESCONSET HWY, PORT JEFFERSON STATION, NY 11776, (631) 473-1550) AND HAS LEFT A VOICEMAIL OF THE ISSUE. THE MANUFACTURER HAD NOT BEEN INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS 8,623.",
        "vin": "1FMCU9HD6KU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/08/2020",
        "dateOfIncident": "05/07/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323928,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ONLY HAD THIS CAR LESS THAN 30 DAYS MILEAGE WAS 29,476 ON 4/13/20. MILEAGE WHEN IN SHOP IS 29,944  SO DROVE 468 MILES. BEEN HEARING LOUD THUDS OR CLUNKING NOISE FROM REAR OF VEHICLE FOR A FEW DAYS. TOOK IT BACK TO WHERE I BOUGHT IT THEY LOOKED AT AND DUPLICATED THE NOISE SEVERAL TIMES IN THEIR SHOP, SAID IT WAS MOST LIKELY SOMETHING IN THE TRANSMISSION. TOOK THE CAR TO  FORD AND AT FIRST THE SERVICE WRITER WAS IN DENIAL BUT THE TECHS MADE HIM A BELIEVER....THE TRANSMISSION HAS PROBLEM WITH THE VALVE BODY THEY THINK. THEY TOOK THE TRANSMISSION OUT TODAY HOPEFULLY KNOW SOMETHING MONDAY.  THE NOISE OCCURRED WHEN BACKING UP WITH THE STEERING WHEEL TURNED AND GIVING THE CAR A LITTLE GAS. A VERY LOUD CLUNK WAS HEARD . THE NOISE CONTINUED AND STARTED DOING IT EVERY TIME I BACKED UP. ALSO HEARD NOISE/FELT IT WHEN SHIFTING FROM R TO N TO D. THIS PROBLEM STARTED JUST BEFORE I TOOK IT IN THE  SHOP (MORNING OF ) JUST SITTING STILL SHIFT FROM PARK TO REVERSE TO NEUTRAL TO DRIVE OR BACK TO NEUTRAL.  *TR",
        "vin": "1FMCU9GD9KU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/07/2020",
        "dateOfIncident": "05/06/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323757,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2019 FORD ESCAPE HAS LESS THAN 20,000 MILES AND IS ALREADY HAVING COOLANT LEAK ISSUES INTO THE ENGINE. CYLINDER 3 ISSUE AND THE DEALERSHIP IS TELLING ME THAT THE ENGINE WILL LIKELY NEED TO BE REPLACED. AS I READ MORE ABOUT THIS I AM SEEING THOUSANDS OF VEHICLES AFFECTED, BACK ORDER ON ENGINES, AND A LIKELY LONG WAIT PERIOD FOR THIS TO BE RESOLVED. AFTER SPEND ALMOST $30,000 ON MY VEHICLE THIS IS ABSOLUTELY UNACCEPTABLE BUSINESS PRACTICE! I AM ALSO READING THAT A LAW FIRM IN TENNESSEE IS COLLECTING CLIENTS FOR A LAWSUIT.  *TR",
        "vin": "1FMCU9HDXKU"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/23/2020",
        "dateOfIncident": "03/23/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319033,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING 70+MPH ON FREEWAY AND THE ACC WENT OUT WITH AN ALERT.  CONTINUED DRIVING AND THE LANEKEEP ASSIST HAD AN ERROR AND CEASED WORKING, FOLLOWED BY AN ERROR FOR COLLISION AVOIDANCE.  SHORTLY AFTER THE SPEEDOMETER AND ODOMETER WENT TO 0 AND SEVERAL OTHER ERRORS FOR ABS, ESC, AND OTHERS WENT OFF.  THIS FELT LIKE THE SCENE FROM APOLLO 13 WHERE EVERYTHING WAS GOING WRONG AT ONCE.  I NOTICED THE POWER STEERING WAS NOT WORKING AND IT WAS MUCH MORE DIFFICULT TO TURN THE WHEEL AS I PULLED INTO THE FORD DEALER.  THERE WAS STEAM/SMOKE COMING FROM MY FRONT GRILL.",
        "vin": "1FMCU9GD8KU"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": true,
        "dateComplaintFiled": "03/18/2020",
        "dateOfIncident": "12/15/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318594,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 FORD ESCAPE. THE CONTACT STATED THAT WHILE DRIVING AT LOW SPEEDS, THE VEHICLE SUDDENLY SURGED FORWARD TO THE RIGHT AND CRASHED INTO A UTILITY POLE. NO INJURIES WERE REPORTED. A POLICE REPORT WAS TAKEN AT THE SCENE. THE VEHICLE WAS TOWED TO THE LOCAL DEALER FRIENDLY FORD (2800 N. TELEGRAPH RD, MONROE MI.) THE CAUSE OF THE FAILURE WAS NOT DETERMINED. ALSO, WHILE DRIVING AT VARIOUS SPEEDS AN ABNORMAL NOISE WAS PRESENT COMING FROM THE REAR OF THE VEHICLE. THE NOISE WAS MOST NOTICEABLE WHILE DRIVING DOWN AN INCLINE. THE VEHICLE WAS ALSO TAKEN TO THE DEALER FOR THIS ISSUE HOWEVER, THEY WERE UNABLE TO DUPLICATE THE FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURES. THE FAILURE MILEAGE WAS 500.  *JS",
        "vin": "1FMCU9HD8KU"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "03/12/2020",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317740,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 FORD ESCAPE. THE CONTACT STATED WHILE SHIFTING GEARS TO REVERSE, SHE HEARD A LOUD ABNORMAL NOISE. THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE CONTACT ALSO STATED WHILE MAKING A RIGHT TURN, THE VEHICLE BEGAN TO ACCELERATE ON ITS OWN AND IMPACTED A POLE. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS FILED. THE CONTACT DID NOT SUSTAIN ANY INJURIES OR SEEK MEDICAL ATTENTION. THE VEHICLE WAS NOT DRIVABLE. THE VEHICLE WAS TOWED TO LOCAL DEALER FRIENDLY FORD LOCATED (2800 N TELEGRAPH RD, MONROE, MI 48162) WHERE MADE AWARE OF THE FAILURE. THE VEHICLE HAD NOT BEEN DIAGNOSED AS OF YET. THE CONTACT STATED UNKNOWN PART OF FRONT PASSENGER SIDE OF THE VEHICLE WAS REPAIRED. THE MANUFACTURER HAD BEEN INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 700.",
        "vin": "1FMCU9HD8KU"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/09/2020",
        "dateOfIncident": "03/09/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316979,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I SUBMITTED THIS COMPLAINT ON 3/08/2020. THE PROBLEM WAS RESOLVED WHEN THE FORD DEALERSHIP WHERE I HAD MY CAR TOWED INSPECTED THE CAR. THEY FOUND THAT I HAD INSTALLED A WEATHERTECH FLOOR MAT IN THE DRIVERS SIDE AND HAD OVERLAPPED THE LEADING EDGE OF THE MAT OVER THE ACCELERATOR PEDAL. I HAD SNAPPED THE MAT FIRMLY IN PLACE SO THAT IT WAS PRESSING DOWN ON THE ACCELERATOR PEDAL. THE PROBLEM WAS RESOLVED WHEN THE FLOOR MAT WAS REMOVED AND INSTALLED PROPERLY.",
        "vin": "1FMCU9J93KU"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/08/2020",
        "dateOfIncident": "03/08/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316885,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR ACCELERATED FROM 25 TO 75 MPH WITHOUT MY FOOT BEING ON ACCELERATOR. CRUISE CONTROL WAS OFF. SUBSEQUENTLY, STOPPED AND TURNED OFF VEHICLE. RESTARTED AND VEHICLE WOULD ACCELERATE FROM ANY SPEED WHEN I TOOK MY FOOT OFF THE ACCELERATOR. I HAD TO CONTROL MY SPEED ON A WINDING, NARROW, ROAD WITH NO SHOULDERS. I COULD ONLY CONTROL THE SPEED OF THE CAR BY RIDING THE BRAKES. THE BRAKES OVERHEATED. WHEN I CAME TO A STOP THE CAR ENGINE CONTINUED TO RUN AT 5,000 RPM. I CAME TO A STOP, THEN SHIFTED INTO PARK AND THE ENGINE CONTINUED TO RUN AT 4,500 RPMS. PUSHED THE IGNITION TO SHUT OFF ENGINE AND HAD MY CAR TOWED TO THE LEXINGTON, VA  FORD DEALER WHERE I PURCHASED THE CAR.",
        "vin": "1FMCU9J93KU"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/03/2020",
        "dateOfIncident": "11/19/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315322,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 FORD ESCAPE. CONSUMER WRITES IN REGARDS TO ISSUE WITH GAS TANK. *LD    THE CONSUMER STATED THE DEALER ADVISED THERE WAS NO FIX FOR THE ISSUE.  *JS",
        "vin": "1FMCU9GD3KU"
    },
    {
        "components": "WHEELS,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/01/2020",
        "dateOfIncident": "02/20/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11315469,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE BUYING MY ESCAPE BRAND NEW WITH 1 MILE ON IT, IT HAS BEEN PLAGUED WITH ISSUES, ENGINE SHUTS OFF WHILE DRIVING CAN BE GOING 30 MPH OR 70 MPH, WHILE DRIVING ON THE INTERSTATE AT 70 BAD SMELL FROM CATALYTIC CONVERTER SEEPS IN THROUGH VENTS. PASSENGER SIDE TIRE WALL BLEW WHILE TURNING OUT OF A PARKING LOT. LICENSE PLATE LIGHT OUT AND UNABLE TO REMOVE TO CHANGE. DEALERSHIP HAS HAD CAR SEVERAL TIMES CLAIMING NOTHING IS WRONG WITH IT. RADIO KEEPS SAYING \"UPDATE\" DEALERSHIP CLAIMS IT'S MY PHONE (MY PHONE HAS NO UPDATES DUE) BRAKES MAKE TERRIBLE NOISE WHEN REVERSE BREAKING. A LITTLE OVER 11,000 MILES AND TRANSMISSION KEEPS SLIPPING BUT DEALERSHIP CLAIMS NOTHING IS WRONG, ALSO CAR DOES NOT WANT TO START HALF THE TIME. USB FOR PHONE CORD IN FRONT DOES NOT WANT TO STAY CONNECTED, AND BACK PORT FOR CAR CHARGER OVERHEATED AND CAUSED MY DAUGHTER BURNS ON HER HAND. MY DAUGHTER WAS DRIVING IT AND IT STRANDED HER ON SIDE OF ROAD AND WOULDN'T START, HAD TO SHUT OFF ,TAKE OUT KEY AND LET SIT TO RESTART BUT DEALERSHIP CLAIMS NOTHING IS WRONG. OVERALL THE DISAPPOINTMENT WITH THE 2019 ESCAPE IS HIGH. SOMETHING NEEDS TO BE DONE FURTHER TO INVESTIGATE THESE CLAIMS OF ENGINE SHUTTING OFF AND OTHER ISSUES.",
        "vin": "1FMCU0F79KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/26/2020",
        "dateOfIncident": "12/09/2019",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11311271,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 FORD ESCAPE. CONSUMER WRITES IN REGARDS TO VEHICLE CATCHING FIRE WHILE DRIVING. *LD *JS",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/24/2020",
        "dateOfIncident": "02/11/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311097,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "LOW COOLANT LEVEL PREVIOUS OIL CHANGE/COOLANT ADDED. ROUGH IDLE COLD START, P0302 2/11/2020 WITH AGAIN LOW COOLANT. TOPPED OFF COOLANT 2/11/2020 DROPPED OFF AT DEALERSHIP 2/23/2020 AGAIN COOLANT LEVEL LOW.  APPARENTLY THIS IS VERY COMMON AND ENGINE REPLACEMENT IS ONLY REMEDY. VERY DAMAGING TO VEHICLE VALUE.",
        "vin": "1FMCU9HD7KU"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/18/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309780,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "LIGHTING ON CONSOLE AND HVAC FLICKER OFF AND ON WHILE DRIVING VEHICLE.  DRIVERS SIDE MIRROR MOVES WHEN EXCITING VEHICLE.",
        "vin": "1FMCU0HD3KU"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/12/2020",
        "dateOfIncident": "02/10/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308687,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH LESS THEN 10000 MILES ON THE CAR I HAVE HAD TWO TIRES BLOW SIDE WALLS WHILE DRIVING",
        "vin": "1FMCU0GD3KU"
    },
    {
        "components": "STRUCTURE,SEATS",
        "crash": true,
        "dateComplaintFiled": "02/11/2020",
        "dateOfIncident": "12/30/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11308450,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE REAR ENDED FROM A STOPPED POSITION ON THE HIGHWAY. . MY FIANC WAS DRIVING AND SUFFERED WHIPLASH. I WAS IN THE FRONT PASSENGER SEAT AND BROKE MY BACK AND SEPARATED MY PELVIS, REQUIRING SURGERY TO STABILIZE.  THE FRONT PASSENGER SEAT IS NOW VERY SQUEAKY. CONCERNED THERE WAS AN ISSUE WITH THE PASSENGER SEAT OR SEATBELT NOT FUNCTIONING PROPERLY, LEADING TO MY INJURIES.",
        "vin": "1FMCU9GD2KU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/07/2020",
        "dateOfIncident": "02/05/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307636,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED VEHICLE APRIL 2019.  ALMOST IMMEDIATELY HEARD COOLANT GURGLING SOUND COMING FROM ENGINE WHEN ENGINE AUTO TURNED OFF AT STOP LIGHT.  I WAS TOLD THAT THIS SOUND WAS NORMAL.  JANUARY RECEIVED NOTICE FROM FORD THAT MY VEHICLE NEED PCM REPROGRAMMING.  DAY AFTER REPROGRAMMING I BEGAN TO RECEIVE CHECK ENGINE WARNINGS.  SOON AFTER THE HEATER WOULD NOT WORK WHEN CAR WAS NOT IN GEAR.  TOOK VEHICLE TO DEALER AND WAS TOLD THAT THE ENGINE NEEDS TO BE REPLACED DUE TO COOLANT LEAK IN TO VALVES.  DEALER ALSO MENTIONED THAT I HAD LOST ALMOST ALL OF MY COOLANT.  NOTE: I NEVER RECEIVED ANY WARNING MESSAGES ABOUT LOW COOLANT LEVEL.  I HAVE SINCE DISCOVERED THAT THERE ARE THOUSANDS OF THESE ENGINES THAT HAVE HAD TO BE REPLACED DUE TO THIS ISSUE.",
        "vin": "1FMCU9GD7KU"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/02/2020",
        "dateOfIncident": "01/26/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306570,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE DRIVING ON A 3 LANE HIGHWAY AT NIGHT, STOPPED AT A RED LIGHT.  SUDDENLY, THE CAR WENT COMPLETELY DEAD - NO LIGHTS OR POWER.  CARS DRIVING AT BETWEEN 40-50 MPH WERE COMING UP BEHIND US, BUT COULD NOT SEE US BECAUSE WE COULD NOT EVEN GET HAZARD LIGHTS ON.  WE WERE LOCKED IN - THE DOORS WOULD NOT OPEN!!  AFTER SEVERAL NEAR MISSES, WE WERE LUCKY ENOUGH TO HAVE A STRANGER STOP AND HE WAS ABLE TO ALERT ONCOMING CARS SO WE WOULD NOT GET HIT.  ENDS UP THAT THE NEGATIVE TERMINAL OF THE BATTERY WAS VERY LOOSE AS WELL AS THE SURROUNDING FASTENERS OF THE BATTERY.  WE PURCHASED THE CAR 5 WEEKS EARLIER, BRAND NEW WITH 11 MILES ON IT.  AFTER GETTING TOWED TO THE DEALERSHIP, IT WAS AN EASY FIX, BUT MY SAFETY CONCERN WAS THE FACT THAT THE DOORS WOULD NOT OPEN!!!  IF THERE WAS A FIRE, WE WOULD HAVE BEEN TRAPPED, AND WE COULD NOT GET OUT IN CASE WE WERE HIT BY THE VEHICLES COMING UP BEHIND US, WHICH CAME CLOSE A FEW TIMES!",
        "vin": "1FMCU9J99KU"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/27/2020",
        "dateOfIncident": "01/20/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302199,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "NO CRANK TO START VEHICLE",
        "vin": "1FMCU0F77KU"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/14/2019",
        "dateOfIncident": "07/10/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289056,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE STARTED RUNNING ROUGH AND MISSING AT 75 MPH WITH ABOUT 5000 MILES ON IT. CHECK ENGINE LIGHT CAME ON, CRUISE CONTROL SHUT OFF. I TOOK IT TO THE DEALERSHIP AND THEY SAID I HAD 3 TROUBLE CODES BUT I DON'T KNOW WHAT THE WERE. THEY REPROGRAMMED SOMETHING A GAVE ME THE CAR BACK A WEEK LATER. TWO WEEKS AFTER THAT I STARTED GETTING ANOTHER CHECK ENGINE LIGHT WITH THE CODE P0420. THE LOCAL DEALER SAYS THEY CAN'T FIX IT OR HONOR MY WARRANTY BECAUSE IT'S A US SPEC VEHICLE AND I'M IN EUROPE. I HAVE A BRAND NEW VEHICLE THAT I HAVE TO CLEAR THE CODE EVERY OTHER DAY. TO MAKE MATTERS WORST THE SMALL DOOR THAT COVERS THE ODB PORT WON'T CLOSE CORRECTLY. I'M SURE IT WASN'T DESIGNED TO BE OPENED EVERY OTHER DAY.",
        "vin": "1FMCU9J9XKU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/22/2019",
        "dateOfIncident": "11/11/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281899,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY 2019 FORD ESCAPE BRAND NEW IN MARCH OF THIS YEAR, IT HAD LITTLE UNDER 25 MILES. AS OF NOVEMBER 11TH  I AUTO STARTED MY CAR- WHEN I WENT TO GET IN IT WAS RUNNING FUNNY AND CHECK ENGINE LIGHT WAS BLINKING. TOOK IT TO DEALERSHIP, ON NOVEMBER 13TH THEY CALL AND TELL ME MY ENGINE IS BAD. THIS IS UNACCEPTABLE, MY CAR HAS 11,647 MILES ON IT & NEEDS A NEW ENGINE. FORD NEEDS TO DO A RECALL ON THESE FORD ESCAPES - I KNOW 3 PEOPLE NOW WHO HAVE HAD THE SAME ISSUE. VERY UNACCEPTABLE FOR BUYING A BRAND NEW CAR",
        "vin": "1FMCU0GD2KU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/31/2019",
        "dateOfIncident": "10/31/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277286,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AT ABOUT 30 MILES AN HOUR AND THE ENGINE JUST SHUT DOWN FOR NO REASON. AN ALERT CAME UP THAT SAID AUTO STOPSTART SHIFT TO P RESTART ENGINE.",
        "vin": "1FMCU9HD3KU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/21/2019",
        "dateOfIncident": "10/21/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270016,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR BEGAN SENDING MY HUSBAND ALERTS MY CAR HAD BEEN INVOLVED IN A COLLISION AS THE ALERT READ THE FRONT CAMERA WAS NOT WORKING, THEN MY ABS AND SKID CONTROL LIGHTS WENT OFF AND MY SPEEDOMETER WENT TO ZERO, WHILE MY CAR WAS RUNNING. MY CAR WOULD NOT ALLOW ME TO SHUT IT OFF. EVENTUALLY I COULD SHUT IT OFF. THIS HAPPENED 2 DAYS IN A ROW AND IS CURRENTLY AT DEALERSHIP. WHEN I FINALLY SHUT IT OFF IT RE SET. DANGER: NOT KNOWING HOW FAST YOU ARE GOING. ALERTS ALSO READ COLLISION WARNING NOT AVAILABLE.",
        "vin": "1FMCU9GD6KU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/11/2019",
        "dateOfIncident": "10/08/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11267982,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY MOTHER WAS ATTEMPTING TO PARK HER 2019 FORD ESCAPE.  UPON APPLYING THE BRAKE THE VEHICLE SURGED / JOLTED / ACCELERATED FORWARD AND SHE WENT OVER THE PARKING CURB AND HIT A BUILDING.   THANKFULLY SHE IS OK, HOWEVER, SHE DOES NOT WANT TO DRIVE THIS VEHICLE ANYMORE DUE TO HOW THE VEHICLE MALFUNCTIONED.",
        "vin": "1FMCU9GD7KU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/28/2019",
        "dateOfIncident": "09/27/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11258701,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "IN A HEAD ON COLLUSION, HE AIRBAGS FAILED TO DEPLOY IN TWO SEPARATE ACCIDENTS WHEREAS I ONE OF THE INCIDENTS FACIAL INJURY AND CHEST INJURY OCCURRED AS A RESULT",
        "vin": "1FMCU0F7XKU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/23/2019",
        "dateOfIncident": "09/21/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257283,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENT ISSUES WITH THE TRANSMISSION NOT BEING ABLE TO SHIFT INTO PARK.  WHEN IT HAPPENS, THE SHIFTIER FREELY MOVES BETWEEN ALL POSITIONS EXCEPT WILL NOT GO ALL THE WAY FORWARD TO THE \"PARK\" POSITION.  IT CAN EVENTUALLY BE MOVED FORWARD BY FIDDLING WITH IT OR ONE TIME A PASSENGER WAS ABLE TO FORCE IT.  EVEN WHEN THIS IS DONE, THE INDICATOR IN THE INSTRUMENT PANEL DOES NOT ALWAYS SHOW A GEAR SELECTED SO IN THOSE CASES, IT IS UNKNOWN WHETHER IT IS TRULY IN PARK.",
        "vin": "1FMCU9J97KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/09/2019",
        "dateOfIncident": "09/08/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254079,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TURNING RIGHT SLOWLY  AND GRADUALLY TOWARD A PARKING PLACE, WITH MY FOOT OFF OF THE THROTTLE AND COASTING, THE CAR ACCELERATED SUDDENLY. I IMMEDIATELY HIT THE BRAKES AND BARELY AVOIDED A CRASH INTO THE OTHER CAR AT THE CURB. VERY UNSETTLING!",
        "vin": "1FMCU9HD9KU"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "08/28/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11251927,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 FORD ESCAPE. WHILE OPERATING THE VEHICLE, THE PRE-COLLISION ASSIST FEATURE MALFUNCTIONED WHILE THE CONTACT WAS DRIVING CLOSE TO OTHER VEHICLES. WHILE DRIVING APPROXIMATELY 40 MPH, THE CONTACT'S VEHICLE WAS TWO FEET FROM THE PRECEDING VEHICLE; HOWEVER, THE SYSTEM DID NOT ACTIVATE.  ALSO, THE FEATURE ERRONEOUSLY ACTIVATED ON SEVERAL OCCASIONS DUE TO RANDOM OBJECTS LOCATED ON THE SIDE OF THE ROAD, SUCH AS TRASH CONTAINERS. THE VEHICLE WAS TAKEN TO STEVE MARSH FORD(12415 S. 1ST ST, MILAN, TN) WHERE IT WAS DETERMINED THAT THE SAFETY FEATURE WAS OPERATING NORMALLY AND NO FAILURE WAS FOUND. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 4,957.",
        "vin": "1FMCU9J94KU"
    },
    {
        "components": "ELECTRICAL SYSTEM,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "08/22/2019",
        "dateOfIncident": "06/11/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245674,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 FORD ESCAPE. THE CONTACT STATED THAT THE COMPUTER SYSTEMS RELATED TO THE CRUISE CONTROL AND FORWARD COLLISION WARNING MALFUNCTIONED. THE FORWARD COLLISION WARNING INDICATOR ILLUMINATED AND THE VEHICLE BRAKED SUDDENLY ON A HIGHWAY WITH NO VEHICLES NEARBY. THE FAILURE OCCURRED TWICE AND THE CONTACT'S VEHICLE WAS ALMOST REAR ENDED. THE CONTACT STATED THAT THE ADAPTIVE CRUISE CONTROL SHUT OFF THE CRUISE CONTROL AND THE BRAKES ACTIVATED AGAIN WITH NO VEHICLE NEARBY. SUMMERVILLE FORD (9700 DORCHESTER RD, SUMMERVILLE, SC 29485, (843) 873-3550) COULD NOT REPLICATE THE FAILURE. THE CONTACT DROPPED OFF THE KEY AND WAS PROVIDED AN ULTIMATUM OF GETTING THE VEHICLE REPAIRED OR GETTING A NEW VEHICLE. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 500.",
        "vin": "1FMCU0J96KU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/16/2019",
        "dateOfIncident": "07/10/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232426,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 10,000 MILES MY ESCAPE TRANSMISSION BEGAN SLIPPING. IT TAKES FOREVER FOR IT TO SHIFT BUT NO TRANSMISSION LIGHT COMES ON. MY GAS MILEAGE HAS ALSO GONE WAY DOWN AS A RESULT OF THIS. FORD CLAIMS IT'S FINE. BUT IT DOES IT OFTEN. ALSO WHEN THE ENGINE STOP IS ENGAGED AT STOP LIGHTS, IT DOESN'T ALWAYS START BACK UP AND I HAVE TO PUT THE CAR IN PARK AND RESTART THE VEHICLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/02/2019",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228943,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING A LOCAL INTERSTATE BETWEEN 60 AND 70 MPH, OUR NEWLY PURCHASED (3,000 MILES) 2019 FORD ESCAPE SEL SPORT COMPLETELY SHUT DOWN WITHOUT WARNING IN HEAVY TRAFFIC. LUCKILY, MY WIFE WAS ABLE TO COAST TO THE NEAREST EXIT AND PULL OFF THE ROAD WHILE TRAFFIC WAS WHIZZING BY US AT BREAKNECK SPEED. TURNS OUT THAT PART OF THE WIRING HARNESS HAD EITHER LOOSENED ON ITS OWN OR WAS NEVER PROPERLY SECURED FROM THE FACTORY. SO, THE SERPENTINE BELT MANAGED TO CLIP THIS WIRING HARNESS WHICH, IN TURN, PULLED THE HARNESS FROM ITS SOCKET WHILE STARTING TO GRADUALLY SHRED THE SERPENTINE BELT. INSTANTANEOUS LOSS OF POWER WITHOUT WARNING CREATED A VERY SERIOUS AND DANGEROUS SITUATION. FORD NEEDS TO ISSUE A SERVICE BULLETIN AND/OR ISSUE A RECALL ASAP SINCE IT WOULD ONLY TAKE ONE OTHER INCIDENT SIMILAR TO THIS BEFORE SOMEONE IS SERIOUSLY INJURED, OR WORSE.",
        "vin": "1FMCU9HD5KU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/04/2019",
        "dateOfIncident": "06/03/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217753,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD DEALER CHECKED MY BRAKES AFTER 11000 MILES AND WAS TOLD MY REAR BREAKS WERE BAD AND IT WAS NORMAL WEAR AND TEAR AFTER 10000 MILES THEN I WAS TOLD THAT'S COMMON WITH THE ESCAPES THE BREAKS DON'T LAST! I FEEL THE BRACES SHOULD BE COVERED UNDER WARRENTY",
        "vin": "1FMCU9GD4JU"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/24/2019",
        "dateOfIncident": "05/24/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209894,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE OPERATING THE VEHICLE AT APPROXIMATELY 70MPH ON THE INTERSTATE I NOTICED THAT ALL INSTRUMENT PANEL LIGHTING, GAUGES, AND DISPLAY SCREENS WENT OUT. THE GAUGE NEEDLES RETURNED TO THEIR 'HOME' POSITIONS. THERE WAS AN ERROR MESSAGE ON THE MAIN TOUCH SCREEN THAT SAID: NETWORK COMMUNICATION FAILURE. WORRIED, I TOOK THE NEXT AVAILABLE EXIT AND FOUND A PARKING LOT TO INVESTIGATE. I IMMEDIATELY TRIED TO SHUT THE ENGINE OFF, FIGURING THAT IF I COMPLETELY SHUT THE CAR DOWN THE SYSTEM WOULD SOMEHOW CORRECT ITSELF AFTER A 'REBOOT' OF THE THE PCM AND BCM. I QUICKLY REALIZED THAT I WAS IN TROUBLE, THE ENGINE WOULD NOT SHUT OFF. THE VEHICLE IS EQUIPPED WITH A 'SMART KEYLESS START SYSTEM' BUT NO MATTER HOW MANY TIMES I WOULD TRY PUSHING THE BUTTON. EVEN THOUGH THE CAR OPERATED PROPERLY AFTER THE SYMPTOMS COMMENCED I FIND IT DOUBTFUL THAT ALL OF THE CAR'S SAFETY FEATURES WOULD HAVE OPERATED AS DESIGNED, IF NEEDED. IF I WOULD HAVE GOTTEN INTO IN ACCIDENT AT THE TIME THE CAR WAS EXPERIENCING  THESE PROBLEMS WOULD THE SAFETY RESTRAINT SYSTEM WORK PROPERLY AND DEPLOY THE APPLICABLE AIR BAGS??? WOULD THE 'AUTO FUEL PUMP SHUTDOWN' DO ITS JOB IF NEEDED??? ALSO, WHAT IF THE VEHICLE CAUGHT FIRE AT THIS TIME AND I COULD NOT SHUT OFF THE CAR??? NOT SAFE!!!",
        "vin": "1FMCU9GD2KU"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/08/2019",
        "dateOfIncident": "04/14/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206220,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 FORD ESCAPE. WHILE DRIVING, THE VEHICLE SUDDENLY SHUT OFF. APPROXIMATELY TWO HOURS LATER, THE VEHICLE RESTARTED AND SHUT OFF AGAIN AFTER THE CONTACT DROVE HOME. THE VEHICLE WAS TOWED TO ISLAND FORD (3698 RT 9 SOUTH OLD, BRIDGE, NJ) AND UNKNOWN PINS WERE TIGHTENED. AFTER RETRIEVING THE VEHICLE AND LATER PARKING IT, THE VEHICLE COULD NOT BE RESTARTED. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 800.",
        "vin": "1FMCU9J98KU"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/08/2019",
        "dateOfIncident": "05/08/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206365,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD MY FORD ESCAPE FOR JUST OVER 30 DAYS. ABOUT TWO WEEKS INTO OWNING IT, I HAD STOPPED BEHIND A VEHICLE. THE START/STOP ENGAGED AND WHEN I WENT TO ACCELERATE AGAIN THE POWER TRAIN FAULT ILLUMINATED. IN ORDER TO MOVE THE VEHICLE, I HAD TO PUT THE VEHICLE IN PARK AND RESTART THE VEHICLE. THIS HAPPENED 3 WEEKS AFTER THE FIRST TIME, AGAIN TODAY. THIS COULD CAUSE MAJOR SAFETY ISSUES IF THE VEHICLE BEHIND YOU DOES NOT STOP IN TIME.",
        "vin": ""
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/23/2019",
        "dateOfIncident": "04/14/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203056,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THE CAR MARCH 20TH BRAND NEW. ON APRIL 14TH I WAS DRIVING IT HOME AND THE ENGINE STOPPED WORKING. ALL WARNING LIGHTS WERE FLASHING AND THE CAR JUST STOPPED WORKING IN THE MIDDLE OF THE ROAD.  I COULD NOT GET IT STARTED AND WHEN I FINALLY DID IT WOULDN'T MOVE AND I COULD NOT SHUT IT OFF. THIS WENT ON FOR 2 AND A HALF HOURS. I FINALLY GOT IT HOME (DRIVEN BY MY HUSBAND) AND THE NEXT MORNING (MONDAY) WE GOT IT TOWED TO FORD DEALER. THE CAR WAS COMPLETELY DEAD MONDAY AND WAS NOT ABLE TO BE DRIVEN ONTO THE FLATBED TRUCK. WE PUT IN A CLAIM TO FORD HEADQUARTERS AND APRIL 22ND FORD INFORMED ME THEY WOULD NOT BUY BACK OR REFUND ME THE MONEY FOR THE CAR. I HAD THE CAR LESS THAN 30 DAYS.  WE WERE NOT GIVEN A REASON FOR THIS MECHANICAL FAILURE. THE SERVICE DEPARTMENT INFORMED US ON FRIDAY (APRIL 19TH) THAT THEY TOUCHED A FUSE BOX\" AND NOW IT IS WORKING. I FEEL THIS IS A VERY UNSAFE CAR FOR ME TO DRIVE. I WAS ON A CITY STREET DRIVING THE CAR WHEN IT STOPPED SUDDENLY AND LOST ALL POWER. I WAS IN MOTION.",
        "vin": "1FMCU9J98KU"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/05/2019",
        "dateOfIncident": "04/03/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194073,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SHUTS OFF WHILE DRIVING. STEPS TO REPRODUCE ISSUE: KEYFOB IS INSIDE VEHICLE IN DRIVERS COAT POCKET, MOBILE PHONE IS INTERMITTENTLY CONNECTED TO VEHICLE VIA USB CORD, VEHICLE IS ON, ENGINE RUNNING, START/STOP IS ON, VEHICLE IS DRIVING THEN STOPS AT A STOPLIGHT, START/STOP ENGAGES AND IDLES ENGINE FOR AT LEAST 15 SECONDS. WHEN FOOT BRAKE IS RELEASED VEHICLE SHUTS OFF, INSTRUMENT CLUSTER, RADIO, INFOTAINMENT, ETC TURN OFF. TO RESTART VEHICLE TRANSMISSION MUST BE PLACED IN NEUTRAL OR PARK AND VEHICLE ON/OFF BUTTON PRESSED. VEHICLE RESTARTS, POWERTRAIN MALFUNCTION ERROR DISPLAYS AND INFOTAINMENT SYSTEM APPEARS TO BE REBOOTING AND DISPLAYS WELCOME MESSAGE SUCH AS BEFORE IT WAS SET UP. VEHICLE WAS IMMEDIATELY BROUGHT TO DEALER; BLACKWELL FORD IN PLYMOUTH MI BOTH TIMES. DEALER COULD NOT REPRODUCE ISSUE OR PULL DETAILED INFORMATION BEYOND GENERAL FAULT. DEALER PERFORMED 1265OD EEC SYSTEM DIAGNOSIS QUICK TEST, 1265OD45 ENGINE MODULE DIAGNOSTIC PIN POINT TEST, 12650DX1 EEC SYSTEM DIAGNOSIS QUICK TEST TWICE, ROAD TESTED, IDS TEST P164C, PPT AA IN PCED MANUAL, RESET KAM AND RETEST PASS, AND UPON REQUEST CHECKED THAT PCM FIRMWARE WAS THE LATEST VERSION. DEALER REQUESTED PERMISSION FOR EXTENDED MILEAGE TESTING WITH SKYTRACKER INSTALLED AFTER 2ND FAULT, PERMISSION WAS GIVEN. ISSUE OCCURS APPROXIMATELY EVERY 30 DAYS DRIVING 2 TRIPS/DAY. ISSUE PRESENTS A HIGH AND SEVERE RISK OF FATAL INCIDENT BECAUSE VEHICLE IS STOPPED AT A GREEN LIGHT AND MAY BE REAR ENDED BY AN APPROACHING VEHICLE AT HIGH SPEED. BECAUSE VEHICLE IS OFF, AIRBAGS AND OTHER SAFETY EQUIPMENT MAY NOT ACTIVATE INCREASING RISK OF FATAL INCIDENT. VEHICLE WAS BOUGHT NEW WITH 10 MILES RECORDED ON ODOMETER IN FEBRUARY OF 2019, AS OF APRIL 2019 THE ISSUE HAS OCCURRED TWICE. ONCE ON FEBRUARY 22ND AND ONCE ON APRIL 3RD.",
        "vin": "1FMCU9J91KU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/07/2019",
        "dateOfIncident": "03/07/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184932,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "SMELL ENTERS PASSENGER CABIN FROM WHAT APPEARS TO BE CATALYTIC EXHAUST FUMES WHILE DRIVING ON HIGHWAY.",
        "vin": "1FMCU0HD0KU"
    }
]