[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/04/2022",
        "dateOfIncident": "02/04/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450476,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Both the driver side and passenger side front struts have leaked oil and failed. The driver side occurred after 33,000 miles and the passenger side at 45,000 miles.",
        "vin": "1FMJK1JT5KE"
    },
    {
        "components": "POWER TRAIN,SEAT BELTS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/28/2022",
        "dateOfIncident": "01/07/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449261,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The ecoboost 3.5 engine has a common issue with the cam phasers. My vehicle has had oil changes done, every 9,000 miles and now needs the cam phasers to be replaces. It has 83,000 miles. I believe this is a known defect that Ford is trying to remedy with customer satisfaction campaigns, rather than a recall. Had the 21b10 tsb performed and which is a requirement and the car shudders and the transmission shifts poorly. Also, the driver's side seat best will not retract fully.",
        "vin": "1fmjk2at9ke"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/25/2022",
        "dateOfIncident": "01/21/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448925,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "My vehicle started jumping gears. It felt like I was manually changed gear.",
        "vin": "1FMJK1KT4KE"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/17/2021",
        "dateOfIncident": "02/04/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440797,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "•Vechicle is a lemon car by definition and needs to be replaced due to safety issues and the amount of calls in the short duration I have had it in my position •My family and I have been leveraging other family vechicle along side putting the car dormant as much as we can to avoid further mechanical issues which is not acceptable •The request to ask for 4 to 6 weeks on a car repair without loaner is unacceptable as the loan payments are still due by me to the lender and are unable to utilize the car in any capacity •The issue has been open for about 10 months since reporting with NO resolution - unacceptable •Dealership purposely delayed and provided incorrect information and allowed the warranty period to expire as it would provide revenue of service to the business (recalls are free)   Please see the attachment for a detailed timeline and supporting documents",
        "vin": "1fmjk1kt6ke"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/25/2021",
        "dateOfIncident": "06/29/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438077,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Ford Expedition. The contact stated a rattling sound was heard coming from the engine compartment after starting the vehicle. The contact stated no warning lights were illuminated. The independent mechanic was called and stated that the failure was related to the cam phaser, which needed replacement. The independent mechanic stated that the part was on backorder. The vehicle was taken to the dealer and the contact was informed of a recall which the vehicle was included in regarding the cam phaser. The contact stated she received notice of the customer satisfaction program for the cam phaser however, the part was on backorder. The contact was advised of a PCM upgrade to correct the issue however, the failure continued. The manufacturer was made aware of the failure and was advised to contact NHTSA for assistance. The customer service representative at Ford looked up the VIN and told the contact to call NHTSA as there was nothing they could do. The failure mileage was 67,000. Local Ford dealer informed consumer this was a recall and they could fix it. Two week later,  consumer got the recall in the mail. But by this time, consumer was well over the 70,000 mile marker, so it was going to cost her a prorated price to get it fixed. I was almost at the 80,000 mile marker by the time it was fixed.",
        "vin": "1FMJK1KT1KE"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/07/2021",
        "dateOfIncident": "10/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435965,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "While trying to open the sunroof a plastic piece broke of from the railing. I tried closing the sunroof but was unable to. I had to have the sunroof closed by a mechanic and now I am unable to use the sunroof.",
        "vin": "1fmjk2at0ke"
    },
    {
        "components": "CHILD SEAT",
        "crash": false,
        "dateComplaintFiled": "08/25/2021",
        "dateOfIncident": "08/23/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430496,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2019",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Kids Embrace",
                "productMake": "KIDSEMBRACE",
                "productModel": "OTHER",
                "productYear": "9999",
                "type": "Child Seat"
            }
        ],
        "summary": "The contact owns a Kidsembrace forward facing car seat, Model Number: 3001MIN, Manufactured Date:  June 18, 2020. The contact stated that the car seat buckle would not latch. Additionally, when the latch was placed into the buckle the latch failed to fasten securely. The failure occurred while attempting to place the car seat inside the vehicle. The baby was not injured. The purchase date was unknown.",
        "vin": "1fmjk1mt2ke"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/09/2021",
        "dateOfIncident": "03/22/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420226,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "On March 22, 2021, check engine light. Took vehicle to Ford dealer. Technician said cam phaser needed to be change. At around 72000 miles. Google search to find out, that is a common problem in the 3.5 eco boost engines. Vehicle was purchased certified used from Elder Ford Tampa, FL with about 33000 miles March 2020. Mall of George Ford, diagnose the check engine light.",
        "vin": "1FMJK1HT6KE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/22/2021",
        "dateOfIncident": "04/22/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413409,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR LIFT GATE RANDOMLY OPENS ON THE VEHICLE. DEALERSHIP HAS SAID IT IS A DEFECTIVE WIRING HARNESS. THE LIFT GATE CLOSE WITH PEOPLE STANDING AT THE REAR BUMPER LOADING ITEMS IN THE BACK AND WILL CONTINUE TO FIGHT TO CONTINUE CLOSING OPERATIONS. IT DOES THE SAME WITH OPENING. ADDITIONALLY IT HAS OPENED WHILE SITTING IN THE DRIVERS SEAT WITH THE KEY IN THE CAR. THE CAR HAS BEEN STATIONARY FOR ALL OPENINGS. THIS HAS HAPPENED ON MULTIPLE OCCASIONS AND",
        "vin": "1FMJK1KT2KE"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/01/2021",
        "dateOfIncident": "04/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406045,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "EVENT OCCURS WHEN VEHICLE  IS WARMED UP - TRANSMISSION FLUID TEMP > 205 AND MORE LIKELY TO OCCUR GOING UPHILL OR ON A SLIGHT INCLINE ON HIGHWAY WITH A SPEED ABOVE 55 MPH.    WHEN ACCELERATING QUICKLY OR AGGRESSIVELY, THE 10 SPEED TRANSMISSION FAILS.  I PUSH DOWN ON THE GAS PEDAL WHILE IN THE 10 GEAR.    IT SEEMS LIKE IT IS STUCK IN NEUTRAL, THE ENGINE REV'S TO THE RED LINE IF I LEAVE MY FOOT ON THE PEDAL, THE VEHICLE LOOSES SPEED AND EVENTUALLY FINDS A GEAR BETWEEN 2 AND 6 AND TRANSMISSION RE-ENGAGES.    THE VEHICLE WILL REV TO THE RED LINE BEFORE FINDING A GEAR.  THIS HAS CREATED MULTIPLE DANGEROUS SITUATIONS IN WHICH A VEHICULAR ACCIDENT ALMOST OCCURRED DUE TO THE IMMEDIATE LOSS OF SPEED IN HIGHWAY TRAFFIC SITUATIONS.  THE VEHICLE WENT FROM 83 MPH TO 55 IN SECONDS BEFORE THE TRANSMISSION RE-ENGAGES.    I HAVE TAKE THE CAR TO THE DEALERSHIP TWICE AND THEY CAN NOT RECREATE THE ISSUE IN ORDER TO FIX DESPITE SUBMITTING NUMEROUS VIDEOS OF THE SEPARATE TIMES IN WHICH THE EVENT OCCURS.   VIDEOS ON 2/3/2021, 2/11/2021, 4/1/2021",
        "vin": "1FMJK1MTXKE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "03/24/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404682,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS PLACED IN PARK, SHUT OFF, AND EXITED.  VEHICLE WAS PARKED ON A HILL.  SEVERAL MINUTES LATER VEHICLE STARTED ROLLING DOWN A HILL; NARROWLY MISSING A YOUNG GIRL.  VEHICLE CAME TO REST ON ITS OWN WITHOUT SUSTAINING DAMAGE.  VEHICLE SHOULD NOT HAVE BEEN ABLE TO MOVE WHILE IN PARK AND SHUT OFF.",
        "vin": "1FMJU1JT3KE"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "12/15/2020",
        "dateOfIncident": "12/15/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11382701,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 FORD EXPEDITION. CONSUMER WRITES IN REGARDS TO VEHICLES WITH LANE KEEPING SYSTEM FEATURE. *LD    THE CONSUMER STATED THE VEHICLE NEEDS TO BE ADJUSTED, WHILE TOWING, DUE TO OUTSIDE INFLUENCES SUCH AS WIND, BUMPS, AND STEEP HILLS. *JS",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/25/2020",
        "dateOfIncident": "11/16/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376300,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AT APPROXIMATELY 13K MILES BEGAN EXPERIENCING A STUTTERING OR UNSTEADY ACCELERATION THROUGH 3RD, 4TH, AND 5TH GEARS.  DEALER PERFORMED A FACTORY RESET ON VEHICLE CPU AND ADVISED 2K MILES OF LEARNING WERE REQUIRED.  NOW AT 19K MILES, UNSTEADY ACCELERATION THROUGH SAME GEARS IS ACCOMPANIED BY A VIBRATION AND GRUMBLING NOISE.  THIS NOISE HAS BECOME STEADILY MORE PRONOUNCED AND THE UNSTEADY ACCELERATION IS WORSE.",
        "vin": "1FMJK2AT3KE"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/24/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376121,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD IS AWARE OF A DESIGN DEFECT THAT CAUSES THE VCT SYSTEM TO WEAR OUT WITHIN A SHORT AMOUNT OF TIME IN BRAND NEW EXPEDITIONS. WHEN THE VCT SYSTEM WEARS OUT, THE VEHICLE IMMEDIATELY TRANSITIONS INTO \"LIMP MODE\" , WHICH CAUSES THE VEHICLE TO IMMEDIATELY (UNSAFELY) DECELERATE TO A SPEED OF 15MPH (OR LESS ON HILLS), CREATING DANGEROUS SITUATIONS, PARTICULARLY ON HIGHWAYS AND WHEN TOWING.    WE PURCHASED OUR EXPEDITION IN MARCH 2019, BRAND NEW.  WE PURCHASED THE VEHICLE WITH THE HEAVY DUTY TOW PACKAGE, WHICH PROVIDES TOWING UP TO 9,300LBS.  WITHIN A FEW MONTHS, THE VEHICLE BEGAN MAKING A LOUD RATTLE AT START UP, LASTING A FEW SECONDS. WE DILIGENTLY SERVICED THE VEHICLE ONLY AT FORD DEALERSHIPS, WHO ROUTINELY SAID THE RATTLE WAS \"FINE\" OR \"WITHIN SPEC.\"     ON 9/1/2020, WHILE TOWING OUR AIRSTREAM TRAILER (~7,000 LBS) ON INTERSTATE HIGHWAY 86 THROUGH WINDSOR, NY, THE VEHICLE THREW ON THE \"WRENCH LIGHT\" AND RAPIDLY DECELERATED FROM 55MPH TO 10MPH. WE WERE AT THE BOTTOM OF A LONG INCLINE, IN MODERATELY HEAVY TRAFFIC (65MPH). THERE WAS AN INSUFFICIENT SHOULDER TO STOP WITH OUR TRAILER, SO WE VERY SLOWLY CREPT FOR MILES TO THE NEAREST EXIT.  THE CLOSEST FORD DEALERSHIPS REFUSED TO LOOK AT IT. IT WAS EVENTUALLY TOWED TO ONEONTA FORD.  DESPITE KNOWING OF TSB 20-2315 (AND ITS PREDECESSORS), FORD CLAIMED THAT THE VEHICLE WAS \"FINE\" AND LIKELY JUST SUFFERED A BAD OIL CHANGE.  AFTER SPENDING 12 DAYS WITH OUR VEHICLE, THEY RETURNED IT, PERFORMING ONLY AN OIL CHANGE. THE RATTLE REMAINED AND FORD CLAIMED THERE WAS NOTHING THEY COULD DO.     ON 10/9/2020, THE VERY NEXT TIME WE ATTEMPTED TO TOW, ON COUNTY HIGHWAY 2, THE VEHICLE AGAIN, ABRUPTLY WENT FROM 55 TO10MPH ON A LONG, SLOW INCLINE IN MODERATE TRAFFIC.  WE TURNED AROUND (WITH THE TRAILER) ON A 2 LANE ROAD. THE VEHICLE WAS TOWED BACK TO FORD, WHO RELUCTANTLY (AFTER WEEKS) REPLACED THE VCT SYSTEM PER TSB 20-2315.",
        "vin": "1FMJU1JT9KE"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/23/2020",
        "dateOfIncident": "09/19/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360793,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING WITH FAMILY APPROXIMATELY 80 MILES FROM OUR HOME VEHICLE LOST ENGINE POWER AND DROPPED FROM 75 TO ABOUT 55, EXPEDITION THEN STARTED TO HAVE TROUBLE SHIFTING AND COULD NOT PASS 60 MPH.  WE WERE TRAVELING UPHILL ON FREEWAY AND HAD DRIVE MODE IN ECO ONCE WE STARTED HAVING ISSUES WRENCH CHECK ENGINE LIGHT AND THE DISPLAY NOTIFIED ME THAT DRIVE MODE UNAVAILABLE. ONCE WE PULLED OFF THE FREEWAY TRANSMISSION HAD TROUBLE SWITCHING FROM 3RD TO ABOUT 5TH, I WAS ABLE TO SHIFT GEARS BY RELEASING GAS PEDAL AND PRESSING GAS PEDAL AGAIN.  WAS ABLE TO GET SUV BACK HOME  FOLLOWING DAY ALL LIGHTS WERE CLEAR BUT STILL TOOK IT INTO DEALERSHIP, THE DEALERSHIP IS STILL TROUBLE SHOOTING ISSUE BUT THIS SEEMS TO BE THE SECOND SUV TO DO HAVE THIS KIND OF PROBLEM.",
        "vin": "1FMJK1JT7KE"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/14/2020",
        "dateOfIncident": "01/22/2020",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349146,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CAUGHT FIRE AFTER USING FACTORY INSTALLED REMOTE STARTER. A FEW DAYS PRIOR TO THE FIRE, THE CRUISE CONTROL STOPPED WORKING, AFTER THE CRUISE CONTROL STOPPED WORKING, WE RECEIVED TWO WARNING LIGHTS ON THE DASH DISPLAY, SERVICE ADVANCE TRAC AND HILL DECENT CONTROL FAULT. I TOOK PHOTOS OF THE DASH WARNING AND ATTEMPTED TO SCHEDULE A SERVICE APPOINTMENT WITH THE DEALERSHIP, HOWEVER THE FIRE OCCURRED BEFORE WE COULD GET IT SERVICED. FORD SENT THEIR FIRE INVESTIGATORS TO INSPECT VEHICLE, BUT WE NEVER RECEIVED ANY EXPLANATION FOR THE CAUSE OF THE FIRE OR A COPY OF THEIR FINDINGS. THE FIRE NOT ONLY DESTROYED THE EXPEDITION, BUT ALSO CAUGHT OUR ATTACHED GARAGE ON FIRE, WHICH CAUSED US TO ALSO LOOSE ANOTHER VEHICLE ALONG WITH THE MAJORITY OF OUR HOUSE HOLD CONTENTS. THIS FIRE OCCURRED ON AN EARLY MORNING WHILE MOST OF  OUR FAMILY WAS SLEEPING. WE COULD HAVE BEEN KILLED! IN ADDITION TO THE PHOTOS ATTACHED, I ALSO TOOK A BRIEF VIDEO OF THE FIRE AS THE FIRE DEPARTMENT WAS ARRIVING ON SCENE.",
        "vin": "1FMJK1JT8KE"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/17/2020",
        "dateOfIncident": "07/17/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339889,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FOLLOWED SEMI INTO DEALER SERVICE PARKING LOT.  SEMI TURNED LEFT SO MOVED FORWARD TO JOIN LINE OF CARS INTO SERVICE BAY. WHILE COMING TO STOP, SEMI ON LEFT BACKED UP AND COMING RIGHT FOR ME.  AT MY STOPPING, AUTO ENGINE SHUT OFF TURNED OFF ENGINE AS WAS TRYING TO SHIFT TO REVERSE.  BY TIME ENGINE TURNED BACK ON, ACKNOWLEDGED REVERSE, ENGAGED REVERSE, RESPONDED TO ACCELERATOR BEING PUSHED, GEAR ENGAGED, THE TRUCK WAS ABOUT TO HIT ME AS DRIVER DID NOT SEE ME.  LUCKILY DRIVER NOTICED AND SLAMMED ON BRAKES.  BY THIS TIME, VEHICLE WAS STILL TRYING TO MOVE SO IF TRUCK DID NOT STOP, I WOULD HAVE BEEN HIT.    AUTO STOP OF ENGINE IS A DANGEROUS FEATURE.  WHILE MAY WORK AT A TRAFFIC LIGHT, IN A SITUATION REQUIRING QUICK RESPONSE, TOO MANY STEPS TO TURN VEHICLE ON AND ENGAGE A CHANGE OF DIRECTION.  FORD HAS A FEATURE TO TURN OFF MANUALLY, BUT SHOULD BE ALLOWED TO TURN OFF ALL THE TIME.  IF VEHICLE SHUTS DOWN IN EMERGENCY SITUATION AS THIS, A PERSON COULD BE KILLED.    THIS EVENT WAS VIEWED BY SEVERAL PEOPLE AND ALL I COULD SAY WAS COULD NOT MOVE AS VEHICLE DID NOT RESPOND QUICKLY ENOUGH.  EMISSIONS ARE NOT MORE IMPORTANT TO PEOPLE'S LIVES AND THIS FEATURE NEEDS TO BE REMOVED OR ALLOWED TO BE OVERRIDDEN.",
        "vin": "1FMJK1MT7KE"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/05/2020",
        "dateOfIncident": "03/03/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316215,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS BOUGHT NEW FROM A DEALERSHIP MID DECEMBER, DUE TO SECOND SET OF TWINS DUE MID MARCH.  ATTEMPTED TO HAVE GRACO 4EVER CHILD CAR SEATS INSTALLED BY SAFE KIDS (ORGANIZATION TO KEEP KIDS SAFE) BUT INSPECTION FAILED DUE TO 3RD ROW SEATING HEADREST ENGINEERING DESIGN MAJOR DEFECT.  3RD ROW ELECTRIC FOLD DOWN SEATS DO NOT ALLOW FOR HEADREST REMOVAL EXCEPT FOR THE MIDDLE SEAT LEAVING EXCESSIVE SPACE BETWEEN SEAT AND BACK OF FORWARD FACING CAR SEAT MAKING IT UNSAFE AS THERE IS NO CONTACT BETWEEN SEAT AND CAR SEAT.  CORPORATE FORD WAS CONTACTED BY PHONE 5X REGARDING THIS ISSUE AND THEY ARE UNABLE TO HELP IN THIS SITUATION AS SEATS ARE \"FUNCTIONING NORMALLY\" PER MANUFACTURER SPECIFICATIONS.  WITH LESS THAN 3 WKS BEFORE THE DUE DATE APPROACHING, WE SCRAMBLED AND BROUGHT THE VEHICLE TO THE LOCAL DEALERSHIP IN WHICH THEY INDICATED IT IS ILLEGAL FOR AN ADULT TO RIDE IN A VEHICLE WITHOUT A HEADREST AND THEY WERE SHOCKED IN THE POOR DESIGN. FORD NEEDS THEIR ENGINEERING TEAM TO IMMEDIATELY RESOLVE THIS ISSUE, AS ANOTHER COMPLAINT WAS FILED WITH NHTSA IN JANUARY REGARDING THIS SAME ISSUE.  THEY NEED TO COVER THE COST TO HAVE DEALERSHIP REMOVE THE HEADRESTS MANUALLY ($600 ESTIMATE) BY TEARING APART THE SEATS OR HAVE A LIST OF FORWARD FACING CAR SEATS THAT ACTUALLY WORK FOR THE 3RD ROW IN WHICH THE COST TO US WOULD PROBABLY BE A WASH FOR NEW SEATS IF THERE ARE ANY THAT WORK FOR IT!  THIS IS NOT A FAMILY VEHICLE FOR ANYONE STILL IN CAR SEATS OR BOOSTERS AND THERE IS NO WAY I WOULD HAVE PURCHASED THIS VEHICLE KNOWING THIS AHEAD OF TIME BY READING A PREVIOUS COMPLAINT ON THE MATTER.  $80K VEHICLE THAT SEATS A FAMILY OF 5 WITH TODDLERS NOT 6 OR GREATER.",
        "vin": "1FMJK2AT9KE"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/12/2020",
        "dateOfIncident": "01/09/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298891,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CHILD IN A CAR SEAT IN SECOND ROW CAPTAIN'S CHAIR. CHILD WAS ABLE TO HIT BUTTON THAT COLLAPSES SEAT FORWARD - ALL WHILE THE CAR WAS MOVING (ON A HIGHWAY AT 65 MPH) AND CHILD WAS IN CAR SEAT IN SEAT. THIS IS EXTREMELY DANGEROUS. SEE PICTURES. PEOPLE BUY LARGE VEHICLES LIKE EXPEDITIONS MAINLY BECAUSE OF USE WITH CHILDREN. AS SOON AS THAT BUTTON IS HIT, THE SEAT COLLAPSES AND THE CAR SEAT BELT PLACES ENORMOUS PRESSURE ON  A CHILD. I WOULD HATE TO IMAGINE WHAT WOULD HAPPEN IF THE SEAT WAS RELEASED AND A CAR ACCIDENT OCCURRED AT THE SAME TIME. I HAVE ALREADY CONTACTED FORD TO MAKE A COMPLAINT BUT WANTED TO RAISE THE ISSUE HERE AS WELL. PLEASE INVESTIGATE. I CONTACTED MY DEALERSHIP AND THEY CONFIRMED THE SAME THING HAPPENED IN A EXPEDITION MODEL STILL ON THE LOT. THIS IS NOT A SINGLE CAR ISSUE. EVERY 2019 EXPEDITION WITH CAPTAIN'S CHAIRS IS LIKELY TO HAVE THE SAME ISSUE.",
        "vin": "1FMJK1KT7KE"
    },
    {
        "components": "SEATS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/09/2020",
        "dateOfIncident": "01/09/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298113,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS MODEL OF FORD EXPEDITION ADVERTISES THAT INFANT CAR SEATS, CONVERTIBLE CAR SEATS, BOOSTER SEATS, AND HIGH BACK BOOSTER SEATS COULD BE ACCOMMODATED IN 4 OF THEIR SEATS.  HOWEVER, THE THIRD ROW HAS AUTOMATIC SEAT FOLDING AND HEADREST FOLDING FEATURES WHICH MAKE IT IMPOSSIBLE TO REMOVE THE THIRD ROW HEADRESTS.  WHEN PLACING A HIGH BACK BOOSTER SEAT IN ONE OF THE THIRD ROWS, THE SEAT DOES NOT SIT FLUSH IN ACCORDANCE WITH THE CAR SEAT INSTRUCTIONS BECAUSE THE HEADREST IS NOT FLUSH WITH THE SEAT.  SINCE YOU CANNOT REMOVE THE HEADREST, THERE IS NO POSSIBLE WAY TO SAFELY INSTALL THIS PARTICULAR TYPE OF CAR SEAT.  IN MY CONVERSATION WITH FORD THEY ARE NOW AWARE OF THE PROBLEM, BUT ARE UNWILLING TO MAKE ANY CHANGES OR PURCHASE THE CAR BACK.  I PURCHASED THE CAR 3 MONTHS AGO IN ANTICIPATION OF HAVING A 3RD CHILD.  IT IS REQUIRED THAT I PUT A HIGH BACK BOOSTER SEAT SAFELY IN THE 3RD ROW TO ACCOMMODATE MY CHILDREN, YET I CANNOT DO THAT SAFELY.  I AM TAKING THE CAR WITH THE SEAT TO THE POLICE STATION TOMORROW TO SEE IF THEY CAN PUT IN WRITING THAT THERE IS NO WAY TO SAFELY INSTALL THE SEAT.",
        "vin": "1FMJU2AT3KE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/08/2020",
        "dateOfIncident": "01/04/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297842,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR FIXED VISTA ROOF PANEL EXPLODED OUTWARD WITH A VERY LOUD - SHOTGUN LIKE - BANG, LEAVING A LARGE HOLE AND A VERY DANGEROUS SHATTERED REMAINING PANEL THAT COULD FALL AND INJURE OCCUPANTS, THE PANEL IS MADE OF TOUGHENED GLASS AS OPPOSED TO BEING LAMINATED AS THE FRONT WINDSHIELD IS.    THE INCIDENT OCCURRED ON A FAIRLY QUIET FREEWAY, NO CARS IN FRONT AND NOT UNDER A BRIDGE ETC.",
        "vin": "1FMJU1MT8KE"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/04/2019",
        "dateOfIncident": "11/11/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286983,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 EXPEDITION 10 SPEED TRANSMISSION LOCKED UP AFTER 2 HOURS OF \"FREE WHEELING\" BEHIND MY MOTORHOME. WHILE APPROACHING (NO TURNING YET) TO PARKING AREA ABOUT 3 TO 5 MPH SUDDENTLY CAR JUST LOCKED REAR WHEELS UP. WHEN CAR WAS STARTED UP THERE WERE GRINDING SOUND COMING OUT OF TRANSMISSION. SINCE UNABLE TO UNLOCK OR \"FREE\" THE TRANSMISSION CAR WAS SENT TO LOCAL DEALERSHIP MORE THAN 400 MILES FROM HOME. FORD DEALER INSTALLED A NEW 10-SPEED TRANSMISSION.    WEEK LATER I ATTEMPTED TO PICK UP THE CAR, BUT AFTER AN HOUR OF DRIVING LIGHT COLOR SMOKE CAME BEHIND THE VEHICLE. CAR WAS HAULED BACK TO SAME DEALERSHIP FOR FURTER SERVICE. NO REAL REASON GIVEN WHY ALL THESE HAPPENED. ... DO I HAVE A \"LEMON\", VEHICLE HAS ONLY ABOUT 8000 MILES.",
        "vin": "1FMJU2AT2KE"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/26/2019",
        "dateOfIncident": "05/14/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258449,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "1 . AFTER A LEFT TURN THE VEHICLE CONTINUES TO PULL LEFT (MEASURED AT ABOUT 4 POUNDS OF FORCE ON THE STEERING WHEEL TO HOLD STRAIGHT) UNTIL A RIGHT TURN IS MADE TO CANCEL THE LEFT PULL THEN IT TRACKS STRAIGHT.  THERE WERE SIMILAR RESULTS ON RIGHT TURNS BUT WORSE ON LEFTS.  2 . THESE TESTS WERE ALSO DONE ON ANOTHER NEW FORD PLATINUM EXPEDITION IDENTICALLY EQUIPPED WITH THE SAME RESULTS (BOTH WITH HEAVY DUTY TOW PACKAGE)  3 . THE NEW EXPEDITION ABOVE DID SEEM TO REQUIRE A LITTLE LESS RIGHT CORRECTIVE PRESSURE THAN OUR EXPEDITION BUT THE LEFT PULL WAS APPROXIMATELY THE SAME  4 . THESE TESTS WERE DONE WITH AND WITHOUT LANE KEEPING WITH NO CHANGE TO THE RESULTS   5 . THESE TESTS WERE DONE WITH AND WITHOUT SWAY CONTROL WITH NO CHANGE TO THE RESULTS  6 . APPROXIMATE TRAILER WEIGHT 6000 LBS. AND APPROXIMATELY 600 LBS. TONGUE WEIGHT  7 . DURING THE LEFT PULL THE VEHICLE WILL 'BLOW' THROUGH THE LANE KEEPER ON THE LEFT BUT WORKS OK ON THE RIGHT  8. TESTS WERE ALSO MADE WITH A TOTALLY DIFFERENT TRAILER AND HITCH SYSTEM WITH THE SAME PROBLEM.  9. THE TESTS WERE DONE WITH AND WITHOUT LOAD TRANSFER BARS.  THE LEFT PULL REMAINED AFTER A LEFT TURN BUT WAS A BIT LESS WITHOUT THE LOAD TRANSFER BARS ATTACHED (THAT WAS SURPRISING).  10. FORD HAS REPLACED THE ENTIRE STEERING SYSTEM (INCLUDING RACK AND PINION UNIT WITH STEERING CONTROL MODULE AND YAW SENSE MODULE) AFTER THEY CHECKED ALL WHEEL ALIGNMENTS WITH NO IMPROVEMENT IN STEERING PROBLEM.  11. THIS PROBLEM ALSO HAPPENS WITH NO TRAILER IN TOW JUST NOT TO THE SAME EXTENT.  12. FORD HAS NOW REFUSED TO DO ANYTHING MORE TO RESOLVE THE STEERING PROBLEM.  NOTE: I DO HAVE VIDEO FOR THIS PROBLEM ON THE ROAD.",
        "vin": "1FMJU1MT3KE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/20/2019",
        "dateOfIncident": "09/19/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256905,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAILER BRAKES DO NOT WORK BELOW 11 MPH. MANUAL STATES BRAKING FORCE IS REDUCED. TESTS BY OWNER AND DEALER ON 3 DIFFERENT TRAILERS AND AN EMULATOR SHOW THAT TRAILER BRAKES ARE EFFECTIVELY DISABLED BELOW 11 MPH. THIS IS A MASSIVE SAFETY ISSUE. WE NARROWLY AVOIDED AN ACCIDENT DRIVING DROWN A GRAVEL ROAD, COULD NOT STOP, TRAILER PUSHED US UNTIL TRAILER BRAKES WERE MANUALLY ENGAGED. FORD CORP STATED TO DEALERSHIP THAT THIS IS \"NORMAL FOR THIS VEHICLE\". SEE ATTACHED IMAGE.",
        "vin": "1FMJU1JTXKE"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/31/2019",
        "dateOfIncident": "07/31/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245737,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "PROJECTOR HALOGEN HEADLIGHTS ARE UNSAFE AND DANGEROUS, UNABLE TO SEE ADEQUATELY AT NIGHT. LIGHT OUTPUT IS EXTREMELY POOR, LIGHTING COLOR IS VERY YELLOW AND BEAM PROJECTION IS NOT FAR ENOUGH TO SEE AT ANY SPEED ABOVE 40MPH. UNABLE TO PROPERLY SEE STREET SIGNS OR OBJECTS ON EITHER SIDE OF VEHICLE THAT MAY CROSS IN PATH. TESTED MULTIPLE TIMES WITH ALL HEADLIGHTS ON INCLUDING LOWER FOG DRIVING LIGHTS. CHECKED ADJUSTMENT(DIRECTION) AND HEIGHT AND DID NOT IMPROVE VISIBILITY. WIFE IS AFRAID TO DRIVE AT NIGHT, LOSE OF USE OF VEHICLE AT NIGHT DUE TO UNSAFE DRIVING CONDITIONS.",
        "vin": "1FMJK1JT9KE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/23/2019",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11221981,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE IS EQUIPPED WITH AN AUTOMATIC LIFTGATE ACTIVATED BY MOTION DETECTED UNDER THE REAR BUMPER. THREE WEEKS AGO, I WAS LOADING ITEMS INTO THE BACK OF THE VEHICLE. THE VEHICLE WAS PARKED AND OFF WITH THE PARKING BRAKE ON. MY CHILDREN WERE BUCKLING UP IN THE VEHICLE. WHILE I WAS LOADING THE LAST ITEM FROM THE BOTTOM OF THE CART, THE LIFT GATE UNEXPECTED STARTED DESCENDING. I DIDN'T HEAR THE WARNING CHIMES AND STARTED STANDING UP WITH THE ITEM. BY THAT POINT, THE GATE WAS OVER HALFWAY DOWN AND STRUCK BE JUST BELOW THE OCCIPITAL PROMINENCE OF THE SKULL. THIS RESULTED IN A CONCUSSION AND SEVERAL MISSED DAYS OF WORK.",
        "vin": "1FMJU1MTXKE"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/20/2019",
        "dateOfIncident": "06/19/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221380,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT FUEL TANK STRAP BOLT CAME OUT CAUSING THE FUEL TANK TO DROP FROM THE VEHICLE. THE DEALER FOUND ZERO DAMAGE OR ANY REASON FOR THE FAILURE. THE SERVICE WRITER TELLS ME THE PROBABLE CAUSE WAS AN ASSEMBLY LINE ISSUE WHERE THE BOLT WAS NOT TIGHT ENOUGH.",
        "vin": "1FMUJ2AT3KE"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/19/2019",
        "dateOfIncident": "03/28/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11202582,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE AND I WERE MAKING A LEFT TURN AT AN INTERSECTION WHEN THE VEHICLE STALLED IN THE INTERSECTION WHILE MAKING THE TURN. AN ALERT APPEARED ON THE DASHBOARD \"ANTI-COLLISION ALERT\" FLASHED ON THE DASH AND DISAPPEARED. THEN ANOTHER MESSAGE APPEARED \"DRIVE MODE NOT AVAILABLE\".  AN ORANGE WRENCH INDICATOR LIGHT LIT AT THE BOTTOM OF DASHBOARD NEXT TO THE ODOMETER.  THE VEHICLE WAS NOT SHIFTING CORRECTLY AND AS WE DROVE FURTHER, THE CAR SHIFTED THROUGH THE GEARS SLOWLY AND SLOWLY AND GRADUALLY. WE DROVE THE VEHICLE STRAIGHT TO THE BELL FORD DEALERSHIP IN PHOENIX.  WE DROPPED THE VEHICLE OFF AT THE DEALERSHIP.  THE DEALERSHIP SERVICE DEPARTMENT CALLED ME THE NEXT DAY AND SAID THEY COULD NOT FIND ANYTHING WRONG WITH THE VEHICLE. I HAD DESCRIBED WHAT HAPPENED TO US, BUT THEY SAID NOTHING WAS RECORDED IN THE VEHICLE DIAGNOSTIC SYSTEM OR BLACK BOX. WE HAVE HAD THE VEHICLE AT THE DEALERSHIP FOR OVER 3 WEEKS NOW AND THEY HAVE HAD THEIR MECHANIC DRIVING THE VEHICLE AND SAID THEY ARE UNABLE TO REPLICATE THE ISSUE.  WE DO NOT FEEL SAFE IN THE VEHICLE NOW. WE ARE NOT SURE WHAT TO DO NOW AS THE DEALERSHIP SAYS IT IS NOT ELIGIBLE UNDER THE LEMON LAW FOR A BUYBACK.",
        "vin": "1FMJU2AT3KE"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/15/2019",
        "dateOfIncident": "04/09/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196576,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS HAVE POOR VISIBILITY DURING LOW LIGHT. OEM HALOGEN LIGHTS INSTALLED",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/17/2019",
        "dateOfIncident": "02/06/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180648,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FACTORY OEM HEADLIGHTS INCLUDING HI-BEAMS, LOW-BEAMS, DRLS AND FOG LIGHTS ARE OUTDATED AND TOTALLY INFERIOR TO CURRENT LED/HID HEADLIGHTS.   VISIBILITY IS NOT UP TO PAR WHATSOEVER.  DEFINITE SAFETY HAZARD.  VERY DISAPPOINTED.   THIS CAR SHOULD HAVE STANDARD LED DAYLIGHT RUNNING STRIPS, HIGH-BEAMS, LOW BEAMS, AND FOG LIGHTS.   FORD SHOULD UPDATE THIS ON ALL 2018 AND NEWER EXPEDITIONS",
        "vin": "1FMJU1HT2KE"
    }
]