[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/20/2021",
        "dateOfIncident": "12/07/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444411,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving at approximately 40-50 mph and the front end and steering wheel shook violently… had to come to a complete stop to make it stop to regain control of the vehicle on an interstate!",
        "vin": "1FD7W3B64KE"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/26/2021",
        "dateOfIncident": "11/26/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441780,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Death Wobble is a consistent problem, tried changing the steering damper several times, the actual  problem is in the linkage and suspension. Truck was shaking so violently I almost killed someone on the highway. Ford is aware of this problem and has taken no action.",
        "vin": "1FD8X3H69KE"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/06/2020",
        "dateOfIncident": "12/05/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378061,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING THE VEHICLE AT HIGHWAY SPEED ANY BUMPS IN THE ROAD CAUSE THE STEERING WHEEL TO SHAKE AND THE FRONT WHEELS TO HOP. FEELS LIKE THE TRUCK IS OUT OF CONTROL UNTIL I SLOW DOWN.   TRUCK IS BRAND NEW AND THIS HAPPENED SEVERAL TIMES DRIVING IT HOME FROM VIRGINIA TO CONNECTICUT.",
        "vin": "1FDBF3B65KE"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/22/2020",
        "dateOfIncident": "06/02/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330086,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE VIOLENTLY SHAKES AFTER HITTING A GROOVED SURFACE OR A SMALL BUMP IN THE ROAD.  THE SHAKING TAKES A GREAT DEAL OF POWER TO BRING THE VEHICLE BACK UNDER CONTROL.  *TR",
        "vin": "1FD8W3FT3KE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/25/2019",
        "dateOfIncident": "07/24/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234684,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "LESS THAN 500 MILES ON A F350 SUPERDUTY WITH AN 8' BED. DRIVING WITH A SMALL BOAT IN THE BACK PROPPED UP ON THE BACK OF THE TAILGATE.  TAKING A LEFT ON A GREEN LIGHT IN THE CITY GOING ~15MPH THE TAILGATE OPENED ON ITS OWN AND THE BOAT ALMOST SLID OUT OF THE TRUCK.  DID NOT PRESS THE FOB AS IT WAS IN THE CUPHOLDER -- DID NOT PRESS THE BUTTON INSIDE ABOVE THE PARKING BRAKE BECAUSE I HAD BOTH HANDS ON THE STEERING WHEEL TO MAKE THE TURN.  ALMOST LOST THE BOAT AS I HAD IT TIED WHILE PROPPED ON TAILGATE, THE STRAPS CAME LOOSE SINCE THE BOAT FELL 2 FEED.  DID NOT CALL THE DEALER YET AND I PURCHASED THIS TRUCK 7 DAYS AGO.  I WANT TO REPORT THIS BECAUSE THIS STILL APPEARS TO BE A PROBLEM ON THE 2019 MODELS.",
        "vin": "1FT8W3BT4KE"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/01/2019",
        "dateOfIncident": "06/30/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11228785,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2019 FORD F-350 SD. THE CONTACT STATED THAT WHILE DRIVING AT 55 MPH, THE CONTACT FELL ASLEEP BEHIND THE WHEEL CAUSING THE VEHICLE TO HIT A CURB, WENT OVER A HILL AND INTO THE GROUND, CAUSING THE VEHICLE TO ROLL OVER 2 TIMES. NO AIRS BAGS DEPLOYED. THE PASSENGER SUSTAINED A FRACTURED RIGHT FOOT, BRUISED SHOULDERS AND PELVIC BONE. THE CONTACT SUSTAINED MINOR INJURIES TO HIS CHEST. THERE WAS A POLICE REPORT FILED. THE PASSENGER WAS TAKEN TO ST. JAMES MEDICAL CENTER WHERE SHE WAS TRANSFERRED TO MANKATO CLINIC WICKERSHAM HEALTH CAMPUS CLINIC HEALTH SYSTEM WHERE THEY ARE CURRENTLY UNDER MEDICAL CARE. THE VEHICLE WAS TOWED BY THE POLICE TO A LOT WHERE THE DAMAGES WERE UNKNOWN. THE FAILURE MILEAGE WAS 5,000. *BF  CONSUMER STATED BLACK BOX ONLY RECORDS 3 INCIDENTS AND STARTS AGAIN.*JB",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/16/2019",
        "dateOfIncident": "01/14/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170314,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK DOOR LOCKS TO NOT OPERATE IN COLD WEATHER.  ADDITIONALLY DOOR WILL NOT LATCH SHUT.  FOUND THIS OUT WHEN DRIVING AROUND A BEND IN THE ROAD AND MY REAR PASSENGER SIDE DOOR FLEW OPEN.  THANKFULLY THERE WAS NO PASSENGER AS THEY COULD HAVE BEEN FLOWN OUT OF THE TRUCK.  THIS IS KNOWN PROBLEM WITH THESE FORD TRUCKS.  REFER TO FSA 18N03 WHICH IS A FIELD SERVICE ACTION BULLETIN.  WHY THEY ARE NOT RECALLING THESE VEHICLES IS A MYSTERY TO ME.  THIS IS A HUGE SAFETY ISSUE.  I HAVE MADE AN APPOINTMENT WITH THE DEALER THAT I BOUGHT THE VEHICLE FROM.  THEY TELL ME THAT A TECHNICIAN NEEDS TO TAKE EACH DOOR APART AND APPLY SEALANTS AND LUBRICATION TO THE PARTS.  IN SEARCHING OUT THIS PROBLEM ON THE INTERNET, OTHER OWNERS WHO ARE ALSO EXPERIENCING THIS PROBLEM HAVE COMPLAINED THAT THE DEALER FIX DOES NOT WORK..THAT THE PROBLEM REOCCURS.  I'M VERY CONCERNED THAT THIS PROBLEM IS NOT BEING ADDRESSED BY THE MANUFACTURER.  I PAID OVER 80K FOR THIS TRUCK AND I'M DRIVING AROUND IN A SAFETY HAZARD.",
        "vin": "1FT8W3BT0KE"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/17/2018",
        "dateOfIncident": "09/17/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152129,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CONTINENTAL CONTITRAC TIRES. EXCESSIVE VEHICLE VIBRATION AT HIGHWAY SPEEDS DUE TO SEPARATION THE TREAD PLIES AND POOR TIRE MOLDING TECHNIQUES. HAD SAME PROBLEM WITH MY LAST VEHICLE WHICH HAD THE SAME TIRES ON IT. SIZE ON BOTH VEHICLES WAS LT275/65R18. I FEEL CONTINENTAL TIRES SHOULD BE RECALLED FOR THIS ISSUE AND BANNED FROM SELLING TIRES IN THIS COUNTRY *DT *JB",
        "vin": "1FT8W3BT0KE"
    }
]