[
    {
        "components": "UNKNOWN OR OTHER,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "03/25/2022",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458347,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "This entire vehicle is a problem, including my backup camera needing to be replaced 2x since Oct. My work van does not have a rearview mirror or window so its crucial I'm a sole proprietor business owner and my only business vehicle (2019 Ford transit connect) has been in the shop a total of over 10 weeks in the last 10 months. I have had numerous problems with my vehicle including my back up camera not working (which is very important since I don't have a rear view mirror or back windows), Ford pass not working, AC blowing heat, transmission problems, check engine light on, vehicle stalling, and emissions problem. So far in 2022, it has spent over 3 weeks in the shop and is currently in the shop. I have had 3 different computer modules, EGR valve, torque converter, and backup camera replaced and I was just told today it needs another back-up camera and the heater control module replaced.  I bought my vehicle brand new from Village Ford (now Gary Yeoman) in 2019 and it currently has 38,000 miles on it. The regular warranty ended at 36k miles, but Ford corporate purchased me an extended warranty covering my vehicle to 75k miles due to the vehicle spending an entire month in the shop Nov 2021. I have called and emailed Ford Corporate multiple times including talking to very unhelpful supervisor. I clearly have a bad vehicle and it is a huge inconvenience and is adversely affecting my business. I have asked for Ford to buy my vehicle from me and told there is nothing they can do. As a consumer I am made to feel like all these problems are somehow my fault, when I have done nothing wrong except unknowingly bought a lemon vehicle and because I haven't had the exact same problem 3x, it doesn't qualify for the FL lemon law. There should be some provision for a vehicle with 8+ problems and that has spent 11 weeks in the shop in 10 months. This is a wrapped WORK vehicle that advertises my business. Guess how many business cards I passed out during those 11 weeks? ZERO.",
        "vin": "NM0LS7E24K1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/03/2021",
        "dateOfIncident": "07/08/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427554,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 FORD TRANSIT CONNECT 2.0L 8 SPD AUTO transmission. 84,000 MILES. TRANSMISSION EXHIBITING DIFFICULTY SHIFTING IN LOWER GEARS. VAN WAS WORKING FINE, THEN ALL AT ONCE THE TRANSMISSION STOPPED WORKING AT A WALMART. TRANSMISSION ACTED LIKE IT WAS IN PARK, I TURNED OFF KEY AND TURNED BACK ON AND THE VAN WOULD DRIVE AGAIN. WHEN I PULLED IN FRONT OF MY DRIVEWAY THE VAN WOULD NOT GO IN REVERSE NOR WOULD IT GO FORWARD AGAIN. I TURNED CAR OFF AND BACK ON AND THE VAN WOULD DRIVE FORWARD, I TOOK IT TO 3 DEALERS TRANSMISSION SHOULD LAST MUCH MORE THAN 84,000 MILES, KNOWN ELECTRONIC PROBLEMS ALTHOUGH NO RECALLS ON RECORD FOR THIS ENGINE AND TRANSMISSION COMBINATION. I DRIVE MY VAN VERY EASY, MY MILES ARE MOSTLY HIGHWAY MILES VERY LITTLE IN TOWN DRIVING. FORD SHOULD HONOR KNOWN PROBLEMS WITH THIS VEHICLE I DO NOT FEEL THIS IS FAIR OF FORD, I REQUESTED A CASE TO BE STARTED BY FORD AND I WANT TO RECORD THE PROBLEM IF FOR NOTHING ELSE FUTURE RECALL NOTICES FOR THIS OBVIOUS MANUFACTURE DEFECT. I HAVE NO IDEA WHAT TO DO NOW, IT NOW IS UNDRIVEABLE AND SITTING AT A DEALERSHIP AND I HAVE NO TRANSPORTATION, THIS WAS A \"WORK\" TRUCK AND NOW I CAN NOT WORK EITHER.",
        "vin": "NM0LS7E28K1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "07/19/2021",
        "dateOfIncident": "02/12/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425435,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Our employee was on a job site, parked and exited the vehicle and it rolled into a fence causing damage to the hood, fender and headlight. There was no warning chime that the vehicle was not in park.   No one was in the vehicle at the time and no one was injured. Because there were no injuries, we did not make an insurance claim for the damage nor file a police report. This happened approximately three months after we purchased this vehicle.   I believe this vehicle should be included in the current Ford recall 21S24. I have contacted both the dealership and Ford Motor Company and they say there is nothing to be done unless/until NHTSA adds our VIN/batch to the current recall.",
        "vin": "nm0ls7e2xk1"
    },
    {
        "components": "VISIBILITY/WIPER,LANE DEPARTURE,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "05/09/2021",
        "dateOfIncident": "05/08/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415758,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON GOING, I HAVE PICTURES OF MULTIPLE STAGES WITH THE MILEAGE. THE WIPERS CONTINUE TO MALFUNCTION. THE CAR HAS GONE IN MULTIPLE TIMES FOR THIS. THE HOSE CONTINUES TO DISCONNECT. THE  REAR CAMERA, SENSORS, CHARGING MECHANISMS MALFUNCTION. IT ACTIVATES THE REAR CAMERA IT ALSO SAYS PARKING ISSUE AND BACK UP CAMERA MALFUNCTION. IT WILL HAPPEN WHILE IN MOTION.",
        "vin": "NM0GE9F2XK1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/04/2021",
        "dateOfIncident": "04/23/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415135,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE NOT SHIFTING PROPERLY, THEN STUCK IN 3RD GEAR.  DEALER SAYS IT HAS A TRANSMISSION FLUID LEAK AND COOKED INTERNAL COMPONENTS (SEALED TRANSMISSION WITH NO DIPSTICK)",
        "vin": "NM0GS9F21K1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/14/2021",
        "dateOfIncident": "04/12/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408093,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 FORD TRANSIT CONNECT 2.0L GDI I4 ENGINE 8 SPD AUTO TRANSAXLE, 83,000 MILES. TRANSMISSION EXHIBITING DIFFICULTY SHIFTING IN LOWER GEARS. VAN WAS WORKING FINE, THEN ALL AT ONCE THE TRANSMISSION STOPPED WORKING AT A STOP LIGHT. TRANSMISSION ACTED LIKE IT WAS IN PARK, I TURNED OFF KEY AND TURNED BACK ON AND THE VAN WOULD DRIVE AGAIN. WHEN I PULLED IN FRONT OF MY DRIVEWAY THE VAN WOULD NOT GO IN REVERSE NOR WOULD IT GO FORWARD AGAIN. I TURNED CAR OFF AND BACK ON AND THE VAN WOULD DRIVE FORWARD, I TOOK TO DEALER AT THAT MOMENT, DEALER IS 3 MILES FROM MY HOME. FORD DEALER SERVICE END RESULT IS BLOWN TRANSMISSION WITH ESTIMATE TO REPAIR OF OVER $8,000.00. VEHICLE PROBLEMS ARE CONSISTENT WITH POSTED RECALLS ON 2.5L ENGINE. VEHICLE WELL MAINTAINED BY FORD DEALER SERVICE ONLY, ADULT DRIVEN 1 DRIVER ONLY. LOTS OF PEOPLE ONLINE COMPLAINING ABOUT SIMILAR PROBLEMS. TRANSMISSION SHOULD LAST MUCH MORE THAN 83,000 MILES, KNOWN ELECTRONIC PROBLEMS ALTHOUGH NO RECALLS ON RECORD FOR THIS ENGINE AND TRANSAXLE COMBINATION. I DRIVE MY VAN VERY EASY, MY MILES ARE MOSTLY HIGHWAY MILES VERY LITTLE IN TOWN DRIVING. FORD SHOULD HONOR KNOWN PROBLEMS WITH THIS VEHICLE ESPECIALLY IF THE REPAIRS ARE IN EXCESS OF $8,000.00! I DO NOT FEEL THIS IS FAIR OF FORD, I REQUESTED A CASE TO BE STARTED BY FORD AND I WANT TO RECORD THE PROBLEM IF FOR NOTHING ELSE FUTURE RECALL NOTICES FOR THIS OBVIOUS MANUFACTURE DEFECT. I HAVE NO IDEA WHAT TO DO NOW, THE REPAIRS COST MORE THAN THE VEHICLE IS WORTH ALTHOUGH THE CAR IS NOT PAID OFF, IT NOW IS UNDRIVEABLE AND SITTING AT A DEALERSHIP AND I HAVE NO TRANSPORTATION, THIS WAS A \"WORK\" TRUCK AND NOW I CAN NOT WORK EITHER.",
        "vin": "NM0LS7F29K1"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/19/2020",
        "dateOfIncident": "05/05/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325112,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 FORD TRANSIT CONNECT. THE CONTACT STATED THAT WHILE DRIVING AT AN UNDISCLOSED SPEED, THE BRAKE PEDAL WAS DEPRESSED AND THE VEHICLE LUNGED FORWARD BEFORE SLOWING TO A STOP. THERE WERE NO WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS TAKEN TO WHITE'S FORD LOCATED AT 1246 N MAIN ST, URBANA, OH 43078, WHERE IT WAS DIAGNOSED AND THE CONTACT WAS INFORMED THAT THE BRAKING SYSTEM NEEDED TO BE REPLACED. THE CONTACT WAS CONCERNED SINCE THE VEHICLE WAS REGULARLY SERVICED BY THE DEALER THAT THE DEALER SHOULD HAVE BEEN AWARE OF THE CONDITION OF THE BRAKING SYSTEM. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT THAT THE VEHICLE WAS NO LONGER UNDER WARRANTY. THE CONTACT STATED THAT THE WARRANTY STICKER INDICATED THAT THE VEHICLE WAS COVERED (BUMPER-TO-BUMPER) FOR THREE YEARS. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 13,000. THE VIN WAS NOT PROVIDED.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,WHEELS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/24/2020",
        "dateOfIncident": "11/08/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301670,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 FORD TRANSIT CONNECT. WHILE DRIVING AT VARIOUS SPEEDS, THE PRE-COLLISION ASSIST ENGAGED SPONTANEOUSLY WITHOUT WARNING OR POTENTIAL COLLISION. THERE WAS AN ABNORMAL BUZZING NOISE DETECTED. THE VEHICLE WAS TAKEN TO TED BRITT FORD OF CHANTILLY FORD BUILDING (4175 AUTO PARK CIR, CHANTILLY, VA 20151(703) 454-0008) AND WALDORF FORD (2440 CRAIN HWY, WALDORF, MD 20601(301) 234-7591) HOWEVER THE FAILURE COULD NOT BE DUPLICATED. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS CONTACTED BUT NO FURTHER ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS APPROXIMATELY 300.  *BF  CONSUMER STATED SOME OF THE ISSUES WHILE DRIVING, SCREEN FREEZES, REAR BACKUP CAMERA ACTIVATED WHEN IN STOP, BLUE TOOTH FREEZES, RADIO FREEZES, CLOCK FREEZES, ODOMETER FLASHES RED LIGHT, BUZZER GOES OFF INDICATING A HEAD ON COLLISION, DOOR OPEN AND SCREEN CONTINUES TO STAY ON WHEN VEHICLE IS TURNED OFF, CAR MISFIRES RANDOMLY, VEHICLE SURGES, TIRE ON THE DRIVER FRONT SIDE CONTINUES TO LOSE AND PULLS TO LEFT.*JB",
        "vin": "NM0LS7E20K1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/20/2019",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290367,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I CAN NOT SEEM TO GET MY REDUCED GUARD FUNCTION  AS SHOWN IN INTERNAL MEMO SSM48081 AND IN MY FACTORY FORD OWNERS MANUEL SET UP BY ANY FORD DEALERSHIP I HAVE BEEN TO. LAST NIGHT AT DINNER IT SET OFF 5 TIMES WITH MY DOG INSIDE. WAS TOLD BY ONE DEALERSHIP TO JUST NOT LOCK THE DOORS.",
        "vin": "NM0GE9F23K1"
    }
]