[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/10/2021",
        "dateOfIncident": "05/08/2021",
        "fire": true,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415831,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "SANDPIPER",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "RV WAS PARKED AND WAS PLUGGED INTO SHORE POWER.  AN ELECTRICAL CONNECTOR IN THE UNDERBELLY MELTED.  THIS CONNECTOR IS USED BETWEEN ROMEX CABLE FROM THE SUPPLY SIDE AND THE OUTLET WHICH IS FEED WITH SO CORD. THERE WAS NO LOAD ON THE OUTLET WHICH WAS CONNECTED TO THE CONNECTOR AT THE TIME IT FAILED.  THE FIRST 2 PICTURES ARE OF EACH SIDE OF THE CONNECTOR WHICH FAILED.  THE THIRD PICTURE IS THE PLASTIC BARRIER UNDER THE FLOOR WHICH MELTED.",
        "vin": "4X4FSAP25KJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/28/2020",
        "dateOfIncident": "05/18/2020",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326420,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "SANDPIPER",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SANDPIPER MAIN POWER CORD HOOK UP IS DIRECTLY ABOVE THE RV'S FURNACE EXHAUST VENT.  THIS FURNACE EXHAUST GETS VERY HOT AND IT HEATS UP THE ELECTRICAL POWER CORD PUTTER RUBBER COVERING TO THE POINT IT STARTED TO SMELL LIKE AN ELECTRICAL FIRE. I KNOW THIS IS A HAZARD,  BUT EVEN MORE SO MY WIFE IS HANDY CAPPED AND STAYS IN THE CAMPER.  I FEAR FOR LIFE AS WELL AS MY OWN. I KNOW HOW FAST THESE RV CAN BURN. THIS PROBLEM NEEDS TO BE RESOLVED BEFORE IT BECOMES A DISASTER.   I'M WRITING THIS TO INFORM YOU OF WHAT I SEE AS A VERY SERIOUS AND POSSIBLE DEADLY PROBLEM WITH THIS RV.  MY WIFE AND I WILL NOT SLEEP WITH THE FURNACE ON.  PLEASE WARN OTHER SANDPIPER OWNERS OF THIS PROBLEM WITH THE MODEL. MY RV IS IN THE SHOP AND NOT ABLE TO GET A PICTURE.*DT*JB*DT*JB*DT*JB *TR",
        "vin": "4X4FSAN26KJ"
    }
]