[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/24/2021",
        "dateOfIncident": "03/12/2021",
        "fire": false,
        "manufacturer": "Freedom Trailers, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404767,
        "products": [
            {
                "manufacturer": "Freedom Trailers, LLC",
                "productMake": "FREEDOM TRAILERS",
                "productModel": "FREEDOM TRAILERS",
                "productYear": "2019",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Lionshead Specialty Tire & Wheel LLC",
                "productMake": "LIONSHEAD",
                "productModel": "CASTLE ROCK",
                "productYear": "9999",
                "size": "ST225/75R15",
                "type": "Tire"
            }
        ],
        "summary": "I HAVE A COMPLAINT ON CASTLE ROCK TIRES, ST205/75R14, RADIAL ST226, D105/101L, DOT JUJT YMT 1418. THESE TIRES WERE ON A 2019 FREEDOM LIBERTY EXPRESS TRAVEL TRAILER, VIN 5ZT2FET1KW006857. MY WIFE AND I WERE TRAVELING HOME FROM FLORIDA. WITHIN 100 MILES OF ATLANTA, HEADING TOWARD KNOXVILLE, WE HAD A BLOWOUT. ALL TIRES WERE PROPERLY INFLATED AND APPEARED IN GOOD CONDITION. I PULLED TO THE EMERGENCY LANE AND EMPLOYED THE SPARE. LESS THAN 2 HOURS LATER WE HAD ANOTHER BLOWOUT. NOW WITH NO SPARE I HAD TO LEAVE THE CAMPER ON THE SIDE OF THE INTERSTATE AND TAKE THE BLOWN OUT TIRES FOR REPLACEMENT. CLOSING TIME FOR TIRE STORES WAS APPROACHING SO WE WERE QUITE NERVOUS ABOUT OUR SITUATION. I WAS ABLE TO GET 2 REPLACEMENT TIRES AND PUT ONE ON THE CAMPER. BY THIS TIME DARKNESS WAS APPROACHING AND WE WERE AFRAID ANOTHER TIRE WOULD BLOW OUT SO WE FOUND A CAMPGROUND AND STOPPED FOR THE NIGHT. UPON REACHING THE CAMPGROUND I RESEARCHED THE TIRES THAT HAD BLOWN OUT AND THE FIRST THING I NOTICED ON THE INTERNET WAS THESE TIRES ARE PRONE TO BLOWOUTS. THE FOLLOWING MORNING WE TRAVELED TO THE NEAREST DISCOUNT TIRE STORE AND I REPLACE ALL 4 TIRES ON THE CAMPER SO THEY WOULD ALL MATCH AND USED ONE OF THE OTHER TIRES I PURCHASED FOR A SPARE. I REPLACED THE TIRES WITH A MUCH BETTER AND MORE EXPENSIVE TIRE. ONE OF THE FIRST THINGS THE MAN AT DISCOUNT TIRE SAID WHEN I TOLD HIM ABOUT OUR BLOWOUTS WAS, THEY GET ABOUT 1 PERSON A WEEK WITH BLOWOUTS WITH THESE TIRES, WE CALL THEM CHINA POPS. THE BLOWOUTS DAMAGED MY CAMPER. THANKFULLY, WE WERE IN A SITUATION WHERE WE COULD PULL OVER WHEN THE BLOWOUTS HAPPENED, BUT THIS COULD HAVE EASILY RESULTED IN A WRECK BECAUSE OF THE BLOWOUTS.WE HAD TO SPEND AN EXTRA NIGHT ON THE ROAD AND BUY 6 NEW TIRES BECAUSE OF THE BLOWOUTS. I FEEL THESE TIRES ARE UNSAFE. I HAVE CONTACTED THE CAMPER COMPANY AND THEY REPORT THEY HAVE HAD GOOD SERVICE FROM THE TIRES. TIRE COMPANY PARENT COMPANY HAS NOT RETURNED MY PHONE CALLS.",
        "vin": "5ZT2FETB1KW"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/05/2019",
        "dateOfIncident": "11/29/2019",
        "fire": false,
        "manufacturer": "Freedom Trailers, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287262,
        "products": [
            {
                "manufacturer": "Freedom Trailers, LLC",
                "productMake": "FREEDOM TRAILERS",
                "productModel": "FREEDOM TRAILERS",
                "productYear": "2019",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Trans Texas Tire",
                "productMake": "TASKMASTER",
                "productModel": "CONTENDER",
                "productYear": "9999",
                "size": "ST235/80R16",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 (NA) FREEDOM TRAILER EQUIPPED WITH TASKMASTER PROVIDER (NA) TIRES, SIZE: ST235/80R16. THE CONTACT NOTICED A BULGE IN THE FRONT PASSENGER TIRE. WHILE DRIVING 60 MPH, THE CONTACT FELT A VIBRATION COMING FROM THE VEHICLE. THE CONTACT OBSERVED THAT THE REAR PASSENGER TIRE HAD TREAD SEPARATION. THE CONTACT REACHED OUT TO THE MANUFACTURER AND THEY FAULTED THE DRIVER FOR OVERLOADING THE TRAILER AND CAUSING THE TIRE FAILURES. THE TIRES WERE AFTERMARKET TIRES. THE TIRE AND VEHICLE FAILURE MILEAGE WAS 6,000.",
        "vin": "5WKBE2422D1"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/10/2018",
        "dateOfIncident": "09/25/2018",
        "fire": false,
        "manufacturer": "Freedom Trailers, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150695,
        "products": [
            {
                "manufacturer": "Freedom Trailers, LLC",
                "productMake": "FREEDOM TRAILERS",
                "productModel": "FREEDOM TRAILERS",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRAILER IS BENDING AND BULGING FROM ITS OWN WEIGHT. THE TRAILER WAS NOT PROPERLY ASSEMBLED BY THE MANUFACTURER. GROSS NEGLIGENCE BURNED STEEL WITH POOR WELDS. WELDS THAT ARE INCOMPLETE, WELDS THAT ARE MISSING. SECTIONS OF THE WALL SUPPORTS WHICH ARE SUPPOSED TO BE WELDED TO THE FRAME OF THE TRAILER ARE MISSING WELDS COMPLETELY. SECTIONS OF THE BOX THAT ATTACHES TO THE RISER OF THE GOOSENECK ARE NOT REINFORCED AND ARE SIMPLY SPOT WELDED IN FEW AREAS BUT NOT COMPLETELY AS SHOULD BE. EVERY TIME THE TRAILER GOES OVER A BUMP OR DECELERATES THE GOOSENECK SECTION THAT ATTACHES TO THE BED OF THE TRUCK IS SEEN BENDING AND FLEXING WITH NO LOAD INSIDE.  WE LOADED A 2017 EXPLORER AND A 2017 INFINITY QX50 INSIDE DROVE LESS THAN 100 MILES WITH THE TRAILER LOADED(LESS THAN MAX)  AND A TRUCK DRIVER FLAGGED US TO PULL OVER WHEN THEY SEE THE TRAILER BENDING UNSAFELY ON THE 5 FREEWAY BETWEEN 134 AND THE 118 IN CA. THE ROAD IS NOT THE BEST IN THIS AREA THE VEHICLE WAS TRAVELING 55MPH IN THE TRUCK LANE OVER VERY ROUGH ROAD BUT WITH THE FLOW OF TRAFFIC AND FOLLOWING ALL POSTED SPEED AND LAWS.WHEN SPEAKING WITH THE MANUFACTURER THE OWNER TOLD ME TO GO F#$% MY SELF. STATING YOUR IN CA AND I AM IN GA THAN HANGING UP ON ME.     HTTPS://YOUTU.BE/RDRXNMLCHAI    HTTPS://YOUTU.BE/FR2YB7LRDXC    THE TRAILER IS CURRENTLY PARKED AT THE SOCAL RVDOCTOR IN LAKE ELSINORE CA   (XXXXX) FOR ANY FURTHER DETAILS OR PHOTO OR TO GO SEE THIS TRAILER IN PERSON.    THINKING THIS WAS SOMETHING THAT I HAD DONE I CONTACT MY INSURANCE COMPANY WHO TOWED THE VEHICLE TO THE REPAIR FACILITY WHERE IT CURRENTLY SITS UPON OPENING THE INSIDE WALLS THE REPAIR FACILITY REP EXPLAINED ITS NOTHING THAT WAS BROKEN OR DAMAGED. THE TRAILER WAS JUST NOT PUT TOGETHER PROPERLY AND SHOULD NEVER HAVE PASSED SAFETY INSPECTIONS.    PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)   *JB",
        "vin": "5WKGE4830K1"
    }
]