[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/25/2019",
        "dateOfIncident": "07/15/2019",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234729,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDWOOD",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 (NA) FOREST RIVER WILDWOOD. WHILE OPERATING THE RV AND TOWING A SECOND VEHICLE, THE AUTO ELECTRIC BRAKE FEATURE USED TO STOP THE TOWED VEHICLE MALFUNCTIONED. THE DRIVER HAD TO MANUALLY ACTIVATE THE BRAKE TO PREVENT THE TOWED VEHICLE FROM CRASHING INTO THE REAR OF THE RV. THE VEHICLE WAS TAKEN TO ROSE CITY RV (2228 SM 33, ROSE CITY, MI) WHERE IT WAS DIAGNOSED THAT THE BRAKE TRAILER WIRES WERE FAULTY AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 300.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/26/2019",
        "dateOfIncident": "05/25/2019",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210096,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDWOOD",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FAULTY INTERIOR WALL SEPARATETION, EXTERIOR DOORS NOT ALIGNING PROPERLY, GROUND WIRES IN CIRCUIT BREAKER. 12 GROUND WIRES MELTED TOGETHER. MAJORITY OF THE GROUND WIRES CAME FROM THE AC UNIT BASED OFF OF THE DIAGRAM. THE CIRCUIT BREAKER PANEL WAS WARPED FROM THE BURNT WIRING. MULTIPLE GROUND WIRES SCREWED INTO ONE ONE GROUND WIRE SLOT. THE VEHICLE WAS STATIONARY AND IT WAS PLUGGED INTO A 30AMP OUTLET. I USED A 30 AMP CONVERTER WITH THE 50 AMP POWER CABLE.",
        "vin": "4X4TWDJ29K8"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/22/2019",
        "dateOfIncident": "04/05/2019",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209153,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDWOOD",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY PURCHASED AT 2019 WILDWOOD FSX 280RT.  WHEN I TOWED IT EMPTY I HAD NO PROBLEMS WITH THE TRAILER.  ONCE LOADED WITH A SIDE BY SIDE THE TRAILER BECAME VERY UNSTABLE AND SWAYED GREATLY FROM SIDE TO SIDE.  I STOPPED AND FILLED THE FRESHWATER TANK TO TRY AND OFFSET THE WEIGHT TO NO AVAIL.  I HAD A LOCAL RV PROFESSIONAL LOOK AT THE TRAILER AND THEY ADVISED THAT THE AXLE PLACEMENT OF THIS TRAILER APPEARS TO BE A CAUSE OF CONCERN.  I WAS ADVISED THAT THE AXLE PLACEMENT ON THIS UNIT APPEARS WAY TO FAR FORWARD AND WHEN LOADED REMOVES THE MAJORITY OF THE TONGUE WEIGHT FROM THE TRAILER.  WHEN I COMPARED THIS HAULER TO OTHER TOY HAULERS IT WAS APPARENT THAT THE AXLES ON OTHER TOY HAULERS ARE MUCH FURTHER BACK WHICH ALLOWS PROPER TONGUE WEIGHT WHEN LOADED.  I AM CURRENTLY TOWING THIS TRAILER WITH A 3/4 TON RAM 2500 WITH A WEIGHT DISTRIBUTION HITCH SO THE VEHICLE IS DEFINITELY NOT AN ISSUE.  BASED ON THE AXLE LOCATION OF THIS VEHICLE I FEEL IT IS UNSAFE TO TOW AND IS CURRENTLY GROUNDED UNTIL WE CAN DETERMINE A CORRECTIVE COURSE OF ACTION.",
        "vin": "4X4TWDD22KY"
    }
]