[
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/19/2021",
        "dateOfIncident": "05/26/2021",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429699,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "IMAGINE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Grand Design Imagine. The contact received notification of NHTSA Campaign Number: 21V393000 (Equipment) however, the part to do the recall repair was not available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. Northgate RV Center (442 Candy Ln, Ringgold, GA 30736, (706) 935-8883) was contacted and informed the contact that no parts were available for the recall repair. The contact had not experienced a failure. The manufacturer was notified of the failure and informed the contact that the parts were not available. Parts distribution disconnect.",
        "vin": "573TE2624K1"
    },
    {
        "components": "UNKNOWN OR OTHER,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "07/28/2021",
        "dateOfIncident": "07/02/2021",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426821,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "IMAGINE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The 2019 Grand Design Imagine Travel Trailer is built of a Lippert chassis, this chassis combined with the commonly used Equal-i-zer sway control hitch is resulting in the trailer safety chains being damaged, which may cause serious damage, injury or death if the trailer becomes separated from the tow vehicle hitch.  These chains are also linked to the trailer's emergency braking system.  Grand Design should recall and cover the movement of the safety chain's attachment point further back on the trailer frame, to avoid safety chain failure due to damage that occurs when turning and pinching the chains.  My small RV dealer in Indiana (Evans & Sons, Petersburg, IN) has seen four of five of these issues in addition to my trailer in the past year.  They have reported this to Grand Design, as have I, but Grand Design is not covering the move of the safety chains attachment point further back on the trailer frame.  In addition to my trailer and those my dealership have seen, there are several other photos of the same issue online.  https://www.mygrandrv.com/forum/showthread.php/36086-Repositioning-safety-chains",
        "vin": "573TE3227K6"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/15/2021",
        "dateOfIncident": "04/11/2021",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420979,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "IMAGINE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Brake linings which are available for inspection.   The brake lining defects likely caused THREE tire blowouts due to excessive heat from the disintegrating brake linings, also a degradation of stopping performance.  Upon performing annual wheel bearing service and brake inspection I found all four brake assemblies with brake lining partially disintegrated and in one case completely missing from the metal backing. This is NOT normal wear and tear but the breaking off of the lining from the metal backing plate.  Nobody has inspected the linings but I have notified the RV trailer manufacturer, Grand Design and the manufacturer of the brake linings, Dexter Axle Co.  I had THREE tire blowouts, one in September 2020 and two more recently causing significant damage to the RV travel trailer not to mention the p",
        "vin": "573TE3221K6"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/28/2019",
        "dateOfIncident": "08/20/2019",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252092,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "IMAGINE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 GRAND DESIGN IMAGINE TRAILER. THE CONTACT NOTICED THAT THE REAR DRIVER'S SIDE WHEEL BEARING WAS SEPARATING FROM THE AXLE. THE CONTACT DROVE THE VEHICLE TO AN INDEPENDENT MECHANIC WHO USED A TORCH TO REMOVE THE NUT FROM THE AXLE TO ACCESS THE WHEEL BEARING. THE MECHANIC ALSO HAD TO USE A GRINDER TO GRIND THE AXLE AND THE BRAKE PADS HAD TO BE REPLACED. THE CONTACT WAS INFORMED THAT THE TRAILER WAS WELL ENOUGH TO DRIVE HOME; HOWEVER, THE ENTIRE AXLE NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND STATED THAT THEY WOULD REIMBURSE THE CONTACT FOR THE TRAILER REPAIRS. THE CONTACT ALSO INFORMED THE MANUFACTURER THAT THE AXLE NEEDED TO BE REPLACED, BUT THEY REFUSED TO COMPENSATE HIM FOR THAT PARTICULAR REPAIR. THE CONTACT ASSOCIATED THE FAILURE WITH NHTSA CAMPAIGN NUMBER: 18V823000 (SUSPENSION); HOWEVER, THE VEHICLE WAS NOT INCLUDED IN THE RECALL. THE DEALER WAS NOT CONTACTED. THE AXLE HAD NOT BEEN REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 5,000.",
        "vin": "573TE2826K6"
    }
]