[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/08/2021",
        "dateOfIncident": "06/03/2021",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420141,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Grand Design Recreational Reflection. The contact stated that there were wires located underneath one of the slide out beds. While sliding out the bed, the bed rubbed against the wire and caused the wires to short circuit. The contact lost power to certain lights located in the bedroom due to the design. The contact called an independent mechanic who redirected the wires from underneath the slide out bed.  The manufacturer was not notified of the failure. The vehicle was repaired. The failure mileage was approximately 6,000.",
        "vin": "573fr3621k3"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/24/2020",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330508,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE AN UNSAFE AND POTENTIALLY DANGEROUS WIRING PROBLEM ON MY RV.  THE HEATER AND THE REFRIGERATOR ARE WIRED ON THE SAME CIRCUIT BREAKER (SPLICED TOGETHER).  WHEN THE HEATER TURNS ON, THE FRIDGE POWER FLASHES ON AND OFF FOR A MOMENT UNTIL THE HEATER IS RUNNING NORMALLY. THIS KIND OF SURGE ON THE CIRCUIT IS UNSAFE AND CAN CAUSE DAMAGE TO OTHER ELECTRICAL COMPONENTS AND/OR FIRE. THE CONTROL BOARD FOR THE FRIDGE HAS ALREADY BEEN REPLACED AS PER BISH'S RV.   I HAVE NOTIFIED GRAND DESIGN ABOUT THIS IN A SURVEY (04/2019). SHORTLY AFTER THAT, I RECEIVED AN EMAIL FROM [XXX] ASKING ABOUT MY CONCERNS (04/10/2019) I DESCRIBED IN THE SURVEY. I ALSO RECEIVED A PHONE CALL FROM GRAND DESIGN, I BELIEVE ON 04/11/2019. I SPOKE WITH THIS REPRESENTATIVE AND  EXPLAINED THE WIRING ISSUE AND TOLD HIM THAT I THOUGHT IT WAS WIRED ON THE SAME CIRCUIT BREAKER. HE INFORMED ME THAT THEY DO NOT WIRE THEIR RV'S IN SUCH A WAY AND STATED THAT, I MUST HAVE BEEN HIT BY LIGHTNING THAT CAUSED THE ISSUE. BISH'S RV TRIED TO GET GRAND DESIGN TO APPROVE THE ELECTRICAL WORK AS WARRANTY. GRAND DESIGN REFUSED TWICE (ON THE SAME DATE OF 05/02/2019). GRAND DESIGN STATED THAT THE HEATER AND FRIDGE DO NOT DRAW MORE THAN 15 AMPS WHILE RUNNING SIMULTANEOUSLY. I BELIEVE THEY ARE FORGETTING THE PEAK AMPERAGE AT START UP THAT IS CAUSING THIS ISSUE. I BELIEVE THIS ISSUE HAS POTENTIAL TO CAUSE SEVERE INJURY AND EVEN DEATH, UNLESS IT IS PROPERLY RESOLVED. IT HAS ALREADY CAUSED A PREMATURE FAILURE OF THE FRIDGE CONTROL BOARD.  AS PER THE NATIONAL ELECTRICAL CODE ARTICLE 551 STATES THAT AN RV MUST COMPLY WITH ALL OF THE OTHER REQUIREMENTS IF IT HAS A POWER SOURCE THAT IS 120V, 120/208V, OR 120/240V [551.4].      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "573TT3429K8"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/08/2020",
        "dateOfIncident": "05/25/2020",
        "fire": true,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327697,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 GRAND DESIGN REFLECTION TRAILER EQUIPPED WITH SELF ADJUSTING BRAKES. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 35 MPH SMOKE WAS PRESENT COMING FROM THE FRONT DRIVER SIDE AXLE. UPON INSPECTION IT WAS DISCOVERED THAT THE BRAKES WERE VERY HOT AND SMOKING. THE TRAILER WAS TAKEN TO THE LOCAL DEALER BRETZ RV & MARINE (2999 OLD HARDIN RD BILLING, MT 59101) THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE MANUFACTURER WAS NOT YET NOTIFIED. THE FAILURE MILEAGE WAS 1,500. *BF  CONSUMER STATED AXLE COMPANY PAID TO FIX TRAILER.*JB",
        "vin": "573FR3523K3"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "04/24/2020",
        "dateOfIncident": "08/22/2019",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322178,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2019 GRAND DESIGN REFLECTION 290BH HAS A TURNING POINT HITCH. THE TURNING POINT HITCH IS DESIGNED SO THAT YOU CAN TOW THE 5TH WHEEL BEHIND A SHORT BED TRUCK WITHOUT A SLIDER HITCH.   WHILE TOWING OUR TRAILER AT ABOUT 50 MPH AND APPROACHING A CURVE THE UNIVERSAL WEDGE CAME LOOSE IN OUR HITCH WHICH MADE THE HITCH TURN AT BOTH POINTS. THIS CAUSED OUR TRAILER TO HIT OUR HIT OUR TRUCK. LUCKILY WE TOW THIS 1/2 TON RATED TRAILER WITH A 1 TON TRUCK AND WE WERE ABLE TO WITHSTAND THE IMPACT OF THE HIT. WE WERE NOT THROWN OFF THE ROAD AND WE WERE ABLE TO PULL OFF SAFELY.  AFTER DOING OUR RESEARCH THE DEALER HAD INSTALLED OUR HITCH CORRECTLY ACCORDING TO THE MANUAL RELEASED 05/18/2017 WHICH WAS INCLUDED WITH OUR TRAILER. THEY WERE UNAWARE OF ANY SERVICE BULLETINS OR RECALLS.  LIPPERT HAS UPDATED THE MANUAL AS OF 8/16/19 AND IT NOW LISTS SPECIFIC WEDGES FOR SPECIFIC HITCHES.  WHEN THE DEALER CONTACTED LIPPERT THEY DENIED EVER REVISING THEIR MANUAL.  BOTH LIPPERT AND GRAND DESIGN ARE DENYING ANY RESPONSIBILITY.*DT  *JB",
        "vin": "573FR352XK3"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/01/2019",
        "dateOfIncident": "04/19/2019",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217271,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "PULLING IN FOR GAS AT GAS STATION HIT THE CURB MAYBE 2 MILES AN HOUR WITH LEFT FRONT TIRE BENT FRONT TIRE ON LEFT BENT HANGER ON LEFT AND BENT HANGER ON RIGHT CAUSING TIRE TO POP AND OVER 3000 DOLLARS OF DAMAGE TO SUSPENSION. HAD ABOUT 1300 MILES ON TRAILER WAS FIRST TRIP OUT",
        "vin": "573TR3423K3"
    }
]