[
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/18/2020",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11359838,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA DENALI",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 GMC SIERRA DENALI. THE CONTACT STATED THAT UPON PURCHASE OF THE VEHICLE, WATER BEGAN TO LEAK INTO THE VEHICLE THROUGH THE WINDSHIELD. THE CONTACT TOOK THE VEHICLE TO FAHRNEY BUICK GMC (3105 HIGHLAND AVE, SELMA, CA 93662) WHERE THEY HAD TO ORDER A CERTAIN PART TO REPAIR VEHICLE WHICH WAS STILL PENDING. DUE TO THE FAILURE, THE CONTACT STATED THAT MOLD HAD DEVELOPED ON THE CEILING NEAR THE SUN ROOF OF THE VEHICLE. THE MANUFACTURER HAD YET TO BE NOTIFIED OF THE FAILURE. THE VEHICLE HAD YET TO BE REPAIRED. THE FAILURE MILEAGE WAS 1,000.  *TR",
        "vin": "1GT42WEY1KF"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/27/2020",
        "dateOfIncident": "04/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322479,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA DENALI",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "HID HEADLIGHTS FLICKER/SHAKE WHEN DRIVING OVER ANY SIZE BUMP, OR WHEN YOU CLOSE THE VEHICLE DOOR.",
        "vin": "1GT12SEY8KF"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/21/2020",
        "dateOfIncident": "03/14/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11321767,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA DENALI",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRUCK WAS PARKED (ENGINE WAS NOT RUNNING AT ALL), I USED THE KEY FAB REMOTE TO UNLOCK THE TRUCK AND THEN OPEN THE TAILGATE.  AT THIS TIME, THE TAILGATE SLAMMED OPEN (VERY FORCEFULLY AND QUICKLY) AND HIT MY SON IN THE CHEST.  THIS HAS ALSO HAPPENED WHILE THE TRUCK WAS RUNNING AND IN PARK.  AT THAT TIME, I (THE DRIVER) PUSHED THE BUTTON ON THE CENTER DASH TO OPEN THE TAILGATE SO THAT MY YOUNG SON COULD PUT HIS BASEBALL GEAR IN THE BED OF THE TRUCK.  AGAIN, THE TAILGATE OPENED VERY QUICKLY AND ABRUPTLY, SLAMMED OPEN, AND THE HEAVY TAILGATE HIT HIM IN HIS BODY.  THE TAILGATE IS SUPPOSED TO OPEN SLOWLY AND GRADUALLY, NOT SLAM OPEN.  THANKFULLY, MY SON WAS NOT SERIOUSLY INJURED.  THE REMOTE CONTROL, SLOW OPENING TAILGATE WAS ONE OF THE SELLING FEATURES OF THE TRUCK, AND NOW THE TAILGATE IS DANGEROUS TO USE AT ALL, ESPECIALLY WHEN CHILDREN ARE AROUND.",
        "vin": "1GTU9FEL7KZ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/25/2020",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311363,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA DENALI",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A RECALL NOTICE MAY 2019 FROM MARYANN L. COMBS, VICE PRESIDENT GLOBAL VEHICLE SAFETY.  THE LOCAL DEALERSHIP SAID PARTS WERE NOT AVAILABLE AT THAT TIME. A FEW MONTHS LATER, STILL NOT AVAILABLE AND TODAY, FEBRUARY 25,2020 THEY ARE STILL NOT AVAILABLE AND IT SEEMS THEY MAY NEVER BE AVAILABLE TO VEHICLES IN THE \"SOUTHERN\" STATES.  MY TRUCK TRAVELS TO MN, MT, ND ON A REGULAR BASIS AND THE PROBLEM IN QUESTION NEEDS TO BE FIXED TO KEEP THE ENGINE WARM AT BELOW ZERO TEMPERATURES.  NHTSA CAMPAIGN ID NUMBER IS 19V328 AND RECALL NUMBER WAS N182206311.  PER THE LETTER FROM MS. COMBS USE OF THE CURRENT ENGINE BLOCK HEATER CABLE COULD RESULT IN AN ENGINE FIRE.",
        "vin": "1GT42WEY8KF"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/19/2020",
        "dateOfIncident": "01/04/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310027,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA DENALI",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FIRST ISSUE IS A BLUETOOTH ISSUE. THE PHONE VOLUME GOES SILENT WHEN I GET IN MY VEHICLE. IF I CONNECT TO CAR PLAY, IT WORKS.  I HAVE MISSED IMPORTANT CALLS DUE TO THIS ISSUE. THIS STARTED IN JULY OF 2019 AND ITS NOT FIXED YET.  GM SAYS IT APPLE. APPLE SAYS ITS GM  I DO NOT CARE JUST FIX IT.    SECOND  SEE BELOW IMAGES. YOU KNOW THE ISSUE. THIS HAPPENED TO ME 3 TIMES. IT STARTED 12-05-2019.  THEN AGAIN  12-26-19 . SERVICED . 1-4-2020 AGAIN. 1-18 20 AGAIN AND TO SHOP UNTIL 1-23-2020.  THIS TOOK A LOT OF MY TIME TALKING WITH MY DEALER.    I UNDERSTAND I AM ONE OF MANY, BUT I DIDN'T SPEND OVER $66,000  TO BUY,  LEASE THIS VEHICLE TO HAVE TO WASTE MY TIME. THIS COST ME TIME, MONEY AND HONESTLY EVERY TIME I START THE TRUCK I WONDER IF IT WILL REAPPEAR.     I RECEIVED 2 CALLS FRO REPRESENTATIVES, GIANNA AND MICHELLE. I CALLED BACK 3 TIMES, LEFT VOICEMAIL AND HAVE HEARD NOTHING.    AT THIS POINT, I AM REQUESTING FOR GM TO END MY LEASE AND I GIVE YOU THIS TRUCK BACK .",
        "vin": "1GTU9FEL4KZ"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/14/2020",
        "dateOfIncident": "02/13/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309140,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA DENALI",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE LIGHT KEEPS COMING ON TAKE IT TO THE DEALER I GUESS THEY RESET IT AND NOW THIS IS THE 3RD TIME IT'S NOW BACK ON, BACK UP CAMERA GOES OUT FROM TIME TO TIME,",
        "vin": "1GTU9FEL7KZ"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/05/2020",
        "dateOfIncident": "02/05/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307393,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA DENALI",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER STARTING MY VEHICLE REMOTELY USING ON-STAR, MY BRAKES STOPPED FUNCTIONING PROPERLY... AFTER REMOTE STARTING THE VEHICLE USING MY ON-STAR APP, WE ENTERED IT, DEPRESSED THE BRAKE AND PRESSED THE START BUTTON. AT THAT TIME I RECEIVED MULTIPLE ERROR MESSAGES, STATING \"BRAKE SYSTEM FAILURE, 62 MPH TOP SPEED\" \"SERVICE ESC\" \" STEERING ASSIST IS REDUCED DRIVE WITH CARE.\" I RESTARTED THE VEHICLE A NUMBER OF TIMES AND THE ERROR MESSAGES WENT AWAY. I THEN BEGAN TO DRIVE HOME AND AFTER ABOUT 2 MILES THE ERROR MESSAGES ALL CAME BACK AND MY BRAKES STOPPED FUNCTIONING. I WAS ABLE TO USE THE FULL FORCE OF MY BODY ON THE BRAKES TO GET THE VEHICLE TO COME TO A STOP FROM AROUND 30 MPH IN MY NEIGHBORHOOD. HAD I BEEN ON THE HIGHWAY OR ON THE MAIN STREET I HAD JUST BEEN ON I LIKELY WOULD NOT HAVE BEEN ABLE TO STOP WITHOUT HITTING ANOTHER VEHICLE OR OBJECT.",
        "vin": "1GTU9FEL6KZ"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/04/2020",
        "dateOfIncident": "01/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307106,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA DENALI",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRIC/ELECTRONIC/COMPUTER ISSUES.  MOST ISSUES ARE INTERMITTENT, SOME HAPPEN ALL THE TIME.  THE INTERMITTENT ONES SOMETIME HAPPEN IN CLUSTERS (MULTIPLE TIMES A DAY THEN NOT FOR DAYS, WEEKS, MONTHS) A FEW HAVE ONLY HAPPENED ONCE SO FAR.    THE FOLLOWING ISSUES HAPPEN ALL THE TIME.  DOES NOT COME OUT OF CRUISE CONTROL AUTOMATICALLY DURING COLLISION ALERT.   DOES NOT AUTOMATICALLY BRAKE DURING IMMINENT COLLISION WITH AUTO BRAKE FEATURE TURNED ON.  SECONDARY BLUETOOTH PHONE DOES OUTGOING CALLS THROUGH TRUCKS INFO SYSTEM.  HEADS-UP DISPLAY GIVES DOUBLE TURN DIRECTIONS DURING ROUTE GUIDANCE NAV.  BLUETOOTH TEXTING DOES NOT WORK.  THE FOLLOWING ISSUES HAPPEN FREQUENTLY.  TRANSMISSION BANGS/SHUDDERS PERIODICALLY, ACCELERATING, NOT ACCELERATING, SLOWING DOWN, JUST DRIVING, MOSTLY ON LEVEL GRADE. SOMETIMES STRONG ENOUGH TO FEEL LIKE I WAS REAR ENDED, PASSENGERS  HAVE JUMPED  MANY RADIO MEDIA ISSUES WITH SOUND AND NAV BOOT UP.   DURING PARKING MANEUVER AFTER COMING OUT OF REVERSE AND GOING INTO DRIVE, FORWARD CAMERA WOULD COME ON AND THEN SWITCH TO NAV SCREEN WHEN I TOOK MY FOOT OFF THE BRAKE. TO RESOLVE WOULD GO IN REVERSE THEN BACK TO DRIVE AND THE FRONT CAMERA WOULD STAY ON.    AFTER VEHICLE START I GO INTO DRIVE AND FRONT CAMERA COMES ON. SOMETIMES IT DOES NOT IN THE EXACT SIMILAR CIRCUMSTANCES. NO INDICATION FROM FORWARD DETECTION SENSORS.  AFTER BACKING OUT OF A PARKING SPOT, GOING INTO DRIVE FORWARD CAMERA COMES ON THEN THE WHOLE SCREEN GOES BRIGHT BLUE, AFTER A FEW SECONDS FORWARD CAMERA COMES BACK ON UNTIL I SPEED UP.     OTHER ISSUES NOT SO FREQUENT. HAVE BEEN TO DEALERSHIP OVER 9 TIMES FOR A TOTAL OF 37 DAYS IT WAS IN THE SHOP.  GMC CAC USELESS AND DO NOT KNOW THE PRODUCT. DEALERSHIP TECHNICIANS ARE NOT FAMILIAR WITH NEW PRODUCT OR HAVE THE COMPUTER SKILL SET TO FIX.",
        "vin": "1GTU9FED8KZ"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/03/2020",
        "dateOfIncident": "02/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306648,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA DENALI",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER USING APP TO START THE VEHICLE, I SAT IN THE DRIVER SEAT DEPRESSED THE BRAKE AND PUSHED THE START BUTTON. IMMEDIATELY A WARNING POPPED UP SAYING ESC NEEDED SERVICE, SERVICE TRAILER BRAKE, SPEED LIMITED TO 62MPH. ADDITIONAL LIGHTS ILLUMINATED INCLUDING BRAKE, TRACTION CONTROL, ABS, AND CEL. SINCE THE DASH INDICATED THAT THE SPEED WAS REDUCED I THOUGHT IT WOULD BE SAFE TO DRIVE, HOWEVER AT THE FIRST TURN I REALIZED MY BRAKES WERE NEARLY GONE AND I WENT THROUGH THE INTERSECTION. THE BRAKES APPEARED TO HAVE LOST THE BOOST AND WERE EXTREMELY HARD TO DEPRESS MAKING IT DIFFICULT TO STOP THE VEHICLE. I LIMPED THE TRUCK HOME AND NOTIFIED THE DEALER. THE NEXT DAY I TRIED STARTING THE TRUCK AND THE BRAKES RETURNED WITH NO DASH MESSAGES ALTHOUGH THE CEL WAS STILL ILLUMINATED. THERE IS A RECALL FOR A SIMILAR ISSUE BUT IT LOOKS LIKE MY VIN IS NOT APART OF IT.",
        "vin": "1GTU9FEL6KZ"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/03/2020",
        "dateOfIncident": "12/26/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306722,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA DENALI",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 GMC SIERRA DENALI. THE CONTACT STATED THAT WHILE DRIVING AT AN UNDISCLOSED SPEED, THE POWER FAILED TO OPERATE AS DESIGNED. THE BRAKE PEDAL WAS DEPRESSED HOWEVER, THE STOPPING DISTANCE WAS EXTENDED. THE VEHICLE WAS TAKEN TO (BALLAS BUICK GMC 5715 CENTRAL AVE, TOLEDO, OH 43615 (419) 464-7699) TO BE DIAGNOSED. THE TECHNICIAN STATED THAT THERE WAS A LOSS OF COMMUNICATION BETWEEN THE VEHICLE COMPUTERS TO THE POWER STEERING MODULE. THE VEHICLE REMAINED IN DEALER CUSTODY FOR SEVERAL WEEKS BUT WAS NOT REPAIRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS 4,500.",
        "vin": "3GTU9FED9KG"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/25/2020",
        "dateOfIncident": "01/24/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301754,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA DENALI",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JANUARY 23RD I STARTED THE GMC VIA THE GMC PHONE APP AND WHEN I GOT IN THE TRUCK PUSHED BRAKE AND START BUTTON AND THAT'S WILL GAUGES WENT CRAZY SAYING BRAKE MALFUNCTION .STEERING ,SPEED REDUCED TO 62 MPH AND BRAKE PEDAL WENT TO FLOOR WITH LITTLE TO NO BRAKES AND STOPPED THE TRUCK TURNED IT OFF AND ON TWICE BEFORE ALL CODES CLEARED EXCEPT NOW THE CHECK ENGINE LIGHT IS ON . BRAKES APPEARED TO WORK FINE AFTER TE SECOND TIME OF TURNING THE TRUCK OFF AND ON .970 MILES ON IT!",
        "vin": "1GTU9FEL1KZ"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/24/2020",
        "dateOfIncident": "01/24/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301709,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA DENALI",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER STARTING VEHICLE USING THE MYGMC APP, I RECEIVED THE FOLLOWING WARNINGS: 1. SERVICE TRAILER BRAKE SYSTEM 2. STEERING ASSIST IS REDUCED DRIVE WITH CARE 3. SERVICE ESC 4. BRAKE SYSTEM FAILURE 62 MPH TOP SPEED 5. CHECK ENGINE LIGHT. VEHICLE WAS STATIONARY AND I DID NOT DRIVE AFTERWARDS. TRUCK WAS IN FOR SERVICE LAST WEEK TO COMPLETE RECENT RECALLS AND REPLACE A LEAKY REAR WINDOW. WHEN I PICK THE TRUCK UP, I NOTICED THE LANE KEEP ASSIST, LANE DEPARTURE WARNING, INTELLIBEAM HEADLIGHT, FORWARD COLLISION ALERT, AND OTHER FUNCTIONS ASSOCIATED WITH THE WINDOW MOUNTED CAMERA SYSTEM WERE INOPERABLE. I HAVE AN APPOINTMENT ALREADY SCHEDULED FOR THAT AND WILL ADD THIS FOR THE DEALER TO INVESTIGATE. TRUCK WAS TAKEN TO DEALER FOR RECALL ON 1/7/2020 AND I GOT IT BACK ON 1/18/2020 BECAUSE OF THE WINDOW REPLACEMENT.",
        "vin": "1GTU9FEL6KZ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/13/2020",
        "dateOfIncident": "01/09/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298964,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA DENALI",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 GMC SIERRA DENALI. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN TO THE TULLEY BMW OF NASHUA DEALER (603-888-5050, LOCATED AT 147 DANIEL WEBSTER HWY, NASHUA, NH 03060) FOR AN OIL CHANGE, AND IT WAS MENTIONED THAT THERE WAS A RECALL. THE TECHNICIAN PERFORMED A SOFTWARE UPDATE AND REPAIRED THE SEAT BELT UNDER NHTSA CAMPAIGN NUMBER: 19V814000 (SEAT BELT). THE CONTACT STATED THAT FOLLOWING THE REPAIRS, LATER THAT SAME DAY, THE CONTACT ATTEMPTED TO USE THE  PHONE AND  THE DASHBOARD ILLUMINATED WITH ALL KINDS OF WARNINGS, INCLUDED, BRAKE FAILURE, NO ABS BRAKE. NO POWER STEERING. ETC. THE VEHICLE WAS TAKEN BACK TO THE DEALER WHO STATED THAT THE PHONE APP SHOULD NOT BE USED WITH THE SOFTWARE UPDATE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED A CASE NUMBER: [XXX], TELLING THE CONTACT TO EXPECT A CALL BACK. THE CONTACT WAS NOT CALLED BACK. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 6,200. *DT  CONTACT STATED GMC PHONE APP REPAIRED.    ('PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).')*JB",
        "vin": "3GTU9FED3KG"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/08/2020",
        "dateOfIncident": "01/07/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297849,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA DENALI",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED MY VEHICLE ON JANUARY 7TH 2020 AT ABOUT 4:00PM TO RETURN HOME FROM WORK I RECEIVED MULTIPLE WARNING LIGHTS AND THE CHECK ENGINE LIGHT WENT ON. THE WARNS READ \"BREAK SYSTEM FAILURE 62 MPH TOO SPEED\", \"SERVICE ESC\",  \"STEERING ASSIST IS REDUCED DRIVE WITH CARE\", \"SERVICE TRAILER BREAK SYSTEM\". THE VEHICLE WOULD NOT BREAK PROPERLY I WOULD ESTIMATE THE BREAKING CAPACITY AT 30% FROM NORMAL. I TURNED OFF THE VEHICLE AND RESTARTED IT ABOUT 5 MINUTES LATER, ALL WARNINGS WERE GONE BUT THE CHECK ENGINE LIGHT WAS STILL LUMINATED, THE VEHICLES PERFORMANCE WAS REDUCED AND BREAKING WAS AT ABOUT 80% OF THE NORMAL CAPACITY. I HAVE MADE AN APPOINTMENT WITH THE DEALER FOR IMIDIATE SERVICE I SLOWLY AND CAREFULLY DROVE THE VEHICLE HOME. THE VEHICLE HAS APPROXIMATELY 1403 MILES ON IT.",
        "vin": "3GTU9FEDXKG"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/08/2020",
        "dateOfIncident": "01/08/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298009,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA DENALI",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE SYSTEM FAILURE 62 MPH TOP SPEED; BRAKE WARNING LIGHT; CHECK ENGINE LIGHT; ABS LIGHT; TRACTION CONTROL LIGHT; STEERING ASSIST IS REDUCED - DRIVE WITH CARE; SERVICE TRAILER BRAKE SYSTEM.... LIGHTS ON DASH AS NOTED ABOVE. BRAKE PEDAL MAKES A CLICKING; POWER STEERING NON-EXISTENT; BRAKES WILL NOT STOP VEHICLE WITHOUT MAX PRESSURE. HAPPENED AT LOW SPEED. BUMPED INTO CART AT STORE BEFORE GAINING CONTROL.  AFTER MULTIPLE SHUT DOWNS AND RESTARTS ALL LIGHTS NORMAL EXCEPT CHECK ENGINE LIGHT. BRAKES OCCASIONALLY MAKES CLICKING SOUND WITHOUT TOUCHING THEM. MILEAGE 6056",
        "vin": "1GTU9FE15KZ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/30/2019",
        "dateOfIncident": "10/26/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11292171,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA DENALI",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 GMC SIERRA DENALI. THE CONTACT STATED THAT THE REVERSE CAMERA AND THE FORWARD CAMERA FAILED, THE REVERSE AND FORWARD CAMERAS FLASHED, THE SCREEN BECAME BLUE IN COLOR, AND THE INSTRUMENT PANEL ALSO TURNED BLUE. THE VEHICLE WAS TAKEN TO AUTONATION GMC AND BUICK (330 NORTH GIBSON ROAD, HENDERSON, NEVADA 89014, (702) 558-3300), FOUR TIMES FOR THE FAILURE. THE DEALER TESTED THE ELECTRICAL SYSTEM AND REPROGRAMMED THE SOFTWARE ERROR. THE DEALER STATED THAT THE REARVIEW CAMERA AND VIDEO PROCESSING CONTROL MODULE VIDEO SOFTWARE WERE REPLACED; HOWEVER, THE REPAIR DID NOT CORRECT THE FAILURE. THE MANUFACTURER WAS CONTACTED AND PROVIDED CASE NUMBER: [XXX]. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 8,075. *DT*JB      ('PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).')*JB",
        "vin": "1GTU9FEL3KZ"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/28/2019",
        "dateOfIncident": "12/18/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291764,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA DENALI",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS IN FOR REPLACEMENT BACK UP CAMERA MODULE AND THE DEALER STATED THAT THE FIX FOR THE ACTIVE BRAKE SYSTEM FAILURE RECALL WAS COMPLETED.  AFTER STARTING THE VEHICLE IN A PARKING LOT, SEVERAL MESSAGES DISPLAYED IN THE DRIVER INFORMATION CENTER:  BRAKE SYSTEM FAILURE 62 MPH TOP SPEED, SERVICE ESC, SERVICE TRAILER BRAKE SYSTEM, SERVICE BRAKE ASSIST.  ADDITIONALLY, SEVERAL WARNING LIGHTS FOR THE ABS, PARKING BRAKE, TCS, CHECK ENGINE LIGHT, ETC WERE ILLUMINATED.      AFTER ACKNOWLEDGING THE MESSAGES, I PLACED THE VEHICLE IN REVERSE AND NOTICED THAT THE BRAKES NEEDED TO BE PRESSED WITH FULL WEIGHT ON THEM TO GET THE VEHICLE TO STOP.  I PLACED THE VEHICLE IN DRIVE TO PARK BACK IN SPACE AND THE SAME ISSUE WITH THE BRAKES PERSISTED.  I TURNED THE VEHICLE ON AND OFF 4 TIMES AND THE MESSAGES FINALLY STOPPED DISPLAYING AND THE BRAKES APPEARED TO WORK AS THEY NORMALLY SHOULD, ALTHOUGH THE CHECK ENGINE LIGHT REMAINED LIT.  THE VEHICLE WAS DRIVEN TO THE DEALERSHIP AND NO RESOLUTION HAS BEEN GIVEN FOR THE ISSUE TO DATE.",
        "vin": "1GTU9FEL1KZ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/20/2019",
        "dateOfIncident": "12/20/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290440,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA DENALI",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SHIFTS VERY HARD/SHUTTERS FROM 1ST GEAR TO 2ND GEAR AND LOW SPEEDS AND SLOW ACCELERATION.",
        "vin": "3GTU9FED9KG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/22/2019",
        "dateOfIncident": "08/17/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281804,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA DENALI",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I PURCHASED MY TRUCK ON 08/17/2019. THE WINDOW STICKER SAID MY HEATER BLOCK WAS DISABLE. THE SERVICE DEPT. SAID THERE IS A RECALL ON THIS. I CANNOT GO IN COLD WEATHER UNTIL THIS IS RESOLVED. CAN YOU TELL ME WHEN IT WILL BE RESOLVED.",
        "vin": "1GT42WEY8KF"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/15/2019",
        "dateOfIncident": "11/14/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281163,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA DENALI",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS FAULTY TRANSMISSION SYSTEM THAT AT SHAKES DURING USE OF THE VEHICLE AT ALL SPEEDS.  THE VEHICLE ALSO EXPERIENCES \"HARD SHIFTS\" AT LOW SPEED TO THE POINT THAT THE VEHICLE REAR TIRE \"CHIRP\" WITH SUCH FORCE THAT IT FEELS LIKE YOU'VE BEEN HIT FROM THE REAR BY ANOTHER VEHICLE.",
        "vin": "1GTU9FED0KZ"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/27/2019",
        "dateOfIncident": "12/15/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11235230,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA DENALI",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS FLICKER VIOLENTLY WHEN DRIVING AT ANY SPEED. ACCORDING TO THE DEALER THE ISSUE IS NORMAL. IT IS VERY DISTRACTING TO DRIVE AT NIGHT AND LIKELY DISTRACTING ON COMING TRAFFIC. THE TRUCK NOW HAS 13K MILES AND HAS GOTTEN WORSE TO THE POINT WE DON'T DRIVE IT AT NIGHT.",
        "vin": "1GT42WEY1KF"
    },
    {
        "components": "STRUCTURE,EQUIPMENT,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/21/2019",
        "dateOfIncident": "06/21/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221805,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA DENALI",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 GMC SIERRA DENALI. WHILE DRIVING 55 MPH, THE TONNEAU COVER DETACHED FORM THE BED OF THE VEHICLE. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 19E031000 (EQUIPMENT) ON MAY 11, 2019, THE SAME DAY AS THE COVER DETACHED FROM THE VEHICLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE DEALER AND MANUFACTURER WERE  CONTACTED. THE FAILURE MILEAGE WAS ALSO CLOSER TO 11,500. *JB",
        "vin": "1GTU9FEL7KZ"
    }
]