[
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/13/2021",
        "dateOfIncident": "04/10/2021",
        "fire": false,
        "manufacturer": "Highland Ridge RV",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407843,
        "products": [
            {
                "manufacturer": "Highland Ridge RV",
                "productMake": "HIGHLAND RIDGE",
                "productModel": "OPEN RANGE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HIGHLAND RIDGE OPEN RANGE RV. THE CONTACT STATED THE FRAMELESS WINDOW GLASS FRAME WAS EMERGING OUTWARDS. THERE WAS NO WARNING LIGHT ILLUMINATED. THE LOCAL DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 8,000.*DT",
        "vin": "58TCH0BTXK3"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/14/2019",
        "dateOfIncident": "04/19/2019",
        "fire": false,
        "manufacturer": "Highland Ridge RV",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245732,
        "products": [
            {
                "manufacturer": "Highland Ridge RV",
                "productMake": "HIGHLAND RIDGE",
                "productModel": "OPEN RANGE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING FROM ST. JAMES, NY TO MYRTLE BEACH, SC, WE STOPPED FOR LUNCH IN MECHANICSVILLE, VA.  IN ORDER TO TURN AROUND I HAD TO BACK INTO A DRIVEWAY.  WHILE BACKING UP MY BROTHER-IN-LAW SAID THAT THE TWO TIRES ON THE DOOR SIDE OF MY CAMPER WERE TOUCHING.  UPON FURTHER INVESTIGATION IT WAS DISCOVERED THAT THE REAR LEAF SPRING HANGER FAILED.  IT BROKE AT BOTH BENDS IN THE HANGER.  THIS ALLOWED THE REAR AXLE TO MOVE FORWARD CAUSING THE TWO TIRES TO TOUCH.    AFTER THIS HAPPENED, I FOUND MANY OTHER POSTS (FORUMS AND SOCIAL MEDIA) WHERE THIS HAS HAPPENED TO MANY OTHER PEOPLE.  SINCE LIPPERT MAKES THE CHASSIS THIS ISSUE IS NOT LIMITED TO ONLY HIGHLAND RIDGE CAMPERS.  I HAVE FOUND INSTANCES OF LEAF SPRING HANGER FAILURES OF GRAND DESIGN, HEARTLAND & FOREST RIVER.",
        "vin": "58TCH0BV5K3"
    }
]