[
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/18/2022",
        "dateOfIncident": "03/18/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457321,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 Honda Pilot Collision Mitigation System flashing BRAKE on screen average 3 times per day. Includes shaking of steering wheel & if cruise control on, braking. All this is happening when there is nothing blocking car. If cruise control on & need to respond to car that just pulled in front of me on highway, because the brake pedal is already suppressed by the car I can not respond properly. The only thing I have found to override the car is to push the gas pedal, which is also very dangerous!! Please help!! This is so dangerous. If something is actually happening on the road it is difficult to think about how to respond because the car is freaking out. The ability to think clearly & respond to unsafe situations is so important in those first few seconds. Honda mechanic said this is ‘just a side effect’ of a self driving car feature (cruise control) until Honda improves technology. There is no way to turn off Collision Mitigation Breaking System permanently",
        "vin": "5fnyf6h46kb"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/28/2022",
        "dateOfIncident": "02/08/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454481,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I have had the assisted emergency braking deploy itself with the Brake light blinking on the dash board when there is no reason for it to engage. No traffic around, just a sudden braking which pushes you forward in your seat and quickly scan all around you for impact which is not going to occur. I have heard of this happening to others but this has happened to me about 6 times and my husband has had it twice.",
        "vin": "5FNYF5H5XKB"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/25/2022",
        "dateOfIncident": "01/07/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453996,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "On several occasions the car has flashed BRAKE and then started braking when there has been no car in front of me.",
        "vin": "5FNYF6H53KB"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/25/2022",
        "dateOfIncident": "10/12/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454111,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving and the automatic braking engage with no vehicles around",
        "vin": "5FNYF5H5XKB"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/25/2022",
        "dateOfIncident": "07/12/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454151,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "While entering the express lane on I-595 E my Honda 2019 Pilot unexpectedly reduced speed applying the brakes.  There were no cars in front or behind me and the yet the emergency braking system was applied. This could have caused a rear end collision. In speaking with a local Honda service dealer he had said that this had also happened to him twice. My incident occurred approx. 1 year ago. I've also read that this issue has been identified in Honda CR-V's and Accords.",
        "vin": "5FNYF5H51KB"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/24/2022",
        "dateOfIncident": "12/07/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453920,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "When driving my Honda Pilot the Automatic Emergency Braking system has engaged multiple times (3-4 times with me, and once with my husband driving) in the middle of driving with there was no reason for the braking to occur - Meaning there were times when no cars were even in front of me. When this happens the orange BRAKE warning shows up on my dashboard advising \"BRAKE\" and my car jolts forward to strongly break. There has not been a recall on this issue, therefore, there has not inspection on my car specific to this issue. When this occurs it causes extreme panic on unawareness of what is going on. There is a threat of a crash behind me, especially when driving on roads 55 MPH, when the car all of a sudden out of nowhere comes to almost a complete stop. Also, it extremely distracts me due to the suddenness of this issue without any perceived warning. Therefore, I quickly try to understand if I do need to swerve or figure out how to quickly speed up after it brakes so no cars hit me from behind. Then it takes me awhile to calm down and understand what happened.",
        "vin": "5FNYF6H93KB"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/20/2022",
        "dateOfIncident": "02/15/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453093,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The engine turned off and the car went in to neutral gear while sitting at a stoplight. This happened 2x in 1 day. The first time, the car was in the \"auto engine idle\" mode and the second time I had disabled the feature so it was at a regular idle. The dash said the car was in accessory mode and to push the brake and start the car. I had to shift to park to be able to restart the car.  I had cars behind me honking the horn and was afraid I was going to be rear ended at the stoplight by the driver behind me. This is definitely a safety hazard!",
        "vin": "5FNYF6H04KB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/16/2022",
        "dateOfIncident": "02/12/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452332,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The battery to my pilot failed with either no warning or previous misdiagnosis by two different Honda dealerships.  The part is no longer available as I returned it for a core charge.  I'm not sure if there are codes in my vehicle that could be retrieved.  On Saturday February 12, I was driving my wife and two children in the vehicle ages 3 and 5.  The vehicle was stopped at one stoplight, the engine shut-off as part of the auto start/stop and when it did the auto restart the infotainment glitched.  It had been doing that off and on for a while and the dealers assured me my battery was fine on multiple service visits.  We had to stop at another stoplight and the vehicle shut-off and would not re-start.  I called a tow service hoping that they could jump start the vehicle.  It would not start and they had to tow the car.  I've had my vehicle for 2.5 years and 38,500 miles.  I am very disappointed that a vehicle this new would leave me stranded in the middle of the road.    I have been taking it to 2 different dealers for service.  First Jay Wolfe Honda where I purchased the vehicle and more recently Olathe Honda.  I have had both of them check the battery in 2021.  Both indicated that the battery was fine.  I went back to Olathe Honda today as I had discussed the factory battery with them.  I have a service report from September of 2021 that indicates they checked the battery and to see the attached test results.  I asked them to see the test results and they indicated that they don't typically attach them because they are printed on thermo paper.  The service report indicated the battery was fine.  If it wasn't fine, it would have been covered under warranty at this point.  There is not a record of what the battery tests truly indicated in September.",
        "vin": "5FNYF6H65KB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/10/2022",
        "dateOfIncident": "02/09/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451347,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "After the automatic engine start/stop feature turns on \"stops at a traffic light\", the car does not restart and the car requires repeated pushes on the start/stop engine button to restart.  The battery has been checked and it is in good condition.  The dealer is unable to replicate the issue as it happens intermittently.  It has occurred a number of times,",
        "vin": "5fnyf6h0xkb"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/09/2022",
        "dateOfIncident": "02/07/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451227,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Intermittently when starting my vehicle while seated or using the factory remote start, the vehicle will move/drive forward up to several inches. I took videos of this and have taken it to the Honda dealer 3 separate times. The most recent time, they told me it was acceptable and that Honda says it can move up to 5” and be within acceptable tolerances. This is very unsafe due to my vehicle moving when unoccupied and with the parking brake set. The problem was confirmed and reproduced by the dealer. When I voiced my concern about the safety aspect, I was told that there should be nothing within 4’ of my vehicle. I feel unsafe to park my vehicle because I can’t control how close someone parks in front of me. I feel unsafe to park in my garage because I don’t want my car to drive forward and hit my property. I don’t want my daughter any where near my car when I am simply starting it.",
        "vin": "5fnyf6h90kb"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/04/2022",
        "dateOfIncident": "01/01/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450345,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Honda Pilot. The contact stated that vehicle was equipped with the START/STOP feature; while at a stop, after releasing the brake pedal the vehicle stalled. The contact had to place the vehicle in park and restart vehicle. The heated seat on the driver side failed to produce heat. Additionally, while traveling at high speeds the vehicle stalled and was slow to restart. The vehicle was taken to the local dealer on several occasions where it was diagnosed, and the contact was informed that a rodent had chewed through the wires. The contact was also informed that the battery needed to be replaced. The vehicle was repaired however, the failure recurred. The manufacturer was not contacted. The approximate failure mileage was 41,000.",
        "vin": "5FNYF6H98KB"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/19/2022",
        "dateOfIncident": "01/18/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448077,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The rear hatch glass and gasket blew out when the rear side door was opened then shut (in cold weather-approx. 24 degrees F). If this had happened while the vehicle was in motion, it could pose a safety concern. Believe this failure was caused by a faulty component or an assembly error at the factory. Although Honda says this failure could be due to a pre-existing rock chip, this is highly unlikely since this is not the windshield, but the rear hatch glass.  Consumer stated now appears the window failure may have been due to vandalism and the initial damage could have been concealed by a layer of frost.",
        "vin": "5FNYF6H30KB"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "01/17/2022",
        "dateOfIncident": "01/14/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447724,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I drove our Honda Pilot during a moderate snow storm.  The collision avoidance system repeatedly recognized the snow as a vehicle and repeatedly applied the brakes at highway speed in heavy traffic.  It happened from Davenport, IA to Des Moines, IA on 14 Jan 22.  It also repeatedly tried to steer because the lane keeper assist kept malfunctioning.  On Sunday 16 Jan 22 we returned from Des Moines to Davenport and it repeatedly happened again.  On Sunday the roads were clear and there wasn't any precipitation in the air.  I washed the windshield and wiped off the sensor panel but it didn't stop.  The Honda dealer in Moline, IL told me that there was nothing they could do.  They said that happens in snow and rain and that I should wash the vehicle.  The vehicle is malfunctioning and dangerous.  It randomly applies the brakes and tries to steer itself at highway speed if there is any obstruction to the sensors.  I had to fight the steering wheel to keep it on the road when driving down the middle of the lane.  Having the car applying the brakes randomly at highway speed is also incredibly dangerous. I can't control how close semi trucks follow and several almost rear ended me.  They also got very upset because they thought I was doing it on purpose.  I can't wash the vehicle every time it snows or pull over every time it rains hard.  The dealers suggestions are not practical.    The malfunctioning lane keeper assist and automatic breaking on this vehicle is an accident waiting to happen.  Or it's already happened and isn't getting the credit it deserves.  The lane keeper assist and automatic breaking also can't be turned off, and shouldn't have to be.",
        "vin": "5fnyf6h46kb"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/17/2022",
        "dateOfIncident": "01/17/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447785,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Having Crackling noise coming from the front dash of my car which interferes with the radio and the screen of my radio. Seems to be the electrical problem but if it’s shutting down the radio it’s possible that it could totally shut down my car while driving .  It has become a safety issue.  Break problem getting a pop/clicking  noise in the front left & right tire has been put in shop 5 time never fixed.. they keep adding lubricant still have the same problem.. another safety hazard..",
        "vin": "5fnyf6h98kb"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/10/2022",
        "dateOfIncident": "01/08/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446934,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "We own a 2019 Honda Pilot Touring (VIN [XXX]).  We purchased our vehicle from Checkered Flag Honda in Norfolk, Virginia in June 2019.  This vehicle has 32,096 and is still under the factory bumper to bumper warranty.  We have been experiencing an issue with the systems Auto-Start Stop feature.  The vehicle's engine stops at a red light, and when we release the brake, on numerous occasions the vehicle fails to restart the engine and stalls in the middle of the road.  This has happened more than 15 times since we have owned the vehicle and puts us in an unsafe situation.  We took our vehicle in for service at Checkered Flag on 08/12/2021 and explained the problem we were having to the service technicians.  During that visit, they were not able to duplicate our engine stalling issue (see service record attached).  Since 08/2021, this issue has continued to occur 6-8 times since August.  The engine attempts to restart itself after letting off the brake or after a set period of time, however after attempting to crank the engine, the car beeps and has to be restarted manually.  When attempting to restart the car manually, the car will not start the next 2-3 attempts, and will eventually restart after multiple presses of the engine start button.  This is extremely unsafe as we are not able to move the vehicle, sometimes for a few minutes.  According to the service records, the technicians performed a battery check, and the battery was fine.  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "5FNYF5H94KB"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "12/18/2021",
        "dateOfIncident": "12/16/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444237,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving on highways that have had repairs done my lane departure sensing system has kicked in and both jerked my car over as well automatically slowed the speed.  The issue is that the car's sensors are reading the material used to repair the roads as if they are the lane markers and have pulled me out of an actual lane and caused my car to slow while on the expressway.  Twice this has happened during  rush hour and I was nearly rear ended twice and almost hit a car in the lane next to me once.  To be clear: in each of these incidents I was in a proper lane and was not drifting. The lane had repairs/patches done which caused the car's sensors to misread the lane's boundaries.",
        "vin": "5FNYF6H57KB"
    },
    {
        "components": "STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/05/2021",
        "dateOfIncident": "12/05/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442708,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Engine acceleration suddenly degrade in the highway 50 miles seems running like 20 miles even pressing the gas hard. also water coming from no where on the driver side floor when it rain Hard or light notice this since the day I bought it.",
        "vin": "5fnyf6h18kb"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/04/2021",
        "dateOfIncident": "12/04/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442641,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "While at a stop light the idle stop engaged but when I lift my foot off the brake to begin moving forward the auto-start failed to start and vehicle reported battery failure. Put Pilot in park and made 3-5 attempts to restart before successful. Cars nearly rear ended me and my children who were in the back.",
        "vin": "5fnyf6h06kb"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/03/2021",
        "dateOfIncident": "12/03/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442535,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Our 2019 Honda Pilot is equipped with idle stop, where the vehicle shuts off when at a red light.  The engine is supposed to restart once you release the brake peddle.  However, there have been numerous times when it has been slow to start, or fail to restart.  This causes a safety concern since you are stuck in an intersection with a green light and could get rear-ended.  We are just outside the warranty and a dealer has not reproduced the problem.  There are no other indication that the starter is bad and we've had the battery checked to make sure it is good.",
        "vin": "5FNYF6H62KB"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/28/2021",
        "dateOfIncident": "11/27/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11441850,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Front end impact into another vehicles passenger side. Other drivers side impact bags deployed mine did not. Seat belt pin engaged on my vehicle.",
        "vin": "5fnyf6h57kb"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/19/2021",
        "dateOfIncident": "11/19/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441102,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I started the Honda Pilot drove on a driveway about 30 feet to an intersection. When clear I accelerated onto the road. The car was very slow to accelerate and I slowly rolled onto the road barely avoiding an oncoming car. While in my lane I stopped and observed an AWD warning light on the dashboard. I turned the engine off then restarted the engine. The AWD warning light was off and the car drove normally. The next day when starting my car to leave a parking lot the AWD warning light appeared  on my dashboard. I turned the engine off then restarted the engine. The AWD warning light was off. I drove home without the AWD warning light reappearing.",
        "vin": "5fnyf6h07kb"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "10/19/2021",
        "dateOfIncident": "10/19/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437374,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "When driving on the interstate, car automatically applied breaks at 70+ MPH bringing speed down to 55 or less as it sensed a car in the right lane. However, there was clear lanes and no potential impact for a crash. The breaking almost resulted in me getting rear ended. Also, there have been numerous instances where the car has had sensors go off for collision warnings when I am driving in the city and there is no car in sight or I am turning left at a stoplight. This is not safe and needs to be addressed.",
        "vin": "5fnyf6H00kb"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/02/2021",
        "dateOfIncident": "10/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435221,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Car stalls at a stoplight. Battery was completely depleted so it wouldn't restart. I couldn't even open the windows on a hot day b/c the battery was depleted. Honda dealer in Richmond California tells me they can't replicate the issue and all the diagnostic tools they have indicate no problems. This is a serious safety issue that must be addressed.",
        "vin": "5FNYF6H07KB"
    },
    {
        "components": "VISIBILITY/WIPER,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "09/28/2021",
        "dateOfIncident": "09/20/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434670,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "What component or system failed or malfunctioned, and is it available for inspection upon request? - rear view camera  How was your safety or the safety of others put at risk? -I am unable to view if anything is obstructing my vehicle. Has the problem been reproduced or confirmed by a dealer or independent service center? I will be taking it in on 9/29 for diagnosis, seeing that my VIN is not eligible for bulletin 20-051 when bulletin states \" the rear view camera may not display  when shifting to  reverse\" Service bulletin 20-047 was previously done on the 25th of September.   Also, at the same time the rear camera stopped working, the rear wiper also stopped working.  Has the vehicle or component been inspected by the manufacturer, police, insurance representatives or others? No, it was not.  Were there any warning lamps, messages or other symptoms of the problem prior to the failure, and when did they first appear? No, I had no indication prior to failure.",
        "vin": "5FNYF5H3XKB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/14/2021",
        "dateOfIncident": "08/24/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432947,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "We have had ongoing issues with the satellite cutting out and losing signal (can’t use GPS and the clock just says 8:00 no matter what time) since about 20,000 miles. The vehicle now has about 32,000 miles on it. The larger issue happened a few weeks back. We were driving the car, came up to a 4 way stop and the car turned off. Never came back on. Couldn’t put it in neutral and get the car pushed off the road because the shifter is electrical. Honda roadside and Honda service department both told us there is no override so we had to sit in moving lanes until a tow truck could come. Had the car towed and the service department said it was the battery. They recharged the battery and sent us home. Said the “cells” tested fine so they could just recharge it. Less than 3 weeks later the car was parked at work and started fine. Went to the store and it was dead after a 10 minute errand. Got it jumped and drove to the service dept. It died again in the service dept receiving lane. They are again saying it is a battery issue and planning to replace the battery this time but said it could take 3-5 more times of having the issue before they know what is draining the battery. The largest safety issue is that the vehicle just turns off without notice while driving and there is no way to get it moved to a safe location because it can’t be put into neutral without power",
        "vin": "5FNYF6H93KB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/03/2021",
        "dateOfIncident": "04/02/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431593,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Cars jerks when accelerating or cruising at lower speeds.",
        "vin": "5FNYF5H52KB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/23/2021",
        "dateOfIncident": "08/13/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430146,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "This has been happening for a while now, probably the past yet, but its happening more frequently now.  I didn't think much of it until my husband noticed it while we were driving and started asking me about it and saying that could mean I have a transmission issue and need to get it looked at before my warranty is up since the car is relatively new and has less than 40,000 miles.  My warranty is up to 80,000 miles.  The date listed below is when my husband mentioned it.  When accelerating, at low RPMs, usually between 1 and 2 rpm, the car hesitates accelerating.  it lasts about 1 to 5 seconds.  I initially noticed it at low speeds, but now it's doing the same thing at higher speeds, but always when it's a low rpms.  It was sparsely happening, but now it's happening more frequently.  Sometimes the hesitation is kinda jerking you a few times, but other times, its a longer hesitation and your car kinda makes a sound like it all of a sudden just decided it was going to kick into gear and start going again.  This is a safety issue because if I'm pulling into traffic, changing lanes, crossing a road and my car hesitates or I can speed up fast enough when I should be able to, it could cause an accident.  I'm taking it to get looks at by Honda Cars of Katy on 8/25/2021.  They should be able to reproduce it since it happens quite frequently.  The vehicle has not been inspected by anyone yet for this issue.  There are no warning lights or messages on either.",
        "vin": "5fnyf5h37kb"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/11/2021",
        "dateOfIncident": "08/20/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428748,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Electronic system goes blank while driving;  popping noise from speakers is distracting",
        "vin": "5fnyf6h61kb"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "08/10/2021",
        "dateOfIncident": "07/08/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428482,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Honda Pilot. The contact stated while reversing, the rear-view camera screen went black and the most net connection off warning message was illuminated on the screen before it went black again. The contact took the vehicle to the local dealer to be diagnosed. The contact was informed that the most net connection cable needed to be replaced. The vehicle was repaired but continued to experience the failure. The contact stated that the failure was experienced several times. Upon investigation, the contact associated the failure with NHTSA Campaign Number: 20V440000 (Electrical System, Back Over Prevention) however, the VIN was not included. The manufacturer was not informed of the failure. The failure mileage was approximately 20,000.",
        "vin": "5FNYF6H0XKB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/09/2021",
        "dateOfIncident": "08/09/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428437,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The air conditioning went out. The condenser to replace has been discontinued by almost every parts seller. Took the car to Honda and they are not sure what the problem is so they want to rebuild the entire air conditioning system.",
        "vin": "5FNYF6H36KB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/22/2021",
        "dateOfIncident": "07/16/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425989,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "While stopped at a red light, the engine would completely shut off. I had to restart the car and it would take multiple attempts to turn it back on. The first time it happened, I thought it was a battery issue. But I had since changed the battery and the problem still occurs. It seems to happen when the idle mode is not turned off. This is dangerous as it could cause an accident to have your car suddenly stop working in the middle of traffic.",
        "vin": "5FNYF6H08KB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/12/2021",
        "dateOfIncident": "07/06/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424385,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "My husband and daughter were driving on the freeway normal speed limit, and the liftgate glass blew out. The car is not even 7000 miles, nothing hit it. After doing a little bit of research I came across posts where some people have had issues with other Honda models and the company does not cover glass under warranty. Lucky my daughter was not sitting at the back otherwise she would have been hurt with the flying glass. I feel this needs to be looked into further.",
        "vin": "5FNYF5H93KB"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "06/23/2021",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421992,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Honda Pilot.  The contact stated while driving at an undisclosed speed the contact noticed the rearview camera was showing a blank screen and would sporadically on its own. This disables the rearview camera and most other electronic systems in the vehicle. The contact stated the failure occurred several times. The contact took the vehicle to a local dealer where they informed the contact of a recall on the vehicle NHTSA campaign number: 20V439000 (back over prevention, electrical system) and performed the recall repair for the failure but that did not fix the failure. The contact took the vehicle to multiple dealers to have it inspected but could not diagnose the cause of the failure. The connectors and wiring are so sub-par that even the small amount of pressure on them caused by routine on-road driving is enough to cause them to disconnect the entire Infotainment system. In short, the vehicle cannot currently be repaired by any Honda dealer. The vehicle was not repaired. The manufacturer was made aware of the failure. The failure mileage was approximate 12,500 when the problem initially began. The vehicle currently has 27,000 miles. The infotainment system failure violates 2 Federal Motor Vehicle Safety Standards, FMVSS numbers 101 \"Control and Displays\" and 111 \"Rearview Mirrors\". Based on the information the contact has seen and learned from various Honda dealers, The Honda Motor Company is aware of this design flaw, as it has affected thousands of their vehicles. The Honda Pilot and the Honda Odyssey are the primary vehicles affected, but multiple other vehicles have also been affected. This can be easily supported by a simple search of the Internet. This failure is extremely dangerous. It has the very real potential to cause injury and death and needs to be corrected as soon as possible.",
        "vin": "5fnyf6h09kb"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/22/2021",
        "dateOfIncident": "06/21/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421765,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "my 2019 honda pilot's front panels lights goes off while driving. It includes radio screen, AC and other accessories button lights, and speedometer and other gauges. I went to dealership twice. First time they mentioned that it could be software issue and they updated the software. But that didn't resolve the issue and I had the same problem. Honda knew this fault in many other vehicle and they sent out a notice to get changed the MOST cord. Got changed it on May 29, but again it happened on June 21. This issue happens when I drive my vehicle more than 10-12 miles continuously.  This is a serious safety issue as the speedometer and other gauges shut down and could be dangerous while on highways. Also, the sudden shut down of info system's light changes the interior ambient lighting and could be a possible cause of an accident while driving at high speed.",
        "vin": "5FNYF5H52KB"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/19/2021",
        "dateOfIncident": "06/19/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421488,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The windshield randomly cracked in the lower passenger side of my 2019 honda pilot exl while i was driving i have done research and found this to be a common occurrence in these vehicles and a safety issue",
        "vin": "5FNYF6H52KB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/14/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420818,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "when auto engine idle is on after coming to a stop at a light or stop sign upon acceleration some times the car will stall and then an error message will come on the dash \"Collision Mitigation Braking System error\"  this happens multiple times a week when driving i have taken to honda dealership and the blew me off saying they could not replicate the issue but i have come across many other people online with the same issue.",
        "vin": "5fnyf5h95kb"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/14/2021",
        "dateOfIncident": "06/14/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420917,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Multiple vehicle battery failures. Vehicle fails to start after a vehicle is parked.  Alternator is overtaxed and unable to maintain battery charge. Each time vehicle required “jump starting” Noted vehicle has approximately 13,000 miles. Battery passed “Honda “ test.",
        "vin": "5FNYF6H01KB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/03/2021",
        "dateOfIncident": "06/03/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419582,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "May 2021, I received a recall letter from Honda Automobile Division regarding my 2019 Honda Pilot vehicle that may have a fuel pump module with, out of specification impellers. I purchased my new 2019 Honda Pilot, June 2019, from Honda of Kingsport. I scheduled the recall fix on Tuesday, June 1, for Friday June 4, 7am. Lilly, the young lady that scheduled the maintenance appointment verified that Honda of Kpt would have me a loan car ready to go when I arrived on Friday morning. 6pm, Thursday night (6/3/21) the evening prior to my service recall appointment, I receive a call from a Steve McCoy with Honda of Kingsport. He says he will NOT be able to accommodate the loaner car. When I challenge him, he then says he will be able to provide me a loan car. I ask him exactly what they will be doing and he proceeds to tell me they remove the back seat of the vehicle, go through an access door.... IN THE CAB OF THE VEHICLE, remove the fuel pump THROUGH the cab of the vehicle, and replace the fuel pump with a new fuel pump. He verified that this fix will result in gas fumes IN THE CAB OF MY VEHICLE!!!! I am a 66YO, Type 1 diabetic. I cant have interior painting done in my home, without leaving and Honda expects me to drive a vehicle with strong gas fumes in the cab impacting  my health! Honda will need to provide me a loan car for a week until the gas fumes are no longer in the cab of my car! PLEASE HELP ME?",
        "vin": "5fnyf6h15kb"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/28/2021",
        "dateOfIncident": "05/23/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418905,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Engine knock occurs at low rpm’s while under load. Was informed by a Honda Dealership Service Advisor that this is a known issue with 2019+ Earth Dreams V6 engines, and they have had a number of owners report the problem. The Service Advisor also informed me that Honda told his dealership the issue is caused by a faulty main engine bearing however, to date, Honda has not taken any formal action.  A main bearing failure can cause catastrophic engine failure which would increase the risk of a crash.",
        "vin": "5FNYF6H37KB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/20/2021",
        "dateOfIncident": "05/05/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417923,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "On 4-30-21, my 2019 Honda Pilot was repaired per recall for sudden loud speaker popping. I'd complained about that issue since buying the car. I'd also complained since purchase about frequent false collision mitigation system errors some of which engaged the brakes.  On Monday May 3, 2021 I was on a highway off-ramp going about 30 MPH when my steering wheel suddenly locked up, the collision mitigation system sounded, the brakes engaged, and the car began to swerve into the oncoming lane over the double yellow lines. I was momentarily unable to drive back into my own lane because the steering wheel was locked. A few seconds later, the car went back to normal and I was able to put my blinker on and pull over into the breakdown lane. I was very frightened so I took a few minutes to calm down. Luckily, there were no oncoming vehicles and no one behind me when it happened.   On May 5, 2021 I was driving my vehicle on I-95 at approximately the speed limit of 65 MPH when the steering wheel again locked up, the brakes briefly auto-engaged, and the a/c unit shut off. I was in heavy traffic and was immediately concerned I would be rear-ended and/or drift into another lane causing an accident. Luckily, the steering wheel unlocked within a few seconds and the brakes stopped engaging. I was able to regain control before there was an accident.   Shortly thereafter, I had the car serviced at the dealership. The mechanics said the sensor was slightly off but that didn't explain the steering wheel locking up and other symptoms. At my insistence, they dug further and consulted Honda mechanics. That research pointed them to the battery. They fixed a loose battery terminal and said that could explain the issues I was having. I learned by my own research that 2019 Honda Odysseys had a recall for a similar issue. The dealership indicated they were doing me a favor to \"help you out\" and this was a one-time thing. I would have to pay for any future work or escalate to Honda.",
        "vin": "5FNYF6H41KB"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/13/2021",
        "dateOfIncident": "05/13/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416487,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE SECOND TIME IN LESS THAN A WEEK THAT I'VE GOTTEN THE SAME ERROR MESSAGE ON MY TOUCHSCREEN",
        "vin": "5FNYF5H50KB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/06/2021",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415484,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AUTO IGNITION SHUTOFF TURNS THE VEHICLE OFF WHEN STOPPED, SUCH AS AT A STOP SIGN OR STOP LIGHT. THE VEHICLE IS SUPPOSED TO TURN BACK ON AUTOMATICALLY WHEN THE BRAKE IS RELEASED, BUT INSTEAD THE VEHICLE DIES REQUIRING YOU TO SCRAMBLE TO PUT THE VEHICLE IN PARK AND HIT THE IGNITION BUTTON. THE AUTO IGNITION SHUTOFF MUST BE TURNED OFF MANUALLY EVERY TIME YOU USE THE VEHICLE.",
        "vin": "5FNYF5H65KB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/30/2021",
        "dateOfIncident": "03/20/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414658,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION JERKING",
        "vin": "5FNYF6H92KB"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/20/2021",
        "dateOfIncident": "04/16/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11412988,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Michelin North America, Inc.",
                "productMake": "BFGOODRICH",
                "productModel": "RADIAL T/A",
                "productYear": "9999",
                "size": "P235/60R15 98S",
                "type": "Tire"
            }
        ],
        "summary": "SIDE-WALL BLEW OUT OF TIRE WHILE TRAVELING AT APPROXIMATELY 55-60MPH ON NORMAL, PAVED ROAD.  NO DEBRIS WAS HIT AT THE TIME OF FAILURE AND THERE WAS NO KNOWN HISTORY OF STRIKING DEBRIS WITH THE SIDEWALL.  TIRE HAD APPROXIMATELY 16,000 MILES ON IT (65,000 MILE TIRES) AND HAD BEEN ROTATED TWICE SINCE PURCHASE.",
        "vin": "5FNYF6H35KB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/16/2021",
        "dateOfIncident": "12/15/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407685,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 HONDA PILOT. CONSUMER WRITES REGARDING NHTSA SAFETY RECALL 20V-440. *LD    THE CONSUMER STATED HE WAS NOT SENT NOTIFICATION OF THE RECALL. *JS",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "04/13/2021",
        "dateOfIncident": "04/11/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407933,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INFOTAINMENT SCREEN GOES BLACK. NO REAR CAMERA VIEW SHOWN WHEN REVERSING. VEHICLE WAS BEING DRIVEN ON A PUBLIC STREET",
        "vin": "5FNYF5H3XKB"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/05/2021",
        "dateOfIncident": "04/05/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406414,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WENT TO HOLLER HONDA DEALER TO ADDRESS THE OUTSTANDING 2 RECALLS (FUEL PUMP AND TIRES) AND WAS TOLD BY SERVICE DEPARTMENT THAT MY VEHICLE HAS NO RECALLS ACCORDING TO HONDA SYSTEM.  HONDA SYSTEM NEEDS TO BE UPDATED WITH NHTSA SYSTEM.",
        "vin": "5FNYF5H69KB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/19/2021",
        "dateOfIncident": "09/17/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403834,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HONDA PILOT. THE CONTACT STATED WHILE DRIVING 40 MPH, THE VEHICLE STABILITY ASSIST WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER OCEAN HONDA (8442 US-19, PORT RICHEY, FL 34668, (727) 312-0759) AND THE DEALER WAS MADE AWARE OF THE FAILURE. THE CONTACT CONTINUED TO EXPERIENCE THE FAILURE. THE CONTACT STATED SHORTLY AFTER, THE DVD PLAYER FAILED TO TURN OFF AND DRAINED THE BATTERY. THE VEHICLE WAS TAKEN BACK TO THE DEALER AND THE BATTERY WAS REPLACED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V439000 (BACK OVER PREVENTION, ELECTRICAL SYSTEM) AND 20V440000 (ELECTRICAL SYSTEM, BACK OVER PREVENTION). THE CONTACT STATED THAT THE DEALER REPAIRED THE VEHICLE. THE CONTACT STATED THAT THE SPEEDOMETER WAS INOPERABLE. THE CONTACT PERFORMED A HARD RESET AND RECONNECTED THE BATTERY AND THE SPEEDOMETER OPERATED AS DESIGNED. THE MANUFACTURER HAD NOT BEEN INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 5,000.",
        "vin": "5FNYF6H40KB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/17/2021",
        "dateOfIncident": "02/15/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396679,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TOUCHSCREEN UNIT ON THIS CAR, WHICH CONTROLS THE ENTIRE VEHICLE AND CONTAINS THE BACKUP CAMERA, NAVIGATION, AND ALL SAFETY CONTROLS HAS NOT WORKED CORRECTLY SINCE THE DAY I BOUGHT IT BRAND NEW.  THE TOUCHSCREEN FREEZES WHILE DRIVING AND CANNOT BE USED FURTHER WITHOUT PARKING THE CAR, TURNING OFF THE ENGINE, OPENING THE DRIVER'S DOOR, AND THEN RE-STARTING THE VEHICLE.  THIS USUALLY, BUT NOT ALWAYS, RESETS THE TOUCHSCREEN UNTIL THE NEXT TIME IT HAPPENS.  THE CAR HAS BEEN TO THE HONDA DEALER EIGHT TIMES FOR THIS PROBLEM, AND THEY CANNOT FIX IT DESPITE HAVING WORKED DIRECTLY WITH HONDA SUPPORT TECHNICIANS.  THEY HAVE REPLACED NUMEROUS WIRING HARNESSES AND DONE SOFTWARE UPDATES.  ALL RECALL REPAIRS HAVE BEEN PERFORMED ON THE CAR BY THE DEALER, INCLUDING THE TWO RECALLS IN LATE 2020 THAT WERE INTENDED TO ADDRESS THESE VERY ISSUES, AND THE PROBLEM REMAINS.  THE MOST RECENT INSTANCE WAS FEBRUARY 15, 2021.  I SENT A CERTIFIED LETTER TO AMERICAN HONDA MOTOR CORP., TORRANCE, CA ON SEPTEMBER 10, 2020 (AND RECEIVED USPS CONFIRMATION OF DELIVERY) DESCRIBING THESE ISSUES AND ASKING THEM TO TAKE THE CAR BACK.  HONDA DID NOT RESPOND TO MY CERTIFIED LETTER.  A COPY IS ATTACHED.",
        "vin": "5FNYF6H53KB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/15/2021",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388309,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION HAS A HARD SHIFTING LOOSE POWER WHEN ACCELERATING SLIPPING GEAR I TELL THE DEALER THEY SAID I NEED TO WAIT OR GET WORSE BEFORE IT NEEDS TO FIXED",
        "vin": "5FNYF5H64KB"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "01/11/2021",
        "dateOfIncident": "07/15/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387568,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HONDA PILOT. THE CONTACT STATED THAT WHILE OPERATING THE VEHICLE, THE REAR CAMERA DISPLAY PANEL TURNED OFF AND ON CAUSING A VISIBILITY HAZARD WHILE REVERSING THE VEHICLE. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER GARDENA HONDA LOCATED AT 15541 S WESTERN AVE, GARDENA, CA 90249 AND REPAIRED UNDER NHTSA CAMPAIGN NUMBER: 20V440000 (ELECTRICAL SYSTEM) HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 100.",
        "vin": "5FNYF5H96KB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/06/2021",
        "dateOfIncident": "09/16/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385872,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 HONDA PILOT SUV. CONSUMER WRITES IN REGARD TO NHTSA RECALL NUMBER 20V-439 AND 20V440, SOFTWARE PROGRAMMING ERRORS-REAR VIEW CAMERA IMAGE MAY NOT DISPLAY. *AS    THE CONSUMER STATED AS A RESULT OF THE CAMERA IMAGE NOT BEING DISPLAYED, THE CONSUMER HIT AND DAMAGED THE SIDE REARVIEW MIRROR. THE MANUFACTURER WAS NOTIFIED AND DECLINED TO OFFER ANY ASSISTANCE. *JS",
        "vin": "5FNYF6H66KB"
    },
    {
        "components": "UNKNOWN OR OTHER,BACK OVER PREVENTION,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/28/2020",
        "dateOfIncident": "01/31/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385274,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INFOTAINMENT SYSTEM MALFUNCTIONS AND BACK-UP CAMERA DOESN'T WORK. THE ENTIRE SYSTEM CONCERNING THE SAFETY FEATURES DOESN'T WORK WHEN THE INFOTAINMENT SYSTEM MALFUNCTIONS. WE HAVE TAKEN OUR CAR TO HAVE THE ISSUE REPAIRED MULTIPLE TIMES, BUT NOTHING THE DEALERSHIP HAS DONE HAS PROVIDED A PERMANENT FIX. THIS HAPPENS SPORADICALLY WHETHER THE CAR IS STATIONARY OR IN MOVEMENT. THIS HAS BEEN ONGOING SINCE WE PURCHASED THE CAR IN JANUARY 2019.",
        "vin": "5FNYF6H92KB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/23/2020",
        "dateOfIncident": "12/23/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384770,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A USED 2019 HONDA PILOT TOURING AWD FROM GILLMAN HONDA IN FORT BEND, TX IN THE SUMMER OF 2020 AND AS OF THE LAST 2 MONTHS HAVE EXPERIENCED ISSUES WITH THE INFOTAINMENT SYSTEM WHERE THE SCREEN GOES COMPLETELY BLACK WHILE DRIVING. I GET AN ERROR MESSAGE SAYING THAT NETWORK HAS BEEN LOST AND EVENTUALLY THE SYSTEM REBOOTS OVER TIME BY ITSELF. THERE IS A CLASS ACTION LAWSUIT GOING ON WITH THIS AS A KNOWN ISSUE FOR MANY OWNERS AND NONE OF THAT WAS SHARED PRIOR TO BUYING THE VEHICLE.",
        "vin": "5FNYF6H61KB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/23/2020",
        "dateOfIncident": "10/09/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365904,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "UNEXPECTED MOVEMENT: INCIDENT #1. CAR PARKED ON LEVEL PAVEMENT IN PARK GEAR BUT MANUAL BRAKE NOT SET. I PRESSED BRAKE AND STARTED THE ENGINE. THEN LIFTED FOOT FROM BRAKE (WHILE CAR IS STILL IN PARK) AND THE BODY MOVED FORWARD 6-8 INCHES BEFORE I COULD REAPPLY THE BRAKES. INCIDENT #2 CAR PARKED IN PARK FACING STEEPLY DOWNHILL. ENGINE RUNNING WITH GEAR IN PARK. PRESSED REVERSE BUTTON AND LIFTED FOOT FROM BRAKE BUT BEFORE I COULD HIT THE GAS, THE CAR ROLLED FORWARD DOWNHILL ABOUT TWO FEET BEFORE I COULD REAPPLY THE BRAKE. ONCE THE BRAKE STOPPED THE CAR THEN THE REVERSE GEAR ENGAGED AND I WAS ABLE TO GO FROM BRAKE TO GAS PEDAL WITHOUT ROLLING.",
        "vin": "5FNYF6H98KB"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/16/2020",
        "dateOfIncident": "10/15/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364662,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DURING THE DAYTIME ON A ROAD WITHOUT ANY OTHER VEHICLE IN FRONT OF ME OR BEHIND ME, MY CAR'S AUTOMATIC EMERGENCY BRAKING SYSTEM ENGAGED ON ITS OWN WITHOUT ANY REASON. WHEN I BROUGHT THE CAR TO THE DEALERSHIP, THE SERVICE ADVISOR TOLD ME HE HAD BEEN GETTING OTHER COMPLAINTS ABOUT THE SAME PROBLEM FOR THIS VEHICLE.",
        "vin": "5FNYF6H32KB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/10/2020",
        "dateOfIncident": "10/10/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363745,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE THREE ISSUES. ALL ISSUES PUT MYSELF AND MY FAMILY'S SAFETY AT RISK. WE BROUGHT THE ISSUES TO THE ATTENTION OF THE DEALERSHIP SHORTLY AFTER PURCHASING. THEY JUST SHRUGGED THEIR SHOULDERS.     THE CRASH AVOIDANCE SYSTEM WILL OFTEN ENGAGE WHILE DRIVING WITH NOTHING IN FRONT OF THE VEHICLE. ONE EXAMPLE IS  IT ENGAGED SO HARD TO A STOP OUT OF THE BLUE I WAS NEARLY REAR ENDED. (CITY STREET) NOTE: THE SECOND/THIRD ISSUE I WILL DESCRIBE ALSO HAPPENED AFTER THE PREVIOUS EXAMPLE I JUST GAVE....THE SECOND ISSUE INVOLVES INCONSISTENT THROTTLE RESPONSE TIME FOR THE VEHICLE. IT IS DANGEROUS BECAUSE  IF I AM PULLING OUT OR SWITCHING LANES WHILE DRIVING I TIME THE ACTION BY BEING ABLE TO MERGE INTO TRAFFIC AND BY THAT TIME I'M COMMITTED TO SUCH ACTION AND WHEN THE THROTTLE DOESN'T RESPOND I END UP PULLING OUT LATE AND CUTTING ANOTHER CAR OFF WHEN NORMALLY I WOULD HAVE PLENTY OF TIME.     THE THIRD ISSUE IS THE LONG PAUSE AFTER I GO FROM REVERSE TO DRIVE. IT OFTEN TAKES SEVERAL SECONDS...I WAS BACKING OUT OF A DRIVEWAY ONTO A CITY STREET AND AFTER SHIFTING TO DRIVE FROM REVERSE I WAS A SITTING DUCK FOR AT LEAST 3 SECONDS. I AM BEING QUITE CONSERVATIVE WITH THE LENGTH OF THE PAUSE...IT WAS THE LONGEST PAUSE EXPERIENCED IN RECENT MEMORY. THIS HAS ALWAYS BEEN AN ISSUE...",
        "vin": "5FNYF6H69KB"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/05/2020",
        "dateOfIncident": "07/15/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362841,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2019 PILOT ELITE HAS 16,400 MILES ON IT JUST STARTED A COUPLE MONTHS AGO WHERE I WOULD GET TO 2425 MILES AN HOUR IN THE CAR WITH LUNCH OR LURCH IT HAPPENS ALSO SOMETIMES WHEN I GET TO 30 SOME MILES AN HOUR IT ALL LURCHER LUNCH. LAST FRIDAY I MADE A LEFT TURN ONTO A MAJOR STREET AND WENT TO ACCELERATE IN THE CAR JUST WOULDN'T DO ANYTHING IT WOULDN'T ACCELERATE IT SLOW DOWN AND I HAD TO PULL OVER TO THE SIDE AND PUT MY FLASHERS ON I HAD TO WAIT A WHILE PROBABLY A MINUTE OR SO AND THEN I COULD PRESS MY FOOT ON THE EXCELERATOR AND GO FORWARD.  THIS LURCHING OR LUNGING DOES NOT HAPPEN ALL THE TIME IT COULD BE ON A CITY STREET WHEN IT HAPPENS IT CAN BE WHEN I GO TO ACCELERATE TO GET ON THE EXPRESSWAY I HAVE MENTIONED THIS TO MY MECHANIC AT HONDA AND THEY DON'T SEEM TO KNOW WHAT THE PROBLEM WOULD BE I'M WONDERING IF THERE IS RECALL THAT I MIGHT'VE MISSED OR THERE'S SOME THING THAT SOMEONE KNOWS I CAN'T BE THE ONLY ONE THAT THIS IS HAPPENING TO.",
        "vin": "5FNYF6H0XKB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/02/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362377,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RADIO/BACKING CAMERA/PHONE...PANEL  GOES BLACK WHILE I AM DRIVING DAILY ON CITY STREETS OR THE HIGHWAY. SOMETIMES THE SPEED AND INDICATOR PANEL ALSO GOES BLACK WHILE I AM DRIVING.  I HAVE TAKEN THIS IN MULTIPLE TIMES SINCE I PURCHASED THE CAR AND THEY HAVE NOT RESOLVED IT.",
        "vin": "5FNYF6H5XKB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/29/2020",
        "dateOfIncident": "08/03/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361724,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CENTER CONTROL PANEL WAS RECALLED DUE TO THE COMPUTER SYSTEM MALFUNCTIONS. I TOOK THE VEHICLE TO THE DEALER FOR THE REPAIR. NEVERTHELESS, THE CONTROL PANEL CONTINUES TO SPORADICALLY SHUT DOWN WHILE THE CAR IS IN OPERATION. IT TYPICALLY STARTS WITH AUDIBLE CLICKS AND INTERMITTENT RADIO RECEPTION. I WILL THEN GET MESSAGES SUCH AS 'CHECK TUNER,' AUDIO SIGNAL LOST, 'NO AUDIO CONNECTION TO FM,' 'NETWORK COMMUNICATION LOST,' AND 'MOST NETWORK LOST.' THE SYSTEM WILL CONTINUE TO SHUTDOWN, GO COMPLETELY BLACK,  AND THEN REBOOT. AT TIMES THE PANEL IS BLACK FOR 10 MINUTES OR MORE. SOMETIMES THE REBOOTS ARE A CYCLE OF CONTINUING EVENTS FOR MY ENTIRE COMMUTE (ABOUT 35 MINUTES) OF JUST ONE REBOOT AFTER ANOTHER. DURING THIS TIME, THE BACKUP CAMERA, RADIO, AND CONNECTIVITY TO MY PHONE DO NOT WORK. IN FACT, UNLESS I TURN OFF THE BLUETOOTH ON MY PHONE, IT WILL MOMENTARILY CONNECT TO MY PHONE WHEN IT REBOOTS AND THEN IMMEDIATELY DISCONNECT ANY CALL I AM ON BECAUSE THE SYSTEM SHUTS DOWN AGAIN. I HAVE UPLOADED 3 PICTURES OF EXAMPLES OF MY SCREEN. (THE LAST PICTURE IS JUST A BLANK SCREEN). I HAVE A VIDEO OF AN EVENT, BUT IT COULD NOT BE UPLOADED.",
        "vin": "5FNYF6H55KB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/25/2020",
        "dateOfIncident": "07/03/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361186,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS HAS BEEN GOING ON SINCE I BOUGHT THE CAR TWO YEARS AGO. AUDIO CONSTANTLY GOES OUT EVERYDAY. WHEN I OPEN ANY DOOR IT TURNS OFF WITH OR WITHOUT BLUETOOTH CONNECTED. THERE IS NO FUNCTION TO THE RADIO, SATELLITE RADIO BLUETOOTH NOTHING. AND THERE IS A CRACKING STATIC SOUNDS IT MAKES. SCREEN MALFUNCTIONS, GOES BLACK THAN COMES BACK BUT NO WAY TO WORK IT WITH THE TOUCHSCREEN. HAVE HAD TO HONDA DEALERS 5 TIMES AND NOTHING HAS CHANGED EVEN WITH THE RECALL DONE.",
        "vin": "5FNYF5H93KB"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/18/2020",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11359827,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED BRAND NEW ELITE 2019 PILOT IN APRIL OF 2019.  IMMEDIATELY AFTER PURCHASE I HAD HORRIBLE STATIC COMING THROUGH ALL SPEAKERS, AT TIMES VEHICLE WOULD NOT START, RANDOMLY THE VEHICLE WOULD SENSE A COLLISION EVEN WHEN I WAS ONLY ONE ON ROAD, WINDSHIELD WIPERS COME ON RANDOMLY AND OTHER ELECTRICAL ISSUES WOULD OCCUR, BRAKE LIGHT FLASHES RANDOMLY.  I DO NOT FEEL SAFE DRIVING THIS VEHICLE AT ALL.  .  I HAVE TAKEN IT IN THREE TIMES NOW AND EVERY TIME I AM TOLD THAT THERE IS NOTHING WRONG WITH THE VEHICLE.  I HAVE BEEN ASKED TO TAKE VIDEOS OF IT WHEN IT OCCURS.  THIS IS INSANE AS MY CELL PHONE IS DISABLED WHILE I AM DRIVING.  SO, BASICALLY THEY ARE ASKING ME TO GET PHONE, ENABLE IT AND TAKE A VIDEO ALL WHILE I AM DRIVING WITH THE VEHICLE DOING ALL SORTS OF UNSAFE THINGS.  I HAVE COME CLOSE TO BEING IN A NUMBER OF ACCIDENTS DUE TO THE RANDOM COLLISION BRAKING OCCURING.  I REFUSE TO DRIVE THE VEHICLE ON THE FREEWAY AS I DO NOT FEEL SAFE AT ALL DRIVING IT.  THIS HAS OCCURED ON THE FREEWAY, HIGHWAYS AND CITY STREETS.  I ALWAYS DRIVE IN A LANE WHERE I CAN PULL TO THE SIDE IF SOMETHING OCCURS.  I DID NOT PAY OVER 50,000 FOR A VEHICLE TO NOT FEEL SAFE DRIVING.  I AM TIRED OF HONDA TELLING ME THAT THEY CANNOT FIND ANYTHING WRONG WITH THE VEHICLE.  BASICALLY IMPLYING THAT I AM CRAZY AND THIS DOES NOT OCCUR UNLESS I CAN GET A VIDEO OF IT WHEN IT IS HAPPENING. ALL SERVICES HAVE BEEN DONE AT THE MORGAN HILL, CA 95037 HONDA DEALERSHIP.  I HAVE ALL PAPERWORK ON IT BUT IT IS CURRENTLY AT DEALERSHIP NOW AGAIN AND THE PAPERWORK DOCUMENTATION IS BEING ATTACHED AND THEY HAVE RECORDS IN THEIR FILES AS WELL.  I DO NOT KNOW WHAT MY NEXT STEP IS IN GETTING HELP SINCE THE DEALERSHIP JUST SHARED THERE IS NOTHING THEY CAN DO FOR ME SINCE THEY DON'T HAVE A VIDEO AND OR WITNESS THESE ISSUES FIRSTHAND.  CAR SERVICED ON 7/25/19, 4/13/20 AND 9/18/20 AT HONDA DEALERSHIP IN MORGAN HILL, CA",
        "vin": "5FNYF6H07KB"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/08/2020",
        "dateOfIncident": "09/08/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353801,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "9/8/20 AT 7:45AM  A CLEAR SUNNY MORNING ON MY WAY TO WORK.  I WAS STOPPED AT A RED LIGHT AND WHEN THE LIGHT TURNED GREEN I PUSHED ON THE ACCELERATOR. AS SOON AS I STARTED TO PICK UP SPEED ~15-20 MPH, MY HONDA PILOT SENSED ANOTHER \"INVISIBLE\" COLLISION HAZARD AND ENGAGED THE AUTOMATIC COLLISION AVOIDANCE BRAKING SYSTEM. THE AUTOMATIC BRAKING SYSTEM SLAMMED ON THE BRAKES AND BROUGHT THE VEHICLE TO AN IMMEDIATE AND COMPETE STOP WHILE I WAS TURNING IN THE MIDDLE OF THE INTERSECTION AND THE TRUCK BEHIND ME ALMOST REAR-ENDED ME. THIS FAULTY AUTOMATIC COLLISION AVOIDANCE BRAKING SYSTEM SLAMMING ON THE BRAKES FOR NO REASON AT ALL IS GOING TO SEVERELY INJURE OR KILL SOMEONE! I AM AFRAID TO DRIVE HOME FROM WORK.",
        "vin": "5FNYF6H93KB"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/08/2020",
        "dateOfIncident": "09/07/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353802,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "9/7/2020 AROUND 2:15PM ON A BEAUTIFUL CLEAR, SUNNY DAY, MY 2019 HONDA PILOT INCORRECTLY SENSED AN \"INVISIBLE\" COLLISION HAZARD AND ENGAGED THE AUTOMATIC COLLISION AVOIDANCE BRAKING SYSTEM. THERE WAS NOT EVEN A VEHICLE DRIVING IN FRONT OF ME.  MY 2019 PILOT AUTOMATICALLY  SLAMMED ON THE BRAKES AND BROUGHT THE VEHICLE TO AN IMMEDIATE AND COMPETE STOP WHILE I WAS DRIVING 55 MPH ON A BUSY HIGHWAY. THE VEHICLE BEHIND ME ALMOST REAR-ENDED ME. THIS FAULTY AUTOMATIC COLLISION AVOIDANCE BRAKING SYSTEM, SLAMMING ON THE BRAKES FOR NO REASON AT ALL, IS GOING TO SEVERELY INJURE OR KILL SOMEONE!",
        "vin": "5FNYF6H93KB"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/07/2020",
        "dateOfIncident": "09/07/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353494,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2019 HONDA PILOT BRAKE PEDAL GOT LOCKED UP, CAN'T START THE ENGINE WITH THE REMOTES ON ME. AND POSSIBLE MISSING WELDS.",
        "vin": "5FNYF6H55KB"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/07/2020",
        "dateOfIncident": "09/07/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353603,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SHUTS OFF COMPLETE AND DOESN'T START BACK WHEN USING AUTO IDLE STOP. I GOT STUCK AT AT HEAVY TRAFFIC ROADS AND TRAFFIC LIGHTS FREQUENTLY. I AM ALSO EXPERIENCING LOSS OF POWER OR THE CAR; HESITATION AND RAVING WHEN GASING. I HAVE TAKEN THE CAR TO HONDA SERVICE FEW TIMES ALREADY, BUT THEY WERE UNABLE TO FIND ANY ISSUES. AT LAST VISIT TO HONDA SERVICE, BATTERY WAS TESTED AND INSPECTED EVERYTHING ELSE AND WAS DOCUMENTED NO ISSUES FOUND. THIS ISSUE IS BEING HAPPENING SINCE APRIL. PLEASE ADVICE WHAT I NEED TO DO TO FIX THIS ISSUE.  DID I BUY A LEMON?",
        "vin": "5FNYF6H68KB"
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": true,
        "dateComplaintFiled": "08/18/2020",
        "dateOfIncident": "08/07/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350012,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I WAS BACKING MY CAR, I SAW A WHITE CAR APPROACHING FROM MY REAR END CAMERA BUT THERE WAS NO SOUND OR WARNING SOUND AS USUAL. I STOPPED MY CAR UNTIL THE CAR PASSED BY. THEN I STARTED BACKING SLOWLY WITHOUT SEEING ANY CAR MOVING OR APPROACHING. SUDDENLY I SAW AN OLD DARK GREEN HONDA CRV CAR ON MY REAR BACK CAMERA CAME FROM NOWHERE WITH HIGH SPEED AND NO WARNING OR SOUND. I PRESSED MY BRAKE IMMEDIATELY. I DID NOT FEEL ANY PULSE OR COLLISION. WHEN I DROVE HOME AND FOUND A SMALL DAMAGE ON MY CAR REAR BUMPER. I FILED AN ACCIDENT REPORT M0153386 IN WASHINGTON STATE.",
        "vin": "5FNYF6H3XKB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/06/2020",
        "dateOfIncident": "08/06/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343729,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INFOTAINMENT SYSTEM MAKES STATIC NOISE THE SEEMS TO REBOOT. NETWORK COMMUNICATION LOST. DASH CONSOLE GOES BLANK FOR 1 MIN THEN SHOWS UP AGAIN.   THIS HAPPENS EVER TIME YOU DRIVE THE PILOT. NO RADIO FUNCTIONALITY ANYMORE. HONDA DEALER SAYS THERE IS NO FIX.",
        "vin": "5FNYF6H48KB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/05/2020",
        "dateOfIncident": "07/15/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343537,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "NAVI-SCREEN GOES BLACK,  INSTRUMENT PANEL GOES BLACK. THIS OCCURRED IN OCT.2019 WHILE ON A LONG TRIP. UNPREDICTABLE & UNRELIABLE, COULDN'T USE NAVIGATION SYSTEM AT ALL--OCCASIONALLY BOOTED UP & WOULD WORK FOR A FEW HOURS AT A TIME.  CHAPMAN HONDA TUCSON WAS ABLE TO FIX THE PROBLEM BUT HAD TO KEEP OUR VEHICLE FOR MANY DAYS.  HAS NOW REOCCURRED, BEGAN IN MID-JULY & CONTINUES TO  MALFUNCTION CONSISTENTLY. ALTHOUGH MECHANICALLY THE VEHICLE WORKS WELL, IT IS QUITE DISTRACTING & A BIG SAFETY ISSUE FOR ME, TO HAVE NO INSTRUMENT PANEL OR OTHER VISUAL DATA TO RELY ON WHILE DRIVING.  COMPUTER SCREEN/DASH PANEL/NAVIGATION SYSTEM SIMPLY QUITS; IT APPEARS TO HAPPEN INDEPENDENTLY OF THE MECHANICAL WORKING OF THE VEHICLE, IE, IN ALL SITUATIONS, ALL TIMES OF DAY OR NIGHT, ANY & ALL ROAD OR WEATHER CONDITIONS.",
        "vin": "5FNYF5H01KB"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/04/2020",
        "dateOfIncident": "06/17/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343335,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ERROR MESSAGE 'THE VEHICLE STABILITY ASSIST SYSTEM HAS A PROBLEM. USE EXTRA CAUTION WHEN BRAKING AND CORNERING. HAVE YOUR VEHICLE CHECKED BY A DEAL IMMEDIATELY.' THIS HAS HAPPENED 7 TIMES IN THE LAST 10K MILES AND THE DEALER HAS IGNORED THIS ISSUE AND CALLED IT NORMAL",
        "vin": "5FNYF6H97KB"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "07/24/2020",
        "dateOfIncident": "07/03/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11341273,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "HONDA PILOT 2019 -DRIVING ON A HIGHWAY WITH MY WHOLE FAMILY WITH 3 KIDS AT THE BACK, AT A SPEED ~40MPH. THE LANE IN WHICH I WAS DRIVING (RIGHT) SLOWED DOWN, SO MOVED TO THE LEFT LANE. THAT LANE WAS ALSO SLOWING AS I CAN SEE THE CARS IN THE FRONT SLOWING DOWN AND STOPPING. MY ATTEMPTS TO STOP THE CAR PROVED FUTILE. THE CAR DID NOT STOP. 1) REPEATED PUMPING OF THE BREAKS DID NOT YIELD TO STOP THE CAR. HONDA PILOT COLLIDED WITH THE CAR IN THE FRONT. 2) THE CARS SYSTEM TO SLOW THE CAR WHILE APPROACHING A VEHICLE IN THE FRONT DID NOT FUNCTION. 3) AIRBAGS DID NOT DEPLOY AT ALL - NONE OF THE AIRBAGS DEPLOYED. - COLLISION CENTER WAS LITERALLY BAFFLING, OVER THIS - HAVE NO CLUE HOW THE AIRBAGS DID NOT DEPLOY WITH THIS KIND OF A COLLISION.   I SERIOUSLY SUSPECT THAT THERE IS SOME THING SERIOUSLY FLAWED. SINCE I'M NOT AN AUTOMOBILE ENGINEER, I'M NOT SURE OF TECHNICALITY INVOLVED IN THIS. SOMETHING WENT WRONG TERRIBLY, THAT THE CAR DID NOT STOP ON BRAKING, CAR DID NOT SLOW DOWN, & THE AIRBAGS DID NOT DEPLOY.   WHEN INFORMED ABOUT THIS TO HONDA, HONDA WAS REFERRING TO GEICO, THAT THEY WILL DO THE INVESTIGATION. GEICO SAYS THAT ITS NOT THEIR PROBLEM AND HONDA SHOULD DO THE INVESTIGATION. AS A COMMON MAN I WOULD LIKE TO HAVE THIS PROBLEM INVESTIGATED AND NECESSARY ACTION TO BE TAKEN. I SEE THEY SUBROGATE EACH OTHER, WHICH IS NOT CORRECT. I'M NOT SURE HOW MANY CARS ARE RUNNING IN THIS CONDITION ON THE ROAD. PLEASE DO TAKE NECESSARY STEPS TO CHECK ON THIS.  I CAN GIVE ALL THE REQUIRED DOCUMENTS, PICTURES AND POLICE REPORTS IN THIS REGARD.  I NEED ASSISTANCE IN INVESTIGATION OF THIS ACCIDENT AND FIND OUT WHY THE CAR DID NOT RESPOND. I SEE THAT THERE ARE OTHER RECALLS WITH REFERENCE TO HONDA PILOT 2019, THOUGH MY CAR IS NOT ON THE RECALL, I HAVE MY DOUBTS THAT THERE IS MALFUNCTIONING COMPONENT IN THE CAR, THAT HAS CAUSED THIS FLAW. HOPING TO HEAR FROM YOU SOON. THANK YOU.",
        "vin": "5FNYF6H91KB"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/22/2020",
        "dateOfIncident": "06/30/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340887,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING THE VEHICLE, THESE MESSAGES SHOWN ON THE SCREEN FROM TIME TO TIME:  BRAKE, EMISSION SYSTEMS PROBLEMS AND LOW TIRE PRESSURE.",
        "vin": "5FNYF6H16KB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "07/21/2020",
        "dateOfIncident": "07/07/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340686,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SHOULD KNOW IF THE BACK-UP AUDIBLE AND VISUAL DETECTION ALARM SYSTEMS HAVE BEEN DEACTIVATED.  IN THE CASE OF MULTI-DRIVERS, THE SYSTEM SHOULD ALWAYS DEFAULT TO 'ON'.   ON THE 2019 HONDA PILOT, NO WARNINGS ARE PROVIDED IF THE SYSTEMS HAVE BEEN ACCIDENTALLY OR INTENTIONALLY DEACTIVATED.  SO, IF SOMEONE DEPRESSES THE MOMENTARY DEACTIVATION BUTTON, THE DRIVER DOES NOT RECEIVE ANY PRECAUTIONARY WARNING INDICATION ON THE BACKUP CAMERA SCREEN.     WE HAD TWO BACKUP ACCIDENTS IN ONE WEEK BEFORE WE FIGURED OUT WHAT WAS GOING ON.  NOW WE HAVE TO VERIFY THAT THE SYSTEM IS 'ON' EVERY TIME WE START THE CAR.      WHAT SHOULD HAPPEN:   UPON STARTING THE CAR, THE AUDIBLE AND VISUAL ALARMS SHOULD DEFAULT TO THE FULL ENERGIZED MODE.  SECONDARILY, IF THE DRIVER CHOOSES TO DEACTIVATE THE SYSTEM, ONLY THE AUDIBLE ALARMS SHOULD BE DEACTIVATED. THE BACKUP SCREEN SHOULD ALSO WARN THAT THE AUDIBLE ALARM IS DISABLED. UNDER NO CIRCUMSTANCES SHOULD THE  BACKUP SCREEN'S VISUAL ALARMS EVER BE DEACTIVATED.     THE EXISTING SYSTEM IS EXTREMELY DANGEROUS AND A FATALITY WILL EVENTUALLY OCCUR.  THE CORRECTIONS APPEAR TO BE JUST PROGRAMMING CHANGES. HONDA HAS FAILED TO PERFORM THE PROPER PROCESS HAZARD REVIEW (HAZOP) OF THE BACKUP SYSTEM.      I HAVE INFORMED HONDA AND THEY TOLD ME THEY WOULD FILE MY COMPLAINTS.",
        "vin": "5FNYF6H0XKB"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/06/2020",
        "dateOfIncident": "07/03/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337656,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JULY 3, 2020, AFTER REVERSING OUT OF MY GARAGE ONTO MY DRIVEWAY, I PUT THE CAR IN DRIVE AND WHEN I PRESSED THE ACCELERATOR, THE CAR SHIFTED INTO PARK ON ITS OWN. I TRIED AGAIN AND IT DID IT AGAIN. MY HUSBAND AND KIDS WERE IN THE CAR AND MY HUSBAND SAID \"IT DID THIS TO ME THE OTHER DAY TOO.\" I GOT MY PHONE OUT AND TOOK VIDEO OF IT OCCURRING TWO MORE TIMES. EACH TIME I PUT THE CAR IN DRIVE AND PUSHED ON THE ACCELERATOR, IT SHIFTED INTO PARK ON ITS OWN AFTER MOVING FORWARD.IT DID THIS WITH OR WITHOUT A SEAT BELT ON. THE VIDEO IS AN MP4 FILE AND THERE DOES NOT SEEM TO BE A WAY TO ATTACH IT ONLINE, BUT I AM HAPPY TO PROVIDE IT UPON REQUEST.",
        "vin": "5FNYF5H94KB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/14/2020",
        "dateOfIncident": "11/20/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328813,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS ISSUE HAS HAPPENED SEVERAL TIMES SINCE BUYING THE PILOT IN 2019. WHILE DRIVING THE CAR, THE INFOTAINMENT SYSTEM FREEZES UP AND STOPS WORKING. THE USE OF THE BACKUP CAMERA, RADIO, GPS, AND ANY OF THE FEATURES ON THE SCREEN ARE NOT USABLE. WE NOTICE THIS HAPPENS A LOT WHEN WE TAKE FAMILY TRIPS. THE ONLY THING DIFFERENT WE DO ON TRIPS IS PACK THE CAR OPENING AND CLOSING THE TRUNK AND DOORS. TO GET THE SYSTEM TO WORK AGAIN YOU HAVE TO TAKE PARTS OFF TO GET TO THE CARS MAIN BATTERY AND DISCONNECT THE NEGATIVE TO RESTART THE SYSTEM. WHEN THE INFOTAINMENT SYSTEM FREEZES YOU HEAR A LOUD SCREECHING NOISE OVER THE SPEAKERS LIKE THE ELECTRONICS ARE SHORTING OUT. IS THIS COMMON WITH THE 2019 HONDA PILOT? STOPING ON TRIPS TO REMOVE CAR PARTS TO GET TO THE BATTERY IS FRUSTRATING. I'M WORRIED IF THIS COULD LEAD TO A CAR FIRE WHILE MY WIFES DRIVING WITH THE KIDS.",
        "vin": "5FNYF5H50KB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/12/2020",
        "dateOfIncident": "05/18/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328544,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2019 HONDA PILOT HAS BEEN MAKING STATIC LIKE POPCORN POPPING SOUNDS FOR SOME TIME. MY WIFE WENT INTO LABOR AND WE WERE RUSHING TO THE HOSPITAL IN THE POURING RAIN DRIVING ON THE HIGHWAY, AND THE POPPING SOUND STARTED AGAIN AND ALL THE ELECTRONICS SHUT DOWN.     I WAS UNABLE TO SEE THE SPEED, NAVIGATION ETC. AND IT FELT QUITE DANGEROUS.    WE TOOK THE CAR IN FOR SERVICE AND WE WERE TOLD THAT A RESET HAD BEEN PERFORMED AND ALL THE ELECTRONICS SHOULD FUNCTION NORMALLY.    JUST THIS PAST FRIDAY, I WAS DRIVING MY DAUGHTER IN THE CAR AFTER THE ISSUE WAS SUPPOSEDLY FIXED, AND THE POPPING STARTED AGAIN, I ASKED HER TO TAKE OUR HER PHONE TO VIDEO THE SOUNDS, AND MOMENTS LATER SHE GOT A SECOND VIDEO OF ALL THE ELECTRONICS SHUTTING DOWN AGAIN. VERY FRIGHTENING.   *TR",
        "vin": "5FNYF5H93KB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/12/2020",
        "dateOfIncident": "05/12/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324266,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HONDA PILOT. THE CONTACT STATED WHILE DRIVING 10 MPH, THE BRAKE PEDAL WAS DEPRESSED AND THE VEHICLE STALLED WITHOUT WARNING. THE CONTACT STATED THAT THE VEHICLE WAS UNDRIVABLE. THE VEHICLE WAS NOT TAKEN TO BE DIAGNOSED NOR REPAIRED. NEITHER THE MANUFACTURER NOR DEALER WERE NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "5FNYF6H04KB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/09/2020",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323984,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RADIO AND ENTERTAINMENT SYSTEM GOES OUT OFTEN AND LOSES ALL SOUND. THE BACKUP CAMERA GOES OUT. NOW THE RADIO WON'T SHUT OFF WHEN THE CAR TURNS OFF SO HONDA RECOMMENDS DISCONNECTING THE POSITIVE TERMINAL OF THE BATTERY, WHICH IS A HAZARD. *TR",
        "vin": "5FNYF6H60KB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/23/2020",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322058,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MALFUNCTION BACKUP CAMERA, INFOTAINMENT SYSTEM, ODOMETER DISPLAY:   SINCE AROUND 1 MONTH AFTER PURCHASING THE CAR, VEHICLES ODOMETER DISPLAY AND INFOTAINMENT SYSTEM DISPLAY BLACKS OUT AND MALFUNCTIONS DURING DRIVING ALMOST DAILY. ALONG WITH THIS THE SOUND SYSTEM CRACKLES. IT ONLY RESETS ONCE THE VEHICLE IS COMPLETELY OFF. THE MALFUNCTION IS PRESENT WHETHER THE VEHICLE IS STATIONARY OR IN MOTION. ALSO, DURING THIS TIME WE ARE UNABLE TO USE THE BACK UP CAMERA AS NO DISPLAY IS SEEN ON THE INFOTAINMENT SYSTEM.   THIS HAS CAUSED MULTIPLE NEAR MISS FROM ACCIDENTS DURING DRIVING IN THE HIGHWAYS (AS DRIVER CAN GET DISTRACTED/SCARED FROM THE CRACKLING SOUNDS) AND BACKING UP. ALSO WHEN THE ODOMETER GOES BLACK, WE ARE UNABLE TO SEE THE SPEED OF THE CAR HENCE INCREASES THE LIKELIHOOD OF EXCEEDING SPEED LIMIT UNKNOWINGLY.",
        "vin": "5FNYF6H54KB"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/25/2020",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319232,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED VEHICLE IN JANUARY 2019. AROUND MARCH 2019 THE SPEAKERS BEGAN TO MAKE CRACKLING AND POPPING NOISES AT RANDOM TIMES - BUT COULD RELIABLY BE REPRODUCED WHEN LOCKING THE DOORS. SOON THEREAFTER, THE MAIN DISPLAY WOULD INFREQUENTLY POP AND GO BLACK, THEN COME BACK ON.  WE TOOK THE VEHICLE IN TO OUR DEALER IN JUNE 2019, OBTAINED A LOANER, AND AFTER THE FIRST DAY, THE DEALER CALLED AND SAID THEY COULD NOT REPLICATE AND WANTED TO KEEP IT LONGER.  ON THE THIRD DAY, I PICKED THE CAR UP AND RETURNED THE LOANER AS WE HAD TO TRAVEL. THE DEALER SAID THEY STILL COULD NOT REPLICATE AND THAT THE ANY NOISE HAPPENING WHEN THE DOORS LOCKED WAS NORMAL.  SINCE JUNE 2016, THE CRACKLING AND POPPING CONTINUES, THE BLACK OUT CONTINUES AND HAS PROGRESSIVELY GOTTEN WORSE.  THE NOISE HAPPENS WHEN STATIONARY, IN MOTION, ON ALL KINDS OF STREETS AND SPEEDS. IT HAPPENS WHEN THE PHONE IS CONNECTED VIA BLUETOOTH AND WHEN IT IS NOT.  IT ALSO SEEMS TO BE MORE VIOLENT WHEN AT LARGER INTERSECTIONS (I.E. LOUD POPS AND BLACK SCREEN HAS BEEN NOTED WHEN AT LARGE TRAFFIC LIGHT INTERSECTIONS AND ON FREEWAYS WITH OVERHEAD SIGNS THAT MAY CONTAIN A RADIO FREQUENCY TRANSMITTER).  THE BLACK SCREEN HAPPENS WHEN USING THE NAVIGATIONAL SYSTEM AND DIRECTIONS ARE LOST, IT ALSO IS VERY DISTRACTING TO THE DRIVER AS IT CAN BE QUITE LOUD AND SUDDEN.",
        "vin": "5FNYF5H94KB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/08/2020",
        "dateOfIncident": "03/07/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316870,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING GOING 25-30 MPH LISTENING TO THE RADIO. SUDDENLY THE RADIO GOES OUT WITH NO SOUND. 'RADIO UNAVAILABLE' MESSAGE DISPLAYS ON TOP OF THE INFOTAINMENT SCREEN AND ON SOON AFTER A 'NETWORK COMMUNICATION LOST' APPEARS IN THE CENTER OF THE INFOTAINMENT SCREEN.     A FEW SECONDS LATER THE WHOLE INFOTAINMENT SYSTEM ALONG WITH THE DASH BOARD DISPLAY REBOOTS ITSELF. DURING THE REBOOT NO SPEEDOMETER, GAS GAUGE,ETC IS SHOWING JUST A BLANK BLACK SCREEN (ALL THIS WHILE STILL GOING 25-30 MPH). AFTER REBOOT SPEEDOMETER IS OFF FOR ABOUT 5 SECONDS BEFORE IT COMES ON BUT THE SPEED IS NOT ACCURATE. SOUND TO RADIO SOON COMES BACK ON AS WELL AFTER REBOOT. AFTER 20-30 SECONDS THE SPEEDOMETER BECOMES ACCURATE AGAIN.    HAPPENED A SECOND TIME DURING THE SAME TRIP WHILE STOPPED AT A RED LIGHT. I DON'T KNOW WHAT'S GOING ON BUT NOT SEEING THE SPEEDOMETER IS NOT SAFE!",
        "vin": "5FNYF6H60KB"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/07/2020",
        "dateOfIncident": "02/13/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316748,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE ENGINE IS DISABLED THE CAR CAN'T BE PUT INTO NEUTRAL BY THE OPERATOR. IN MY CASE, ON 2/13/20 THE STARTER MALFUNCTIONED AT < 7000 MILES-IT HAS SINCE BEEN REPLACED. I WAS IN A PARKING GARAGE, AND NO STRUCTURE TRUCKS WERE AVAILABLE TO TOW FROM THE SPOT THE CAR WAS DISABLED. THE PLAN WAS TO PUT IT INTO NEUTRAL AND PUSH IT TO THE STREET WHERE IT COULD BE TOWED. THE OWNER'S MANUAL DOES NOT TELL WHAT TO DO.  THE DEALER DIDN'T KNOW, EITHER. IF IT'S GOOGLED, A YOUTUBE VIDEO COMES UP, THAT IDENTIFIES AN ODDLY SHAPED DEVICE  OR BOLT DEEP IN THE ENGINE COMPARTMENT.  BUT EVEN THE AAA MECHANIC WHO CAME TO THE SCENE,WITH ALL HIS TOOLS, COULD NOT GET IT TO TURN. I ASKED THE DEALERSHIP IF THERE WAS ANY OTHER WAY AND ULTIMATELY THEY SAID \"NO.\" THEY LATER TOLD ME, AFTER DOING SOME RESEARCH, THAT HONDA HAS A SPECIAL TOOL, REQUIRING THREE EXTENSIONS, USED TO ACCOMPLISH THIS DURING TRANSPORT TO THE DEALER. THIS SEEM QUITE UNSAFE. OBVIOUSLY, CARS CAN BE DISABLED IN MANY WAYS. WITHOUT A REASONABLY ACCESSIBLE MEANS OF PUTTING THE CAR IN NEUTRAL, IT CANNOT BE MOVED IN AN EMERGENCY SITUATION (FOR EXAMPLE, OUT OF A LANE OF TRAFFIC). IT DEFINITELY CAN'T BE DONE BY AN OWNER (UNLESS, I SUPPOSE IT'S SOMEONE WHO HAS THE ABILITY TO GOOGLE DURING THE EMERGENCY, FINDS THE VIDEO, AND HAS THE SPECIAL TOOL). PLEASE NOTE THE CAR WASH FEATURE WILL NOT WORK BECAUSE THE ENGINE HAS TO BE RUNNING FOR THAT. WHEN I FIRST BROUGHT THIS UP, NO ONE AT THE DEALERSHIP KNEW ANYTHING ABOUT THIS DEFECT. I HAVE SINCE LEARNED THAT MOST CARS HAVE A SHIFT LOCK OVERRIDE LEVER EASILY ACCESSIBLE IN THE PASSENGER COMPARTMENT, OFTEN ON OR NEAR THE SHIFT CONSOLE. IN MY CONVERSATION WITH THE DEALERSHIP,THEY SAY THAT 2020 PILOTS AND 2019 AND 2020 PASSPORTS ALSO HAVE THIS DESIGN. I DO NOT KNOW HOW MANY OTHER VEHICLES ARE AFFECTED. THIS SEEMS HIGHLY UNSAFE AND  SHOULD BE ADDRESSED. THANK YOU.",
        "vin": "5FNYF6H00KB"
    },
    {
        "components": "EQUIPMENT,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "03/03/2020",
        "dateOfIncident": "03/03/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11312313,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 HONDA PILOT. CONSUMER WRITES IN REGARDS TO DEFECTIVE COLLISION MITIGATION BRAKING SYSTEM. *LD    THE CONSUMER STATED THAT THE HIGH FREQUENCIES WERE DISTRACTING. THE DEALER STATED THERE WAS AN ISSUE WITH THE HD RECEPTION AND THAT RELOADING THE SOFTWARE WOULD REMEDY THE PROBLEM. THE FAILURE RECURRED. *JS",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/02/2020",
        "dateOfIncident": "10/12/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315720,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ISSUE STARTED WITH CRACKING/POPPING IN THE SPEAKERS. WE THEN GET A WARNING SAYING \"CHECK TUNER\" AND THEN THE INFOTAINMENT SYSTEM AND THE DISPLAY BEHIND THE STEERING WHEEL SHUTDOWN. WE LOSE ALL SAFETY INFORMATION PROVIDED BY THE INFOTAINMENT SYSTEM AS WELL AS THE SPEEDOMETER. THIS HAPPENS FREQUENTLY DURING DRIVING AND MEANS WE HAVE NO WAY OF TELLING HOW FAST WE ARE GOING. USUALLY THE SYSTEM STARTS BACK UP. HOWEVER, ON THREE SEPARATE OCCASIONS THE INFOTAINMENT SYSTEM HAS NOT RESTARTED EVEN WHEN THE CAR WAS SHUT DOWN. ON THE MOST RECENT OCCASION BOTH THE INFOTAINMENT SYSTEM AND THE DISPLAY BEHIND THE DASH HAVE NOT RETURNED EVEN WHEN THE CAR IS RESTARTED. I CANNOT GET THE CAR TO THE DEALERSHIP RIGHT AWAY AND CURRENTLY HAVE NO WAY TO TELL WHAT SPEED I AM GOING AS THE SPEEDOMETER LOCATED IN THE DASH DISPLAY IS OUT.     THIS ISSUE HAS OCCURRED IN ALL DIFFERENT SITUATIONS. IT HAS OCCURRED WITH OUR CAR ON THE HIGHWAY, CITY STREETS, AND PARKED. IT HAS EVEN OCCURRED WHILE BACKING UP. THIS IS A SERIOUS SAFETY ISSUE. NOT ONLY IS IT DISTRACTING DRIVING WITHOUT SPEEDOMETER IS DANGEROUS.",
        "vin": "5FNYF6H03KB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/18/2020",
        "dateOfIncident": "02/18/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309896,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR CONTINUOUSLY IS WITHOUT A INSTRUMENT PANEL (WHERE MY SPEEDOMETER IS AND OTHER IMPORTANT SAFETY INFO) AND IS WITHOUT A AUDIO UNIT, CANNOT USE ANY FEATURES.  THE POWER USB PLUGS DO NOT WORK. IF I DO NOT START MY CAR EVERY DAY AND LET IT RUN, IT WILL NOT START THE NEXT DAY. I HAVE HAD TO PURCHASE 2 NEW BATTERIES FOR IT.  I AM SCARED TO DRIVE IT ANYWHERE, ESPECIALLY ON FREEWAYS OR ANYWHERE, I CANNOT SEE MY SPEED AT ALL, WHICH SCARES ME ON SCHOOL ZONES AND FREEWAY DRIVING.  MY CAR IS UNDEPENDABLE, FEATURES I PAID EXTRA FOR DON'T WORK. I PAY OVER $500 A MONTH FOR A CAR I CANNOT DRIVE OFTEN. I HAVE A LITTLE OVER 4000 MILES ON IT AND SCARED TO DRIVE IT OUT OF LOCAL AREA AND THIS IS HURTING MY WORK AND EMERGENCY PREPAREDNESS FOR MY CHORIC ILL SON. I BOUGHT THIS CAR A AUTOSOURCE IN WOODS CROSS IN JULY 2009, MINOR WRECK THEY SAID TO FRONT FENDER AREA MADE IT A SALVAGE CAR, THIS SHOULD HAVE NOTHING TO DO WITH THE ELECTRICAL ISSUES. IT'S BEEN IN SHOP TOTAL ABOUT 2 MONTHS AND STILL SAME ISSUES.  UPDATES AND EVERYTHING FAIL TO FIX ISSUES. 100K WARRANTY I BOUGHT WITH IT HAS NOT BEEN HONORED, I HAS COST ME $2800 SO FAR TO TRY AND FIX THESE ISSUES.",
        "vin": "5FNYF6H98KB"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/16/2020",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309489,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE IS AUTOMATICALLY BRAKING AT HIGH SPEEDS FOR NO REASON.IVE TRAVELERS AT OVER 50 MPH ON HIGHWAYS AND IT JUST SUDDENLY SLAMS ON THE BRAKES WHERE I'VE ALMOST BEEN REAR ENDED A FEW TIMES.  IT'S BEEN IN THE DEALERSHIP AND THEY KEEP CLAIMING NOTHING IS WRONG.",
        "vin": "5FNYF6H38KB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/15/2020",
        "dateOfIncident": "02/09/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309358,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 65 MPH ON THE HIGHWAY, THE PANEL AND THE ENTERTAINMENT SYSTEM (GPS) CRASHED. THE SCREEN RESTARTED AND THEN TURNED ON IN AN UNUSABLE STATE (NONE OF THE BUTTONS WORKED).    TO SAY THE LEAST, THIS EXPERIENCE WAS VERY DISTRACTING WHILE DRIVING ON THE HIGHWAY. THE MALFUNCTION OF THE PANEL COULD EASILY CAUSE A LOSS OF FOCUS ON THE ROAD AND LEAD TO A CRASH.    THE CULPRIT IS HONDA INTEGRATION WITH APPLE'S CARPLAY. SEE THREAD LINK BELOW WHICH INDICATES THAT IT IS A WIDESPREAD PROBLEM. THE FIX TO THE ISSUE I HAD TO DO A HARD RESET THE SYSTEM BY REMOVING AND REINSERTING THE PANEL'S FUSE.      THREAD:  HTTPS://WWW.PILOTEERS.ORG/THREADS/DISPLAY-AUDIO-CONSTANTLY-ON-IN-2019-PILOT.159521/",
        "vin": "5FNYF6H92KB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/12/2020",
        "dateOfIncident": "03/19/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308763,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE FIRST TEN MONTHS AFTER PURCHASING A BRAND NEW 2019 HONDA PILOT TOURING I WAS TREATED AS ONE OF HONDA'S GUINEA PIGS. I WAS PUTTING MY FAMILY'S LIVES AT INCREASED RISK, LOSING TIME AT WORK AND GOING THROUGH IMMENSE STRESS WHILE HONDA ATTEMPTED TO SOLVE A MAJOR ELECTRICAL ISSUE WITH MY VEHICLE. THROUGH MY EXTENSIVE PROACTIVE EFFORTS AND NUMEROUS TIMES LEAVING THE VEHICLE WITH THE DEALER A SOLUTION WAS EVENTUALLY FOUND. AFTER THE FINAL REPAIR WAS COMPLETED IT BECAME APPARENT THE EXTENT OF THE IMPACT THE FAULTY WIRING HAD ON THE VEHICLE'S SAFETY AND FUNCTION. AFTER THE ELECTRICAL ISSUE WAS CORRECTED THE OVERALL OPERATION OF THE VEHICLE WAS SIGNIFICANTLY DIFFERENT THAN THE DAY THE VEHICLE WAS PURCHASED. NO MORE NEAR ACCIDENT CAUSING FALSE AUTOMATIC EMERGENCY BRAKING OCCURRENCES. NO MORE CRUISE CONTROL AND LANE ASSIST MALFUNCTIONS, RANDOM LOSS OF THE SPEEDOMETER AND BACKUP CAMERA OR OTHER FREQUENTLY EXPERIENCED SAFETY ISSUES. NO MORE UNUSABLE INFOTAINMENT SYSTEM. IT WAS EXTREMELY APPARENT THE IMPACTS OF THE FAULTY WIRING WERE WIDE SPREAD IN THE VEHICLE AS SOLD.  THE FIRST TEN MONTHS THAT MY WIFE, TWO CHILDREN AND I USED THE VEHICLE AS OUR MAIN SOURCE OF TRANSPORTATION, WHILE HONDA ATTEMPTED TO SOLVE THE ISSUE, IT WAS NOT FUNCTIONING AS DESIGNED AND ADVERTISED OR UP TO THE NATIONAL  HIGHWAY TRAFFIC SAFETY ADMINISTRATION STANDARDS.",
        "vin": "5FNYF6H67KB"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/04/2020",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307121,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HONDA PILOT'S DASHBOARD AND LCD TOUCH SCREEN WOULD RESTART RANDOMLY, FOR NO REASONS.  THE ELECTRICAL SYSTEMS WOULD RESET (OR RESTART) SEVERAL TIMES A DAY WITHOUT LOGICAL REASONS.  THE AMERICAN HONDA AUTOMOTIVE WAS NOT HELPFUL WHEN I INFORMED THEM OF THE ISSUE.  THIS HAPPENS EVERYDAY, SEVERAL TIMES A DAY.",
        "vin": "5FNYF6H08KB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/01/2020",
        "dateOfIncident": "04/19/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306500,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INFOTAINMENT FAILS ALMOST ON A DAILY BASIS WHICH MEANS THAT INTERIOR, ELECTRICAL FEATURES FAIL.  EXAMPLES INCLUDE A BLACK OR GRAY SCREEN WHICH BLOCKS THE ABILITY TO SEE SPEED BEING DRIVEN, BLUETOOTH, RADIO, PHONE, NAVIGATION ALL FAIL WHICH CAUSES DRIVER TO TAKE EYES OFF ROAD TO ATTEMPT TO FIX OR DISCONNECT PHONE WHEN DRIVING.  REPEATED ATTEMPTS TO FIX THE CAR BUT HONDA CONTINUES TO SAY (AFTER 9 MONTHS) THAT THIS IS A \"SOFTWARE UPDATE\" PROBLEM.  THIS, ONLY AFTER MY 2ND REPAIR VISIT AND THEY HAD MY PILOT 8 DAYS AND REPLACED A DEFECTIVE PART WITH ANOTHER USED DEFECTIVE PART FROM ANOTHER PERSON'S CAR.  HONDA IS KNOWINGLY PUTTING UNSAFE, DEFECTIVE CARS ON THE ROAD.  PROBLEMS OCCUR WHEN DRIVING. SOME PHOTOS ARE ATTACHED.  I HAVE MANY MORE PICS RANGING FROM MARCH 2019 THROUGH TODAY.  PROBLEM FIRST REPORTED TO DEALERSHIP APRIL 2019.  ONGOING WITH DEALERSHIP AND AMERICAN HONDA.  I HAVE A FILE OVER 100 PAGES THICK OF COMMUNICATION ATTEMPTS WITH ZERO FIX.  HONDA SHOULD BE REQUIRED TO STOP SELLING THESE CARS UNTIL THEY HAVE A FIX FOR THIS UNSAFE VEHICLE.",
        "vin": "5FNYF6H51KB"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/27/2020",
        "dateOfIncident": "01/27/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302286,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAS FREQUENTLY HAD AN ISSUE WITH THE INFOTAINMENT SYSTEM GLITCHING WHICH LEADS TO THE LKAS (LANE KEEP ASSIST), AAC (ADAPTIVE CRUISE CONTROL), AND LANE DEPARTURE SYSTEM TO FAIL WHILE THE VEHICLE IS IN MOTION. WHEN TURNING THE CAR OFF AFTER THESE ISSUES OCCUR, THE INFOTAINMENT SYSTEM WILL STAY ON, DRAINING THE BATTERY. THE VEHICLE HAS BEEN TAKEN TO A HONDA DEALERSHIP. THE DEALERSHIP STATED THAT AN UPDATE WOULD FIX THIS ISSUE. ONCE WE INFORMED THEM AND THEY CONFIRMED THAT THE SYSTEM WAS ALREADY UPDATED, THEY TOLD IS THERE WAS NOTHING WE COULD DO. THE ONLY WAY WE CAN STOP THE INFOTAINMENT SYSTEM FROM STAYING ON IS BY REMOVING THE FUSE FOR THE INFOTAINMENT SYSTEM. WE HAVE CONTACTED HONDA AND THEY HAVE REFUSED TO DO ANYTHING ABOUT THIS.",
        "vin": "5FNYF5H91KB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/27/2020",
        "dateOfIncident": "01/26/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302349,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DIGITAL INSTRUMENT PANEL THAT CONTAINS ALL GAUGES (SPEEDOMETER, TACHOMETER, GAS GAUGE, ETC.) INTERMITTENTLY TURNS OFF WHILE THE CAR IS IN OPERATION. THE SCREEN GOES ENTIRELY BLACK AS IF THE CAR IS NOT ON, MEANING WE DO NOT HAVE A FUNCTIONING SPEEDOMETER WHILE THE CAR IS IN OPERATION WHEN THIS OCCURS. WE'VE HAD THE CAR AT THE DEALERSHIP TWICE FOR THIS ISSUE AND IT STILL ISN'T RESOLVED.",
        "vin": "5FNYF5H61KB"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/22/2020",
        "dateOfIncident": "07/04/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301077,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED THE NEW 2019 HONDA PILOT ELITE AT AROUND 3,000 MILES. WHILE DRIVING AROUND 25-30 MILES PER HOUR SPEED ON PAVED ROADS,  SOMETIMES NOT ALL THE TIME.  THE CAR DOWNSHIFTING AND STALLING FOR A FEW SECONDS BEFORE BEING ABLE TO ACCELERATE AGAIN.  THIS HAPPEN WHILE DRIVING ON A NICE SUNNY DAY WITH NO LOOSE GRAVEL OR RAIN, IN A 4 WAY INTERSECTION MAKING A LEFT TURN ON GREEN WHICH MADE THE CAR STALLED AND WASN'T ABLE TO ACCELERATE FOR A GOOD 1 TO 2 SECOND.  GOOD THING THERE WASN'T ANY OTHER VEHICLE THAT IS NEAR BY. THIS CAN CAUSE AN ACCIDENT AND BODY INJURY! THIS HAPPEN DURING TURNS AND STRAIGHT DRIVING.   I'VE DISCUSS THIS EVERY TIME I GO AND GET THE CAR MAINTENANCE AT THE HONDA DEALERSHIP BUT THEY CANNOT DUPLICATE THE PROBLEM I'VE HAD ENCOUNTER.  THE CAR AS OF NOW HAS 15,651 MILES AND DOWNSHIFTING AND STALLING COMES AND GOES WHENEVER IT WANTS TO ITS NOT CONTESTANT.  FOR A NEW CAR OVER $50K PLUS NOT INCLUDING TAXES,  ITS EXTREMELY DANGEROUS TO ME AND ANYONE WHO IS DRIVING OR PEDESTRIAN WALKING NEAR BY!",
        "vin": "5FNYF6H0XKB"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/20/2020",
        "dateOfIncident": "08/12/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300467,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHIN ONE WEEK OF PURCHASE, I RETURNED TO DEALER - GPS UNIT SENDS ME DIRECTIONS AND DISTANCES FAR LONGER THAN ANY OTHER GPS - DEALER SPENT AN ENTIRE RAY UOLOADING/DOWNLOADING/UPDATING - STILL SENDS ME  MUCH LONGER DISTANCE AND TIME DIRECTIONS. I AM ON ROAD FOR MY WORK. THIS HAS ME NOT BE ABLE TO USE THE GPS THAT IS THE REASON I \"BOUGHT\" A HIGHER TRIM LEVEL - USELESS! LONGER DISTANCE ADDS TO MY FUEL BILL, ADDS DETRIMENTAL IMPACT TO CARBON FOOTPRINT AND ENVIRONMENT, IMPACTS MY SCHEDULE FOR WORK AND TRAVEL - IMMENSELY.    **CRUISE CONTROL** - DANGEROUS AND PUTS ME AT RISK FOR EVEN SPEEDING TICKETS.  CAR CRUISES UP TO TEN MILES \"FASTER\" THAN THE SETTINGS I HAVE IT ON SPORADICALLY.    ALSO - AT TIMES, AS THE CAR CUISES ON ITS' OWN, HIGHER THAN THE SET SPEED TO CONTROL CAR AT... THE SPEED SET - ALSO \"ELEVATES\" WITH THE CAR SPEED ELEVATING OUT OF CONTROL!    THIS CAR IS RISKING MY LIFE AND WELL BEING.    CONTRATY TO NHTSB ARTICLE ON HOW CARS ARE SAFER.... NO - THEY ARE PUTTING LIVES AT RISK AND DRIVERS AT MERCY OF HIGHER EXPENSE AND LOSS OF TIME IN SCHEDULES FOR DEALERS TO INVESTIGATE AND STILL HAVE CAR WITH ISSUES.   -  HONDA-LINK HAS BEEN USELESS WHE-N I HAVE BEEN STRANDED WITH WARNINGS BLARING ON SCREEN OF MY NEW AS OF 8-5-19 CAR!    THIS IS MY 3RD HONDA PILOT - MOST UNSAFE CAR I HAVE EVER OWNED AND FAR FROM THE PEACE OF MIND, MY OTHER HONDA'S HAVE GIVEN ME.     I HAVE VIDEOS I CAN SHARE WHEN SOMEONE REACHES BACK OUT TO ME. I NEED HELP - DEALERS AND MYSELF ARE CAUGHT IN HONDA ISSUES THAT HONDA WON'T ACKNOWEDGE OR MAKE RIGHT FOR ME AS A CONSUMER.  THIS IS A BRAND NEW CAR    I HAVE ALREADY LOST TIME, MONEY, BUSINESS WHILE BEING CAUGHT IN THE MIDDLE OF THIS COMMUNDRUM UNFAIRLY. THERE IS A CLASS ACTION SUIT OUT AGAINST HONDA - WHY ARE ANY OF US CONSUMERS HAVING TO ENDURE SO MUCH STRESS AND LOSS AND LIFE RISK, BECAUSE HONDA IS BECOMING LIKE TOO MUCH OF CORPORATE AMERICA?",
        "vin": "5FNYF6H96KB"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/19/2020",
        "dateOfIncident": "01/19/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300341,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TWO SEPARATE OCCASIONS I HAVE EXPERIENCED MY CAR NOTIFYING ME OF A TRANSMISSION ISSUE AND KICKING IT INTO NEUTRAL ON ITS OWN. THE FIRST TIME THIS OCCURRED BACK AT THE END OF NOVEMBER, USED AUTO START AND GOT INTO MY CAR SHORTLY AFTER. TURNED ON THE CAR AND PLACED INTO REVERSE. STILL STOPPED, PULLING UP MY GPS AND HEARD THE ALERT AND SAW ON MY DASHBOARD 'STOP DRIVING WHEN SAFE. TRANSMISSION PROBLEM. SEE MANUAL\"   IT LIGHTS UP THAT FOR A MOMENT THEN GOES AWAY. BUT IT SHIFTED MY CAR INTO NEUTRAL. DIDN'T THINK ANYTHING OF IT. FINISHED THE THE GPS. TOOK ANOTHER MOMENT AND PUT THE CAR IN REVERSE. IT DID IT AGAIN AND IT WAS BACK IN NEUTRAL WHEN I WAS JUST IN REVERSE. I CALLED THE DEALERSHIP IMMEDIATELY. THE NEXT DAY CAR WAS TAKEN TO THE DEALERSHIP. NOTHING WAS STORED IN THE DATABASE. AND THEY SAID THEY HAD NEVER HEARD OF IT AND COULDN'T FIND ANYTHING WRONG. FAST FORWARD TO TODAY, AUTO START, GOT INTO CAR. PLACED IN DRIVE FOR A MOMENT AND BEFORE MOVING THE ALERT CAME UP AND CAR WAS IN NEUTRAL. IT DID IT THREE TIMES. TOOK A PHOTO OF THE ALERT WHICH IS EXACTLY AS QUOTED. I AM AT A LOSS WITH HONDA AND WHAT TO DO. I HAVE ALSO SEARCHED THE OWNERS MANUAL AND THERE'S NOTHING OF THIS QUOTED ISSUE.",
        "vin": "5FNYF5H91KB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/17/2020",
        "dateOfIncident": "01/17/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300161,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH AND MEDIA CONSOLE TURN OFF RANDOMLY. CAN'T SEE WHAT SAFTEY FEATURES ARE ON INCLUDING SPEED.    DEALER HAD ONE OTHER PILOT IN TODAY WITH SAME ISSUE.",
        "vin": "5FNYF6H60KB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/15/2020",
        "dateOfIncident": "11/24/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299468,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HONDA PILOT. THE CONTACT STATED THAT THE INFORMATION SYSTEM ON THE VEHICLE, WHICH CONTROLS ALL ELECTRICAL SYSTEMS WITHIN THE VEHICLE, WAS EMITTING A POPPING/ CRACKING NOISE AND SHUTTING DOWN. THE CONTACT STATED THAT WHEN THE FAILURE WOULD OCCUR, THE INSTRUMENT PANEL TURNS BLANK AND ALL ELECTRICAL SYSTEMS SUCH AS THE SPEEDOMETER, SEAT HEATERS, ETC. THE CONTACT TOOK THE VEHICLE TO THE DEALER (VANN YORK HONDA LOCATED AT 422 EASTCHESTER DR, HIGH POINT,  NC 27262   PHONE NUMBER 866-207-1275) WHO INFORMED THE CONTACT THAT IT WAS A KNOWN FAILURE, HOWEVER, THERE WAS NO KNOWN FIX FOR THE MATTER AS OF YET. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE, HOWEVER, THEY WERE UNABLE TO OFFER ANY ASSISTANCE. THE APPROXIMATE FAILURE MILEAGE WAS 3,700. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/14/2020",
        "dateOfIncident": "11/30/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299273,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "LOUD CRACKLING IN SPEAKERS WHILE LISTENING TO MUSIC OR TALKING ON CAR PHONE.  BLUETOOTH AND AUXILARY CONNECTIVITY COMPROMISED BY ABOVE COMPLAINT.  MICROPHONE ON CAR PHONE RANDOMLY STOPS WORKING CAUSING MAJOR SAFETY ISSUES.  TRACTION CONTROL GOES OUT IN THE SLIGHTEST WEATHER CONDITIONS I.E. LIGHT SNOW/SLEET",
        "vin": "5FNYF6H97KB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/14/2020",
        "dateOfIncident": "09/20/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299287,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE COMPUTER SYSTEM CRASHES FREQUENTLY.  ALL VOICE CONTROLS AND HANDS FREE APPLICATIONS STOP WORKING.  COMPUTER SCREEN DOES NOT SHUT OFF EVEN WHEN VEHICLE IS TURNED OFF, LOCKED AND LEFT OVER NIGHT.  NO AUDIO FROM ANY SOURCE.  UNABLE TO MAKE OR RECEIVE PHONE CALLS.  FRONT AND REAR PROXIMITY SAFETY SENSORS DON'T FUNCTION APPROPRIATELY.  REAR VIEW SAFETY CAMERA STOPS WORKING.  MANY FUNCTIONS WITHIN COMPUTER MENU BECOME INACCESSIBLE. THIS HAS HAPPENED APPROXIMATELY 14 TIMES WITHIN AN 11 MONTH PERIOD.  HAPPENS WHEN DRIVING IN NORMAL CONDITIONS AND CAN HAPPEN AT ANY TIME OF DAY.",
        "vin": "5FNYF6H04KB"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/12/2020",
        "dateOfIncident": "01/11/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298829,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 HONDA PILOT ELITE CENTER CONSOLE, DASH, INFOTAINMENT, NAVIGATION SYSTEM RANDOMLY STOPS WORKING AND GOES BLANK UNDER ALL CONDITIONS DRIVING, AT LIGHT, PARKED ON HIGHWAY AND CITY STREETS. DISPLAY SAYS CONNECTING AND NO SIGNAL EVEN FOR FM RADIO. THIS IS DANGEROUS DISTRACTION AND LEAVES US UNABLE TO ADMINISTER NAVIGATION, SAFETY ITEMS OR ANY OTHER ON BOARD INFORMATION. PARKING SENSORS, AUTO BRAKING AND LANE DEPARTURE DOES NOT WORK.",
        "vin": "5FNYF6H03KB"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/31/2019",
        "dateOfIncident": "12/20/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11292221,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER DISPLAY AND THE INFOTAINMENT SYSTEM OF THE HONDA PILOT CONTINUOUSLY GOES BLANK AND NOT SURE WHAT OTHER EFFECTS IT HAS ON THE VEHICLE AS THE DRIVE IS UNABLE TO SEE THE SPEED THEY ARE DRIVING OR IF ANYTHING ELSE IS WORKING IN THE VEHICLE. THIS IS A SAFETY HAZARD ESPECIALLY WHEN USING SPEED CONTROL OR OTHER DEVICES. THIS HAPPENS IN MOTION,  ON HIGHWAYS, CITY STREETS, AND STATIONARY. FIRST THE INFOTAINMENT SYSTEM DOES BLANK AND THE DRIVER SETTINGS,",
        "vin": "5FNYF6H53KB"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/29/2019",
        "dateOfIncident": "12/26/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291911,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASHBOARD HAS A POPPING/CRACKING NOISE ALL THE TIME LIKE ELECTRIC SHORT WHEN LISTENING TO MUSIC OR RADIO IT SOUNDS LIKE A SCATCH CD ALL THE TIME OR IF THE STEREO ITS OFF STILL DOES IT I HAVE TAKE IT TO THE DEALER FOUR TIMES THEY SAID THEY KNOW ABOUT THE PROBLEM BUT ARE WAITING ON HONDA FOR THE NEXT STEP BUT THERE ARE A LOT OF CARS AFFECTED WITH THE SAME PROBLEM I HOPE THEY DO A RECALLED TO FIX THIS",
        "vin": "5FNYF6H96KB"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/28/2019",
        "dateOfIncident": "12/28/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291718,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2019 HONDA RANDOMLY BRAKES WHILE I'M DRIVING ALMOST CAUSING SOMEONE TO REAR END ME, AND OTHER TIMES ALMOST CAUSING ME TO BE IN ACCIDENTS. IN ADDITION, AT 19K MILES MY TRANSMISSION WENT OUT (STARTED CATCHING, MAKING A GRINDING NOISE) WHILE I WAS DRIVING ON THE INTERSTATE AND CAUSED THE VEHICLE TO DECELERATE. I PULLED OFF THE ROAD TURNED THE VEHICLE OFF, ONCE RESTARTED IT DECELERATED AND THE TRANSMISSION LIGHT, EMISSIONS LIGHT AND BLIND SPOT LIGHT CAME ON THE DASH BOARD.",
        "vin": "5FNYF6H91KB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/27/2019",
        "dateOfIncident": "12/27/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291520,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FOLLOWING OCCUR ON A DAILY BASIS:  RADIO CRACKLES AND POPS.  THE RADIO DISPLAY GOES BLANK AND WILL NOT WORK FOR SEVERAL MINUTES TO HOURS.  THE FOLLOWING OCCUR SPORADICALLY:  THE INSTRUMENT PANEL (INCLUDING SPEEDOMETER) GOES BLANK WHILE DRIVING.  THE RADIO AND REAR VIEW CAMERA SWITCH BACK AND FORTH REPEATEDLY (I HAVE VIDEO). MULTIPLE MESSAGES POP UP WHEN THE RADIO ISN'T WORKING.  THE FAN SPEED BUTTON CAN TRIGGER THE RADIO SETTINGS.  THE FRONT HEATER DISPLAY GOES BLANK.  THIS OCCURRED ONCE:  I WAS DRIVING UP A VERY SMALL INCLINE ON A DRY ROAD AT 25 MPH WHEN THE VEHICLE ACTED LIKE IT COULD GO. THE VSA INDICATOR LIGHT BEGAN FLASHING.  I HAD TO STOP, PUT THE CAR IN PARK, STOP THE ENGINE AND THEN RESTART THE ENGINE.  I'M NOT SURE IF THAT IS ELECTRICAL OR AN ENGINE PROBLEM.  I'VE TRIED TO NARROW THE CONDITIONS (RAINY, COLD, STATIONARY, OR MOBILE) DOWN BUT THERE IS NO PATTERN.",
        "vin": "5FNYF6H50KB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/10/2019",
        "dateOfIncident": "10/19/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288287,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2019 HONDA PILOT HAS ELECTRICAL ISSUES WHICH STARTED AROUND 11K MILES, THE DASH LIGHTS WILL GO OUT, CRACKLING NOISES COME FROM THE SPEAKERS, THE BACKUP CAMERA'S GO OUT, RADIO QUITS WORKING, PHONE SYSTEM WILL NOT WORK, INABILITY TO TURN ON OR OFF SAFETY FEATURES. AT TIMES ON CURVES THE VEHICLE WILL THINK A CAR COMING TOWARDS US IS HEADING INTO OUR CAR AND WILL APPLY THE BRAKES STRONGLY. WE ARE AFRAID THE LIGHTS OR BRAKING SYSTEM WILL NEXT BE AFFECTED BASED ON OTHER COMPLAINTS WE HAVE READ ABOUT BY OTHER OWNERS. HONDA ADMITS THEY HAVE NO FIX FOR THIS PROBLEM AND SAY THE ENGINEERS ARE WORKING ON IT. YET THEY CONTINUE TO SELL NEW CARS TO CONSUMERS KNOWING FULL WELL THE PILOTS HAVE ELECTRICAL ISSUES WHICH COULD LEAD TO UN-SAFE DRIVING CONDITIONS OR ACCIDENTS. ASKED THEM TO BUY BACK THE CAR WHICH THEY REFUSED TO DO AS THEY SAID \"THE CAR IS STILL DRIVE ABLE\". I AM AFRAID TO HAVE MY WIFE DRIVE THE CAR. I AM PURSUING OTHER MEANS OF TAKING ACTION AGAINST HONDA.",
        "vin": "5FNYF6H94KB"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/07/2019",
        "dateOfIncident": "08/05/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287646,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "RANDOMLY THE CENTER COUNSEL DISPLAY WILL GO BLANK AS WELL AS THE DRIVER'S SIDE DISPLAY WHICH CONTAINS THE SPEEDOMETER. ALSO FAILING AT THE SAME TIME IS THE DVD PLAYER. WE ALSO EXPERIENCE A 'POPPING' NOISE THROUGH THE SPEAKERS, EVEN WITH AUDIO SYSTEM TURNED OFF. THIS USUALLY IS WHAT HAPPENS FIRST, THEN ERROR MESSAGES (FOR EXAMPLE: 'RADIO UNAVAILABLE', 'NO AUDIO CONNECTION FOR FM', 'NETWORK COMMUNICATION LOST', 'CHECK TUNER'), THEN SCREEN GOES BLANK. WHEN THIS HAPPENS WHILE THE DRIVER IS DRIVING, THEY ARE UNABLE TO ACTIVATE OR DEACTIVATE SPECIFIC SAFETY CONTROLS INCLUDING LANE KEEP ASSIST, CRUISE CONTROL, AUTOMATIC BRAKING ETC. THE AUTOMATIC BRAKING WARNING IS ALSO LOST WHEN THE DISPLAY GOES OUT, AS WELL AS THE SPEEDOMETER. WHEN THIS HAPPENS , BOTH DISPLAY SCREENS TURN OFF AND GO BLACK, WHICH ARE HUGE SAFETY CONCERNS. FROM THE CENTER DISPLAY, WE LOSE THE BACK UP CAMERA, RADIO, NAVIGATION, DVD PLAYER AND ABILITY TO MAKE HANDS FREE PHONE CALLS AMONG OTHER THINGS. THIS CAN OCCUR DAILY, EVERY TIME THE CAR IS DRIVEN, OR SPORATIC AND NOT HAPPEN FOR A FEW DAYS AT A TIME. CAR WAS PURCHASED BRAND NEW IN APRIL 2019. PROBLEM BEGAN IN THE BEGINNING OF AUGUST 2019, EXACT DATE UNKNOWN. PROBLEMS OCCUR WHILE THE CAR IS IN MOTION OR STATIONARY, CITY STREETS, HIGHWAY AND AT ANY SPEED AND ANY TIME.",
        "vin": "5FNYF6H4XKB"
    },
    {
        "components": "POWER TRAIN,AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/05/2019",
        "dateOfIncident": "11/27/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287178,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE IS REVVING ON ITS OWN @ 3000 RPM WITH NO FOOT ON THE GAS PEDAL OR DRIVING 15 MPH AND THE ENGINE IS @ 4500 RPM WITH NO FOOT ON THE GAS PEDAL. MY WIFE WAS IN THE PICKUP LANE AT MY CHILDREN'S SCHOOL AND SHE TOLD ME THAT SHE HAD TO HOLD THE BRAKE DOWN & TURN OFF THE IGNITION BECAUSE IT FELT LIKE THE HONDA PILOT WAS GOING TO ACCELERATE ON ITS OWN INTO THE PICKUP LINE AT THE SCHOOL. NOW YOU SEE WHY I SAID THIS VEHICLE IS DANGEROUS",
        "vin": "5FNYF5H94KB"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/26/2019",
        "dateOfIncident": "11/11/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282448,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HONDA PILOT. WHILE DRIVING AT ANY SPEED, THE ENTERTAINMENT SYSTEM FAILED AND THE SCREEN TURNED OFF AND ON. THE CONTACT ALSO STATED THAT THE VEHICLE SHOOK VIOLENTLY WITHOUT WARNING WHEN IT STRUCK A BUMP IN THE ROAD. THE VEHICLE WAS TAKEN TO JOHN EAGLE HONDA (855-562-7994, LOCATED AT 5311 LEMMON AVE, DALLAS, TX 75209) WHERE IT WAS DIAGNOSED THAT THE COMPUTER SYSTEM MODULE NEEDED TO BE REPAIRED. THE CONTACT WAS NOT INFORMED WHEN THE REPAIRS COULD BE COMPLETED. THE CONTACT NOTIFIED THE MANUFACTURER OF THE FAILURE AND INFORMED THEM THAT SHE WANTED A DIFFERENT VEHICLE. THE CONTACT WAS REFERRED TO THE DEALER. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 300.",
        "vin": "5FNYF5H57KB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/24/2019",
        "dateOfIncident": "05/24/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281988,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED A 2019 PILOT ELITE IN FEBRUARY AND IN MAY ISSUES STARTED WITH A CRACKING NOISE THAT SEEMED TO COME FROM THE SPEAKERS. IT THEN BECAME ISSUES WITH THE INFOTAINMENT, SPEEDOMETER AND DVD PLAYER BLACKING OUT WHILE DRIVING. DEALERSHIP REPLACED A WIRING HARNESS, THIS FIXED THE ISSUE FOR A MONTH THEN IT ALL RETURNED. NEXT THEY REPAIRED SOME CONNECTORS, THIS FIX LASTED A COUPLE MONTHS WITH INTERMITTENT OCCASIONS OF BLACKOUT. NOW THE BLACKING OUT IS HAPPENING ALMOST DAILY AGAIN. THE DEALER IS NOW BEING TOLD TO REPLACE THE SPEEDOMETER CLUSTER WHICH IS BACK ORDERED FROM HONDA. ALL TOLD THIS VEHICLE HAS SPENT > 30 DAYS IN THE REPAIR SHOP TRYING TO FIX THE ISSUES. ISSUES HAPPEN AT CITY OR HIGHWAY SPEEDS AND LAST ANYWHERE FROM 10 SECONDS TO SEVERAL MINUTES AS IT ATTEMPTS TO RESTART ITSELF.",
        "vin": "5FNYF6H00KB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/23/2019",
        "dateOfIncident": "06/26/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281923,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED PILOT ON APRIL 2019.  STARTED HAVING PROBLEMS WITH THE INFOTAINMENT SYSTEM ON JUNE 2019 (MOVING AND STOPPED- CITY AND HIGHWAY).  SYSTEM KEEPS SHUTTING DOWN, DISCONNECTING PHONE CALLS, PLAYS MUSIC AS IF LOOSES CONNECTION (FM, AM AND SAT).  THE LATEST ISSUE IS THAT IT SHUTS DOWN COMPLETELY AND TURNS BLACK DISPLAYING \"NO NETWORK CONNECTION\". THIS ISSUES ARE DISTRACTING AND MAKE THIS VEHICLE UNSAFE UNTIL FIXED.  AS WE APPROACH THE FORTH APPOINTMENT TO FIX THE PROBLEM HONDA ADVISED ME THAT THE EARLIEST THE REPLACEMENT PARTS WILL BE IN IS DECEMBER 11.  MEANWHILE I HAVE AN EXPENSIVE DRIVEWAY ORNAMENT BECAUSE I REFUSE TO LET MY FAMILY TRAVEL IN THAT CAR.",
        "vin": "5FNYF5H59KB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/22/2019",
        "dateOfIncident": "09/13/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281738,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS  HAPPENS WHILE DRIVING THE INFOTAINMENT SYSTEM WILL FREQUENTLY FREEZE OR CRASH, DISABLING FEATURES INCLUDING THE NAVIGATION SYSTEM, RADIO AND REAR VIEW CAMERA.  THE PROBLEM WILL CONTINUE TO CYCLE OVER  AND OVER UNTIL YOU SHUT OFF THE CAR AND RESTART IT.",
        "vin": "5FNYF6H48KB"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/22/2019",
        "dateOfIncident": "11/15/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281802,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DIGITAL SPEEDOMETER AND INFOTAINMENT SYSTEM SHUT OFF AND RESTART AT RANDOM. IN ADDITION, THE SPEAKERS CRACKLE, THE RADIO STOPS WORKING, THE BACKUP CAMERA DOES NOT ALWAYS ENGAGE WHEN GOING IN REVERSE. THE DIGITAL SPEEDOMETER SCREEN HAS TURNED OFF TWICE AND THE ONLY (TEMPORARY) SOLUTION WAS FOR THE DEALER TO RESET THE SYSTEM.",
        "vin": "5FNYF6H96KB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "11/19/2019",
        "dateOfIncident": "09/15/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11281125,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS SLOWLY PULLING INTO A PARKING SPACE, WITH MY FOOT COVERING THE BRAKE THE CAR RPMS SHOT UP AND IT SUDDENLY ACCELERATED SLAMMING INTO THE VEHICLE IN FRONT OF ME. I WAS STANDING AS HARD AS I COULD ON BRAKE AND IT WOULD NOT STOP THE CAR. THE CAR THAT WAS HIT HAD SOMEONE STANDING BEHIND IT LOADING HER GROCERIES, THE FORCE OF THE IMPACT CAUSED HER CAR TO HIT HER AND KNOCK HER TO THE GROUND.",
        "vin": "5FNYF5H99KB"
    },
    {
        "components": "SUSPENSION,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/17/2019",
        "dateOfIncident": "10/10/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280700,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CLICKING NOISING WHEN IN REVERSE OR TURNING AND ALSO STALLS BETWEEN 40AND 50 MPH TRANSMISSION HAS HARD TIME SHIFTING ALSO SENSITIVE BREAKING SYSTEM ALWAYS BREAKING LIGHTS COMES ON OR IT WILL SUDDENLY BREAK BY ITSELF.ALL THIS WHILE CAR IS IN MOTION",
        "vin": "5FNYF6H5XKB"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/11/2019",
        "dateOfIncident": "11/11/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279391,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "\"NETWORK CONNECTION LOST\" WHEN USING INFOTAINMENT SYSTEM. DASH/SPEED CLUSTER GOES BLACK AND REBOOTS IN MID DRIVE. \"FM UNAVAILABLE\" DISPLAYED WHEN LISTENING TO RADIO. COLLISION WARNING \"BRAKE\" MESSAGE DISPLAYS RANDOMLY. SANDY/POPPING NOISES RANDOMLY IN SPEAKERS. ALL OF THESE I CAN NOT REPRODUCE ON THE SPOT, IT IS RANDOM THAT I CAN TELL AT THIS POINT.",
        "vin": "5FNYF6H98KB"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/09/2019",
        "dateOfIncident": "11/08/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279138,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 11/09/19 AT OR AROUND 800PM PST, MY REAR HATCH WINDOW EXPLODED FROM SIDE TO SIDE CAUSING A SPIDER-WEB PATTERN. NOTHING TOUCHED THE WINDOW. HOWEVER, APPROX ONE HOUR PRIOR TO THIS EVENT I DID ACTIVATE THE REAR WINDOW DEFROSTER FOR ONLY 5 MINUTES. STEVENS CREEK HONDA IN SAN JOSE, CA ADVISED THIS BROKEN WINDOW WAS NOT COVERED UNDER WARRANTY. I THEN CALLED MY INSURANCE COMPANY. AS A NOTE, THE HONDA DEALERSHIP PARTS DEPT SAID THE BACK WINDOW WAS BACK-ORDERED AND NO ETA AS TO WHEN A BACK WINDOW WOULD OR COULD BE SHIPPED. NOW, I AM DEALING WITH",
        "vin": "5FNYF6H57KB"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/09/2019",
        "dateOfIncident": "11/08/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279172,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 800 PM PST IN NORTHERN CALIF, MY BACK WINDOW EXPLODED, CAUSING A SPIDER-WEB PATTERN. THE CAR WAS PARKED AND I HEARD A ROLLING/CASCADING CRUNCHING SOUND. I DID NOT REALIZE WHAT HAPPENED OR WHAT CAUSED THAT SOUND UNTIL THE FOLLOWING MORNING. AFTER SEEING THE DAMAGE, I TAPED IT UP AND CALLED MY INSURANCE. STEVENS CREEK HONDA ADVISED IT WAS NOT UNDER WARRANTY.",
        "vin": "5FNYF6H57KB"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/03/2019",
        "dateOfIncident": "11/02/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277740,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE THROUGHWAY I HEARD POPPING NOISE WHEN I HIT A BUMP, THEN GETS WORSE AND LOST MY RADIO SOUNDS AND CONTROLS ON MY INFOTAINMENT. I LOST MY SPEEDOMETER AND MY INFOTAINMENT SYSTEM COMPLETELY OFF THEN RESTARTS SEVERAL TIMES SAYING LOST NETWORK CONNECTION UNTIL IT COMPLETELY TURNED OFF. I CANNOT TURN IT ON BY PUSHING THE POWER BUTTON. I WENT TO MY DEALERSHIP AND COMPLAINT ABOUT THE POPPING NOISE BUT THEY COULD NOT REPLICATE IT UNTIL IT GOT WORSE. MY SPEEDOMETER WAS BLANK WHILE DRIVING. I STARTED HAVING THIS ISSUE AFTER TWO WEEKS ON PICKING UP THE CAR BRAND NEW.I THINK THIS IS A SAFETY CONCERN THAT HONDA DOES NOT WANT TO FIX OR HAVE A FIX!",
        "vin": "5FNYF6H90KB"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/28/2019",
        "dateOfIncident": "10/28/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271630,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "SPEEDOMETER AND CONTROL HEAD COMPLETLY BLANK-- DEAD",
        "vin": "5FNYF6H05KB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/23/2019",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270513,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN APPLYING THE BRAKES, THE BRAKE PEDAL IS LOW/SOFT. ALSO, WHEN IN STOP-N-GO TRAFFIC AND APPLYING THE BRAKES, THE BRAKES PEDAL GOES LOWER AND I HAVE TO PRESS HARDER ON THE BRAKES. I TOOK MY CAR TO STEVENS CREEK HONDA IN CALIF AND THEY BLED MY BRAKES THIS HELPED A LITTLE BUT DID NOT SOLVE THE PROBLEM. I CALLED THE NEXT DAY TO HAVE MY BRAKES LOOKED AT AGAIN FOR THE SAME PROBLEM BUT THE SERVICE MANAGER SAID MY BRAKES WERE NORMAL. NOW, I AM GOING TO UPGRADE MY FRONT PADS WITH A NON-HONDA BRAKE PAD. I HOPE THIS WORKS AND DOES NOT VOID MY WARRANTY. HONDA USES LOW GRADE PADS I BELIEVE BECAUSE THE LOW BEAM HEADLIGHT ON THE EX-L USES A LOW WATT (LOW GRADE) LIGHT BULB MAKING DRIVING A NIGHT DANGEROUS SINCE IT IS HARD TO SEE. I HAD TO UPGRADE THE LOW BEAM BULBS FOR THE SAME REASON I HAVE TO UPGRADE THE PADS: SAFETY. PLEASE HELP. THE 2019 HONDA PILOT BRAKES ARE A KNOWN SAFETY PROBLEM. GO TO HTTPS://WWW.PILOTEERS.ORG/ AND READ THE COMPLAINTS ON THIS HONDA FORUM.",
        "vin": "5FNYF6H57KB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/15/2019",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268786,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED 2019 HONDA PILOT ELITE IN FEBRUARY 2019.  NOTICED A POPPING SOUND WHILE DRIVING IT HOME THAT SOUNDED LIKE SAND OR ROCKS SLIGHTLY AMPLIFIED HITTING THE WINDSHIELD INTERMITTENTLY.  THIS HAS CONTINUED AND OVER THE NEXT FEW MONTHS IT BECAME APPARENT THE SOUND WAS NOT ACTUALLY FROM THE WINDSHIELD BUT ASSOCIATED WITH THE SPEAKERS/ELECTRICAL SYSTEM. IN AUGUST A LOUD CRACKLING SOUND INTERRUPTING THE SATELLITE RADIO STARTED HAPPENING INTERMITTENTLY FOLLOWING PERIODS OF THE ORIGINAL POPPING SOUNDS. BY OCTOBER, THAT LOUD POP HAS BEEN FOLLOWED BY A COMPLETE BLACKOUT OF THE SYSTEM SCREEN (BOTH) INCLUDING THE SPEED, ETC. FOLLOWED AFTER 30 SECONDS - A MINUTE BY THE SYSTEM RESTARTED.  PRIOR TO THAT THERE WERE SEVERAL CASES OF APPLE CAR PLAY SHUTTING DOWN DURING PHONE CALLS THAT MAY HAVE BEEN ALSO ASSOCIATED WITH THIS PROBLEM WITHOUT A COMPLETE SHUTDOWN.  I HAVE 27,000+ MILES AS OF 10/15/19, DRIVE A LOT AND NO DEALER CLOSE BY AND ALSO DEPEND DAILY ON HAVING THE VEHICLE.  CONTACTED THE DEALER CAR WAS PURCHASED FROM THIS WEEK AND THEY ADMITTED HAVING A PILOT IN THE SHOP NOW WITH SIMILAR SYMPTOMS THAT THEY HAD NOT BEEN ABLE TO DIAGNOSE OR FIX YET.  SUGGESTED I MAKE AN APPOINTMENT AND LEAVE IT WITHOUT THEM KNOW HOW LONG IT MIGHT BE.  AGREED I WOULD CALL BACK AND SEE WHAT THEY WERE ABLE TO DO ON THE PILOT THEY ALREADY HAD IN THEIR SHOP.  HAVE SINCE THEM FOUND NUMEROUS SIMILAR REPORTS WITH 2019 PILOTS ON THIS SITE AND OTHERS WITH ALL REPORTING HONDA NOT ADMITTING TO A SYSTEMIC PROBLEM AND ALSO NO PERMANENT REPAIRS. PROBLEMS HAVE ALWAYS OCCURRED WHILE DRIVING ON INTERSTATE HIGHWAYS AT FULL SPEED.  OTHERS HAVE REPORTED BACKUP CAMERAS GOING OUT BUT I HAVE NOT HAD THE PROBLEM EXCEPT WHEN DRIVING AT FULL SPEED BUT EXPECT THAT BACKUP CAMERA WOULD HAVE ALSO BEEN OUT HAD I BEEN STOPPED AT THE TIME OF THE PROBLEM.  I THINK HONDA SENSING SAFETY FEATURES NOT AFFECTED.",
        "vin": "5FNYF6H04KB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/11/2019",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267929,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC BRAKING (COLLISION) MITIGATION ACTIVATES ERRONEOUSLY.  UPON SLIGHT RIGHT CURVE IN ROAD, DETECTS OPPOSING TRAFFIC AS COLLISION.  APPLIES BRAKES.  EVEN UPON SETTING SYSTEM TO LEAST SENSITIVE, STILL EXHIBITS CONDITION.  CONTINUES TO OCCUR MULTIPLE TIMES PER WEEK.",
        "vin": "5FNYF6H58KB"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/08/2019",
        "dateOfIncident": "09/09/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267053,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ISSUE IS RELATED TO THE HONDA INFOTAINMENT SYSTEM. AFTER ONLY 2000 MILES THE SYSTEM BEGAN HAVING ISSUES. WHILE THE DRIVER IS DRIVING, THE CENTER DISPLAY AND THE DISPLAY ON THE CONTROL PANEL WILL FREQUENTLY GO BLANK. WHEN THIS HAPPENS THE DRIVER IS UNABLE TO ACTIVATE OR DEACTIVATE SPECIFIC SAFETY CONTROLS INCLUDING LANE KEEP ASSIST, ADAPTIVE CRUISE CONTROL AND AUTOMATIC BRAKING. THE AUTOMATIC BRAKING WARNING IS ALSO LOST WHEN THE DISPLAY GOES OUT. THE DRIVER ALSO LOSES THE SPEEDOMETER. FROM THE CENTER DISPLAY, THE DRIVER IS UNABLE TO USE THE BACKUP CAMERA, THE RADIO, NAVIGATION AND THE ABILITY TO MAKE HANDS FREE PHONE CALLS.",
        "vin": "5FNYF6H53KB"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/06/2019",
        "dateOfIncident": "10/02/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266621,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "1ST PROBLEM...VIDEO DISPLAY WORKED ONLY INTERMITTENTLY.  1ST VISIT, WOLFCHASE HONDA UPDATED SOFTWARE, PROBLEM CONTINUED. 2ND VISIT THEY REPLACED VIDEO UNIT.  2ND PROBLEM...SPEAKERS STARTED MAKING CRACKLING NOISE. WENT ON THEIR SITE TO MAKE APPT AND RECEIVED A NOTICE THAT OT A RECALL NOTICE ABOUT ELECTRICAL ISSUE (OR A FLEET CAMPAIGN NOT SURE WHICH). THEY UPDATED SOFTWARE ON THAT 3RD VISIT.  SPEAKER PROBLEM WORSENED AFTER THAT VISIT AND SPEEDOMETER DISPLAY AND VIDEO (STEREO SYSTEM, NAVIGATION ETC) WOULD BLANK OUT WHILE DRIVING. SYSTEM WOULD GENERALLY RESET BUT ONLY AFTER 30 SECONDS OF NON VISIBILITY TO MY SPEED, CRUISE CONTROL STATUS ETC..  TOOK IT BACK FOR 4TH VISIT. THEY STATED THEY FOUND AN ISSUE WITH TAILGATE SENSOR. PICKED IT UP ON FRIDAY OCT 4TH AND IT STARTED MAKING THE CRACKLING NOISE IN THE SPEAKERS AGAIN YESTERDAY, OCT 5TH.  LAST TIME, IT EVENTUALLY GOT WORSE UNTIL SPEEDOMETER  STOPPED WORKING.  PLAN TO MAKE ANOTHER APPT (MY 5TH) THIS WEEK. CRACLKING NOISE OCCURS WHEN STOPPED, WHEN DRIVING, WHEN VEHICLE IS TURNED OFF (AFTER BEING ON). VIDEO AND SPEEDOMETER DISPLAY STOP WORKING WHEN DRIVING.",
        "vin": "5FNYF6H08KB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/06/2019",
        "dateOfIncident": "10/06/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266649,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES ARE RIDICULOUSLY SLOW. BRAKE RESPONSE TIME IS VERY SLOW EVEN THOUGH SPEED IS WITHIN 30 MILES PER HOUR OR LESS. YOU LITERALLY HAVE TO PUSH PADDLE COMPLETELY DOWN TO THE FLOOR AND EVEN AFTER THAT IT WON'T STOP IMMEDIATELY. CAR STOPS VERY SLOW. SO CONSIDERING SITUATION (DRIVING IN STREET AND CHILD POPS UP IN FRONT OF CAR) IF YOU HAVE TO STOP SUDDENLY YOU NOT GONNA MAKE IT UNLESS YOU USE EMERGENCY BRAKE OF THE CAR. HONDA MUST FIX THE ISSUE OTHERWISE SOMEONE WILL LOSE LIFE FOR SURE.    ALSO, WEIRDLY CAR MOVED FORWARD LITTLE BIT WHEN I JUST PUSHED START BUTTON TO START THE CAR EVEN AFTER BRAKE PADDLE WAS PUSHED DOWN POSITION AND TOUCHING GAS PADDLE AT ALL. I WAS BIT SURPRISED AND THANKFULLY IT WAS IN PARKING LOT SO DIDN'T HIT ANYONE.    I AM GOING HONDA DEALERSHIP TO CHECK WITH THEM IF THEY CAN CHECK AND DO SOMETHING TO MAKE BRAKE MORE RESPONSIVE AND TIGHT.    THIS IS JUST SECOND DAY OF CAR AND THIS CRAP HAPPENING. I AM BIT SCARED, DISAPPOINTED AND FRUSTRATED.",
        "vin": "5FNYF6H58KB"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/30/2019",
        "dateOfIncident": "09/28/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258912,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE VEHICLE ON AUGUST 10, 2019.  WITHIN 2 WEEKS THE RADIO BEGAN MAKING A POPPING AND CRACKING SOUND THAT SOUNDED LIKE ROCKS HITTING THE WINDSHIELD.  THIS SOUND HAPPENS DAILY WHEN I DRIVE THE VEHICLE.  ABOUT ONE WEEK AFTER THIS HAPPENED,  THE DVD PLAYER WOULD STOP WORKING AND THE SOUND FROM THE RADIO WOULD BEGIN TO COMPLETELY GO OUT.  IT WOULD COME BACK ON EVENTUALLY, SOMETIMES AS MUCH AS 30 - 45 MINUTES LATER.  AFTER ABOUT TWO WEEKS, THESE PROBLEMS CONTINUED AND THE SCREEN FOR NAVIGATION, ALONG WITH THE SPEEDOMETER SCREEN WOULD COMPLETELY GO BLACK WHILE THE VEHICLE WAS IN MOTION.  IT RESTARTS AFTER ABOUT 10 - 20 SECONDS.  IN TWO INSTANCES THE REAR BACKUP CAMERA HAS SHUT OFF WHILE I WAS BACKING UP AS WELL.  I HAVE REPORTED THE ISSUE TO TWO DEALERSHIPS INCLUDING THE ONE WHERE I MADE THE PURCHASE.  I AM SCHEDULED TO TAKE IT IN TO HAVE REPAIRS DONE TOMORROW.",
        "vin": "5FNYF6H95KB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/17/2019",
        "dateOfIncident": "04/16/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256170,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY VEHICLE IN MARCH OF 2019, BY MAY MY DASH/RADIO WENT OUT.  FIRST IT STARTED WHEN BLUETOOTH WAS CONNECTED, IT WOULD SOUND LIKE A CRACKING NOISE, LIKE STATIC. THIS IS ALL WHILE VEHICLE IS ON AND IN DRIVING MODE. IT WAS A SCARY SOUND LIKE THAT OF AN ELECTRICAL FIRE WAS GOING TO HAPPEN AT ANY SECOND.  ULTIMATELY, BOTH DASH AND RADIO COMPLETELY SHUT OFF AND DIDN'T COME BACK ON.  I TOOK IT IN TO THE DEALERSHIP, THEY KEPT MY CAR FOR ALMOST A MONTH AND FINALLY GAVE IT BACK AND STATED THAT THE WIRE HARNESS WAS LOOSE, OR NOT PROPERLY INSTALLED AND THEY HAD RE DONE IT PROPERLY.  ALMOST 2 MONTHS LATER THE CRACKING NOISES STARTED AGAIN, AND WOULD SPONTANIOUSLY CUT OFF THE BLUETOOTH.  THEN A FEW WEEKS LATER THE DASH WOULD RE START ( SHUT OFF AND THEN BACK ON)  BLUETOOTH WOULD NOT CONNECT AND SAME NOISES ALL OVER AGAIN.  NOW MY DASH TURNS ON SOMETIMES AND THE RADIO DOES NOT CONNECT AND IS A BLACK SCREEN.  IT DOES TURN ON SOMETIMES, BUT THIS IS A NEW CAR AND IT'S VERY ANNOYING.  HONDA WAS NOT ABLE TO FIX THE PROBLEM, AND I HAVE HEARD SIMILAR ISSUES FROM OTHER OWNERS OF MY SAME VEHICLE.",
        "vin": "5FNYF5H96KB"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/17/2019",
        "dateOfIncident": "06/27/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256266,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE ARE SEVERAL ISSUES AND THEY HAVE HAPPENED MANY TIMES - ALL RELATED TO ELECTRICAL SYSTEM, SPEEDOMETER AND INFOTAINMENT DEFECTS. THE INFOTAINMENT AND DASH DISPLAY INCLUDING THE SPEEDOMETER SHUT OFF WHILE DRIVING. THIS INCLUDES THE SPEEDOMETER, ALL SAFETY FEATURES, CRUISE CONTROL SHUTTING OFF WHILE DRIVING. ALSO THE AUDIO WILL COMPLETELY SHUT OFF WHILE DRIVING AND I WILL HAVE NO AUDIO FOR HOURS AT A TIME. ALSO THERE ARE POPS AND CRACKLES OUT OF THE SPEAKERS EVERY TIME I DRIVE THE VEHICLE.   I HAVE DETAILED DOCUMENTATION FOR THESE ISSUES INCLUDING VIDEOS OF THE ISSUES HAPPENING WHILE DRIVING. DEALERSHIP HAS ATTEMPTED TO REPAIR SEVERAL TIMES AND THE ISSUES GET WORSE, NOT BETTER.",
        "vin": "5FNYF6H08KB"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/16/2019",
        "dateOfIncident": "09/14/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255531,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION HAS SLIPPED NOW TWICE WHILE DRIVING. ONCE ON THE HIGHWAY AND AGAIN YESTERDAY AFTER TURNING RIGHT ONTO A BUSY NARROW ROAD. THE NAVIGATION SYSTEM AND SCREEN DISPLAY HAS BLACKED OUT AND BECOME NON-FUNCTIONAL WHILE DRIVING AT LEAST 6-7 TIMES  (NO RADIO, NAVIGATION, OR ANYTHING FUNCTIONS WHEN THIS OCCURS). THE CAR HAS HAD TO BE TURNED OFF IN ORDER RESET THE SCREEN AND FUNCTION AGAIN. IT IS NOT POSSIBLE TO TURN OFF THE CAR WHEN DRIVING ON A HIGHWAY OR NARROW COUNTRY ROAD. LASTLY, THE CAR HAS BREAKED UNNECESSARILY ON SEVERAL OCCASIONS DESPITE ADJUSTING THE SETTINGS TO NOT BE OVERLY SENSITIVE. ONCE IT CAME TO A COMPLETE STOP UNNECESSARILY, THANKFULLY NO ONE WAS BEHIND ME. IT HAS STARTED BREAKING UNNECESSARILY WHILE DRIVING ON A HIGHWAY AND ON A COUNTRY ROAD WHEN NO VEHICLES OR ANYTHING WERE AROUND. THESE SITUATIONS HAVE BEEN SCARY AND UNSETTLING.",
        "vin": "5FNYF6H92KB"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/13/2019",
        "dateOfIncident": "08/29/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11255276,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD A HEAD ON COLLISION IN MY 2019 HONDA PILOT ON A CITY STREET AT ABOUT 25-30MPH AUGUST 29, 2019. THE SENSOR WAS TRIGGERED AND THE AIRBAG SYSTEM \"ATTEMPTED\" TO INFLATE. MY HEAD SMASHED INTO THE STEERING WHEEL AND THE AIRBAG SYSTEM NEVER PROPERLY INFLATED. I JUST KEPT HEARING A SOUND LIKE IT WAS TRYING TO INFLATE BUT HAD A HOLE IN IT OR SOMETHING. THE MEDIC SAID THAT IF MY AIRBAG INFLATED PROPERLY, IT WOULD HAVE BEEN LIKE A PUNCH IN THE FACE AND BLOWN ME BACK. INSTEAD, MY HEAD SLAMMED THE WHEEL AND THE BAG NEVER GOT INFLATED NEAR CAPACITY. I CALLED HONDA AND REPORTED THE INCIDENT I WAS GIVEN HONDA CASE # 09867010. I WAS THEN CALLED A FEW DAYS LATER BY ADRIAN FROM AMERICAN HONDA WHO TOLD ME THERE WAS NO WAY THE AIRBAG FAILED, AND THAT IF IT DID, I HAD TO LET INSURANCE TELL HONDA AND I WAS TO TELL NO ONE ELSE. HE THEN TOLD ME Y MEMORY HAD TO BE WRONG AND IF I SAID OTHERWISE, I WAS A LIAR. I REPORTED THIS SO THAT NO ONE ELSE WOULD ENCOUNTER THIS SAFETY ISSUE AND HONDA WOULD HANDLE IT, BUT IT SEEMS THEY ARE DENYING THE POSSIBILITY. I HAD THE BODY SHOP SAVE THE AIRBAG AND RELATED COMPONENTS FOR POSSIBLE INSPECTION. THE INSURANCE COMPANY SAID THEY DID NOT CARE TO LOOK INTO THE MATTER AND THAT I SHOULD CONTACT HONDA OR AN ATTORNEY MYSELF IF I FELT SOMETHING FAILED.",
        "vin": "5FNYF5H9XKB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/03/2019",
        "dateOfIncident": "08/30/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253049,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE CAR IN MOTION, THE INFOTAINMENT SYSTEM PERIODICALLY AND RANDOMLY WILL 'LOSE CONNECTION' AND BLACKOUT.  WHEN THIS HAPPENS THE ENTIRE DASHBOARD BLACKS OUT AND THERE IS NO INFORMATION REGARDING EMERGENCY WARNINGS OR SPEEDOMETER FOR AT LEAST 10 SECONDS, SOMETIMES MORE.  I HAVE NO IDEA OF HOW FAST I AM GOING OR IF THERE ARE ANY EMERGENCY WARNINGS.  I HAVE TAKEN TO HENNESSY HONDA IN WOODSTOCK, GA FOUR TIMES AND THEY HAVE NOT FIXED THE PROBLEM.  THERE IS ALSO RANDOM STATIC ON THE ENTIRE SYSTEM.",
        "vin": "5FNYF6H49KB"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/19/2019",
        "dateOfIncident": "07/26/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244860,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR \"NETWORK\" COMPONENTS WERE NOT WORKING.  AT HIGH SPEEDS, THE ADAPTIVE CRUISE CONTROL WOULD NOT BRAKE PROPERLY AND COULD HAVE CAUSED AN ACCIDENT.  THE \"BRAKE\" SENSOR IS NOT WORKING PROPERLY.  UPON TAKING TO DEALER FOR SERVICE, SERVICE TECHNICIAN SAID THAT THIS \"NETWORK\" ISSUE HAS OCCURRED ON OTHER CARS.  STRONGLY RECOMMEND AN IMMEDIATE INQUIRY TO THIS ISSUE AS IT AFFECTS THE SAFETY FEATURES TOUTED BY THE CAR MANUFACTURER, HONDA.  THE SOLUTION IS TO RECONNECT THE NETWORK COMPONENTS, THIS HAS STILL NOT RESOLVED OUR ISSUE.",
        "vin": "5FNYF6H50KB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/11/2019",
        "dateOfIncident": "07/26/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243163,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "HONDA INFOTAINMENT ISSUE: PURCHASED A NEW 2019 PILOT (TOURING) WITH 22 MILES ON IT ON 22 JULY 2019. ON 26 JULY 2019 WHILE DRIVING ON I-10 FROM PHOENIX THE AUDIO QUIT AND  THE SCREEN WENT BLANK. ONCE WE STOPPED AND USED REVERSE DISCOVERED THERE WAS NO BACK UP CAMERA AND THE SCREEN WOULD NOT TURN OFF WHEN THE CAR WAS TURNED OFF.TOOK TO DEALER, THEY \"FIXED\" IT. ON 5 AUG 2019 SAME PROBLEM REOCCURRED. TOOK TO THE DEALER AND THEY FIXED IT AGAIN. FROM 5 AUG TO TODAY (11 AUG) THE SYSTEM HAS OPERATED LIKE IT SHOULD. I DID HAVE THE ABILITY TO SEE WHAT SPEED I WAS GOING AND OTHER GAUGES WORKED. I HAVE READ NUMEROUS REPORTS THAT EVEN THOSE FEATURES WENT BLANK FOR OTHERS.DRIVING FROM TUCSON AZ TO SAN DIEGO, CA TOMORROW AND I AM VERY CONCERNED ABOUT THIS DEFECT HAPPENING WHILE IN THE MIDDLE OF NOWHERE ON I-8! THERE IS NO EXCUSE FOR AN AUTO MANUFACTURER TO NOT LET PEOPLE KNOW WHAT THE STATUS OF A FIX IS AND WHEN TO EXPECT A RESOLUTION TO THE PROBLEM. I HAVE READ NUMEROUS ARTICLES AND EXPERIENCED IT MYSELF, THE DEALERS ACT LIKE THEY HAVE NOT HEARD OF THIS ISSUE. HOW COULD PEOPLE INVOLVED ON THE CAR BUSINESS NOT KNOW OF MAJOR PROBLEM THAT 1000S OF PEOPLE ARE HAVING, IT IS LIKE THE HONDA CORP PASSED THE WORD TO PLAY DUMB. I TRULY LIKE THE HONDA PILOT, TRADED IN A 2016 EXL FOR THIS NEW CAR. WOULD REALLY LIKE FOR THE CAR TO PREFORM AS ADVERTISED FOR MY  (FAMILY) COMFORT AND SAFETY. SAFETY BEING THE MAIN CONCERN HERE.",
        "vin": "5FNYF5H93KB"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,SEATS",
        "crash": false,
        "dateComplaintFiled": "08/08/2019",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242489,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RADIO IN THIS VEHICLE FREEZES, PRODUCES STATIC FEEDBACK AND ELECTRICAL FEEDBACK WHILE OPERATING THE TOUCHSCREEN. SOUND FROM THE SPEAKERS BECOMES DISTORTED AND LACKING POWER. ELECTRICAL SURGING CAN BE HEARD. THIS OCCURRED WITHIN THE FIRST 1000 MILES SINCE PURCHASED NEW.    REAR HATCH ALIGNMENT WAS ALSO NOT INSTALLED PROPERLY FROM THE FACTORY AND REQUIRED A BODY SHOP TO ATTACH IT CORRECTLY. SEAT FABRIC MATERIAL WAS ALSO DEFECTIVE AND COMING APART.",
        "vin": "5FNYF5H30KB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/08/2019",
        "dateOfIncident": "07/24/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242662,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HONDA PILOT. THE CONTACT STATED THAT THE INSTRUMENT PANEL INTERMITTENTLY STOPPED ILLUMINATING. THE DEALER AND MANUFACTURER WERE NOT NOTIFIED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "5FNYF6H94KB"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/07/2019",
        "dateOfIncident": "08/07/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242203,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE MIRROR SHAKES WHILE DRIVING. CENTER CONTROL STOPPED WORKING COMPLETELY. LOUD SOUND WILL COME OVER ON THE RADIO AND THEN ALL SYSTEMS STOP WORKING.  BACK UP CAMERA DOES NOT WORK, RADIO DOES NOT WORK.  VEHICLE IS TURNED OFF BUT THE CENTER CONTROL SCREEN IS FROZEN ON AND WILL NOT TURN OFF. WHEN ON THE BLUETOOTH, RECIPIENT CALLER CANNOT HEAR PERSON INITIATING THE CALL.",
        "vin": "5FNYF6H92KB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/30/2019",
        "dateOfIncident": "06/18/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240582,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CENTER DISPLAY AND DASHBOARD DISPLAY GO BLANK WHILE DRIVING. IT RESTARTS AFTER SOME TIME. THE CENTER DISPLAY SOMETIMES FLICKERS, SOMETIMES IT MAKES A POPPING NOISE. YOU GET A MESSAGE NETWORK CONNECTION LOST BEFORE THE WHOLE SEQUENCE OF EVENTS START. IT IS A BRAND NEW VEHICLE AND NO ONE IS TAKING OWNERSHIP. THE SCARY THING IS YOU ARE DRIVING ON THE ROAD AND THIS HAPPENS ALL OF A SUDDEN. YOU ARE FORCED TO MOVE OVER TO THE RIGHT LANE AND I HAVE TAKEN IT TO THE DEALER MULTIPLE TIMES. AM HOPING HONDA CAN TAKE OWNERSHIP AND FIX THE ISSUE. IN ALL INSTANCES, I WAS DRIVING ON THE HIGHWAY AT AROUND 60MPH.",
        "vin": "5FNYF6H38KB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/30/2019",
        "dateOfIncident": "07/30/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240691,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK POSSESSION OF THE VEHICLE 5 DAYS PRIORS WITH 3 MILES ON THE ODOMETER. SITTING AT A STOPLIGHT AWAITING A GREEN LIGHT AND WAS NOT ABLE TO BLOW THE HORN TO ALERT ANOTHER VEHICLE THE LIGHT HAD CHANGED. AFTER PULLING OVER INTO A NEARBY PARKING LOT I TRIED PUSHING ALL AREAS OF THE CENTER STEERING WHEEL AREA DESIGNATED FOR THE HORN. NO SOUND. TOOK THE VEHICLE TO A LOCAL HONDA DEALERSHIP. TECHNICIAN CHECKED FOR A FUSE ISSUE; FOUND NOT TO BE A FUSE ISSUE. AM AWAITING RESULTS OF A DETAILED INSPECTION OF THE VEHICLE.",
        "vin": "5FNYF5H98KB"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/27/2019",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11235300,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING ON SOME RURAL ROADS WHERE LINE IS CLEARLY PRESENT IN ROAD MY CAR AUTOMATICALLY APPLIES BRAKES AS CRASH AVOIDANCE WHEN ONCOMING CAR IS COMING THAT IS CLEARLY IN ITS OWN LANE.  THIS HAS HAPPENED MULTIPLE TIMES AND HONDA WAS NOTIFIED AND DOES NOT SEEM CONCERNED ABOUT THIS SAFETY ISSUE BUT IS AWARE THAT IT HAPPENS.",
        "vin": "5FNYF6H56KB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/25/2019",
        "dateOfIncident": "06/28/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234870,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "APPLE CAR PLAY DOESN'T WORK WITH THE VEHICLE.  WHEN ON THE PHONE, YOU CAN HEAR THE OTHER PERSON, THEY CAN'T HEAR YOU. SOMETIMES THERE IS A SCREECHING NOISE THAT THE OTHER PERSON HEARS. STEERING CONTROLS WON'T CHANGE THE RADIO STATION AT TIMES.",
        "vin": "5FNYF6H04KB"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/12/2019",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231195,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2019 HONDA PILOT AT 25MPH OR 60MPH, WITHOUT WARNING IN THE SPEEDOMETER AREA EMERGENCY MESSAGES BEGAN FLASHING:  POWER STEERING, TRANSMISSION, LANE MITIGATION, BRAKES, CRUISE CONTROL, ENGINE, ETC. WITH A MESSAGE THAT SAYS STOP THE VEHICLE AND CALL THE DEALER.  THEIR INSTRUCTION IS TO HOLD THE STOP/START BUTTON DOWN,UNTIL THE CAR STOPS AND THEN START THE VEHICLE,IF YOU CAN, AND HEAD FOR THE DEALERSHIP.  THE PROBLEM IS THE MESSAGE CONTINUES WHILE YOU CONTINUE DRIVING.  THE TRANSMISSION DOES NOT SHIFT PROPERLY, AND THE STEERING FEELS LESS RESPONSIVE.  BY THE WAY YOU CANNOT USE THE REAR HATCH TO GET IN OR OUT OF THE VEHICLE.  I WILL BE TAKING IT IN TO THE DEALERSHIP FOR THE SECOND TIME IN TWO WEEKS FOR THE SAME PROBLEM.  NO EFFECTIVE REPAIR.  I LIVE IN NORTH DAKOTA AND MY DEALERSHIP IS 130 MILES ONE WAY.  MY WIFE IS NOW AFRAID TO DRIVE THE CAR.  CAN YOU HELP ME.  I BOUGHT THE CAR NEW.",
        "vin": "5FNYF6H0XKB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/28/2019",
        "dateOfIncident": "03/20/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228238,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HONDA PILOT. WHILE THE VEHICLE WAS PARKED, THE CONTACT APPROACHED IT AND FOUND THAT THE WINDOWS AND SUN ROOF WERE DOWN WITHOUT BEING ACTIVATED. THE DEALER AND MANUFACTURER WERE NOT CONTACTED. THE CONTACT ALSO STATED THAT, IN THE PAST, THE HATCH DID NOT GO ALL THE WAY UP. THE VEHICLE WAS TAKEN TO BILLY CRAFT HONDA (434-385-6045, LOCATED AT 3914 OLD FOREST RD, LYNCHBURG, VA 24501), BUT THE TECHNICIAN WAS UNABLE TO DIAGNOSE THE FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 1,500.",
        "vin": "5FNYF6H57KB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/12/2019",
        "dateOfIncident": "05/22/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219455,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR BREAKS IS SELF ACTIVATING WHEN VEHICLE IS STATIONARY OR IN PARK OR AT STOP LIGHT AND WHEN YOU APPLY THE ACCELERATOR OR START TO DRIVE YOU CAN HEAR IT RELEASE WITH SOME NOISE IN THE REAR AND IT CONTINUES TO GRID THE PADS AS IF THE BREAK CALIPERS HAVE NOT FULLY RELEASED FROM THE REAR ROTORS. THE NOISE IS ALSO VERY NOTICEABLE AS THE VEHICLE MOVES AT A LOWER SPEED BELOW 25MPH.",
        "vin": "5FNYF6H94KB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/12/2019",
        "dateOfIncident": "06/11/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219628,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL- AIR CONDITIONING IS LUKEWARM. IT'S NOT PRODUCING COLD AIR.",
        "vin": "5FNYF6H44KB"
    },
    {
        "components": "STRUCTURE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/30/2019",
        "dateOfIncident": "02/06/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11216913,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SIDE MIRROR WON'T STAY AT THE PROPER ADJUSTMENT. YOU SET IT AND IT DROPS IN A FEW MINUTES SO YOU CAN'T SEE THE CARS BEHIND YOU. WHEN YOU DRIVE YOU HAVE TO KEEP ADJUSTING THE MIRROR. IT'S A SMALL PROBLEM BUT COULD BE A BIG PROBLEM IF THERE IS AN ACCIDENT.",
        "vin": "5FNYF6H5XKB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/24/2019",
        "dateOfIncident": "05/24/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209830,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY 2019 HONDA PILOT EX-L WITHOUT NAV AND RES TODAY (24MAY2019). I DROVE IT 40 MILES HOME WITH NO ISSUES. MY WIFE JUST TOOK IT FOR A DRIVE AROUND THE BLOCK APPROXIMATELY 1 MILE AND THE INFOTAINMENT SYSTEM STOPPED WORKING AND THE SCREEN JUST HAD THE HONDA LOGO ON IT WHILE SHE WAS DRIVING IT. THE CAR IS BRAND NEW WITH 82 MILES ON IT AND THE INFOTAINMENT SYSTEM JUST STOPPED WORKING. I TURNED OFF THE CAR, LOCKED, UNLOCKED AND RESTARTED WITH AS SUGGESTED BY OTHER OWNERS WITH THE SAME ISSUE AND IT IS STILL NOT WORKING. THIS IS A MAJOR SAFETY ISSUE AS IT CAUSES THE DRIVER TO BECOME DISTRACTED WHILE DRIVING.",
        "vin": "5FNYF6H54KB"
    },
    {
        "components": "ELECTRICAL SYSTEM,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "05/21/2019",
        "dateOfIncident": "11/26/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209110,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HONDA PILOT. WHILE DRIVING VARIOUS SPEEDS, THE FRONT DRIVER SIDE BRAKE SENSOR ACTIVATED AND SOUNDED A WARNING BEEPING. ERRONEOUSLY, WHICH SIGNALED THE CONTACT TO BRAKE. IN ADDITION, THE BRAKE SENOR WARNING INDICATOR ILLUMINATED. THE FAILURE OCCURRED INTERMITTENTLY. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER HAS NOT NOTIFIFED. THE FAILURE MILEAGE WAS 110,000. THIS HAS OCCURRED SINCE I PURCHASED THE CAR. *BF   DEALER HAS BEEN NOTIFIED. THE SALES REP TOLD ME THAT OTHER PEOPLE ARE REPORTING THIS ISSUE TOO AND THAT THERE WILL PROBABLY BE AN UPDATE TO THE CAR'S SOFTWARE AT SOME PAINT IN THE FUTURE. *JB",
        "vin": "5FNYF5H54KB"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/11/2019",
        "dateOfIncident": "03/29/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206993,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL' CRACKING NOISE THROUGHOUT VEHICLE STARTED A MONTH INTO OWNING THE CAR. SLOWLY THE SYSTEM STARTED TO FAIL PHONE WOULD WORK RADIO WOULDN'T WORK SCREENS WOULD GO OFF AND ON AND FINALLY THE SCREEN WENT BLACK AND NEVER RECOVERED.  THEY PUT NEW DRIVER INTERFACE INSTRUMENTAL PANEL AND IT STILL DIDN'T WORK SO HONDA CHANGED THE WIRING HARNESSES INFLOWTAINMENT SYSTEM. IT NOW BACK IN THE SERVICE BC STILL NOT WORKING. VEHICLE IN MOTION. DOESN'T MATTER IF IT MOVING GOING FAST OR SLOW.",
        "vin": "5FNYF6H04KB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/03/2019",
        "dateOfIncident": "11/26/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205447,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED SEEING THIS PROBLEM FROM DAY 1. THIS IS A SAFETY ISSUE AND IT'S AN ACCIDENT WAITING TO HAPPEN. YOU HAVE TO PRESS ON THE BRAKES REALLY HARD TO GET ANY KIND OF DECENT STOPPING. SEEMS LIKE THE BRAKE CYLINDER HAS NO PRESSURE OR LEAKING.     BRAKES ARE TOO SOFT AND THE PEDAL GOES ALL THE WAY TO THE FLOOR TO GET ANY DECENT BRAKING. EVEN AT THE STOP LIGHTS, YOU HAVE TO KEEP A VERY HIGH PRESSURE ON THE BRAKE PEDAL TO MAKE SURE THE CAR DOESN'T START MOVING AND SLAM INTO THE CAR IN FRONT OF YOU. BECAUSE YOU HAVE TO CONSTANTLY APPLY A HIGH PRESSURE, I'VE DEVELOPED SCIATICA NERVE PAIN IN MY RIGHT LEG.     I'VE SHOWN THIS TO THE LOCAL DEALERSHIP BUT THE USUAL ANSWER IS THIS IS HOW IT IS. I HAVE A HONDA CIVIC BUT THE BRAKES ARE PROPERLY TIGHTENED ON IT AND I'VE DRIVEN 10 HOURS WITHOUT ANY FATIGUE TO MY SCIATICA, BUT ON THIS CAR, 30 MINUTES DRIVING STARTS AGGRAVATING MY SCIATICA NERVE.     HONDA .... PLEASE FIX THIS BEFORE IT GET OUT OF HAND. IT WILL NOT GET ANY BETTER.",
        "vin": "5FNYF6H53KB"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/01/2019",
        "dateOfIncident": "02/11/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205095,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AT ABOUT 300 MILES ENTIRE DISPLAY DOES NOT WORK ON COLD START AND THROUGHOUT THE DAY. SCREEN FLASHES BLUE AND THEN ACTIVATES, HOWEVER DOES NOT REMAIN ON. NO REAR VIEW CAMERA, NAVIGATION, OR OTHER APPS AVAILABLE TO THE DRIVER. SCREEN FLASHES WHILE DRIVING WHICH IS A SAFETY ISSUE AND DISTRACTION. REAR VIEW CAMERA NON-OPERATION IS ALSO A SAFETY ISSUE SINCE UNABLE TO VIEW CHILDREN AS THEY CROSS BEHIND THE VEHICLE.",
        "vin": "5FNYF5H41KB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/30/2019",
        "dateOfIncident": "04/16/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204651,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "8 DAYS AFTER PURCHASE AND LESS THAN 200 MILES, THE REAR ENTERTAINMENT SCREEN STOPPED WORKING. THE DEALER KEPT THE VEHICLE FOR 7 DAYS AND REPLACED THE RES SCREEN. WHEN THE VEHICLE WAS RETURNED TO US, THE RES SCREEN IMMEDIATELY FAILED TO TURN ON. THIS IS A KNOWN ISSUE RELATED TO THE INFOTAINMENT SYSTEM AND THERE IS AN OPEN CLASS ACTION LAWSUIT. HONDA IS AWARE OF THE ISSUE AND HAS NO FIX, YET THEY ARE STILL SELLING DEFECTIVE VEHICLES.",
        "vin": "5FNYF6H67KB"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/07/2019",
        "dateOfIncident": "03/31/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194482,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING THE CAR, THE INSTRUMENT PANEL (INCLUDING THE SPEEDOMETER) WILL SHUT OFF FOR APPROXIMATELY 2 MINUTES, AND THE REBOOT. THIS RESULT IN THE INABILITY TO TELL EXACTLY HOW FAST THE VEHICLE IS MOVING. THIS WILL OCCUR UNDER MULTIPLE CONDITIONS WHILE THE CAR IS IN DRIVE, AND IS NOT DEPENDENT ON THE TYPE OF ROAD BEING DRIVEN ON.  ADDITIONALLY, THE CENTER CONSOLE INFOTAINMENT SCREEN, WHICH ALSO SERVES AS THE SCREEN FOR THE BACK UP CAMERA WILL SHUT OFF, FOR VARYING AMOUNTS OF TIME, RENDERING THE ABILITY TO SEE/USE THE BACK UP CAMERA USELESS. I HAVE ENCOUNTERED, ON NUMEROUS OCCASIONS, BOTH SYSTEMS SHUTTING OFF AT THE SAME TIME, WHILE THE CAR IS IN DRIVE OR REVERSE, LEAVING ME WITH THE UNABLE TO SAFELY GAUGE HOW I AM OPERATING THE VEHICLE.",
        "vin": "5FNYF5H60KB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/02/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193442,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE BRAKES ARE NEEDED SUDDENLY THE BRAKE PEDAL TRAVEL IS TO EXCESSIVE. THE BRAKES ARE SLOW TO RESPOND AS IF THEY ARE NOT WORKING AND THEN THEY GRAB SUDDENLY WITH THE BRAKE PEDAL ALMOST TO THE FLOOR. THIS IS VERY UNNERVING AS YOU THINK YOU ARE LOOSING CONTROL OF THE CAR. NORMALLY I HAVE TO TAP THE BRAKE PEDAL LET OFF AND GET BACK ON THE BRAKE PEDAL QUICKLY FOR THE BRAKES TO RESPOND NORMALLY OR HAVE A GOOD BRAKE PEDAL FEEL. I AM GETTING TIRED OF DOING THIS EVERY TIME TO STOP THE VEHICLE. HONDA CANNOT BE SERIOUS THAT THIS IS NORMAL. THIS IS AN ACCIDENT WAITING TO HAPPEN.",
        "vin": "5FNYF6H04KB"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/20/2019",
        "dateOfIncident": "03/16/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190215,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "RECURRENT PROBLEM. STARTED WHEN VEHICLE WAS 2 MONTHS OLD. TAKEN CAR TO DEALER SERVICE DEPARTMENT. NO SOLUTION.   WHEN IN MOTION (HIGHWAYS, CITY ROADS) SPEAKERS MAKE A SPARKLING SOUND FOLLOWED BY THE ENTERTAINMENT SCREEN ( NAVIGATION, HANDHELD PHONE, REAR VISION...) AND THE ODOMETER SCREEN (SPEED DISPLAY, ALL THE SIGNALS) BECAME DEAD. IT COULD LAST FEW SECONDS AND REBOOT BACK OR UP TO 30 MINUTES. IN A 15 MILE JOURNEY , COULD HAPPEN AROUND 15 TIMES. SO THE DANGEROUS SITUATION IS THAT I AM DRIVING WITH NO IDEA HOW MUCH SPEED I AM GOING, I AM NOT ABLE TO USE MY HANDHELD PHONE  (ALSO VERY IMPORTANT TO ME AS A BUSY DOCTOR TRYING TO ANSWER EMERGENCY CALLS), NO NAVIGATION SYSTEM AVAILABLE, THE REAR VISION CAMERA BECOMES USELESS WITH A BLANK SCREEN...  I LEARNT FROM THE INTERNET THAT THIS IS AN ONGOING PROBLEM AND NO SOLUTION HAVE BEEN FOUND.  PROBLEM HAPPENS IN MOTION AND ALSO OR WHEN CAR IS PARKED.  MY CAR IS 4 MONTHS OLD AND HAS SPENT SEVERAL DAYS AT THE DEALER SERVICE DEPARTMENT AND AT THE LAST VISIT I WAS GIVEN A REPORT IN WHICH STATES THAT HONDA IS STUDYING A NEW SOFTWARE UPDATE. I DON'T WANT RISK MY FAMILY OR OTHERS LIFE'S SO WAITING IS NOT AN OPTION.  THIS IS NOT JUST ONE INCIDENT , IT KEEPS RECURRING   WE BOUGHT THE CAR BRAND NEW FROM THE HONDA DEALER IN NOVEMBER 2018.  I HAVE VIDEOS TO PROVIDE PROOF (CAN NOT ATTACH THEM)",
        "vin": "5FNYF6H09KB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/06/2019",
        "dateOfIncident": "03/03/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184653,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A NEW 2019 HONDA PILOT EX-L IN DECEMBER, 2018. I WAS RECENTLY EXITING AN OFF RAMP FROM AN INTERSTATE AND WHEN I PRESSED THE ACCELERATOR TO MERGE INTO TRAFFIC THE VEHICLE HESITATED SIGNIFICANTLY AND THE CHECK ENGINE LIGHT STARTED FLASHING. I THEN CONTINUED A FEW MILES WHICH I HAD REMAINING TO MY HOUSE AND THE VEHICLE WOULD ACCELERATE VERY POORLY AND THE ENGINE WOULD SHAKE UNDER ACCELERATION. THE MANUAL STATES THAT A FLASHING LIGHT IS AN ENGINE MISFIRE. I STARTED THE VEHICLE ON MONDAY MORNING TO TAKE IT TO THE LOCAL HONDA DEALER AND IT DROVE NORMALLY DOWN TO THE DEALER. AFTER CHECKING THE ENGINE COMPUTER THEY COULD FIND NO FAULT CODES FOR THE CHECK ENGINE LIGHT FLASHING THE DAY BEFORE. THEY GAVE ME BACK THE VEHICLE AND SAID THERE WAS NOTHING THEY COULD DO AT THIS TIME. I FEEL THAT THIS IS A VERY SERIOUS PROBLEM AND IT APPEARS THAT A FEW OTHER COMPLAINTS HAVE BEEN FILED FOR THIS SAME ISSUE. HAVING A VEHICLE THAT LOSES A SIGNIFICANT AMOUNT OF POWER CAN BE A SERIOUS SAFETY ISSUE AND I HIGHLY SUGGEST THAT HONDA LOOK INTO THIS MATTER CAREFULLY. THIS SHOULD NOT HAPPEN TO A BRAND NEW VEHICLE WITH 2,200 MILES OR ANY VEHICLE FOR THAT MATTER.",
        "vin": "5FNYF6H51KB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/28/2019",
        "dateOfIncident": "01/19/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183150,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HONDA PILOT. THE CONTACT STATED THAT 'APPLY BRAKES' ILLUMINATED ON THE INSTRUMENT PANEL WHEN THE BRAKES DID NOT NEED TO BE APPLIED. ALSO, THE BRAKE PEDAL TRAVELED TO THE FLOORBOARD WHEN THE BRAKE PEDAL WAS DEPRESSED. NALLEY HONDA BRUNSWICK (178 ALTAMA CONNECTOR, BRUNSWICK, GA 31525, (912) 267-7000) WAS NOTIFIED AND WAS UNABLE TO REPLICATE AND DIAGNOSE THE FAILURE. THE CONTACT WAS NOT DRIVING THE VEHICLE DUE TO THE RANDOM BRAKE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN AND FAILURE MILEAGE WERE NOT AVAILABLE. *TT  CONSUMER STATED BOTH DEALERS COULD NOT FIND ANYTHING WRONG.*JB",
        "vin": "5FNYF5H1XKB"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/19/2019",
        "dateOfIncident": "02/17/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181242,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS HAPPENED TO ME TWICE.  SEEMS TO BE WHEN USING CRUISE CONTROL FOR OVER 1.25 HRS.    WHEN YOU PRESS THE CANCEL BUTTON ON THE STEERING WHEEL TO CANCEL THE SET CRUISE CONTROL, THE CARS \"CHECK ENGINE\" LIGHT STARTS FLASHING.  THE ENGINE WILL CONTINUE RUNNING BUT THERE IS LITTLE TO NO POWER WHEN STEPPING ON THE ACCELERATOR.  DRIVER MUST PULL OVER, TURN OFF CAR AND THEN RESTART.  THIS IS INCREDIBLY DANGEROUS AT HIGH SPEEDS OR CROSSING OVER ONCOMING TRAFFIC!  I BROUGHT THE HONDA PILOT BACK TO THE DEALERSHIP.  THE SERVICE MANAGER TOLD ME THAT BOTH HE AND THE DISTRICT REP. HAD THE SAME THING HAPPEN TO THEM LAST MONTH WITH THEIR 2019 HONDA PILOT.  NEITHER OF THEM HAD ANY ADVICE FOR ME.  BUT THEY WERE NOTABLY QUITE WORRIED ABOUT THE POSSIBILITIES OF THIS AND IMMEDIATELY ASKED TO HOOK A COMPUTER UP TO MY CAR TO TRY TO FIND AN ERROR CODE.   THEY FOUND NONE!  AGAIN, INCREDIBLY DANGEROUS!!!  APPARENTLY THE HONDA ENGINEERS AREN'T AWARE OF WHY THIS IS HAPPENING!  I WAS TOLD TO \"JUST KEEP DRIVING IT\"   WE CAN'T HAVE THE ONLY THREE 2019 HONDA PILOTS THAT ARE DOING THIS......  I FEAR SOMEONE WILL GET INJURED.",
        "vin": "5FNYF6H62KB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/22/2019",
        "dateOfIncident": "09/15/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171493,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "OWNER'S MANUAL STATES THAT MOTION OF THE POWER TAILGATE CAN BE STOPPED BY PRESSING ANY TAILGATE BUTTON. \"IF YOU PRESS THE BUTTON AGAIN WHILE THE POWER  TAILGATE IS MOVING, IT WILL STOP.\" (PAGES FROM MANUAL ATTACHED AS PDF.) DEALER ALSO TOLD ME THIS. THIS IS A LIE. THE TAILGATE DOES NOT STOP UNTIL IT REACHES THE FULL UPWARD POSITION, OR UNTIL ITS UPWARD MOTION HITS AN OBSTACLE (E.G. GARAGE DOOR) AND REVERSES DIRECTION. HONDA LIED. AFTER COMPLAINING TO DEALER, I WAS INFORMED THIS IMPORTANT SAFETY FEATURE WAS REMOVED FROM THE 2019 PILOT; YET IT IS IN THE MANUAL MULTILE TIMES ON MULTIPLE PAGES. CONSEQUENTLY, THE VEHICLE IS USELESS TO ME; I CANNOT USE THE POWER TAILGATE WHILE THE VEHICLE IS PARKED IN MY GARAGE. I WANT HONDA TO BUY BACK THE VEHICLE FROM ME OR ISSUE A FIRMWARE UPDATE THAT RESTORES THIS SAFETY FEATURE.",
        "vin": "5FNYF6H91KB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/05/2019",
        "dateOfIncident": "11/15/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165340,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, BOTH HIGHWAY AND AROUND TOWN, LOUD CRACKLING WOULD OCCUR THROUGH THE SPEAKERS.  THEN BOTH THE NAVIGATION SCREEN AND/OR THE SPEEDOMETER SCREEN WOULD GO COMPLETELY BLACK.  THE MESSAGE \"NETWORK CONNECTION LOST\" WOULD SOMETIMES APPEAR.   ALL BLUETOOTH CONNECTIVITY AND SPEAKER USAGE WAS LOST.  THIS OCCURS ALMOST EVERY DAY WHILE COMMUTING.  CAR HAS BEEN BROUGHT TO HONDA SERVICE TWICE FOR REPAIRS.",
        "vin": "5FNYF6H64KB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/05/2019",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165341,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES ARE EXTREMELY SLOW TO REACT AND VERY MUSHEY WHEN THEY DO.  HOLDING THE BRKE PEDEL HARD TAKES THE PEDAL TO THE FLOOR.  WHEN SERVICE REP WAS ASKED TO ADJUST, THEY STATED, ALL PILOTS ARE LIKE THIS.  THIS IS AN ACCIDENT WATING TO HPEN.",
        "vin": "5FNYF6H96KB"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/04/2019",
        "dateOfIncident": "12/21/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165293,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS ADVERTISED WITH 'LED' LOW BEAM LIGHTS. IT HAS HALOGEN.",
        "vin": "5FNYF6H39KB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/03/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165653,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HONDA PILOT. WHILE DRIVING 25 MPH, THE VEHICLE VIBRATED AND THE CHECK ENGINE, HILL START ASSIST, TRAILER STABILITY ASSIST, POWER STEERING, LANE DEPARTURE LITIGATION, BLIND SPOT, TRANSMISSION, AND EMISSION WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO FIRST TEXAS HONDA (3400 STECK AVE, AUSTIN, TX 78757, 512-220-1121) TO BE DIAGNOSED, BUT THE CAUSE OF THE FAILURE WAS UNDETERMINED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED CASE NUMBER: 09223186. THE FAILURE MILEAGE WAS APPROXIMATELY 100.",
        "vin": "5FNYF5H98KB"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/17/2018",
        "dateOfIncident": "10/09/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141105,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS ARE TOTALLY INADEQUATE. LOW BEAMS ILLUMINATE ROAD ONLY DIRECTLY IN FRONT OF VEHICLE AND NOT ENOUGH FURTHER DOWN THE ROAD CAUSING AN UNSAFE CONDITION OF &#147;OVER DRIVING&#148; THE HEADLIGHTS.",
        "vin": "5FNYF6H53KB"
    }
]