[
    {
        "components": "AIR BAGS,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/19/2022",
        "dateOfIncident": "01/01/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448000,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Honda Fit. The contact stated that on several occasions when attempting to use the horn the system did not operate and was not audible. Also, the vehicle would intermittently experience hard starting, the theft alarm would erroneously activate and the center of the steering wheel where the airbag was located would become warm to the touch. The vehicle was taken to the local dealer but the failures could not be duplicated and no trouble was found. The manufacturer was not yet contacted regarding the failures. The failure mileage was 30,000",
        "vin": "3hggk5h85km"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/10/2021",
        "dateOfIncident": "12/10/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443314,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Fuel Gauge Cluster fails in weather sometimes outside of weather conditions and will glitch out causing an inability to see mileage and fuel amount.",
        "vin": "3HGGK5H47KM"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/09/2021",
        "dateOfIncident": "12/04/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443295,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Honda Fit. The contact stated that while pulling into an intersection at approximately 10-15 MPH, a vehicle from the passenger’s side crashed into his vehicle while in the intersection. The contact stated that his vehicle was pushed into another lane causing him to crash into another vehicle with the front of his vehicle. The contact stated that the airbags did not deploy. There was no warning light illuminated. The contact stated that there was severe damage to the passenger’s side and front of the vehicle. The contact stated that medical attention was not needed for anyone in either of the three 3 vehicles involved in the crash. A police report was filed. The contact stated that he attempted to drive the vehicle back to his residence 2 blocks away, but the vehicle shut-off and failed to restart. The contact stated that he then placed the vehicle in neutral and pushed the vehicle to his residence where it remained. The contact stated that he had not contacted the dealer or an independent mechanic; however, the insurance company’s accident adjuster provided an appraisal on the vehicle. The contact stated that he was advised by the insurance company that the vehicle was not totaled and would be repaired. The vehicle was not repaired. The contact stated he did contact the manufacturer and was informed he would receive a call back. The approximate failure mileage was 9,800.",
        "vin": "3HGGK5H82KM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/22/2021",
        "dateOfIncident": "10/21/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437739,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "10 August 2021 - Fuel pump fixed due to a recall.  19 October 2021 - digital gas/mileage went blank. Took my car to the dealership and they removed the fuel pump and put it back. Dealership said it was fixed.  21 October 2021 - digital/gas mileage issue again  22 October 2021- took it back to dealership.  My car only has 19, 500 miles on it.",
        "vin": "3HGGK5H40KM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/04/2021",
        "dateOfIncident": "09/04/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431760,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Undercarriage engine splash shield was hanging loose after getting Honda service. Took it back to dealer and 2 plastic screw put it right. A few days later the front of this shield is now hanging from my car scraping the road. It's Labor day weekend. I am afraid this is going to fall off and hit a car behind me. I googled this and it has been an ongoing problem since at least 2015.  There were no warning lamps, messages to let me know. I did not hit anything or go into any road debris. It happened on the highway at regular highway speed.  This is very concerning to me. I cannot safely drive my car until shops open on Tuesday. It's Saturday.",
        "vin": "3HGGK5H87KM"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/31/2021",
        "dateOfIncident": "07/11/2021",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431263,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2019",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Ewr Volpe Acme Inc.",
                "productMake": "TBD",
                "productModel": "TBD",
                "productYear": "9999",
                "type": "Vehicle"
            }
        ],
        "summary": "The Towed Battery Charger Plus (TBC+) manufactured by RVIBrake.com (DBA: Danco) of Castle Rock, CO 80109, was installed on our Honda Fit, prior to a vacation in May 2021. While heading back to our home in Florida on July 11 2021, on Interstate 84 near Matamoras, PA, we started smelling burnt plastic. We pulled off the highway and noticed the burnt smell coming from under our hood. Upon opening the hood we could see the TBC+ smoldering. The result of this aftermarket component (TBC+) failing caused an under hood fire, which melted plastic components on the Honda Fit.  This TBC+ also shorted, resulting in sending excess voltage and current to the electrical components on the Honda fit. This resulted in our alternator failing. As it is a fire hazard, I would like all TBC+ modules manufactured by RVIBrake.com to be recalled and all owners of this module get compensated for any expenses resulting from this device.",
        "vin": "3HGGK5G86KM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/13/2021",
        "dateOfIncident": "08/12/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428973,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "We brought the car in for the recall. The day before the check engine/emissions light came on. The dealer says that the charcoal canister has gas, oil and water in it, and that it is not covered by the warranty, They also will not replace the fuel pump. Our car is garaged, never been in an accident, not driven through deep water. Please help.",
        "vin": "3hggk5h85km"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/06/2021",
        "dateOfIncident": "07/31/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428058,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The vehicle started to bounce and accelerated on its own while making a left turn and was not  responding to brakes to slow down and kept going faster and faster.  The vehicle was only responding to steering.  The car went up a curb into a yard, heading to a house , which was avoided by steering  to the driveway and hit a parked car,  then  proceeded to a car parked on the street,  then continued  across the street and struck a truck  facing the opposite way, which bounced the car into a yard  and hit a tree which bounced it back and  finally stopped by a electrical line.   4  collisions and no airbag.  Because it was 4;45am in a neighborhood street, no one was injured.   The car is totaled   by the body shop and insurance company is not willing to pursue with manufacturer.  The spontaneous acceleration, brakes and airbags are  major safety failures.  If this was any other time of day or on other busy streets, the outcome could be much worse.   I read online that there was a software issue with this vehicle for acceleration in Japan and others who have had this problem here in the US. I would like this investigated and reported.",
        "vin": "3hggk5h42km"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/29/2021",
        "dateOfIncident": "07/27/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427050,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Random occurrences of CHECK FUEL CAP pop up on the R-hand indicator panel with no root cause.  I've opened/closed the fuel cap until it clicks 3 times and start/stop the car 3x times but the alert will not stop appearing in the panel.  When the alert occurs - it blinks and removes other important information in the panel, and is a nuisance when driving late at night.  This has occurred over several tanks of gas and outdoor temperatures.",
        "vin": "3HGGK5H44KM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/18/2021",
        "dateOfIncident": "07/06/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425357,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "July 2020 Multiple check engine lights came on. Misfire code P0304 and P0302 for cylinder 4 at 32,491 miles.  Dealership replaced fuel injectors on 07/16/20. five days and 562 miles later same issue occurred again. Back to dealership which found same codes and issues. Dealership perform decarb on system. 10/16/20 On a trip, same issue occurred so took to different Honda Dealership with only 1,000 miles driven since last issue. Same codes and same lights. This dealership stated misfire on all cylinders. They cleaned all cylinders of carbon. Cleaning lasted 10,000 miles and lights came back on 07/02/21. Had to wait to get service appointment at dealership on 07/09/21. Same lights and same misfire codes. Dealership states over 3 years/36,000 mile warranty now so not covered.  Now states needs to be decarbed and all 4 fuel injectors replaced at my expense. My issue is it was under warranty when issue first occurred. Even after parts were replaced, new parts did not solve the issue.  The new parts should have been warrantied for 1year/12,000 miles and they did not last that long.",
        "vin": "3HGGK5H49KM"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/11/2021",
        "dateOfIncident": "07/11/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424301,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2019",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Ewr Volpe Acme Inc.",
                "productMake": "TBD",
                "productModel": "TBD",
                "productYear": "9999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHAT FAILED: In May of 2020, I purchased a Towed Battery Charger Plus from RVIbrake.com; https://rvibrake.com/products/towed-battery-charger-plus?msclkid=8c6b9f0613801d9a3d3fffed4b442411&utm_source=bing&utm_medium=cpc&utm_campaign=**LP%20Branded&utm_term=rvi%20towed%20battery%20charger&utm_content=RVi%20-%20Towed%20Battery%20Charger  The reasoning behind this purchase was to keep the battery of my 2019 Honda Fit (manual Transmission) charged while being towed behind my 2017 Thor Gemini Class C RV.  SAFETY ISSUE: Today while towing the Honda Fit behind our Thor Gemini on Interstate 84 in Pennsylvania, I smelled a strong order of burned plastic. When I pulled over to the nearest rest area to investigate, I noticed the smell was emanating from the hood of my Honda Fit.  I have pictures that show what I found when I opened the hood (Towed battery charger unit melted). Sadly, the fuse that is on this this device did not blow. Even worse, is my Honda Fit is now dead. I have no power to the car at all. The ignition, lights, horn, door alarms no longer work. If I hadn’t pulled over when I did, I fear that the Towed Battery Charger Plus would have set my Honda Fit and Thor RV on fire.  Sent email to dealer/manufacture; RVIBrake. Also called their phone number and left a message. At this time dealer has not responded.  Part is available for inspection. Part has not yet been inspected by manufacturer, police or insurance company.  There was no warning lamp, message or other symptom of the problem. Problem was only noticed because I smelled burning plastic and stopped vehicle to investigate.",
        "vin": "3HGGK5G86KM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/14/2021",
        "dateOfIncident": "06/14/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420942,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I was sent a letter with respect to the recall of certain Honda vehicles and mine was included.  I called Galpin Honda in Mission Hills to make an appointment which was scheduled for June 15 (tomorrow) at 2:30 and it was cancelled two days after I made the appointment because I was told the part had not come in.  I received a text message AND an email today confirming my appointment and I emailed Galpin back to advise them the appointment had been canceled.  I am still waiting for a second letter that Galpin told me I would be receiving and to advise me when the part would arrive so I can take my car in for the repair.",
        "vin": "3HGGK5H4XKM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/26/2021",
        "dateOfIncident": "05/26/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418650,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "LCD gauge cluster including odometer, fuel level, and hazard warnings will go haywire displaying strange characters. The lcd display then flashes on and off and goes out completely displaying no vehicle information.",
        "vin": "3HGGK5H44KM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/22/2021",
        "dateOfIncident": "05/22/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418187,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "On May 22, 2021 I received a letter from Honda to advise me of a recall regarding my 2019 Honda Fit's fuel pump.  I am leasing said automobile which lease expires in October, 2022.  I tried making an appointment for June 15, 2021 at 2:30PM to have the fuel pump repaired only to receive a voicemail about an hour later from someone at Galpin Honda in Mission Hills (where I am leasing my car from) who said something to the effect that Honda was unable to repair my car because they don't have the parts to replace the fuel pump.  I was told I would be receiving a second letter (I was not told when nor what the second letter would consist of).",
        "vin": "3HGGK5H4XKM"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/01/2021",
        "dateOfIncident": "03/31/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406021,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK CAR IN FOR SNOW TIRE CHANGE OVER AND THE TIRE SHOP SAID CAR NEED ALIGNMENT DONE, BECAUSE THE TIRE WEAR WAS CONSISTENT OUT ALIGNMENT, THE NEXT DAY I TOOK ALIGNMENT SHOP, AFTER THEY ALIGN THE CAR, THEY ASK ME IF THE CAR WAS EVER IN CRASH, WHICH I STATE NO BECAUSE IT WAS NOT. CAR NOT BUT IT OVERDUE ALIGNMENT BECAUSE HAD ABOUT 17,000 MILES ON IT, THE REAR AXLE WAS OUT ALIGNMENT AND THEY SAID CANNOT BE ALIGN. SO, I CALL HONDA OF AMERICA AND THEY HAD ME TAKE TO DEALER TO VERIFY, WHICH AFTER VERIFYING IN ALIGNMENT. I DROVE BACK THE TIRE SHOP THEY REAR MEASURE AGAIN AND THE REAR STILL OUT ALIGNMENT. HOWEVER, THE TOE ONE THE RIGHT REAR HAD CHANGE FROM 3 DAYS OF NORMAL FORM -0.02 DEGREES TO +0.09 DEGREE DIFFERENT OF .11 DEGREE AND LEFT REAR MOVE IN TOE ABOUT .04 DEGREE. THE TIRE REPAIR SHOP DID QUICK GOOGLE SEARCH SAY THESE CARS HAVE HABIT FLEX AND TWISTING THE REAR AXLE. I HAVE BOUGHT THE CAR NEW IN JULY 2020, ASK DEALERSHIP ABOUT THIS ISSUE AND WHAT BECAUSE THEY SAID IT FROM DRIVING IN CONNECTICUT AND NEW ENGLAND AKA POTHOLE AND BUMPS IN THE ROAD FROM NORMAL DRIVING. PLEASE NOTE THE DEALERSHIP USED ALIGNMENT MEASURE DEVICE YOU DRIVE THRU WHILE THE TIRE SHOP USED A LIFT AND MIRROR AND LASERS TO MEASURE. I BELIEVE INCREASE TIRE WEAR IN BACK WILL BE PROBLEM AND LOWER OVER THE CONTROLS OF THE VEHICLE AS WHEEL NOT TRACKING RIGHT DOWN THE ROAD. I BELIEVE THE REAR AXLE IN UNDERSIZE FOR THE CAR OR HAS FLAW IN THE METAL THAT USED THE BUILD THE CARS.  I WOULD UP THE REPORT, BUT THEY CONTAIN VIN NUMBER.",
        "vin": "3HGGK5H64KM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/02/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394347,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN STARTING VEHICLE THE VEHICLE WILL MISS FIRE CAUSING ALL WARNING LIGHTS TO COME ON THE DASH BOARD.  THE FIRST FIX INCLUDED NEW FUEL INJECTORS.  IT THEN HAPPENED AGAIN A FEW MONTHS LATER, THIS TIME A DIFFERENT ONE MISFIRED.  NO LONG TERM SOLUTION FOUND AT THIS POINT TO THE PROBLEM.",
        "vin": "3HGGK5H47KM"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/09/2021",
        "dateOfIncident": "01/04/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387273,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL OF A SUDDEN ALL MY DASHBOARD LIGHT COMES ON    1.POWER STEERING SYSTEM PROBLEM (EPS)  2.HILL START ASSIST PROBLEM  3.ROAD DEPARTURE MITIGATION SYSTEM PROBLEM   4.VEHICLE STABILITY ASSIST PROBLEM (VSA)  5.POWER STEERING ASSIST PROBLEM (EPS)  6.EMISSION SYSTEM PROBLEM  7.TYRE PRESSURE MONITOR PROBLEM",
        "vin": "3HGGK5H83KM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/13/2020",
        "dateOfIncident": "11/13/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374527,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR IS UNDER RECALL TO REPLACE FUEL PUMP ASSEMBLY. THE SERVICE DEPARTMENT OF THE FIRST DEALERSHIP I CALLED, CASTLE HONDA IN MORTON GROVE, IL, TOLD ME THEY WOULD NEED TO INSPECT THE CAR FIRST BEFORE ORDERING THE PART AND WOULD ONLY REPLACE IT IF IT WAS DAMAGED.  I ARGUED THAT THAT WAS NOT WHAT THE RECALL NOTICE SAID THEY WOULD DO, BUT THE REP INSISTED THEY WOULD NEED TO INSPECT THE CAR AND IT MIGHT NOT NEED REPAIR.  I CALLED A SECOND DEALERSHIP AND THEY IMMEDIATELY SCHEDULED AN APPOINTMENT FOR THE REPAIR. (MY COMPLAINT IS WITH THE CASTLE HONDA DEALERSHIP, NOT WITH AMERICAN HONDA).",
        "vin": "3HGGK5H41KM"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/13/2020",
        "dateOfIncident": "03/18/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349142,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY NEW VEHICLE FEBRUARY 2020.    THESE ARE MY ELECTRONIC VEHICLE ISSUES:    1) MY BATTERY DIES WHEN LEFT FOR SEVERAL HOURS WITH NO ELECTRONICS LEFT ON AND NO AFTER MARKET ADD ON EQUIPMENT.    2) ELECTRONIC DISPLAY LOOSES TOUCH FUNCTIONALITY. BATTERY DISCONNECT RESTORES.    3) RADIO PRESETS CHANGE TO CHANNELS I WOULD NOT SELECT.    I THINK A HACKER HAS COMPROMISED THE GPS OR CELLULAR PHONE FACTORY POWER/CONNECT ATTACHMENT. THESE ISSUE STOP WHEN THE VEHICLE LOOSES VIEW OF THE SKY. IE., METAL ROOF GARAGE. ATTACHED VOLT METER AND VEHICLE HAS SEVERE ELECTRICAL DRAIN FOR NORMAL 14.4 TO 12.2 VOLTS. THIS IS VARIABLE AND UNRELATED TO HEAVY POWER DRAINING EQUIPMENT LIKE \"REAR WINDOW DEFROSTER.\" ELECTRICAL SYSTEM NORMALLY DROPS MOMENTARILY DURING FACTORY EQUIPMENT INITIAL TURN ON BUT QUICKLY RETURNS TO 14.4 VOLTS.AT VARIOUS TIMES WHILE DRIVING, SYSTEM VOLTAGE WILL REMAIN AT 12.2 VOLTS WITH NO USER ELECTRICAL EQUIPMENT CHANGE.    POSSIBLE SUSPECT WITHIN LAW ENFORCEMENT REPORTS.    LAW ENFORCEMENT REPORTS:  RUSSELL CTY AL 19SL06902, 18SL12031, 19SL06910  LEE CTY AL 1906-2823, 1810-2196",
        "vin": "3HGGK5H8XKM"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/11/2020",
        "dateOfIncident": "05/28/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348643,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF A NHTSA CAMPAIGN NUMBER: 20V314000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER HONDA OF DOWNTOWN LOS ANGELES (780 W MARTIN LUTHER KING JR BLVD, LOS ANGELES, CA 90037, (213) 266-7366) WAS CONTACTED AND CONFIRMED THAT THE PART WAS NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3HGGK5H48KM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/11/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348683,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE OWNED THE 2019 FIT FOR JUST OVER A YEAR NOW. IT WAS A JOY TO DRIVE WHEN WE FIRST GOT IT..     A FEW MONTHS AGO IT STARTED DRIFTING SIDE TO SIDE.. MOST NOTICEABLE AT HIGHWAY SPEEDS. IT IS ALMOST IMPOSSIBLE TO KEEP IT TRACKING STRAIGHT ON THE HIGHWAY ANYMORE. IT STARTS TO GO LEFT, AND JUST A SLIGHT STEER TO RIGHT OVERCORRECTS AND THEN IT'S GOING TOO FAR TO THE RIGHT, THEN AGAIN BACK TO THE LEFT. I AM CONSTANTLY BOUNCING BETWEEN THE LANE GOING DOWN THE HIGHWAY. ALSO THE LANE ASSIST WON'T KEEP THE CAR CENTERED ANYMORE EITHER. IT USED TO WORK GREAT!     THE HONDA DEALER SAID EVERYTHING LOOKED GOOD AND DROVE FINE FOR THEM.. STEERING, SUSPENSION, ALIGNMENT, TIRES.. ALL SUPPOSEDLY CHECKS OUT. THIS CAR IS NOW VERY TIRING TO DRIVE AND JUST PLAIN UNSAFE AT THIS POINT. I DON'T KNOW WHERE TO GO FROM HERE. IT'S JUST OVER 21K MILES.",
        "vin": "3HGGK5H99KM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/03/2020",
        "dateOfIncident": "05/29/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343023,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MILLER HONDA, MY DEALER GOT A NOTICE OF RECALL ON 5/29/2020 FOR IMPORTANT SAFETY RECALL DEFECT IN MY MODEL OF CAR\"FUEL PUMP MODULE IMPELLERS MAY ABSORB EXCESSIVE FUEL AND DEFORM CAUSING CAR TO STOP WHILE IN MOTION CAUSING A CAR CRASH. ALSO, WILL FAIL INSPECTION. PARTS WILL NOT BE AVAILABLE THEY SAY UNTIL POSSIBLY END OF SUMMER. THIS IS UNACCEPTABLE AND I WANT TO RETURN THE CAR AND MY MONEY REFUNDED BY HONDA MOTORS ON THE LEASE I'VE BEEN PAYING ON. I AM NOT ABLE TO DRIVE MY CAR AND I COULD BE KILLED OR KILL SOMEONE ELSE AND MILLER HONDA CANNOT HELP ME. THERE FORE, I WANT TO RETURN MY VEHICLE 2019 HONDA FIT CVT MILEAGE 1,746 MILES. I HAVE NOTICED THE HESITATION IN THE CAR WHILE DRIVING. THANK HEAVEN I WAS NOT KILLED BY NOW AND I NEED A CAR TO DRIVE. THIS CAR CAN NOT BE REPAIRED AND IT HAS BEEN OVER 60DAYS SINCE THE RECALL, WHICH MILLER HID FROM ME, AS WELL AS HONDA MOTORS.",
        "vin": "3HGGK5H88KM"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "07/22/2020",
        "dateOfIncident": "07/10/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11340971,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2019 HONDA FIT. CONTACT STATED PULLING INTO A PARKING SPOT WITH FOOT ON THE BRAKE, SLOWING TO A STOP, WHEN SHE WAS ALMOST AT A COMPLETE STOP THE VEHICLE INADVERTENTLY LURCHED FORWARD. THE VEHICLE COLLIDED WITH A CEMENT POLE IN A PARKING GARAGE. THE AIR BAGS DEPLOYED AS A RESULT OF THE COLLISION. THE VEHICLE WAS DEEMED A TOTAL LOSS DUE TO THE DAMAGE. THE CONTACT STATED THAT SHE HAD NO CONTROL OF THE VEHICLE. THE CONTACT STATED DUE TO THE AIR BAG DEPLOYMENT SHE SUSTAINED SORENESS TO THE CHEST THAT DID NOT REQUIRE MEDICAL ATTENTION. A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS TOWED TO AN AUTO BODY REPAIR FACILITY WHERE THE DAMAGES WERE ASSET, HOWEVER THE FAILURE CAUSE WAS NOT DIAGNOSED. THE VEHICLE WAS NOT TAKEN TO A DEALER OR INDEPENDENT MECHANIC TO DETERMINE THE FAILURE CAUSE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE CONTACT STATED THAT SHE RESEARCHED RECALLS AND FOUND NHTSA CAMPAIGN NUMBER: 20V314000 (FUEL SYSTEM, GASOLINE) HOWEVER, HER VIN WAS NOT INCLUDED. THE FAILURE MILEAGE WAS 2,882.*DT  CONSUMER STATED FOOT WAS FIRMLY ON THE BRAKE AND CAR NEARLY STOPPED WHEN CRASH HAPPENED.*JB",
        "vin": "3HGGK5H82KM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "07/22/2020",
        "dateOfIncident": "07/10/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11340982,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS VERY SLOWLY TURNING INTO A PARKING SPOT WITH MY FOOT ON THE BRAKE, NEARLY STOPPED, WHEN THE CAR SUDDENLY LUNGED FORWARD PROPELLING THE CAR INTO A CEMENT FOUNDATION WITH SUCH FORCE AS TO DEPLOY THE AIRBAG AND SEVERELY DAMAGE THE CAR (IT WAS LATER DECLARED A TOTAL LOSS BY THE INSURANCE COMPANY). I FELT LIKE THE CAR WAS OUT OF MY CONTROL, AS THOUGH IT HAD A MIND OF ITS OWN. MY FOOT WAS FIRMLY ON THE BRAKE AND NOT TOUCHING THE GAS PEDAL. THE CAR WAS NEARLY STOPPED WHEN THIS HAPPENED. IT OCCURRED IN AN UNDERGROUND PARKING LOT.*DT    CONSUMER STATED CAR NEARLY STOPPED WHEN CRASH HAPPENED.*JB",
        "vin": "3HGGK5H82KM"
    },
    {
        "components": "SEATS,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/12/2020",
        "dateOfIncident": "07/07/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338924,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSANGER SEAT AREA DEFLATED THE CUSHION SEAT EAS DEFLATED ALSO FUEL INJECTION PROBLEM MAKING A LEFT TURN CAR STALLED WAS ALMOST KILLED HEAD ON AND ALMOST HIT FROM BEHIND.",
        "vin": "3HGGK5H49KM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/19/2020",
        "dateOfIncident": "04/22/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325111,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "GOT MY OIL CHANGED. NOTICED ON THE RECEIPT THAT IT SAYS FLOODED (FLA). I WAS TOLD THAT THIS WAS A NEW CAR. CERTAINLY NO ONE SAID THAT IT HAD BEEN IN A FLOOD.. IS THERE ANY WAY TO VERIFY WHETHER IT DID OR NOT?  *TR",
        "vin": "3HGGK5H4XKM"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "05/04/2020",
        "dateOfIncident": "01/02/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323300,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS DAMAGED BY COLLISION WITH A ROAD LADDEN FEMALE OF STANDARD NORTH AMERICAN SIDE WITH RELEVANT EXISTENT DAMAGE AS SUPERFICIAL TO.DRIVER SIDE HOOD PANEL; THE RESULTING DAMAGE FROM OBLONG FRONT PASSENGER SIDE IMPACT CRIMPED AND INDENTED THE HOOD SUCH THAT OBLIQUE DRIVERS SIDE IMPACT WOULD HAVE PUNCTURED ENGINE AND DRIVE TRAIN MECHANISMS. ON INFORMATION AND BELIEF, THE AUTOMOBILE IS PRESERVED AS DAMAGED AFTER MECHANICAL ESTIMATE TO REPAIR. SHOULD YOU CHOOSE TO REQUISITE FOR INSPECTION AS TO MARKETABILITY OF LIKE MODEL, PLEASE CONTACT [XXX]    REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *CC",
        "vin": "3HGGK5H42KM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/16/2019",
        "dateOfIncident": "10/15/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289402,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AUTO-LOCK FAILS INTERMITTENTLY AFTER EXITING THE FIT WITH THE KEY FOB ON MY PERSON, ENGINE OFF, ALL DOORS SHUT, LEAVING THE CAR'S CONTENTS INSECURE AND AT RISK OF THEFT. THE DEALER AND HONDA AMERICAN AFTER 3 MONTHS DON'T KNOW HOW TO FIX IT. THE CONCERN IS FURTHER ESCALATED WHEN CONCEALING LEGAL WEAPONS IN THE VEHICLE.",
        "vin": "3HGGK5H87KM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/11/2019",
        "dateOfIncident": "10/11/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268020,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL INJECTOR FAILURE AT 8770 MILES. ORIGINALLY DEALER BELIEVED IT WAS A CYLINDER MISFIRING AND REPLACED CYLINDER #2. WHEN THE PROBLEM REOCCURRED WITHIN THE SAME MONTH, THEY REPLACED 1 OF THE FUEL INJECTORS.",
        "vin": "3HGGK5H84KM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "10/10/2019",
        "dateOfIncident": "10/10/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267769,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS PULLING INTO A PARKING SPOT WITH MY FOOT ON THE BRAKE, SLOWING A STOP, WHEN THE CAR SUDDENLY LURCHED FORWARD.  IT FELT LIKE A SUDDEN JOLT WHICH PROPELLED THE CAR OVER THE PARKING SPOT CURB AND INTO A POLL.  THIS CAUSED ME TO SLAM MY FOOT EVEN HARDER ON THE BRAKE TO STOP THE CAR.  THE WHOLE EXPERIENCE WAS SO ODD THAT IT FELT LIKE THE CAR HAD A MIND OF ITS OWN.  I STILL HAVE NO IDEA WHAT CAUSED IT, BUT I CAN SAY WITH CERTAINTY THAT NOTHING WAS TOUCHING THE GAS AS MY FOOT WAS FIRMLY ON THE BRAKE.  THE CAR WAS ALMOST COMPLETELY STOPPED WHEN IT SURGED FORWARD.",
        "vin": "3HGGK5H88KM"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/21/2019",
        "dateOfIncident": "08/17/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257169,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A TWO WAY HIGHWAY AT 55 MPH WITH NO CARS IN FRONT OF ME IN MY LANE. AN INCOMING CAR IN THE OTHER LANE GOING ABOUT 55 OR MORE MPH WAS DRIVING IN THE OTHER LANE. AS THE CAR GOT CLOSER TO MY CAR AND IN THEIR LANE, THE HONDA FIT SENSORS WENT OFF. FIRST, THE BRAKE SIGNAL FLASHED ON THE PANEL AND MADE A LOUD WARNING NOISE. SECONDLY, MY STEERING WHEEL RATTLED. LASTLY, THE CAR STARTED TO BRAKE QUICKLY. LUCKILY, I SOFTLY HIT THE BRAKES AND IT OVERRODE THE SENSOR. IT FELT LIKE IT WAS STARTING TO DO A FULL STOP ON THE HIGHWAY WITH CARS BEHIND ME. THIS HAS HAPPENED A SECOND TIME AT 45 MPH. NOW I HAVE TO TURN OFF THE SENSORS EVERY TIME. I WORRY IT WILL GLITCH AGAIN OR TURN ON AND BRAKE AT A FULL STOP WITHOUT MY CONTROL. THE TURNING SENSORS ALSO ARE MALFUNCTIONING ESPECIALLY AT TURNS. EVEN WHEN YOU ARE IN BETWEEN THE LINES AND GOING SLOW, IT TURNS ON AND SLIDES YOU TOWARDS THE MIDDLE, YELLOW LINE AND TOWARDS ONCOMING TRAFFIC.",
        "vin": "3HGGK5H86KM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "07/26/2019",
        "dateOfIncident": "07/12/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11235211,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 HONDA FIT 5DR EX: FLEW OFF ROAD, IT HAD HONDA COLLISION MITIGATION BRAKING SYS, LANE DEPARTURE WARNING, LANE KEEP ASSIST SYS AND ROAD DEPARTURE MITIGATION, ALL FAILED AND ACCIDENT HAPPENED. VEHICLE IN MOTION TRAVELING 80MPH WHEN LEFT THE ROAD.",
        "vin": "3HGGK5H89KM"
    }
]