[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/10/2022",
        "dateOfIncident": "11/29/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446977,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "My 2019 Hyundai Accent engine failed at 65,004 miles. I've taken my car to a local Hyundai dealership from December 2020 up until it failing in December 2021, I've had an appointment at least once a month for my check engine light being on. They scheduled me my first appointment December 2020 and later told me they fixed the issue only for it to come back on a couple days later. I call them again letting them know and the schedule me again, same thing happens and the light comes back on a week later. This was an ongoing issue, the dealership kept telling me they fixed it and to make sure the gas cap was tightened but they could never stop my check engine light from coming back on. They told me back in September of 2021 that I had a large evap leak. When it came to finding this leak they were never successful. Fast forward to December 2021 my car started making these weird noises and I immediately brought it up to the same local Hyundai that I've been taking it to since day one. They tell me there is nothing they can do for me since they are booked up until Feb. 2022 and so were all the other dealerships near me. I understood and left then a week or two after this my car completely stops in the middle of the expressway. I had to get my car towed to Hyundai for them to tell e my engine seized, coincidental right? After an entire year of Hyundai not being able to find the issue and fix it my engine magically seizes, a 2019 Hyundai at that meaning the car is still fairly new. The entire time I was taking it there I was under warranty up until 5,004 miles ago. The powertrain warranty for a used car ends at 60,000 miles and now Hyundai expects me to pay for something I had no fault in. I have emailed, complained and spoke to almost everyone I can about this issue. I just want justice to be rightfully served and for Hyundai to cover all expenses towards my new engine replacement.",
        "vin": "3KPC24A3XKE"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/13/2021",
        "dateOfIncident": "09/17/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436632,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Hyundai Accent. The contact received a recall notification for NHTSA Campaign number: 21V619000 (Latches/Locks/Linkages). The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not notified of the issue. The part was not available for the repair. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "3KPC24A37KE"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/02/2021",
        "dateOfIncident": "08/16/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431448,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Hyundai Accent. The contact stated that while operating the vehicle, the Electronic Stability Control and airbag warning lights remained illuminated. Additionally, while driving 53 MPH, the cruise control would not deactivate while depressing the brake pedal. The cruise control feature eventually became inoperable. In addition, while operating the vehicle the braking system was slightly activated causing the vehicle to drive rough. The cause of the failure was not determined. The local dealer and manufacturer were not yet notified of the failure. The failure mileage was 44,000.",
        "vin": "3KPC24A35KE"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/12/2021",
        "dateOfIncident": "06/14/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424344,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "My connecting rod blew out of my engine I have a Hyundai Accent 2019, I have 65000 miles in the vehicle and have done some research as well and have seen that Hyundai vehicles for at least almost 10 years have had similar problems with their engines at around the same mileage. Maybe it’s possible that it was the same problem with my vehicle.",
        "vin": "3kpc24a37ke"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/18/2019",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269495,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "PULLING TO THE LEFT, AND ON THE FREEWAY AT FREEWAY SPEEDS, I HAVE TO MAINTAIN CONSTANT PRESSURE TO KEEP THE CAR TRACKING STRAIGHT. LES SCHWAB  CHECKED THE ALIGNMENT AND SAID IT WAS IN FACTORY SPECIFICATIONS. THEY SWAPPED THE RIGHT AND LEFT FRONT TIRES, AND IT STILL PULLS TO THE LEFT. THIS IS A SAFETY ISSUE. MY CAR HAS 19, 000 MILES ON IT AND IS STILL UNDER FACTORY WARRANTY. THIS IS AN ONGOING PROBLEM.",
        "vin": "3KPC24A39KE"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/27/2018",
        "dateOfIncident": "10/26/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154367,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN YOU MADE A CLOSED TURN TO THE RIGHT, MADE A STRONG STRIKE ON THE LEFT SIDE OF THE SUSPENSION. IT SOUNDED LIKE A LOOSE NUT IN AN ALUMINUM TRAY.   ONE MONTH LATER IN MY HUSBAND DRIVING THE VEHICLE MADE THE RIGHT TURNING TO HEARD THE SOUND AND MADE THE APPOINTMENT TO DISCOVER THAT WAS THE JOINT SHAFT BOLT LOOSE.",
        "vin": "3KPC24A39KE"
    }
]