[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/26/2022",
        "dateOfIncident": "01/22/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458423,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Motor blew with regular maintenance done at 77k",
        "vin": "KM8J23a47ku"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/20/2022",
        "dateOfIncident": "03/19/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457550,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "When driving car slowed down and battery sign appeared on the dash board. The car started to gives jerks when stopped at the traffic light. When continued after the lights,  it struggled to pick up. This happened two to three times in two days.",
        "vin": "KM8J3CA40KU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/07/2022",
        "dateOfIncident": "02/28/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455496,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Engine stalled. Drove it to gas station but engine has knocking sound. Was told that it may fall under the Theta Engines recall.",
        "vin": "KM8J23A44KU"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/04/2022",
        "dateOfIncident": "03/02/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455134,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Ewr Volpe Acme Inc.",
                "productMake": "TBD",
                "productModel": "TBD",
                "productYear": "9999",
                "type": "Vehicle"
            }
        ],
        "summary": "Car started knocking on a Wednesday  like it wanted to cut off, no engine lights came on. Got car towed to dealership on Thursday morning, still no engine light. Dealership called on Thursday said I need a new engine. Car was a 2019 Hyundai Tucson which I purchased in 2020 with 60,059miles. I was the second owner.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/24/2022",
        "dateOfIncident": "02/23/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453741,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "On 2-23-2022 , I was driving approximately 30 MPH when all of a sudden there was a noise that kept getting louder which sounded like a knocking or broken fan, the vehicle RPM increased, the vehicle hesitated, did not accelerate, stalled, the check oil and engine light came on, I coasted into parking lot. When I opened the hood, there was no signs of smoke, oil leak, or smells, however, when I went to check the oil, smoke came out of where the oil dip stick goes. I attempted to have the vehicle jump started with no luck, just a clicking sound. I had the vehicle towed to be serviced.",
        "vin": "KM8J2CA43KU"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "02/09/2022",
        "dateOfIncident": "02/09/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451103,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Blind spot warning becomes disabled sporadically? Engine needs to be turned off and restarted to reconnect Blind Spot Warning.  This has been an ongoing problem for the last few years. It never shows up when brought into dealer for inspection? Nor are there any computerized “messages” in the system?  The below “Additional Details” only reflect yesterday’s occurrence. This problem happens on a regular basis. with no regularity?",
        "vin": "KM8J33AL7KU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/04/2022",
        "dateOfIncident": "01/18/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450386,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Was driving uphill, heard a clanging sound. Car engine completely shut off and started smoking, lights worked. Towed it to dealer, they said it will be 30 days before we hear about the issue, they said they will fix the original recall after tearing the engine down.",
        "vin": "KM8J2CA49KU"
    },
    {
        "components": "POWER TRAIN,ENGINE,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "01/05/2022",
        "dateOfIncident": "12/31/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446347,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving down a busy road at 10:00 pm on New Years Eve, my vehicle's engine completely shut off. Immediately prior to the shut off, the vehicle's dash displayed the oil and battery lights. The vehicle's automatic emergency brake and steering wheel lock were both engaged, not allowing me (or the tow truck company) to move my vehicle out of this busy road. My car remained in this location for 3 and a half hours. The hazard lights stopped working after the first hour, making it extremely difficult to see that the vehicle was stopped. After the second hour, an officer parked behind my vehicle with their lights flashing as he said it was an extremely dangerous situation and my car was sure to be hit. He was able to get a tow truck to me before Hyundai. For  hours, numerous people were forced to brake quickly/swerve into other lane to avoid hitting my car. This occurred right before an intersection, putting 4 directions of drivers at risk of collision. I stood in the rain, near my car, attempting to help direct drivers away from the lane until the police officer showed up.   The vehicle is now at the dealership which confirmed engine failure, pending replacement. Possibly related, this vehicle had the catalytic convertor replaced 3 months prior. It is not yet confirmed if this contributed to the engine failure.",
        "vin": "KM8J3CA41KU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/03/2022",
        "dateOfIncident": "11/30/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446023,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The engine in my 2019 Hyundai Tucson turned off while driving down the interstate without any lights or warnings. My 2 year old was in the back seat at the time, and this could have caused a significant risk to not only myself and son, but others on the road if we were not traveling at highway speed. The vehicle was safely pulled over to the side of the road and would not restart. I got it towed to the dealership it was purchased from and they informed me they have been having a lot of issues with engines recently and mine would need to be replaced. It has now been sitting at the dealership since Thanksgiving waiting to be serviced, which is covered under manufacture warranty. It is located at Hyundai of Brunswick in Brunswick, Ga and can be accessed if needed.",
        "vin": "KM8J33A48KU"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/23/2021",
        "dateOfIncident": "11/11/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444875,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Purchased the vehicle in June 2021 only had 1 previous owner. The dealership stated it was a pre-owned certified used vehicle that had just been inspected and service. Within the first month I had to take it back for multiple issues most recently the catalytic converter to be replaced and the Engine. I haven't even owned it let alone driven it long or far enough for either of these parts to need service or have failed. It's not even time for my first oil change that how low the mileage is that I've put on it. The dealership originally told me they never head about the complaints regarding the engine now they are trying to stiff me on selling me a lemon by charging me 3000 and telling me Hyundai isn't willing to cover the repairs. If this is a known issue which is seems to be a recall should now be issued.",
        "vin": "KM8J3CA48KU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/21/2021",
        "dateOfIncident": "12/20/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444580,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Hyundai Tucson. The contact stated that while her husband was driving at an undisclosed speed, several unknown warning lights illuminated. The vehicle was taken to an independent mechanic and diagnosed with engine failure. The vehicle was not repaired. The manufacturer was not made aware of the failure. The failure mileage was approximately 86,000.",
        "vin": "km8j2ca41ku"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/03/2021",
        "dateOfIncident": "12/02/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442536,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Purchased the car in March 2021 with 41,391 miles on it. The day after I picked it up check engine light came on checked the code it was a P0420 catalyst system efficiency below threshold, contacted dealer they took the car in and replaced the catalytic converter. Now 8 months later & a little less than 15,000 miles the check engine light came on again and guess what code popped up? P0420 now I am not an auto expert but I don't think its right that a catalytic converter would need to be replaced twice in that short time frame. Time to figure out what is causing this considering I am not the only one who has reported this",
        "vin": "KM8J2CA48KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/22/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437755,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Hyundai Tucson. The contact received notification of NHTSA campaign number: 20V543000 (Service Brakes, Hydraulic) however, the part to do the recall repair was unavailable. The vehicle was taken to the local dealer who stated the parts were not available. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not notified. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "KM8J2CA43KU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/22/2021",
        "dateOfIncident": "10/21/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437840,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Going up a hill, \"Check Blind-Spot Collision Warning System\" alert, clunk sound, rpms revved high, power lost and did not shift gears. 2 occurrences. Approximately 40,000 miles.",
        "vin": "km8j33al7ku"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/14/2021",
        "dateOfIncident": "10/14/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436839,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Hyundai Tucson. The contact stated that while driving at 30 MPH, a light knocking sound was heard coming from the engine. There was no warning light illuminated. The contact inspected the vehicle and discovered that the oil level was low despite recently having an oil change. The contact then added 2 quarts of oil inside the engine and resumed driving 30 MPH however, the vehicle shut off without warning. The dealer was contacted, and she had the vehicle towed to the dealer. The manufacturer had yet to be notified of the failure. The vehicle had yet to be repaired. The failure mileage was 51,392.",
        "vin": "km8j2ca43ku"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/13/2021",
        "dateOfIncident": "10/13/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436565,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I have not owned this vehicle since 1/2021.  I informed the dealer who took the vehicle in trade that there was an open recall.  I have let Hyundai know that I no longer own the vehicle. Despite multiple communications with Hyundai, they have made no indication that they would try to find the new owner and direct recall information to that party.  In the past, when this situation has occurred with other manufacturers, letting the manufacturer that I no longer owned the vehicle was sufficient and the manufacturer took over from there.  I find Hyundai's process to be unsatisfactory.  As I have not been able to redirect them to the new owner, I am taking the step of informing NHTSA.",
        "vin": "KM8J3CAL9KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/08/2021",
        "dateOfIncident": "10/08/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436093,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Hyundai Tucson. The contact received a recall notification for NHTSA Campaign Number: 20V543000 (Service Brakes, Hydraulic) however, the dealer informed the contact that the part for the recall repair was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was not notified of the issue. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "KM8J2CA4XKU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/20/2021",
        "dateOfIncident": "09/07/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433721,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 Tucson 74165 miles. While driving on the highway the engine began to knock, and as the traffic came to a stop the car stalled and the oil and battery light came on. Before that the lights never came on. I got it to the shoulder and checked the oil, it was dry with no leaks on the outside of the engine. Towed to my mechanic and he said total engine failure. Hyundai discontinued this motor and Jasper a leading engine manufacturer will not produce after market because they cannot warranty it for three years or hundred thousand miles. This will become a recall as this model year gets higher milage, and Hyundai knows it.",
        "vin": "KM8J23A48KU"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/16/2021",
        "dateOfIncident": "07/03/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433214,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Hyundai Tucson. The contact stated that the vehicle was consuming oil. The contact stated while her daughter was driving approximately 40 MPH, the RPM increased from 2,000 to 3,000 RPM. There was no warning light illuminated. The vehicle was taken to the local dealer where they were unable to duplicate the failure. The vehicle was not diagnosed or repaired. The vehicle was taken back to the local dealer and diagnosed that an oil change was needed, and the PCV valve needed to be replaced. The vehicle was repaired however, the failure recurred. Additionally, while her daughter was driving the vehicle hesitated and failed to accelerate. The vehicle was taken back to the local dealer and it was determined that an oil consumption test needed to be performed. The manufacturer was notified however, no further assistance was provided. The failure mileage was approximately 41,580.",
        "vin": "KM8J2CA40KU"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "07/19/2021",
        "dateOfIncident": "01/05/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425565,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Sometimes the auto hold will turn orange and the button sinks in and freezes there. I cannot release it and it does not operate at all. It has happened twice since I got the one recall fixed, once before the recall. I thought the recall would fox it and the dealership thought so also but it did not solve the issue. Since the dealership has new management I have received no assistance from them. The new management has very poor customer service since the change and are still repairing the damage to my engine they said they caused, but i believe could be something to do with a lawsuit which is why they refuse to speak with me.",
        "vin": "KM8J2CA4XKU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/23/2021",
        "dateOfIncident": "06/23/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421968,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Hyundai Tucson. The contact received notification of NHTSA campaign number: 20V543000 (Service brakes, Hydraulic) However, the part to do the recall repair was unavailable. The contact called the dealer where it was confirmed that the part was not available. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue and the contact filed a case. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "KM8J3CAL4KU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/12/2021",
        "dateOfIncident": "06/12/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420669,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The vehicle could not pass safety and emission inspection, check engine lights on (Catalyst System Efficiency) the vehicle has only 45000 mileage, apparently has deficiency on Catalyst System)",
        "vin": "KM8J2CA44KU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/11/2021",
        "dateOfIncident": "09/04/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416200,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "IN SEPT. 2020 I RECEIVED A RECALL NOTICE ON MY 2019 HYUNDAI TUCSON. I IMMEDIATELY CALL AND WAS PUT ON A WAITING LIST TO GET IT FIXED.. HERE IT IS 8 MONTHS LATER AND STILL DO NOT HAVE MY CAR FIXED. I KEEP DOING FOLLOW UPS ON MY CAR AND JUST GET THE RUN AROUND. I HAVE KEPT NOTES EACH TIME IVE CALLED THE DEALERSHIP(PARTS DEPT) AND THE RESPONSES THEY'VE GIVEN ME AND THE LAST ONE THEY LIED TO ME. MY DEALERSHIP IS IN CLEVELAND TN(GREY EPPERSON HYUNDAI)..1ST CALL-GOT ON WAITING LIST;  2ND CALL-WAS TOLD THEY HAD SOME PARTS IN BUT THEY HAD TO GO ON THE CARS WAITING TO BE SOLD;  3RD CALL-WAS TOLD THEIR  SYSTEM HAD BEEN HACKED AND THEY COULDNT SEE WHAT THEY HAD;  4TH CALL-PARTS GUY HAD NO IDEA WHAT I WAS TALKING ABOUT AND REFERED ME TO SOMEONE NAME RANDY. HE PROCEDED TO TELL ME OH THEY HAD PLENTY OF PARTS BUT WHEN I ASKED HIM WHY NO ONE HAD CALLED ME THEN HE COULDNT SAY. HE THEN SCHEDULED ME FOR AN APPT FOR MAY5, 2021 @2:30.MY HUSBAND AND I DRIVE OVER AN HOUR FOR THE APPT ONLY TO BE TOLD BY THE TWO GIRLS IN THE PARTS DEPT THAT THEY DID NOT HAVE IN THE PARTS/KITS FOR MY VEHICLE AND THEY DIDNT KNOW WHY THE GUY(RANDY) TOLD ME THEY DID. I'M REALLY FURIOUS WITH THIS PLACE RIGHT NOW AN WILL NEVER BUY FROM THEM AGAIN.    DONT KNOW WHERE ELSE TO TURN?",
        "vin": "KM8J23A41KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/10/2021",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415934,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE VEHICLE WAS TAKEN TO FOLSOM LAKE HYUNDAI (12530 AUTO MALL CIR, FOLSOM, CA 95630, (916) 293-4760) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J2CA42KU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/03/2021",
        "dateOfIncident": "05/03/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414947,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "A RECALL NOTICE FROM HYUNDAI WAS ISSUED LAST FALL AND WE IMMEDIATELY CONTACTED THE DEALER TO GET THE REPAIR DONE. WE WERE TOLD THEY DIDN'T HAVE THE PART AND IT WAS ON ORDER. SIX MONTHS LATER AND MULTIPLE CALLS AND MESSAGES TO TWO DIFERENT DEALERSHIPS AND OUR CAR SITS IN THE DRIVEWAY UNREPAIRED. HOW LONG IS REASONABLE TO GET A RECALL REPAIR AND AT WHAT POINT ARE WE OWED COMPENSATION FOR A VEHICLE WE SHOULD NOT BE DRIVING BECAUSE IT CAN CATCH FIRE? WHO DO WE CONTACT TO GET THIS REPAIR COMPLETED. THIS IS UNACCEPTABLE.",
        "vin": "KM8J33AL2KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/30/2021",
        "dateOfIncident": "04/16/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414662,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT PHIL LONG HYUNDAI OF MOTOR CITY (LOCATED AT 170 W MOTOR WAY, COLORADO SPRINGS, CO 80905, (719) 453-0549) EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/20/2021",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11412974,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE VEHICLE WAS TAKEN TO JENKINS HYUNDAI OF OCALA (1602 SW COLLEGE RD, OCALA, FL 34471, (352) 815-2533) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J33A49KU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/16/2021",
        "dateOfIncident": "09/15/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408470,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WE RECEIVED A RECALL NOTICE FROM HYUNDAI LAST FALL AND IMMEDIATELY CONTACTED THE DEALER TO GET THE REPAIR. MADE AN APPOINTMENT AND TOOK THE CAR FOR WORK TO BE TOLD THEY DIDN'T HAVE THE PART. SEVEN MONTHS LATER AND MULTIPLE CALLS AND MESSAGES AND OUR CAR SITS IN THE DRIVEWAY UNREPAIRED. HOW LONG IS REASONABLE TO GET A RECALL REPAIR AND AT WHAT POINT ARE WE OWED COMPENSATION FOR A VEHICLE WE SHOULD NOT BE DRIVING BECAUSE IT CAN CATCH FIRE? WHO DO WE CONTACT TO GET THIS REPAIR COMPLETED.",
        "vin": "KM8J33AL9KU"
    },
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "04/14/2021",
        "dateOfIncident": "04/14/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407672,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 HYUNDAI TUCSON. CONSUMER WRITES IN REGARD TO ABS RECALL. *LD    THE CONSUMER STATED THE PARTS TO COMPLETE THE RECALL WERE UNAVAILABLE. *JS",
        "vin": "KM8J3CAL7KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/13/2021",
        "dateOfIncident": "04/12/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407949,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS LOOKING UP TO SEE IF MY CAR HAD ANY RECALLS. BECAUSE, MY OTHER CAR JUST HAD ONE. I JUST BOUGHT THIS CAR AND SURPRISE THEY DID KNOW IT HAD A RECALL .I BOUGHT IT USED MAY BE THAT'S WHY BUT  IT'S REGISTERED  I JUST WANT A RECALL CARD SO THE PROBLEM CAN GET FIX NOW THAT I KNOW. THANK GOODNESS NO ACCIDENT  JUST WANT  RECALL CARD TO FIX PROBLEM THANK YOU.",
        "vin": "KM8J23A48KU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/12/2021",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407703,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS RECALLED IN SEPTEMBER. MADE APPOINTMENT FOR RECALL REPAIR IN NOVEMBER. APPOINTMENT WAS CANCELED DUE TO THE PART NOT BEING AVAILABLE. MADE ANOTHER APPOINTMENT IN EARLY FEBRUARY AND THAT WAS THE SAME STORY.",
        "vin": "KM8J3CALXKU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/06/2021",
        "dateOfIncident": "03/17/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406698,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE IS RECALLED TO FIX MY ABS. HAVE CALLED THE HYUNDAI DEALER (WEISNER) TWICE (MARCH 17TH AND APRIL 6TH) TO ARRANGE APPOINTMENT TO REMEDY THE PROBLEM. THEY SAY ON EACH OCCASION, THEY ARE WAITING FOR PARTS TO BE DELIVERED. AM WAITING FOR THEIR CALL TO BRING IN MY VEHICLE.",
        "vin": "KM8J33A41KU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/05/2021",
        "dateOfIncident": "04/02/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406382,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK THE VEHICLE TO GET THE SUBJECT 195 ( 20V543000) RECALL PERFORMED. UPON ARRIVING TO HALL HYUNDAI IN NEWPORT NEWS, THEY INFORMED ME THAT PARTS WERE NOT AVAILABLE. I PREVIOUSLY ASKED THEM UPON MAKING THE APPOINTMENT IF THEY HAD PARTS IN STOCK. THEY ASSURED ME THEY DID.   PRIOR TO THIS, I ATTEMPTED TO HAVE THE RECALL PERFORMED AT PEARSON HYUNDAI IN RICHMOND, VA ON TWO SEPARATE OCCASIONS. I CALLED THE SERVICE DEPARTMENT A COUPLE WEEKS PRIOR TO THE APPOINTMENTS TO ENSURE THEY HAD PARTS, EACH TIME I WAS TOLD THEY DID. HOWEVER, UPON ARRIVING EACH TIME THE INFORMED ME THEY HAD NO PARTS. I WAS ALSO TOLD BY A PARTS WORKER THAT THE DEALERSHIP WAS PUTTING ANY NEW PARTS RECEIVED INTO THE VEHICLES ON THE LOT SO THEY CAN BE SOLD.   THIS VEHICLE REMAINS A SAFETY CONCERN SINCE MULTIPLE DEALERSHIPS DO NOT HAVE THE PARTS TO REPAIR.",
        "vin": "KM8J33ALXKU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/30/2021",
        "dateOfIncident": "03/30/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405585,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CALLED JENKINS HYUNDAI OF OCALA (1602 SW COLLEGE RD, OCALA, FL 34471) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J33A4XKU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/30/2021",
        "dateOfIncident": "09/30/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405645,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT LEASED A 2019 HYUNDAI TUCSON.  THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CALLED CLASSIC HYUNDAI (8460 TYLER BLVD, MENTOR, OH 44060;(440) 266-6777) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE CONTACT WAS ADDED TO THE WAITING LIST. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR.  THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.*DT",
        "vin": "KM8J3CAL4KU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/25/2021",
        "dateOfIncident": "11/10/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404862,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED SAFETY RECALL LETTER NHYSA 11/2020  RECALL NUMBER 20V-543 STATING MY CAR HAS FAULTY ANTI-LOCK BRAKE SYSTEM(\"ABS\")DEALER STATES THEY WILL INSTALL THE NECESSARY PARTS TO CORRECT DEFECT. TO DATE 3/24/21 HAVE NOT BEEN CONTACTED TO MAKE CORRECTION. I HAVE CONTACTED  THE DEALER ON THE FOLLOWING DATES: 11/10/20, 12/11/20, 1/11/21, 1/12/21, 3/25/21. I HAVE BEEN CONTINUALLY TOLD THE PART IS ON BACK ORDER. THE LETTER STATES THERE IS A RISK OF AN  ELECTRICAL SHORT RESULTING IN AN ENGINE COMPARTMENT FIRE. WHAT RECOURSE DO I HAVE TO REMEDY THIS PROBLEM AND SECURE MY SAFETY?",
        "vin": "KM8J23A42KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/25/2021",
        "dateOfIncident": "03/25/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404864,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CALLED HYUNDAI OF NEW PORT RICHEY (3936 US-19, NEW PORT RICHEY, FL 34652) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "KM8J23A42KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/24/2021",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404659,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. DELRAY HYUNDAI (541 NE 6TH AVE, DELRAY BEACH, FL 33483, (561) 265-0000) WAS CONTACTED AND CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT. *DT",
        "vin": "KM8J3CAL2KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/16/2021",
        "dateOfIncident": "03/16/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403349,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. BUTLER HYUNDAI (5000 CRATER LAKE AVE, MEDFORD, OR 97504) WAS CONTACTED AND CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J2CA43KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/12/2021",
        "dateOfIncident": "03/12/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402613,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT ATTEMPTED TO SCHEDULE A RECALL REPAIR SERVICE WITH GLOBAL HYUNDAI (1099 US-22, NORTH PLAINFIELD, NJ 07060) HOWEVER, THE DEALER CONFIRMED THAT THE CONTACT PARTS WERE NOT YET AVAILABLE. THE CONTACT WAS PLACED ON A WAITING LIST. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J2CA44KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/11/2021",
        "dateOfIncident": "09/04/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400352,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CALLED ATLANTIC HYUNDAI (193 SUNRISE HWY NORTH SERVICE RD, WEST ISLIP, NY 11795, (631) 587-0700) AND IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J3CAL2KU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/10/2021",
        "dateOfIncident": "01/14/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400136,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS SENT A RECALL NOTICE BY HYUNDAI AND I SCHEDULED THE SERVICE APPOINTMENT WITH A LOCAL DEALERSHIP AS DIRECTED. WHEN I SHOWED UP FOR MY APPOINTMENT I WAS TOLD THERE WAS \"NO FIX\" YET.",
        "vin": "KM8J2CA40KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/10/2021",
        "dateOfIncident": "09/12/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400187,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ADVISED ON 9/12/2020 THAT MY HYUNDAI TUSCON HAD A RECALL FOR ABS/ANTILOCK BRAKE MODULE, I CALLED MY LOCAL DEALER AND THEY SAID I WOULD BE NOTIFIED ONCE PARTS CAME IN. IN NOVEMBER I WAS CONTACTED BY HYUNDAI THAT I SHOULD KEEP MY VEHICLE PARKED OUTSIDE AWAY FROM BUILDINGS DUE TO RISK OF FIRE. I AGAIN CALLED DEALER AND PARTS WERE STILL ON ORDER. I PERSONALLY WENT TO DEALERSHIP IN JANUARY AND STILL NO PARTS AND WAS TOLD I AM ON WAIT LIST. I DO NOT FEEL SAFE DRIVING THIS VEHICLE AND I HAVE GIVEN MORE THEN ENOUGH TIME TO HAVE THIS FIXED. I WANT TO TERMINATE  MY LEASE SINCE I DO NOT WANT TO CONTINUE PAYING FOR A VEHICLE I DO NOT FEEL SAFE DRIVING.",
        "vin": "KM8J3CAL4KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/09/2021",
        "dateOfIncident": "09/04/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399879,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT SPOKE WITH CENTRAL AVENUE HYUNDAI (111 S CENTRAL AVE #1, HARTSDALE, NY 10530, (315) 816-3071) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT STATED THAT WHILE IN REVERSE AS THE FIRST INITIAL DRIVING FOR THE DAY, THE VEHICLE FAILED TO STOP WITHOUT PLACING EXTENSIVE PRESSURE ON THE BRAKE PEDAL. THE APPROXIMATE FAILURE MILEAGE WAS 25,000. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J2CA45KU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/09/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399984,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "HYUNDAI MOTOR AMERICA (HYUNDAI) IS RECALLING CERTAIN 2019-2021 TUCSON VEHICLES. THE ANTI-LOCK BRAKE HYDRAULIC ELECTRONIC CONTROL UNIT (HECU) COULD CORRODE INTERNALLY AND CAUSE AN ELECTRICAL SHORT, POSSIBLY RESULTING IN AN ENGINE COMPARTMENT FIRE    AN ENGINE COMPARTMENT FIRE CAN INCREASE THE RISK OF INJURY OR CRASH",
        "vin": "KM8J23A45KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/08/2021",
        "dateOfIncident": "03/05/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399762,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. COCONUT CREEK HYUNDAI (LOCATED AT 4960 N STATE RD 7, COCONUT CREEK, FL 33073, (888) 441-7737) WAS CONTACTED AND MADE AWARE OF THE ISSUE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J33A46KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/05/2021",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399320,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. TOWNE HYUNDAI (3170 NJ-10, DENVILLE, NJ 07834) AND LYNNES HYUNDAI (401 BLOOMFIELD AVE, BLOOMFIELD, NJ 07003) WERE BOTH CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.*DT*JB",
        "vin": "KM8J3CAL4KU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/04/2021",
        "dateOfIncident": "01/13/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399211,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I MADE AN APPOINTMENT WITH O'BRIEN HYUNDAU OF FORT MYERS, FL ON 1/13/2021 FOR NHTSA RECAL 20V-543 ABS-ANTILOCK BRAKE SYSTEM RECALL. WHEN I ARRIVED AT THE DEALER TO HAVE A NEW ABS SYSTEM PART INSTALLED, THEY SAID THEY DID NOT HAVE THAT PART IN STOCK. THEY SAID THEY WOULD NOTIFY ME WHEN IT WAS IN STOCK.  ON 3/1/2021, I CONTACTED THE DEALER(O\"BRIEN HYUNDIA OF FORT MYERS) BECAUSE I HAD NOT HESRD ANYTHING FROM THEM SINCE 1/13/2021. I ASKED THEM WHEN THE ABS PART WOULD BE IN FOR THE RECALL. AGAIN, THEY SAID THAT THEY DID NOT HAVE THE PART AND WOULD NOTIFY ME WHEN THEY HAD IT. I AM VERY CONCERNED THAT THIS RECALL CAN NOT BE FIXED BY THE DESLER, BECAUSE IT IS A SERIOUS PROBLEM AND CAN START A FIRE IN THE VEHICLE.",
        "vin": "KM8J23A49KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/01/2021",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398423,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CALLED JENKINS HYUNDAI OF OCALA (1602 SW COLLEGE RD, OCALA, FL 34471, (352) 815-2533) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER HAD NOT BEEN MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J33AL2KU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/01/2021",
        "dateOfIncident": "02/28/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398439,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FEBRUARY 25TH I TOOK MY TUCSON TO THE HYUNDAI DEALERSHIP FOR MY RECALL TO BE DONE AND EVERYTHING SEEMED TO BE FINE THAT DAY. SUNDAY FEBRUARY 28TH I STARTED MY CAR AND WENT TO RELEASE THE PARKING BRAKE AND MY EPS LIGHT WAS ON AND MY PARKING BRAKE WAS STUCK I COULD NOT GET IT TO COME OUT OF BEING ENGAGED AFTER MESSING WITH THE BUTTON FOR A WHILE AND TURNING MY CAR OFF AND BACK ON I WAS ABLE TO DISENGAGE AND THE EPS LIGHT FINALLY WENT OFF. LATER ON THAT DAY I WAS LEAVING WORK PUT MY CAR IN REVERSE AND MY BRAKE PEDAL WENT ALL THE WAY TO THE FLOOR NO BREAKS. I SLOWLY DROVE DOWN THE ROAD AND PARKED AT THE VEHICLE TURNED IT OFF RESTARTED IT AND I HAVE SOME BREAK NOW BUT THEY'RE SQUISHY SQUISHY. THERE IS ALSO A EXTREMELY LOUD GRIND TO THE BRAKES SINCE SUNDAY THE 28TH OF FEBRUARY",
        "vin": "KM8J33A47KU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/23/2021",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397479,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS ON RECALL, I CONTACTED HYUNDAI DEALERSHIPS FOR REPLACEMENT. THEY SAID IT MAY TAKE WEEKS OR A MONTH. I  WAITED FOR MORE THAN 5 MONTH. THEY JUST KEEP  TELLING ME THEY'RE OUT OF STOCK.",
        "vin": "KM8J2CA49KU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/19/2021",
        "dateOfIncident": "09/04/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396956,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. ROCKLAND HYUNDAI (55 NY-303, WEST NYACK, NY 10994, (855) 256-8524) WAS CONTACTED AND CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE CONTACT STATED WHILE DRIVING AT VARIOUS SPEEDS, THE BRAKES FAILED TO ENGAGE PROPERLY WHEN THE BRAKE PEDAL WAS DEPRESSED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 55,000. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J3CAL3KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/16/2021",
        "dateOfIncident": "12/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396419,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CALLED COUGHLIN HYUNDAI (2300 HEBRON RD, HEATH, OH 43056, (833) 340-1530) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "KM8J33AL0KU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/12/2021",
        "dateOfIncident": "09/23/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395902,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WENT TO THE DEALER, THE PART FOR REPAIR WAS NOT AVAILABLE, THEY SAID THEY WOULD CALL ME, THAT WAS 6 MONTHS AGO :(",
        "vin": "KM8J2CA47KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/11/2021",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395705,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CALLED CAPITAL HYUNDAI OF GREENSBORO (801 E BESSEMER AVE, GREENSBORO, NC 27405, (336) 275-9761) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "KM8J23A45KU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/11/2021",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395742,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "HYUNDAI IS NOT MAKING THE REPLACEMENT EASILY AVAILABLE. I HAVE MADE TWO APPOINTMENTS TO HAVE HE ISSUE FIXED AND HAVE BEEN TOLD THE PART IS NOT IN.",
        "vin": "KM8J3CALXKU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/11/2021",
        "dateOfIncident": "11/11/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395736,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. AN UNKNOWN DEALER WAS CONTACTED AND MADE AWARE OF THE ISSUE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J2CA4XKU"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/11/2021",
        "dateOfIncident": "02/11/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395767,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2019 TUCSON HAS BEEN GETTING HORRIBLE GAS MILEAGE AND ALSO MAKING SOME STRANGE NOISES THAT I'M UNSURE OF WHAT THEY ARE. IT'S ALSO ACTING LIKE IT HAS NO POWER INSTALLING ON A PRETTY REGULAR BASIS SINCE THE DEALERSHIP HAS STATED NOTHING'S WRONG WITH IT AND MY VEHICLE HEALTH REPORT CONTINUES TO STATE NOTHING IS WRONG I DECIDED TO GET A OBD2 ADAPTER TO PLACE ON IT SO I COULD SEE WHAT WAS HAPPENING. WHILE THE VEHICLE IS RUNNING AT IDLE DOESN'T MATTER IF IT IS COLD OR WARM THE THROTTLE BODY SENSOR DOES NOT GO UNDER A 10 SO IT'S OBVIOUSLY STICKING I DON'T KNOW IF IT IS DEFECTIVE OR IF IT'S BEEN LIKE THAT FOR SOME TIME BUT IF THE THROTTLE BODY IS STUCK THEN THAT'S GOING TO CAUSE IT TO STALL THAT'S GOING TO MAKE IT BURN MORE GAS THAT'S GOING TO MAKE IT RUN PRETTY CRAPPY AND BE KIND OF HIT AND MISS. THE VEHICLE'S BRAKES ARE ALWAYS GRINDING AND SQUEALING. THERE IS ALSO A WINE AND A TAPPING CLICKING SOUND COMING FROM UNDER THE HOOD I DON'T KNOW IF IT'S A BAD PULLEY OR BEARING OR A LOOSE HEAT SHIELD OR WHATEVER BUT IT'S NOT INJECTORS THERE'S SOMETHING UNDER IT. THE RPMS ARE CONTINUOUSLY GETTING STUCK THE GAUGES ARE GETTING STUCK, THIS CAR MALFUNCTIONS EVERY DAY.",
        "vin": "KM8J33A47KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/04/2021",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394703,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CALLED SEVERAL UNKNOWN DEALER AND IT WAS CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J3CAL1KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/02/2021",
        "dateOfIncident": "10/15/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394280,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DAUGHTER HAS BEEN TRYING TO GET THE RECALL FIXED FOR OVER 4 MONTHS.  GLENDALE CA HYUNDAI KEEPS CLAIMING THAT THEY DON'T HAVE ENOUGH PARTS TO DO THE RECALL. I CALLED HYUNDAI CUSTOMER SERVICE ABOUT THE LACK OF PARTS AND WAS TOLD THAT THEY COULDN'T HELP THE SITUATION.   WHEN I SPEAK TO THE SERVICE MANAGER, HE SAID THAT THEY HAVE HAD NO PARTS FOR THE REPAIR DELIVERED TO THEM. THE ADDRESS AND PHONE OF THE DEALERSHIP I AM WORKING WITH IS 411 S BRAND BLVD, GLENDALE, CA 91204  PHONE: (818) 243-4110.  ANY ASSISTANCE IS GETTING PARTS SO THE RECALL CAN BE SERVICED IS GREATLY APPRECIATED.",
        "vin": "KM8J3CA4XKU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/02/2021",
        "dateOfIncident": "09/04/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394310,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CALLED HYUNDAI OF NEW PORT RICHEY (3936 US-19, NEW PORT RICHEY, FL 34652; (727) 477-8644) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED AND INFORMED CONTACT TO PARK THE VEHICLE OUTSIDE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "KM8J33ALXKU"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/01/2021",
        "dateOfIncident": "12/12/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11391078,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON RECEIVING A SAFETY RECALL LETTER FOR THE ANTI-LOCK BRAKE SYSTEM ON MY 2019 HYUNDAI TUCSON, I CONTACTED TWO DIFFERENT DEALERSHIPS TO SCHEDULE AN APPOINTMENT TO COMPLETE THE REPAIR FOR THE RECALL. EACH DEALERSHIP TOLD ME THAT THE PARTS WERE NOT AVAILABLE AND NEED TO BE ORDERED AND THEY WOULD CONTACT ME WHEN THE PARTS WERE IN. I WAS CONTACTED BY ONE DEALERSHIP AND HAD AN APPOINTMENT SCHEDULED FOR MID DECEMBER 2020. UPON ARRIVING, THAT DEALERSHIP TOLD ME I DID NOT HAVE AN APPOINTMENT SCHEDULED EVEN THOUGH I RECEIVED AN EMAIL CONFIRMATION FOR THE APPOINTMENT FOR THE RECALL REPAIR. THEY TURNED ME AWAY AND TOLD ME THEY WOULD CONTACT ME WHEN THE PARTS WERE IN. IT'S BEEN ALMOST TWO MONTHS SINCE AND HAVE NOT HEARD FROM THE DEALERSHIP. I'VE CALLED BOTH DEALERSHIPS TO FOLLOW UP WITH THEM AND EACH DEALERSHIP INFORMED ME THAT THE PARTS HAD NOT BEEN RECEIVED YET AND THUS THEY COULD NOT PERFORM THE RECALL REPAIR. I DON'T BELIEVE THIS RECALL REPAIR IS BEING PERFORMED IN A TIMELY MANNER AND I FEEL LIKE MY CAR IS UNSAFE TO DRIVE.",
        "vin": "KM8J33AL6KU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/28/2021",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390479,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "HYUNDAI RECALL 195 POSSIBLE FIRE DUE TO CORROSION IN ABS SYSTEM WAS ISSUED OVER THREE MONTHS AGO. I'VE CALLED 3 DIFFERENT DEALERS AND AS OF YESTERDAY THEY STILL DO NOT HAVE THE PARTS TO FIX THE PROBLEM. IF THIS IS A TRULY SERIOUS PROBLEM AND I'M SUPPOSED TO PARK MY CARE OUTSIDE THEN WHY AREN'T THE REPLACEMENT PARTS AVAILABLE. THIS IS UNACCEPTABLE TO ME",
        "vin": "KM8J3CAL4KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/28/2021",
        "dateOfIncident": "09/24/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390499,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CALLED RON MARHOFER HYUNDAI OF GREEN (1260 MAIN ST, CUYAHOGA FALLS, OH 44221, (888)903-9766) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "KM8J33A46KU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/28/2021",
        "dateOfIncident": "10/31/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390527,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE AN ANTI-LOCK BRAKE SYSTEM RECALL NOTICE FROM OCT 2020 NTSA RECALL NUMBER 20V-543 AND HYUNDAI RECALL NUMBER 195.  I HAD AN APPOINTMENT WITH MY DEALER TO HAVE THE RECALL SERVICE PERFORMED NOV 12, 2020.  THEY CANCELLED THAT APPOINTMENT BECAUSE THE PART WAS NOT IN STOCK.  THEY SAID THEY WOULD CALL ME WHEN THE PART BECAME AVAILABLE AND NEVER DID.  I CALLED THEM TODAY 01/28/2021 TO CHECK AND THEY SAID THE PART IS STILL ON BACKORDER.  THREE MONTHS IS TOO LONG TO WAIT FOR RECALL SERVICE!!",
        "vin": "KM8J3CAL6KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/26/2021",
        "dateOfIncident": "11/02/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390036,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. GLOBAL AUTO MALL (1099 RT. 22 WEST, NORTH PLAINFIELD, NJ 07060) WAS CONTACTED ON SEVERAL OCCASIONS AND MULTIPLE APPOINTMENTS HAD BEEN MADE TO HAVE THE VEHICLE SERVICED HOWEVER, THE APPOINTMENTS WERE ALL CANCELLED AFTER THE CONTACT WAS INFORMED EACH TIME THAT PARTS WERE NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND OFFERED NO ASSISTANCE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J3CAL0KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/25/2021",
        "dateOfIncident": "09/02/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389750,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE.  THE CONTACT CALLED POHANKA HYUNDAI OF SALISBURY (2015 N SALISBURY BLVD, SALISBURY, MD 21801, (410) 749-6660) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT WAS PLACED ON A WAITING LIST. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "KM8J3CAL3KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/25/2021",
        "dateOfIncident": "11/30/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389887,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. HASELWOOD HYUNDAI (5008 AUTO CENTER BLVD, BREMERTON, WA 98312) AND THE MANUFACTURER WERE MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE FAILURE MILEAGE WAS 16,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.  *BF   THE CONSUMER STATED THE VEHICLE WAS REPAIRED.",
        "vin": "KM8J3CA48KU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/19/2021",
        "dateOfIncident": "12/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388902,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION REGARDING NHTSA CAMPAIGN NUMBER: 20V543000(SERVICE BRAKES) HOWEVER THE PARTS NEEDED TO REPAIR THE DEFECT WERE NOT YET AVAILABLE. THE LOCAL DEALER KING HYUNDAI LOCATED AT 1399 S FEDERAL HWY, DEERFIELD BEACH, FL AND MANUFACTURER WERE CONTACTED AND IT WAS CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE VEHICLE HAD NOT EXPERIENCED THE FAILURE LISTED IN THE RECALL. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "KM8J33AL9KU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/17/2021",
        "dateOfIncident": "06/03/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388607,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THIS CAR FROM MAXON AND AFTER COUPLE MONTH I GOT RECALL  LATTER FROM COMPANY AND I MADE APPOINTMENT WITH MAXON HYUNDAI THEY ALWAYS TOLD ME THEY DON'T HAVE (ABS) PART TO REPLACE IT",
        "vin": "KM8J3CALXKU"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/12/2021",
        "dateOfIncident": "08/03/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387679,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN TRYING TO TAKE CARE OF THIS OPEN AND DANGEROUS RECALL TO THE ABS BRAKING SYSTEM SINCE AUGUST 20, 2020.  I HAVE CONTACTED THE DEALERSHIP SEVERAL TIMES REGARDING THE PARTS FOR THIS RECALL AND HAVE BEEN TOLD THAT THEY ARE STILL ON BACK ORDER.  I JUST HEARD YESTERDAY THAT HYUNDAI IS RECOMMENDING TO PARK THE VEHICLE OUTSIDE DUE TO A POSSIBLE RISK OF THE CAR CATCHING FIRE.  THIS TO ME IS AN IMPORTANT RECALL THAT I HAVE BEEN TRYING TO FIX FOR THE LAST 5 MONTHS BUT HAVE NOT BEEN ABLE TO DUE TO THE PARTS NOT BEING AVAILABLE.  I HAVE CONTACTED THE HYUNDAI DEALER WHERE I PURCHASED THE VEHICLE TODAY AND THEY TOLD ME THEY DO NOT HAVE A TIME FRAME AS TO WHEN THE PARTS WOULD BE AVAILABLE OR WHEN THEY WOULD BE RECEIVING THEM.  THIS IS COMPLETELY UNACCEPTABLE AND HYUNDAI NEEDS TO BE HELD ACCOUNTABLE FOR NOT BEING ABLE TO HAVE THESE CRUCIAL PARTS FOR A BRAKING SYSTEM AVAILABLE FOR THE LAST 5 MONTHS FOR MYSELF AND FOR THE COUNTLESS OTHER COSTUMERS WHO ARE PROBABLY WAITING EVEN LONGER.  THEY DO NOT HAVE A PROBLEM SELLING/LEASING YOU A VEHICLE AND TAKING A PAYMENT EVERY MONTH AND IT SEEMS LIKE THEY DON'T VALUE A LIFE SINCE THEY COULD CAUSE A VEHICLE FIRE.  HYUNDAI NEEDS TO BE HELD ACCOUNTABLE FOR THIS AND SHOULD BE ASSESSED A FINE FOR EVERYDAY DAY OVER THE REQUIRED TIME BY LAW THAT THEY HAD TO FIX THE ISSUE.",
        "vin": "KM8J3CAL2KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/12/2021",
        "dateOfIncident": "11/10/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387690,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION ON NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED CENTRAL AVENUE HYUNDAI (111 S CENTRAL AVE #1, HARTSDALE, NY 10530, (315) 816-3071) AND WAS INFORMED THAT THE PART WAS NOT YET AVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J2CA49KU"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/11/2021",
        "dateOfIncident": "11/09/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387452,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED RECALL NOTICE 20V-543 REGARDING THE ANTI-LOCK BRAKE SYSTEM MODULES IN EARLY NOVEMBER. MADE AN APPOINTMENT TO HAVE THE CORRECTIVE MEASURES TAKEN AND WAS TOLD THE PARTS WERE NOT AVAILABLE. I HAVE BEEN WAITING FOR OVER 2 MONTHS AND EVERY TIME I CALL THE DEALERSHIP AND MANUFACTURER, I'M TOLD PARTS ARE ON ORDER. HYUNDAI IS RISKING THE LIVES OF MY FAMILY AND PROPERTY BY NOT CORRECTING THIS ISSUE IN A TIMELY MANNER. WHY AREN'T PARTS AVAILABLE AND WHEN CAN MAR VEHICLE BE REPAIRED AS STATED IN THE RECALL NOTICE? AGAIN, I HAVE SPOKEN WITH CONSUMER ADVOCATES IN HYUNDAI AND WITH THE LOCAL DEALERSHIP WITH NO RESULTS. CAN YOU HELP OR IS THIS ANOTHER EXAMPLE OF NO ONE CARING ABOUT FIXING THE PROBLEM.",
        "vin": "KM8J33AL2KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/08/2021",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387139,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS AVAILABLE. THE CONTACT CALLED BOB HOWARD HYUNDAI (613 W INTERSTATE 240 SERVICE RD, OKLAHOMA CITY, OK 73139; (405) 634-8900) WHERE IT WAS CONFIRMED THAT THE PART WAS AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.*DT*JB*DT*JB",
        "vin": "KM8J33AL0KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/08/2021",
        "dateOfIncident": "09/04/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387147,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. LESTER GLENN BUICK GMC (230 RTE 37 E, TOMS RIVER, NJ 08753, (732) 606-4182) WAS CONTACTED AND IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J3CA46KU"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/06/2021",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386859,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL 195 YET WE HAVE CONTACTED HYUNDAI CORPORATE AND 3 LOCAL DEALERSHIPS  AND NO ONE HAS THE PART TO REPAIR. THIS IS AN IMPORTANT SAFETY RECALL THAT WE CAN'T GET REPAIRED.",
        "vin": "KM8J3CAL6KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/05/2021",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386615,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. BUERKLE HYUNDAI (3350 HWY 61 N, ST PAUL, MN 55110) AND INVER GROVE HYUNDAI (1290 50TH ST E, INVER GROVE HEIGHTS, MN 55077) WERE CONTACTED AND CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND OFFERED NO ASSISTANCE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J3CAL1KU"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/04/2021",
        "dateOfIncident": "11/10/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386443,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS A SERIOUS RECALL AND I HAVE BEEN TRYING TO GET IT FIXED FOR 2 MONTHS AND HYUNDAI KEEPS TELLING ME THEY DON'T HAVE THE PARTS.  I FEEL 2 MONTHS IS TOO LONG NOT TO BE ABLE TO REPAIR MY CAR.",
        "vin": "KM8J33AL7KU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/31/2020",
        "dateOfIncident": "12/31/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385758,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECIEVED A RECALL ON MY 2019 HYUNDAI TUCSON BUT THE DEALERSHIP TELLS ME THEY ARE UNABLE TO GET THE PART TO FIX IT.",
        "vin": "KM8J3CA47KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/31/2020",
        "dateOfIncident": "09/04/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385769,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. SUPERIOR HYUNDAI NORTH (5665 DIXIE HWY, FAIRFIELD, OH 45014, (513) 870-9800) WAS CONTACTED AND CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J3CAL2KU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/28/2020",
        "dateOfIncident": "10/09/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385243,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "HYUNDAI ISSUED A RECALL OCTOBER 9, 2020 AND IS REFUSING TO PROVIDE PARTS TO THE DEALER.  WHEN I CALL HYUNDAI THEY TELL ME THEY HAVE NO INFORMATION ABOUT WHEN THE PART WILL BE AVAILABLE. RECALL 195",
        "vin": "KM8J3CAL1KU"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/26/2020",
        "dateOfIncident": "11/16/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385046,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED NOTICE OF RECALL CAMPAIGN 195 ON NOV 11TH AND IMMEDIATELY MADE AN APPOINTMENT WITH HYUNDAI DEALERSHIP FOR NOV 16TH. ON NOV 16TH AT 10:13AM,I RECEIVED A TEXT MESSAGE FROM THE SERVICE DEPARTMENT SAYING THE PART FOR RECALLWAS NOT IN AND I CANNOT GET THE SERVICE COMPLETE. I CALLED THE SERVICE DEPARTMENT IMMEDIATELY AND ASKED WHEN THE PART WOULD COME IN AND I WAS TOLD THAT THEY WERE NOT SURE. IT IS NOW DEC 26TH AND THE PART IS STILL NOT IN AND HYUNDAI CUSTOMER CARE OR THE DEALERSHIP DOES NOT KNOW WHEN. I HAVE HAD TO PARK MY CAR OUTSIDE OF MY GARAGE BECAUSE THE RECALL MAY CAUSE AN ENGINE COMPARTMENT FIRE.",
        "vin": "KM8J23A47KU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/22/2020",
        "dateOfIncident": "11/12/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384522,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONTACT STATED HIS VEHICLE IS NOT SAFE TO BE DRIVING .THE CONTACT STATED HE IS AFRAID THAT IT MAY CATCH FIRE.THE DEALER HAS BEEN CONTACT ABOUT THE SITUATION.",
        "vin": "KM8J33AL7KU"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/19/2020",
        "dateOfIncident": "12/19/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384171,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "HYUNDAI IS REFUSING TO FIX NHTSA RECALL# 20V543000 CLAIMING THERE IS AN UNAVAILABILITY OF PARTS.  THIS RECALL, LEFT UNFIXED, PRESENTS A FIRE HAZARD. I CALLED HYUNDAI CUSTOMER CARE ON 12/19/2020 AND WAS INFORMED THEY \"DID NOT KNOW WHEN THE PARTS WOULD BE AVAILABLE\".",
        "vin": "KM8J33ALXKU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/18/2020",
        "dateOfIncident": "11/14/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384048,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL NOTICE RECEIVED ON 11/12/20, I CALLED FOR AN APPOINTMENT ON 11/14/20 AND THEY SAID THAT THEY WILL CALL ME WHEN PARTS ARE AVAILABLE. NO CALL RECEIVED, SO I CALLED BACK ON 12/18/20 AFTER OVER A MONTH AND THEY SAID THEY WILL CALL BE BACK WHEN PARTS ARE IN WITHIN 2 TO 3 WEEKS.",
        "vin": "KM8J33AL6KU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/16/2020",
        "dateOfIncident": "12/14/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383637,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE IS SUBJECT TO NHTSA RECALL #20V-543.  LOCAL DEALERS ARE UNABLE TO GET THE PARTS TO CARRY OUT THE REQUIRED REPAIRS.  THIS IS A FIRE HAZARD AND SHOULD BE QUICKLY REPAIRED.  WAITING ABOUT A MONTH SO FAR FOR PARTS.  PLEASE REQUIRE HYUNDAI TO CARRY OUT NEED REPAIR IN A TIMELY MANNER.",
        "vin": "KM8J3CAL8KU"
    },
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "12/15/2020",
        "dateOfIncident": "10/17/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11382700,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 HYUNDAI TUSCON. CONSUMER WRITES IN REGARDS TO ANTI-LOCK BRAKE SYSTEM SAFETY RECALL. *LD    THE CONSUMER STATED THE PARTS WERE NOT AVAILABLE TO COMPLETE THE RECALL REPAIR. *JS",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/11/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383001,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC). THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED RICK CASE HYUNDAI (3180 SATELLITE BLVD, DULUTH, GA 30096, (678) 321-1584) AND WAS INFORMED THAT THE REMEDY PARTS WERE NOT YET AVAILABLE. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. PARTS DISTRIBUTION DISCONNECT.*DT*JB",
        "vin": "KM8J33A46KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/10/2020",
        "dateOfIncident": "10/15/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11382898,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. JENKINS HYUNDAI OF OCALA (1602 SW COLLEGE RD, OCALA, FL 34471) WAS CONTACTED ON SEVERAL OCCASIONS AND EACH TIME THEY CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND OFFERED NO ASSISTANCE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J23A49KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/08/2020",
        "dateOfIncident": "10/17/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378417,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE VEHICLE WAS TAKEN TO JOE HOLLAND CHEVROLET (210 MACCORKLE AVE SW, SOUTH CHARLESTON, WV 25303) AND WAS REJECTED TO BE SERVICED DUE TO PARTS NOT BEING AVAILABLE.  THE CONTACT STATED THAT THE ABS WARNING LIGHT WAS ILLUMINATED AND SHE WAS CONCERNED FOR HER SAFETY. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 37,000. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J2CA40KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/08/2020",
        "dateOfIncident": "11/17/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378516,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CALLED UNIVERSAL HYUNDAI (12801 S. ORANGE BLOSSOM TRAIL, ORLANDO, FL 32837; (321) 418-3733) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J33AL7KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/08/2020",
        "dateOfIncident": "11/16/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378557,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CALLED DUELL'S EVANSVILLE HYUNDAI (4400 E. DIVISION ST, EVANSVILLE, IN 47715; (812) 473-4400) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J23A48KU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/07/2020",
        "dateOfIncident": "12/03/2020",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378269,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT STATED THAT WHILE DRIVING AT 50 MPH, THE CONTACT NOTICED SMOKE COMING FROM UNDER THE HOOD. THE VEHICLE STALLED WITHOUT WARNING. THE CONTACT STATED THAT THE VEHICLE WAS TOWED TO HER RESIDENCE BY HER INSURANCE. THE VEHICLE WAS LATER TAKEN TO HYUNDAI OF ST. AUGUSTINE, 2898 U.S. 1, ST. AUGUSTINE, FL 32086, WHERE THE CONTACT WAS INFORMED THAT THE RECALL NOTIFICATION RECEIVED WAS NOT RELATED TO FAILURE THE VEHICLE EXPERIENCING OF THE SMOKE. THE DEALER ALSO INFORMED THE CONTACT THAT THEY HAD TEST DRIVING THE VEHICLE AND WAS UNABLE TO DUPLICATE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) ABS UNIT MAY CAUSE ENGINE COMPARTMENT FIRE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 29,933.",
        "vin": "KM8J33AL6KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/07/2020",
        "dateOfIncident": "12/07/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378276,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC). THE CONTACT STATED THAT KING HYUNDAI (1399 S. FEDERAL HWY, DEERFIELD BEACH, FL 33441) INFORMED HIM THAT PARTS WERE NOT YET AVAILABLE FOR THE RECALL REPAIR. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE AND A CASE WAS FILED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J23A47KU"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/07/2020",
        "dateOfIncident": "11/30/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378296,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS NEEDED FOR A RECALL. ACCORDING TO THE MAIL THAT WAS SENT OUT FROM HYUNDAI MOTOR AMERICA, IT IS A VERY SERIOUS RECALL. I CALLED MY LOCAL HYUNDAI DEALER THE DAY I RECEIVED THE MAIL, WHICH WAS 11/30/2020. I WAS TOLD THAT THEY WOULD CALL ME BACK TO SCHEDULE AN APPOINTMENT ONCE THE PART IS IN. PER LETTER IN MAIL-\"OWNERS SHOULD PARK THEIR VEHICLE OUTSDE UNTIL THE RECALL REPAIR IS COMPLETED\" I CALLED MY DEALERSHIP AGAIN TODAY, 12/7/2020 AND WAS TOLD THAT THERE IS NO STATUS ON THE ABS MODULES.....NOTHING FURTHER TO ENSURE ME THEY ARE DOING EVERYTHING THEY CAN TO GET THIS RESOLVED, QUICKLY. IT IS NOT PRACTICAL FOR ME TO PARK MY CAR FOR DAYS/WEEKS WAITING FOR A RECALL. I HAD A VERY BAD EXPERIENCE WITH A PREVIOUS CAR I OWNED AND RECALLS AND DEEPLY DO NOT APPRECIATE THE LAZY, UNINTERESTED, 'NOT-MY-PROBLEM', NONCHALANT ATTITUDE WHEN IT COMES TO MY FAMILY AND I'S SAFETY. THESE PARTS NEED TO GET SHIPPED OUT ASAP AND THE DEALERSHIPS NEED SOME SORT OF TIMEFRAME TO TELL THEIR CUSTOMERS.",
        "vin": "KM8J23A4XKU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/07/2020",
        "dateOfIncident": "11/11/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378304,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. SCHIMMER HYUNDAI (911 SHOOTING PARK RD, PERU, IL 61354, (815) 224-4500) WAS CONTACTED AND IT WAS CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J33AL4KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/07/2020",
        "dateOfIncident": "12/07/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378399,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN CONTACTING MULTIPLE DEALERSHIPS IN MY STATE TO FIX THE RECALL BUT THEY ALL KEEP REPORTING THAT THE PARTS ARE ON 'NATIONAL BACK STOCK'. I HAVE NOTICED SOME SIGNS RECENTLY, POSSIBLY DUE TO THE RECALL, SUCH AS A BRIEF 'YANKING' NOISE WHEN FIRST STARTING THE CAR AND ALSO A BRIEF NOISE COMING FROM MY GLOVE DEPARTMENT WHENEVER I TURN CLIMATE ON. REGARDLESS, IF SOMETHING HAPPENS TO ME, OTHER DRIVES, OR MY CAR THEN I WILL BE REIMBURSED. I SHOULD HAVE A RENTAL TO DRIVE. THIS IS TOO DANGEROUS. THE RECALL STATES THAT THE ENGINE WILL CATCH FIRE FOR GOODNESS SAKES.",
        "vin": "KM8J2CA40KU"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/06/2020",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378171,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON HIGHWAYS OR INTERSTATES WITH THE ADAPTIVE CRUISE CONTROL IS WHEN THIS HAPPENS. THE FIRST TIME I WAS DRIVING ON A SWEEPING LEFT TURN AND COMING UP FAST ON A TRUCK IN THE SLOW LANE I WAS DRIVING IN, SO I PUT ON MY BLINKER AND MADE A QUICK LANE CHANGE INTO THE FAST LANE TO GET IN FRONT OF ANOTHER CAR IN THE FAST LANE BEHIND ME. IMMEDIATELY AS I WAS GETTING CLOSER TO THE TRUCK TO PASS IT  - SUDDENLY MY CAR PUT ON ITS BRAKES TO AVOID A COLLISION WITH THE TRUCK SINCE THE SYSTEM WAS SENSING THE TRUCK WAS IN MY PATH ON THE SWEEPING LEFT TURN. FORTUNATELY THE CAR BEHIND ME IN THE FAST LANE WITH ME DID NOT REAR END ME. THIS IS JUST ONE OF MANY TIMES MY CAR MISTAKES OTHER CARS AS A DANGER AND WILL BRAKE. IF I PULL IN BEHIND A CAR THAT JUST PASSED ME - BRAKE! IF A CAR IS TURNING RIGHT AND SLOWS DOWN AT THE INTERSECTION AND IS MAKING  THE TURN - EVEN THOUGH I WOULD  NEVER HIT IT -BRAKE! THIS IS SUPPOSED TO BE A SAFETY ITEM - BUT SO FAR JUST IS SO OVERCAUTIOUS I AM SURPRISED I HAVE NOT BEEN REAR ENDED SO FAR.  I DO NOT USE THE CRUISE CONTROL AS MUCH AS I DID WHEN I FIRST GOT THE CAR. I TURN IT OFF NOW TO AVOID SITUATIONS THAT CAUSE THE INADVERTENT BRAKING.",
        "vin": "KM8J3CAL5KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/04/2020",
        "dateOfIncident": "10/26/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377862,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CALLED LINWOOD HYUNDAI (3345 PARK AVE PADUCAH, KY 42001; 270-444-6901) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J3CALXKU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/03/2020",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377743,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT'S DAUGHTER OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CALLED SANSONE HYUNDAI (90-100 US-1, AVENEL, NJ 07001; (888) 566-5311) AND HYUNDAI OF SOUTH BRUNSWICK (3905 US-1, MONMOUTH JUNCTION, NJ 08852; (888) 622-0707) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER HAD NOT BEEN MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J3CA43KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/02/2020",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377468,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT LEASED A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. GARVEY HYUNDAI NORTH (271 TOM MILLER RD, PLATTSBURGH, NY 12901) WAS CONTACTED AND IT WAS CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND OFFERED NO ASSISTANCE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J3CA49KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/02/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377493,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT STATED THAT SEVERAL WARNING LIGHTS WERE ILLUMINATED ON THE INSTRUMENT PANEL WHILE DRIVING AT VARIOUS SPEEDS. THE CONTACT HAD TAKEN THE VEHICLE TO ARAPAHOE HYUNDAI (9899 E ARAPAHOE RD, CENTENNIAL, CO 80112) ON THREE SEPARATE OCCASIONS HOWEVER, THE MECHANIC HAD NOT DIAGNOSED OR DUPLICATED THE FAILURE. THE CONTACT THEN RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS APPROXIMATELY 12,000. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J2CA42KU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/02/2020",
        "dateOfIncident": "12/02/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377534,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I CALLED 3 DEALERSHIPS TO REMEDY THIS RECALL, AND THEY ALL TOLD ME THAT THE SPECIFIC PART FOR THE RECALL WAS BACKORDERED AND THEY NO IDEA WHEN IT WILL BE IN OR WHEN THEY WILL BE ABLE TO FIX THE ISSUE. MY CONCERN IS I HAVE LITTLE CHILDREN WHO ARE IN THIS VEHICLE EVERYDAY AND THIS SUPPOSED PROBLEM CAN CAUSE MY ENGINE TO CATCH ON FIRE. IM ASSUMING THIS IS A HYUNDAI PROBLEM, AS ACCORDING TO THESE DEALERS THEY JUST HAVE NOT BEEN SENT THE KITS TO FIX THE VEHICLES. VERY CONCERNING TO SAY THE LEAST.",
        "vin": "KM8J3CAL5KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/01/2020",
        "dateOfIncident": "11/09/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377287,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED HYUNDAI OF CENTRAL FLORIDA (17325 FL-50, CLERMONT, FL 34711, (352) 309-0695) WHO STATED THAT THE REMEDY PARTS WERE NOT YET AVAILABLE. ADDITIONALLY, THE CONTACT WAS ADDED TO A WAITING LIST. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE MANUFACTURER WAS CONTACTED HOWEVER, NO FURTHER ASSISTANCE WAS PROVIDED. THE CONTACT WAS CONCERNED ABOUT STORAGE AND A POTENTIAL FIRE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J33A47KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/30/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377034,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. FUCCILLO HYUNDAI OF GRAND ISLAND LOCATED AT 1910 ALVIN RD, GRAND ISLAND, NY 14072, WAS CONTACTED AND CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.*DT*JB",
        "vin": "KM8J3CAL8KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/30/2020",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377160,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. FREEHOLD HYUNDAI (4065 U.S. 9, FREEHOLD TOWNSHIP, NJ 07728) WAS CONTACTED AND IT WAS CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE CONTACT THEN TOOK THE VEHICLE TO CIRCLE AUTO (641 SHREWSBURY AVE, SHREWSBURY, NJ 07702) WHERE THE VEHICLE WAS INSPECTED. THE MECHANIC CONFIRMED THAT THE FUSE KIT NEEDED TO BE REPLACED HOWEVER, PARTS WERE NOT YET AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND OFFERED NO ASSISTANCE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J3CA44KU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/30/2020",
        "dateOfIncident": "11/30/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377196,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A NOTICE FOR RECALL ON MY VEHICLE THAT INDICATED I MUST BRING MY CAR IN TO HAVE A REPAIR AS SOON AS POSSIBLE, AND TO PARK MY CAR UNTIL THEN. I SCHEDULED WITH MY LOCAL HYUNDAI DEALER, AND THEY CALLED DAY OF APPOINTMENT TO TELL ME THE PART WAS NOT IN STOCK. THEY DID NOT OFFER APOLOGY OR RESCHEDULE MY APPOINTMENT, INSTEAD CANCELLING MY APPOINTMENT WITHOUT FOLLOW UP. I WAS NOT OFFERED A REPLACEMENT VEHICLE DESPITE THE FACT THAT I AM NOT SUPPOSED TO DRIVE MY VEHICLE UNTIL THE ISSUE IS REPAIRED.",
        "vin": "KM8J23A44KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/30/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377220,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. ADVANTAGE HYUNDAI (440 PLAINVIEW RD, HICKSVILLE, NY 11801) AND STAR HYUNDAI (201-16 NORTHERN BLVD, QUEENS, NY 11361) WERE CONTACTED BY PHONE AND CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J3CALXKU"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/25/2020",
        "dateOfIncident": "11/06/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376320,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A LETTER FROM HYUNDAI REGARDING A RECALL FOR THE ANTI-LOCK BRAKE SYSTEM ON HYUNDAI TUCSON. I ATTEMPTED TO SCHEDULE AN APPOINTMENT BUT THE ONLY APPOINTMENT AVAILABLE WAS MORE THAN A MONTH LATER. I ACCEPTED THAT APPOINTMENT BECAUSE I HAD NO CHOICE. NOW, THE DEALER HAS CALLED ME TO SAY THEY DON'T HAVE THE PART TO FIX THE PROBLEM. APPARENTLY THIS RECALL IS A BIG ISSUE AND COULD CAUSE ENGINE FIRE IF NOT FIXED. PLUS, THE LETTER SAYS THAT I SHOULD KEEP MY VEHICLE PARKED OUTSIDE UNTIL THE REPAIR IS COMPLETED WHICH LEADS ME TO BELIEVE THAT THIS THING COULD CATCH FIRE EVEN WITH THE CAR OFF! I AM NOT ABLE TO KEEP THE VEHICLE OUTSIDE ALL THE TIME AND THIS IS A BIG HARDSHIP. I AM AFRAID TO DRIVE THE VEHICLE AND I AM AFRAID TO STORE IT AND STEW HANSEN HYUNDAI, THE DEALER IS FAILING TO REMEDY THIS IN A TIMELY MANNER.",
        "vin": "KM8J3CA4XKU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/23/2020",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375934,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. COASTAL HYUNDAI (95 W. NEW HAVEN AVENUE, MELBOURNE, FL, 32901, (321) 723-4500) WAS CONTACTED AND IT WAS CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. PARTS DISTRIBUTION DISCONNECTS.",
        "vin": "KM8J33A4XKU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/19/2020",
        "dateOfIncident": "11/19/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375415,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE CALLED MY LOCAL HYUNDAI DEALER REGARDING A RECENT RECALL NOTICE I RECEIVED IN THE MAIL. I MADE AN APPOINTMENT TO GET THE REQUIRE REPAIR AND THE DAY BEFORE THE APPOINTMENT, THEY TOLD ME THEY DO NOT HAVE THE NECESSARY PARTS TO COMPLETE THE REPAIR. I AM VERY FRUSTRATED AS THEY HAVE HAD OVER 3 WEEKS TO ORDER THE PARTS AND WAITED TO TELL ME THE DAY BEFORE I AM SCHEDULED TO BRING MY CAR IN. TERRIBLE SERVICE!!",
        "vin": "KM8J23A42KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/18/2020",
        "dateOfIncident": "09/04/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375194,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE VEHICLE WAS TAKEN TO PRESTON HYUNDAI (4327 PRESTON RD, HURLOCK, MD 21643; (410) 673-7171) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "KM8J3CA43KU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/18/2020",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375282,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT STATED WHILE ENTERING THE VEHICLE, SHE NOTICED THAT THE FLOORS WERE HUMID AND COULD SMELL AN ODOR INSIDE THE CABIN OF THE VEHICLE. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER - RIVERHEAD HYUNDAI (1800 OLD COUNTRY RD #3115, RIVERHEAD, NY 11901, (631) 369-0600) TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE AIR CONDITIONING DRAIN HOSE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED HOWEVER, THE FAILURE PERSISTED. THE MANUFACTURER WAS NOT INFORMED OF FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 18,152.",
        "vin": "KM8J2CA40KU"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/17/2020",
        "dateOfIncident": "11/10/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375054,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 11/10/20, I RECEIVED NOTIFICATION THAT MY 2019 HYUNDAI TUSCON WAS PART OF A RECALL REGARDING ANTI-LOCK BRAKE HYRDAULIC ELECTRONIC CONTROL UNIT COULD CAUSE AN ELECTRICAL SHORT RESULTING IN AN ENGINE COMPARTMENT FIRE.I IMMEDIATELY CONTACTED MY LOCAL DEALERSHIPS AS INSTRUCTED ON THE RECALL LETTER AND WAS INFORMED THAT NONE OF THE DEALERSHIPS NATIONWIDE ACTUALLY HAVE THE PARTS IN ORDER TO FIX THIS RECALL! I CONFIRMED THIS BY CONTACTING ALL OF THE DEALERSHIPS WITHIN A 50MILE RADIUS OF ME. IT IS COMPLETELY IRRESPONSIBLE FOR HYUNDAI TO ISSUE THIS RECALL AND YET BE UNABLE TO FIX THIS PROBLEM THAT IS POTENTIALLY DEADLY! ALSO, COME TO FIND OUT, THE RECALL ISSUE DATE WAS ACTUALLY IN SEPTEMBER 2020 YET I ONLY FOUND OUT VIA LETTER IN NOVEMBER!!!! I CONTACTED HYUNDAI CUSTOMER SERVICE IN HOPES TO GET MORE ANSWERS ON THIS AND ALSO IF I WOULD BE ABLE TO GET A LOANER VEHICLE SO THAT I CAN GET TO WORK WHILE WAITING FOR AN UNKNOWN AMOUNT OF TIME BEFORE I AM ABLE TO GET MY VEHICLE REPAIRED. THIS RECALL HAS CAUSED EXTREME ANXIETY AND FEAR THAT MY SUV IS GOING TO SPONTANEOUSLY CATCH ON FIRE AT ANY TIME WITHOUT WARNING, EVEN WHILE PARKED IN MY DRIVEWAY!! THE DEALERSHIPS ALSO ADVISED ME TO PARK MY CAR FAR AWAY FROM MY BUILDING WHICH ONLY MADE MY WORRY EVEN WORSE! I HAVE YET TO ACTUALLY HEAR BACK FROM HYUNDAI CUSTOMER SERVICE AND WAS GIVEN A SPECIFIC TIME AND DAY THAT I WOULD BE RECEIVING A CALL HOWEVER DID NOT RECEIVE A CALL. COMPLETELY DISAPPOINTED AND FRUSTRATED THAT I JUST PURCHASED THIS CAR LAST YEAR AND ALREADY WANT TO GET RID OF IT BECAUSE I DO NOT TRUST HYUNDAI ONE BIT NOW!",
        "vin": "KM8J2CA46KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/16/2020",
        "dateOfIncident": "11/13/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374872,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. CENTRAL AVENUE HYUNDAI (111 S CENTRAL AVE #1, HARTSDALE, NY 10530,  (315) 816-3071) WAS CONTACTED BY PHONE AND IT WAS CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "KM8J3CAL3KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/13/2020",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374568,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER 20V543000(SERVICE BRAKES) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. HYUNDAI OF MANKATO LOCATED AT 1281 RAINTREE RD, MANKATO, MN 56001 WAS CONTACTED AND IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J3CAL6KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/12/2020",
        "dateOfIncident": "11/12/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374252,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. SUPERIOR HYUNDAI NORTH (5665 DIXIE HWY, FAIRFIELD, OH 45014) WAS CONTACTED AND CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "KM8J23A41KU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/12/2020",
        "dateOfIncident": "11/12/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374279,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM TRYING TO PLACE A COMPLAINT . I RECEIVED A IMPORTANT SAFETY RECALL FOR MY ANTI-LOCK BRAKE SYSTEM. I CALLED MY LOCAL HYUNDAI DEALER AND WAS INFORMED THAT EVEN THOUGH THERE IS A REMEDY THE PARTS ARE NOT AVAILABLE TO BE ORDERED AT THIS TIME AND THEY DO NOT EXPECT THE PARTS TO BE AVAILABLE UNDER MAYBE SPRING 2021. I FIND THIS UNACCEPTABLE. PLEASE LET ME KNOW WHAT I CAN DO.",
        "vin": "KM8J2CA4XKU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/12/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374377,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT STATED THAT SEVERAL WARNING LIGHTS WERE INTERMITTENTLY ILLUMINATED UPON STARTING THE VEHICLE. THE CONTACT ALSO STATED THE AFTER COMING TO A COMPLETE STOP, THE RPM'S INDEPENDENTLY REVVED UP WHILE THE VEHICLE SHOOK WITHOUT WARNING. THE CONTACT THEN RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC). THE DEALER WAS NOT NOTIFIED OF THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS APPROXIMATELY 35,000. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J23A4XKU"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/12/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374386,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT STATED THAT WHILE DRIVING AT AN UNDISCLOSED SPEED, AN UNKNOWN WARNING LIGHT DISPLAYED ON THE INSTRUMENT PANEL. THE CONTACT TOOK THE VEHICLE TO KEARNY MESA HYUNDAI (4797 CONVOY ST, SAN DIEGO, CA 92111) WHERE HE WAS INFORMED THAT THERE WERE NO DEFECTS WITH THE VEHICLE. THE CONTACT THEN RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC). THE SAME DEALER WAS CONTACTED BY PHONE AND THE CONTACT WAS INFORMED THAT PARTS WERE NOT YET AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS 5,000. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J23A43KU"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/11/2020",
        "dateOfIncident": "11/02/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374138,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A HYUNDAI TUCSON LAST MAY 2019 THINKING THAT I WAS INVESTING ON SAFETY BUT I WAS COMPLETELY WRONG. I'M NOW HAVING RECALL AFTER RECALL AND NO FINAL SOLUTION.  I'VE BEEN EXPERIENCING A HOT AIR BY THE DRIVER SIT FOR A FEW DAYS NOW. AT FIRST I DIDN'T THINK IT WAS SOMETHING POTENTIALLY HARMFUL AND THOUGHT I COULD CHECK ON MY NEXT OIL CHANGE VISIT (SINCE IT IS CLOSE TO HAPPEN), BUT SHORTLY AFTER I RECEIVED ANOTHER RECALL REGARDING ABS (#195). MY FIRST ACTION WAS TO GET IT CHECKED ASAP SINCE I USE MY CAR GET TO WORK AND I CARRY MY CHILD CONSTANTLY.  THIS IS A HUGE CONCERN FOR ME, I DON'T WANT TO EXPERIENCE THE PROBLEM IN ORDER TO GET HELP.   I'VE CALLED ALL THE DEALERSHIPS AROUND MY AREA AND FURTHER TO SCHEDULE THE SERVICE BUT NO ONE EVEN HAVE THE PIECES TO DO THE SERVICE AND IT WILL TAKE WEEKS FOR THEM TO RECEIVE IT. I CAN'T TAKE THIS ANY LONGER I NEED A SOLUTION. I'M SCARED TO DRIVE (ESPECIALLY WITH MY CHILD) AND SOMETHING BAD HAPPEN LIKE I'VE SEEN ONLINE AND LIKE FRIENDS WITH HYUNDAI WENT THROUGH.    I WOULD LIKE HYUNDAI TO CONTACT ME ASAP TO DISCUSS A SOLUTION. I DON'T TRUST THE VEHICLE AND I FEAR FOR ME AND MY FAMILY!",
        "vin": "KM8J33AL6KU"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/10/2020",
        "dateOfIncident": "11/10/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373932,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CALL TWO DIFFERENT DEALER REQUEST AN APPOINTMENT TO FIX THE ISSUE, BOTH PLACES TOLD ME THAT THE PART IS IN BACK ORDER BETWEEN 6 AND 7 WEEKS.   THIS RECALL STATES THAT THE ANTI-LOCK BRAKE SYSTEM MODULES THE COULD CORRODE INTERNALLY AND CAUSE AN ELECTRICAL SHORT OVERTIME AND COULD INCREASE THE RISK OF AN ENGINE COMPARTMENT FIRE",
        "vin": "KM8J3CAL5KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/10/2020",
        "dateOfIncident": "11/09/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374005,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CALLED TO STAR HYUNDAI (200 S CLACK ST, ABILENE, TX 79605, (325) 698-2222) WHERE IT WAS CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J33A46KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/10/2020",
        "dateOfIncident": "10/10/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374015,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. AN UNKNOWN DEALER WAS CONTACTED AND CONFIRMED PARTS WERE NOT YET AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J3CALXKU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/10/2020",
        "dateOfIncident": "11/10/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374019,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. JONES BEL AIR HYUNDAI (1504 BELAIR RD, BEL AIR, MD 21014,  (410) 879-6400), HERITAGE HYUNDAI TOWSON (801 YORK RD, TOWSON, MD 21204, (877) 387-5495), AND THOMPSON HYUNDAI (1000 MERRITT BLVD, DUNDALK, MD 21222, (410) 288-5700) WERE CONTACTED AND CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J33A46KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/10/2020",
        "dateOfIncident": "11/10/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374038,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED CHAPMAN HYUNDAI PHOENIX (999 W BELL RD, PHOENIX, AZ 85023, (602) 344-6930) AND WAS INFORMED THAT PARTS WERE NOT YET AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE MANUFACTURER WAS CONTACTED HOWEVER, NO FURTHER ASSISTANCE WAS PROVIDED. THE DEALER DECLINED TO PLACE THE CONTACT ON A WAITING LIST FOR PARTS. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "KM8J23A45KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/09/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373876,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC). THE VEHICLE WAS TAKEN TO RUSSELL WESTBROOK HYUNDAI OF GARDEN GROVE (9898 TRASK AVE, GARDEN GROVE, CA 92844) FOR A SCHEDULED REPAIR HOWEVER, THE PART WAS NOT AVAILABLE. THE VEHICLE WAS LEFT IN THE POSSESSION OF THE DEALER. THE FOLLOWING DAY THE CONTACT WAS INFORMED THAT THE REPLACEMENT PART WOULD BE ORDERED TO COMPLETE THE RECALL REPAIR. THE CONTACT CALLED BACK A MONTH LATER AND PARTS WERE STILL NOT AVAILABLE. THE CONTACT CALLED HYUNDAI OF LA QUINTA (79025 CA-111, LA QUINTA, CA 92253) AND IT WAS CONFIRMED THAT PARTS WERE STILL NOT AVAILABLE. THE CONTACT WAS ALSO INFORMED THAT THE PART MIGHT NOT BE AVAILABLE UNTIL 2021. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT. *BF  THE CONSUMER STATED THE BRAKES WERE REPAIRED.",
        "vin": "KM8J33AL8KU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/05/2020",
        "dateOfIncident": "10/15/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373166,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE MOTOR STARTED TAPPING IT A BRAND NEW CAR AND IVE GOT MY OIL CHANGED 2 OR 3 TIMES SINCE IVE HAD IT SO THERE'S NO REASON WHY IT SHOULD HAVE WENT OUT , THERE IS A RECALL ON THE CAR I HACE WHICH IS A 2019 TUCSON .",
        "vin": "KM8J23A48KU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/02/2020",
        "dateOfIncident": "11/02/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372621,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL #195 ABS FUSE KIT INSTALL & SOFTWARE UPDATE.  BROUGHT MY CAR IN ON OCT. 16, 2020 FOR MAINTENANCE AND RECALL REPAIR. PARTS WERE NOT AVAILABLE FOR RECALL REPAIR. CALLED 2 WEEKS LATER AND WAS TOLD I'D BE PUT ON A LIST.",
        "vin": "KM8J33A42KU"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/02/2020",
        "dateOfIncident": "10/18/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372744,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON A ROAD TRIP WHILE HIGHWAY DRIVING MY 2019 CPO HYUNDAI TUCSON/10800 MILES, THE CAR DID THIS BIG JOLT AND THE FORWARD VEHICLE COLLISION DETECTION AVOIDANCE, HAZARD INDICATOR & SERVICE NOW LIGHTS WENT OFF. THE ENGINE RPM'S REVVED UP VERY HIGH CONTINUOUSLY. WHEN I CAME TO A STOP THE CAR WOULD BARELY GO WITH THE PEDAL ALMOST FLOORED. THIS MADE THE DRIVING THRU THE INTERSECTIONS WITH CARS HONKING DANGEROUS. WHEN I TURNED THE CAR OFF, IT RESET ITSELF AND WAS BACK TO NORMAL. THE VERY NEXT DAY ON THE HIGHWAY, THE CAR DID THE EXACT SAME THING WITH EVEN A BIGGER JOLT AND ALL THE INDICATORS ABOVE WENT ON AGAIN FOR 10 SECONDS. PULLED OVER, TURNED THE ENGINE OFF AND THE CAR RESET ITSELF. I GOT TO MY DESTINATION I TOOK IT TO KEYES HYUNDAI IN VAN NUYS, CA. THEY DECIDED THAT THE TRANSMISSION COMPUTER NEEDED REPLACING AND DID IT. AFTER PICKING IT UP, THE VERY NEXT DAY THE BIG JOLT HAPPENED AGAIN ALSO WHILE DRIVING ON THE FREEWAY. THIS TIME THE SIDE MIRROR AVOIDANCE SYSTEM, HAZARD LIGHTS AND SERVICE NOW INDICATOR LIGHTS WENT OFF FOR 10 SECONDS. I RETURNED IT TO THAT SAME DEALER AND THEY HAD THE CAR FOR A WEEK AND SAID THAT THEY COULD NOT FIND THE PROBLEM EVEN AFTER TALKING TO THE TECH LINE AND ENGINEERS AT HYUNDAI USA. I SAID IT SOUNDS LIKE THE MAIN COMPUTER MAY BE THE ISSUE BUT THEY REFUSED TO CONSIDER THAT SAYING THEY COULDN'T FIND THE ERROR CODES. THEY THEN TOLD ME THAT THE ERROR CODES RECYCLE ITSELF WHEN TURNING THE THE CAR ON AND OFF AND GET ERASED!!  I HAVE TO RETURN HOME FROM MY ROAD TRIP AND I AM VERY SCARED TO TAKE IT BACK ON THE ROAD AND DRIVE ANOTHER 1200 MILES. IT DEFINITELY FEELS DANGEROUS WITH THE CAR REVVING AT SUCH HIGH RPM'S AND IT BARELY MOVING WHEN I BRING IT TO A STOP.  THIS OCCURED 3 TIMES NOW AND I AM AFRAID OF IT HAPPENING AGAIN AND HAVING BOUGHT A LEMON, POTENTIALLY. IT WAS PURCHASED @ WEBB HYUNDAI IN MERRILLVILLE, IN IN MARCH OF 2020 WITH 3939 MILES ON IT.",
        "vin": "KM8J3CAL8KU"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/23/2020",
        "dateOfIncident": "09/22/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365897,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE LIGHT IS CONSTANTLY ON, AT TIMES WHEN MY SUV CRANKS UP, IT SHAKES, AND THE BRAKE PADS HAS OPENING OF AIR ENTRANCE. I DON'T FEEL SAFE! IT'S LIKE THAT WHEN IT'S IN MOTION, TURNING, AND ON HIGHWAY DRIVE. ALSO, IT ACTS AS IF IT WANTS TO CUT OFF AT TIMES.",
        "vin": "KM8J23A49KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/06/2020",
        "dateOfIncident": "09/21/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362999,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. OURISMAN HYUNDAI OF BOWIE (2404 CRAIN HWY, BOWIE, MD 20716) WAS CONTACTED AND CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "KM8J3CALXKU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/05/2020",
        "dateOfIncident": "10/03/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362761,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BROUGHT CAR IN FOR SERVICE (18K MILES) AND WAS TOLD I COULD NOT TAKE MY CAR FOR A RECALL - ABS, CAUSING SPONTANEOUS COMBUSTION. NO FIX AVAILABLE COULD BE MONTHS.  CANNOT PARK CAR ON LOT NOR GARAGE.  DEALER OFFERED RENTAL UNTIL FIX.  ONE WEEK LATER A CALL FROM DEALER STATING I COULD TAKE MY CAR BACK, RETURN THE RENTAL AND NOT WORRY ABOUT IT UNTIL THE CHECK ENGINE LIGHT COMES ON.*DT",
        "vin": "KM8J23A41KU"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/22/2020",
        "dateOfIncident": "09/22/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360463,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD VEHICLE SINCE JUNE 5TH, 2020 AND HAVE HAD 4 DOZENS TIMES WHERE IT WILL NOT START. IT HAS BEEN IN THE SERVICE DEPARTMENT TWICE, GETTING READY TO GO BACK FOR THE 3RD TIME. THE FIRST TIME THEY COULD NOT FIND ANYTHING, THE 2ND TIME, WHICH IT HAD TO BE TOWED, I WAS TOLD THAT IT WAS BECAUSE THE OIL FILTER WAS NOT A HYUNDAI OIL FILTER AND I HAD TO PAY $118.00 EVEN THROUGH I HAVE A WARRANTY. NOW THIS MORNING EVEN WITH THE HYUNDAI OIL FILTER, IT WILL NOT START AGAIN.",
        "vin": "KM8J23A44KU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/11/2020",
        "dateOfIncident": "09/09/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354383,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "SPORADIC HESITATION WHEN STARTING TO PULL OUT INTO TRAFFIC.  FEELS LIKE IT IS ABOUT TO STALL BUT IF YOU PUMP THE GAS PEDAL IT THEN RESPONDS.  EACH TIME THIS HAPPENS IT IS UNSETTLING TO SAY THE LEAST.",
        "vin": "KM8J33AL4KU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/04/2020",
        "dateOfIncident": "06/02/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327208,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE HAS ISSUES W/ACCELERATION - IT IS SLOW, HESITATES, AND FAILS TO MAINTAIN SPEED AT TIMES. FURTHER, THE TRANSMISSION CAUSES FREQUENT RPM SURGES, REGARDLESS OF SPEED OR TERRAIN OR ROAD TYPE (IT IS MOST FREQUENT WHEN GOING UP A HILL, BUT ALSO HAPPENS ON A FLAT ROAD). I WAS COMING TO A STOP AND WHILE SLOWING DOWN, WITH THE BRAKES APPLIED, THE ENGINE REVVED TWICE.     AFTER READING OTHER COMPLAINTS, THEY ALL SEEM TO BE ABOUT THE SAME THINGS AND NEED FIXED. I HAVE A SON THAT WILL START DRIVING IN THE FALL AND I'D LIKE TO BE ABLE TO RELY ON THE CAR TO RUN CORRECTLY AND WITHOUT ISSUES. THIS IS A MANUFACTURING ISSUE AND NEEDS FIXED - IT'S A SAFETY ISSUE FIRST AND FOREMOST.  *TR",
        "vin": "KM8J2CA49KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/01/2020",
        "dateOfIncident": "05/24/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326893,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MERGING INTO INTERSTATE CAR IS HESITATING NOT PICKING UP SPEED LIKE IT SHOULD. CARS MERGING BEHIND ME HAVE TO COME AROUND ME AND PASS BECAUSE I AM NOT PICKING UP SPEED FAST ENOUGH. *TR",
        "vin": "KM8J2CA42KU"
    },
    {
        "components": "POWER TRAIN,SEATS",
        "crash": false,
        "dateComplaintFiled": "05/25/2020",
        "dateOfIncident": "03/06/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325869,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION ISN'T SHIFTING OUT PROPERLY. YOU CAN HEAR THE CAR REVVING UP AND NOT CHANGING GEARS. THE ACCELERATION IS SLOW AS WELL. ALTHOUGH I'M PRESSING ON THE GAS, IT TAKES A WHILE FOR THE CAR TO PICK UP SPEED.    THE DRIVER SEAT IN MY BRAND NEW TUSCAN IS ALSO PEELING. I HAVEN'T CLEANED THE SEAT WITH ANY KIND OF CHEMICALS, BUT A SMALL SPOT IS VISIBLY PEELING.",
        "vin": "KM8J33AL7KU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/06/2020",
        "dateOfIncident": "03/03/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316547,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE IS EQUIPPED WITH A DCT, WHICH CAUSES THE VEHICLE TO SLOW, HESITATE, FAIL TO MAINTAIN SPEED, AND STOP WITHOUT WARNING. FURTHER, THE TRANSMISSION CAUSES FREQUENT RPM SURGES, REGARDLESS OF SPEED OR TERRAIN OR ROAD TYPE (IT IS MOST FREQUENT WHEN GOING UP A HILL, BUT ALSO HAPPENS ON A FLAT ROAD). WHEN MERGING ONTO A HIGHWAY ON A HILL, I MUST USE THE SLOW VEHICLE LANE TO GET UP TO SPEED BEFORE MERGING INTO TRAFFIC. OFTEN, I WILL PULL OUT TO PASS A CAR AND THE TRANSMISSION WILL FAIL TO RESPOND, CAUSING ME TO SLOW RAPIDLY. I HAVE TAKEN THIS TO THE DEALERSHIP ON MULTIPLE DATES DURING THE YEAR I'VE OWNED AND HAVE BEEN REPEATEDLY TOLD THAT IT IS \"NORMAL\" AND THAT IT WILL \"LEARN MY DRIVING HABITS. THE LATTER IS UNTRUE, IT DOES NOT LEARN AND I NEED TO ADAPT MY DRIVING HABITS TO THE UNCERTAINTY OF THE TRANSMISSION. THIS IS UNSAFE AND PUTS ME AND OTHER DRIVERS AT RISK. ON MULTIPLE OCCASIONS THE VEHICLES BEHING ME, REGARDLESS OF FOLLOWING DISTANCE, HAVE HAD TO SWERVE OR BRAKE DUE TO MY VEHICLES FAILINGS.",
        "vin": "KM8J3CALXKU"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/23/2020",
        "dateOfIncident": "02/23/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310983,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS IN MOTION ON I88 WESTBOUND IN IL. VEHICLE ELECTRICAL POWER CUT OFF COMPLETELY IN THE MIDDLE OF THE BUSY INTERSTATE. ACCELERATION SLOWED UNTIL VEHICLE DIED AND ALL ERROR LIGHTS APPEARED AND FLASHED ON DASH WITH A \"SERVICE NOW\" ALERT. PULLED OVER AND PLACED THE VEHICLE IN PARK, AND TURNED THE SWITCH TO SEE IF IT WOULD CRANK AGAIN. VEHICLE DOES NOT START AND GIVES THE SAME \"SERVICE NOW\" LIGHT. VEHICLE WILL NOT START WHEN JUMPED BY IL STATE POLICE. CALLED TOW TRUCK, CURRENTLY WAITING.",
        "vin": "KM8J23A49KU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/17/2020",
        "dateOfIncident": "01/15/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309622,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THIS 2019 HYUNDAI TUCSON SPORT NEW IN MAY OF 2019. I NOW HAVE 9,000 MILES ON IT. THE VEHICLE SUFFERS FROM CONSTANT  HESITATION ISSUES WHEN ACCELERATING. THIS OCCURS FROM A DEAD STOP, WHILE TURNING, AND WHILE TRYING TO QUICKLY SPEED UP TO AVOID A CRASH. IT IS LIKE THE FUEL HAS BEEN MOMENTARILY SHUT OFF. THIS IS EXTREMELY UNSAFE. WE HAVE AVOIDED SEVERAL  NEAR-CRASHES THROUGH SHEER LUCK IN THE PAST COUPLE OF MONTHS. THIS IS THE 2.4 ENGINE AND 6 SPEED AUTO/SHIFT ABLE TRANSMISSION. IF I PUT THE MODE TO SPORT, IT HELPS SOME. TO AVOID THE DANGEROUS LAG OF APPROXIMATELY 2 SECONDS, THE CAR HAS TO BE DRIVEN IN MANUAL MODE. WHEN THE CAR IS STANDING STILL AT THE LIGHT, EVERYTHING APPEARS NORMAL. BUT AS THE LIGHT CHANGES AND I ACCELERATE, IT WILL SUDDENLY \"STALL\" FOR ABOUT TWO SECONDS, THEN IT WILL SPEED UP. IT IS LIKE THE ENGINE IS HAVING TROUBLE COMMUNICATING WITH THE TRANSMISSION. I HAVE CALLED SEVERAL DEALERS AND THEY SAY THERE IS NO FIX. NUMEROUS OTHER OWNERS OF THESE VEHICLES ARE MAKING THE SAME COMPLAINT. I DO NOT WANT A NEW VEHICLE. I ALREADY HAVE ONE. I JUST WANT IT FIXED BEFORE SOMEONE GETS KILLED. PLEASE REVIEW ALL THE CONSUMERS COMPLAINTS ON THIS HYUNDAI TUCSON. I ALSO RENTED A VEHICLE FOR A DAY AND IT WAS A 2018 HYUNDAI TUCSON. IT DID THE EXACT SAME THING. THIS IS EXTREMELY DANGEROUS. THANK YOU.",
        "vin": "KM8J33AL2KU"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/09/2020",
        "dateOfIncident": "02/07/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308000,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AUTO LOCK, COLLISION LIGHT, AND OTHER WARNING LIGHTS HAVE WILL NOT GO OFF. STEERING IS HARD, BRAKES ARE ON, AND THIS IS A FAIRLY NEW CAR WITH ABOUT 11,000 MILES ON IT.",
        "vin": "KM8J3CA41KU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/29/2020",
        "dateOfIncident": "04/29/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302933,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAD PURCHASED OUR FAMILY CAR BACK ON APRIL 29 2019, AFTER A FEW WEEKS WE HAD MULTIPLE UNEVEN MISALIGNED GAPS ON OUR REAR QUARTER MOLDINGS AND HOOD. UNTIL THIS DAY ELGIN HYUNDAI & HYUNDAI USA DON'T WANT TO TAKE ANY RESPONSIBILITY ON A VEHICLE THAT WAS SOLD TO OUR FAMILY WRONG FROM THE ASSEMBLY LINE. THEY TRIED FIXING ONCE AND OFFER ME A ONE TIME PAYMENT FOR $325 TOWARDS MY MONTHLY PAYMENT SO I CAN KEEP MY MOUTH SHUT. EVERYWHERE I GO EVERY DEALER TELLS ME ELGIN HYUNDAI OR HYUNDAI USA SHOULD BE HELD RESPONSIBLE FOR SELLING YOU A WRONG CAR FROM THE ASSEMBLY LINE.",
        "vin": "KM8J3CAL7KU"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/19/2020",
        "dateOfIncident": "01/19/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300362,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR SEAT DRIVERS SIDE SEAT BELT WILL NOT LATCH.",
        "vin": "KM8J3CA44KU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/25/2019",
        "dateOfIncident": "12/24/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291188,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN HAVING A PROBLEM WITH THE CAR WHERE THE CAR HAS A COLD START NO MATTER IF ITS SUMMER OR WINTER IN CALIFORNIA. WHEN I PUSH THE START BUTTON THE CAR STRUGGLES TO START AND THEN DOES START AFTER 2-3 SECONDS. THIS PROBLEM HAVE BEEN SINCE THERE WHEN THE CAR WAS JUST 500MILES ON IT AND THE ISSUE EXISTS AS OF TODAY. IT WENT TO THE DEALERSHIP TWICE AND CAME BACK SAYING THERE IS NO PROBLEM. I HAVE OWNED MULTIPLE CARS IN THE PAST AND HAVE NEVER HAD SUCH ISSUES",
        "vin": "KM8J3CAL0KU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/24/2019",
        "dateOfIncident": "11/30/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11291025,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT RENTED A 2019 HYUNDAI TUCSON. THE CONTACT STATED THAT WHILE HIS MOTHER IN LAW WAS DRIVING 55 MPH OVER A SLIGHT HILL, THE DRIVER REACHED AN ICY PATCH AND THE VEHICLE CRASHED HEAD ON INTO AN EMBANKMENT. THE CONTACT WAS A PASSENGER AND STRUCK HIS HEAD ON THE WINDSHIELD CAUSING IT TO SHATTER. NONE OF THE AIR BAGS DEPLOYED. THE CONTACT WAS UNCONSCIOUS FOR A BRIEF MOMENT AND RECEIVED MEDICAL ATTENTION VIA AMBULANCE ON THE SCENE. THE DRIVER WAS NOT INJURED. A POLICE REPORT WAS FILED. THE CONTACT MENTIONE D THAT THE VEHICLE WAS RENTED VIA ENTERPRISE. THE VEHICLE WAS EVENTUALLY TOWED TO BERGLUND CHEVROLET BUICK (1824 WILLIAMSON RD NE, ROANOKE, VA 24012, (540) 344-1461), BUT THE CAUSE OF THE AIR BAG FAILURE COULD NOT BE DETERMINED. THE FRONT END OF THE VEHICLE SUSTAINED EXTENSIVE DAMAGE. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS APPROXIMATELY 19,000. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/23/2019",
        "dateOfIncident": "12/12/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290837,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN YOU STEP ON THE ACCELERATOR, SOMETIMES THE VEHICLE STOPS AND TAKES A COUPLE OF SECONDS TO CONTINUE RUNNING. I'VE FACED A COUPLE OF INSTANCES WERE AT A CROSSROAD VEHICLES ARE COMING TOWARDS ME, AND THE CAR STALLS AND TAKES A WHILE TO START MOVING. I'VE BEEN TOLD BY THE MECHANIC CAR DEALER THAT THIS IS NORMAL IN THIS NEW ACCELERATING SYSTEM. IT'S CAN OF SCARY AND YOU NEED TO ACCELERATE AND GET STUCK IN THE MIDDLE OF THE ROAD. MINE IS A HYUNDAI 2019 TUCSON.",
        "vin": "KM8J23A40KU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/13/2019",
        "dateOfIncident": "09/10/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288950,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. WHILE DRIVING AT ANY SPEED, THE COMPUTER SYSTEM MALFUNCTIONED AND PROVIDED INCORRECT ODOMETER AND FUEL LEVEL READINGS. THE VEHICLE WAS TAKEN TO FITZGERALD HYUNDAI (301-424-4800, LOCATED AT 11411 ROCKVILLE PIKE, ROCKVILLE, MD 20852) WHERE THE TECHNICIAN DIAGNOSED AND REPLACED THE FUSE. THE FAILURE RECURRED. THE VEHICLE WAS TAKEN BACK TO THE SAME DEALER WHO WAS UNABLE TO DIAGNOSE THE FAILURE AND REFERRED THE CONTACT TO THE MANUFACTURER. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 1,000.",
        "vin": "KM8J3CAL8KU"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/07/2019",
        "dateOfIncident": "09/27/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287616,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "SEPTEMBER 2019, FOUR MONTHS AFTER WE PURCHASED IT BRAND NEW. THE VEHICLES STOPPED RESPONDING TO MY ACCELERATION ON HIGHWAY SPEEDS WHEN ALL THE TECHNOLOGY SCREENS WENT OUT IN THE VEHICLE. WHILE AT A RED LIGHT THE VEHICLES RPM'S WILL VISUALLY GO UP AND DOWN AND THE VEHICLE SHUTTERS AS IF IT IS GOING TO TURN OFF. IT HAS UNINTENDED ACCELERATION WHEN I'M SITTING AT A STANDSTILL AND GO TO ACCELERATE THE VEHICLE WILL JUMP SO TO SPEAK ONCE THE ACCELERATOR IS ENGAGED. UNFORTUNATELY MY VIDEOS ARE TOO LONG TO UPLOAD BUT I DO HAVE CONFIRMATION OF 2 OF THE 3 CONCERNS BUT AM UNABLE TO RECORD THE HIGHWAY CONCERNS DUE TO OBVIOUS SAFETY REASONS.",
        "vin": "KM8J23A46KU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/06/2019",
        "dateOfIncident": "12/05/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287584,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "QI WIRELESS CHARGING PAD GET VERY HOT WHEN CHARGING A CELLPHONE",
        "vin": "KM8J3CAL1KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/18/2019",
        "dateOfIncident": "11/11/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280766,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN A/C OR HEAT IS TURNED ON, THE VEHICLE IS VERY SLUGGISH USUALLY. LAST WEEK I TURNED THE HEAT ON, AND THE CAR STALLED OUT, FORCING ME TO RESTART IT. I WAS IN TRAFFIC WHEN THIS OCCURRED.",
        "vin": "KM8J3CAL5KU"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": true,
        "dateComplaintFiled": "10/23/2019",
        "dateOfIncident": "10/21/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270466,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING HWY SPEEDS 65MPH, CAR LOST ALL ACCELERATION AND ALMOST KILLED BY TRUCK  WHILE CHANGING LANES. PULLED TO SIDE OF ROAD. CAR THEN DIED, LOCKED, AND CAN NOT BE OPENED WITH PHYSICAL KEY, KEY FOB NOR BLUELINK REMOTE. CAR IS BRAND NEW JULY PURCHASE 1800 MILES. BLUELINK SHOWS 0 PROBLEMS UNDER DIAGNOSTICS.",
        "vin": "KM8J3CAL7KU"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/15/2019",
        "dateOfIncident": "09/18/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268744,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING FROM LIBERTY,MO. TO CHICAGO,  SMART CRUISE CONTROL SET AT 70-75 MPH, VERY LITTLE TRAFFIC, AFTER AROUND 2 1/2 HOURS OF DRIVING ,ABOUT 40 MILES FROM HANNIBAL,MO. CAR ACCELERATED TO 90 MPH BY ITSELF.  VEHICLE CRUISE CONTROL WOULD NOT SHUT OFF BY CRUISE BUTTON, CANCEL BUTTON, OR BRAKE.  GOT OFF AT FIRST RAMP WITH CAR RUNNING AT 90 MPH BY BRAKING HARD.  PULLED OVER AND PUT CAR IN PARK. MOTOR SURGING AT HIGH RPM, WOULD NOT STOP RUNNING UP AND DOWN.  CRUISE INDICATOR LIGHTS OFF.   SHUT OFF ENGINE.  CALLED BLUE LINK, REFERRED TO NEAREST DEALER, NO CODES SHOWING ON CAR.   AFTER HALF HOUR RESTART CAR, NO PROBLEMS.  CHECKED FLOOR MATS AND REMOVED.   ON RETURN TRIP AROUND 2 1/2 HOURS FROM START AT AROUND 70-75MPH SETTING, THE CAR ACCELERATED TO 90MPH BY ITSELF, WITH THE SMART CRUISE CONTROL ON, NO TRAFFIC, NO FLOOR MATS, AND TURNED CRUISE CONTROL OFF,CRUISE BUTTON, CANCEL BUTTON, BRAKE, BUT ENGINE KEPT RUNNING AT 90 MPH. BRAKED HARD, PULLED OVER, ENGINE SURGING IN PARK. SHUT OFF, WAITED 1/2 HOUR, NO FURTHER PROBLEM ON WAY HOME.   DEALERSHIP COULDN'T FIND ANY CODES OR ENGINE OR CRUISE CONTROL PROBLEMS.  NOTED MATS IN CAR, DIDN'T COMMENT WHEN WHEN STATED THEY WERE INFORMED MATS OUT OF CAR WHEN SECOND OCCURRENCE.",
        "vin": "KM8J3CAL9KU"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/03/2019",
        "dateOfIncident": "09/19/2019",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265995,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "1.3 MILES AWAY FROM THE DEALERSHIP I PURCHASED THE 2019 HYUNDAI TUCSON IT STARTED TO SMOKE. 5 MINUTES LATER IT WAS ON FIRE!! IT HAD LESS THAN 400 MILES ON IT AND I'VE YET TO FIND OUT WHAT EXACTLY CAUSED THE FIRE. HYUNDAI OR THE DEALERSHIP WON'T TELL ME. THE FIRE CAME FROM THE PASSENGER SIDE UNDER THE HOOD. THE VEHICLE STARTED SMOKING WHEN I ATTEMPTED TO START IT AND CAUGHT ON FIRE WHILE OFF.",
        "vin": "KM8J33A47KU"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/25/2019",
        "dateOfIncident": "09/24/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257914,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 HYUNDAI A TUCSON WAS STOPPED IN DRIVEWAY WITH AUTO HOLD ON WHILE SPEAKING WITH AN INDEPENDENT WITNESS. FEET WERE NOT TOUCHING ANY PEDALS AND AUTO HOLD WAS ENGAGED WITH VERIFICATION ON DASH. VEHICLE SUDDENLY ACCELERATED DOWN DRIVEWAY AND INTO STREET TRAVELING TOWARDS MAILBOX ACROSS STREET. WAS ABLE TO APPLY BRAKES WITH A LOT OF PRESSURE AND STOPPED VEHICLE.  VEHICLES RPM'S AND SPEED WENT UP LIKE PRESSING HARD ON GAS PEDAL.  VEHICLE HAS 1800 MILES",
        "vin": "KM8J3CAL8KU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/24/2019",
        "dateOfIncident": "07/15/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257778,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 HYUNDAI TUCSON LIMITED. SPORADIC HESITATION ACCELERATION FROM STARTING FROM A COMPLETE STOP. I'VE HAD THE CAR SINCE JUNE AND HAVE LESS THAN 3500 MILES ON IT. WHEN YOU START FROM A RED LIGHT THE CAR WILL JERK AND HESITATE, ALMOST LIKE IT'S OUT OF GAS BUT THEN IN THE MIDDLE OF THE INTERSECTION IT WILL ACCELERATE LIKE NORMAL. THIS HAS ONLY HAPPENED TO ME WHILE IN NORMAL DRIVING MODE. IT HASN'T DONE THIS WHILE IN SPORT OR MANUAL SHIFTING MODE. I HAD TO SELECT A DATE OF WHEN THIS HAPPENED BUT IT ORIGINALLY STARTED AROUND MID JULY AND SPORADICALLY TO THIS DAY. IT HAPPENS RANDOMLY BUT WHEN IT DOES IT HAPPENS AT CONSECUTIVE STOP LIGHTS AND MULTIPLE TIMES ON THE SAME DAY. THIS ISN'T A DCT, SO HYUNDAI, NOR THE DEALER CAN SAY I'M DRIVING THE CAR INCORRECTLY. PRETTY DISAPPOINTING TO HAVE MY FIRST EVER BRAND NEW CAR HAVE A SERIOUS ISSUE LIKE THIS.",
        "vin": "KM8J33AL2KU"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/23/2019",
        "dateOfIncident": "09/05/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257403,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2019 HYUNDAI TUCSON LIMITED MODEL HAS OBSTRUCTED ILLUMINATION FROM THE HEADLIGHTS. IF I SHINE MY HEADLIGHTS ON THE GARAGE WALL IN FRONT OF ME I WILL SEE A HALF MOON SHADOW OVER EACH HEADLIGHT. WHILE DRIVING ON DARK COUNTRY ROADS AT NIGHT AROUND A CURVE YOU WILL SEE TWO SHADOWS OUT IN FRONT OF YOU. AS YOU COME OUT OF THE CURVE THOSE SHADOWS BECOME ONE TRIANGULAR SHADOW OUT IN FRONT OF YOU. IT IS HARD TO DETERMINE IF THIS IS A PERSON, ANIMAL OR THE HEADLIGHT SHADOW. ALSO, WHEN THERE IS A DIP IN THE ROAD THE ILLUMINATION IS DECREASED TO MAYBE 40 FEET IN FRONT OF YOU. SOMETIMES IT JUST LOOKS LIKE A DARK BAND IN FRONT OF YOU. YOU NEVER HAVE A CLEAR VIEW, ALWAYS A SHADOW. IN TOWN AT NIGHT WITH LIGHT AROUND YOU DON'T NOTICE THE SHADOWS AS MUCH. THIS IS DANGEROUS TO HAVE SUCH AN OBSTRUCTED VIEW AND TO SOMETIMES ALMOST WANT TO FOLLOW THE MOVEMENT OF THE SHADOWS INSTEAD OF THE ROAD. I DRIVE A LOT AT NIGHT ON DARK COUNTRY ROADS AND ALWAYS ON THE LOOK OUT FOR AN ANIMAL. IF YOU SHINE YOUR LIGHTS ON BRIGHT IT IS NOT AS BAD, BUT YOU CAN'T KEEP YOUR BRIGHTS ON ALL THE TIME. I HAVE SPOKEN WITH HYUNDAI CONSUMER AFFAIRS AND THEY  JUST SAY IT'S IN THE DESIGN. IT MAY BE IN THE DESIGN, BUT THE DESIGN IS DANGEROUS. WHO IS GOING TO STEP UP TO PROTECT THE CONSUMER. I HAVE NEVER BEEN IN A CAR WITH SUCH POOR ILLUMINATION. I FEEL VERY NERVOUS AND UNSAFE DRIVING THIS VEHICLE AT NIGHT. LOVE THE CAR IN THE DAY. THANKFULLY, I HAVE NOT HAD AN ACCIDENT, BUT FEEL THAT SOMETHING SHOULD BE DONE TO CORRECT THIS PROBLEM. I HAD TO SELECT A DATE THIS HAPPENED BUT IT IS CONTINUOUS. I BOUGHT THE CAR 8/30/19, BUT DIDN'T DRIVE AT NIGHT UNTIL 9/5/19,",
        "vin": "KM8J3CAL8KU"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/10/2019",
        "dateOfIncident": "09/10/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254461,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "SPORADIC HESITATION WHEN STARTING FROM A COMPLETE STOP.  THIS HAS HAPPENED TO ME ABOUT 15 TIMES, USUALLY WHEN PULLING OUT INTO TRAFFIC.  THE CAR HAS 4000 MILES AND HAS BEEN IN SERVICE ABOUT 6 MONTHS.  THE SERVICE MANAGER.STATED THEY HAVE NO OTHER COMPLAINTS BUT IS PROBABLY DUE TO THE \"SMART\" TRANSMISSION ADAPTING TO DIFFERENT DRIVERS.  I UNDERSTAND THAT THERE WAS A RECALL FOR 41,000 2017 TUSCONS FOR THE SAME ISSUE.",
        "vin": "KM8J33AL4KU"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "08/16/2019",
        "dateOfIncident": "08/14/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244498,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 HYUNDAI TUCSON. THE CONTACT STATED THAT THE FRONT DRIVER AND PASSENGER SEATS WERE SLED WHICH DID NOT PROVIDE A SAFE SUPPORT. THE CONTACT WAS CONCERNED THAT IN THE EVENT OF A CRASH IT COULD RESULT IN SEVERE INJURIES. THE DEALER TAMIAMI HYUNDAI (6780 AIRPORT-PULLING RD, NAPLES, FL 34109 (239) 417-1222) WAS NOTIFIED BUT NOT RESOLUTION WAS PROVIDED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THERE WAS NO FAILURE MILEAGE. INCORRECT NOT MAIN REASON. I REPORTED THAT THE FRONT SEAT HEADRESTS WERE POSITIONED AT THE BACK OF THE SEATS, WERE FIXED (NOT ADJUSTABLE) AND SO LEFT A LARGE SPACE BETWEEN THE HEADREST AND ANYBODIES HEAD. THUS, IN A SUDDEN STOP OR ACCIDENT, WOULD NOT PREVENT SEVERE WHIPLASH SINCE THERE WAS NO CONTACT WITH THE PASSENGERS HEADS. SPACE WOULD BE APPROXIMATELY 2\" DEPENDING ON HEAD SHAPE. THIS IS REALLY DANGEROUS! THE ANGLING IS SECONDARY TO THE HEAD SPACING.*JB",
        "vin": "KM8J33AL7KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/14/2019",
        "dateOfIncident": "06/21/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243864,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FORWARD VEHICLE COLLISION DETECTION AVOIDANCE ASSISTANCE  SYSTEM, IS NOT FUNCTIONING. SYSTEM DOES NOT PROVIDE WARNINGS OR BRAKING. THIS A NEW VEHICLE.",
        "vin": "KM8J33AL1KU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/13/2019",
        "dateOfIncident": "08/08/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243438,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS 1,750 MILES.  DRIVING TO WORK NOTICED THAT THE BRAKE PEDAL WAS SINKING WITHIN 2\" OF FLOOR.  BRAKE PEDAL FELT SPONGY.  TURNED ENGINE OFF AND PUMPED BRAKE 3 TIMES, PEDAL SUNK WITHING 2\" OF FLOOR.  TURNED ENGINE ON, PUMPED BRAKE 3 TIMES, SAME THING HAPPEND.  THE VEHICLE DID STOP BUT IN AN EMERGENCY, MAYBE IT WOULD NOT.  NO FLUID LEAKS UNDER, AROUND, OR AT THE BRAKE MASTER CYLINDER AREA.  TOOK VEHICLE TO DEALER (WARRANTY) BUT THEY COULD NOT GET HYUNDAI FACTORY DEALER SUPPORT LINE TO RESPOND TO THEIR INQUIRY.  MECHANIC ORDERED PART TO SEE IF IT WOULD FIX THE ISSUE, BUT HYUNDAI IS OUT OF THE PART.  PERHAPS THERE IS AN ISSUE AND HYUNDAI IS COVERING A BREAK DEFECT UP.",
        "vin": "KM8J33AL0KU"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/16/2019",
        "dateOfIncident": "05/26/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232543,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED NEW 2019 HYUNDAI TUSCAN ULTIMATE THIS MAY. IN THE FIRST WEEK THE SERVICE ENGINE LIGHT LID UP. I TOOK IT TO DEALER AND 2 DAYS LATER THE VEHICLE WAS RETURNED AS FIXED. BASED ON DEALER'S RESOLUTIONS IT WAS EVAP LEAK CODE AND THEY JUST HAD TO REPLACE THE CAP. WEEK LATER THE SIGN CAME BACK AGAIN AND I DROPPED OFF VEHICLE FOR ANOTHER 4 DAYS, DEALER STATED IT WAS SAME CODE AGAIN AND IT WONT HAPPEN AGAIN. I TOOK IT BACK AND TWO WEEK LATER THE LIGHT CAME BACK ON AGAIN AND DISAPPEARED AFTER THREE DAY. THE FOURTH TIME LIGHT CAME BACK AGAIN AND I WILL BE DROPPING OFF THE VEHICLE AGAIN. THE DEALER IS STILL UNABLE TO FIND THE CAUSE AND UNABLE TO FIX THE ISSUE. BASED ON THE DISCUSSION WITH SERVICE MANAGER, IT IS MINOR PROBLEM FOR THEM BUT THE ISSUE IS KEEP COMING BACK AND I HAVE TO KEEP BEINGING THE VEHICLE BACK TO THE DEALER TO FIX IT.",
        "vin": "KM8J33AL8KU"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/21/2019",
        "dateOfIncident": "05/21/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209072,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS IN MOTION ON I20/459 ENTRY RAMP IN BIRMINGHAM, AL. VEHICLE STOPPED AND CUT OFF COMPLETELY IN THE MIDDLE OF THE BUSY INTERSTATE. ACCELERATION SLOWED UNTIL VEHICLE DIED AND ALL ERROR LIGHTS APPEARED AND FLASHED ON DASH WITH A \"SERVICE NOW\" ALERT. PLACED THE VEHICLE IN PARK, AND TURNED THE SWITCH TWICE BEFORE IT WOULD CRANK AGAIN. UPON STARTING- THE SAME \"SERVICE NOW\" LIGHT APPEARED AND CAR WAS ABLE TO DRIVE. \"SERVICE NOW\" LIGHT VANISHED ABOUT 10 SECONDS AFTER VEHICLE WAS DRIVING AGAIN.",
        "vin": "KM8J23A4XKU"
    },
    {
        "components": "POWER TRAIN,SEAT BELTS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/15/2018",
        "dateOfIncident": "12/05/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161500,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "UNCONTROLLED SPEEDING  HARD IMPACT ON BUMP VERY LOW SUSPENSION SYSTEM  HIGHER MPG THAN ADVERTISED",
        "vin": ""
    }
]