[
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/28/2022",
        "dateOfIncident": "11/01/2021",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454523,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "COUGAR",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Keystone Cougar. The contact noticed that the antenna was missing from the trailer. The dealer was not contacted. The antenna was not replaced. The manufacturer was notified of the failure. The contact stated that the VIN was not included in NHTSA Campaign Number: 20V398000 (Equipment). The approximate failure mileage was unknown.",
        "vin": "4ydt22r26kv"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/23/2021",
        "dateOfIncident": "02/02/2019",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426127,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "COUGAR",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Keystone Cougar. The contact stated that upon exiting the vehicle, the contact noticed that the fiberglass outside of one of the rear slides was cracked. The vehicle was taken to a local dealer where it was diagnosed with the fiberglass needing to be replaced. The vehicle was repaired but the failure recurred a year later. The contact then received notification of NHTSA campaign number: 21V380000 (Suspension, Structure) and was relating the failure to the recall. The manufacturer had been informed of the failure and referred the contact to the NHTSA for assistance. The failure mileage was unknown.",
        "vin": "4YDF36827KR"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/16/2021",
        "dateOfIncident": "06/10/2021",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421160,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "COUGAR",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Keystone Cougar. The contact stated while driving 60 mph, the draining tank hose fractured and detached from the RV on the passenger side. The contact stated there was no warning light illuminated. The vehicle was not taken to the local dealer nor the independent mechanic to be diagnosed. The vehicle was not repaired. The manufacturer was informed of the failure. The approximate failure mileage was 5,000.",
        "vin": "4YDF31526K2"
    },
    {
        "components": "SUSPENSION,STRUCTURE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/29/2020",
        "dateOfIncident": "08/17/2020",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376928,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "COUGAR",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPANY DEFECT TANDEM AXLES ARE NOT PARALLEL WITH ONE ANOTHER BY 1.5\" THIS MAKES A BIG SAFETY ISSUE FOR MY FAMILY AND EVERY ONE ON THE ROADS! COMPANY REFUSES TO FIX THE ISSUE THEY SAID ITS WITHIN SPECS.  THE CAMPER PULLS LEFT ALL THE TIME WHEN TOWING. THE FRONT TANDEM AXLE IS TURNING LEFT BY 1.5\"",
        "vin": "4YDT32R29KV"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/30/2019",
        "dateOfIncident": "07/26/2019",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240550,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "COUGAR",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 KEYSTONE COUGAR TRAVEL TRAILER. WHILE TRAVELING TO A CAMPGROUND, THE DEXTER AXLE FAILED AND THE REAR PASSENGER SIDE WHEEL DETACHED. THE TRAILER WAS LEFT AT THE CAMPGROUND AND WAS NOT TAKEN TO A DEALER OR AN INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND DID NOT ASSIST. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS UNKNOWN. *DT*TP  CONSUMER STATED THE RECALL IS SAFETY NOTICE 19-340. DEXTER AXLE INNER BEARING INSUFFICIENT GREASE AFFECTING MODELS WITH D44 AXLES - COUGAR 22. RBS. IT IS ON THE NHTSA WEBSITE 1/25/2019. ALSO, I FAILED TO MENTION THAT WE WERE WITHOUT THE CAMPER FOR AT LEAST 3 MONTHS DUE DEALERSHIP HAVING THE CAMPER FOR OTHER/UNRELATED WARRANTY WORK. INVALID VIN.*JB  *TR *TP  PICTURES ATTACHED*JB*DT*TP",
        "vin": "4YDT22R29KV"
    },
    {
        "components": "PARKING BRAKE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/14/2019",
        "dateOfIncident": "05/25/2019",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220036,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "COUGAR",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 KEYSTONE COUGAR. WHILE DRIVING AND MAKING A RIGHT TURN, THE EMERGENCY BRAKE RELEASE CABLE SEPARATED AND BECAME CAUGHT UNDERNEATH THE TOWING VEHICLE. AS A RESULT, THE VEHICLE STRAIGHTENED UP AND THE TRAILER BRAKES SEIZED, WHICH RESULTED IN THE TRAILER BEING DRAGGED FOR APPROXIMATELY FOUR MILES. THE CONTACT WAS ALERTED BY ANOTHER MOTORIST ABOUT THE TRAILER BEING DRAGGED AND THAT THE WHEELS ON THE TRAILER WERE SMOKING. THE CONTACT TURNED THE VEHICLE AROUND AND DROVE BACK HOME. CONTACT NOTICED AND SMELLED BURNING BRAKES. THE CONTACT INSPECTED THE TRAILER BRAKES AND FOUND THAT THE BRAKE RELEASE CABLE HAD DETACHED AND CAUSED THE FAILURE. CONSUMER RETURNED TO CAB OF TRUCK TO INSPECT BRAKE CONTROLLER SETTINGS, WHICH WAS NOT THE PROBLEM. DECIDE TO MOVE VEHICLE AND TRAILER NACHO PAVEMENT TO SEE IF THE BRAKES HAD RELEASED, DROVE AROUND THE BLOCK WHEN REALIZED THEY HAD NOT, PULLED TRAILER INTO BACK YARD TO DROP, WALKED TOWARD NOSE OF TRAILER AND NOTICED BREAKAWAY CABLE DISENGAGED FROM THE TRAILER AT THE SWITCH. OPENED TAILGATE AND FOUND ENTIRE  CABLE, TRUCK END ATTACHED AT HITCH HANDLE SWITCH INTERLOCK END IN THE BED OF THE TRUCK AND CABLE PINCHED UNDER BRACKET OF THE GLIDER HITCH. REATTACHED, EMPTIED TRAILER, CALLED REPAIRMAN AT BOGUE RV TO GET HIS TAKE ON POSSIBLE DAMAGE, SAID HE WAS CONCERNED OVER THE WHEEL BEARINGS HAVING BEEN DESTROYED FROM THE HEAT. WAITED AGAIN FOR THE BRAKES TO COOL, HOOKED NEXT DAY, TESTED FOR DISENGAGEMENT OF BRAKES AFTER ENSURING SWITCH CABLE WAS FREE FROM CATCHING ON TESTED FORWARD AND BACKWARD MOTION WITHOUT DRAGGING OF TRAILER, THEN DROVE TRAILER 14 MILES TO RV DEALER FOR INSPECTION AND REPAIR.THE CONTACT CALLED AN UNKNOWN DEALER AND SCHEDULED AN APPOINTMENT. THE CONTACT WAS ABLE TO UNTANGLE THE BRAKE RELEASE CABLE; THEREFORE, THE TRAILER BRAKES RELEASED AND THE TRAILER WAS ABLE TO ROLL FREELY. THE VEHICLE WAS CURRENTLY AT THE DEALER FOR DIAGNOSIS AND A REPAIR ESTIMATE. THE MANUFACTURER STATED THAT THE BRAKE RELEASE CABLE WAS NOT COVERED UNDER WARRANTY AND PROMISED THE CONTACT WOULD RECEIVE A CALL FROM A SUPERVISOR. THERE WAS NO MILEAGE. *DT *JB",
        "vin": "4YDF29R25K1"
    }
]