[
    {
        "components": "ELECTRICAL SYSTEM,WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/25/2021",
        "dateOfIncident": "01/03/2021",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404774,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "MONTANA HIGH COUNTRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR BRAND NEW, $84,000, 2019 KEYSTONE RV MONTANA HIGH COUNTRY 373RD, THAT WE BOUGHT ON 05-30-2019, WAS NOT BUILT TO APPLICABLE CODES AND STANDARDS, NOR PROTECTED AGAINST FIRE AND VEHICLE DAMAGE, AND IS IN VIOLATION OF THE NHTSA AND DOT'S HIGHWAY SAFETY STANDARDS. IT IS A COMPLETE HAZARD! WE CONTACTED GANDER RV OF STATESVILLE, TOOK IT TO THEM ON 02-18-2020, AND WAS TOLD IT WOULD BE COMPLETE ON 02-28-2020. IT WAS THERE FROM 02-18-2020 UNTIL 05-06-2020 THE FIRST TIME, THEN 05-06-2020 UNTIL 05-22-2020 THE LAST, WHICH IS 95 DAYS. THEY ONLY FIXED 8 OF THE 33 PROBLEMS, THE MOST SERIOUS STILL NOT FIXED! WE TOOK THE RV HOME AND JUST AS I THOUGHT, MY TRUCK STARTED SHAKING AND VIBRATING TREMENDOUSLY, JUST LIKE BEFORE. I HAVE REPEATEDLY SAID THAT IT'S EITHER THE BRAKES OR THE HITCH, BUT MY TRUCK SHAKES TREMENDOUSLY, WITH OR WITHOUT THE BRAKES BEING APPLIED AND AT ANY SPEED! THE ENTRY DOOR IS LITERALLY FALLING APART. WE HAVE LEAKS ON ALL SLIDES, AS WELL AS THE SKYLIGHT, AND BOTH WINDOWS ON THE REAR SLIDES, WHEN IT RAINS. THE DRIVER'S SIDE REAR SLIDE IS ACTUALLY COMING APART FORM WHERE IT HAS BEEN LEAKING. WE ALSO FOUND ABOUT 10 OR SO SCREWS AND/OR STAPLES THAT WERE EITHER NOT INSTALLED CORRECTLY AND/OR ARE 'WORKING THEIR WAY UP', THAT HAVE ALMOST COMPLETELY BROKEN THROUGH THE RUBBER ROOF MEMBRANE. WE ALSO HAD A VERY SCARY MOMENT, DRIVING DOWN THE BUSY INTERSTATE, WHEN THE DRIVER'S SIDE METAL SKIRTING SUPPORT PIECE, WHICH WAS LOOSE AND WAS ONE OF THE 33 PROBLEMS, CUT THROUGH THE DRIVER'S SIDE REAR TIRE, WHICH CAUSED THE TIRE TO EXPLODE, BARELY ESCAPING A MAJOR AUTOMOBILE ACCIDENT. ON 01-03-2021, I NOTICED WATER COMING DOWN FROM UNDERNEATH THE UNDERBELLY AND, OF COURSE, IT'S STILL THE BLACK TANK LEAKING. I ALSO FOUND WATER LINES AND ELECTRICAL WIRES, THAT ARE RUNNING THROUGH, RUBBING UP AGAINST, THE METAL FLOOR JOIST. ONE OF THEM WAS THE MAIN WIRE THAT FEEDS POWER TO THE ENTIRE RV!*DT*DT*DT",
        "vin": "4YDF37325KA"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/09/2020",
        "dateOfIncident": "08/30/2020",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363518,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "MONTANA HIGH COUNTRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE RETURNING FROM A CAMPING TRIP WE HAD A RAINIER ST TIRE MADE BY TREDIT TIRE BLOW OUT ON THE RIGHT SIDE OF THE TRAILER CAUSING DAMAGE TO THE RIGHT SIDE AND UNDERNEATH OF THE TRAILER. NEITHER KEYSTONE NOR TREDIT TIRE WILL ADMIT FAULT.*DT  CONSUMER STATED VEHICLES WERE TAKEN BY THE DEALER.*JB",
        "vin": "4YDF3803XKA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/24/2020",
        "dateOfIncident": "06/28/2020",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341286,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "MONTANA HIGH COUNTRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 4/4/2020 AT CAMPING WORLD, HARRISBURG, PA WHEN PICKING UP THE CAMPER FROM SERVICE WORK, IT WAS OBSERVED THAT THE 2 FRONT WEIGHT BEARING JACK MOUNT BRACKET WELDS HAD TORN AWAY FROM THE CAMPER FRAME AND WERE BENT AND TWISTED. CAMPING WORLD STAFF WERE NOTIFIED AND THEY WERE REPLACED. THE CAMPER WAS DELIVERED TO OUR HOME ON 4/10/2020. ON 4/14/2020 WE AGAIN OBSERVED BROKEN WELDS ON THE BRACKETS. CAMPING WORLD WAS NOTIFIED ONCE AGAIN AND THEY TOOK IT BACK AND REPLACED THEM AGAIN. ON 6/28/2020, WHILE LOOKING OVER THE CAMPER WE ONCE AGAIN SAW THAT THE BRACKETS WERE BENDING AND THE WELDS WERE BREAKING FROM THE FRAME. I HAVE ATTACHED PICTURES FROM EACH INCIDENT.*DT*DT   THE CONSUMER PROVIDED PHOTOS. *TR*JB",
        "vin": "4YDF36529KA"
    }
]