[
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "03/29/2022",
        "dateOfIncident": "03/29/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458807,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I have a 2019 Jeep Grand Cherokee Trailhawk currently around 33,500 miles. I bought this vehicle new and have been having issues with it since I got it.  I hear electrical crackling and popping throughout the cabin, mostly in the dashboard. I thought at first it was the adaptive cruise or forward braking system engaging, but the sound seems to be completely random.  A common symptom is the speakers, microphones, and speaker-based safety alerts are completely cut out. If I'm on a call, the person on the other end will not be able to hear me until the speakers come back. Some of the systems that do not work as intended include:  -- Radio/SiriusXM/Apple Carplay/Android Auto (No sound) -- Uconnect Voice Command (No Sound/Mic) -- Parking sensors (no proximity alerts) -- USB Ports (slow charge and do not recognize phones) -- Forward Collison Alerts (No Sound) -- Navigation Alerts (No Sound) -- Blind Spot Alerts (No Sound)  I've tried the system with the following phones (with OEM and high-quality aftermarket wires) on AT&T, Verizon, Mint:  -- iPhone XS -- iPhone 12 -- iPhone 13 Pro Max -- Samsung Galaxy Note 8 -- Samsung Galaxy Note 20 -- Samsung Galaxy Note 22 -- Samsung Z Flip  My Jeep has the Panasonic Uconnect system. I've attached pictures of the type & IMEI etc.   This issue causes a direct safety concern when an alert doesn't activate or a when the loud electronic distortion comes through the speakers that will cannot be turned off—causing me to have to pull over and turn the car off for the sake of my hearing.",
        "vin": "1C4RJFLG1KC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/21/2022",
        "dateOfIncident": "03/04/2022",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457748,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving my 10 year old son to school.  We hopped in our Jeep in the garage.  Pushed the start button and my son smelled something that was burning.  I backed out of the driveway and then my son said there is smoke coming out of the center counsel.  I pulled over and looked in the counsel and saw a fire.  Ran to the house and got a fire extinguisher to put it out.  Fire was out out for a short time, but then burst into an all out fire.  The car burnt to the ground.  Nothing remained.  So far the insurance company and Chrysler cannot pinpoint what caused the fire.  It is a total loss and the damage was too extensive to determine the cause.  My son and I are very lucky we got out of the vehicle in time and everyone was safe.  The vehicle was a lease and had only been serviced for oil changes by our Chrysler dealer.  No alarms or visual indicators forewarned us that anything like this was going to happen.  The vehicle is a total loss and we don't know why it caught on fire.  Chrysler denies any form of responsibility.  Just looking for answers and hope this doesn't happen to anyone else.",
        "vin": "1C4RJFCG1KC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/05/2022",
        "dateOfIncident": "02/20/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455319,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "SUV AIRBAG WARING LIGHT FLASHES OFF AND ON.  Lights randomly come off and on when truck is parked.",
        "vin": "1c4rjfag7kc"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/10/2022",
        "dateOfIncident": "02/09/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451373,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I have had 2-3 windows blow out on my truck for no apparent reason. I am afraid that the front wi shield is going to blow when I am driving and I will get hurt and/or die. I am a single parent and need a vehicle to be safe. The dealership is being difficult and won’t look into why it keeps happening. The warrenty won’t cover it either as they don’t cover glass. I want them to look into why it is occur  if or give me my money back. They don’t seem to take this problem seriously.",
        "vin": "1C4RJFBG6KC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/07/2022",
        "dateOfIncident": "12/03/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450785,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Airbag did not deploy",
        "vin": "1C4RJEBG3KC"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/25/2022",
        "dateOfIncident": "01/24/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448891,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I was sitting at a drive thru when my 2019 Jeep Grand Cherokee Limited 4x4 started to malfunction. A service shifter light came on, then the service engine light, then the service airbag light. all the lights and windshield wipers went on. no matter what i did lights and wipers kept malfunctioning. My car stalled and I wasn’t able to move it. I turned my car off, turned it back on and again. It let me drive a couple feet but the steering wheel was stiff. Again it stopped moving, wouldn’t allow me to go any further and only made the noise as if I was accelerating. All the lights and windshield wipers kept going crazy. I turned my car off and on again. Lights and wipers never stopped. I was able to drive another couple feet but then the 4x4 locked. The shifter switched from drive to parking and it was stuck on parking. The emergency neutral lever and button locked. My Jeep was going no where. The cables that connect to the battery were extremely hot and could have been a fire hazard. The vehicle was also saying service transmission continue on D, Do not shift or turn off Engine but the vehicle automatically set it self to Parking.  My entire car locked down. I could only turn it on and off. I had to get it towed to the nearest auto repair shop. their analysis computer was unable to communicate with the vehicle. Luckily I was in a drive thru and not driving on the street or freeway. I could have been a very dangerous/deadly situation elsewhere. No previous accidents, issues with the jeep. It all happened suddenly.",
        "vin": "1C4RJFBG6KC"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "01/04/2022",
        "dateOfIncident": "12/12/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446142,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Electronic stability control and check engine lights on. Remote start and auto park stopped working. Dealer says not covered . 43000 miles. Quoted 1400.00 to repair.",
        "vin": "1c4rjfagxkc"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/17/2021",
        "dateOfIncident": "12/16/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444108,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Both headlights blew out at the same time while I was driving at night. No visibility. Dangerous situation. No displayed message. Dealership replaced both bulbs. Cost was $200. They stated that it was not an electrical problem. Too much of a coincidence!",
        "vin": "1c4rjfbg9kc"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/30/2021",
        "dateOfIncident": "11/09/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442120,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Our Jeep just hit 9k miles and the Airbag Service Light has turned on and it gives a warning of it each time you start the vehicle.",
        "vin": "1C4RJFBG8KC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/30/2021",
        "dateOfIncident": "11/24/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442123,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Both head lamps went out on a 2019 Jeep Grand Cherokee.  Manufacture say it is maintenance issue, but both going out at the same time is too much of coincidence.  There must be a electrical issue (Which is covered under warrantee) that cause this.",
        "vin": "1C4RJFAG3KC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/03/2021",
        "dateOfIncident": "10/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439143,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Minor leak in EVAP system. Unsure if malfunction is due to a bad sensor",
        "vin": "1C4RJEAG8KC"
    },
    {
        "components": "ELECTRICAL SYSTEM,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "11/03/2021",
        "dateOfIncident": "07/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439144,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Screen display will freeze while putting car into drive from reverse, thus having the back up camera stuck on the screen while driving. This recall was issued for my make and model, but my VIN was not included. Please report this is happening in my car to ensure my car is included in the recall.",
        "vin": "1C4RJEAG8KC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "09/14/2021",
        "dateOfIncident": "08/26/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432984,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Backing out of garage to driveway just a few feet.  Car suddenly accelerated on its own to a very high speed in Reverse. Knocked down a tree and busted through the neighbor's garage wall.  Attempted to pump brakes but it did not help one bit.   My safety was at risk and luckily I was not hurt.  Luckily there was no one in the alley or at my neighbor's driveway or garage.  People could have been killed based on how fast the car suddenly accelerated.  No warning lights were on prior to the incident. Nothing to indicate there was a problem with the car.  When the car stopped as a result of hitting the garage wall, it was still in reverse. There is $20k damage to my 2019 Jeep Grand Cherokee.  The collision company said they will make sure its safe to drive but I'm not sure if it should be inspected elsewhere. I will contact a dealer to inspect after collision company releases the car.  How am I to drive this car again not knowing if this could happen again and potentially result in death of someone?  The car is certainly available for inspection.",
        "vin": "1C4RJFBG6KC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/08/2021",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432192,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Jeep Grand Cherokee. The contact stated that the STOP/START system failed to operate as designed. The contact stated that while driving with the STOP/START system engaged and the vehicle was stopped at a stop sign or a traffic light, the STOP/START system failed to engage the engine. The contact had to put the vehicle in park and restart the vehicle. The failure was experienced twice. The contact stated that the STOP/START system light illuminated on the instrument panel and stated that the system needed to be serviced. The vehicle was taken to the dealer do be diagnosed. The mechanic failed to retrieve a fault code. The dealer also tests drove the vehicle and was unable to duplicate the failure. However, the contact stated that the Mopar computer sent an email alert that the STOP/START system needed to be serviced. The vehicle was not repaired. The manufacturer was not contacted. The failure mileage was 23,000.",
        "vin": "1c4rjfbg6kc"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/05/2021",
        "dateOfIncident": "06/18/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423498,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving on a highway on June 18, 2021, from Houston to Galveston (TX), at approx. 30 mph given traffic at that time, and suddenly the dash board started blinking and malfunctioning, I realized I lost the speedometer showing me only horizontal lines, the brake light turned on (red) and it felt like I did not have appropriate control of the steering wheel, it was very stiff. I was able to reduce the speed, turn on the emergency lights, tested the brake and then take the exit into the feeder and stopped and turned off the car. I called the River-Oaks Chrysler-Jeep service unsuccessfully.  I waited 15-20 minutes and then turned on the car to see that the engine sign was on, this was not the first time that I've got this sign and even received emails with a warning for which the car was taken accordingly for service and I was told by the advisors that if the engine sign was on, the car was drivable but if it was blinking it was not drivable.  One time, after having one of these situations with the engine warning light on, the next available day I brought the car for service and because the light was already off, I was told that the system might have reset and that no action was needed at that time.  I decided to proceed my trip given that the steering wheel felt that is was back to normal, tested the brakes and  drove to my destination, using the feeders and at very low speed. The next morning I called the Jeep service and talked to the advisor (Mr. Fernandez) over the phone, explained what happened and he reassured me that I could safely drive the car back to the dealer given the fact that the engine light was on but not blinking.  Car was dropped for service on June 22, after being parked for those days. The ABS module was reported to have an internal failure and it was replaced. This has been a repetitive event but this last time was critical in terms that I lost confidence in this vehicle. The administration at this dealer is fully aware of these events.",
        "vin": "1C4RJEAG5KC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/27/2021",
        "dateOfIncident": "06/11/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422523,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Stops and needs to be put in park to restart, was determined not related to start stop or batteries . Jeep still in shop part not available  for undetermined length of time",
        "vin": "1C4RJFBG9KC"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/16/2021",
        "dateOfIncident": "06/13/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421129,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving around 75mph on the interstate for about an hour (not using cruise control) when all of a sudden the accelerator no longer worked.  There was no warning, no error lights or codes or anything.  I tested the brakes and they still worked.  I was able to coast to a stop on the breakdown lane.  I waited about 20 seconds and restarted the car and everything worked again.  This is my son's car that I was driving and it's really concerning because I thought I bought a safe car for him.  I'm an experienced driver, but either way it's extremely dangerous.  I looked information up about this issue and I guess it's been happening quite a bit according to the internet.  Someone mentioned that the 4 PCM torx head t15 mounting screws that hold the PCM faceplate to the protective metal case where the circuit board is housed are too long. (Not the 3 bolts that hold the PCM to the mounting bracket) When there was a vibration or shift, the screws touched the circuit board shorting everything out and causing the engine to stall. The owner put washers with the 4 little t15 screws and were able to fix the problem.  I think there needs to be a recall.  I'm afraid to drive the car myself or have my son drive it.  I'm taking it to the dealer, but I don't think they'll be able to recreate the situation.",
        "vin": "1C4RJFBG6KC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/15/2021",
        "dateOfIncident": "04/24/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416693,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLING AND JUMPING WHEN SWITCHING GEARS",
        "vin": "1C4RJFBG4KC"
    },
    {
        "components": "ELECTRICAL SYSTEM,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "04/16/2021",
        "dateOfIncident": "01/19/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408405,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SCREEN THAT DISPLAYS RADIO AND NAVIGATION AND REAR BACKUP CAMERA FREEZES UP AND CAMERA WILL NOT DISPLAY. THE SYSTEM DOES THIS INTERMITTENTLY AND WILL POWER ITSELF OFF AND ON. SOMETIMES IT WILL NOT REBOOT UNLESS I STOP, PUT THE VEHICLE IN PARK, TURN OFF THE ENGINE, RESTART THE ENGINE AND TAKE VEHICLE OUT OF PARK. IT IS VERY DISTRACTING AND UNSAFE TO FREEZE UP AND LOSE THE DISPLAY. THIS HAS HAPPENED WHEN I'M DRIVING IN TOWN AND ON THE HIGHWAY AND ALSO WHEN VEHICLE IS PARKED. THIS HAS BEEN ONGOING SINCE DECEMBER 2020. THE RADIO MODULE HAS BEEN REPLACED ONCE. THE SECURITY GATEWAY MODULE HAS BEEN REPLACED BUT NOTHING HAS HELPED. I'VE TAKEN IN BACK 4 TIMES SINCE JANUARY 2021 FOR THE SAME ISSUES.",
        "vin": "1C4RJFBG1KC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/30/2021",
        "dateOfIncident": "03/29/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405514,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS STOPPED IN TRAFFIC WITH THE VEHICLE IN DRIVE. WHEN THE LIGHT CHANGED TO GREEN I PRESSED THE ACCELERATOR AND THE DRIVE (D) INDICATOR LIGHT BEGAN BLINKING. AT THE SAME TIME, THE ENGINE WOULD REV BUT WOULD NOT GO FORWARD. THE VEHICLE BEHIND ME NEARLY RAN IN INTO THE BACK OF US. I HAD TO SWITCH FROM DRIVE TO PARK, BACK TO DRIVE TO MOVE FORWARD.",
        "vin": "1C4RJFAG7KC"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/08/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395279,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DISPLAY/ELECTRONIC SYSTEM APPEARED TO BE HIJACKED DURING MY COMMUTE TO WORK.  THE HACKER BEGAN BY CHANGING THE RADIO FROM SIRIUS XM TO AN AM STATION, THEN BEGAN CHANGING SETTINGS (CLIMATE CONTROL OF SEATS), VIEWED CONNECTED DEVICES (USB, MEDIA ETC.), THEN SWITCHED TO VIEW THE REAR VIEW CAMERA, VIEWED THE COMPASS, VIEWED PHONE SETTINGS AND DIALED THE LAST NUMBER DIALED FROM MY PHONE.  THE HACKER KEPT GOING BACK TO SETTINGS, REAR VIEW CAMERA, RADIO AND CLIMATE CONTROL.  THIS ALL HAPPENED IN A SHORT AMOUNT OF TIME AND CONTINUED EVEN AFTER I HAD STOPPED THE VEHICLE AND TURNED MY CELL PHONE OFF.  I LEFT MY PHONE OFF UNTIL I ARRIVED AT WORK AND THE HACKER WAS STILL MESSING WITH SETTINGS AND RADIO.  I TURNED THE VEHICLE OFF AND OPENED THE DOOR TO DROP THE DISPLAY AND ALL ELECTRONIC AUXILIARY POWER.",
        "vin": "1C4RJFAG4KC"
    },
    {
        "components": "AIR BAGS,STRUCTURE,ENGINE",
        "crash": true,
        "dateComplaintFiled": "01/26/2021",
        "dateOfIncident": "12/14/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11389986,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE (2019 JEEP GRAND CHEROKEE) WAS ONLY 1 1/2 YEARS OLD AND WAS INVOLVED IN A HEAD ON COLLISION. I WAS DRIVING ABOUT 45MPH WHEN I WAS STRUCK BY 4-DOOR CHEVY SILVERADO (DRIVER-TO-DRIVER COLLISION) THAT WAS ATTEMPTING TO MAKE A LEFT TURN ON GREEN, SO ONLY GOING ABOUT 3-5MPH. THE TRUCK'S STEERING WHEEL AIRBAG DEPLOYED, BUT NONE OF MY JEEP'S DID. MY JEEP'S ENTIRE FRONT AREA WAS CRUSHED, AND DRIVER'S SIDE EXPERIENCED EXTENSIVE DAMAGE AS WELL; RESULTING IN MY JEEP BEING TOTALED. EVERYONE AT THE SCENE OF THE ACCIDENT WAS SHOCKED THAT MY JEEP'S AIRBAGS DID NOT DEPLOY. AS A RESULT, I BUSTED MY HEAD ON THE STEERING WHEEL, AND 6 WEEKS LATER, I STILL HAVE A KNOT ON MY FOREHEAD. I WILL NEVER PURCHASE A GRAND CHEROKEE AGAIN! I AM COMPLETELY AMAZED THERE ARE ZERO RECALLS!",
        "vin": "1C4RJEAG7KC"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/25/2021",
        "dateOfIncident": "01/17/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389875,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THIS CAR IN JAN. 2018 BRAND NEW. FOR THE FIRST YEAR OR SO I HAD NO PROBLEMS. AS OF JULY 2020 IT HAS STALLED ON ME FOR 5 TIMES. IT ONLY HAPPENS WHILE ON THE HIGHWAY (60-70MPH). THE LIGHTS ON THE DASHBOARD START BLINKING AND IT SAYS \"SHIFT TO P TO START\". IT DECELERATES VERY QUICKLY LUCKILY I'VE BEEN ABLE TO MERGE TO THE EMERGENCY LANE ON THE HIGHWAY BUT THIS LAST TIME (1/17/21) IT WAS VERY SCARY AS CARS WERE SWERVING IN ORDER TO AVOID HITTING ME. I'M UNABLE TO ACCELERATE SO THERE'S CARS GOING 60-80MPH FLYING PAST ME. ONCE I GET TO THE EMERGENCY LANE AND DOWN TO 5-7MPH THE CAR COMPLETELY STOPS (HARD STOP). I'VE TAKEN IT IN TO THE DEALER EVERY TIME AND EVERY TIME THEY CAN'T \"DUPLICATE\" MY COMPLAINT, THERE FOR NOTHING CAN BE DONE.CAN SOMEONE PLEASE FIX THIS AS I STILL HAVE 1 YEAR LEFT ON THIS CAR! IF NOT- IM TRADING IT IN & NO LONGER BUYING JEEPS. I HAVE THE DEALER INVOICE FOR ALL VISITS IF ANYONE NEEDS THEM.",
        "vin": "1C4RJEAG6KC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/06/2021",
        "dateOfIncident": "12/28/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386745,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MULTIPLE ISSUES: 1) LOSS OF POWER WHILE DRIVING. HAD TO COME TO A FULL STOP WHILE IN TRAFFIC AND RESTART THE CAR. 2) DOORS WOULDN'T LOCK ANY MORE. 3) BATTERY DRAINED WITHIN 24HRS AND REQUIRED JUMP START.   DIAGNOSIS: FAULTY TIPM, CURRENTLY BEING REPLACED. CAN PROVIDE FULL DOCUMENTATION IF REQUESTED.",
        "vin": "1C4RJEBG9KC"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/14/2020",
        "dateOfIncident": "01/25/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383298,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AC DOES NOT STAY COLD. IT CYCLES FROM COLD TO LIKE WARM AND HUMID SEVERAL TIMES PER MINUTE. I HAVE TAKEN THE VEHICLE IN TO THE DEALER SEVERAL TIMES. THEY HAVE DRAINED AND RECHARGED THE AC TO NO AVAIL. THEY HAVE TOLD ME OTHER CUSTOMERS COMPLAIN OF THE SAME THING IN THE 2019S. IT HAPPENS WHILE THE VEHICLE IS STATIONARY AND IN MOTION. THIS IS A KNOWN ISSUE THAT NO FIX HAS BEEN ESTABLISHED FOR.",
        "vin": "1C4RJEAG4KC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/08/2020",
        "dateOfIncident": "12/03/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378444,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "IN JUNE OF 2019, I PURCHASED THE VEHICLE NEW. ABOUT THE 3,414 MILE MARK, I HAD MAJOR ELECTRICAL ISSUES. WHILE DRIVING THE CAR, ALL OF THE WARNING MESSAGES STARTED FLASHING ACROSS MY DASHBOARD. THE CAR BECAME SLUGGISH AND FELT LIKE IT WAS GOING TO STOP RUNNING. THIS ALL HAPPENED WHEN I WAS IN TRAFFIC MOVING FORWARD. I FELT UNSAFE. IT WENT TO THE DEALER. IF MY MEMORY SERVES ME RIGHT, THEY FOUND ABOUT 75 CODES HAD BEEN ACTIVATED BY THE COMPUTER. THEY COULD NOT FIND A PROBLEM WITH THE CAR AND GAVE IT BACK TO ME. ON MY WAY HOME, IT HAPPENED AGAIN. ALL THE WARNING MESSAGES FLASHED ACROSS THE DASHBOARD SCREEN WHILE I WAS ON THE HIGHWAY. THE CAR WAS SLUGGISH AND I THOUGHT IT WAS GOING TO DIE. IT WENT BACK TO THE SHOP AND THEY KEPT IT FOR ABOUT TWO WEEKS. COULD NOT FIND A PROBLEM WITH IT. FINALLY GOT IT BACK AND I WAS ENSURED IT WAS REPAIRED. ABOUT A WEEK AGO, IT HAPPENED AGAIN. THE 11,000 MILE MARK. THE EXACT SAME SCENARIO AS BEFORE. BUT THE CAR STOPPED MOVING ON TWO OCCASIONS WHEN I WAS IN REVERSE AND IN TRAFFIC STOPPED WAITING TO MAKE A LEFT TURN. THE CAR REMAINED RUNNING BUT WOULD NOT CONTINUE IN REVERSE OR GO FORWARD. I PUT THE CAR IN PARK BOTH TIMES, MESSAGES FLASHED ACROSS THE SCREEN AND SEEMED TO RESET THE SYSTEM. I THEN COULD CONTINUE GOING WITH THE CAR. I DEFINITELY FELT UNSAFE WHEN THIS HAPPENED. AGAIN, THEY CAN FIND NOTHING WRONG. I WAS TOLD THERE WAS A TWO PAGE PRINTOUT SHOWING ALL THE WARNING CODES THAT HAD GONE OFF. AS I WRITE THIS, THE CAR IS IN THE SHOP. IVE BEEN TOLD THEY CANNOT FIND ANYTHING WRONG. AS OF THIS WRITING, THEY DO NOT KNOW WHAT IS WRONG WITH IT. THEY WANTED TO GIVE IT BACK TO ME, UNFIXED. I TOLD THEM TO GET IT REPAIRED. THE CAR IS TO DANGEROUS TO TAKE BACK UN-REPAIRED.",
        "vin": "1C4RJFBGXKC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/08/2020",
        "dateOfIncident": "11/26/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378496,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED THAT WHEN IT RAINS WATER LEAK IN MY TRUCK ON THE DRIVER SIDE FROM THE BRAKE PEDAL. I HAS SOAKED THE CARPET AND MAT SEVERAL TIME AND ALSO CAUSED MEWDOW PROBLEMS THE VEHICLE WAS STATIONARY AT THE TIME IN SUMTER SC AT MY HOME",
        "vin": "1C4RJFBG3KC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/19/2020",
        "dateOfIncident": "08/15/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375390,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2019 JEEP GRAND CHEROKEE WILL INTERMITTENTLY NOT START. I WILL PUSH THE BUTTON AND IT REVS UP BUT DOES NOT TURN OVER. THIS LASTS FOR ABOUT 10 MINUTES AND THEN WILL START. THIS HAPPENS ABOUT ONCE A WEEK. THE CAR ALSO STALLED UNDERWAY TWICE THIS PAST SUMMER. QUIRK JEEP IN BRAINTREE MA TELLS ME NOTHING IS WRONG WHEN I HAVE VIDEO EVIDENCE. THE CAR IS NOT SAFE AND IS LIKE NEW. IT CURRENTLY HAS ONLY 8500 MILES ON IT. VERY FRUSTRATING WHEN I PAID A LOT FOR THE CAR.",
        "vin": "1C4RJFAG7KC"
    },
    {
        "components": "ENGINE,LANE DEPARTURE,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "11/17/2020",
        "dateOfIncident": "11/17/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375151,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY SUBMITTED A CLAIM. HAD TO TOW TO MY DEALERSHIP AND WAS JUST NOTIFIED THAT THE TRANSMISSION IS ALSO MALFUNCTIONING. I HAVE NOTIFIED MY DEALER IF THESE EXACT RECALLS AT THIS WEBSITE FOR THIS MAKE AND MODEL AND THEY ARE TELLING ME IT DOES NOT APPLY TO MY VEHICLE. BIZARRE. PLEASE HELP. I'VE ONLY HAD THIS CAR 8 MONTHS.",
        "vin": "1C4RJFAG9KC"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/15/2020",
        "dateOfIncident": "11/14/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374769,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS STALLED TWICE IN THE LAST 3 DAYS AND HAS ALSO NO TURNED ON SO WE NEEDED A JUMP 1 DAY AGO.  WE BOUGHT THIS CAR BRAND NEW OFF THE LOT WITH ONLY 65 MILES ON IT.  ALSO THERE'S AN 'A!' SYMBOL SHOWING ON THE DASH NOW.",
        "vin": "1C4RJFAG9KC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/03/2020",
        "dateOfIncident": "10/08/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11372865,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE WAS HIT BY A SILVERADO EXTENDED CAB PICKUP AT A 4 WAY STOP TWICE BY THE SAME TRUCK.  THE IMPACT RESULTED IN THE JEEP BEING A TOTAL LOSS WITH EXTENSIVE DAMAGE FRONT AND REAR. THE AIRBAGS NEVER DEPLOYED RESULTING IN INJURIES TO BOTH THE DRIVER AND MORE SERIOUS THE PASSENGER. THE JEEP WAS ACCELERATING FROM A DEAD STOP TO CROSS THE INTERSECTION.  THE TRUCK DID NOT STOP OR SLOW DOWN AT THE INTERSECTION.*DT*JB",
        "vin": "1C4RJFJT3KC"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/15/2020",
        "dateOfIncident": "04/24/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364445,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 JEEP GRAND CHEROKEE. THE CONTACT STATED THAT AFTER STARTING THE VEHICLE, THE VEHICLE FAILED TO IMMEDIATELY SHIFT INTO DRIVE OR REVERSE. IN ADDITION, THE DASHBOARD COMPUTER MALFUNCTIONED. AFTER THE COMPUTER SELF RESET, THE VEHICLE WOULD SUDDENLY ACCELERATE. ON SEVERAL OCCASIONS THE ENGINE REVVED UP AND THE VEHICLE WOULD ABRUPTLY ACCELERATE FORWARD OR IN REVERSE. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER JIM SHORKEY NORTH HILLS CHRYSLER DODGE JEEP RAM LOCATED AT 7670 MCKNIGHT RD, PITTSBURGH, PA 15237 WHO WAS UNABLE TO DETERMINE THE CAUSE OF FAILURE. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 6,700.",
        "vin": "1C4RJFBG3KC"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/12/2020",
        "dateOfIncident": "10/12/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364030,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN A ROAD, AT 30MPH, IT ALL OF A SUDDEN STALLED OUT. POWER STEERING STOPPED WORKING, ENGINE WAS DEAD, IT SAID ON DASH TO \"SHIFT INTO PARK\". I MANAGED TO PULL INTO A PARKING LOT. PUT IT IN PARK. TURNED IT OFF, THEN ATTEMPTED TO RESTART, IT WOULDN'T START (SOUNDED LIKE ENGINE TRYING, THEN NOT TURNING OVER. I THEN TURNED  IT OFF AGAIN, AND TRIED, AND IT TURNED ON. I WAS ABLE TO MAKE IT HOME, BUT A CAR SHOULDN'T STALL WHILE DRIVING AT 30MPH DOWN A ROAD.",
        "vin": "1C4RJFLG2KC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/23/2020",
        "dateOfIncident": "09/23/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360833,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "SO FOR A COUPLE OF MONTHS WHEN THE VEHICLE IS IN DRIVE, IT WILL 'SPIT' WHEN IT'S IN GEAR. LIKE I'LL PUSH ON THE GAS AND IT WILL GO BUT SOMETIMES IT WILL STALL AND THEN GO AGAIN. IT STOPPED DOING THAT FOR A COUPLE OF WEEKS BUT TODAY I WAS REVERSING OUT OF MY DRIVEWAY AND IT SAID 'SHIFT TO P BEFORE PUTTING IN GEAR' (KEEP IN MIND THE CAR WAS IN REVERSE). AND THE CAR WAS 'SPITTING' AS I WAS IN REVERSE. I CHECKED TO MAKE SURE IT WAS COMPLETELY IN THE REVERSE GEAR AND IT WAS. SO I PUT IT IN PARK AND THEN REVERSE AND IT WAS FINE AFTER THAT. BUT I SAW THIS POST ON FACEBOOK NOT LONG AGO, A WOMEN HAD I BELIEVE A 2017 JEEP CHEROKEE, SHE WAS DRIVING ON THE HIGHWAY AND HER CAR POPPED UP A NOTIFICATION 'SHIFT TO P'. RIGHT AFTER THAT HER CAR AUTOMATICALLY STOPPED AND SHE WRECKED. MY CAR SAID THE SAME THING TO ME THIS MORNING WHILE I WAS IN REVERSE. THERE IS NO RECALL ON MY VEHICLE AS OF NOW, AND I AM SCARED FOR MINE AND MY FAMILIES SAFETY. PLEASE INVESTIGATE THIS.",
        "vin": "1C4RJEAG4KC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/22/2020",
        "dateOfIncident": "09/04/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360528,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE TRANSMISSION IS VERY SPOTTY .. IT JERKS AND HARD TO GET FROM ONE GEAR TO THE NEXT.  THERE'S A MAJOR ISSUE WITH THE TRANSMISSION.  THIS OCCURS EVERYDAY",
        "vin": "1C4RJFBG4KC"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/13/2020",
        "dateOfIncident": "09/13/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354798,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE INTERSTATE WHEN ALL SERVICE LIGHT CAME ON AND STEERING WHEEL LOCKED UP AND THE CAR BEGAN TO POWER DOWN. I ALMOST CRASHED INTO A 18 WHEELER BECAUSE THE STEERING WHEEL WOULD NOT TURN PROPERLY. I WAS ABLE TO PULL OVER AND THE CAR WOULD NOT MOVE, SWITCH GEARS, STOP OR START. MY VEHICLE WAS SERVICED BY JEEP TWICE IN THE PAST TWO WEEKS.",
        "vin": "1C4RJFAG9KC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/08/2020",
        "dateOfIncident": "09/08/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353869,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE SHIFTER WILL RANDOMLY COME ON RIGHT AFTER VEHICLE IS STARTED OR STARTS BEEPING WHEN DRIVING BUT THEN CLEARS ITSELF AND I CHECK ON DASH FOR STORED MESSAGES IT DISAPPEARS. ONLY ONCE HAS VEHICLE NOT COME OUT OF PARK AFTER BEING STARTED AND ALL SHIFTER LIGHTS WERE ON WHEN IT WOULDN'T COME OUT OF PARK SHUT VEHICLE OFF AND TURNED BACK ON AND WAS FINE BUT SERVICE SHIFT STILL COMES ON RANDOMLY. THE PHOTO I ATTACHED IS NOT FROM TODAY 9/8/20",
        "vin": "1C4RJFAG2KC"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/24/2020",
        "dateOfIncident": "08/24/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350988,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING HOME AND THE JEEP SWITCHED TO NEUTRAL ON ITS OWN AND FLASHED \"SHIFT TO PARK\" ON THE SCREEN. I HAD TO ROLL TO THE SIDE OF THE ROAD, PUT IT IN PARK AND TURN IT OFF. I AM SCARED TO DRIVE IT. I HAVE KIDS. IF THIS HAPPENS ON THE HIGHWAY WE WILL BE HURT.",
        "vin": "1C4RJEAG5KC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/17/2020",
        "dateOfIncident": "08/16/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349783,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS SHUT OFF WHILE DRIVING 3 SEPARATE TIMES.  THE LAST TIME WAS DOING 65 DOWN A TEXAS HIGHWAY.  SUDDENLY LOST ALL POWER TO THE ENGINE. ON PRESSING THE THE MOTOR REVVED UP BUT THERE WAS NO TRANSMISSION ENGAGEMENT EVEN THOUGH THE VEHICLE WAS STILL IN DRIVE.  WAS FORCED TO PULL OVER TO SHIFT INTO PARK TO RESTART THE VEHICLE.  ALL THREE TIMES THE VEHICLE WAS IN MOTION AND THE AUTOMATIC VEHICLE SHUTOFF FEATURE WAS DISABLED.    I HAD IT IN TO THE DEALER AFTER THE FIRST TWO TIMES, THEY WEREN'T ABLE TO REPRODUCE IT SO THEY GAVE IT BACK HAVING DRIVEN IT 100 MILES AND TAKEN A QUARTER TANK OF GAS DOING SO.  I HAVEN'T DRIVEN THE VEHICLE MUCH DUE TO THE PANDEMIC BUT YESTERDAY THE THIRD OCCURENCE HAPPENED IN A CONSTRUCTION ZONE AND WE WERE ALMOST REAR ENDED AT 65 MPH DUE TO THIS FAILURE.",
        "vin": "1C4RJEAG1KC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/17/2020",
        "dateOfIncident": "08/16/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349935,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A CITY STREET THE ELECTRIC POWER STEERING FAILED WITH NO PRIOR INDICATION OF A PROBLEM.  THIS MADE THE VECHILE VERY DIFFICULT TO STEER AT LOW SPEED. THE DEALER DIAGNOSED THE PROBLEM AS A FAILED ELECTRIC POWER STEERING PUMP.  THE REPAIR REQUIRES REPLACEMENT OF A COMPLETE RACK AN PINION SYSTEM AS THE PUMP IS A  INTEGRATED PART. THE VEHICLE HAS LESS THAN 15,000 MILES.",
        "vin": "1C4RJFBG2KC"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "08/12/2020",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348743,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LOWER LEATHER DRIVER'S SEAT HAS LOST IT'S BOLSTERING WITHIN ONE YEAR OF PURCHASE. THIS CAUSES THE DRIVER TO LOOSE LOWER SEAT SUPPORT WHICH ALLOWS THE SEATED DRIVER TO LEAN AGAINST THE DOOR WHILE DRIVING.",
        "vin": "1C4RJFAGXKC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/10/2020",
        "dateOfIncident": "08/05/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348504,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN WE PUT THE CAR IN REVERSE THE BACK UP CAMERA COMES ON BUT ONCE WE PUT IT INTO DRIVE THE BACK UP CAMERA STAYS ON FOR QUITE SOMETIME... DEALERSHIP IN CARSON CITY NV COULD NOT DUPLICATE IT SO WE ARE STUCK",
        "vin": "1C4RJFBG1KC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/27/2020",
        "dateOfIncident": "06/27/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341627,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING MY CAR AROUND A CURVE WHEN THE WHEEL LOCKED UP ON ME AND STARTED TURNING IN THE OTHER DIRECTION AND INTO OPPOSING TRAFFIC",
        "vin": "1C4RJFLG0KC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/20/2020",
        "dateOfIncident": "06/20/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340394,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE JEEP MAKES A LOUD POPPING NOISE WHEN PLACING IT INTO ANY GEAR AND YOU CAN FEEL A PUSH FORWARD.  I TOOK THE JEEP INTO THE DEALERSHIP TO CHECK OUT THE PROBLEM.  FIRST THEY SAID THEY DID NOT HAVE IT HAPPEN TO THEM AND I NEEDED ME TO COME IN AND SHOW THEM.    WHEN I GOT THERE AND SHOWED THEM AND THE MECHANIC FIRST THOUGHT IT COULD BE SOMETHING AND PUT IT UP TO LOOK AT IT AGAIN.  HE MADE IT REPEAT THE POPPING AND LURCHING MOVEMENT MULTIPLE TIMES THEN CAME BACK AND SAID ALL JEEPS DO THIS AND IT IS NORMAL.  BUT NOW IT IS WORSE AND IT IS ALSO POPPING AND LURCHING WHILE SLOWING DOWN AND SPEEDING UP.",
        "vin": "1C4RJFAG7KC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/17/2020",
        "dateOfIncident": "07/06/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339901,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 JEEP GRAND CHEROKEE. THE CONTACT STATED THAT WHILE DRIVING 55 MPH, SEVERAL UNKNOWN WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS TURNED OFF AND RESTARTED HOWEVER, THE FAILURE PERSISTED. THE VEHICLE WAS DRIVEN TO THE RESIDENCE. WHILE ATTEMPTING TO PLACE THE GEAR SHIFTER IN PARK, THE TRANSMISSION FAILED TO ENGAGE. THE STARTED TO ROLL BACKWARDS AND THE PARKING BRAKE WAS ACTIVATED TO STOP THE VEHICLE. THE CONTACT WAS UNABLE TO TURN THE VEHICLE OFF. AFTER A WHILE, THE VEHICLE LOSS POWER AND TURNED OFF. THE FOLLOWING DAY AFTER STARTING THE VEHICLE, THE CONTACT ATTEMPTED TO SHIFT THE VEHICLE OUT OF GEAR HOWEVER, THE TRANSMISSION FAILED TO ENGAGE. THE VEHICLE WAS TOWED TO TRANSITOWNE JEEP CHRYSLER DODGE RAM OF WEST SENECA (2989 TRANSIT RD, ELMA, NY 14059) TO BE DIAGNOSED HOWEVER, THE DIAGNOSTIC TEST WAS STILL PENDING. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED THE CONTACT WITH A CASE NUMBER. THE FAILURE MILEAGE WAS APPROXIMATELY 13,787.",
        "vin": "1C4RJFBG9KC"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/12/2020",
        "dateOfIncident": "07/12/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338904,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY CAR AND THE CAR SHUT DOWN AND STEERING WHEEL LOCKED IN PLACE. A FLASHING MESSAGE CAME ON TO RESTART MY CAR. LUCKILY I WAS ON AN EMPTY ROAD AND NO ONE WAS BEHIND ME.",
        "vin": "1C4RJEBG0KC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/22/2020",
        "dateOfIncident": "06/21/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330005,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE SHUTDOWN WHILE DRIVING.  HAS SHUT DOWN MULTIPLE TIMES WHILE MOVING DOWN THE ROAD.  ENGINE SHUTS OFF, PRESSING GAS WILL REV THE ENGINE BUT THERE WILL BE NO TRANSMISSION POWER EVEN THOUGH THE VEHICLE IS STILL IN DRIVE.  HAVE TO PULL OVER AND SHIFT INTO PARK AND RESTART.  THIS IS EXTREMELY DANGEROUS!  *TR",
        "vin": "1C4RJEAG1KC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/09/2020",
        "dateOfIncident": "06/09/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327935,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN USING THE VIEW SCREEN FOR NAVIGATION I CONTINUE TO GET WEATHER ALERTS FOR LOCATIONS THAT 100S MILES AWAY FROM ME.  WHICH MAKE ME LOOK DOWN AT THE SCREEN TO TOUCH THE OK BUTTON TO GET BACK TO THE NAVIGATION.  THE FEATURE TO TURN OFF WEATHER ALERTS IS NOT PROGRAMMED INTO THE HEAD UNIT, WHICH SENDS OUT NON RELATED WEATHER ALERTS CONSTANTLY DURING MY DRIVING.  AGAIN, FORCING ME TO LOOK DOWN AT THE SCREEN TO TOUCH OK!  VERY DANGEROUS TO BE OPERATING THE SCREEN HEAD UNIT WHILE DRIVING.  EVERY FEW MINUTES!  VEHICLE IN MOTION.  *TR",
        "vin": "1C4RJEBG5KC"
    },
    {
        "components": "EQUIPMENT,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/09/2020",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328030,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "UCONNECT ON STEREO SYSTEM FREEZES UP. WHEN IT DOES THIS THE TEMPERATURE CONTROLS, PHONE, RADIO, NAVIGATION SYSTEM AND  EVERYTHING IT CONTROLS STOPS WORKING. THE VEHICLE CAN BE STATIONARY OR MOVING AND IT JUST STOPS WORKING, HAVE TO PULL OVER AND TURN VEHICLE OFF AND WAIT FOR AT LEAST 5 MINUTES FOR IT TO COME BACK ON.  *TR",
        "vin": "1C4RJFBG2KC"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/09/2020",
        "dateOfIncident": "06/08/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328064,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING STRAIGHT  AT APPROXIMATELY 45 MPH ON A THE 3 LANE ROAD FULL OF TRAFFIC  VEHICLE SUDDENLY CLUNKED LOUDLY AND VIOLENTLY SHIFTED FROM HIGH GEAR POSSIBLY FIFTH OR SIXTH INTO FIRST GEAR WITH THE RPMS AT OVER 7000 THIS CAUSED  ME AND MY FAMILY TO LUNGE  FORWARD AT WHICH TIME I MOMENTARILY LOST CONTROL OF THE VEHICLE. I WAS ABLE TO GAIN CONTROL AND STEER THE CAR TOWARDS THE SIDE OF THE ROAD AND HAD TO SLAM THE SHIFTER INTO PARK IN ORDER TO STOP. WHILE STOPPED THE VEHICLE REMAINED AT 7000 RPMS UNTIL I PUSHED THE OFF BUTTON OF THE CONSOLE.  *TR",
        "vin": "1C4RJFAG8KC"
    },
    {
        "components": "PARKING BRAKE,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/28/2020",
        "dateOfIncident": "05/28/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326322,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 JEEP CHEROKEE. THE CONTACT STATED THAT WHILE DRIVING AT 35 MPH, THE VEHICLE INDEPENDENTLY SHIFTED INTO PARK WITH THE PARKING BRAKE WARNING LIGHT ILLUMINATED. THE CONTACT ATTEMPTED TO RESTART THE VEHICLE SEVERAL TIMES HOWEVER, THE FAILURE RECURRED. THE VEHICLE WAS TAKEN TO BAY CHRYSLER DODGE JEEP RAM (636 15TH ST, PANAMA CITY, FL 32401) TO BE DIAGNOSED WHICH WAS STILL PENDING. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 31,000. THE VIN WAS NOT INCLUDED.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/12/2020",
        "dateOfIncident": "01/22/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308823,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO. I HAVE FOUND MANY ISSUES WITH MY UCONNECT SYSTEM AND WHAT APPEARS TO HAVE BEEN COMPROMISED (HACKED). I HAVE REPORTED THIS TO JEEP AND THE SIRIUS/CM SYSTEM.   1 OCCASION MY SOS/ASSIST FEATURE WAS DEACTIVATED WHILE I WAS IN THE CAR.  ANOTHER TIME LIGHT CHANGED FROM RED TO GREEN ON ANOTHER OCCASION WITHOUT TOUCHING IT.  2 SYSTEM WAS RESET AND SHOWING PHONES BEING CONNECTED THAT HAD BEEN TOTALLY REMOVED FROM UCONNECT SYSTEM.  3  ON MORE THEN ONE OCCASION MY UCONNECT LINKS/APPS WERE NOT LOADED... TOTALLY DISAPPEARED AFTER BEING THERE AND CAR WAS ON FOR MORE THEN AN HOUR.  4 SETTINGS BUTTON/ OPTION TO ADJUST IMPORTANT INFORMATION SOMETIMES NOT ON SCREEN.  5  MAP NAVIGATION GIVING MISDIRECTION AND HAD ME DRIVING IN CIRCLES BACK TO MY STARTING POINT.  6 SCREEN FREEZING AND NOT ALLOWING ME TO DISCONNECT PHONE/CHANGE SCREENS...ALSO HAD ISSUES WHERE MY SCREENS WOULD JUMP FROM ONE THING TO THE NEXT WITHOUT TOUCHING ANYTHING.    DO NOT KNOW IF MY UCONNECT WAS ACCESSED DURING THE TIME PERIOD MY PHONE WAS HACKED INTO AND I HOOKED IT UP THROUGH CARPLAY OR IF A \"LOCK LINK \" WAS USED.     I'VE DONE MY RESEARCH BECAUSE I THOUGHT ALL THESE WERE ODD AND IT IS NOT UNCOMMON FOR \"LOW LIFES\" TO GET INTO THESE COMPUTER SYSTEMS.    I HAVE BEEN WORKING WITH PHONE COMPANY, JEEP FCA CASE MANAGEMENT,  APPLE  ON THE ISSUES OF MY HACKED PHONE AND UCONNECT SYSTEM.",
        "vin": "1C4RJFAG7KC"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/07/2020",
        "dateOfIncident": "02/06/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307793,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT INTO MY VEHICLE AND WHEN I TRIED STARTING IT WOULD NOT TURN ON THE ENGINE.  THE ONLY THING THAT WOULD ILLUMINATE WAS THE SPEEDOMETER AREA.  THE AUDIO UNIT WOULD TURN ON OFF AND THEN ON AND THEN OFF.  I TRIED ABOUT 10 TIMES AND WOULD NOT START THE ENGINE.  THE VEHICLE WAS PARKED IN MY DRIVEWAY WHEN IT HAPPENED.",
        "vin": "1C4RJFAG4KC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/03/2020",
        "dateOfIncident": "02/03/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306780,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE NAVIGATION SYSTEM HAS A WEATHER ALERT NOTIFICATION THAT CAN'T BE DISABLED. IT TAKES UP THE ENTIRE INFOTAINMENT SCREEN AND DOES NOT GO AWAY UNLESS I TAKE MY EYES OFF THE ROAD TO CLICK ON IT TO CLOSE THE WINDOW. THIS HAPPENS EVERYDAY IN MY JEEP WITH A WIND ADVISORY. PRETTY ABSURD NOTIFICATION ESPECIALLY SINCE IT HAPPENS EVERY DAY. I LIVE ON THE WEST COATS AND UNDERSTAND IT CAN BE WINDY. SUPER DANGEROUS TO CONSTANTLY POP UP AND MAKE ME CLOSE IT MANUALLY.",
        "vin": "1C4RJFBG1KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/24/2020",
        "dateOfIncident": "01/11/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301557,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER GOING THROUGH AN AUTO CAR WASH THE BRAKES FAILED AND THE CAR ROLLED INTO A POLE WHILE PULLING UP TO A VACUUM STATION ABOUT 50 YARDS FROM THE EXIT.  I BELIEVE THE ABS SYSTEM NOTIFIED THE CAR THAT IT WAS IN A SLIDE BECAUSE THE REAR WHEELS CONTINUE TO ROTATE WHILE THE FRONT WHEELS ARE NOT ROTATING WHILE BEING PULLED THROUGH THE CAR WASH TRACKS. THEREFORE  TRICKING THE SYSTEM INTO THINKING IT SHOULD NOT BRAKE WHEN BRAKES WERE APPLIED.",
        "vin": "1C4RJFBG0KC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/23/2020",
        "dateOfIncident": "01/22/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301426,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS IN REFERENCE TO AN ACCIDENT ON 1/22/20 AT APPROXIMATELY 5:45PM NEAR PITTSBURGH, PA. I HAD AN ISSUE WITH THE 'DRIVER SIDE' LOWER OR 'FOOT' AIR BAG, AS IT DID NOT 'UNDEPLOY' OR IF IT DID, IT IS VERY BULKY AFTER DOING SO AND BECAUSE OF THAT, IT CAUSED, IN MY OPINION, ADDITIONAL AND UNNECESSARY DAMAGES TO THE OTHER PARTY'S INVOLVED. SITUATION - IMMEDIATELY AFTER THE ACCIDENT, I NEEDED TO APPLY THE BRAKES AND COULD NOT DO SO BECAUSE THE AIRBAG WAS IN THE WAY OF MY FEET REACHING AND PRESSING THE BRAKE PEDAL. THE VEHICLE WAS STILL IN DRIVE AND IDLING WHICH, CONSEQUENTLY LED TO ME PUSHING THE VEHICLE IN FRONT OF ME FURTHER THAN THE ACTUAL SPOT OF THE ACCIDENT AND 'POSSIBLY' INTO THE VEHICLES IN FRONT OF HER. I LITERALLY HAD TO PUT THE JEEP IN 'NEUTRAL' AND THEN PRESS THE 'POWER OR ON/OFF' BUTTON TO SHUT THE VEHICLE OFF AND TO KEEP IT FROM CONTINUING TO PUSH HER CAR. NOW ... DO I BELIEVE YOUR VEHICLE SAVED MY LIFE ABSOLUTELY! HOWEVER, THIS AIRBAG ISSUE SEEMS TO BE SOMETHING THAT COULD HAVE TURNED OUT HORRIBLY WRONG HAD I NOT KNOWN HOW TO SHUT THE VEHICLE OFF WITHOUT USING THE BREAK. IF I WOULD HAVE BEEN UNCONSCIOUS, THEN IN THEORY I L COULD HAVE PUSHED THE VEHICLE IN FRONT OF ME UNTIL WHAT I WAS PUSHING VIA IDLING WAS TOO MUCH WEIGHT FOR THE LOW RPM'S OF IDLING TO BEAR.    ADDITIONAL DETAILS - WHILE EXITING THE HIGHWAY, BUT STILL ON THE EXIT RAMP, I WAS INVOLVED IN A MULTI CAR (4) ACCIDENT THAT I BELIEVE (AS I DID OVERHEAR CONVERSATIONS FROM THE OTHER DRIVERS BUT BEING THE 4TH VEHICLE OUT OF 4, I DID NOT EYEWITNESS THIS MYSELF) MAY HAVE BEEN CAUSED BY AN AGGRESSIVE DRIVER WHO CUT OFF ANOTHER DRIVER IN FRONT OF THE 4 OF US AND THIS ACTION INEVITABLY CAUSED THE 4 OF US BEHIND HIM TO SLAM ON OUR BRAKES. UNFORTUNATELY, THINGS HAPPENED SO QUICKLY THAT I WAS NOT ABLE TO AVOID HITTING THE CAR IN FRONT OF ME.",
        "vin": "1C4RJFBG9KC"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "01/21/2020",
        "dateOfIncident": "09/02/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300995,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEP 2, 2019 WHILE TRAVELING STRAIGHT AT AROUND 60MPH THE STEERING WHEEL TURNED SLIGHTLY TO THE LEFT AND LOCKED IN THAT POSITION FOR A FEW SECONDS, ALMOST CAUSING A DEADLY CRASH ON THE FREEWAY AS THE VEHICLE ALMOST HIT THE CEMENT DIVIDER. I APPLIED FORCE TO TURN THE WHEEL IN THE OTHER DIRECTION, TO NO AVAIL FOR A FEW SECONDS, BUT THEN WHEN THE WHEEL \"UNLOCKED\" IT CLICKED AND THE CAR SWERVED TO THE RIGHT, CAUSING US TO ALMOST SPIN AROUND. I HELD THE WHEEL AS STRAIGHT AS I COULD, BUT WE DID GET INTO A COLLISION WHEN THE CAR WAS ALREADY STRAIGHTENING BACK. I REQUESTED MAINTENANCE RECORDS FROM AVIS, THE RENTAL COMPANY, BUT THEY DENIED RELEASING THEM. CAN SOMEONE PLEASE COMPEL THEM TO RELEASE MAINTENANCE RECORDS FOR THIS VEHICLE? WE ALMOST DIED THAT DAY AND THEY WON'T TAKE ANY RESPONSIBILITY FOR THE FAULTY STEERING MECHANISM. AVIS IS ACTUALLY ATTEMPTING TO COLLECT MONEY FROM ME FOR THE DAMAGES BUT WON'T RELEASE THE RECORDS.     THANK YOU!",
        "vin": "1C4RJEBG9KC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/02/2019",
        "dateOfIncident": "11/27/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286295,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO NOT WORKING PROBLEM WITH U CONNECT , CAR PARKED IN DRIVEWAY",
        "vin": "1C4RJFBG3KC"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/07/2019",
        "dateOfIncident": "06/18/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278658,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK MY CAR TO THE DEALER BECAUSE THE SUNROOF IS LEAKING THEY TRIED  TO FIX IT TWICE FAILED THE SECOND TIME I TOOK IT THE COMPLETE DRIVERS SIDE FLOOR  OF MY VEHICLE WAS  WET THEY SAID THE REASON WHY IT WAS WET BECAUSE IT THE SUNROOF BOLTS HAD RUSTED IT IS LESS THAN A YEAR OLD AND ALREADY HAS RUST .",
        "vin": "1C4RJECG8KC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/27/2019",
        "dateOfIncident": "10/24/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11271404,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STRUCT POLE ON PASSENGER SIDE, AT APPROXIMATELY 40 MPH, AND SIDE AIR BAGS DID NOT DEPLOY.  EXTENSIVE DAMAGE TO THE ENTIRE PASSENGER SIDE INCLUDING DOOR INTRUSION INTO THE CABIN.  BOTH MAJOR SUPPORT PILLARS WERE BENT AND SIDE WINDOWS SHATTERED.",
        "vin": "1C4RJECG0KC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/25/2019",
        "dateOfIncident": "10/24/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271000,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 JEEP GRAND CHEROKEE. WHILE THE VEHICLE WAS PARKED, THE CONTACT DISCOVERED THAT THE HEADLIGHT COVERS WERE CRACKED. THE CONTACT WAS CONCERNED THAT THE HEADLIGHTS MAY OVERHEAT AND CAUSE A FIRE. THE VEHICLE WAS TAKEN TO ELGIN CHRYSLER DODGE JEEP RAM (1010 E CHICAGO ST, ELGIN, IL 60120, (847) 697-0900) WHERE THEY INFORMED THE CONTACT THAT THERE WAS NO FAILURE AND SHE WAS AT FAULT. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 15,000.",
        "vin": "1C4RJFAG8KC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/21/2019",
        "dateOfIncident": "10/16/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269956,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 JEEP GRAND CHEROKEE. WHILE DRIVING 72 MPH, THE CONTACT HEARD AN ABNORMAL BANG NOISE AND THE VEHICLE STALLED. THE VEHICLE WAS ABLE TO RESTART AND WAS DRIVEN TO TALLAHASSEE DODGE CHRYSLER JEEP RAM FIAT (3987 W TENNESSEE ST, TALLAHASSEE, FL 32304, (844) 280-9221) WHERE IT WAS DIAGNOSED THAT THE TRANSMISSION NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 3,300.",
        "vin": "1C4RJFBG6KC"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/09/2019",
        "dateOfIncident": "10/04/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267234,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE HIGHWAY, IT BEGAN BEEPING THE CHECK ENGINE LIGHT CAME ON AND  THE VEHICLE SHUT OFF. I TRIED TURNING TURNING THE VEHICLE OFF AND BACK ON, BUT AS SOON AS I PUT IT INTO DRIVE THE CHECK ENGINE LIGHT CAME BACK ON AND THE CAR STARTED BEEPING AGAIN. FROM SPEAKING WITH FELLOW JEEP OWNERS (ALL DIFFERENT MODELS) THIS PROBLEM SEEMS PRETTY COMMON AND UNSAFE. THE CAR ONLY HAS 5700 MILES ON IT. TOTALLY UNEXPECTED WHEN SPENDING SO MUCH MONEY ON A BRAND NEW CAR.",
        "vin": "1C4RJFAG9KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/08/2019",
        "dateOfIncident": "10/05/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267108,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS PURCHASED NEW IN MAY 2019 CURRENTLY HAS 2700 MILES ON THE ODOMETER. I WAS TRAVELING ALONG THE HIGHWAY AND BEGAN HEARING A LOUD NOISE THAT SEEMED TO BE EMANATING FROM MY UNDERCARRIAGE. I DROVE TO FIRST OFF-RAMP TO INSPECT AND DISCOVERED A PART OF THE BRAKING SYSTEM HAD BROKEN. THE VEHICLE WAS NO LONGER DRIVABLE AND HAD TO BE TOWED TO A DEALERSHIP. LATER, THE SERVICE WRITER INFORMED ME THAT A CALIPER HAD BROKEN AND THAT DAMAGES WOULD BE COVERED UNDER WARRANTY. I WAS NOT PROVIDED WITH A CAUSE FOR THIS FAILURE.",
        "vin": "1C4RJFAGXKC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/08/2019",
        "dateOfIncident": "10/07/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267130,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED A 2019 JEEP GRAND CHEROKEE 1 MONTH AGO THAT HAD LESS THAN 3,000 MILES ON IT. YESTERDAY WHEN DRIVING HOME FROM WORK, WE WERE GOING ROUGHLY 40 MILES AN HOUR WHEN THE CAR CAME OUT OF GEAR AND LOST ALL POWER TO THE WHEELS. PULLED THE CAR TO THE SIDE OF THE FREEWAY AND TRANSMISSION LOCKED UP . HAD VEHICLE FLATBEDDED TO DEALERSHIP WHERE THE TRANS HAD TO BE MANUALLY DISENGAGED TO GET OF THE TOW VEHICLE. THIS VEHICLE HAS 4,000 MILES ON IT.",
        "vin": "1C4RJFAG4KC"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/01/2019",
        "dateOfIncident": "09/27/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265520,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "27 DAYS AFTER THE PURCHASE OF VEHICLE  BATTERY WENT COMPLETELY DEAD AND NEEDED TO BE REPLACED. ON THE 3RD DAY AFTER THIS REPAIR, \" CHECK ENGINE\" LIGHT WENT ON",
        "vin": "1C4RJFBGXKC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/23/2019",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257475,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SHIFTS HARD AND ROUGH. MAINLY SHUTTERS THE ENTIRE CAR WHEN THE AUTOMATIC TRANS DOWNSHIFTS FROM 3-2-1 GEARS. VERY NOTICABLE FROM 2-1 GEAR. WILL ALMOST SURGE/JUMP THE CAR FROM THESE TWO GEARS. THIS CAN BE A HAZARD AS IF I WAS TO STOP FAST IT WILL JERK THE ENTIRE CAR AND ALMOST LUNGES THE CAR FORWARD WHEN DOING SO. THIS CAR WAS BOUGHT JULY 27TH, 2019, WITH 2K MILES ON IT. TOOK IT INTO THE DEALER AND OF COARSE THEY DENY ANY ISSUE AS THEY WOULD BE OUT THOUSANDS OF LABOR DOLLARS IF THEY WERE TO FIX 1 CAR. SO IT'S TOO EASY FOR THEM TO PASS OFF THAT IT'S FINE.",
        "vin": "1C4RJFCT6KC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/21/2019",
        "dateOfIncident": "08/19/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245504,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 JEEP GRAND CHEROKEE. WHILE DRIVING APPROXIMATELY 5 MPH, A WARNING INDICATOR APPEARED, NOTIFYING THE CONTACT TO PULL OVER WITHIN THE NEXT FIFTY MINUTES. THE VEHICLE STALLED AND WAS UNABLE TO RESTART. ROADSIDE ASSISTANCE WAS CONTACTED AND THE VEHICLE WAS TOWED TO LARRY HILLIS CHRYSLER DODGE JEEP RAM FIAT (3211 N WESTWOOD BLVD, POPLAR BLUFF, MO 63901, (573) 785-5769). THE DEALER STATED THAT THE BATTERY WAS SEVERELY DISCHARGED. THE BATTERY WAS REPLACED. THE MANUFACTURER WAS NOT INFORMED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 2,321.",
        "vin": "1C4RJFBG8KC"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/16/2019",
        "dateOfIncident": "07/25/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244490,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TODAY MAKES THE 3RD TIME IVE HAD MY CAR AT THE DEALERSHIP. 1ST TIME THEY SAID IT BLEW A FUSE. THIS IS AFTER I GOT A MESSAGE THAT MY AIR SUSPENSION NEEDED SERVICING IMMEDIATELY.THAT LASTED OVERNIGHT. TOOK IT BACK THE NEXT DAY. I WAS TOLD IT WAS A FACTORY DEFECT. PAINT OVERSPRAY, LOOSE WIRING. THEY FIXED THAT. IT LASTED A FEW DAYS. THEN AS I WAS ABOUT TO LEAVE TOWN. I GOT THE MESSAGE AGAIN. I WAS TOLD IT WAS OK TO DRIVE. SO I DID..TODAY I TOOK IT BACK IN. NOW THE DEALERSHIP IS TRYING TO GET ME TO TRADE MY CAR. WHICH WILL COST ME MORE MONRY. WE SHOULDNT HAVE TO PAY ANYMORE MONEY OUT OF POCKET..AND OUR PYTS WILL GO UP. THIS MESSAGE HAPPENS AS CAR IS MOVING. ITS SUPPOSED TO BE RAISING UP.",
        "vin": "1C4RJFLG5KC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/08/2019",
        "dateOfIncident": "08/07/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242453,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE VEHICLE NEW LAST WEEK AND THE COLLISION AVOIDANCE SYSTEM DOESN'T WORK. I RETURNED THE CAR TO COLONIAL DODGE-JEEP IN HUDSON, MA YESTERDAY WITH 130 MILES ON THE CAR THEY VERIFIED THAT DOESN'T WORK, BUT DO NOT HAVE ANY 'FIX' FOR IT.",
        "vin": "1C4RJFLG0KC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/05/2019",
        "dateOfIncident": "08/04/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241669,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE WAITING STATIONARY TO TURN ON A CITY STREET, THE CAR WAS IN THE AUTO START/STOP MODE. AS SOON AS I TOOK MY FOOT OF THE BRAKE TO BEGIN TURNING, THE CAR COMPLETELY SHUT OFF AND STARTED FLASHING WARNGING LIGHTS AND CYCLING THROUGH SEVERAL WARNINGS LIKE FCW INDICATOR DISABLED. THE CAR ALSO TOLD ME THE LANE DEPARTURE SENSOR WAS TURNED OFF AS WELL. THE CAR CONTINUED TO FLASH THESE LIGHTS AND CYCLE THROUGH MULTIPLE OTHER WARNINGS AND REFUSED TO SHUT OFF. AT ONE POINT THE CAR EVEN TURNED ON THE WINDSHIELD WIPER BLADES BY ITSELF.",
        "vin": "1C4RJFLG2KC"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/15/2019",
        "dateOfIncident": "06/15/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220380,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE CAR WITH 750 MILES THE ELECTRONIC STABILITY CONTROL, ABS, CHECK ENGINE, BRAKE SERVICE ANTILOCK BRAKE SYSTEM LIGHTS ALL COME ON. WHILE DRIVING NOTICED CAR WASNT TRACKING MILES THEN DIED ON THE INTERSTATE AT APPROXIMATELY 70 MILES PER HOUR.",
        "vin": ""
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/07/2019",
        "dateOfIncident": "06/04/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218506,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 JEEP GRAND CHEROKEE. WHILE DRIVING AT UNKNOWN SPEEDS, THE CONTACT NOTICED THAT THE FRONT PASSENGER WINDOW WAS CRACKED. THE VEHICLE WAS TAKEN TO GRIFFIN MOTORS CHRYSLER DODGE JEEP KIA (9576 MERCER PIKE, MEADVILLE, PA 16335  (814) 333-4618) WHERE IT WAS DIAGNOSED THAT THE GLASS NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED DUE TO THE PARTS BEING ON BACK ORDER. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 2,000.",
        "vin": "1C4RJFBG1KC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/02/2019",
        "dateOfIncident": "06/02/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217375,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "STOP/START SYSTEM WARNING LIGHT  WHEN THE CAR WAS STATIONARY AT A TRAFFIC LIGHT THE CAR TURNS OFF AT STOP LIGHT AND DOES NOT RESTART AS IT IS SUPPOSED TO WHEN THE ACCELERATOR IS PUSHED. ALL ITEMS ON THE SHIFT INDICATOR BEGIN TO FLASH. CAR MUST BE TURNED OFF AND RESTARTED.  THE STOP/START SYSTEM WARNING LIGHT STAYS ON. THIS HAS HAPPENED THREE TIMES AND IS EXTREMELY DANGEROUS.",
        "vin": "1C4RJFBG1KC"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/02/2019",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217402,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE JEEP GRAND CHEROKEE CAME WITH 20 INCH TIRES.  THE \"FULL SIZE SPARE\" IS ONLY 18 INCH.  THE INTERNET SAYS HAVING 2 DIFFERENT SIZE TIRES CAN BE DANGEROUS FOR DRIVING AND /OR DAMAGING TO THE DIFFERENTIAL.  JEEP SHOULD BE MADE TO GIVE A VALID FULL SIZE SPARE TIRE.  THE CUSTOMER HAS TO PAY EXTRA FOR THE 'FULL SIZE SPARE'.",
        "vin": "1C4RJFJT1KC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/28/2019",
        "dateOfIncident": "05/27/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210365,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STALLS WHEN DECELERATING. HAPPENED ON RESIDENTIAL STREETS ONLY AS WE REFUSED TO TAKE THE HIGHWAY FOR FEAR OF AN ACCIDENT. ALTHOUGH THIS IS FOR THE JEEP CHEROKEE THIS DESCRIBES THE INCIDENT PERFECTLY: HTTPS://WWW.FREEP.COM/STORY/MONEY/CARS/CHRYSLER/2018/10/31/2-4-LITER-2019-JEEP-CHEROKEES-RECALL-STALLING/1836821002/",
        "vin": "1C4RJFBG8KC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/24/2019",
        "dateOfIncident": "03/26/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209702,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 JEEP GRAND CHEROKEE. WHILE DRIVING AT ANY SPEED, THE PASSENGER SIDE AIR BAG DID NOT RECOGNIZE WHEN THE PASSENGER SEAT WAS OCCUPIED. THERE WAS NO WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO FIVE STAR CHRYSLER DODGE JEEP RAM OF MACON (478-287-1907, LOCATED AT 3068 RIVERSIDE DR, MACON, GA 31210) WHERE THE VEHICLE WAS KEPT FOR A WEEK. THE TECHNICIAN WAS UNABLE TO DUPLICATE THE FAILURE AND THE FAILURE RECURRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND ASSIGNED A CASE MANAGER. THE MANUFACTURER REFERRED THE CONTACT TO THE DEALER. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 350.",
        "vin": "1C4RJEAG3KC"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/16/2019",
        "dateOfIncident": "05/10/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207964,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE LOST POWER ON HIGHWAY @ 65 - 70 MPH. OPERATOR WAS USING CRUISE CONTROL TO INCREASE AND DECREASE SPEED IN HEAVY TRAFFIC. OPERATOR PRESSED THE CRUISE OFF BUTTON AND THE VEHICLE LOST POWER TO IDLE AND WOULD NOT ACCELERATE. OPERATOR PULLED OVER AND SWITCHED THE VEHICLE ON AND OFF SEVERAL TIMES OVER ABOUT 5 MINUTES  BEFORE VEHICLE WOLD OPERATE NORMALLY AGAIN.",
        "vin": "1C4RJEBG3KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "04/29/2019",
        "dateOfIncident": "04/16/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204418,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT LEASES A 2019 JEEP GRAND CHEROKEE. WHILE THE CONTACT WAS ACCELERATING FROM A STOP, THE PRECEDING VEHICLE STOPPED SUDDENLY. THE CONTACT DEPRESSED THE BRAKE PEDAL, BUT THE BRAKES FAILED TO ENGAGE. AS A RESULT, THE CONTACT REAR ENDED THE PRECEDING VEHICLE. A POLICE REPORT WAS FILED AND THERE WERE NO INJURIES. THE CONTACT TOOK THE VEHICLE TO BAYSIDE CHRYSLER JEEP DODGE (212-19 NORTHERN BOULEVARD, BAYSIDE, NEW YORK 11361, 718-229-8700) WHERE IT WAS DETERMINED THAT THE BRAKES PERFORMED NORMALLY AND NO FAILURE WAS FOUND. THE MANUFACTURER WAS NOT CONTACTED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 23,000.",
        "vin": "1C4RJFBG3KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/29/2019",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204533,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WE LEASED A NEW 2019 JEEP GRAND CHEROKEE LTD ON FEBRUARY 1, 2019.  AROUND THE BEGINNING OF APRIL WE NOTICED THAT THE BRAKE PEDAL HAD TO BE DEPRESSED FURTHER THAN WHEN IT WAS NEW TO STOP THE VEHICLE. EACH WEEK IT WAS GETTING WORSE TO THE POINT WHERE NOW IT GOES ALL THE WAY TO THE FLOOR AND DOES NOT STOP WITH CONFIDENCE. WE HAVE STOPPED DRIVING IT BEFORE IT FAILS COMPLETELY. WAITING FOR SERVICE APPOINTMENT WITH THE DEALER.",
        "vin": "1C4RJFBG5KC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/05/2019",
        "dateOfIncident": "04/02/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194089,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "REFER TO COMPLAINT #1184392 2019 JEEP GRAND CHEROKEE.(1) AFTER TCM REPLACED AT 1300 MILES 3/1/2019. (2) INTERNAL VALVE BODY KIT INSTALLED IN TRANSMISSION 1456 MILES   3/12/19 TO 3/22/19 PARTS HAD TO ORDER. (3) TRANSMISSION ORDERED 4/3/19 @ 1589 MILES.IN SERVICE DATE 10/11/2018. TOOK DELIVERY 10/13/2018. AFTER ALL THIS TROUBLE I WAS DRIVING NORMAL CITY ROAD APRIL 2,2019 VEHICLE WOULD BANG THUMP LIKE BACKLASH AFTER COMPLETE STOP IN TRANSMISSION FELT IN ENTIRE VEHICLE. THE VEHICLE FELT LIKE NO GAS RESPONSE TO MOVE IN GEAR THEN. I CAME TO STOP AT LIGHT TO TURN LEFT CAR IN DRIVE RUNNING.VEHICLE WOULD NOT MOVE AT ALL. STUCK DEAD IN ROAD. AFTER TRYING EVERYTHING TO MOVE VEHICLE I GOT OFF 3 LANE ROAD TO DRIVEWAY OF SENIOR RESIDENCE HOME.VEHICLE RUNNING TO STAY WARM IT DID IT AGAIN WOULD MOVE IN ANY GEAR. FLATBED CAME TO TAKE TO DEALER SINCE THEY JUST DID VALVE KIT IN TRANSMISSION 13 DAYS PREVIOUS AND 156 MILES APPROXIMATELY.) AFTER ALL THESE EXPERIENCES I'VE HAD IN LITTLE TIME AND MILEAGE OCCURED THIS NEW 2019 JEEP GRAND CHEROKEE IS UNSAFE WITH ALL THESE TRANSMISSION TROUBLES. TRANSMISSION NEVER KNEW WHEN TO SHIFT NORMAL SINCE 1000 MILES. EROTIC SHIFT WITH NOICE AND THUMP AFTER STOPPING , FEELS LIKE NO GAS TO MOVE VEHICLE IN GEAR DRIVING. TOOK A TURN AND FELT LIKE OUT OF GEAR NO RESPONSE IN GAS FUEL PEDAL, TIMES OF ACCELERATION IT WOULD LAG THEN EXTREME TAKE OFF AND JOLT YOU FORWARD. SHALL BE ALSO REGISTERING COMPLAINT WITH FCA AND ISSUE OF NEW CAR LEMON LAW.",
        "vin": "1C4RJFAG1KC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/19/2019",
        "dateOfIncident": "03/17/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11189874,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GAS PEDAL BECAME STUCK WHEN I WAS DRIVING AROUND LOCAL STREETS.  I WAS STOPPING MY TRUCK BECAUSE I WAS COMING UP TO AN INTERSECTION.  WHEN I LIFTED MY FOOT FROM THE GAS PEDAL IT DID NOT COME UP.  ALMOST AS IF THE CRUISE CONTROL WAS ENGAGED.  IT WAS SCARY AND I WENT A LITTLE TOO FAR INTO THE INTERSECTION WITH MY FOOT ON THE BRAKE.",
        "vin": "1C4RJFBG0KC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/17/2019",
        "dateOfIncident": "03/17/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187361,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CONTINUALLY GETTING LOW VOLTAGE ISSUES DESPITE HAVING IT \"FIXED\" AT THE DEALER. PARKING BRAKE WON'T TURN OFF.",
        "vin": "1C4PJMLX6KD"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/09/2019",
        "dateOfIncident": "02/15/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185518,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DUE TO ISSUES WITH RADIO'S CORE SOFTWARE, THE DISPLAY OF THE CAR WHICH CONTROL ALL VITAL FUNCTIONS OF THE CAR INCLUDING TEMPERATURE CONTROL GOES INACCESSIBLE WHILE CAR IS IN MOTION. IT IS ACCESSIBLE ONLY WHEN CAR COMES TO A COMPLETE STOP AND SOFTWARE IS ALLOWED TO REBOOT WHICH TAKES MORE THAN 20 MINUTES. THIS IS SO AGAINST THE SAFETY BECAUSE THE MAIN CORE CONTROLLING UNIT OF THE CAR IS OF NO USE DUE TO THIS PROBLEM. THERE IS NO DEFINITE SOLUTION AND ANSWER BY THE DEALERSHIP, SERVICE BRANCH, UNCONNECT CUSTOMER CARE AND STAR TICKET SYSTEM. THE CAR GOT INTO THIS ISSUE WITHIN 24 HOURS OF LEASING IT AND IS A BRAND NEW 2019 MODEL.",
        "vin": "1C4RJFBG4KC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/05/2019",
        "dateOfIncident": "02/05/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184392,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON STARTUP WHEN COLD. TRANSMISSION IS WEIRD HARD SHIFTS. SEEMS TO NOT KNOW WHAT GEAR TO BE IN. SUDDEN STOP IN TRANSMISSION BETWEEN 1ST. AND 2ND. GEAR.VEHICLE AT 1300 MILES TOOK TO DEALER THEY TEST DROVE ONE MILE (1) ADVISED ME OF TSB REPORT FROM JEEP IN MOTION WITH TRANSMISSION. ADJUSTMENT TO CONTROL SHIFT IS EVEN WORSE THAN BEFORE. JERKY AND ALMOST DEAD DROP IN TRANSMISSION ON BRAND NEW VEHICLE IS HARD TO BELIEVE. LIKE TO SEE TSB REPORT. 20 PLUS YEARS AUTO MECHANIC MYSELF.DEALER DID EXPERIENCE THE TROUBLE I HAVE WITH VEHICLE. IN A ONE MILE ROAD TEST. DEALERSHIP DID NOT CLOSE OUT WORK ORDER. WILL MAIL ME COPY OF WORK ORDER. STILL WAITING SINCE FEBUARY 28.2019 SERVICE.",
        "vin": "1C4RJFAG1KC"
    }
]