[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/26/2022",
        "dateOfIncident": "03/18/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458448,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "We own 2 2019 Kia optimas, one my 20yr old daughter drives. On her way to school she smelled a burning smell. On her way home at a dangerous intersection she smelled a strong burning smell & the car just stopped. I told her to get out of the car quickly, she had to climb to the right side as it was too unsafe to exit from the left. Thankfully she wasn’t on a 55 mile/hr road bc it just stopped abruptly & surely would have been hit as brake lights would not have warned. The car was towed to the dealership where it was purchased & under warranty on Friday 3/18/22. Saturday 3/19/22 I went to inquire what happened & was told by the service advisor that it started once, there was a burning smell coming from the engine & the engine was only running on 2 cylinders & stopped. He said they created a ticket, which I came to know that they were conferring with Kia engineers by Kia consumer affairs & I also created a case with. We did research & found a class action suit that was settled describing the exact problem that we experienced, however bc it was settled, Kia was never had to issue a broad recall, so if your 2019 optima experienced this very serious problem of engine failure & fires after 11/30/2021, they say Kia will be handling the cases on a rolling basis, however we just got the run around & the car remains there today 3/26/22 unfixed & the dealership is trying to say it’s just a fuel pump & if that was the case, they wouldn’t need 8 days waiting for Kia engineers to be fixed. In the settlement, Kia was also noted to be denying proper fixes for this serious issue with cars still under warranty. We were denied a rental car & they will not call us. This is my daughter’s life, please help us. The other 2019 Kia Optima that I drive was brought to the same dealership under warranty complaining of the engine sputtering & jumping, they did nothing & said it should be fine however it’s still doing it & my daughter is now driving this potentially dangerous car to school.  This vehicle has been there since 03/18/22 & it’s 03/29/22.",
        "vin": "5xxgt4l35kg"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/17/2022",
        "dateOfIncident": "03/04/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447746,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Refer to all the complaints of the pearl white paint flaking.  I am filing another complaint and the dealership is not helping.  Please help!  https://www.google.com/search?q=kia+pearl+white+paint+recall&rlz=1C5CHFA_enUS970US971&oq=kia+perl+white+pai&aqs=chrome.2.69i57j0i13l2j0i22i30l7.6591j0j4&sourceid=chrome&ie=UTF-8.",
        "vin": "5XXGT4L38KG"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/22/2021",
        "dateOfIncident": "06/01/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444715,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Paint is bubbling and chipping.  When I call the dealer I get voicemails or a sales rep telling me its not covered despite the warranty manual stating it is.",
        "vin": "5XXGT4L38KG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/30/2021",
        "dateOfIncident": "11/30/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442058,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "My car didn't stop the brakes wouldn't stop i hit a stationary Tractor i got a ticket due to me hitting the light pole too",
        "vin": "5XXGT4L34KG"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "11/30/2021",
        "dateOfIncident": "11/15/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442166,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The forward collision system failed in my Kia 2019 optima. I was driving and the lights come on the forward collision lights and the engine turned off I had no control over the vehicle I couldn't even turn the wheel. It turned right on its own and threw me up on a bank and I rolled twice. The car was out of control. I've never been so terrified in my life. The safety measure failed and nearly cost my life. My brakes locked up as well and I'm lucky to be alive.  This was uncontrollable the car was in control and it was wrong. I'm not sure if it was the forward Collison or the traction control and there were no warning lights ever on this was a new vehicle. I have witnesses that seen it someone pulled me out the vehicle bc my doors were locked. The car is currently deemed a total loss by state farm and is in Pulaski at IAA #5409946490. Stock # 31768854. Please help me get this out for other Kia owners the safety issues life or death. There was a police report and I do have pictures. I have reached out to Kia many times and they will not help me or inspect it. I'm at a loss of what to do. Please help me Kia has confirmed safety issues with this model and year with the forward collision error. Although I didn't know this until after the accident and I researched it.",
        "vin": "5xxgt4l31kg"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/29/2021",
        "dateOfIncident": "07/24/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442026,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Optima SXL, 2019,   5,678 miles. When using the air conditioning, liquid on passenger side fills up on my mate about 1/2 inch. Took to dealer Three times. States the hose gets clogged and they have to clear this.  Now car starting to smell like mold/mildew.  Rug is getting wet. They did not want to detail the call. Service person tells me to bring it back and they will unclog it.  But I want it fix not keep coming back to unclog the hose.  They stated this happens all the time.  This sees to be a problem to me. It’s a New Vehicle.    What can I do?",
        "vin": "5XXGV4L26KG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/29/2021",
        "dateOfIncident": "11/13/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442030,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "my car has been broken into and stolen twice by the same people because of how easy it is to steal it (Kia and Hyundai). Kia hasn’t fixed the issue of their car door locks can be busted with a screen driver and the ignition can too. My car has been stolen twice the same way they bust my door lock bust my ignition and steal the car. Kia won’t even acknowledge the issue despite their being many complaints about the same thing happening to other peoples cars. Filed insurance claims both times and both times the car has been recovered",
        "vin": "5XXGT4L31KG"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "11/18/2021",
        "dateOfIncident": "10/28/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440959,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "My daughter hit a deer at 65 mph causing total loss  5 miles prior to the accident the forward collision warning light came on stating it was inactive due to the sensor being blocked or damaged.",
        "vin": "5XXGU4L1XKG"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/15/2021",
        "dateOfIncident": "10/12/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11440481,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Wow",
        "vin": "5XXGT4L36KG"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/15/2021",
        "dateOfIncident": "10/12/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11440501,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Struck by heavy vehicle in an intersection; t-boned in the left front — by the right front of other vehicle which ran a red light. I have numerous injuries to my left side, and I have a damaged heart because none of my airbags deployed during the crash. The corner where I moved from when the traffic signal turned green has a severely blocked view where I sat at a red light. There’s a highway barrier fence that stretches alongside the road I was traveling, and this fence extends beyond the stop line for that traffic signal; it even stretches up to the sidewalk/crosswalk. That fence is completely covered with the heavy cover of vegetation/vines. Even at night, there is no visibility through that fence, can’t even see headlamps of another vehicle at night.",
        "vin": "5XXGT4L36KG"
    },
    {
        "components": "SEAT BELTS,WHEELS,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "10/20/2021",
        "dateOfIncident": "10/20/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437582,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I just think theres some sort of a tech issue with my electronic dashboard.   My passenger seatbelt sign goes on and beeps incessantly when there is no passenger in the seat.   My caution alert button comes on saying I have low tire pressure when it’s only one number less than all the other tires.   My oil change reminder never comes on.   Today I was driving normally and the car in front of me barely tapped their breaks (and I was not close to them at all) and the collision alert started beeping.   My car randomly gets cold and the AC smells like it’s on, but it’s not (the button isn't lit nor did I turn it on)  It normally doesn’t allow me to turn the outside air button on/off. Like in the winter when it’s freezing outside and I wasn’t to press the button to only circulate the inside air in the car, it doesn’t allow me and I have to freeze and be uncomfortable in my own car.",
        "vin": "5XXGT4L31KG"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEAT BELTS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/30/2021",
        "dateOfIncident": "08/01/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434942,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Brakes don't feel right some times when I stop. My passage side seat belt dangs for no reason even when there nothing on my set. And ever once in a blue moon I can hear a dang dang noise idk where it's coming from but it's very soft sound.",
        "vin": "5xxgt4l36kg"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "08/19/2021",
        "dateOfIncident": "08/18/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429801,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Out of no where the Front Collision Avoidance Assist came on while driving as well as the automatic emergency braking sensor came on I had my kids in the car no accident or anything",
        "vin": "5xxgt4l3xkg"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/03/2021",
        "dateOfIncident": "06/01/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423338,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ther are two Problems with my car when my phone is connected via USB to the vehicle the screen turn black and completely shut off while driving the other issue is the forward collision when there’s a car in front of me and I go to put on my for my brakes the car beats and slides rather than breaking",
        "vin": "5XXGT4L34KG"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/09/2021",
        "dateOfIncident": "01/06/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415708,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE HAD THIS CAR GOING ON THREE YEARS SOMETIMES NOT ALL THE TIME I WILL GO TO START IT AND IT WILL BARELY START SO I TOOK IT TO THE DEALERSHIP THREE TIMES WHEN I GOT MY OIL CHANGE AND THEY CHECKED THE BATTERY BUT THEY'RE SAYING THE BATTERY IS GOOD AND THE STARTING SYSTEM THE CAR WILL JUST BE SITTING IN MY GARAGE AND I TRY TO START IT IT JUST SOUNDS LIKE IT'S BARELY STARTING AND THEN THE NEXT TIME I STARTED IT'S FINE",
        "vin": "5XXGT4L35KG"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/28/2021",
        "dateOfIncident": "03/15/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414291,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CARS USB PORT ALWAYS DISCONNECTS FROM THE CELL PHONE CORD. IT CUTS OFF MY SIRISXM AND MAPS. I HAVE TO RE-PLUG IN THE CELL CORD TO HAVE THE THINGS COME BACK ON. THIS HAPPENS WHILE THE CAR IS MOVING BOTH ON CITY AND HIGHWAY.    WHEN I WAS AT A KIA DEALERSHIP THERE WAS SOMEONE ELSE THAT HAD THE SAME PROBLEM. THE CELL PHONE STORE SAID THEY RECEIVE COMPLAINTS ABOUT FROM THEIR OTHER CUSTOMERS. NOT SURE WHEN IT STARTED. IT SEEMS LIKE SINCE I BOUGHT IT. THERE ARE OVER 120,000 MILES ON MY CAR.     OVER THE SMALLEST BUMP THIS CAN HAPPEN. IF I PUT MY CELL ON MY CAR WINDOW HOLDER IT HAPPENS LESS FREQUENTLY. I HAVE BOUGHT NEW CORDS AND A NEW CELL AND IT STILL HAPPENS.",
        "vin": "5XXGT4L39KG"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/28/2021",
        "dateOfIncident": "04/17/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414358,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING UP A HILL AND AS I REACHED THE TOP OF THE INCLINE, MY CAR STOPPED ACCELERATING. I THEN ATTEMPTED TO USE MY BRAKES AND I BARELY TAPPED THEM, BUT THEY REACTED AS IF I SLAMMED ON MY BREAKS. I TOOK MY FOOT OFF OF THE BRAKES AND I BEGAN ROLLING BACKWARDS EVEN THOUGH MY CAR WAS STILL IN DRIVE. MY BRAKES WERE THEN LOCKED, I PUT MY CAR IN PARK AND THEN TURNED OFF & THEN BACK ON MY CAR WITHOUT REMOVING THE KEY. I THEN PUT MY CAR BACK INTO DRIVE, HOWEVER, MY GAS PEDAL WAS STILL NOT WORKING. I THEN TURNED MY CAR OFF AGAIN, REMOVED THE KEY, PUT THE KEY BACK, THEN RESTARTED AND WENT BACK INTO DRIVE AND IT BEGAN TO WORK AGAIN. THERE WAS NOT AN ISSUE AFTER THAT.",
        "vin": "5XXGT4L37KG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/03/2021",
        "dateOfIncident": "01/26/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398991,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKES DID NOT ENGAGE WHEN APPLIED.  THE ROAD WAS DRY. SPEED WAS 30 MPH OR LESS WHEN I ATTEMPTED TO STOP AT A LIGHT. THERE WERE NO CARS AHEAD OF ME, AND I HAD PLENTY OF TIME AND ROOM FOR A REGULAR STEADY DECELERATION.  THE BRAKES DID NOT ENGAGE.  JUST BEFORE I CROSSED INTO THE CROSSWALK THE CAR BEGAN TO BUCK AND THE BRAKE PEDAL FORCIBLY KICKED BACK EXACTLY FOUR TIMES, AND THE CAR FINALLY CAME TO A STOP.  THIS HAPPENED ON A STATE HIGHWAY THAT ALSO SERVES AS A MAIN STREET RUNNING THROUGH DOWNTOWN.  I WAS TRAVELING ON A STRAIGHT SECTION OF ROAD.  I HAD THE CAR TOWED TO THE DEALERSHIP.  I HAVE OWNED THE CAR, PURCHASED NEW, FOR 19 MONTHS.  MILEAGE IS 17,325.  THE DEALERSHIP CAN FIND NOTHING WRONG AND SAYS THE COMPUTER DIDN'T REGISTER THE EVENT.  WE ASSUME THE BRAKES FAILED AND ANTILOCK BRAKES ENGAGED IN AN EXTRORDINARY MANNER.  I HAVE NO DOCUMENTATION AS THE CAR IS STILL IN THE SHOP 37 ODD DAYS LATER. THEY STILL SAY THEY HAVE NO IDEA WHAT MALFUNCTIONED.",
        "vin": "5XXGT4L38KG"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "01/27/2021",
        "dateOfIncident": "09/27/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11390394,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNED A 2019 KIA OPTIMA. THE CONTACT STATED THAT WHILE UPON MAKING A LEFT TURN AT 20 MPH, THE AUTOMATIC EMERGENCY BRAKING SYSTEM INDEPENDENTLY ACTIVATED AND ABRUPTLY STOPPED WITHOUT WARNING. DUE TO THE FAILURE, THE VEHICLE BEHIND HIM HIT HIM FROM BEHIND WHICH PUSHED HIS VEHICLE INTO A 270 DEGREE ANGLE. THE CONTACT STATED THAT THE PASSENGER SIDE AIRBAGS DEPLOYED; HOWEVER, HIS DRIVER SIDE AIRBAGS DID NOT. THE CONTACT STATED THAT HE HAD HIT HIS HEAD ON THE DRIVER SIDE VISOR; HOWEVER, HE DID NOT SEEK MEDICAL ATTENTION FOR THE INJURY. A POLICE REPORT WAS FILED AT THE SCENE. THE VEHICLE WAS TOTALED AS A RESULT OF THE ACCIDENT AND WAS TOWED TO HIS INSURANCE COMPANY'S COLLISION CENTER. THE DEALER NOR THE MANUFACTURER HAD YET TO BE NOTIFIED OF THE FAILURE. THE VEHICLE HAD BEEN DESTROYED. THE FAILURE MILEAGE WAS APPROXIMATELY LESS THAN 200. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/30/2020",
        "dateOfIncident": "07/08/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377227,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED ON MY 2019 KIA OPTIMA ON 6/19. AND SINCE THEN OFF AND ON THE CAR HAS EXPERIENCE INTERMITTENT STARTING ISSUES. NOW I HAVE TAKEN THE CAR TO TWO DIFFERENT DEALERS AND NEITHER ONE CAN FIND THE PROBLEM. WHEN PRESSING THE STOP/START BUTTON THE CAR WOULD HESITATE TO START NO LIGHTS OR CODES ARE STORED IN THE COMPUTER. I HAVE CONTACTED KIA ABOUT THE ISSUE ALL I WAS EVER TOLD WAS TAKE IT TO THE DEALER AND LET THEM INSPECT IT. THE DEALER WOULD RESET AND UPDATE FIRMWARE. THAT WOULD LAST FOR A MINUTE BUT EVENTUALLY THE CAR WOULD GO BACK INTO THE SAME THING OF HESITATING. THE CAR HAS BEEN INTO THE DEALERSHIP MULTIPLE TIMES FOR THE SAME ISSUE KIA HAS OPENED CASE AFTER CASE BUT NO SOLUTION. THE CAR IS CONSIDERED A LEMON BY STATE STATUES. NOT ONE TIME HAS KIA OFFERED TO TAKE THE VEHICLE THE ONLY THING I'M TOLD THAT IF IT HAPPENS AGAIN BRING IT BACK. I WOULD SPEND MORE AND MILES TAKING THE CAR TO THE DEALERSHIP. THERE IS ALSO AN ISSUE WITH THE WHEEL ALIGNMENT THE LEFT REAR WHEEL ALWAYS NEED TO BE ALIGNED I'M NOT SURE WHY BUT WHEN I TAKE THE CAR FOR AN ALIGNMENT THAT WHEEL IS ALWAYS OUT OF SPECS.",
        "vin": "5XXGT4L3XKG"
    },
    {
        "components": "UNKNOWN OR OTHER,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "11/24/2020",
        "dateOfIncident": "11/23/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376125,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "LAST NIGHT A WARNING MESSAGE POPPED UP THAT SAID THERE WAS AN ISSUE WITH THE FRONT CRASH COLLISION SENSOR AND IT WAS TURNING OFF.  THE WARNING LIGHTS STAYED ON WHILE DRIVING HOME AND THIS MORNING IT WAS OFF BUT POPPED BACK UP AFTER AROUND 15 MINUTES OF DRIVING.",
        "vin": "5XXGT4L33KG"
    },
    {
        "components": "UNKNOWN OR OTHER,LANE DEPARTURE,FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "11/06/2020",
        "dateOfIncident": "07/26/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11373422,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING ON I 95 WHEN THE VEHICLE PULLED ME INTO THE MEDIAN TOTALING MY CAR.  I WAS UNABLE TO APPLY BRAKES AND UNABLE TO TURN MY STEERING WHEEL IN THE OTHER DIRECTION TO AVOID THE COLLISION.",
        "vin": "5XXGT4L39KG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/30/2020",
        "dateOfIncident": "10/28/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372414,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FROM DAY ONE I'VE BEEN COMPLAINING ABOUT THE DRIVER ASSIST FRONT CAMERA SHUTTING OFF BY ITSELF WHILE I'M DRIVING.  I WAS TOLD BY MY KIA DEALER THAT THERE IS NO PROBLEM.  IT HAS REOCCURRED MANY MORE TIMES SINCE.  IT HAPPENED AGAIN.  THE ORANGE DISPLAY LIGHT GOES OFF.",
        "vin": "5XXGT4L36KG"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/07/2020",
        "dateOfIncident": "09/24/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363214,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "PARKED.  STARTED CAR & ALL DASH LIGHTS LIT UP.  TRIED RESTARTING NO CHANGE.  WHEN BACKING UP THERE WAS NO POWER STEERING.  TURNED OFF IGNITION, PUMPED GAS PEDAL 3 TIMES, RESTARTED & IT SEEMED TO FIX PROBLEM.  TOOK CAR IN FOR ELECTRICAL RECALL 1 WEEK LATER & WAS TOLD THIS MIGHT FIX THE PROBLEM.  2 WEEKS LATER IT OCCURRED AGAIN.  SAME SOLUTION USED WITH SUCCESS.",
        "vin": "5XXGT4L38KG"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/29/2020",
        "dateOfIncident": "08/28/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351939,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON 8/28/2020 AND A WARNING LIGHT CAME ACROSS THE DASHBOARD THAT READ MY FORWARD COLLISION CAMERA WAS NOT WORKING AND IT STAYED LIT FOR ABOUT 3 MINUTES WHILE DRIVING AND EVENTUALLY WENT OFF BEFORE I PARKED THE CAR. I AM AFRAID TO DRIVE THE CAR IF THE BRAES MAY FAIL.THE VEHICLE WAS IN MOTION INITIALLY APPROACHING A STOP LIGHT WHEN THE MESSAGE CAME ACROSS THE DASHBOARD. I WAS ON A CITY STREET DRIVING.",
        "vin": "5XXGT4L39KG"
    },
    {
        "components": "VISIBILITY,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/05/2020",
        "dateOfIncident": "06/05/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327404,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "PANORAMIC SUNROOF EXPLODED WHILE DRIVING 6/5/2020 WHILE IN MOTION  IT HAS BEEN 110 DEGREES IN PHOENIX, AZ FOR THE PAST WEEK.  *TR",
        "vin": "5XXGU4L16KG"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/21/2020",
        "dateOfIncident": "05/21/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325495,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING ON A CITY ROAD AND A CAR STOPPED IN FRONT OF US (WHILE ONLY GOING 25MPH) THEN THE CAUTION FRONT SENSOR LIGHTS CAME ON. THE CAR HAD A NOTIFICATION THAT POPPED UP SAID FRONT CAMERA IS BLOCKED. STAYED ON FOR 5 MINUTES THEN JUST SHUT OFF.  *TR",
        "vin": "5XXGT4L37KG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/29/2020",
        "dateOfIncident": "04/29/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322763,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "HARD STARTING AND WHEN IT DOES START IT ACTS LIKE IT SLUGGISH. YOU CAN TURN IT OFF AND BACK ON AND IT IS FINE.",
        "vin": "5XXGT4L39KG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/09/2020",
        "dateOfIncident": "02/26/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317001,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2019 KIA OPTIMA. IN DECEMBER I WAS GOING UP A HILL AND THE VEHICLE STARTED VIOLENTLY SHAKING. I WAS PRESSING ON THE GAS AND NOT GOING ANYWHERE. I HAD TO PUT IT IN REVERSE TO BACK DOWN 2 RODS TO GET BACK TO MY DRIVEWAY. HAD IT TOWED TO DEALER AND THEY SAID THEY COULD NOT FIGURE OUT WHAT WAS WRONG. IT WAS NOT SHOWING ANY \"CODES\". THEN ON 02/26/2020 THE CHECK ENGINE LIGHT CAME ON. HAD IT TOWED TO KIA DEALER AND THEY SAID IT WAS SHOWING A BUNCH OF CODES. THEY SAID THEY CLEANED THE \"KNOCKER\" AND WAS COMMUNICATING WITH THE TECH LINE AND WAS TOLD TO CLEAR DATA AND RELEARN SYSTEM. ONCE THEY DID THAT THE CHECK ENGINE LIGHT WENT AWAY AND NO MORE CODES DISPLAYED. ON 03/07/2020 THE CHECK ENGINE LIGHT CAME ON AT NIGHT. DEALER WAS CLOSED BY THEN AND THEY ARE CLOSED ON SUNDAY. MADE A CALL TODAY TO GET IT BACK IN THE SHOP. THEY SAID I CAN BRING IT TOMORROW. I SHOULD NOT HAVE THIS MUCH TROUBLE WITH A 2019. PLEASE TELL ME",
        "vin": "5XXGU4L12KG"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/28/2020",
        "dateOfIncident": "02/27/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11312045,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 KIA OPTIMA. THE CONTACT STATED THAT WHILE DRIVING AT 45 MPH AND MERGING ONTO THE HIGHWAY, THE VEHICLE STALLED WITHOUT WARNING. THE CONTACT PUMPED THE ACCELERATOR PEDAL SEVERAL TIMES AND THE VEHICLE RESPONDED. THE VEHICLE WAS NOT TAKEN TO BE DIAGNOSED NOR REPAIRED. NEITHER THE DEALER NOR THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 74,800.",
        "vin": "5XXGU4L17KG"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/27/2020",
        "dateOfIncident": "02/04/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311882,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 KIA OPTIMA, IN JULY OF 2019.1ST INSTANCE, 2/4/2020 (LATE AFTERNOON) I DROVE BACK FROM NEW ALBANY IN AND AS SOON AS I GOT OFF THE FREEWAY ON KEYSTONE, I TRIED TO TURN A CORNER AND THE CEL LIGHT CAME ON FLASHING AND THE CAR WOULD BARELY ACCELERATE (HEAVY HESITATION). THEY SAID DO NOT DRIVE, GET A TOW.I DID, THEY HOOKED IT UP. AN ERROR TO CONTACT KIA ENG. THEY INDICATED ITS 1 OF 2 THINGS, ROCK SENSOR HARNESS/ROCK SENSOR. 1ST THEY SAID THEY WOULD REPLACE THE SENSOR BUT THEY ONLY REPLACED THE HARNESS.MILEAGE ON THIS DATE 2/7/2020 8,801 MILES. PICKED UP MY CAR ON FEBRUARY 7, 2020.  2ND INSTANCE  2/24/2020 @3PM(ISH)- RETURN TRIP TO INDIANAPOLIS FROM LAFAYETTE (ROUND TRIP) APX 2:59P ON THE WAY BACK TO WORK, I GOT OFF IN ZIONSVILLE  TO RUN TO THE STORE. I STOPPED AT THE LIGHT AND TRIED TO TURN RIGHT, THE EXACT SAME SCENARIO AS THE 1ST INSTANCE. CEL LIGHT, MAJOR HESITATION AND VERY LITTLE ACCELERATION. CALLED SERVICE AT KIA TO GET MY RENTAL READY AND I WAS ON MY WAY IN TO THE SHOP. THE RENTAL WAS READY AND IT WAS LATE MONDAY. HE CONTACTED WHO IS THE GM  CALLED ME 2/24/2020 @6:16PM  TO SAY THAT HE WILL LOOK INTO THIS ASAP IN THE MORNING. HE ALSO INDICATED THAT HE IS PART OWNER OF LIA DEALER.ON MONDAY EVENING I CONTRACTED KIA CORP OFFICE TO FILE A CASE # SAME EVENING, I TEXT MY SALESMAN BUT THE GMCALLED 8:07A EXPLAINED ITS ON THE RACK AND THE ENGINEERS HAVE BEEN CONTACTED FOR THE RESOLUTION AND HE WILL CALL ME WHEN THEY KNOW MORE. TUES GM AND  GM OF ALL LOCAL SERVICE DEPTS) CALLED AND EXPLAINED THE ISSUE, ATTEMPT AT A RESOLUTION CHANGE THE SENSOR AND DRIVING 10 MILES TO MAKE SURE IT FIXES IT. HOW IS 10 MILES GOING TO 'TEST' HE AGREED 30 MILE TEST. HE SAID IF THIS SENSOR FAILS THEY (KIA CORP) WILL REPLACE THE ENGINE! WELL THE SENSOR IS WORKING 2 DAYS SO FAR. (LAST TIME IT TOOK 11 DAYS AND 1,177 MILES TO FAIL)  I PICKED UP CAR ON 2/26/20.      L",
        "vin": "5XXGT4L39KG"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/22/2020",
        "dateOfIncident": "02/17/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310756,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MY PHONE IS PLUGGED INTO THE CHARGER, MY SCREEN WILL GO BLACK ALL OF A SUDDEN, AND I HAVE TO TURN THE CAR OFF AND UNPLUG MY PHONE AND TURN THE CAR BACK ON FOR THE SCREEN TO COME BACK ON. ALSO, THERE HAVE BEEN SEVERAL OCCASIONS WHERE MY BRAKES LOCK UP ON ME, AND I ALMOST HIT THE PERSON IN FRONT OF ME. ESPECIALLY IN THE RAIN, AND I HAVE EVEN HAD TO SWERVE OFF THE ROAD TO AVOID A COLLISION. IT HAPPENS WHEN I AM IN MOTION DRIVING AND GO TO STOP. THE RADIO SCREEN THOUGH HAS TURNED OFF ON ME WHETHER I AM DRIVING OR IN PARK.",
        "vin": "5XXGT4L34KG"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/19/2019",
        "dateOfIncident": "12/19/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290177,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "IF I SLOW DOWN THEN SPEED UP IT TAKES OFF SLOW. IF I GO UP A HILL IT PUTTS AND WHEN I DRIVE IT JUST FEELS LIKE ITS PUTTERING THE WHOLE TIME. TOOK IT TO DEALERSHIP OF COURSE THEY DIDN'T FIND ANYTHING BUT THIS IS A NEW CAR I KNOW SOMETHING IS WRONG. I JUST GOT THE CAR IN MARCH DROVE FINE NO ACCIDENTS OR ANYTHING AND IT'S KIND OF DISAPPOINTING THAT MY CAR IS LIKE THIS BUT KNOW ONE KNOWS WHAT'S WRONG.",
        "vin": "5XXGT4L38KG"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/25/2019",
        "dateOfIncident": "11/22/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11282155,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT'S HUSBAND OWNS A 2019 KIA OPTIMA. WHILE DRIVING 50 MPH, THE VEHICLE CRASHED INTO A DEER THAT JUMPED IN THE MIDDLE OF THE ROAD. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS NOT FILED. THE DRIVER SUSTAINED NECK AND BACK PAIN AND HIS DAUGHTER, WHO WAS SEATED BEHIND THE DRIVER'S SEAT, SUSTAINED NECK PAIN. THE CONTACT MENTIONED THAT BOTH OCCUPANTS WOULD BE TAKEN TO THE EMERGENCY ROOM FOR THEIR INJURIES. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE. THE VEHICLE WAS NOT TAKEN TO A DEALER OR INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING OR REPAIRS. THE VEHICLE WAS CURRENTLY WAITING TO BE TOWED TO A LOCAL BODY SHOP FOR REPAIRS. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 3,168.",
        "vin": "5XXGU4L11KG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/20/2019",
        "dateOfIncident": "11/19/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281260,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN TWO LOW SPEED REAR ENDED CRASHES BECAUSE THE CIB DIDN'T ENGAGE AND I HAD NO BREAKING POWER. ONE WHO ON THE HIGH WAY AND ONCE IN AN EXIT RAMP",
        "vin": "5XXGT4L38KG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/17/2019",
        "dateOfIncident": "11/17/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280619,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "LANE SAFETY CONTROL SYSTEM MAKES UNUSUAL TURNS WHILE I'M DRIVING RESULTING ME HAVING TO CORRECT.  IN SOME SITUATIONS VEHICLE ALMOST TURNED INTO CARS IN NEARBY LANE.    INCIDENTS  HAVE HAPPENED BOTH ON SURFACE STREETS AT SPEEDS LESS THAN 55 MILES PER HOUR AND ON THE FREEWAY AT SPEEDS EXCEEDING  55 MILES PER HOUR",
        "vin": "5XXGT4L37KG"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "10/25/2019",
        "dateOfIncident": "10/15/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271129,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS REAR ENDED ON THE FREEWAY. TRAFFIC CAME TO A COMPLETE STOP, BUT THE CAR BEHIND ME WAS GOING 40-50MPH AND DID NOT STOP IN TIME AND REAR ENDED ME AND PUSHED ME INTO THE VEHICLE IN FRONT OF ME. MY AIRBAGS DID NOT DEPLOY.",
        "vin": "5XXGT4L31KG"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/12/2019",
        "dateOfIncident": "03/08/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11268064,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ONE NIGHT ON A RESIDENTIAL STREET AND A DEER RAN OUT IN FRONT OF MY CAR.  I SLAMMED ON MY BRAKES BUT STILL HIT THE DEER WHICH DAMAGED MY FRONT DRIVERS SIDE FENDER AND LIGHTS. I WAS TRAVELING AT 25 MILES PER HOUR. I DIDN'T CALL THE AMBULANCE AT THE TIME BECAUSE I HAD TO GO RIGHT BACK TO WORK.  AT THE TIME I ALSO DID NOT THINK THAT THE ACCIDENT AFFECTED ME BUT I BELIEVE THAT DUE TO THE WHIPLASH FROM SLAMMING ON THE BRAKES THAT IT DID IN FACT DAMAGE MY SPINE.  I KEPT GOING TO THE DOCTOR'S AND HOSPITALS TO SEE WHAT WAS GOING ON WITH MY BODY BUT NONE  OF THEM REALLY HAD ANY DRAINAGE ANSWERS. JUST RECENTLY HAD AN EMERGENCY SURGERY ON MY UPPER BACK.  THE DIAGNOSIS WAS SPINAL STENOSIS.  I HAD NO PRIOR HEALTH PROBLEMS BEFORE THIS INCIDENT. MY AIRBAGS DID NOT DEPLOY UPON IMPACT AND I WANT SOME ANSWERS TO THAT.  ALSO AFTER THIS INCIDENT MY BACK TIRE BLEW OUT ON THE HIGHWAY.  THERE WAS NO SPARE TIRE,   FLARES FOR SAFETY OR ANYTHING WHEN I LOOKED IN MY TRUNK   I AM SURE THIS IS A WHOLE DIFFERENT ISSUE ALL TOGETHER BEFORE ALL OF THIS I HAD FAITH IN KIA AND NOW I DOUBT  THAT KIA  CARES OR IS CONCERNED WITH THE WELL BEING OF BUYING AND PAYING CUSTOMERS.  KIA FINANCIAL TREATED VERY BADLY AS WELL.  MY MOM,  MY DAD AND MY STEP MOTHER ALL DRIVE KIA'S A'S WELL. IS IT TIME FOR US TO SWITCH UP CAR CHOICES?",
        "vin": "5XXGT4L30KG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/22/2019",
        "dateOfIncident": "09/22/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257250,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS LOOKING ON CREDIT KARMA AND READ THERE IS A RECALL ON MY VEHICLE. I HAD NO CLUE AND HAVEN'T HAD ANYONE CONTACT ME IN REGARDS TO THIS! I'M CONCERNED FOR THE SAFETY OF MY FAMILY",
        "vin": "5XXGT4L35KG"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/18/2019",
        "dateOfIncident": "04/27/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244735,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED 2019 KIA OPTIMA EX ON 4/27/2019 FROM A KIA DEALERSHIP IN HAGERSTOWN,MD. AFTER RESEARCH ON THIS WEBSITE WE FIND OUT THAT THERE IS AN INVESTIGATION FOR AIRBAGS NOT DEPLOYING ON THIS VEHICLE IN CRASHES. THIS INVESTIGATION WAS INITIATED BEFORE THE PURCHASE OF THIS VEHICLE. HOW IS A DEALERSHIP ALLOWED TO SELL A VEHICLE WITH A POTENTIAL SAFETY ISSUE? A DEALERSHIP/MANUFACTURER SHOULD HAVE TO LET THE PURCHASER KNOW BEFORE THEY BUY THE VEHICLE. WE WOULD HAVE NEVER PURCHASED THE VEHICLE IF WE WOULD HAVE KNOWN THIS!",
        "vin": "5XXGU4L12KG"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/30/2019",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240697,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 KIA OPTIMA. WHILE DRIVING 40 MPH, THE FIXED PANE GLASS ABRUPTLY FRACTURED. THERE WERE NO INJURIES. THE VEHICLE WAS TAKEN TO AN UNKNOWN DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS CONTACTED. THE FAILURE MILEAGE WAS 3,100. THE VIN WAS INVALID.*BF  *AS",
        "vin": "5XXGT4L33KG"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/27/2019",
        "dateOfIncident": "06/26/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11223068,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY 2019 OPTIMA BRAND NEW BACK IN NOVEMBER. IT IS NOW JUNE AND I HAVE HAD IT BACK TO THE DEALERSHIP 3 TIMES FOR RANDOMLY NOT STARTING ON ME.  I GET THE SAME ANSWER EVERY TIME.  THEY DON'T KNOW WHAT IT IS, NOTHING COMES UP ON THE COMPUTER WHEN THEY PLUG IT IN.  THEY SAY, \"IF IT HAPPENS AGAIN, CALL US AND WELL TAKE IT IN\".  BUYING THIS CAR BRAND NEW AND MY PAYMENTS BEING THAT OF A RANGE ROVER, I AM EXTREMELY UPSET.  TO TOP IT OFF, THE BACK WINDSHIELD IS SLIPPING DOWN.  I AM OVER THIS CAR AND I WILL NEVER BUY ANOTHER KIA AGAIN.  BUT, MY FIGHT IS NOT OVER, SOMETHING WILL HAVE TO BE DONE.   IT ALSO HESITATES AT TIMES, FEELS AS THOUGH IT IS STRUGGLING TO GO.  ALSO, TWO TIMES WHILE I WAS DRIVING THE CAR, THE DASH LIT UP WITH ALMOST EVERYTHING LIKE, I WAS IN A CRASH, THE EXCLAMATION POINT, ETC.",
        "vin": "5XXGT4L36KG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/14/2019",
        "dateOfIncident": "02/11/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186816,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD THIS VEHICLE FOR A LITTLE OVER TWO MONTHS. IT CURRENTLY HAS 1600 MILES ON IT. THE TRANSMISSION WAS REPLACED ONCE AND I AM STILL EXPERIENCING STUDDERING AND SHAKING. HAVE ANOTHER APPOINTMENT ON 3/15. EVEN HAVE KIA CUSTOMER SERVICE INVOLVED.",
        "vin": "3KPF54ADXKE"
    }
]