[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/18/2022",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452851,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "SPRINGDALE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I purchased a 2019 Keystone Springdale RV from The Keystone RV Company in 2019, since then, the vehicle had several recalls from the National Highway Traffic and Safety Administration. I have made several attempts to contact the company but they are not returning my calls and are not offering any type of solution to this matter. The vehicle is unsafe to operate at this time. Please assist.  The recall from NHTSA is listed below:  September 13, 2021 NHTSA CAMPAIGN NUMBER: 21V708000 Propane Regulator May Fail and Cause Fire Increased propane pressure can enlarge the flames in gas appliances, increasing the Additional Information About You (optional) Statement Attorney General's Role risk of a fire.  November 28, 2018 NHTSA CAMPAIGN NUMBER: 18V843000 Insufficient Grease on Bearings may cause Failure If the bearings overheat, the hub may fail, affecting handling and increasing the risk of a crash.  October 15, 2018 NHTSA CAMPAIGN NUMBER: 18V723000 Missing Bearing Races Causing Hub to Overheat If the bearing cup is not installed it could lead to a bearing failure, affecting vehicle handling and increasing the risk of a crash.",
        "vin": "4YDT26026KG"
    },
    {
        "components": "WHEELS,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/04/2022",
        "dateOfIncident": "02/04/2022",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450408,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "SPRINGDALE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 KEYSTONE SPRINGDALE. CONSUMER WRITES IN REGARDS TO PROPANE REGULATOR SAFETY RECALL.  THE CONSUMER STATED THE VEHICLE WAS EMITTING HEAVY SMOKE FROM THE WHEEL AREA. THERE WAS ALSO A STRONG PROPANE ODOR EMITTING FORM THE CONTROL VALVE, CAUSING THE CONSUMER TO EXPERIENCE HEADACHE. THE CONSUMER REQUESTED THE VEHICLE BE BOUGHT BACK AND BE REFUNDED ANY RELATED CHARGES.",
        "vin": "4YDT26026KG"
    }
]