[
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/18/2022",
        "dateOfIncident": "03/29/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457313,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "When cruise control is in place and you brake for traffic, to resume cruise speed if you hold the resume button for more than standard the car resets speed to 20MPH and you have no control on gas pedal.  The only fix is to turn off the card and restart.      We are glad to have it inspected.   This item has put our lives in danger about five times as we were using cruise on the highway traveling 65 plus mph  and cars were coming upon us.   We reported the issue back in March 2021 and several more times back into a KIA dealership.  It took months but they duplicated the problem on our vehicle and so they tested a 2020 Sportage and had the same issue.    The car stalls while on the freeway and KIA dealership states it is normal operating procedures as the resume button should be a quick touch, not a prolonged one.    There are no warning indicators this is going to happen.  The local Kia Dealership states they have contacted KIA Engineers and they are confirming that it is operating within normal parameters.",
        "vin": "KNDPRCA65K7"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/28/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422708,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Kia Sportage. The contact received notification of NHTSA campaign number: 21V137000 (Service Brakes, Hydraulic) however, the part to do the recall repair was not yet available. The local dealer was contacted, and it was confirmed that the part was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was not made aware of the issue. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "KNDPM3AC5K7"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/27/2021",
        "dateOfIncident": "06/27/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422518,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "When you put the car in gear, the car rolls backward in drive. The engine light, oil light and battery light are on the dashboard.",
        "vin": "KNDPNCAC6K7"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/26/2021",
        "dateOfIncident": "04/30/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418577,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I have received a safety recall on the VIN # above a lease car and have been trying to contact 2 different KIA dealerships in my area, since receiving this recall letter,  to no avail. Per the recall, this HECU may short-circuit and cause a engine compartment fire....since this seems very serious and failure to get this done is out of my control, I would greatly appreciate some help in this matter. I reside in Clinton Township Michigan 48035.   Thank you,  Susan Bartle",
        "vin": "KNDPNCAC5K7"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/20/2021",
        "dateOfIncident": "05/20/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417966,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Kia Sportage. The contact received notification of NHTSA Campaign Number: 21V137000 (Service Brakes, Hydraulic) however, the part to do the recall repair was not yet available. The contact stated that the dealer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "KNDPNCAC2K7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/11/2021",
        "dateOfIncident": "02/07/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395844,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING IN TRAFFIC ENGINE SHUTS OFF WITH NO WARNING. COMPLETE LOSS OF ENGINE POWER. HAVE TO COME TO A COMPLETE STOP IN LANE OF TRAFFIC AND THEN PUT VEHICLE IN PARK AND RESTART ENGINE. HAPPENED 3 TIMES IN LAST MONTH. MY KIA SPORTAGE 2019 ONLY HAS 18,000 MILES ON IT. NO CHECK ENGINE LIGHTS ON. EXTREMELY UNSAFE AND KIA SERVICES VERY UNHELPFUL.  VEHICLE WAS IN MOTION ALL 3 TIMES THIS HAPPENED ON A CITY STREET GOING STRAIGHT IN TRAFFIC.",
        "vin": "KNDPMCA04K7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/25/2020",
        "dateOfIncident": "10/25/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366283,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENTIRE BACK OF THE SUNROOF HAS SHATTERED.  CAR IS ONLY A 2019 WITH 15000 MILES.  WE HAVE A ROGUE WHICH IS OVER 5 YEARS OLD AND HAVE HAD NO ISSUES WITH THE SUNROOF.",
        "vin": "KNDPN3AC4K7"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/17/2020",
        "dateOfIncident": "07/17/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339961,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "IN AUGUST OF LAST YEAR I BOUGHT A 2019 KIA SPORTAGE EX FROM SMITHTOWN KIA IN NY. ON JULY 12, 2020 I WAS DRIVING WITH MY DAUGHTER WHEN THE CAR JUST STOPPED WITHOUT ANY WARNING. IT WAS A VERY SCARY EXPERIENCE AS CARS WERE ALL AROUND ME. LUCKILY, I WAS ON A SIDE STREET AND NOT ON A MAIN ROAD OR HIGHWAY! WHEN I PRECEDED TO START THE CAR UP AGAIN THERE WAS A TERRIBLE ODOR THAT SMELLED LIKE GAS AND A BURNING SMELL. AT THAT POINT, I CALLED MY HUSBAND WHO GOT A TOW TRUCK FOR US. THE NEXT DAY, THE SERVICE DEPARTMENT TOLD ME THE CODE TO INFORM THEM WHAT WAS WRONG WITH THE VEHICLE DISAPPEARED. HOWEVER, THE CAR WAS WORKING AND READY FOR ME TO PICK UP! I INFORMED THEM THAT I DID NOT FEEL SAFE DRIVING THE VEHICLE WITHOUT IT BEING FIXED NOR WAS MY DAUGHTER WILLING TO GO BACK IN THE CAR. I WAS TOLD THEY WOULD DRIVE THE CAR AROUND TO ASSURE ME THERE WAS NOTHING WRONG WITH THE CAR. AGAIN, THEY OFFERED FOR ME TO PICK THE CAR UP OR DROP IT OFF!",
        "vin": "KNDPNCAC1K7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/28/2020",
        "dateOfIncident": "01/27/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302494,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT LOW SPEEDS I HEARD A POPPING SOUND, GOT OUT CHECKED MY TIRES AND EVERTHING SEEMED OK. ALL OF A SUDDEN I HEAR A CRACKING SOUND. I PULLED BACK THE SUNROOF PANEL AND SAW SHATTERED GLASS",
        "vin": "KNDPN3AC9K7"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/16/2020",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299809,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 KIA SPORTAGE. WHILE AT A STOP/STOP SIGN ON SEVERAL OCCASIONS, THE VEHICLE SPUTTERED. THE ACCELERATOR PEDAL WAS DEPRESSED IN THE ATTEMPT TO REGAIN SPEED BUT FAILED TO RESPOND. THERE WERE NO WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS TAKEN TO STEVENSON KIA OF JACKSONVILLE (500 W FAIRWAY RD, JACKSONVILLE, NC 28546 ( 910) 938-0555) BUT, WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS CONTACTED AND A CASE WAS FILED. NO FURTHER ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS 2,000.",
        "vin": "KNDPR3A61K7"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/03/2020",
        "dateOfIncident": "01/02/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11296813,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING NORMALLY ON THE HIGHWAY, I'VE CONTINUOUSLY EXPERIENCED THE CAR RANDOMLY REVVING BETWEEN 3000 AND 4000 RPMS WHILE DRIVING ON THE HIGHWAY AND ON REGULAR ROADS. IT WILL GET STUCK AT 2000 RPMS AND WILL NOT ACCELERATE OR DECELERATE NO MATTER HOW HARD THE GAS/BRAKE IS PRESSED. IT HAS BEEN TAKEN TO THE DEALERSHIP I PURCHASED IT FROM TWICE NOW, AND BOTH TIMES THEY HAVE TOLD ME THEY CANNOT FIND ANYTHING WRONG WITH THE CAR, NO CODES OR ANYTHING. I DO NOT FEEL SAFE IN A CAR I'M PAYING $402 A MONTH FOR. I HAVE CONTACTED KIA CORPORATE IN ATLANTA AND OPENED A CASE WITH KIA CONSUMER ASSISTANCE ONLINE. WAITING RESPONSE FROM BOTH.     WILL NOT BUY ANOTHER KIA AFTER I LEMON LAW THIS CAR. MY FAMILY HAS ALWAYS HAD KIA'S AND NEVER HAD ANY ISSUE WITH THEM. I PREVIOUSLY HAD A 2016 SPORTAGE THAT ALSO HAD TRANSMISSION PROBLEMS.",
        "vin": "KNDPN3AC6K7"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/11/2019",
        "dateOfIncident": "10/05/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279447,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I KEEP GETTING LOW AIR NOTIFICATIONS ON MY CAR.  I TOOK IT IN ONCE AND THEY FOUND NOTHING WRONG WITH MY TIRES AND SENT ME ON MY WAY.  WELL IT'S BACK AGAIN SO I'M TAKING MY CAR IN AGAIN.  THIS IS A REAL PAIN BECAUSE I WORK 2 JOBS, 12 HOURS DAYS, NIGHT SHIFTS ETC.  I DON'T HAVE TIME FOR THIS!  ALSO MY BLUETOOTH SKIPS AND PAUSES A LOT SO I ALWAYS HAVE TO PLUG IN MY PHONE TO USE IT.",
        "vin": "KNDPNCAC6K7"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/01/2019",
        "dateOfIncident": "09/26/2019",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265476,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY KIA SPORTAGE 2019 CAUGHT FIRE ON THE HIGHWAY IN NEW MARKET MD AT AROUND 10:30 AM 9/26/19. WE HAD PREVIOUSLY TAKEN THE CAR TO THE DEALERSHIP WHERE WE PURCHASED IT BACK IN 12/2019. IT HAD ONLY 3900+/- MILES ON IT. THE OIL, FILTER, TIRE ROTATION AND 27 POINT INSPECTION WAS DONE ON 9/19/19.     AS I WAS IN THE LEFT LANE OF RTE 70 WB I NOTICED BLUE SMOKE COMING FROM THE BACK OF THE CAR. I PUT ON MY FLASHERS AND SIGNALED OVER TO THE RIGHT SHOULDER. I CALLED MY HUSBAND AND WAS QUITE HYSTERICAL BECAUSE NOW THE FRONT OF THE CAR WAS SMOKING A BROWNISH-BLACK. IT QUICKLY STARTED COMING IN THEY THE VENTS. I  COULDN'T FIGURE OUT WHAT TO DO - MAY HAVE BEEN IN SOME SORT OF SHOCK. BUT I FINALLY LEFT THE VEHICLE BUT WAS STILL TOO CLOSE. A PASSERBY, JEREMIAH DARLING OF NJ, ASSISTED ME TO A SAFE PLACE AND I HEARD A POP THEN THE FLAMES STARTED COMING QUICKLY.",
        "vin": "KNDPNCAC3K7"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/24/2019",
        "dateOfIncident": "09/04/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257846,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING HOME NIGHT 9/4/19, NOTICED HEADLIGHTS HAVE PARTIAL OBSTRUCTION WITH SHADOW ON HORIZON MAKING IT DIFFICULT TO RECOGNIZE ANY OBJECTS IN THE SHADOW AREA. IF YOU TURN THE CAR OR TAKE A BEND IN THE ROAD OR DRIVE DOWN OR UP HILL THE DISTRACTION BECOMES A VERY BAD PROBLEM AS THE SHADOW CHANGES IN SIZE OR MOVES...MOSTLY ON LOW BEAMS BUT IS ALSO ON HIGH BEAMS BUT NOT AS NOTICEABLE....LIVE AND DRIVE IN THE NE GEORGIA MOUNTAINS, HAZARD IN DAYTIME AND MORE AT NIGHT..CALLED KIA NEXT AM, CAR SEEN  DEALERSHIP 9/9/2019..ADJUSTED HEADLIGHTS...9/13/2019 DROVE NIGHT AGAIN, NO CHANGE...CALLED DEALERSHIP AND TOOK IN 9/18/2019 BEFORE SERVICE WAS TOLD THIS IS A PROBLEM WITH THE 2019 KIA SPORTAGE AND OTHER KIA SUV'S..NOTHING THEY CAN DO...IT IS A PROBLEM THAT HAS BEEN REPORTED TO THEM BY OTHER KIA SPORTAGE OWNERS AND IT IS A DESIGN FLAW SO WAS TOLD BY SERVICE MANAGER AT LIFETIME KIS...4170 US HIGHWAY 64W, MURPHY, NC 28906..828-835-9200....I WANTED TO KNOW WHY WHEN I PURCHASED THE AUTO WAS NOT INFORMED OF THIS MAJOR PROBLEM..CONSIDERED A MAJOR SAFETY HAZARD..NO SATISFACTORY ANSWER WAS GIVEN...I FELT LIKE ALL THEY WANTED TO DO WAS SELL A CAR AND I WAS WILLING TO PURCHASE ANOTHER BUT WOULD LOSE 10K IN JUST A FEW MONTHS..AM STILL CONSIDERING TRADING THIS CAR IN SO WILL HAVE PEACE OF MIND ON THE ROAD AT NIGHT..",
        "vin": "KNDPRCA67K7"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/08/2019",
        "dateOfIncident": "06/30/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230258,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS RECENTLY INVOLVED IN A COLLISION WITH A DEER. I WAS TRAVELLING AT 55MPH WHEN I HIT THE DEER SQUARE ON AND MY AIR BAGS DID NOT DEPLOY.     ALSO EVERY TIME I WASH MY CAR SOME OF THE ELECTRICAL COMPONENTS STOP WORKING FOR A FEW DAYS SUCH AS THE CLOCK. I HAVE TALKED TO KIA DEALERSHIP NEAR ME AND THEY CAN NOT EXPLAIN THE ISSUE OVER THE ELECTRICAL STUFF. ALSO THEY STATED I COULD START A CASE WITH THEM OVER THE AIRBAGS",
        "vin": "KNDPMCAC8K7"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/04/2019",
        "dateOfIncident": "08/01/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229476,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "IN THE RANGE OF 1200-1500 RPM AND SPEEDS IN THE 40 MPH RANGE THERE IS A VIBRATION AND HESITATION ESPECIALLY ON ANY DEGREE OF INCLINE.  MORE SERIOUSLY, THE PROBLEM REPEATS AT 2000 RMP AT HIGHWAY SPEEDS FROM 65 MPH UPWARDS.  THERE IS A VIBRATION AND SERIOUS LACK OF RESPONSE TO INCREASED PRESSURE ON THE ACCELERATOR.   IT IS WORSE ON ANY INCLINE BUT HAPPENS ON LEVEL ROAD AS WELL.  THE CAR WILL NOT RESPOND TO TRYING TO INCREASE SPEED UNLESS I REALLY PUSH HARD ON THE ACCELERATOR AND THEN IT IS STILL SLOW TO RESPOND.  THE PROBLEMS SEEM TO BE GETTING WORSE POSSIBLY DUE TO THE SUMMER HEAT.  I DO NOT FEEL SAFE ON THE HIGHWAY.  THIS HAS BEEN REPORTED AND EXAMINED AT THE LOCAL DEALERSHIP AND A REPORT FILED WITH KIA BUT I HAVE NOT BEEN ABLE TO REACH THEM IN PERSON.",
        "vin": "KNDPM3AC8K7"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/10/2019",
        "dateOfIncident": "03/09/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185704,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR TURN SIGNALS OF THE VEHICLE ARE BELOW THE LOWEST POINT OF THE LIFT GATE, ARE MOUNTED INSIDE THE BUMPER, AND ARE RECESSED IN THE BUMPER. WHEN TURN SIGNALS ARE USED, ONLY THE TURN BLINKERS IN THE BUMPER BLINK WHILE THE TRADITIONAL REAR BRAKE LAMPS ARE SOLID AND DO NOT INDICATE A TURN. THE TURN SIGNALS ARE TOO LOW FOR FOLLOWING VEHICLES TO SEE AND BECAUSE THEY ARE RECESSED, THE HOUSING GETS PACKED WITH SNOW, SLUSH AND DIRT, MAKING THE ACTIVATED SIGNALS INDISTINGUISHABLE. ALL 2019 KIA SPORTAGES HAVE THIS POORLY ENGINEERED FEATURE, WHICH MAY BE AS OUTSIDE COMPLIANCE AS AN EARLY 70S MALIBU, AND NO TURN SIGNALS IN THE BRAKE LIGHT ASSEMBLY.",
        "vin": "KNDPM3AC8K7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/09/2018",
        "dateOfIncident": "12/05/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11157109,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED CAR ON JULY 28 2019 FROM HOLLYWOOD KIA. TOOK IT TO THEIR SERVICE CENTER ON NOVEMBER 26 FOR COMPLIMENTARY OIL AND FILTER CHANGE. ON DECEMBER 5 ON THE I-75 EXPRESSWAY GOT AN ALARM SOUND AND SIGN THAT THE \"ENGINE HAS OVERHEATED\". MANAGED TO GET HOME, NEXT DAY WAITED ALL DAY FOR TOWING COMPANY. EITHER CAR IS DEFECTIVE OR THE SERVICE THEY DID CAUSED THIS DANGEROUS ISSUE.",
        "vin": "KNDPM3AC1K7"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/16/2018",
        "dateOfIncident": "10/15/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11140692,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2019 KIA SPORTAGE. WHILE REVERSING THE VEHICLE OUT OF A SCHOOL PARKING LOT, THE BRAKE PEDAL WAS DEPRESSED AND FAILED TO RESPOND WITHOUT WARNING. AS A RESULT, THE VEHICLE CRASHED INTO THE SIDE OF THE SCHOOL BUILDING. THE AIRS BAGS DEPLOYED. THERE WERE NO INJURIES. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO A TOW LOT AND DEEMED A TOTAL LOSS BY THE INSURANCE COMPANY. THE DEALER (FUCCILLO KIA, 3900 STATE ST, SCHENECTADY, NY 12304, (518)-847-0800) WAS CONTACTED AND STATED THAT THE VIN WAS NOT INCULED IN ANY RECALLS. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 300.",
        "vin": "KNDPMCAC4K7"
    }
]