[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/18/2022",
        "dateOfIncident": "09/30/2021",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11452719,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owned a 2019 Kia Sedona. The contact stated while driving 70 mph up a hill, he heard an abnormal noise, and then the vehicle was seized. The contact stated no warning light was illuminated. The contact was able to park on the size of the vehicle and when exiting the vehicle felt heat exiting under the vehicle. The contact stated he saw fire located on the engine. The contact extinguished the fire with a fire extinguisher he had available. The fire department filed a fire report. The contact stated an ambulance was able to attempt him and transport him to the hospital for smoke and fire extinguisher chemical in his lungs. The vehicle was not drivable. The vehicle was towed to an unknown location by the insurance company and deemed the vehicle was a total loss. The contact called the local dealer and made them aware of the failure. The manufacturer had been informed of the failure. The failure mileage was approximately 140,000. The VIN was not available.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/14/2021",
        "dateOfIncident": "06/01/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432958,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Sliding door does not always latch. Have to manually close it to latch properly.",
        "vin": "kndmb5c13k6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/25/2021",
        "dateOfIncident": "06/30/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430520,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "What component or system failed or malfunctioned, and is it available for inspection upon request? Left side rear door. Yes it is available for inspection  How was your safety or the safety of others put at risk? Door is hard to open sometimes does not open, I have to do a lot of force for it to open. I have two babies in carsite on the back of the car, if an accident occur their life will be at risk.  Has the problem been reproduced or confirmed by a dealer or independent service center? Yes, several times. Dealer try to correct it multiples time but the problem persist.  Has the vehicle or component been inspected by the manufacturer, police, insurance representatives or others? Yes, by the dealer, by the manufacturer and by DACO.  Were there any warning lamps, messages or other symptoms of the problem prior to the failure, and when did they first appear? No",
        "vin": "KNDMA5C16K6"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/11/2020",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383081,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 KIA SEDONA. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE JERKED OR HESITATED WITHOUT WARNING, WITH THE ACCELERATOR PEDAL DEPRESSED. THE CONTACT ALSO STATED THAT THE VEHICLE WOULD PERFORM HARD DOWNSHIFTS WITHOUT WARNING WHILE DEPRESSING THE BRAKE PEDAL. THE CONTACT TOOK THE VEHICLE TO HAGERSTOWN KIA (10307 AUTO PL, HAGERSTOWN, MD 21740) WHERE A SOFTWARE UPDATE WAS PERFORMED HOWEVER, THE FAILURE PERSISTED. THE CONTACT HAD TAKEN THE VEHICLE BACK TWICE AND NO REMEDIES WERE PERFORMED AFTER EACH VISIT. THE MANUFACTURER HAD YET TO BE NOTIFIED OF FAILURE. THE VEHICLE HAD YET TO BE REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 5,000.",
        "vin": "KNDMB5C11K6"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/16/2020",
        "dateOfIncident": "04/01/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364624,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 KIA SEDONA. THE CONTACT STATED THAT WHILE ATTEMPTING TO ACCELERATE TO PASS ANOTHER VEHICLE, THE VEHICLE LOSS POWER AND SPUTTERED AND JERKED. THE CONTACT PULLED OVER, RESTARTED THE VEHICLE, AND DROVE TO HIS RESIDENCE. THE VEHICLE WAS TAKEN TO PITRE KIA (9640 EAGLE RANCH RD. NORTHWEST ALBUQUERQUE, NM 87114, 877-468-0639) TO BE DIAGNOSED. THE MECHANIC WAS UNABLE TO DUPLICATE THE FAILURE. THE VEHICLE WAS TEST DRIVEN WITHOUT ISSUE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 400.",
        "vin": "KNDMB5C10K6"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/10/2020",
        "dateOfIncident": "02/20/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348473,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "SOMETHING IS WRONG WITH MY ENGINE OR TRANSMISSION WHICHEVER WHICH ONE IT IS I DO NOT KNOW I'VE TAKEN IT TO THE DEALER 5 OR MORE TIMES THEY CANNOT DUPLICATE THE PROBLEM OR THE OR THEY SAY IT'S OPERATING AS ASSIGNED HOW'S THE CAR OPERATING AS DESIGNED WHEN THE VEHICLE SOON AS YOU PUSH THE ACCELERATOR AT BUCKS IT JERKS IT HESITATES TO GO AND THAT ONE THAT GOES IT TAKES OFFIT ALSO DOES THE SAME THING WHEN SLOWING DOWN IN A BUCK LITTLE JERK AND THEN DOWNSHIFT VERY HARD THIS IS VERY DANGEROUS WHEN DRIVING DURING CERTAIN CONDITIONS",
        "vin": "KNDMB5C10K6"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/24/2020",
        "dateOfIncident": "01/23/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311236,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED NEW. @ 7400 MILES WHILE DRIVING ON THE HIGHWAY IT SMELLED LIKE SOMETHING WAS BURNING. TOOK IT TO DEALERSHIP WHO STATED CYLINDER HEAD WAS LEAKING ANTIFREEZE. ENTIRE ENGINE HAD TO BE REBUILT (ALL HEADS/GASKETS EXCHANGED). 7800 MILES FLUID LEVELS BOTTOMED OUT. DEALER STATED CAR HADN'T 'BURPED' FROM GASKET REPAIR. 9300 MILES WHILE CITY DRIVING THE BLIND SPOT COLLISION WARNINGS STARTED YELLING. I PLACED THE CAR IN PARK AND TURNED IT OFF. WHEN I TURNED IT BACK ON THE CAR SAID POSSIBLE TRANSMISSION FAILURE AND I COULD NOT SHIFT. POPPED THE SHIFT LOCK RELEASE TO GET VEHICLE INTO DRIVE TO BRING FOR SERVICE. DEALER STATED INHIBITOR SWITCH FAILED CAUSING THE ISSUES WITH THE BLIND SPOT COLLISION WARNINGS AND THE SHIFT LOCKOUT. UNACCEPTABLE IN NEW VEHICLE UNDER 10K MILES",
        "vin": "KNDMB5C16K6"
    },
    {
        "components": "STEERING,WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/08/2019",
        "dateOfIncident": "12/04/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287729,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT A BRAND NEW CAR AT 20 MILES ON ODOMETER. WHILE DRIVING HOME STEERING WHEEL WAS SHAKING BADLY. I WAS SURPRISED TO FEEL THIS SINCE IT IS A BRAND NEW CAR. I WENT TO SERVICE NEXT DAY THEY COULD NOT FIND ANYTHING WRONG WITH TIRES OR SUSPENSION AND WAS TOLD THIS IS HOW THIS CAR DESIGN TO DRIVE. I WAS TOLD THAT IF THERE IS KNOW VISIBLE ISSUE WITH THE TIRES KIA WOULD NOT REPLACE IT UNDER WARRANTY. NOW I'M STUCK WITH THIS BRAND NEW CAR THAT DRIVES LIKE 10 YEARS OLD CAR.",
        "vin": "KNDMA5C12K6"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/25/2019",
        "dateOfIncident": "07/23/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271050,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 KIA SEDONA. WHILE DRIVING 10 MPH, THE VEHICLE LUNGED FORWARD WITHOUT WARNING. ON ANOTHER OCCASION, WHEN DEPRESSING THE ACCELERATOR PEDAL, THE VEHICLE FAILED TO ACCELERATE AND, AT TIMES, THE RPMS INCREASED TO 4,000. AN ABNORMAL NOISE WAS ALSO HEARD DURING THE FAILURE. THE VEHICLE WAS TAKEN TO MURRAY KIA (LOCATED AT 1402 RIDGE PIKE, CONSHOHOCKEN, PA 19428, (610) 279-3020) WHERE UNKNOWN SOFTWARE UPDATES WERE PERFORMED; HOWEVER, THE FAILURES CONTINUED. THE VEHICLE WAS TAKEN BACK TO THE DEALER FOR UNKNOWN SOFTWARE UPDATES, BUT THE FAILURES CONTINUED. THE MANUFACTURER WAS NOT INFORMED OF THE FAILURES. THE FAILURE MILEAGE WAS 250.",
        "vin": "KNDMB5C14K6"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/31/2019",
        "dateOfIncident": "03/30/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192764,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 KIA SEDONA WITH 2600 MILES ON IT, WHILE DRIVING THE CAR DOWN THE ROAD, IT HAS EXTREME ALIGNMENT ISSUES WANTING TO GO TO THE LEFT, ALMOST CAUSED 3 DIFFERENT ACCIDENTS PUTTING MY LIFE AND MY FAMILY'S LIFE IN DANGER. IN ORDER TO KEEP THE THE CAR GOING STRAIGHT, YOU REALLY HAVE TO HOLD THE STEERING WHEEL TIGHTLY.",
        "vin": "KNDMB5C19K6"
    }
]