[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/29/2022",
        "dateOfIncident": "10/21/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449344,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "In heavy traffic the car stalled and by pumping the accelrator several times  it  activated..then at the stop light it did the same issue and heavy traffic was upon me blowing there horns..I carryed it to a lexus dealer and they could not determine the problem..I went online and found out that their is a recall on this vehicle..which was not taken care of by the car dealer before I purchased the vehicle in April 2021.  Lives can be taken and I want this problem taken care of before it's our lives.",
        "vin": "2T2ZZMCA1KC"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "12/10/2021",
        "dateOfIncident": "12/07/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443331,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Sudden acceleration while parking; collision with post & fence Failure of safety systems; including ‘collision avoidance’ breaking, ‘collision warning’ alarm, air bag failed to deploy. Repair shop to evaluate the physical damage to the car the week of 13December2021. Lexus has been notified; case number 211208000564. Lexus has not contacted me or the insurance company as of 10December2021. Mishawaka, Indiana Police Dept. case #2112070051",
        "vin": "2T2BGMCA4KC"
    },
    {
        "components": "LANE DEPARTURE,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/10/2021",
        "dateOfIncident": "12/09/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443334,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The Lexus Emblem where the front facing camera is located along with other sensors is causing Malfunction and Warning Lights in the Instrument Gauge Cluster.  Then the Check Engine, Check Battery, 4WD Malfunction, 2WD Engaged, High Temp Coolant, ABS Light, Coolant Gauge erratically fluctuates, RPM Gauge stays at Zero.   Please pull over to a safe location and Contact your dealer.   The messages above are generated periodically. Please note and inform Lexus of the Issues.",
        "vin": "2T2BZMCA5KC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/20/2021",
        "dateOfIncident": "10/16/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441151,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The navigation system randomly marks places of interest while there is no input from the driver. This in effect cancels the navigation information causing distraction when relying on that system. It also “marked” an address twenty miles from the destination and gave directions to that sight. Dealer cannot find cause and it has not been repaired.",
        "vin": "2t2bgmca7kc"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/30/2021",
        "dateOfIncident": "09/30/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435037,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Lexus RX350. The contact stated while his wife, was reversing in the driveway she hit the retaining wall.  The driving alarms failed to engage and alert. The driver depressed the brake pedal however failed to respond and was depressed to the floorboard.  The emergency brake failed to engage. The vehicle rolled down the hill and crashed into some unknown objects in the driveway.  There were no reported injuries, air bag deployment, police report or fire.  The vehicle was drivable.  The local dealer was not contacted. The vehicle was not diagnosed or repaired. The manufacturer was notified however, no further assistance was provided.  The failure mileage was approximately 30,000.",
        "vin": "2T2ZZMCA4KC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/20/2021",
        "dateOfIncident": "08/16/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429906,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX450H",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Lexus RX450H. The contact stated while driving approximately 65 MPH, the vehicle lost motive power. The contact pulled over and had the vehicle towed to a local dealer. The vehicle was diagnosed with needing a fuel pump replaced. The vehicle was repaired. The manufacturer was informed of the failure and the contact was awaiting a response. The failure mileage was approximately 32,000.",
        "vin": "2T2BGMCA2KC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/27/2021",
        "dateOfIncident": "07/26/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426584,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Car stalled after 100+ miles driving.  When gas pressed, the car thump/hump and irregular acceleration.  Engine light on trac off.  Stop car, engine off.  Restart and can not accelerate (engine hump/thump/shake).  Stop, rest, turn off AC/all other electronic, restart, very irregular acceleration, was able to drive with slow acceleration.  Once past 25 mph, slow acceleration, no stall.  Around 25 mph, car stalling.  2nd time into shop with same issue.  1st time Lexus indicated O-ring placed in reverse.  New 2019 Lexus Rx350L with less than 4000 miles.  3rd time into shop.  Local driving no issue.",
        "vin": "jtjgzkca7k2"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/13/2021",
        "dateOfIncident": "07/13/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424669,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle has been reported before for similar problems. This time, no power, severe stumbling, lurching. Check engine light comes on along with warning indicators that the electrical systems have failed. Lexus notified again and vehicle will be towed to dealership.  This car is dangerous and life threatening as we were in traffic with no power. Dealer did not notify us of any problems prior to sale but this car qualifies as a lemon under AZ law. Additionally, if other Lexus owners are having this problem, they should immediately stop using the vehicle and park it before someone gets injured/killed.",
        "vin": "2T2ZZMCA8KC"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/10/2021",
        "dateOfIncident": "07/09/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424232,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Car does not speed when gas pressed, noise and car shakes.  Engine check light on and screen showed trac off.  Saw something with engine power issue.  Parked car and called Lexus emergency.  Car at dealership and it is being inspected.",
        "vin": "jtjgzkca7k2"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/25/2021",
        "dateOfIncident": "06/17/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422345,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle stumbles and loses power when accelerating. Loss of power when passing. Both situations caused driver to abort action for fear of not having the power to enter the roadway or pass vehicles. Lexus dealership acknowledged the problem with this vehicle and said the fuel pump was replaced because of a recall. Problem continues to exist and is dangerous to driver and others. Dealer further recommended we “ change our driving habits “ to remediate the problem. Not acceptable.",
        "vin": "2T2ZZMCA8KC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/15/2021",
        "dateOfIncident": "06/14/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421075,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving 65-70mph on the freeway, the car started dinging and one of the first messages that we saw was \"pre-collision system malfunction\" & \"hybrid system malfuncion\" followed by every other \"system malfunction\" and the gas pedal was no longer supplying gas to the car. We were in the fast lane and had to work over 3 or 4 lanes to get to the emergency lane/exit. Since we were at an exit, we took the exit and coasted as far as we could before the car came to a halt. Another car stopped to help us get completely off the road since we weren't fully in the emergency lane. After a few minutes we were able to crank the car and drive it a few miles to the dealership. We left the car at the dealership and they called the next day to inform us that the fuel pump had to be replaced. I did not find this vehicle to be part of any recall or lawsuit but several other Lexus models are part of a recall/lawsuit due to a problem with the Denso fuel pump. I'm not sure if my car has this same fuel pump. There were no warning lamps, messages or other symptoms of the problem prior to the failure.",
        "vin": "JTJDGKCA4K2"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/20/2020",
        "dateOfIncident": "03/19/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318819,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX450H",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE NOISE, LIKE A SEAL IS BARKING ON APPLICATION OF BRAKES WHILE DRIVING. DEALER AND LEXUS ENGINEERS STATE THAT IT'S NORMAL, DON'T HAVE A FIX AT THE MOMENT AND RELEASED THE VEHICLE.     BRAKE WAS SOFT WHILE DRIVING AND FELT LIKE BRAKE PEDAL NEEDS TO BE PUSHED MUCH FURTHER TO ACHIEVE BRAKING ON TIME.",
        "vin": "2T2BGMCA7KC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/28/2019",
        "dateOfIncident": "01/21/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11172657,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX450H",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AS PER LEXUS DEALERSHIP, THE ELECTRICAL WIRES WERE CHEWED BY RODENTS WHILE PARKED IN THE DRIVEWAY. AFTER READING ABOUT THIS ON THE INTERNET, IT APPEARS THAT THIS IS A CONSISTENT PROBLEM WITH LEXUS VEHICLES BECAUSE OF THE USE OF SOY BASED ELECTRICAL WIRES WHICH THE RODENTS ARE ATTRACTED TO. NONE OF MINE OR ANY OTHER VEHICLE IN THE NEIGHBORHOOD HAVE BEEN AFFECTED BY RODENTS, EXCEPT FOR THIS 2019 MODEL AND IT HAPPENED THE VERY FIRST TIME THAT IT WAS NOT USED FOR MORE THAN A COUPLE OF DAYS.",
        "vin": "2T2BGMCA0KC"
    }
]