[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/29/2022",
        "dateOfIncident": "10/21/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449344,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "In heavy traffic the car stalled and by pumping the accelrator several times  it  activated..then at the stop light it did the same issue and heavy traffic was upon me blowing there horns..I carryed it to a lexus dealer and they could not determine the problem..I went online and found out that their is a recall on this vehicle..which was not taken care of by the car dealer before I purchased the vehicle in April 2021.  Lives can be taken and I want this problem taken care of before it's our lives.",
        "vin": "2T2ZZMCA1KC"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "12/10/2021",
        "dateOfIncident": "12/07/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443331,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Sudden acceleration while parking; collision with post & fence Failure of safety systems; including ‘collision avoidance’ breaking, ‘collision warning’ alarm, air bag failed to deploy. Repair shop to evaluate the physical damage to the car the week of 13December2021. Lexus has been notified; case number 211208000564. Lexus has not contacted me or the insurance company as of 10December2021. Mishawaka, Indiana Police Dept. case #2112070051",
        "vin": "2T2BGMCA4KC"
    },
    {
        "components": "LANE DEPARTURE,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/10/2021",
        "dateOfIncident": "12/09/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443334,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The Lexus Emblem where the front facing camera is located along with other sensors is causing Malfunction and Warning Lights in the Instrument Gauge Cluster.  Then the Check Engine, Check Battery, 4WD Malfunction, 2WD Engaged, High Temp Coolant, ABS Light, Coolant Gauge erratically fluctuates, RPM Gauge stays at Zero.   Please pull over to a safe location and Contact your dealer.   The messages above are generated periodically. Please note and inform Lexus of the Issues.",
        "vin": "2T2BZMCA5KC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/20/2021",
        "dateOfIncident": "10/16/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441151,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The navigation system randomly marks places of interest while there is no input from the driver. This in effect cancels the navigation information causing distraction when relying on that system. It also “marked” an address twenty miles from the destination and gave directions to that sight. Dealer cannot find cause and it has not been repaired.",
        "vin": "2t2bgmca7kc"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/30/2021",
        "dateOfIncident": "09/30/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435037,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Lexus RX350. The contact stated while his wife, was reversing in the driveway she hit the retaining wall.  The driving alarms failed to engage and alert. The driver depressed the brake pedal however failed to respond and was depressed to the floorboard.  The emergency brake failed to engage. The vehicle rolled down the hill and crashed into some unknown objects in the driveway.  There were no reported injuries, air bag deployment, police report or fire.  The vehicle was drivable.  The local dealer was not contacted. The vehicle was not diagnosed or repaired. The manufacturer was notified however, no further assistance was provided.  The failure mileage was approximately 30,000.",
        "vin": "2T2ZZMCA4KC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/27/2021",
        "dateOfIncident": "07/26/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426584,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Car stalled after 100+ miles driving.  When gas pressed, the car thump/hump and irregular acceleration.  Engine light on trac off.  Stop car, engine off.  Restart and can not accelerate (engine hump/thump/shake).  Stop, rest, turn off AC/all other electronic, restart, very irregular acceleration, was able to drive with slow acceleration.  Once past 25 mph, slow acceleration, no stall.  Around 25 mph, car stalling.  2nd time into shop with same issue.  1st time Lexus indicated O-ring placed in reverse.  New 2019 Lexus Rx350L with less than 4000 miles.  3rd time into shop.  Local driving no issue.",
        "vin": "jtjgzkca7k2"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/16/2021",
        "dateOfIncident": "07/13/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425162,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Lexus RX350. The contact stated while parking the vehicle in a parking space, as he disengaged the brake pedal to complete the parking, the vehicle accelerated inadvertently and crashed into the pillar of a building. There were no warning lights illuminated. There were no injuries sustained. The vehicle was towed to a tow lot, then it was towed to an independent mechanic. A police report was filed. The dealer was not made aware of the failure. The manufacturer was made aware of the failure and a case was opened. The vehicle was not diagnosed nor repaired. The approximate failure mileage was 21,000.",
        "vin": "2T2ZZMCA2KC"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/13/2021",
        "dateOfIncident": "07/13/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424669,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle has been reported before for similar problems. This time, no power, severe stumbling, lurching. Check engine light comes on along with warning indicators that the electrical systems have failed. Lexus notified again and vehicle will be towed to dealership.  This car is dangerous and life threatening as we were in traffic with no power. Dealer did not notify us of any problems prior to sale but this car qualifies as a lemon under AZ law. Additionally, if other Lexus owners are having this problem, they should immediately stop using the vehicle and park it before someone gets injured/killed.",
        "vin": "2T2ZZMCA8KC"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/10/2021",
        "dateOfIncident": "07/09/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424232,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Car does not speed when gas pressed, noise and car shakes.  Engine check light on and screen showed trac off.  Saw something with engine power issue.  Parked car and called Lexus emergency.  Car at dealership and it is being inspected.",
        "vin": "jtjgzkca7k2"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/25/2021",
        "dateOfIncident": "06/17/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422345,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle stumbles and loses power when accelerating. Loss of power when passing. Both situations caused driver to abort action for fear of not having the power to enter the roadway or pass vehicles. Lexus dealership acknowledged the problem with this vehicle and said the fuel pump was replaced because of a recall. Problem continues to exist and is dangerous to driver and others. Dealer further recommended we “ change our driving habits “ to remediate the problem. Not acceptable.",
        "vin": "2T2ZZMCA8KC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/15/2021",
        "dateOfIncident": "06/14/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421075,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving 65-70mph on the freeway, the car started dinging and one of the first messages that we saw was \"pre-collision system malfunction\" & \"hybrid system malfuncion\" followed by every other \"system malfunction\" and the gas pedal was no longer supplying gas to the car. We were in the fast lane and had to work over 3 or 4 lanes to get to the emergency lane/exit. Since we were at an exit, we took the exit and coasted as far as we could before the car came to a halt. Another car stopped to help us get completely off the road since we weren't fully in the emergency lane. After a few minutes we were able to crank the car and drive it a few miles to the dealership. We left the car at the dealership and they called the next day to inform us that the fuel pump had to be replaced. I did not find this vehicle to be part of any recall or lawsuit but several other Lexus models are part of a recall/lawsuit due to a problem with the Denso fuel pump. I'm not sure if my car has this same fuel pump. There were no warning lamps, messages or other symptoms of the problem prior to the failure.",
        "vin": "JTJDGKCA4K2"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/03/2021",
        "dateOfIncident": "04/23/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414985,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WE TOOK THE CAR IN BECAUSE WHEN THE CAR IS COLD IT DOES NOT SHIFT PROPERLY. THIS PROBLEM HAS BEEN HAPPENING AND GETTING WORSE SINCE IT WAS THERE FOR A RECALL ON THE TRANSMISSION SOFTWARE. DEALER REFUSES TO ACKNOWLEDGE THAT THERE IS A PROBLEM STATING THE DIAGNOSTIC COMPUTER SHOWS NO ERROR CODES, WHILE IGNORING THE FACT WHEN YOU SHIFT FROM PARK TO REVERSE OR DRIVE THE VEHICLE JERKS AND THE GEAR LEVER REQUIRES A LOT OF FORCE TO MOVE INTO DESIRED GEAR. DEALER REFUSES TO REPAIR THE CAR OR ACKNOWLEDGE THE PROBLEM, INSTEAD THEY TRIED TO SELL ME A $875 OIL CHANGE.    DEALER IS ALSO REFUSING TO SEND ME ANY PAPERWORK THAT MY CAR WAS THERE EVEN AFTER CALLING MANY TIMES TO REQUEST IT, THEY PROMISE TO SEND IT THAT DAY AND NEVER SEND IT BECAUSE \"THEY ARE BUSY\".  SERVICE ADVISOR DAVID ( TAOU) WAS VERY ARROGANT, CONDESCENDING AND DISHONEST.",
        "vin": "2T2ZZMCA5KC"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "11/10/2020",
        "dateOfIncident": "07/25/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373952,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON A RECENT 2500 MILE TRIP ON 3 SEPARATE OCCASIONS WHILE ON INTERSTATE HIWAYS AND  PASSING A VEHICLE THE EMERGENCY BRAKING SYSTEM ENGAGED AUTOMATICALLY WITH WARNING LIGHTS AND BUZZERS GOING OFF. THIS OCCURRED WITH NO OTHER VEHICLES ANYWHERE AROUND FOR A QUARTER MILE OR MORE. ON ONE OCCASION IT OCCURRED WHILE DRIVING IN THE RIGHT LANE AND WITH NO VEHICLES IN SIGHT.    LEXUS SPECIAL TECH INSPECTED THE VEHICLE AND HAD SOME CALIBRATIONS PERFORMED BUT THEY WILL NOT TELL ME WHAT THEY FOUND IN DATA CAPTURED BY THE VEHICLE COMPUTER OR WHAT ACTIONS THEY TOOK AND WHY THEY THINK THE VEHICLE IS SAFE TO DRIVE.",
        "vin": "2T2ZZMCA2KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/05/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353359,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE VIBRATES WHEN BRAKING, BRAKE PEDAL PULSATES AS WELL WHEN BRAKING, SUCH DECREASING THE ABILITY FOR VEHICLE TO STOP APPROPRIATELY. EVERY 6,000 MILES ROTORS WARP BADLY AND NEED TO BE CHANGED WITH NORMAL DRIVING HABITS. LEXUS MUST RECALL THESE DEFECTIVE ROTORS AS THEY COULD AFFECT THE ABILITY FOR THE VEHICLE TO STOP",
        "vin": "2T2BZMCA5KC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/07/2020",
        "dateOfIncident": "05/22/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337881,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP ISSUES.",
        "vin": "JTJGZKCA9K2"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/04/2020",
        "dateOfIncident": "07/04/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337401,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, I'VE BEEN ENCOUNTERING HARD GEAR UPSHIFTS AND DOWNSHIFTS. I HAVE NOTIFIED MY LOCAL LEXUS DEALERSHIP AND THEY TOLD ME THAT IS NORMAL. THIS IS MY 3RD CAR I BOUGHT AND THE FIRST TIME I'VE ENCOUNTERED SUCH AN ISSUE.    ISSUE USUALLY HAPPENS WHEN SPEEDS RANGE BETWEEN 50-70 MPH REGARDLESS OF WEATHER CONDITIONS. THIS IS A SAFETY CONCERN, GIVEN THAT THE CAR IS STILL PRETTY NEW.",
        "vin": "JTJDZKCA3K2"
    },
    {
        "components": "SERVICE BRAKES,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/04/2020",
        "dateOfIncident": "07/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337473,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS PDI AND DELIVERED ON 06/14/20 WITH AN OPEN RECALL 20LA01 THAT WAS LIKELY TO BE A LIFE-THREATENING ISSUE. EVEN AFTER PDI WAS PERFORMED, THE BREAKS WERE DISFUNCTIONAL, SO HAD TO TAKE THE VEHICLE FOR SERVICE ON 06/19/20. LEXUS FOUND THAT ROTORS REQUIRED RESURFACING TO FIX THE BREAKS AND AT THE SAME TIME COMPLETED THE OPEN RECALL 20LA01. HOWEVER ON 07/03/20, THE CAR STALLED IN THE MIDDLE OF A HIGHWAY TRAFFIC PUTTING THE PAX THRU A LIFE-THREATENING SITUATION. CAR HAS BEEN FINALLY TOWED TO THE SERVICE AND I AM VERBALLY PROMISED THAT THE CAR HAS BEEN FIXED TO NOT PRESENT ANY LIFE THREATENING ISSUES. SINCE IT IS JUST 15 DAYS OF PURCHASE AND VEHICLE BEEN INTO THE SERVICE REVIEW FOR 3 TIMES WITH SOME LIFE-THREATENING  OPEN ISSUES, I AM REQUESTING LEXUS TO EITHER REFUND OR PROVIDE ME A REPLACEMENT.  *TR",
        "vin": "JTJDZKCA1K2"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/15/2020",
        "dateOfIncident": "03/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328871,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "LEASED VEHICLE WAS BROUGHT TO LEXUS BROOKLYN, NY DEALERSHIP FOR RECALL ISSUE TO BE ADDRESSED.  VEHICLE IS STILL AT THE DEALERSHIP DUE TO RECALL PARTS NOT BEING AVAILABLE.  LEXUS LEGAL DEPT. HAS DETERMINED THEY ARE UNABLE TO OFFER ASSISTANCE OR BUY BACK OF VEHICLE.  *TR",
        "vin": "JTJBZMCA4K2"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/09/2020",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327962,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 MODEL LEXUS R350L ARE INSTALLED WITH LOW EFFICIENCY \"FUEL PUMP SYSTEM\" AND THIS IS A RECALL FORM THE MANUFACTURER.  STILL  THERE IS NO REMEDY ??  *TR",
        "vin": "JTJGZKCA9K2"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/18/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325032,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 LEXUS RX350. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED THE LEXUS OF WINTER PARK, FLORIDA LOCATED AT 305 N SEMORAN BLVD, WINTER PARK, FL 32792, (407) 678-2000, AND IT WAS CONFIRMED THAT THE PARTS WERE NOT AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.*DT*JB",
        "vin": "2T2ZZMCA6KC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/13/2020",
        "dateOfIncident": "04/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324366,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 LEXUS RX350.  THE CONTACT STATED THAT WHILE DRIVING 35-40 MPH, THERE WAS ABNORMALLY LOUD SOUND COMING FROM THE VEHICLE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. A DEALER WAS NOT MADE AWARE OF THE FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED THE CONTACT WITH A LOANER VEHICLE. THE FAILURE MILEAGE WAS 5,500. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2T2ZZMCA8KC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/13/2020",
        "dateOfIncident": "02/26/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324397,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 LEXUS RX350. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. AN UNKNOWN DEALER WAS CONTACTED AND CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2T2BZMCA7KC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/07/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323665,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 LEXUS RX350. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. LEXUS OF ATLANTIC CITY (3169 FIRE RD, EGG HARBOR TOWNSHIP, NJ 08234, (609) 641-0008) WAS CONTACTED AND CONFIRMED THE PART WAS NOT AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2T2BZMCA4KC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/04/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323204,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 LEXUS RX350. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. LEXUS OF MISHAWAKA (4325 GRAPE RD, MISHAWAKA, IN 46545, (888) 415-3755) WAS CONTACTED AND CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JTJDZKCA3K2"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/22/2020",
        "dateOfIncident": "04/21/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321923,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 LEXUS RX350. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. NEITHER THE MANUFACTURER NOR THE DEALER WERE MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2T2ZZMCA8KC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/03/2020",
        "dateOfIncident": "04/02/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320129,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 LEXUS RX350. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. LEXUS OF LEHIGH VALLEY (4500 BROADWAY, ALLENTOWN, PA 18104), CONFIRMED THAT PART WAS NOT YET AVAILABLE. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT STATED THAT THERE WAS A HESITATION WHILE ATTEMPTING TO ACCELERATE SINCE THE VEHICLE WAS PURCHASED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 1,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. *BF*JB",
        "vin": "2T2BZMCA3KC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/03/2020",
        "dateOfIncident": "02/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320145,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 LEXUS RX350. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED LEXUS ESCONDIDO (1205 AUTO PARK WAY, ESCONDIDO, CA 92029, (760) 747-2300), WHO STATED THAT THE REMEDY PARTS WERE NOT AVAILABLE. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE MANUFACTURER WAS CONTACTED HOWEVER, NO FURTHER ASSISTANCE WAS PROVIDED. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2T2ZZMCA7KC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/02/2020",
        "dateOfIncident": "01/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320083,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 LEXUS RX350. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT STATED THAT LEXUS SAN DIEGO LOCATED AT (4970 KEARNY MESA RD, SAN DIEGO, CA 92111), EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT. *BF*JB",
        "vin": "2T2ZZMCA2KC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/26/2020",
        "dateOfIncident": "03/25/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319355,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 LEXUS RX350. THE CONTACT WAS NOTIFIED THROUGH THE LEXUS APP THAT THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER 20V012000 (FUEL SYSTEM, GASOLINE). THE CONTACT REACHED OUT TO LEXUS OF ORANGE COUNTY LOCATED AT (3496 ROUTE US-6 MIDDLETOWN, NEW YORK, 10940, (845)589-5435, AND WAS INFORMED THAT THE PART TO DO THE RECALL WOULD BE AVAILABLE THE BEGINNING OF THE FALL SEASON. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT CONTACTED OR MADE AWARE OF THE ISSUE.  THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2T2BZMCA9KC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/18/2020",
        "dateOfIncident": "01/31/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318626,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 LEXUS RX350. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT STATED THAT DCH LEXUS OF OXNARD (LOCATED AT 1640 AUTO CENTER DR, OXNARD, CA 93036), EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2T2ZZMCA4KC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/17/2020",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318534,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A CITY STREET THE WARNING LIGHTS CAME ON AND THE CAR STALLED.   I WAS ALONE IN THE CAR AND IN DOWNTOWN CITY TRAFFIC WITH HONKING CARS BEHIND ME. I WAS ABLE TO RESTART THE CAR AFTER A FEW ATTEMPTS.   A FEW DAYS AFTER THIS INCIDENT, WHILE DRIVING ON A VERY BUSY HWY AT 55MPH THE CAR ENGINE WAS SKIPPING AS IF ABOUT TO STALL. I HAD A PASSENGER IN MY CAR WHO EXPERIENCED THIS ROUGH RIDE AND MADE A COMMENT ABOUT IT.   A FEW DAYS LATER, ON MARCH 8,2020, I RECEIVED AN EMAIL FROM LEXUS ENFORM SERVICES WITH A VEHICLE HEALTH REPORT INFORMING ME THAT MY VEHICLE REQUIRES ATTENTION DUE TO A SAFETY RECALL 20LA01.  WHEN I LEASED MY VEHICLE, I WAS NEVER INFORMED OF THIS RECALL WHICH GOES BACK TO 01/13/2020.  SAFETY IS A TOP CONCERN FOR ME AND I FULLY COMMUNICATED THIS TO THE SALESPERSON WHEN I LEASED MY CAR BUT I WAS NOT INFORMED OF THIS RECALL AT THAT TIME. I HAVE EXACTLY 2800 MILES ON MY CAR.  I AM NOT ABLE TO USE IT BECAUSE THE SERVICE DEPARTMENT AT LEXUS DOES NOT HAVE A REMEDY AVAILABLE TO FIX THE LOW -PRESSURE FUEL PUMP AND THEY DO NOT KNOW WHEN THEY WILL HAVE IT.  I WANT TO  DRIVE A VEHICLE THAT IS SAFE NOT ONE THAT INCREASES THE RISK OF HAVING A CRASH.",
        "vin": "2T2ZZMCA9KC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/14/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318000,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JAN 13, 2020 LEXUS ANNOUNCED THAT MY 2019 RX350 HAS A LOW PRESSURE FUEL PUMP THAT COULD FAIL RESULTING IN AN INCREASE IN THE RISK OF A CRASH.  LEXUS HAS INFORMED ME THAT A FIX IS NOT AVAILABLE. I LEFT THE CAR AT THE DEALER ON JAN. 27, 2020.  THE CAR IS STILL THERE AFTER 6 WEEKS.  THERE IS STILL NOT FIX TO THE PROBLEM AND I WILL NOT LET MY WIFE DRIVE THIS CAR WITH THIS ISSUE.  ANY SUGGESTIONS?",
        "vin": "2T2ZZMCA2KC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/03/2020",
        "dateOfIncident": "02/17/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315829,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 LEXUS RX350. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. BERLIN CITY TOYOTA OF PORTLAND LOCATED AT (191 RIVERSIDE ST, PORTLAND, ME 04103), CONFIRMED THAT PARTS WERE NOT AVAILABLE. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE MAINTENANCE REQUIRED WARNING INDICATOR IS ILLUMINATED. VIN TOOL CONFIRMS PARTS WERE NOT AVAILABLE.",
        "vin": "2T2BZMCA1KC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/25/2020",
        "dateOfIncident": "11/20/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311495,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 2019 LEXUS RX350. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (ELECTRICAL SYSTEM) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. A DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT STATED THAT THE VEHICLE FAILED TO EXCEED 50 MPH WHILE DRIVING. THE CONTACT WAS UNSURE IF THE FAILURE TO EXCEED 50 MPH WAS CONNECTED TO THE RECALL. THE MANUFACTURER WAS NOT CONTACTED OR INFORMED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 6,903. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2T2BZMCA0KC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/21/2020",
        "dateOfIncident": "01/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300840,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 LEXUS RX350. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE). THE CONTACT STATED THAT LEXUS OF QUEENS (LOCATED AT 40-40 NORTHERN BLVD, LONG ISLAND CITY, NY 11101, (833) 457-3255) EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER HAD NOT BEEN MADE AWARE OF THE ISSUE. THE PART WAS NOT AVAILABLE FOR THE REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT. *JS",
        "vin": "2T2BZMCA2KC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/14/2020",
        "dateOfIncident": "12/31/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299356,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FLOOR/CARPET WET AT FRONT PASSENGER SIDE UNDER DASH DUE AIR CONDITIONING/DEFROST USAGE.",
        "vin": "2T2BZMCA7KC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/05/2019",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287058,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BLIND SPOT MONITORING ON PASSENGER SIDE ONLY WORKS ABOUT 50% OF THE TIME.  DRIVER'S SIDE IS FINE.  SYSTEM ON PASSENGER SIDE DOES NOT REGISTER OR \"SEE\" ABOUT HALF OF THE VEHICLES WHEN OVERTAKING OR BEING OVERTAKEN.",
        "vin": "JTJGZKCA6K2"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "08/30/2019",
        "dateOfIncident": "08/19/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252457,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 LEXUS RX350. WHILE DRIVING WITH THE ADAPTIVE CRUISE CONTROL ACTIVATED AND SET AT 72 MPH, THE DRIVER REDUCED THE SPEED TO APPROXIMATELY 60 MPH WHEN SWITCHING LANES. AFTER RELEASING THE ACCELERATOR PEDAL, THE VEHICLE CONTINUED TO ACCELERATE PAST THE SET CRUISE CONTROL SPEED OF 72 MPH AND CONTINUED TO ACCELERATE TO APPROXIMATELY 80 MPH. AFTER DEACTIVATING THE CRUISE CONTROL FEATURE, THE VEHICLE CONTINUED TO ACCELERATE AND THE RPMS INCREASED BEFORE THE SPEED EVENTUALLY WAS REDUCED. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. LEXUS ESCONDIDO (1205 AUTO PARK WAY, ESCONDIDO, CA) AND THE MANUFACTURER WERE NOTIFIED OF THE FAILURE. PRIOR TO THE FAILURE, THE VEHICLE HESITATED WHILE ACCELERATING AND WAS SERVICED. THE SAME LEXUS DEALER REPROGRAMMED/FLASHED THE TRANSMISSION, BUT THE FAILURES CONTINUED. THE FAILURE MILEAGE WAS 2,800.",
        "vin": "JTJDZKCA5K2"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/01/2019",
        "dateOfIncident": "03/31/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193046,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR ABRUPTLY JERKS FORWARDS OR SLOWS DOWN WHEN SWITCHING GEARS.  THERE IS A KNOCKING SOUND WHEN YOU ACCELERATE.  THE RPM INCREASE TO 6K-7K BEFORE THE NEXT GEAR IS ENGAGED AND THEN CAR ABRUPTLY THRUSTS FORWARD.  THE CAR ACCELERATES AND DECELERATES RANDOMLY.  THIS CAR CANNOT BE DRIVEN SAFELY IN THIS CONDITION.  THE CAR ONLY HAVE 1116 MILES AND IS A 2019 MODEL.",
        "vin": "JTJBZMCA6K2"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/18/2019",
        "dateOfIncident": "03/15/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11189744,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 LEXUS RX350. WHEN IT RAINED, WATER ENTERED THE VEHICLE AND CAUSED THE PARK ASSIST SYSTEM TO MALFUNCTION. THE INSTRUMENT PANEL ILLUMINATED AS IF THE VEHICLE WAS ABOUT TO REAR END THE PRECEDING VEHICLE AND THE \"LEXUS PARK ASSIST NOT AVAILABLE\" INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO LEXUS OF GREENVILLE (864-551-2359, LOCATED AT 2660 LAURENS RD, GREENVILLE, SC 29607) WHERE IT WAS DIAGNOSED THAT THERE WAS A DESIGN FLAW. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND HAD TWENTY-FOUR HOURS TO CALL THE CONTACT BACK. THE VEHICLE WAS NOT REPAIRED. THE CONTACT TRADED IN A 2018 MODEL FOR THE CURRENT VEHICLE DUE TO THE SAME FAILURE. THE FAILURE MILEAGE WAS 980.",
        "vin": "2T2BZMCA2KC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/20/2019",
        "dateOfIncident": "02/15/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11181322,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE BACK DOOR HATCHBACK IS IS VERY HAVEY ONCE THE TO CLOSE BUTTON IS PRESSED THERE IS NO WAY TO STOP AND DOOR CRASHED EVERY THING ON ITS WAY. THIS DOOR HAS NO SENSOR IT MUST BE FIXED IMMEDIATELY BEFORE IT WOULD RESULT IN A CHILD DEATH OR A MAJOR INJURY!",
        "vin": "JTJGZKCA3K2"
    }
]