[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/24/2022",
        "dateOfIncident": "10/23/2021",
        "fire": false,
        "manufacturer": "KTM North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448739,
        "products": [
            {
                "manufacturer": "KTM North America, Inc.",
                "productMake": "KTM",
                "productModel": "790 ADVENTURE R",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The Display screen that offers all the info for the motorcycle has condensation inside. The motorcycle is always garaged other than when it's being ridden. There is still condensation inside the display. Sometimes vital motorcycle information isn't visible, such as ABS mode, Traction control mode, speed, rpm, etc.  Vehicle has not been inspected. Through the forums I have heard many stories of others having the same issue and dealers replacing the screen in some cases if the condensation is bad enough but the issue usually returns.",
        "vin": "52LBE222XNE"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/30/2021",
        "dateOfIncident": "07/03/2019",
        "fire": false,
        "manufacturer": "KTM North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445681,
        "products": [
            {
                "manufacturer": "KTM North America, Inc.",
                "productMake": "KTM",
                "productModel": "790 ADVENTURE R",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Hello,   I purchased this motorcycle new in July 2019.    It currently has 9,100 miles.    Since new it takes a minimum of 3-4 times to start and stay running at first start of the day.   After that it starts easy and on the first try.     Temperature at first start has been anywhere from upper 30's° to upper 70's°.    Altitude from 500' - 4,500', basically starts the same in all instances.    It seems as if it's only running on one cylinder and then \"chuffs\" and dies. Repeat, repeat, repeat.   When it finally \"catches\" R.P.M. will rise up around 1,500ish R.P.M. and run smoothly.   On its first few attempts the engine will barely make it to 900-1,000 R.P.M. before dying.        Thank you for your assistance with this issue.",
        "vin": "VBKTR3402KM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/15/2020",
        "dateOfIncident": "12/15/2020",
        "fire": false,
        "manufacturer": "KTM North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383590,
        "products": [
            {
                "manufacturer": "KTM North America, Inc.",
                "productMake": "KTM",
                "productModel": "790 ADVENTURE R",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AT APPROX 5K MILES MY FRONT BRAKE STARTED GRABBING AND PULSING AT LOW SPEEDS UNDER CONSTANT LEVER PRESSURE. IT EVENTUAL GOT SO BAD THAT I FELT I COULDNT SAFELY CONTROL THE BIKE WHEN USING THE FRONT BRAKE AT LOW SPEEDS. THE DEALER WAS ABLE TO GET A WARRANTY REPLACEMENT OF THE DISKS AND PADS. APPROXIMATELY 5K MILES LATER THE PROBLEM HAS REOCCURED. THIS TIME KTM REFUSED TO COVER THE COST SO THE DEALER SUGGESTED I TRY A 3RD PARTY DISK AND PAD REPLACEMENT.     ONLINE AT ADVRIDER.COM, A MOTORCYCLE FORUM THERE ARE 16 PAGES OF POSTS INCLUDING VIDEO'S WITH SEVERAL INSTANCES OF RIDERS HAVE THEIR FRONT BRAKES LOCK UP WHILE RIDING AND NOT BEING APPLIED RESULTING IN THE RIDER BEING THROWN OFF THE BIKE. I THINK THE PROBLEM IS VERY DANGEROUS AND COULD RESULT IN RIDERS BEING KILLED.",
        "vin": "VBKTR3405KM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/09/2020",
        "dateOfIncident": "08/24/2019",
        "fire": false,
        "manufacturer": "KTM North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11382783,
        "products": [
            {
                "manufacturer": "KTM North America, Inc.",
                "productMake": "KTM",
                "productModel": "790 ADVENTURE R",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE MOTORCYCLE FRONT BRAKES STARTED PULSING AND GRABBING DURING BRAKING AT ALL SPEEDS.  IT WAS MORE NOTICEABLE AT SPEEDS BELOW 20MPH WHEN COMING TO A COMPLETE STOP.",
        "vin": "VBKTR3407KM"
    },
    {
        "components": "STEERING,SUSPENSION,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/09/2020",
        "dateOfIncident": "12/09/2020",
        "fire": false,
        "manufacturer": "KTM North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11382801,
        "products": [
            {
                "manufacturer": "KTM North America, Inc.",
                "productMake": "KTM",
                "productModel": "790 ADVENTURE R",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BIKE HAS HAD AND STILL DOES HAVE MULTIPLE PROBLEMS  SHOCK FAILED TWICE,  REAR BRAKE HOSE MELTED AND MADE BRAKES UNUSABLE WHILE I WAS ON A TRIP IN MEXICO  FRONT BRAKES EXPERIENCED PULSATING SENSATION THAT PROGRESSIVELY GOT WORSE, KTM REPLACE THE  BRAKE ROTORS AND FRONT WHEEL HUB,  THE COUNTER SHAFT SPROCKET LEAKED OIL, KTM REPAIRED IT, BUT IT'S LEAKING AGAIN,  THE ENGINE USES A QUART OF OIL EVERY 150 MILES  A BOLT ON THE STEERING HEAD BROKE WHILE I WAS RIDING CAUSING A LOOSE SENSATION IN THE STEERING",
        "vin": "VBKTR3400KM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/02/2020",
        "dateOfIncident": "10/28/2020",
        "fire": false,
        "manufacturer": "KTM North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372614,
        "products": [
            {
                "manufacturer": "KTM North America, Inc.",
                "productMake": "KTM",
                "productModel": "790 ADVENTURE R",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL THREE BRAKE ROTORS (2 FRONT, 1 REAR) ARE COMING LOOSE FROM THEIR SUPPORT POINTS WITH THE VEHICLE HAVING JUST OVER 4,000 MILES ON IT. THERE IS NO WAY TO TIGHTEN THE ROTORS. OTHER RIDERS HAVE REPORTED CATASTROPHIC BRAKING FAILURES AS A RESULT.    A VIDEO OF THE LOOSE ROTORS IS AVAILABLE HERE: HTTPS://PHOTOS.APP.GOO.GL/WH9RTBWQKG9T6TYN9",
        "vin": "VBKTR340XKM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/29/2020",
        "dateOfIncident": "07/31/2019",
        "fire": false,
        "manufacturer": "KTM North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331598,
        "products": [
            {
                "manufacturer": "KTM North America, Inc.",
                "productMake": "KTM",
                "productModel": "790 ADVENTURE R",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WARPED FRONT ROTORS CAUSE STRONG PULSING WHEN FRONT BRAKE APPLIED WHICH IS DESTABILIZING WHEN ON CURVY MOUNTAIN ROADS OR AT HIGHWAY SPEEDS AND SUDDEN BRAKING REQUIRED. FRONT ROTORS WARPED WITH 1200 MILES ON THE ODOMETER AND KTM REFUSED TO REPLACE UNDER WARRANTY SAYING THIS IS A \"WEAR ITEM\". ROTOR THICKNESS IS WEAR BUT WARPING IS NOT WEAR, ESPECIALLY ON A NEW BIKE. HAVING DONE MORE  RESEARCH ONLINE SINCE MY FIRST ATTEMPT TO GET ROTORS REPLACED LAST YEAR, I SEE IT HAS AFFECTED NUMEROUS OTHER OWNERS, SOME OF WHICH HAVE SUCCESSFULLY HAD ROTORS REPLACED UNDER WARRANTY OTHERS NOT. I BROUGHT INTO DEALER AGAIN LAST MONTH TO SEE IF THEY WOULD REPLACE BUT AGAIN WAS REFUSED. NOT SURE WHY SOME DEALERS / OWNERS HAVE BEEN SUCCESSFUL GETTING WARRANTY DONE BUT SEEM LIKE A KNOWN ISSUE TO KTM AND SHOULD BE RECALL. THANKS FOR YOUR ATTENTION TO THE MATTER",
        "vin": "VBKTR3403KM"
    }
]