[
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/15/2022",
        "dateOfIncident": "02/15/2022",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452147,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COOPER",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Entire Driver Side Tail Lamp assembly stopped working (includes running light, brake light, reverse light, and blinker). Dash board did display warning (while driving) of lights malfunction, but nevertheless stopped working while driving. Upon further Inspection, found a “short” / melted pig tail (electrical connector) connecting to the rear of the lamp assembly. (Both the connector and pig tail showed signs of melted plastic/fire hazard). After further investigation, I realized this is not an isolated incident as I found multiple threads/posts on the Mini Cooper (F56) Internet forums, in which multiple owners complained of the same issue (many posting pictures as I have), which dates back many years, link to forum attached.  https://www.minif56.com/threads/rear-left-lights-not-working.80537/",
        "vin": "WMWXP7C58K2"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/17/2020",
        "dateOfIncident": "08/15/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349959,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COOPER",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON ROAD DRIVER'S SIDE ROLL OVER BAR JUST POPPED UP. I'M CONCERNED THAT IF CAR WOULD HAVE ROLLED OVER PASSENGER WOULD HAVE BEEN CRASHED.  ALREADY NOTIFIED MIN  ICOOPER  WAITING FOR A RESPONSE. CAR WILL BE SERVICE THIS WEEK.",
        "vin": "WMWWG5C50K3"
    },
    {
        "components": "STEERING,POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/01/2018",
        "dateOfIncident": "06/27/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115073,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COOPER",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A BRAND MODEL AND BRAND NEW CAR THAT I HAD JUST PURCHASED AND WAS DRIVING HOME FROM BUYING IT- I HAD NOT EVEN OWNED FOR A COUPLE OF HOURS. WHILE ON MY WAY HOME VEHICLE MALFUNCTIONED AND HAD NEAR FATAL COLLISION.  WHILE DRIVING ON HIGHWAY - AT HIGHWAY SPEED I WAS UNABLE TO CONTROL CAR AND MAINTAIN SPEED. ENGINE SEEMINGLY LOCKED UP AND AS I WAS UNABLE TO CONTROL CAR ALMOST CAUSED A NEAR FATAL COLLISION AS CAR BEHIND ME DID NOT REALIZE I WAS LOSING SPEED. TAKEN TO DEALERSHIP AND THEY NOTED THE CRANKSHAFT SPEED PULSE GENERATOR SENSOR HAD MALFUNCTIONED.",
        "vin": "WMWXP5C55K2"
    },
    {
        "components": "STEERING,POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/01/2018",
        "dateOfIncident": "07/23/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115082,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COOPER",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS SECOND INCIDENT THAT OCCURRED WITH BRAND NEW MINI COOPER 2019 WITH SAME EXACT ISSUE THAT AGAIN ALMOST CAUSED A NEAR FATAL ACCIDENT. WHILE DRIVING ON HIGHWAY, AT HIGHWAY SPEED THE CAR PRECIPITOUSLY MALFUNCTIONED AND CAR LOCKED UP AND WOULD ALLOW ME TO MAINTAIN SPEED- NOR ACCELERATE. I WAS UNABLE TO MAINTAIN SPEED OF THE CAR THEREFORE STARTED TO LOSE SPEED AND DECELERATE. THE VEHICLES BEHIND ME COULD NOT TELL THAT I WAS SUDDENLY LOSING SPEED AND I WAS ALMOST INVOLVING A NEAR FATAL COLLISION AGAIN. I HAD BEEN DRIVING ON THE HIGHWAY FOR ABOUT 5 -10 MINUTES PRIOR TO THIS PRECIPITOUSLY OCCURRING. THIS WAS THE SAME SITUATION I EXPERIENCED WITH A BRAND NEW MINI COOPER 2019 MODEL A WEEK EARLIER. THE CAR WAS TOWED TO THE DEALERSHIP AND THEY NOTED THAT THE CRANK SHAFT SPEED PULSE GENERATOR SENSOR WAS NO GOOD AND HAD MALFUNCTIONED. AS THIS IS A REPEAT ISSUE AND VERY SERIOUS AS IT ALMOST CAUSED 2 NEAR FATAL INCIDENTS, I AM CONCERNED THAT THE MAKER OF THE VEHICLE IS NOT DOING THEIR DUE DILIGENCE TO ENSURE THAT OTHER 2019 MODELS ARE SAFE. I HAVE BEEN TOLD OTHER MINI MODELS WERE HAS EXPERIENCED SAME MALFUNCTION.  THIS INCIDENT AND THE OTHER BOTH OCCURRED AT HIGHWAY SPEED WHICH CREATES A VERY DANGEROUS SET UP AFTER THE VEHICLES HAD BEEN DRIVEN FOR A FEW MILES ON THE HIGHWAY AND IN WET CONDITIONS.",
        "vin": "WMWXP5C59K2"
    }
]