[
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/21/2022",
        "dateOfIncident": "03/15/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11457723,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Nissan Altima. The contact stated while driving 60 MPH the vehicle sunroof shattered without impact. The contact stated no warning light was illuminated. The contact had small cuts to his right shoulder from glass but had not needed medical attention. The contact had taken the vehicle to a local dealer, where it was not diagnosed or repaired. The manufacturer had not been informed of the failure. The failure mileage was approximately 66,081.",
        "vin": "1N4BL4EV3KC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/20/2022",
        "dateOfIncident": "03/12/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11457508,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 Niss Altima 3-12-2022 McDonald County, MO     Vehicle was rammed and forced off the road causing the vehicle crash into trees. The vehicle received heavy damage to the front and rear.  AIR BAGS DID NOT DEPLOY.   The driver struck his head on steering wheel or windshield.   Sheriff's office investigating.  Nissan has not been notified yet.  Towing yard and sent pictures to the insurance company.  Driver and passenger was put in great risk.",
        "vin": "1n4bl4dv1kc"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/23/2022",
        "dateOfIncident": "10/22/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453721,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The right passenger side doors won’t lock, you have to manually unlock and locked front passenger and back passenger door",
        "vin": "1N4BL4DV0KC"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/18/2022",
        "dateOfIncident": "02/17/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452696,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The car regularly automatically slams on the brakes for no reason when there is nothing ahead of me. While in parking garages, turning on divided highways and worst of all while crossing railroad tracks. Dealership just brushed off my concerns because it wouldn't do it for them, and I don't think they checked my car at all. I also get a collision system malfunction warning, sometimes while driving and other times while sitting still. This is DANGEROUS, one day I will either be rear ended or God forbid hit by a train.",
        "vin": "1N4BL4CV5KC"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "01/27/2022",
        "dateOfIncident": "01/21/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449141,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Forward Emergency Braking/Collision Warning - Activated without cause or other indication -  The vehicle suddenly applied brakes - then released them - two occasions - on 01/21/2022 a New Castle County Police Department vehicle following me swerved into adjacent lane to avoid collision  Dealer service was unable to replicate event/s - no other vehicle inspections.  No other previous indicators or warnings,    Second event occurred on 01/23/2022 at about 30 mph.",
        "vin": "1N4BL4EV6KC"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/22/2022",
        "dateOfIncident": "01/20/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448473,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "At about 12 months we noticed an intermittent clunking sound from the rear of the car. We took it to the dealer and was advised they could not duplicate the problem.  I went to have the car state inspected 1/20/22 and it failed. Both reared shocks were determined to be bad, one of which was leaking badly.  I brought the car back to a Nissan dealer and was told nothing could be done as my mileage was 45,000. I was told the repair would be approx. $800.   Most of my miles are easy highway miles. There obviously was a defect in the shock observers or the assembly of them. No way should new shocks be needed in a car a little over 3 years old with 45K miles on it",
        "vin": "1n4bl4dv6kc"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/17/2021",
        "dateOfIncident": "12/16/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444157,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Passenger and Rear Doors do not unlock with the electronic locks or manually, has happened multiple times.",
        "vin": "1N4AL4FV7KC"
    },
    {
        "components": "EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/01/2021",
        "dateOfIncident": "12/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442214,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "There is no incident.   I am writing about the safety hazards of the oncoming blue bright lights coming from the oncoming cars/trucks SUV's etc. I own a Sedan and on a highway these blue lights ( in all new vehicles) blind you. The trucks and SUV's are having so bright light that it is difficult to drive. The adaptive lights are no good on a dark two lane road, specially on a road with snow. This is more dangerous on an incline where the vehicles are coming at fast on a two lane dark road.  In my opinion the Blue lights should be banned and instead the yellow lights should be made compulsory for all vehicles.",
        "vin": "1N4AL4FVXKC"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "11/02/2021",
        "dateOfIncident": "09/07/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438996,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving to work and all of a sudden the warning came on for the front radar malfunctioning. I have taken my car to the dealership where I get the oil changes and was told that Nissan would not cover it. I was told I needed a front distance bracket and quoted almost $800 for repair. The rep told me that the mechanic said I had a aftermarket bumper on my car and i explained that my car was in an accident twice in the months of april and may. but that should not be the reason of the problem because the light was never on my car when both accidents ocurred and after repairs. We are in the month of september why would it be on now? This is my only source of transportation and I feel for my safety with this car that something else could happen while I'm driving and I pray that it don't. The same day it started malfunctioning a small animal ran under my car. It has been times that while on the highway othere drivers would cut me off or get to close and my sensor want alert me. Thank goodness I be watching the road.",
        "vin": "1N4BL4BVXKC"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "09/24/2021",
        "dateOfIncident": "09/30/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434159,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The forward collision warning malfunctions and a warning light is displayed. This used to be an intermittent problem which now occurs every time I drive the vehicle. This is an important safety feature in the vehicle.",
        "vin": "1n4bl4dv4kc"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/23/2021",
        "dateOfIncident": "07/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434024,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Nissan Altima. The contact stated while making right turns there was an abnormal clanking noise coming from the vehicle without warning. The contact had taken the vehicle to a dealer and informed her that the axle was defective and needed to be replaced. The manufacturer was notified of the failure but offered no assistance. The vehicle remained at the dealer and was not repaired. The failure mileage was approximately 60,000.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/06/2021",
        "dateOfIncident": "07/27/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428097,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I was out of town when my car stopped on me the car could not detect my key i kept getting the warning key id incorrect my car would not start i had to get it towed to the nissan dealership in lake city Florida were they put it on the diagnostic system  no code pulled up they programmed a new key to it it still didn't work so they finally told me they didn't know what wrong with it  a week later i all them and they tell me it was my computer module that it had went out I've only had the car 1yr and half bought it brand new i was out of town stranded at a gas station no way to get home only option they gave me was to trade it in they end up auctioning the car off because it would have cost them to much to fix it",
        "vin": "1N4BL4DV4KC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/15/2021",
        "dateOfIncident": "07/07/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425015,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The transmission failed /malfunctioned. It’s available for inspection upon request. My safety and the safety of others was put at risk when the vehicle stalled at a traffic light or in the middle of traffic. Took the vehicle to autozone to be scanned and they confirmed it was the transmission. The vehicle has not been inspected by the dealer yet because I would have to paid between $200-350 to have the vehicle towed to the dealership where the vehicle was purchased which is two hours away.  The local dealership charges $130 to diagnosis my vehicle. There were no warning lamps or messages prior to the failure.  The CVT message appeared on my dashboard after the vehicle stalled and would not accelerate more than 5 miles or would not move at all upon acceleration of the gas. In addition to the current transmission issue, I have also had the brake light switch adjusted twice.  The failure of the brake light switch drained the vehicle battery resulting in having the battery replaced as well.",
        "vin": "1N4BL4EVXKC"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "07/03/2021",
        "dateOfIncident": "06/15/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423370,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The Automatic Emergency Braking System continuously brakes and slows the car down when driving. One particular incident happened on 6/15/2021 when I was travelling at 45MPH and there we cars behind me. The system beeped as if it detected a crash and then stop the car. There were no other cars in front on me and I almost got into an accident because of the sudden braking. There were no warning lamps, messages, or anything else that would prompt the vehicle to immediately break. It has done this 3 more times in the last two weeks and its hazardous to me and other drivers on the road.  Now every time I put my vehicle in drive it says AEB malfunction and the vehicle no longer detects forward collisions or any passengers. I haven't taken the vehicle to the dealership yet; however, I had an oil change and when the dealer inspected my vehicle they said everything was in good shape. I'm not sure how this was missed.",
        "vin": "1N4BL4BV4KC"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/02/2021",
        "dateOfIncident": "06/29/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423203,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The windshield was randomly cracked without having any impact marks. The car was parked with no cracks on a sunny day and i came to my car within any hour to a cracked windshield. The issue is well know with these vehicles. I have plenty of pictures for evidence as well. Below are pictures of people with similar problems",
        "vin": "1N4BL4BV5KC"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/02/2021",
        "dateOfIncident": "06/23/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423267,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Upper left side wind shield. I went to kill a mosquito and pushed it up against the windshield with my hand and the windshield cracked. It was very little pressure.",
        "vin": "1N4BL4BV6KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/01/2021",
        "dateOfIncident": "06/27/2021",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423123,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Nissan Altima. The contact stated while driving at an undisclosed speed, the vehicle started shaking and vibrating. Additionally, there was an odor of burning rubber. During the failure, the vehicle would not immediately stop while depressing the brake pedal. The vehicle was taken to an independent mechanic to be diagnosed. The contact was informed that the passenger’s side rear brake caliper was faulty and that the entire rear braking system needed to be replaced. The vehicle was not yet repaired. The manufacturer and local dealer were notified of the failure. The vin was not available. The failure mileage was 46,593.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/25/2021",
        "dateOfIncident": "06/18/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422271,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle has noise from rear differential . Dealership confirms the noise is the rear electric cuppling . Dealership states no recall or warranty for this concern . The 2019 Nissan Rouge which utilizes the same AWD system , including the same electric cuppling with the exact same part number has an open & active recall , yet Nissan has chosen to  NOT recall the Altima . Dealership states they suspect \"there's not many AWD Altimas to cause a recall.\" The fact that both vehicles utilize the same exact AWD system including the same cuppling with the same part # should warrant a recall across all vehicles utilizing that system , not just one .",
        "vin": "1N4BL4DWXKC"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "06/25/2021",
        "dateOfIncident": "06/25/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422299,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "driving at maybe 10 -15 MPH in an empty parking lot about to park and car aggressively brakes for no reason. Completely startled and unsettled me its a good thing no one was behind me.",
        "vin": "1n4bl4cv6kc"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "06/24/2021",
        "dateOfIncident": "06/03/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422161,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Nissan Altima. The contact stated while driving at 70 mph,  the vehicle lane sensor activated on its own and pulled the vehicle towards the right lane where the driver was going towards the oncoming vehicle. The driver was able to force the vehicle back to the center lane and continue to drive to their destination, however, the failure reoccurred multiple times. The contact took the vehicle to the local dealer who inspected the vehicle and turned off sensor from car the lane sensor electronic feature from the vehicle. We have no lane sensor to use. The manufacture was not made aware of the failure. The failure mileage was 11,000.",
        "vin": "1n4bl4ev8kc"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/16/2021",
        "dateOfIncident": "04/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421141,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Ewr Volpe Acme Inc.",
                "productMake": "TBD",
                "productModel": "TBD",
                "productYear": "9999",
                "type": "Vehicle"
            }
        ],
        "summary": "I had Bought the car from a dealership upon buying I never realized that it had a chuck of tread missing once it was in my possession and cleaned it at my residence",
        "vin": "1N4BL4EV4KC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/18/2021",
        "dateOfIncident": "01/15/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417612,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONTACT OWNS A 2019 NISSAN ALTIMA. THE CONTACT STATED WHILE DRIVING, THE RPM STARTED TO FLUCTUATE PRIOR TO THE VEHICLE STALLING WITHOUT WARNING. ADDITIONALLY, ON SEVERAL OCCASIONS, WHILE AT A STOP LIGHT, THE VEHICLE SUDDENLY TURNED OFF WITHOUT WARNING. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE AIR INTAKE SENSOR WAS FAULTY AND NEEDED TO BE REPLACED. THE AIR INTAKE SENSOR WAS REPLACED HOWEVER, THE FAILURE PERSISTED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 12,000.  THE CONSUMER STATED THE VEHICLE WAS REPAIRED 3 TIMES, BUT THE FAILURE PERSISTED.",
        "vin": "1N4BL4CVXKC"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/17/2021",
        "dateOfIncident": "05/03/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417522,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The Check engine light came on and I took it to Nissan dealer. My car is at 39,000 mileage. On the previous Nissan Altima (2016) I had, the same thing happened while I was driving from Minnesota to Louisville. We almost crashed at Chicago due to some engine issue. When I arrived to Louisville, KY, I stopped by Nissan dealership and ask them what happen and they told me it will take up to two weeks to fix but recommended to get a new vehicle. I had no choice but to change to a new 2019 Nissan. Now the same thing is happening to this new Nissan Altima and Nissan is not willing to fix the issue without charge. This is very frustrating. I been having issue with the door not unlocking with a remote and they fixed it once and now I have the same issue they are willing to fix again. But My main concern is not the door but the engine light they refuse to fix. Please help.",
        "vin": "1N4BL4BV2KC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/16/2021",
        "dateOfIncident": "05/16/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417363,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Noise when shift from d to p or reverse",
        "vin": "1N4BL4BV8KC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "05/16/2021",
        "dateOfIncident": "03/22/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417372,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Was reported in a head on collision with an F150 on 3/22/21",
        "vin": "1N4BL4CV8KC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/08/2021",
        "dateOfIncident": "05/08/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415664,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE FOR LOCK ACTUATOR BROKE. PREVIOUS YEAR NISSANS HAS THIS EXACT SAME RECALL A COUPLE YEARS AGO. CAR ONLY HAS 44,000 MILES ON IT, THE ACTUATORS SHOULD NOT BE GOING ALREADY.",
        "vin": "1N4BL4CV9KC"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/18/2021",
        "dateOfIncident": "03/11/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403657,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD TWO SEPARATE INCIDENTS 8 MONTHS APART. WHILE DRIVING IN THE CITY LIMITS ON BOTH OCCURRENCES  GOING ABOUT 45 MPH BOTH TIMES, WITHOUT ANY NOTICE OR POTENTIAL  COLLISION THE AEB ENGAGED, AND A RED FLASH CAME ACROSS MY DASHBOARD. THE FIRST TIME IT WAS JUST ME IN THE CAR WITH VERY LITTLE TRAFFIC AROUND ME, WHEREAS WITH THE MOST RECENT OCCURRENCE THE TRAFFIC WAS HEAVIER. I HAD MY MOTHER AND 2 YOUNG CHILDREN IN THE BACKSEAT, WITH  A TRUCK THAT LOOKED LIKE A F-150 NOT FAR BEHIND ME. I HAVE BEEN TO THE DEALERSHIP THAT I BOUGHT THE CAR FROM, AND I HAVE TWICE GOTTEN THE RESULTS THAT THEY ARE UNABLE TO DUPLICATE THE PROBLEM, SO I GUESS IT CAN'T BE RECTIFIED. THANKFULLY I HAVE NOT HAD AN ACCIDENT, BUT DRIVING THE CAR IN THAT CONDITION RAISES THE RISK OF A COLLISION, AND I'M DONE WITH THAT RISK.",
        "vin": "1N4BL4DV6KC"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/17/2021",
        "dateOfIncident": "03/17/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403478,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "IN 2020 IN THE MONTH OF AUGUST, I BOUGHT MY FIRST CAR FROM HONDA OF FORT MYERS LOCATED IN FLORIDA. THE CAR SEEMED LIKE IT WAS A GREAT CAR. HOWEVER, THE CAR BEGIN TO HAVE MINOR PROBLEMS LIKE I DISCOVER A CLUNG NOISE COMING FROM UNDER THE CAR. WHEN I TOOK IT TO GET IT CHECK, THE TECHNICIAN DISCOVERED THAT ONE OF THE BREAK PADS WAS LOOSE. THAT WAS JUST ONE OF PROBLEM. THE MAIN PROBLEM AND COMPLAINT THAT I HAVE IS THE CAR WAS SOLD TO ME WITH THREE BENT RIMS. AFTER DISCOVERING A SHAKE WHEN I REACH 40 MPH, I TOOK IT TO GET LOOKED AT BECAUSE I THOUGHT IT WAS THE TIRES. ONCE I TOOK IT IN TO GET NEW TIRES, THE TIRE TECHNICIAN TOOK A LOOK AT IT AND REALIZED THAT IT WAS THE RIMS AND NOT THE TIRES. SO I DECIDED TO GO BACK TO WHERE I BOUGHT IT FROM AND THEY TOLD ME IT WAS NOTHING I CAN DO BECAUSE I BOUGHT THE CAR AS IF.",
        "vin": "1N4BL4BVXKC"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/19/2021",
        "dateOfIncident": "01/07/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388773,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER PURCHASING VEHICLE, I REALIZED THE DRIVER'S SIDE SEATBELT DOESN'T LOCK SECURELY IN PLACE ONCE FULLY EXTRACTED. I CALLED THE DEALER THAT I PURCHASED THE VEHICLE FROM & THEY STATED THAT NONE OF THE NISSANS ON THEIR LOT DRIVERS SEATBELTS LOCKS IN PLACE ONCE FULLY EXTRACTED. I FIND IT STRANGE THAT EVERY OTHER SEATBELT INSIDE MY ALTIMA LOCKS IN SECURELY EXCEPT FOR THE DRIVER'S SIDE. I THINK THAT'S A MAJOR SAFETY (YET BASIC) HAZARD ON A VEHICLE WITH MULTIPLE COMPLEXED SAFETY FEATURES. NOTHING HAPPENED PER SAY YET, I WANT TO GET THIS ADDRESSED BEFORE IT'S TO LATE & SOMETHING DOES OCCUR. I JUST PULSE LIKE THIS PREVENTATIVE OBSERVATION HANDLED AT YOUR EARLIEST CONVENIENCE. PURCHASE DATE 01/07/2020.",
        "vin": "1N4BL4CV2KC"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/16/2021",
        "dateOfIncident": "12/14/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388430,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM FILING THIS COMPLAINT TO LET YOU KNOW THAT NISSANS WINDSHIELDS ARE VERY BRITTLE. I WENT TO SMUSH A BUG AND IT SHATTERED IT. THIS HAS BEEN AN ONGOING PROBLEM IN OUR 6TH GEN NISSAN ALTIMA GROUP AND WE WANT IT TO GET FIXED. THIS IS A SAFETY CONCERN, AND NOT ONLY TO MENTION HOW EXPENSIVE THE WINDSHIELDS ARE.",
        "vin": "1N4BL4BV1KC"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "01/11/2021",
        "dateOfIncident": "12/24/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387480,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING STRAIGHT OVER THE UPPER ROADWAY GW BRIDGE, MY AUTOMATIC BRAKES ENGAGED WITH NO OBJECTS IN FRONT OF MY CAR. THIS CAUSED MY FRONT BRAKES TO LOCK WHICH CAUSED ME TO DRIFT LEFT INTO THE LEFT LANE, AT WHICH POINT I WAS ALMOST CRUSHED BY A SPEEDING 18-WHEEL TRUCK.",
        "vin": "1N4BL4BV3KC"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/21/2020",
        "dateOfIncident": "12/03/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384465,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A SLIGHTLY DAMP ROAD IN THE EVENING (DARK). A WARNING FLASHED ON MY DASHBOARD SAYING THAT THEIR WAS OBSTRUCTION IN THE ROAD. SUDDENLY MY BRAKING ASSISTANCE ACTIVATED CAUSING MY CAR TO COME TO A COMPLETE STOP. I CHECKED MY SURROUNDINGS, NOTHING WAS IN THE ROAD, BESIDE ME, OR BEHIND ME. NISSAN HAS NOT CLAIM RESPONSIBILITY FOR THIS SENSOR ERROR. INSTEAD TOLD ME THAT THERE WERE DAMAGES TO MY BUMPER, WHICH WAS HARD TO BELIEVE. I WAS RECOMMENDED TO CONTACT MY INSURANCE COMPANY. AN APPRAISER FOUND NO DAMAGES TO MY CAR OR BUMPER.  CASE HAS BEEN DISMISSED BY INSURANCE COMPANY.",
        "vin": "1N4BL4CW9KC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/09/2020",
        "dateOfIncident": "11/13/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378666,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY REAR DOORS WON'T UNLOCK OR LOCK USING THE KEY FOB OR PRESSING THE UNLOCK/LOCK BUTTON ON MY DOOR. I HAVE TO MANUALLY LOCK IT OR UNLOCK IT. THIS HAPPENED OUT OF NOWHERE. I CHECKED THE FUSE BOX BUT ALL FUSES ARE GOOD.",
        "vin": "1N4BL4CV7KC"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "11/30/2020",
        "dateOfIncident": "11/20/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377032,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN ALTIMA. THE CONTACT STATED THAT WHILE DRIVING, THE AUTOMATIC EMERGENCY BRAKING SENSOR LIGHT RANDOMLY ILLUMINATED. ON ONE OCCASION WHILE DRIVING APPROXIMATELY 35 MPH, THE AUTOMATIC EMERGENCY BRAKING SENSOR LIGHT ILLUMINATED AND THE VEHICLE ABRUPTLY STOPPED. DURING THE FAILURE, THERE WERE NO VEHICLES OR OBJECTS PRESENT NOR IN NEAR PROXIMITY TO THE VEHICLE. THE VEHICLE WAS TAKEN TO NISSAN OF GREENVILLE LOCATED AT 2712 LAURENS RD, GREENVILLE, SC 29607 WHERE THE MECHANIC REPROGRAMMED THE AUTOMATIC EMERGENCY BRAKING SYSTEM. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 24,000. INVALID VIN.",
        "vin": "1N4BL4FZXKC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/25/2020",
        "dateOfIncident": "10/23/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366267,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THREE SEPARATE OCCASIONS, UPON SHIFTING THE CAR INTO PARK, WITH THE PROXIMITY KEY WITHIN 3-4 FEET OF THE CAR, THE ENGINE SHUT OFF.  ON EACH OCCASION THE CAR WAS RESTARTED WITH NO APPARENT PROBLEM.",
        "vin": "1N4BL4DV4KC"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/19/2020",
        "dateOfIncident": "10/19/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365176,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN ALTIMA. THE CONTACT STATED THAT WHILE DRIVING AT 30 MPH WITH THE INTELLIGENT PILOT FEATURE ENGAGED, A DEER ABRUPTLY DARTER IN FRONT OF THE VEHICLE. THE INTELLIGENT PILOT FAILED TO OPERATE AS NEEDED AND NO WARNING LIGHTS ILLUMINATED. DUE TO THE FAILURE, THE CONTACT HAD TO SWERVE LEFT OF CENTER ON AN OFF RAMP WHICH CAUSED HIM TO SLAM INTO THE BACK OF AN 18 WHEELER TRUCK. NO INJURIES WERE REPORTED AT THE SCENE OF THE ACCIDENT. A POLICE REPORT WAS NOT FILED AND THE VEHICLE WAS ABLE TO DRIVEN AWAY FROM THE SCENE. AFTER THE ACCIDENT OCCURRED, THE PARKING SENSOR ERROR AND CHASSIS CONTROL SYSTEM ERROR WARNING MESSAGES HAD ILLUMINATED ON THE INSTRUMENT PANEL. THE DEALER NOR THE MANUFACTURER HAD YET TO BE NOTIFIED OF THE FAILURE. THE VEHICLE HAD YET TO BE REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 9,000.",
        "vin": "1N4BL4DV4KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/07/2020",
        "dateOfIncident": "10/02/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11363204,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN ALTIMA. THE CONTACT STATED THAT WHEN DRIVING AT 20 MPH, THE CONTACT ENGAGED THE BRAKE PEDAL ATTEMPTING TO BRING THE VEHICLE TO A STOP. THE VEHICLE FAILED TO STOP AND CRASHED INTO A MAIL DELIVERY TRUCK. THE CONTACT STATED THAT MAIL DELIVERY TRUCK DID NOT RECEIVE ANY DAMAGE. THE CONTACT STATED THAT THE EMERGENCY BRAKE MALFUNCTION WARNING LIGHT ILLUMINATED WHILE THE BRAKE PEDAL WAS ENGAGED. THE FRONT BUMPER WAS FRACTURED. THE CONTACT DROVE THE VEHICLE TO AN UNKNOWN AUTO REPAIR GARAGE. THE CONTACT SUFFERED INJURIES TO THE LEFT SHOULDER, THE CONTACT DID NOT RECEIVED MEDICAL ATTENTION.  THE VEHICLE WAS NOT REPAIRED. THE CONTACT ALSO ADVISED THAT THE VEHICLE SHOULD COME TO A COMPLETE STOP ON ITS OWN WHEN COMING TOO CLOSE A VEHICLE. THE MANUFACTURER WAS NOT CONTACTED. A POLICE REPORT WAS FILED. THE APPROXIMATE FAILURE MILEAGE WAS 2,300. *DT*JB",
        "vin": "1N4BL4DW1KC"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/22/2020",
        "dateOfIncident": "09/22/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360372,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I TRY TO START MY CAR, THE STEERING WHEEL AND BREAK PEDAL ARE LOCKED. WHEN I PRESS THE BRAKE AND PUSH THE START BUTTON NOTHING HAPPENS. THE BATTERY IS CHARGED AND THERE IS NO CORROSION ON THE CABLES.",
        "vin": "1N4BL4BV8KN"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/29/2020",
        "dateOfIncident": "08/21/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351997,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLES AUTOMATIC EMERGENCY BRAKING (AEB) SYSTEM DOES NOT OPERATE PROPERLY.  THIS VEHICLE HAS ALREADY HAD A RADAR REPLACED. THE VEHICLE CONTINUES TO BRAKE WHEN IT SHOULDN'T.",
        "vin": "1N4BL4EV8KC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/25/2020",
        "dateOfIncident": "04/18/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351158,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FORWARD COLLISION WARNING SYSTEM NOT WORKING . PROVABLY THE FRONT GRILL SENSOR (BOSH)   IS BAD. CAR IS UNDER WARRANTY.  BUT DEALER DON'T WANT FIX IT",
        "vin": "1N4BL4CV3KC"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "07/16/2020",
        "dateOfIncident": "02/13/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339727,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN ALTIMA. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 45-50 MPH, THE VEHICLE STALLED WITH THE AUTOMATIC EMERGENCY BRAKING (AEB) WARNING LIGHT ILLUMINATED. THE VEHICLE INDEPENDENTLY RETURNED TO NORMAL OPERATION. THE CONTACT STATED THAT THE FAILURE RECURRED 6 TIMES. THE VEHICLE WAS TAKEN TO NISSAN OF QUEENS (93-25 ROCKAWAY BLVD, OZONE PARK, NY 11417, (718) 835-8300) AND THE CONTACT WAS INFORMED THAT THE AEB SENSOR WAS FACING DOWNWARDS. THE SENSOR POSITION WAS ADJUSTED HOWEVER, THE FAILURE RECURRED. THE VEHICLE WAS TAKEN BACK TO THE SAME DEALER AND THE CONTACT WAS INFORMED THAT THE AEB SENSOR WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF FAILURE AND A CASE WAS FILED. THE APPROXIMATE FAILURE MILEAGE WAS 7,800. *LN*JB",
        "vin": "1N4BL4CW7KC"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/06/2020",
        "dateOfIncident": "06/16/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337636,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM HAVING AN ISSUE WHILE DRIVING THAT MY CAR IS SAYING MY FRONT SENSOR IN BLOCKED CAUSING MY CAR TO RANDOMLY AUTOMATIC BREAK WHILE NO OTHER CARS ARE AROUND ME. I TOOK MY CAR TO NISSAN IN CHERRY HILL, NJ WHERE I BOUGHT THE CAR EIGHT MONTHS AGO. THEY TOLD ME THAT THE SENSOR WAS BENT AND MY CAR WAS HIT OR IN AN ACCIDENT. LET ME SPECIFY THAT I WAS NOT IN AN ACCIDENT, AND MY CAR WAS NOT HIT BY ANOTHER CAR. THERE ARE NO MARKS ON THE FRONT OF MY CAR THAT WOULD GIVE THEM REASON TO SAY MY CAR WAS IN AN ACCIDENT. I TAKE MY CAR TO GET SERVICED AT A NON- NISSAN DEALERSHIP. NISSAN OF CHERRY HILL IS TRYING TO BLAME THAT COMPANY FOR THE \"DAMAGE\" THAT NEVER HAPPENED.",
        "vin": "1N4BL4CW2KC"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/27/2020",
        "dateOfIncident": "04/20/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331242,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY LEFT SIDE TIRE IS IS WORN ALL MY OTHER TIRES ARE FINE ANYTIME I TURN RIGHT IT MAKES A GRINDING NOISE AND THE TRACTION CONTROL LIGHT COMES ON.  *TR",
        "vin": "1N4BL4BW6KC"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "06/23/2020",
        "dateOfIncident": "03/02/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330313,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN ALTIMA. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS THE COLLISION AVOIDANCE SYSTEM WOULD RANDOMLY ACTIVATE AND REDUCE THE VEHICLE'S SPEED. THE FAILURE OCCURRED ALTHOUGH NO OBJECTS WERE PRESENT NEARBY. THE CAUSE OF THE FAILURES WERE NOT DETERMINED. IN ADDITION, WHILE DRIVING APPROXIMATELY 35 MPH AND PRESSING THE BRAKE PEDAL THE VEHICLE SLOWED BEFORE THE BRAKING SYSTEM MALFUNCTIONED CAUSING THE VEHICLE NOT TO STOP AND CRASHED INTO THE REAR OF A TRUCK. NO INJURIES WERE REPORTED AND NO POLICE WAS CALLED TO THE SCENE. THE MANUFACTURER AND LOCAL DEALER WERE NOT NOTIFIED OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 16,000.",
        "vin": ""
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/15/2020",
        "dateOfIncident": "06/15/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329005,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE EMERGENCY BREAKING SYSTEM HAS ENGAGED MULTIPLE TIMES WHEN THERE WAS NOTHING IN FRONT OF THE VEHICLE. THE VEHICLE WAS IN MOTION AROUND A CURVE WHEN THE BREAKING SYSTEM ENGAGED AND BROUGHT MY CAR TO A STOP. IF THERE WAS ANYONE BEHIND ME I WOULD HAVE BEEN HIT.  *TR",
        "vin": "1N4BL4EV5KC"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/01/2020",
        "dateOfIncident": "03/17/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326806,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DOORS ARE NOT LOCKING OR UNLOCKING... KEY FOB, INTERIOR SWITCH, AND ACTUAL KEY WORKS SOMETIMES BUT NEVER AT THE SAME TIME!  *TR",
        "vin": "1N4BL4CV4KC"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/04/2020",
        "dateOfIncident": "12/24/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323238,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A SIGNIFICANT GLARE ON THE WINDSHIELD THAT IS EXTREMELY DISTRACTING. THIS OCCURS IN SUNNY WEATHER. I HAVE PICTURES OF THIS, AT ONE POINT IT ALMOST BLOCKED OUT A TRAFFIC LIGHT. THE GLARE--AND I AM TALKING ABOUT THE DRIVER'S SIDE OF COURSE, COMES FROM A COMBINATION OF THE HUMP AND FINISH ON THE PART OF THE DASHBOARD NEAREST THE WINDSHIELD. NO SATISFACTION FROM NISSAN.",
        "vin": "1N4BL4FV8KC"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/23/2020",
        "dateOfIncident": "02/18/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319086,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD WASHER PRESSURE IS NOT ADEQUATE ENOUGH TOP CLEAN THE WINDSHIELD",
        "vin": "1N4BL4EW7KC"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/02/2020",
        "dateOfIncident": "02/28/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315546,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR DOOR LOCKING / UNLOCKING. REAR DOOR DOSEN'T LOCK NOR UNLOCK FROM KEY FOB NOR BUTTON ON DRIVER SIDE DOOR PANEL IT HAS TO BE MANUALLY LOCKED AND UNLOCKED.",
        "vin": "1N4BL4BV9KC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/21/2020",
        "dateOfIncident": "08/06/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310672,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "EMERGENCY BRAKING, WITH NO NEAR BY OBSTRUCTION WHILE DRIVING DOWN THE INTERSTATE ON THREE OCCASIONS. ALL DRIVING AT 45-70 MILES PH. BRINGS CAR TO A COMPLETE IMMEDIATE STOP WITH NO WARNING. REAR BREAKING WITH NO NEAR BY OBSTRUCTION, NOT ABLE TO BACK CAR OUT FOR FIVE MINS, CAR WOULD NOT DISENGAGE. INSTANCED HAPPENED ON 1-40 WEST IN NASHVILLE TN AND THE REAR BREAKING HAPPENED AT VILLIAS BY THE SEA IN JEYKLL ISLAND GA  TAKEN THE CAR BACK TO THE DEALER ON 6 SEPARATE OCCASIONS FOR THIS EXACT ISSUE WITH NO RESOLUTION.",
        "vin": "1N4BL4FV7KC"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/03/2020",
        "dateOfIncident": "12/27/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306837,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING OR STATIONARY OF THE VEHICLE. WHEN SPRAYING WATER ON THE WINDSHIELD FROM THE WINDSHIELD WASHER SPRAYERS, IT ONLY SPRAYS ON THE BOTTOM OF THE WINDSHIELD AND DOES NOT COVER THE ENTIRE WINDSHIELD. YOU HAVE TO CONTINUOUSLY SPRAY WATER SO THE WIPERS CAN SPREAD THE WATER ON THE WINDSHIELD. BUT DOING THIS DOES NOT ALWAYS MAKE THE WINDSHIELD CLEAN. THIS IS A HUGE SAFETY CONCERN. THE WATER SPRAYS ON THE UNDERSIDE OF THE HOOD AND THEN ONTO THE WINDSHIELD. THE DEALER HAS NOT YET BEEN ADVISED OF THIS ISSUE. THE WAY THE WASHER SPRAYERS ARE MOUNTED, I DOUBT THAT THE PROBLEM CAN BE EASILY FIXED.",
        "vin": "1N4BL4DW9KN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/22/2020",
        "dateOfIncident": "08/02/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301211,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN ALTIMA. THE CONTACT STATED WHILE DRIVING 35 MPH, THE VEHICLE STARTED TO HESITATE. THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO LOCAL DEALER MCDONOUGH NISSAN LOCATED AT 1775 AVALON PKWY, MCDONOUGH, GA 30253, (770) 282-5077, WHERE THEY WERE UNABLE TO DUPLICATE THE FAILURE. THE CONTACT STATED THE FAILURE RECURRED AND WAS INTERMITTENT. THE MANUFACTURER WAS INFORMED OF FAILURE. THE FAILURE MILEAGE WAS 8,200.",
        "vin": "1N4BL4BV9KC"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "01/17/2020",
        "dateOfIncident": "11/20/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300003,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAGS DID NOT DEPLOY WHEN I WAS IN A CAR ACCIDENT AT 45 MPH.  THE RADIO GOES CRAZY AND TURNS UP WIDE OPEN WHILE NO ONE TOUCHES THE CONTROLS.",
        "vin": "1N4BL4CV4KC"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/28/2019",
        "dateOfIncident": "12/13/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291726,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE WAS IN MOTION ON A CITY STREET. I WENT TO MAKE A TURN BECAUSE OF A CURVE AND MY STEERING WHEEL AND BRAKE WOULD NOT WORK. MY EMERGENCY BRAKE SYSTEM (WHICH IS SUPPOSE TO STOP MY VEHICLE BEFORE IMPACT, DID NOT DEPLOY. I RAN STRAIGHT INTO A STONE WALL AND FENCE. I RECEIVED A RECALL LETTER IN THE MAIL ABOUT THE BACK SENSOR, BUT MY SENSORS WERE WORKING UP UNTIL MY ACCIDENT. MY VEHICLE WAS DEEMED TOTALLED. IT WAS NOT RAINING, I WAS NOT SPEEDING, AND WHEN THE POLICE CAME OUT TO DO AN INVESTIGATION, THEY COULD ONLY DETERMINE THAT IT WAS A MECHANICAL PROBLEM. WHY DID THE SENSOR NOT WORK? WHY DIDN'T MY CARS EMERGENCY BRAKE SYSTEM NOT WORK? NOW I'M HAVING TO GET A NEW VEHICLE WITHOUT EVEN KNOWING WHY THE SAFETY SYSTEMS PUT IN PLACE DID NOT DEPLOY. THANK GOD MY SON WAS NOT IN THE CAR AND NO ONE ELSE WAS INJURED.",
        "vin": "1N4BL4CV6KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/23/2019",
        "dateOfIncident": "12/23/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291002,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC EMERGENCY BRAKING SYSTEM HAS SERIOUS ISSUES THAT NISSAN KNOWS ABOUT BUT CAN'T FIX. WARNING LIGHTS ON DASH COME ON AT RANDOM TIMES, BOTH SOLIDLY OUT AND FLASHING, AND EVEN WORSE, AT TIMES WITH NO OTHER CARS ON THE HIGHWAY, THE VEHICLE DECIDES TO SLAM ON THE BRAKES. VERY DANGEROUS.  ALL THE DEALER CAN SAY IS WE CHECKED THE CAR AND NO CODES WERE FOUND, YET THERE ARE MULTIPLE COMPLAINTS ABOUT THIS AND TWO CLASS ACTION LAWSUITS. SAME THING HAPPENS AT RANDOM TIMES WHEN BACKING OUT OF MY DRIVEWAY. DIFFERENT SYSTEM IN THE CAR BUT SAME RESULT - CAR BRAKES FOR NO REASON - NOTHING BEHIND ME, NO OBSTRUCTIONS. NOT QUITE AS SERIOUS AS THE FRONT EMERGENCY BRAKES NOT WORKING BUT STILL AN ISSUE. THIS HAS HAPPENED MULTIPLE TIMES BUT I ENTERED TODAY'S DATE AS TODAY WAS THE LATEST OCCURRENCE.",
        "vin": "1N4BL4EW0KC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/20/2019",
        "dateOfIncident": "10/12/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290403,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BACK SEAT DOORS DO NOT LOCK WHEN PRESSING THE AUTOMATIC LOCK BUTTON LOCATED ON THE INSIDE OF THE DOORS, AND WHEN PRESSING THE LOCK BUTTON ON THE REMOTE KEY. VEHICLE WAS STATIONARY.",
        "vin": "1N4BL4CV1KN"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/18/2019",
        "dateOfIncident": "12/05/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289805,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN ALTIMA. WHILE DRIVING 20 MPH AND DEPRESSING THE BRAKE PEDAL TO MAKE A RIGHT TURN, THE VEHICLE FAILED TO STOP AND SHOOK VIOLENTLY. IN ADDITION, THE INSTRUMENT PANEL ILLUMINATED, INDICATING A MALFUNCTION. AS A RESULT, THE CONTACT REAR ENDED ANOTHER VEHICLE. THE AIR BAG DID NOT DEPLOY. THERE WERE NO INJURIES AND A POLICE REPORT WAS FILED. THE VEHICLE WAS DRIVEN TO A COLLISION CENTER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT CALLED SUBURBAN NISSAN OF FARMINGTON HILLS (37901 GRAND RIVER AVE, FARMINGTON HILLS, MI 48335, (248) 471-0800) AND SCHEDULED A DIAGNOSTIC APPOINTMENT. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED CASE NUMBER: 38133183. THE FAILURE MILEAGE WAS 2,790.",
        "vin": "1N4BL4EW3KC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/24/2019",
        "dateOfIncident": "11/19/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282029,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING UNDER AN OVERPASS AND CAR STARTED BEEPING AND BRAKING AS I WAS GOING TO HIT SOMEONE IN FRONT OF ME AND NO CAR WAS IN FRONT OF ME.",
        "vin": "1N4BL4BW8KC"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/21/2019",
        "dateOfIncident": "10/03/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281508,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST RECEIVED A NOTICE BY GOING TO CONSUMER REPORTS THAT VEHICLE WAS RECALLED? NEVER RECEIVED ANYTHING.  ALSO, CAR IS NEWLY LEASED AND HAS AN OIL CHANGE STICKER THAT SAYS:  CHANGE OIL BY 5/29/19 ?  WHAT , THIS DEALER HERE HAS ALSO BEEN REPORTED FOR CONSUMER PROTECTION ACT HERE IN MELBOURNE FL.  NISSAN OF MELBOURNE. I AM IGNORED WHEN I CALL, OR ASKED TO LEAVE  BY THE GENERAL MANAGER THAT IS REALLY OBNOXIOUS.",
        "vin": "1N4BL4DV5KC"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/24/2019",
        "dateOfIncident": "07/11/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270880,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BACK IN THE JULY I GOT INTO A REAR END COLLISION, THE EMERGENCY BRAKING SHOULD HAVE KICKED IN BUT IT DID NOT. SINCE THEN, THE EMERGENCY BRAKING HAS APPLIED MULTIPLE TIMES IN THE OPEN BY ITSELF WITH NO CARS AHEAD OR IN VIEW. IT MAKES ME VERY NERVOUS TO DRIVE THIS. IT HAS HAPPENED BOTH ON CITY STREETS AND THE HIGHWAY. I TRIED TELLING THE NISSAN DEALERSHIP AND THEY HAVE NO KNOWLEDGE AND ARE NOT WILLING TO WORK WITH ME FOR FAILURE AND DAMAGES.",
        "vin": "1N4BL4CV9KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/01/2019",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265454,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE HAD MY VEHICLE FOR 1 MONTH AND ON AT LEAST 10 DIFFERENT OCCASIONS MY AEB SYSTEM HAS LOCKED MY BRAKES UP ON ME FOR NO REASON. EACH TIME I'VE BEEN DRIVING STRAIGHT AND IT'S BEEN IN MY WORK PARKING GARAGE WHEN NO OTHER VEHICLES OR PEOPLE ARE IN MOTION AROUND ME. ALTHOUGH I'VE BEEN LUCKY SO FAR AND IT HASN'T CAUSED ME TO BE REAR ENDED I STILL SEE THE POTENTIAL FOR THAT HAPPENING IF THIS CONTINUES AND IS NOT FIXED.",
        "vin": "1N4BL4FWXKC"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/26/2019",
        "dateOfIncident": "08/05/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258425,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN ALTIMA. THE CONTACT STATED THAT THE REARVIEW MIRROR DID NOT ADJUST HIGH ENOUGH FOR PROPER VISIBILITY. THE CONTACT LOWERED THE SEAT MORE THAN NECESSARY IN ORDER TO SEE THE ROAD. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DID NOT RESPOND. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 100.",
        "vin": "1N4BL4CV4KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/09/2019",
        "dateOfIncident": "06/01/2019",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11254091,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC EMERGENCY BRAKING (AEB) FUNCTION FAILED AT A RED LIGHT. AEB HAD BEEN SET IN A 3-VEHICLE DISTANCE. HOWEVER, UPON ARRIVING AT THE RED LIGHT, ON A CITY STREET, WITH ANOTHER VEHICLE IN FRONT OF US, NISSAN ALTIMA 2019 DIDN'T ACTUALLY RESPOND TO THE CONDITION AND KICK OFF ITS AEB SYSTEM TO 1) SLOW DOWN 2) STOP THE MOVING VEHICLE. THIS IS A DRIVING EXPERIENCE DATED ON JUNE 01 2019.",
        "vin": "1N4BL4DW1KN"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/16/2019",
        "dateOfIncident": "07/10/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244666,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 NISSAN ALTIMA. CONSUMER WRITES IN REGARDS TO ISSUES WITH UNINTENDED ACCELERATION. *LD  *JS",
        "vin": "1N4BL4CW6KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/12/2019",
        "dateOfIncident": "08/11/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243270,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT RENTED A 2019 NISSAN ALTIMA. WHILE DRIVING 50 MPH, THE ABS ACTIVATED ON ITS OWN AND THE CONTACT SLAMMED ON THE BRAKE PEDAL. THE FAILURE OCCURRED SEVERAL TIMES. THE DEALER AND MANUFACTURER WERE NOT CONTACTED. THE CONTACT DID NOT KNOW IF THE VEHICLE WERE DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS 2,500. THE VIN WAS INVALID.   *LN  *TR",
        "vin": "1N4BL4BV8KC"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/27/2019",
        "dateOfIncident": "07/16/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11235256,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ADAPTIVE CRUISE CONTROL AND AUTOMATIC BRAKING ARE DISABLED DUE TO \"FRONT RADAR BLOCKED\".  THIS IS A BRAND NEW VEHICLE I HAVE HAD FOR ABOUT TWO WEEKS (LESS THAN 1,000 MILES).  AFTER DOING SOME INTERNET RESEARCH, THIS APPEARS TO BE A KNOWN ISSUE WITH NISSAN VEHICLES SINCE 2018.  I BELIEVE MY VEHICLE WAS MANUFACTURED IN LATE 2018.    THE ISSUE WAS FIRST NOTICED WHILE DRIVING WITH THE CRUISE CONTROL ENGAGED AND I KEPT GETTING CLOSER TO THE VEHICLE AHEAD OF ME WITHOUT MY VEHICLE AUTOMATICALLY SLOWING DOWN (I.E., THE CAR MAINTAINED THE CRUISE CONTROL SET SPEED.)  AFTER MANUALLY BRAKING AND RESETTING THE CRUISE CONTROL, THE CRUISE CONTROL WOULD EVENTUALLY SHUT OFF AND THE ATTACHED MESSAGE WOULD BE DISPLAYED.    PRIOR TO THE ISSUE BEING OBSERVED (APPROX. FIRST 500 MILES DRIVEN), THE ADAPTIVE CRUISE CONTROL AND AUTOMATIC BRAKING WORKED FINE.",
        "vin": "1N4BL4EV5KN"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/17/2019",
        "dateOfIncident": "07/15/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232928,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2019 NISSAN ALTIMA AWD AND HAVE EXPERIENCED A FEW PROBLEMS.  THE MOST SIGNIFICANT PROBLEM IS THE DEFECTIVE FORWARD COLLISION SAFETY FEATURE. TWO TIMES THE VEHICLE HAS IMPROPERLY AND ABRUPTLY APPLIED BRAKES,  THE FEATURE IS INTENDED TO AVOID COLLISION, BUT INSTEAD ITS MALFUNCTION IS CREATING ROAD HAZARDS. I CONTACTED NISSAN CONSUMER AFFAIRS AND THEY HAVE EVADED ME AND EVERYTIME I CALL THEY SAY YOU HAVE BEEN ASSIGNED A CASE AND SOMEONE WILL CALL YOU SOON. I ATTEMPTED TO SERVICE THE VEHICLE TWO TIMES THIS WEEK AT TWO DIFFERENT NISSAN DEALERSHIPS.  ONE TURNED ME AWAY STATING IT'S A KNOWN PROBLEM AND NISSAN DOES NOT HAVE A FIX YET.  THE SECOND NISSAN DEALERSHIP WAS IN THE PROCESS OF ISSUING ME AN ALTERNATE VEHICLE WHEN THEY RECEIVED A CALL FROM THE SAME FOLKS WHO WON'T RETURN MY CALL NISSAN CONSUMER AFFAIRS INSTRUCTING THE DEALER NOT PERFORM ANY SERVICE OR A LOANER. THIS IS SO OUTRAGEOUS, BUT I ACTUALLY HAVE IT IN WRITING TO PROVE THE LEVEL OF NEGLIGENCE AND ILL SERVICE TO FORCE A CUSTOMER TO STAY IN A VEHICLE THAT THEY DON'T FEEL SAFE IN. NONE THE LESS THEIR FAILURE TO DO THEIR DUE DILIGENCE. THE SAFETY FEATURE MALFUNCTIONED ON THE HIGHWAY ONCE AND THE NEXT TIME ON A INCLINE RAMP IN MALL PARKING GARAGE TO A FORCEFUL HARD STOP. I HAVE SPOKEN WITH 3 GENERAL MANAGERS AND 3 DIFFERENT CONSUMER AFFAIRS CALL CENTER REPS, BUT YET NO SERVICE OR CALL BACK FROM NISSAN NORTH AMERICA.  NEGLIGENT NEGLIGENCE NEGLIGENT. NISSAN IS NOT WHAT IT USED TO BE. STAY FAR AWAY AND TELL EVERYONE YOU KNOW TO STAY FAR AWAY.  I AM THE OWNER OF A MODEL YEAR VEHICLE WITH FULL WARRANTY AND THIS IS HOW THEY ARE TREATING ME.  WHAT WOULD YOU GET?",
        "vin": "1N4BL4BW6KC"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/16/2019",
        "dateOfIncident": "07/11/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232626,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INTELLIGENT FORWARD COLLISION WARNING IS BROKEN WARNING LIGHTS COME ON AND SAY IT'S NOT WORKING DRIVING ON THE FREEWAY, WHEN YOU TURN OFF THE CAR IT RESETS BUT DRIVING AGAIN IT SHOWS THE WARNING LIGHTS AGAIN. ONLY 6000 MILES",
        "vin": "1N4BL4CV7KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/05/2019",
        "dateOfIncident": "07/05/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229510,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CARS AEB WOULD ACTIVATE WITH NO OBSTRUCTION ON THE CITY ROAD WHILE THE VECHICLE IS IN MOTION. WOULD BRAKE REALLY HARD AND RELEASE. NEED HELP!",
        "vin": "1N4BL4CV4KC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/05/2019",
        "dateOfIncident": "06/19/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11229515,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD AN ACCIDENT ON  THE HIGHWAY AND OBTAINED SEVERE FRONTAL DAMAGE TOTALING OVER 5000.00 AND THE AIRBAGS DID NOT DEPLOY AT ALL,   I PURCHASED THE VEHICLE 0N THE 30TH OF MAY 2019",
        "vin": "1N4BL4BVXKC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/28/2019",
        "dateOfIncident": "06/26/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11223169,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MAY 1ST, 2019 I WAS DRIVING THE VEHICLE AT A RATE OF 70 MILES PER HOUR ON INTERSTATE 25 IN DENVER, COLORADO AND THE CAR COMPLETELY STALLED OUT. THE COMPUTER SCREEN INSTRUCTED ME TO SHIFT THE CAR INTO PARK. IT TOOK ME APPROXIMATELY 3 MINUTES TO GET THE CAR TO START AGAIN VIA THE PUSH TO START BUTTON. THIS WAS OCCURRING IN THE MIDDLE OF THE INTERSTATE DURING HEAVY VOLUME OF TRAFFIC. DEALERSHIP CLAIMS IT WAS NOT NORMAL BUT COULD NOT TELL ME WHY.    JUNE 26TH, 2019 THE VEHICLE AGAIN STALLED OUT WITHOUT WARNING WHILE I WAS TRAVELING APPROXIMATELY 45 MPH ON COLORADO BLVD. IN DENVER, CO. THE VEHICLE AGAIN PROMPTED ME VIA THE COMPUTER TO SHIFT THE CAR INTO PARK. I THEN SHIFTED AND PUSHED THE PUSH TO START BUTTON AND IT DID RESTART.     BOTH INSTANCES THE CAR WAS IN MOTION AT HIGH SPEEDS, ONCE WAS HIGHWAY THE OTHER A BUSY STREET. I WAS GOING STRAIGHT BOTH TIMES. I WAS BREAKING SLIGHTLY BOTH TIMES.    COMPLETELY UNSAFE VEHICLE.",
        "vin": "1N4BL4CW5KC"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/31/2019",
        "dateOfIncident": "05/22/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217217,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN USING THE WINDSHIELD WIPER FLUID IT BARELY SHOOTS OUT. IT ONLY COVER 1/4 OF THE WHOLE WINDSHIELD. THIS BECAME VERY DANGEROUS WHEN I WAS DRIVING BACK HOME IN THE HIGHWAY WHEN LOVEBUGS COVERED MY WINDSHIELD.",
        "vin": "1N4BL4BV1KC"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/26/2019",
        "dateOfIncident": "03/09/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210036,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ALONG A HIGHWAY IN THE MIDDLE LANE, MY FIANC HEARD A LOUD NOISE THAT SOUNDED LIKE A LOUD BANG. HE THOUGHT SOMETHING HAD FALLEN ON TOP OF THE SUNROOF BUT FOUND IT STRANGE BECAUSE THERE WAS NO TREES AROUND FOR THAT TO HAPPEN. WHEN HE STOPPED AND GOT OUT OF THE CAR, HE FOUND THAT THE ENTIRE WINDSHIELD HAD SHATTERED INTO LITTLE PIECES. LUCKILY HE WAS NOT INJURED AND NO GLASS CAME THROUGH THE CAR BECAUSE THE SHIELD WAS CLOSED. THERE WERE NO DENT OR IMPACT MARKS ON THE SUNROOF OR ANY PART OF THE CAR. WHEN WE HAD A MECHANIC LOOK AT IT, HE TOLD US THAT THE BREAK BAND FROM THE INSIDE AND WAS ALMOST 'PUSHED UP' IN A WAY. NISSAN HAD DENIED OUR CLAIM, AND PAYING THE DEDUCTIBLE AND GETTING IT FIXED, I STILL HEAR A RATTLING NOISE COMING FROM ABOVE.",
        "vin": "1N4BL4CVXKC"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/25/2019",
        "dateOfIncident": "05/19/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209980,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GAS TANK NOTIFICATION SAYS THAT I HAVE NO GAS WHEN I HAVE GAS IN THE CAR IT ALSO GIVES ME A BURNT SMELL AND LOUD STATIC NOISE EVEN WHEN THE CAR IS OFF, THE STEREO STOPPED WORKING AND I JUST BOUGHT THE CAR 5/5/19",
        "vin": "1N4BL4CV5KC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "05/10/2019",
        "dateOfIncident": "05/03/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206883,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR ENGINE RUNNING PARKED IN DRIVEWAY. I WAS IN THE HOUSE.  SON WAS ON PORCH.  YELLED THAT CAR WAS MOVING.  WHEN IT SAW THAT IT WAS BACKING UP I RAN TO TRY TO STOP IT.  THE CAR BACKED DOWN MY DRIVEWAY, WHICH WAS FLAT WITH NO INCLINE, TO THE STREET, ACROSS THE STREET AND INTO THE NEIGHBOR'S HOUSE.  THE STREET IS QUIET A BIT HIGHER THAN DRIVEWAY BUT IT SEEMED TO PICK UP SPEED WHEN IT WENT OVER IT.  I REACHED IT RIGHT AS IT HIT THE NEIGHBORS HOUSE.  I CALLED POLICE DEPT.  VEHICLE WAS IN PARK THE ENTIRE TIME.  I TOOK IT TO NISSAN DEALERSHIP BUT THEY COULD NOT FIND ANYTHING THAT WOULD HAVE CAUSED IT TO DO THAT.   IF MY HANDICAP SON HAD BEEN GETTING IN VEHICLE WHEN THIS OCCURRED IT WOULD HAVE CAUSED HIM SERIOUS INJURY AND COULD HAVE CAUSED ANYONE THAT WOULD HAVE BEEN PASSING ON THE STREET OR IN THE NEIGHBORS YARD TO BE INJURED.  NEIGHBOR IS AN OLDER MAN AND HE WAS QUITE SHAKEN UP.  THE IMPACT SHOOK HIS HOUSE QUITE A BIT.  I HAVE BEEN AFRAID TO DRIVE IT.    WILL SUPPLY POLICE REPORT WHEN IT IS AVAILABLE FROM THE POLICE DEPT.",
        "vin": "1N4BL4DV0KC"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/12/2019",
        "dateOfIncident": "02/14/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195948,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I BECAME AWARE OF THE AUTOMATIC WINDSHIELD WASHER PROBLEM WHEN I TRIED TO CLEAR OFF DUST AND GRIME FROM OUR NEW 2019 NISSAN ALTIMA WHILE DRIVING ON THE HIGHWAY.  WHEN I ACTIVATED THE WASHERS TO CLEAN THE WINDSHIELD, THE WASHER FLUID BARELY SPLASHED ONTO THE BOTTOM OF THE WINDSHIELD.  I HAD TO REPEATEDLY ACTIVATE THE SYSTEM TO EVEN GET THE WINDSHIELD PARTLY CLEAN.       I WENT TO THE DEALERSHIP THE NEXT DAY TO GET THE PROBLEM FIXED.  TO MY CHAGRIN, I WAS TOLD NO ONE ELSE HAD COMPLAINED ABOUT THIS PROBLEM AND THAT THE WASHERS OPERATE AS THEY WERE DESIGNED TO DO.  BUT I WAS ALSO TOLD THAT THE PLACEMENT OF THE WINDSHIELD WASHER NOZZLES UNDER THE HOOD RESULTS IN THE FLUID STREAM HITTING THE UNDERSIDE OF THE HOOD FIRST AND THEN IT ONLY PARTLY HITS THE WINDSHIELD ABOUT 1/3 OF THE WAY UP ON THE WINDSHIELD.         I CONSIDER THIS TO BE A SERIOUS SAFETY ISSUE AND AN INEPT  DESIGN FLAW BECAUSE THE DEALERSHIP SAID THEY CANNOT ADJUST THE FLUID STREAM TO SHOOT UP ON THE WINDSHIELD THE WAY EVERY OTHER CAR IN THE WORLD DOES.  I HAVE TO LIVE WITH A BARELY CLEANABLE WINDSHIELD BECAUSE SOME DESIGNER NEVER TRIED OUT THE WASHERS IN THE REAL WORLD.  PLEASE LOOK INTO THIS SAFETY PROBLEM.",
        "vin": "1N4BL4EWXKC"
    },
    {
        "components": "PARKING BRAKE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/08/2019",
        "dateOfIncident": "03/19/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194635,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT LEASED A 2019 NISSAN ALTIMA. WHILE DRIVING UNDER 30 MPH, A RED LIGHT FLASHED FOR THE EMERGENCY BRAKE AND THE VEHICLE ABRUPTLY STOPPED. THE FAILURE CAUSED THE DRIVER AND FRONT PASSENGER SEATS TO JERK FORWARD. THE VEHICLE WAS DRIVEN HOME AND PARKED DUE TO THE FAILURE. IN ADDITION, THE CRUISE CONTROL FAILED TO PROPERLY ENGAGE AND DISENGAGE. THE CONTACT HAD TO CHECK THE COMPONENT TO ENSURE WHETHER IT WAS ON OR OFF. ALSO, THE EMERGENCY WARNING INDICATED FLASHED INTERMITTENTLY MORE THAN ONCE AND A CLUNKING NOISE WAS HEARD WHEN THE VEHICLE WAS IN OPERATION. THE VEHICLE WAS TOWED TO NISSAN 112 (730 MEDFORD AVE, PATCHOGUE, NY 11772, (631) 651-1987), BUT THEY COULD NOT DUPLICATE THE FAILURE. THERE WAS NO DIAGNOSTIC TROUBLE CODE PRESENT. THE VEHICLE WAS NOT REPAIRED. A SECOND DEALER (NISSAN OF HUNTINGTON, 850 E JERICHO TURNPIKE, HUNTINGTON STATION, NY 11746, (631) 533-4888) WAS NOTIFIED. THE MANUFACTURER WAS CONTACTED. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "1N4BL4FV5KC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/26/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191757,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD GLARE IS DISTRACTING WHEN DRIVING.",
        "vin": "1N4BL4CV7KC"
    },
    {
        "components": "SUSPENSION,WHEELS,SEATS",
        "crash": false,
        "dateComplaintFiled": "03/25/2019",
        "dateOfIncident": "01/11/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191401,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "1. PASSENGER SEAT VERY UNCOMFORTABLE, LITERALLY ON THE FLOOR, , NO MANUAL OR ELECTRICAL LUMBER SUPPORT OR ABLE TO RAISE OFF FLOOR, COMPLETELY UNACCEPTABLE! ALSO NO CRASH RATINGS ON GOVERNMENT STICKER.HOW IS NISSAN ALLOWED TO SELL TO CUSTOMERS. DANGEROUS. 2. NOISES COMING OUT OF FRONT END! NO ONE FIXING AFTER TWO MONTHS. 3. WINDSHIELD WIPER SPRAY SYSTEM SPRAY WASHER FLUID TO BOTTOM OF WINDSHIELD DANGEROUS. 4. 19' ALLOY WHEELS ARE IN ALL ACTUALITY 19' LOW PROFILE TIRES AND RIMS FEEL EVERY SINGLE LINE, BUMP, POT HOLE IN THE ROAD, SUSPENSION CAN NOT HANDLE NEITHER DO YOU FEEL NISSAN INTELLIGENT RIDE CONTROL. 5. NOISY CONSISTENTLY INSIDE OF CAR. 6.PARKING BRAKE SENSOR LITE WENT OFF TWICE WHEN DRIVING THAT THE PARKING BRAKE WAS ON HAD TO PHYSICALLY TURN OFF. 7. A E B , AUTOMATIC EMERGENCY BRAKING WARNING LIGHT WENT OFF FOR NO REASON. 8. EMERGENCY BRAKE LIGHT CAME ON WHILE DRIVING FOR NO REASON AND ABRUPTLY STOPPED CAR IN MIDDLE OF ROAD. 9. TRUCK GETS STUCK OPENING. 10 SELF PILOTING ADAPTIVE CRUISE CONTROL DON'T WORK IN LIGHT IN CLIMATE WEATHER. NO GOOD",
        "vin": "1N4BL4FV5KC"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/21/2019",
        "dateOfIncident": "03/18/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190480,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN ALTIMA. WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE MADE ABNORMAL BANGING NOISES COMING FROM THE FRONT AND REAR PASSENGER SIDES. THE DEALER AND MANUFACTURER WERE NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 800.",
        "vin": "1N4BL4EV5KC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/01/2019",
        "dateOfIncident": "11/10/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183488,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN ALTIMA. THE CONTACT STATED THAT VENT CONTROL FUNCTION FOR THE HEAT AND AIR CONDITIONER FAILED TO OPERATE. THE CONTACT PREVIOUSLY TRADED IN A 2016 NISSAN ALTIMA FOR WHICH AUTONATION NISSAN PEMBROKE PINES (8890 PINES BLVD, PEMBROKE PINES, FL 33024, (954) 949-0421) REPLACED THE AIR COMPRESSOR. CURRENTLY, THE 2019 ALTIMA WAS EXPERIENCING THE SAME FAILURE. THE DEALER DIAGNOSED THAT THE AIR COMPRESSOR NEEDED TO BE REPLACED. THE PART WAS TO BE REPLACED BY THE DEALER; HOWEVER, THE CONTACT FELT THAT THE OEM PART MAY BE FAULTY AND WOULD NOT PROVIDE A PERMANENT REMEDY. THE MANUFACTURER WAS NOTIFIED. THE CONTACT WANTED TO THE VEHICLE TO BE BOUGHT BACK IF THERE WAS NO REMEDY. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "1N4BL4BV8KC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/10/2018",
        "dateOfIncident": "11/30/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11160575,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEAD RESTS IN THIS CAR PUSH MY HEAD FORWARD AND I CAN'T SIT IN THE CAR WITH MY BACK AGAINST THE SEAT.  VERY HARD ON MY BACK.  I HAVE ADJUSTED THE HEAD REST TO ALL POSITIONS WITH NO LUCK.  THE ONLY THING THAT WORKS IS REMOVING IT AND PUTTING IT IN BACKWARDS.  THERE SHOULD BE SOME WAY TO ADJUST THIS!  NO WAY TO MAKE A LONG DRIVE WITH THIS HEAD REST.",
        "vin": "1N4BL4DV1KC"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/09/2018",
        "dateOfIncident": "11/09/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150420,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE REARVIEW 'ANTI-GLARE' MIRROR HARDLY REDUCES ANY LIGHT AT NIGHT FROM VEHICLES BEHIND THE CAR.  ALMOST IMPOSSIBLE TO DRIVE WITHOUT DISTRACTION OR BLINDING LIGHT.  THIS IS A DEFECT IN MANUFACTURING AND SHOULD BE REPLACED WITH A DESIGN THAT REDUCES LIGHT AT NIGHT.  AS IS, THIS IS A DANGEROUS DESIGN, WHICH CAN CAUSE A COLLISION DUE TO THE BLINDING LIGHT THAT IS NEARLY UNCONTROLLABLE.  YOU CAN SEE FROM THE PHOTOS THE MIRROR IS FUNCTIONING BUT IT'S ABSOLUTELY A TERRIBLE DESIGN THAT ALMOST DOESN'T REDUCE LIGHT AT ALL.",
        "vin": "1N4BL4EV5KC"
    }
]