[
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/26/2021",
        "dateOfIncident": "07/18/2021",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426548,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Wife t-boned a old style Subaru at 30 mph and the air bags did not deploy at all this was a 2019 mitibishi outlander se",
        "vin": "JA4AZ3A36KZ"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/26/2021",
        "dateOfIncident": "04/23/2021",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414012,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM A RIDESHARE DRIVER. ON FRIDAY, APRIL 23, 2021 PASSENGERS BEGAN TO COMPLAIN THAT THE RIGHT-SIDE SEAT BELT (ON THE 2ND ROW OF SEATS) WOULD NOT FASTEN. AFTER ARRANGING FOR PEOPLE TO MOVE AROUND TO THE OTHER SIDE (LEFT-HAND SEAT) FOR A WHILE, I FINALLY QUIT DRIVING TO DEAL WITH THE ISSUE MYSELF. AFTER NUMEROUS ATTEMPTS TO REPAIR THE BUCKLE, I GAVE UP AND STARTED CALLING AROUND FOR THE PART--BUT COULD NOT FIND IT.     FINALLY I NOTICED A RECALL NOTICE ONLINE FOR THIS EXACT SAME ISSUE IN 2014-2019 MITSUBISHI OUTLANDERS. ON MONDAY (APRIL 26) I CALLED SCOTT ELDER MITSUBISHI IN CEDAR PARK, TEXAS TO SCHEDULE THE RECALL REPAIR, BUT WAS TOLD THAT MY VIN NUMBER IS NOT COVERED UNDER THE RECALL.  THEY ALSO DID NOT HAVE THE PART AND COULD NOT OBTAIN ONE FOR AT LEAST A WEEK.     I THEN CALLED THE MANUFACTURER DIRECTLY TO LEARN WHY MY VEHICLE IS NOT COVERED FOR THE RECALL EVEN THOUGH IT IS A 2019 AND HAS THE EXACT SAME PROBLEM AS DESCRIBED IN THE RECALL NOTICE. THEY COULD NOT GIVE ME A SATISFACTORY ANSWER, NOR ANY ALTERNATIVE RECOURSE TO RESOLVE MY ISSUE.     AS STATED ABOVE, I AM A RIDESHARE DRIVER. I CANNOT DO MY JOB WITH AN UNUSABLE SEAT BELT. SWITCHING PASSENGERS TO THE OTHER SEAT WON'T ALWAYS WORK BECAUSE I OFTEN PICK UP 3 OR MORE PASSENGERS. EACH DAY I AM WITHOUT THE USE OF THE VEHICLE FOR WORK IS COSTING ME $250-$300 PER DAY (NOT COUNTING BONUSES).",
        "vin": "JA4AZ3A31KZ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/11/2021",
        "dateOfIncident": "01/10/2021",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387611,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN USING THE BRAKE AUTO HOLD I STEPPED ON THE GAS WHILE SCRATCHING MY SIDE AT THE SAME TIME TO CROSS THE ROAD. I ACCIDENTALLY UNBUCKLED MY SEAT BELT WHICH THEN CAUSED THE BRAKE AUTO HOLD TO DISENGAGE AND AUTOMATICALLY APPLY THE PARKING BRAKE. THIS CAUSED MY CAR TO STOP DIRECTLY IN FRONT OF ONCOMING TRAFFIC. I COULD NOT DISENGAGE THE PARKING BRAKE UNTIL I REBUCKLED MY SEAT BELT.",
        "vin": "JA4AD3A3XKZ"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/30/2020",
        "dateOfIncident": "12/17/2020",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385561,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE EPB (EMERGENCY PARKING BREAK) WAS SOME HOW ACTIVATED, NOT SURE IF BY ACCIDENT OR WIRING ISSUE AND NOW WILL NOT DISENGAGE.  I CANNOT DRIVE MY VEHICLE AND HAVE NOT BEEN ABLE TO GET IT INTO THE DEALER FOR 3 WEEKS.",
        "vin": "JA4AZ3A32KZ"
    },
    {
        "components": "STEERING,WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/07/2020",
        "dateOfIncident": "10/15/2019",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363127,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING IN THE RAIN THE CAR HYDROPLANED ON ME ON 5 SEPARATE OCCASIONS. IT HAPPENED TO ME WHEN AT A MILD TURN AT FREE WAY SPEEDS AND SOMETIMES WHEN STRONG WINDS HIT THE VEHICLE. LOSS OF TRACTIONS IS FELT AND THE CAR WANDERS INTO A DIFFERENT LANE. BREAKING PERFORMANCE WAS AFFECTED AS WELL.  THE STOCK TIRES THAT CAME WITH THE CAR PERFORM POORLY IN THE RAIN WHEN DRIVING AT FREEWAY SPEEDS. OVER ALL THE CAR IS GREAT AND THE TIRES SHOULD BE INSPECTED.  I LEARNED THAT I WAS NOT THE ONLY ONE WHO EXPERIENCED THIS AND DECIDED TO CONTACT NHTSA.",
        "vin": "JA4AD2A39KJ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/23/2020",
        "dateOfIncident": "03/19/2020",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319010,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS VEHICLE ON NOVEMBER 19TH.IT HAD 32 MILES WHEN I PULLED OFF THE CAR LOT. IN JANUARY, NEW BREAKS HAD TO BE PUT ON IT DUE TO WEAR AND LOUD SOUND. THEY WERE REPLACED. IN FEBRUARY, TERRIBLE SOUND COMING FROM BREAKS AGAIN. TAKEN TO SHOP, WORKED ON THEM AND ADVISED THEY JUST NEEDED TO BE OILED. BROUGHT BACK TO SHOP EARLY MARCH, SAME PROBLEM, THE WHOLE BREAK SYSTEM WAS REPLACED. NOW HERE IS IT MARCH 23RD AND THE SAME THING IS STARTING TO HAPPEN AGAIN, SCREETCHING, LOUD SOUND COMING FROM BREAKS.",
        "vin": "JA4AD3A37KZ"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/26/2020",
        "dateOfIncident": "12/20/2019",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11301971,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS WAITING IN RED LIGHT BETWEEN SUNRISE BLVD AND US1 WHEN A VEHICLE IN WRONG WAY CRASH MY VEHICLE IN THE FRONT. THE WHEEL AIR BAG DEPLOYED WRONG. I SAW THE RIGHT PART OF THE AIR BAG FLAT WHILE THE LEFT PART WAS FINE. IT CAUSED INJURES IN MY CHIN AND TONGUE, 5 RIBS, IN THE RIGHT PART OF MY BODY, BROKEN  AND STERNUM BROKEN TOO. CAUSING POSSIBLE CINTURILLA IN MY HEART AND BRUISES IN MY LUNGES.",
        "vin": "JA4AZ3A38KZ"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "12/19/2019",
        "dateOfIncident": "12/13/2019",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290032,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 12/13/2019 MY DAUGHTER HAD A ACCIDENT IN 2019 MISHIBISHI OUTLANDER SHE HIT FENCE FENCE POST ELECTRICITY BOX AND 2 SIGNS DOING DAMAGE ALL AROUND THE VEHICLE HER SEAT BELT NORE MY NEWPHEWS SEAT BELT LOCKED UP AND SHE HIT HER HEAD ON THE STEERING WHEEL THE PASSENGER IN THE VEHICLES SEAT BEAT LOCKED UP THE BACK SEAT BELT DIDNT LOCK UP  I HAVE ALOT OF PICTURES BUT WILL ONLY ALLOW ME TO UPLOAD ONE",
        "vin": "JA4AD2A34KZ"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "12/05/2019",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287142,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT DRIVERS SEAT IS LOOSE. IT IS ROCKING FROM THE BASE. I PURCHASED THE CAR NEW",
        "vin": "JA4JZ4AX4KZ"
    },
    {
        "components": "EXTERIOR LIGHTING,STRUCTURE,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/02/2019",
        "dateOfIncident": "11/26/2019",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286459,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY VEHICLE 11/3/19, TRADED IN MY 2016 MITSUBISHI FOR 2019 MITSUBISHI OUTLANDER. 3 DAYS LATER MY LIGHTS WENT OUT AND I TOOK THE CAR TO VICTORY MITSUBISHI DEALERSHIP IN THE BRONX AND THEY SAID IT WAS A LOOSE FUSE. THEY TIGHTED THE FUSE AND MY LIGHTS CAME ON.    ON 11/26/19, I WAS ON THE CROSS BRONX HIGH WAY IN TRAFFIC AND DROVE BUT COULD NOT STOP THE CAR. MY BRAKES FAILED. I GOT OFF THE HIGHWAY AND CALLED THE POLICE AND GEICO. THE POLICE DID NOT COME AND I HAD THE CAR TOWED TO JUNIORS AUTOMOTIVE CENTER IN THE BRONX. MY GEICO ADJUSTER WILL INSPECT  THE CAR ON  12/4/19. I SHOULD NOT BE GOING THROUGH THIS. I KNOW MY CAR WILL EVENTUALLY BE REPAIRED BUT I DO NOT FEEL SAFE DRIVING THE CAR.",
        "vin": "JA4AZ3A3XKZ"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/20/2019",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11256890,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 MITSUBISHI OUTLANDER. WHILE DRIVING APPROXIMATELY 45 MPH, A PEBBLE STRUCK THE PASSENGER SIDE OF THE WINDSHIELD AND FRACTURED THE ENTIRE FRONT WINDSHIELD. THE CONTACT CALLED BILL HOLT MITSUBISHI (1215 COBB PKWY S, MARIETTA, GA 30060, 404-890-5100) WHO REFERRED THE CONTACT TO SAFELIGHT AUTO FOR THE REPAIR. THE VEHICLE WAS REPAIRED. WHILE THE VEHICLE WAS AT A CAR WASH, THE SUN ROOF SUDDENLY SHATTERED INWARDLY WITH A LOUD BANGING NOISE. THE CONTACT SUSTAINED INJURIES TO THE LEFT FOREARM AND RIGHT EAR. THE PASSENGER SUSTAINED INJURIES TO THE HEAD AND FOREHEAD. MEDICAL ATTENTION WAS RECEIVED. THE CONTACT WATCHED THE SURVEILLANCE FOOTAGE AT THE CAR WASH AND THERE WAS NO EVIDENCE OF ANY IMPACT TOWARDS THE SUN ROOF FROM AN OBJECT. THE CONTACT CALLED THE SAME DEALER AND WAS REFERRED TO SUN ROOF EXPRESS WHO THEN REFERRED THEM TO AUTO TRIM PLUS FOR THE REPAIR. THE SUN ROOF WAS REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURES AND OPENED CASE NUMBER: 1/274220711. THE APPROXIMATE FAILURE MILEAGE WAS 12,000.",
        "vin": "JA4AZ3A33KZ"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/12/2019",
        "dateOfIncident": "06/06/2019",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219577,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT RENTED A 2019 MITSUBISHI OUTLANDER. WHILE DRIVING APPROXIMATELY 20 MPH WITH THE SHIFTER IN DRIVE, THE VEHICLE STARTED TO GO BACKWARDS. THE CONTACT ATTEMPTED TO BRAKE ON A SMALL INCLINE, BUT THE BRAKES DID NOT WORK. THE VEHICLE CONTINUED TO ROLL BACKWARDS TOWARDS A TRUCK. WHEN THE CONTACT DEPRESSED THE START BUTTON, THE VEHICLE STOPPED AND THE BRAKES ENGAGED. THE CONTACT TOOK THE VEHICLE BACK TO ENTERPRISE RENT-A-CAR AND RECEIVED ANOTHER VEHICLE. THE CONTACT DID NOT KNOW IF THE VEHICLE WAS DIAGNOSED OR REPAIRED. THE DEALER AND MANUFACTURER WERE NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 6,500.",
        "vin": "JA4AP4AU0KU"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/11/2018",
        "dateOfIncident": "07/05/2018",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128776,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 MITSUBISHI OUTLANDER. WHILE DRIVING VARIOUS HIGH AND LOW SPEEDS, THE VEHICLE STALLED WITHOUT WARNING. THE CONTACT STATED THAT THE VEHICLE DECELERATED FROM 30 TO 0 MPH ON THREE OCCASIONS. THE CONTACT STATED THAT THE ELECTRONIC RANGE AND FUEL RANGE ELECTRONIC DETECTION SYSTEM (COMPUTER SYSTEM) OF THE VEHICLE WERE PROBABLE CAUSES OF THE CONTINUED FAILURE. FURTHERMORE, THE CONTACT STATED THAT THE FUEL MILE RANGE WAS INCORRECTLY REPORTED BY THE COMPUTER SYSTEM ON MORE THAN ONE OCCASION. SOUTH MIAMI MITSUBISHI (8523 SOUTH DIXIE HIGHWAY, MIAMI, FLORIDA 33143, (877) 718-8890) WAS MADE AWARE OF THE SERIES OF FAILURES AND DETERMINED THAT THE HUMIDITY MAY HAVE HAD AN EFFECT ON THE CONDITIONS OF THE FAILURE AND THE BATTERY POWER. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURES. THE FAILURE MILEAGE WAS 5,000.",
        "vin": "JA4J24A57JZ"
    }
]