[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/04/2021",
        "dateOfIncident": "01/15/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435386,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Nissan Versa. The contact stated while his wife was making a stop at the stop light, the brake pedal was depressed and went all the way to the floorboard. The vehicle was not diagnosed nor repaired by an independent mechanic or dealer. The contact stated that the failure had been recurring at the stop light whenever the vehicle was overheating. The vehicle was taken to the dealer who diagnosed that no issues were found. The contact stated that the failure had been recurring and the vehicle was taken back to the dealer. The manufacturer was made aware of the failure but provided no assistance. The vehicle was not repaired. The approximate failure mileage was 11,000.",
        "vin": "3N1CN7AP0KL"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/29/2021",
        "dateOfIncident": "08/18/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390620,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2019 NISSAN VERSA JUNE OF 2020 WITH ONLY 9,000 MILES ON IT FROM A LICENSED DEALER. AUGUST OF 2020, WHILE DRIVING AT A SPEED BETWEEN GEAR 4/5, ALL OF MY ELECTRIC WAS LOST(TOUCH SCREEN DISPLAY, INTERIOR/DASH LIGHTS) ABOUT 2 SECONDS LATER ALL LIGHTS RETURNED. THIS OCCURRED AGAIN IN OCTOBER OF 2020. SAME CONDITIONS. THERE WERE NO OTHER ISSUES WITH THE VEHICLE, NO CHECK ENGINE LIGHTS, NOTHING. THEN AGAIN IN DECEMBER OF 2020, SAME ISSUE. SINCE DECEMBER, I NOTICED MY VEHICLE HESITATING MORE AND MORE TO TURN THE ENGINE ON WHEN STARTING. FIRST WEEK OF JANUARY 2021, MY VEHICLE DID NOT START. I WAITED A MOMENT AND TRIED AGAIN, IT STARTED. I TOOK THE VEHICLE INTO A NISSAN DEALER WHO INSPECTED THE VEHICLE. THEY SCANNED MY OBD FOR CODES - NONE TO BE FOUND. SAID THE ODB SYSTEM WAS \"MONITORING\" ONE OF THE SYSTEMS' (BCM) BUT DIDN'T HAVE ANY CODES STORED. AFTER REQUESTING THEM TO RE-FLASH MY BCM, THEY THEN RESPONDED THAT IT WAS MY TIRE PRESSURE SENSOR THAT WAS BEING MONITORED. I HAVE HAD A FAILED BCM BEFORE SO THE SYMPTOMS WITH THE CAR ARE VERY CONSISTENT WITH A FAILING BCM. I PAID $160 TOTAL FOR THEM TO TELL ME THE CAR IS PERFECT. OBVIOUSLY NOT BECAUSE VEHICLES JUST DON'T LOOSE POWER WHILE DRIVING AT HIGHWAY SPEEDS. I HAVE A 5 YEAR OLD CHILD WHO GOES EVERYWHERE WITH ME. IF IT IS IN FACT THE BCM AND I GET INTO AN ACCIDENT BECAUSE IT FAILED WHILE DRIVING HIGH SPEEDS - NEITHER OF US ARE LIKELY TO WALK AWAY UNINJURED. THERE ARE NO AFTER-MARKET PARTS ON THE VEHICLE. NO MODIFICATIONS. THE VEHICLE GETS DETAILED/CLEANED/MAINTAINED REGULARLY AS NEEDED TO KEEP EXTENDED WARRANTY VALID. DOESN'T MAKE SENSE. I HAVE A 360 DASH CAM ARRIVING THIS WEEKEND SO THE NEXT TIME IT \"SURGES\" POWER - I HAVE PROOF.",
        "vin": "3N1CN7APXKL"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "01/28/2021",
        "dateOfIncident": "01/26/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390513,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEVERAL OCCASIONS WHILE DRIVING ON MINOR  ICY OR SNOWY ROADS (NOT EXTREMELY SLICK) WHEN I DEPRESS THE BRAKES THE CAR DOES NOT STOP OR SLOW.  I HEAR A RATTLLING NOISE IN THE FRONT OF THE CAR THAT I AM TOLD IS THE VEHICLE DYNAMIC CONTROL SYSTEM ENGAGING.  I PRESS DOWN ON THE BRAKE AND THE RATTLLING CONTINUES BUT THE CAR DOES NOT SLOW OR STOP.  I HAVE NARROWLY MISSED HAVING TWO SERIOUS ACCIDENTS WHEN I HAD TO PULL OF THE ROAD OR INTO ANOTHER LANE TO AVOID HITTING THE CAR IN FRONT OF ME.  I WAS NOT FOLLOWING CLOSELY, THE CAR FAILED TO BRAKE ON EACH INSTANCE FOR 80-150 FEET.  THE FLASHING ICON COMES ON SHOWING THE VDC IS IN USE.  DURING THE LAST MOST SERIOUS INSTANCE  THE ICON SHOWING THAT THE SYSTEM HAD TURNED ITSELF OFF CAME ON.  I KNOW YOU ARE NOT SUPPOSED TO PUMP THE BRAKES WITH THE SYSTEM, AND I DID NOT UNTIL THE LAST MOMENT WHEN I HAD TO TURN SHARPLY TO AVOID A COLLISION.  PUMPED, TURNED AND BRAKES FINALLY HELD.  IN EACH CASE I WAS TRAVELLING AT 25-30 MPH ON LEVEL TWO LANE HIGHWAY IN SNOWY, ICY, BUT NOT SEVERLY SO,CONDITIONS. I HAVE BEEN DRIVING IN COLORADO FOR 40 YEARS AND HAVE NEVER HAD AN ACCIDENT, OR DIFFICULTY CONTROLLING MY CAR IN ICE OR SNOW.  ON TWO OTHER OCCASIONS UNDER SIMILAR CIRCUMSTANCES THE BRAKES HELD BUT THE CAR PULLED SHARPLY TO THE RIGHT OR LEFT.  I AM SCHEDULED TO SEE DEALER TOMORROW.",
        "vin": "3N1CN7AP4KL"
    },
    {
        "components": "STEERING,POWER TRAIN,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/20/2020",
        "dateOfIncident": "12/19/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384237,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A USED 2019 NISSAN VERSA WITH 34, 213 MILES FROM ENTERPRISE CAR SALES ON 07/08/2020 AND AT 45,000 MILES ON 12/20/2020 ON MY WAY BACK FROM MYRTLE BEACH CAR DOES NOT WANT TO ACCELERATE AND OR CHANGE GEARS WHEN PRESSING DOWN ON THE GAS PEDAL. OUT OF TOWN MECHANIC LOOKED AT THE CAR AND ADVISED IT HAS ISSUES WITH CVT.  CAR HAS A LOUD NOISE WHEN SHIFTING FROM PARK INTO DRIVE AND OR REVERSE AND AT TIMES DOES NOT WANT TO MOVE. CAR ONLY MOVED AFTER TURNING IT ON AND OFF. CAR STRUGGLES TO TAKE OFF AT LIGHTS AND HAS WEIRD LOUD NOISE COMING FROM THE TRANSMISSION, CAR ALSO JERKS REALLY BAD WHEN TAKING OFF AT A RED TOO GREEN LIGHT. ALSO THE BATTERY IS 1 YEAR OLD AND IS DEFECTIVE AND GAS READING GAUGE READS WRONG WHEN CAR IS FILLED UP WITH GAS. TRACTION CONTROL LIGHT COMES ON AND OFF FOR NO REASON IN DRY ROADS. WHEN ENTERING A HIGHWAY CAR STRUGGLES TO GAIN SPEED AND JERKS WHEN SHIFTING GEARS. DEALER NOTIFIED SINCE CAR HAS 45,168 MILES AND IS STILL UNDER THE NISSAN 46,213 WARRANTY. CAR IS PARK AND AT TIMES DOES NOT WANT TO MOVE. WAITING ON A DEALER APPT.",
        "vin": "3N1CN7AP0KL"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/19/2020",
        "dateOfIncident": "10/14/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365087,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING HIGHWAY 101 CAMARILLO TO HOME. ITS UPHILL I TRIED TO PRESS THE GAS BUT MY SPEED GAUGE STOCK ON 50MPH NO MATTER I TRIED. THEN SUDDENLY THE ABS LIGHT AND THE CAR WITH ZIGZAG APPEARED ON MY DASH BOARD. I BOUGHT MY CAR USED... THE CAR HAVE 38K+ MILEAGE. I'VE RESEARCHED ONLINE IF THE NISSAN VERSA HAVING PROBLEM GOING UPHILL. I WENT TO MY MECHANIC THEY SAID MYBE THERE A TRANSMISSION PROBLEM GO TO THE NISSAN DEALERSHIP BECAUSE MY MILEAGE IS UNDER 60K MYBE IM STILL ON MANUFACTURE WARRANTY... BUT I DIDN'T BOUGHT THE CAR ON NISSAN DEALER. I BOUGHT IT ON DRIVETIME.",
        "vin": "3N1CN7AP5KL"
    },
    {
        "components": "AIR BAGS,TIRES",
        "crash": true,
        "dateComplaintFiled": "09/23/2020",
        "dateOfIncident": "07/15/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360644,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2019",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Yokohama Off-Highway Tires America, Inc",
                "productMake": "ALLIANCE TIRE",
                "productModel": "ALLIANCE TIRE",
                "productYear": "9999",
                "size": "14-17.5 ML",
                "type": "Tire"
            },
            {
                "manufacturer": "4-Star Trailers, Inc.",
                "productMake": "4-STAR",
                "productModel": "HAYRACK",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I HAD AN ACCIDENT IN THE CAR.  BECAUSE OF TIRES AND AIRBAG NOT DEPLOYING.  I WAS NOT INJURED BUT THE CAR IS A TOTAL LOSS.  AND THE ACCIDENT IS BEING BLAMED ON ME.  COULD SOMEONE CONTACT ME ABOUT THIS MATTER. *DT*JB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "05/19/2020",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325225,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN VERSA. THE CONTACT STATED WHILE REFUELING THE VEHICLE, THE AUTOMATIC SHUTOFF VALVE CAUSED THE PUMP TO SHUTOFF HOWEVER, THE FUEL TANK WAS NOT FULL. ADDITIONALLY, THE CONTACT STATED THAT THE VEHICLE WAS REPAIRED UNDER NHTSA CAMPAIGN NUMBER: 19V645000 (BACK OVER PREVENTION) AT RIVERSIDE NISSAN (8330 INDIANA AVE B, RIVERSIDE, CA 92504, (951) 509-6500,) HOWEVER, WHILE IN REVERSE, THE IMAGE ON THE SCREEN WAS DIFFICULT TO SEE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS 3,750.",
        "vin": "3N1CN7AP5KL"
    },
    {
        "components": "STEERING,POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/12/2019",
        "dateOfIncident": "10/28/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279521,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING CLUTCH TRANSMISSION. LETTER REGARDING THE MALFUNCTIONING OF GEAR SHIFTS, TRANSMISSION, CLUTCH DAMAGED  BY 5 SPEED MANUAL NISSAN TRANSMISSION AND STOPPED MY ABILITY TO SHIFT GEARS FROM 5. NO GEARS WORKED I WAS TRAVELING ON ARIZONA HWY 60 WITH CARS GOING 75 MILES AN HOUR. I WAS HEADED WEST TO PHOENIX FOR 17 HWY  AND I WAS BETWEEN EXITS 152 AND 153 THAT IS WHERE HIGHWAY PATROL WHEN THEY ARRIVED COULD STOP TRAFFIC AND USE THEIR VEHICLE TO PUSH MINE TO THE SIDE OF THE ROAD. I HAD BEEN DRIVING IN THE MIDDLE LANE AND CARS OR TRUCKS COULD HAVE KILLED ME EVEN THOUGH I HAD MY FLASHERS ON UNTIL HIGHWAY PATROL ARRIVED. I HAVE REPORTS. THE SUDDEN MALFUNCTION OF THE MAJOR COMPONENTS ON A NEW VEHICLE PURCHASED ON FEBRUARY 27TH FROM JIM CLICK NISSAN IN TUCSON ARIZONA. THE CAR WAS MANUFACTURERED IN MEXICO AT ONE OF NISSAN'S PLANTS (AQUA).",
        "vin": "3N1CN7AP9KL"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "10/16/2019",
        "dateOfIncident": "10/11/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11269045,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT RENTED A 2019 NISSAN VERSA. WHILE DRIVING 35 MPH OVER A BUMP IN THE ROAD, THE CONTACT LOST CONTROL OF THE VEHICLE, DROVE INTO THE WOODS, AND CRASHED INTO A TREE. THE DRIVER'S AND FRONT PASSENGER AIR BAGS DEPLOYED. THE CONTACT SUSTAINED INJURIES TO THE HIPS AND OTHER AREAS, WHICH DID NOT REQUIRE MEDICAL ATTENTION. POLICE REPORT NUMBER: 9150 WAS FILED. THE VEHICLE WAS TOWED. THE DEALER AND MANUFACTURER WERE NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "3N1CN7AP6KL"
    },
    {
        "components": "POWER TRAIN,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/30/2019",
        "dateOfIncident": "05/30/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11259121,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN VERSA. THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR ILLUMINATED. WHEN THE VEHICLE WAS PLACED IN REVERSE, A LOUD THUMPING NOISE WAS HEARD UNDERNEATH THE VEHICLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER AND DEALER WERE NOT MADE AWARE OF THE FAILURES. THE APPROXIMATE FAILURE MILEAGE WAS 5,472.",
        "vin": "3N1CN7AP6KL"
    }
]