[
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/02/2022",
        "dateOfIncident": "04/30/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459353,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Ewr Volpe Acme Inc.",
                "productMake": "TBD",
                "productModel": "TBD",
                "productYear": "9999",
                "type": "Vehicle"
            }
        ],
        "summary": "I have contact dealership with no luck",
        "vin": "3N1AB7AP6KY"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/31/2022",
        "dateOfIncident": "03/25/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459077,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Nissan Sentra. The contact stated that the vehicle was unable to shift from park(P) to drive(D) or park(P) to reverse(R). The contact stated no warning light was illuminated. The contact was able to forcefully shift into a different gear. The contact took the vehicle to an independent mechanic and was informed that the safety shift lock needed to be replaced. The vehicle was not repaired. The contact called the local dealer and made them aware of the failure. The vehicle was not diagnosed or repaired. The manufacturer had not been informed of the failure. The failure mileage was approximately 53,000.",
        "vin": "3N1AB7AP6KY"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/26/2022",
        "dateOfIncident": "03/26/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458468,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "My RPMs do not catch up with my speed. While I'm driving rpms randomly fluctuate. The transmission doesn't engage quickly enough. Now my car can barely even stop quickly enough. it gets stuck in a high gear and when I try to accelerate it jerks. I can barely stop my car I have stop so far in advance and even than it will barely stop. THIS A HUGE SAFETY RISK for myself and others. This car still fairly new should not have these issues. I also did not any warning signs or check engine light nothing. I take care of my car. This car could potentially take the lives of others it needs to be recalled immediately.",
        "vin": "3N1AB7AP0KY"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/23/2022",
        "dateOfIncident": "02/24/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457951,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Nissan Sentra. The contact received notification of NHTSA Campaign Number:  21V135000 (Exterior Lighting) however, the part to do the recall repair was unavailable. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. VIN tool confirms parts not available.",
        "vin": "3n1ab7ap2kl"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": true,
        "dateComplaintFiled": "03/15/2022",
        "dateOfIncident": "03/11/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456820,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Nissan Sentra. The contact was driving under 10 MPH when she depressed the brake pedal however, the vehicle failed to stop. The parking brake was activated however, the vehicle rear-ended the vehicle in front. The air bags did not deploy. The contact stated there was no warning light illuminated. The vehicle was towed to a salvage yard. A police report was filed. The vehicle was still being diagnosed by the Insurance company and had not been repaired. The contact related the failure to NHTSA Campaign Number: 21V135000 (Exterior Lighting). The manufacturer had not been notified. The approximate failure mileage was 58,000.",
        "vin": "3N1AB7AP3KY"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/14/2022",
        "dateOfIncident": "12/14/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456626,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Nissan Sentra. The contact received notification of NHTSA Campaign Number: 21V135000 (Exterior Lighting) however, the part to do the recall repair was not yet available. The local dealer was contacted. The contact stated that the vehicle would only start after 6-7 attempts and the failure had been draining the battery. There were no warning lights illuminated. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the failure and advised the contact to take the vehicle to the dealer for the recall repair. The failure mileage was unknown. VIN tool confirms parts not available.",
        "vin": "3N1AB7AP9KY"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/07/2022",
        "dateOfIncident": "01/01/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455641,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Nissian has a known issue with CVT transmissions. I've had my vechile for less then a year an I'm already being told I need a new transmission it's unacceptable. The issues my CVT has caused is extremely unsafe an dangerous to myself an my family an other drivers.  My nissian would fail to accelerate almost causing me to be sideswiped on multiple!!! Occasions , these vehicles had to swerve around me because my vechile would simply not go. There's been too many close calls regarding my vechiles an the dangerous situations it's out myself an other drivers on the road in.  Numerous occasions has it failed to accelerate properly , numerous occasions the vechile wasn't switching gears properly causing late reactions in the vechile an a.increased risk for accidents . Numerous occasions has my vechile decide to accelerate when I wasnt pressing the gas for it to do so , causing me to break or break hard at times I shouldn't of . Numerous occasions has my vechile literally decide it wasn't going to drive forward anymore an I would have to get out of traffic on highway an turn the vechile off an turn it back on for it to act properly.. this vechile has caused to many potential accidents .. I would hate for someone to actually get hurt for nissian to actually care about their customers.  Nissian stated they basically didn't care an I would have to pay out if pocket for expenses regardless of how new or how low the milage on my vechile was..",
        "vin": "3n1ab7ap6kl"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/04/2022",
        "dateOfIncident": "01/03/2022",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455209,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Nissan Sentra. The contact stated that while the granddaughter was driving approximately at 30 MPH, she was stopped by the police due to the taillights not functioning.  The contact took the vehicle to a local auto parts store and had a fuse replaced. When she reached her destination and turned off the vehicle, the instrument panel warning lights and headlights activated; additionally, the battery was drained. The vehicle was towed to a local dealer, where it was diagnosed that the wiring harness had a \"thermal breakdown\" and confirmed that several wires were burnt. The vehicle was not repaired. The manufacturer had been informed of the failure. The contact then received notification of NHTSA Campaign Number: 21V135000 (Exterior Lighting) after experiencing the failure. The failure mileage was approximately 26,000. VIN tool confirms parts not available.",
        "vin": "3N1AB7AP8KY"
    },
    {
        "components": "EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/03/2022",
        "dateOfIncident": "03/03/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454996,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact's wife owns a 2019 Nissan Sentra. The contact received notification of NHTSA Campaign Number: 21V135000 (Exterior Lighting). The vehicle was taken to the dealer where the stop lamp switch was replaced with a temporary switch. The contact stated that while driving 25 MPH, the automatic braking system applied inadvertently and the vehicle stopped abruptly. The contact stated that the ABS malfunction indicator light (MIL) had been illuminated. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The contact stated that he was contacted by the dealer and informed that the final remedy was available. The manufacturer was not made aware of the failure.  The failure mileage was approximately 69,300. VIN tool confirms parts not available.",
        "vin": "3N1AB7AP4KY"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/28/2022",
        "dateOfIncident": "02/14/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454548,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Nissan Sentra. The contact received notification of NHTSA Campaign Number: 21V135000 (Exterior Lighting) however, the part to do the recall repair was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. VIN tool confirms parts not available.",
        "vin": "3N1AB7AP8KY"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/19/2022",
        "dateOfIncident": "02/10/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453021,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The FCW and the AEB lights come on periodically stating that the system is malfunctioning. Took it to the dealer and they said it was the sensor for the FCW and AEB that has failed. Other vehicles around my mileage and year and model have had the same issues. Nissan needs to take care of this.",
        "vin": "3n1ab7ap4ky"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/19/2022",
        "dateOfIncident": "02/16/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453046,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Going at a speed of 65 mph+  the transmission or what ever it seems to be cutting in and out, I have to either lay off the gas or pullover and let it sit for a bit for it to stop acting up and it'll stop for a while and it acts back up again, I haven't had the car for a year yet, there were a few time I almost got hit and swerved off the road because of it I usually have the kids with me and the last thing I need is to have something happen to them or me I asked what can be done about and pretty much was told that it was my problem I see many complaints pertaining to this issue, is it gonna take a death for something to be done, im quite disappointed about this and on top of this there is 2 recall for this type of vehicle what can be done about this?!",
        "vin": "3N1AB7AP5KY"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/17/2022",
        "dateOfIncident": "02/16/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452387,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving my vehicle to pick my kids up when I heard a strange “pop” noise. I thought maybe a rock from the road had dinged my car. When I approached a red light the passenger side car door airbag cover swung off, exposing the airbags. There have been no hits to the car nor anyone sitting in the front seat of the car.",
        "vin": "3N1AB7AP4KY"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/14/2022",
        "dateOfIncident": "01/12/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451986,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Unbeknownst to me, the stop lamp switch recall also effects the vehicle starting. I learned that they were related after I reached out to Nissan regarding my vehicle not starting, it first happened on New Years Eve. This has now happened 2-3X a week. In addition to this issue, I’ve experienced issues with the CVT, and possibly the engine. One evening I was heading home after work, I got onto the on ramp, and attempted to accelerate to merge onto I-84. The vehicle would not accelerate beyond 45, the engine would rev extremely high, and not go any faster. I pulled onto the shoulder as best and quickly as I could. I turned the car off then back on, attempted to merge onto I-84, and had to get onto the shoulder again because I wasn’t able to go faster than 45MPH. Both times I was almost sideswiped by an 18 wheeler on the driver side, had that happened I’d have lost my life. I sat there very frustrated, and in shock. After a few minutes of having no traffic, I drove home at 45MPH.   I’ve reached out to Nissan regarding the aforementioned issues, asking if they’d buy the vehicle back for what I owe on it. I received a letter from Nissan Consumer Affairs basically refusing to buy the car back. It’s exasperating owning a 2019 with 15,100 miles, and experiencing these issues. I’m by no means the type of person that feels a brand new vehicle is more reliable than an older one. I’m the type of person that likes knowing I can rely on my car. My mothers’ 2003 Outback with over 230K has been far more reliable than my Sentra. Knowing that there’s no remedy to repair the stop lamp recall is frustrating, that means that each time I go to start my car it may not start, on days that it hasn’t, I’ve spent 10 minutes trying trying to get it to start.  These issues are exasperating, and Nissan basically saying I’m SOL, isn’t acceptable.",
        "vin": "3n1ab7ap8ky"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/13/2022",
        "dateOfIncident": "07/07/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451744,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "at a speed of 70 mph in the outside temperature of 85 degrees or more the transmission seems to be cutting out not allowing me to get out of harms way in an emergency situation. The car will not go any faster. I can not go faster to change lanes.",
        "vin": "3n1ab7ap6ky"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/11/2022",
        "dateOfIncident": "01/11/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451562,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Nissan Sentra. The contact stated that the vehicle intermittently failed to start-up as needed. The Electronic Stability Program (ESP) warning light was illuminated. The vehicle was not diagnosed nor repaired by an independent mechanic or dealer. The manufacturer was not made aware of the failure. The failure mileage was approximately 52,000.",
        "vin": "3n1ab7ap7ky"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/09/2022",
        "dateOfIncident": "10/04/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451255,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Ewr Volpe Acme Inc.",
                "productMake": "TBD",
                "productModel": "TBD",
                "productYear": "9999",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION-shifting delays, grinding or jumping during acceleration noises and a burning smell coming from under the hood. OFF AND SINCE 10/21",
        "vin": "3N1AB7AP8KL"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/03/2022",
        "dateOfIncident": "11/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450141,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Nissan Sentra. The contact stated that while driving at 45 MPH, she had to forcefully depress the brake pedal in order to stop the vehicle. The contact stated that the tire pressure warning light was illuminated. The vehicle was taken to an independent mechanic but was not diagnosed nor repaired. The contact stated that the failure had been reoccurring while driving. The dealer was notified of the failure. The VIN was included in NHTSA Campaign Number: 21V135000 (Exterior Lighting).The manufacturer was not notified of the failure. The vehicle was not diagnosed nor repaired. The failure mileage was approximately 38,000.",
        "vin": "3N1AB7AP1KY"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/15/2022",
        "dateOfIncident": "01/15/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447594,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I bought my Nissan Sentra in February of 2019 and its now january 15 2022 with 98,000 miles and the transmission is done, i have to pay money to get the transmission fixed on my car when its only been 2 years since i got the car and now i already have to fix it, this seems unfair, i have done the standard Maintenance on it and i cant believe i have to get it fixed. at the time of this report it just happen and i still have to find a way to pay for it to get fixed",
        "vin": "3N1AB7AP8Ky"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "12/23/2021",
        "dateOfIncident": "11/20/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444798,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "My insurance never covered the amount I was ensuring my car before because the recalls",
        "vin": "3N1AB7AP1KY"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/09/2021",
        "dateOfIncident": "12/07/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443183,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 NISSAN SENTRA Automatic Emergency Braking system suddenly brakes w/o warning while cars are present or not, sensor light comes on and car will stall or abruptly/automatically stop itself. Malfunction light comes on states malfunction look in owners manual. While driving car automatically stopped at a light or in traffic and would not move forward the malfunction light came on. This has been occurring 2 days after purchase (11-6- 2021- 12-7-2021) until recent. 12-7-21 the car stopped itself at a red light (I was the first vehicle in line no one in front of me or to my sides) on green as I tried to press on the gas the car stalled, the back windows rolled up and down, the radio went on and off, and the malfunction light for AEB  flashed then the car locked, then solid engine light came on, @ first I could not get my hazard lights on then suddenly they worked. People drove past me honked, called me names, and finally one  person helped me move it out of the road. While on the side of the road the car again was on but when I pressed on gas would not accelerate, however while the brake and emergency brake were on and the car  was in park it rolled backwards. My son return it to the purchasing dealership twice with the complaint of the malfunction light on told they did not know what was going on and that it was unusual  bring it back for maintenance. problem persisted. The car has been brought back twice to the dealership with this and other braking/electrical concerns w/in a shorttime before the final major incident happened (I am thankful that no-one was hurt). Right now 12-8-2021, I had been back to the dealership after reporting the incident with the idea that I would be helped and put into a newer safer vehicle, not the case upon arrival they tried to up sell me a new car @ higher price, when I said no, my option was to fix what is covered under warranty. States they will run own diagnostic test.",
        "vin": "3N1AB7AP7KL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/12/2021",
        "dateOfIncident": "11/10/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440181,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I've noticed an issue with the radio coming on by itself when it's sitting in the garage and apparently it causes a drain on the battery. There's been several times I've gone out to the car and it doesn't start I don't know if the two are connected. I've had the battery checked the alternator checked and they've all been fine. The car is just now 2 years old I took it over from my son when I bought it for him and when I talked to him he's had the same issue.",
        "vin": "3N1AB7AP8KY"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/09/2021",
        "dateOfIncident": "11/09/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439911,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "There is a safety recall on this vehicle but there is no remedy available. I am trying to list this car through a rental platform but because of the recall, they won’t let me. I need this recall resolved or have the VIN pulled from the list of recalls.",
        "vin": "3N1AB7APXKL"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/11/2021",
        "dateOfIncident": "10/11/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436262,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "This is now the 3rd time my car is going in for the same problem. This is a leased 2019 vehicle. I have been Stranded because of this & Lost pay because I could not get to work.  This is So unacceptable.. This car is a lemon, & I do not feel safe in this car anymore.",
        "vin": "3N1AB7AP1KY"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/17/2021",
        "dateOfIncident": "01/21/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433401,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Nissan Sentra. The contact stated while driving 45 MPH and depressing on the accelerator pedal, the vehicle would not fully accelerate as desired. There was an unknown warning light illuminated. The contact activated the hazard lights and pulled the vehicle over to the side of the road. The contact waited a few minutes and restarted the vehicle and was able to continue to drive to her residence. The contact took the vehicle to an independent mechanic who diagnosed the vehicle with a major transmission failure. The contact took the vehicle to the local dealer and it was agreed that the transmission was faulty. The contact was informed that the mechanic could not repair the vehicle because they could not find the coding for the repair in their system. The vehicle was not repaired. The manufacturer was not made aware of the failure. The failure mileage was approximately 35,901.",
        "vin": "3n1ab7ap9ky"
    },
    {
        "components": "UNKNOWN OR OTHER,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "09/16/2021",
        "dateOfIncident": "08/22/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433260,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving at night, going to the movies, it was a windy night, some obstruction, something small, nicked the front plastic bumper. there was no warning from the AEB. After that happen, the alert AEB light popped up and it's still on. Nothing was broken on the veh. As a matter of fact, there is no damage or nothing to the veh. Just that nick. Bought the car brand new with about 20 miles on it. This happen about two months after. Took it to the dealer where I bought it and told me  they don't cover it. It would cost me $1200 dollars out of my pocket to fix it. Also, there was no other vehicles involved for that matter. So, what is the use of buying the extended warranty if when the time comes to use it, it's not covered?",
        "vin": "3N1AB7AP2KY"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/01/2021",
        "dateOfIncident": "08/28/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431336,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "When driving at speeds above 70 mph, the RPM’s start to surge. Going from 2.5 RPMs to 5 RPMs without any acceleration in speed from the driver. I have video of it when the cruise control was being used and the rpms surged and fell back. The fuel efficiency screen also shows a decrease in efficiency when the rpms go up.   Have also had a loss of power when trying to pass and tried to increased speed - yet the engine surged/faltered.   It happens every time I exceed 70 mph. I picked the date when I have video of this occurring. However, it happens whenever I exceed 70mph.",
        "vin": "3n1ab7ap5ky"
    },
    {
        "components": "POWER TRAIN,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/31/2021",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431172,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact's wife owns a 2019 Nissan Sentra. The contact stated that while driving at various speeds, the vehicle would experience a delayed upshift upon the depression of the accelerator without warning. Additionally, the contact stated that the stop lamps would fail to illuminate upon depression of the brake pedal without warning. The contact then received a recall notice for NHTSA Campaign Number: 21V135000 (Exterior Lighting). The dealer was notified of the failure and the contact was informed that parts were not yet available. The manufacturer was not notified of the failure. The vehicle was not repaired. The failure mileage was approximately 2,400.",
        "vin": "3n1ab7ap0ky"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/22/2021",
        "dateOfIncident": "07/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425920,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Nissan Sentra. The contact received notification of NHTSA campaign number: 21V135000 (Exterior Lighting) however, the part to do the recall repair was not yet available. The local dealer was contacted, and it was confirmed that the part was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact stated that on one occasion after turning off the vehicle, the vehicle failed to immediately restart. The cause of the failure was not yet determined. Vin tool confirms parts not available. The failure mileage was 11,000.",
        "vin": "3N1AB7AP1KY"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "06/23/2021",
        "dateOfIncident": "06/21/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11422026,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I have been telling Nissan in my town and they say that know about this AEB malfunction. My husband and I couldve died! We were on the interstate late at night going about 80 mpl when the AEB system activated by itself and slammed on the breaks. We started the spin out and the traction control came on and ABS shut off effectively locking up my tires and throwing me into a full spin which resulted in my crashing into the gaurd rail. I've never been more scared in my life. Add this to the list with the transmission issues.",
        "vin": "3N1AB7AP7KY"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/12/2021",
        "dateOfIncident": "06/12/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420674,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "When I try to get a quick acceleration it doesn't want to move it has trouble climbing hills like I had to put it to the floor to make him go anywhere and sometimes when I'm driving to RPMs goes up in the middle of driving without me hitting the gas I also noticed sometimes the buttons on the steering wheel don't always work I have to turn off the car and turn it back on kind of worried about the transmission I have a 2009 Nissan Altima transmission it's going bad on it before it's time so I'm hoping this car is not having the same thing",
        "vin": "3N1AB7AP0KY"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/06/2021",
        "dateOfIncident": "06/06/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419850,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Transmission shudders and loses power when needing to quickly accelerate. Nissan has paid me an inconvienece fee because all of their 2019 Nissan Sentra SR models experience the same issue. This is extremely dangerous! When needing to get out of a situation quickly, the vehicle shudders and hesitates before catching a gear. This has happened to me in an intersection. Someone ran a redlight and I need to move quickly to avoid an accident. The vehicle sputtered and when it caught it's gear, almost lurched me into oncoming traffic. Nissan has placed 7 transmissions in my car and all are the same. I never took their replacement car because when I drove two other of the same models of my car. They did the same thing! Nissan needs to be held accountable and find a way to fix the transmission so it does not do this shudder anymore. I've seen many consumer reviews that state the same problem. I feel this is widespread enough and a big enough safety defect that Nissan needs to fix before it kills someone because they can move out of the way in time.",
        "vin": "3N1AB7AP7KY"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/04/2021",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419639,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Nissan Sentra. The contact stated that the vehicle would not start on several occasions. The vehicle was taken to the dealer five times for diagnosis however, the dealer was unable to duplicate the failure. The dealer replaced the battery however, the failure recurred. The vehicle was not repaired. The manufacturer was not made aware of the failure. The failure mileage was 24,638.",
        "vin": "3N1AB7AP7KL"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/26/2021",
        "dateOfIncident": "05/22/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11418678,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 NISSAN SENTRA. The contact stated while driving AT 25MPH and in the process of turning, another vehicle had crashed into the vehicle. None of the airbags deployed. The contact was the only one injured and sought medical treatment. The contact sustained a hand sprain, head pain, shoulder pains, neck pains, foot pains, and ankle pains. The vehicle was driven to the contact's residence by a friend. The contact stated no warning lights were illuminated. The vehicle was not repaired. The manufacturer was informed of failure and told the contact that the vehicle was not in a recall. The failure mileage was approximately 52,000.",
        "vin": "3N1AB7AP1KY"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/24/2021",
        "dateOfIncident": "05/10/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418343,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Nissan Sentra. The contact received notification of NHTSA Campaign Number: 21V135000 (EXTERIOR LIGHTING) however, the part to do the recall repair was not yet available. The dealer was notified about the recall and confirmed that the part was not yet available. The manufacturer was made aware of the issue. The contact stated that the manufacturer had exceeded a reasonable amount of time for the repair. The contact had not experienced a failure. Vin tool confirms parts not available.",
        "vin": "3N1AB7AP8KY"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/24/2021",
        "dateOfIncident": "05/03/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418371,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Caliphers on front brakes seized up and were not functioning.",
        "vin": "3N1AB7APXKY"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/21/2021",
        "dateOfIncident": "05/03/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418012,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Radio comes on by itself. Car is not on. Took it to my Nissan Dealership May 17, 2021. Nothing was found. Also contacted Nissan directly on May 19, 2021, was told nothing could be done at this time because nothing showed up. I’m not a engineer but I know something is wrong, your radio don’t come on by itself when the car is off.",
        "vin": "3N1AB7AP1KY"
    },
    {
        "components": "UNKNOWN OR OTHER,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "05/18/2021",
        "dateOfIncident": "05/17/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417548,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Collision sensor malfunction and difficulty starting vehicle. Brake pedal not registering properly as depressed upon attempting to start vehicle",
        "vin": "3N1AB7AP2KY"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": true,
        "dateComplaintFiled": "05/18/2021",
        "dateOfIncident": "05/14/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417605,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONTACT OWNS A 2019 NISSAN SENTRA. THE CONTACT STATED WHILE MAKING A RIGHT TURN WHEN SHE SAW THE REAR VEHICLE WAS NOT STOPPING AND SHE DECIDED TO SPEED UP AND HIT THE HIGH CURB WITH HER TIRES. THE CONTACT STATED THE WARNING MALFUNCTION SEE OWNER MANUAL A WARNING LIGHT WAS ILLUMINATED. THE CONTACT WAS INFORMED BY A BYSTANDER SHE HAD NO BRAKES LIGHTS. THE CONTACT DID NOT SEEK MEDICAL ATTENTION OR HAD ANY INJURIES. THE CONTACT WAS ABLE TO DRIVE TO HER DESTINATION. THE CONTACT SHORTLY AFTER SHE RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 21V135000 (EXTERIOR LIGHTING) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. A DEALER WAS NOT CONTACTED. THE MANUFACTURER HAD NOT BEEN INFORMED OF FAILURE. THE FAILURE MILEAGE WAS 3,200. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3N1AB7AP8KY"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/07/2021",
        "dateOfIncident": "05/07/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415568,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED NOTIFICATION OF A STOP LAMP SWITCH RECALL FROM NISSAN AND MADE AN APPOINTMENT WITH THE LOCAL DEALER, WHO IS UNABLE TO GET THE PARTS NEEDED. I CONTACTED NISSAN AND WAS TOLD THAT THE PARTS WOULD NOT BE AVAILABLE UNTIL FALL 2021, POSSIBLY IN OCTOBER. THEY SAID I SHOULD DRIVE IT \"AT MY DISCRETION,\" AND THE SYMPTOMS COULD BE THAT THE BRAKE LIGHTS WON'T WORK, WHICH COULD CAUSE COLLISION OR THE CAR WON'T START. I CAN CALL THEM BACK IF THESE THINGS HAPPEN, BUT UNLESS OR UNTIL THEY DO, I SHOULD JUST DRIVE IT \"AT MY DISCRETION.\" I LOVE MY CAR AND IT HAS LESS THAN 4,000 MILES ON IT. I AM NOW SKEPTICAL OF DRIVING IT. IT'S NOW MAY AND I HAVE TO WORRY UNTIL PROBABLY OCTOBER THAN MY BRAKE LIGHTS AREN'T WORKING OR THAT MY CAR WON'T START.",
        "vin": "3N1AB7AP3KY"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "04/18/2021",
        "dateOfIncident": "04/16/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408625,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TIRES HAVE BEEN CHECK TWICE AND THEY ARE ALL AT MANUFACTURE PRESSURE PSI AND STILL MY CAR HAS THE TEMPS TIRE SENSOR LIGHT ON WHEN I CONTINUE TO DRIVE THE MALFUNCTION LIGHT COMES ON AND THE EMERGENCY BRAKING SYSTEM STARTS",
        "vin": "3N1AB7AP0KY"
    },
    {
        "components": "UNKNOWN OR OTHER,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "04/13/2021",
        "dateOfIncident": "04/02/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407961,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT 2019 NISSAN SENTRA FOR OUR DAUGHTER. AS SHE WAS DRIVING ON THE 405 N AND HAD TO BRAKE ON THE FREEWAY DURING HIGH TRAFFIC TIME, THE WARNING MALFUNCTION LIGHT COMES ON AND 3 INSTRUMENT CLUSTER LIGHT COMES ON: AEB, FRONT COLLISION, AND WARNING LIGHT. TOOK IT TO NISSAN, THEY DIAGNOSE 2 CODES THAT COMES UP IN THE TSB, DTC C1A16 (RADAR BLOCKED) AND DTC C1A12 (LASER BEAM OFF-CENTER) STATING THAT IT IS A SAFETY ISSUE BUT I STILL HAD TO PAY DIAGNOSIS AND THE PART AND LABOR TO FIX IT.",
        "vin": "3N1AB7AP4KY"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/12/2021",
        "dateOfIncident": "04/02/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407809,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "SEAT BELT IS TEARING! DON'T KNOW HOW THIS IS HAPPENING AND WHY BUT IT IS CATCHING INSIDE SOMEWHERE AND FRADED THE SEAT BELT. IT IS NOT TWISTED IN ANYWAY,NOTHING WAS DONE ON OUR END. IT WAS JUST A NORMAL GETTING INTO CAR WENT TO PUT SEAT BELT ON AND IT WAS CAUGHT,AND STARTED FRADING",
        "vin": "3N1AB7AP7KY"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/10/2021",
        "dateOfIncident": "03/30/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407440,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I PULLED INTO A CHICK-FIL-A DRIVE THRU.  THIS FAST FOOD CHAIN HAS EMPLOYEES OUTSIDE THAT COME TO YOUR CAR AND TAKE YOUR ORDER.  THE GUY THAT CAME TO ME ASKED ME IF SOMETHING WAS WRONG WITH MY CAR.  HE SAID IT SOUNDS LIKE THE ENGINE IS RACING.  I DIDN'T RECOGNIZE IT UNTIL HE MENTIONED IT.  WHILE I WAS SITTING IN THE LINE WAITING TO PICK UP MY FOOD, I NOTICED THE ENGINE WASN'T RACING AS BAD AS IT HAD BEEN.  WHILE I WAS SITTING IN THE DRIVE THRU LINE, THE CAR ACCELERATED AND TOOK OFF.  I LOST CONTROL OF THE CAR.  I HIT ANOTHER CAR AS THE CAR LEFT THE PARKING LOT AND RAN INTO THEIR FENCE.  THE FENCE WAS THERE FOR SAFETY MEASURES, TO KEEP YOU FROM GOING DOWN AN EMBANKMENT.  THERE ISN'T A POLICE REPORT.  THE POLICE DIDN'T COME BECAUSE IT WAS PRIVATE PROPERTY  I CAN PROVIDE INFORMATION, (IF REQUESTED) FROM MY INSURANCE COMPANY.  THEY DECLARED THE CAR TOTALED ON 4/9/2021.",
        "vin": "3N1AB7AP5KY"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/09/2021",
        "dateOfIncident": "02/14/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407238,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2019 NISSAN SENTRA. THE CONTACT STATED WHILE DRIVING ON THE FREEWAY AT 60 MPH, THE VEHICLE SLID ON SOME ICE AND AS A RESULT, THE VEHICLE RAN INTO A LIGHT POLE. THE SIDE AIR BAGS DEPLOYED AS THE FRONT AIR BAGS FAILED TO DEPLOY. A POLICE REPORT WAS NOT FILED.THERE WERE NO INJURIES SUSTAINED. THE VEHICLE WAS NOT DRIVABLE AND WAS TOWED TO AN IMPOUND LOT. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. A DEALER WAS NOT CONTACTED. THE MANUFACTURER HAD NOT BEEN INFORMED OF FAILURE. THE FAILURE MILEAGE WAS 27,000.",
        "vin": "3N1AB7AP0KL"
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/08/2021",
        "dateOfIncident": "03/10/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406981,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AND SLIGHTLY MOVING RIGHT OR LEFT THERE WAS A CLICKING NOISE AND THE CAR KICKS BACK.  THEN AS THE WHEELS ARE TURNED LEFT OR RIGHT IT FELT AS IF YOU LOSE CONTROL OF TURN.  YOU HAVE TO REALLY KEEP EXTRA CONTROL OF THE STEERING WHEEL.",
        "vin": "31NAB7AP3KY"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/05/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406435,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN SENTRA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 21V135000 (EXTERIOR LIGHTING) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE VEHICLE WAS TAKEN TO RUSS DARROW CHRYSLER DODGE JEEP RAM OF MILWAUKEE (10901 W METRO AUTO MALL, MILWAUKEE, WI 53224, (888) 497-8363) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3N1AB7AP8KY"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/29/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405338,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DISPLAY SCREEN FOR HEAT/AIR CONDITIONING AND AIRFLOW CONTROLS WILL RANDOMLY SHUT OFF. THE TEMPERATURE AND AIRFLOW CONTROLS WILL STILL WORK EVEN WHEN THE SCREEN IS OFF. I WILL HAVE THE HEAT SET TO 70 BUT IT FEELS LIKE I PRESSED THE AIR CONDITIONING BUTTON ( IHAVE NOT AND CHECKED BY PRESSING THE AIR CONDITIONING BUTTON). WHILE OTHER TIMES, I WILL HAVE THE AIR TEMPERATURE SET TO 62 AND IT FEELS LIKE I'VE TURNED IT UP TO 85 DEGREES.",
        "vin": "3N1AB7AP3KY"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/22/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404341,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "IT'S A NEW 2019 NISSAN SENTRA I TOOK IT IN LAST YEAR AND THEY REPLACED THE BATTERY BECAUSE I KEPT HAVING A DEAD BATTERY WHERE I WOULD HAVE TO JUMP START MY CAR, NOW AGAIN 2021 ITS DOING THE SAME PROBLEM WHERE I HAVE TO JUMP START MY CAR 2-3 PER WEEK.",
        "vin": "3N1AB7AP5KY"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/15/2021",
        "dateOfIncident": "03/15/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403156,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION HAD TO BE REPLACED AFTER A YEAR OF OWNING CAR, MOTOR ISSUE HAPPENED TODAY WHILE DRIVING HOME. IT STARTED SPUTTERING AND SHUT DOWN WHILE DRIVING ON FREEWAY. DEALER SAID ITS MOTOR PROBLEM. JUST SPENT $500 GETTING REPAIRED NOT 2 DAYS AGO. FRONT COLLISION SENSOR WAS REPAIRED ,BUT STILL DON'T WORK, AND RADIO HAS BEEN FIXED 3 TIMES AND PROBLEM STILL EXISTS THEY BOTH WHERE SUPPOSE TO BE FIXED 2 DAYS AGO,AND WHEN WE GOT THE CAR BACK PROBLEMS STILL THERE. NISSAN SAID WE DON'T QUALIFY BECASE OF MILES ON CAR. ITS A LEMON,IT HAS MORE ISSUES BUT TO MANY TO LIST.",
        "vin": "3N1AB7AP4KY"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/10/2021",
        "dateOfIncident": "12/01/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400234,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN SENTRA. THE CONTACT STATED THAT ONCE PLACING THE VEHICLE INTO PARK AND TURNING OFF THE IGNITION, THE ENGINE WOULD MAKE AN ABNORMAL, CLICKING NOISE AS THE HEADLIGHTS AND BRAKE LIGHTS WOULD CONTINUOUSLY FLICKER. THE CONTACT ALSO STATED THAT ON ONE OCCASION AS THE FAILURE OCCURRED, THE BRAKE MALFUNCTION WARNING LIGHT HAD ILLUMINATED ON THE INSTRUMENT PANEL. RECENTLY, THE CONTACT STATED THAT AFTER EXPERIENCING THE FAILURE, THE VEHICLE FAILED TO START-UP. NEITHER THE DEALER NOR THE MANUFACTURER WERE NOTIFIED OF THE FAILURE. UPON INVESTIGATION, THE CONTACT LINKED THE FAILURE TO NHTSA CAMPAIGN NUMBER: 21V135000 (EXTERIOR LIGHTING) HOWEVER, THE PART FOR THE REPAIR WAS UNAVAILABLE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 43,000.",
        "vin": "3N1AB7AP9KY"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/13/2021",
        "dateOfIncident": "01/14/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396079,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CARS AEB SYSTEM ENGAGES FOR NO REASON. THIS IS THE SECOND TIME IT HAS DONE THIS AND NOW THE MALFUNCTION LIGHT AND ALARM STAYS ON CONTINUOUSLY.  MY WARNING LIGHT SAYING UNAVAILABLE FRONT RADAR HAS BEEN ON SINCE THIRD MONTH  AFTER I BOUGHT IT.. I'M SCARED TO PUT MY CHILDREN IN CAR DUE TO THE FEAR OF IT BRAKING  SUDDENLY FOR NO REASON AND BRINGING MY CAR TO A COMPLETE STOP.",
        "vin": "3N1AB7AP1KY"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/13/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396119,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FACTORY RADIO KEEPS REBOOTING ON ITS OWN. IT DOES IT SOMETIMES 10 TIMES WITHIN 30MIN. I ONLY USE THE BLUETOOTH FEATURE. IT DOES THIS WHILE MOVING AND SITTING STILL.",
        "vin": "3N1AB7AP8KY"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/20/2021",
        "dateOfIncident": "01/19/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388956,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I SAW THAT THE 2019 NISSAN SENTRA SV HAD A RECALL FOR THE BACK UP CAMERA AND TODAY MY BACK UP CAMERA STOPPED WORKING AND WHEN I GO TO SETTING IT DOESN'T GIVE ME THE OPTION TO TURN IT BACK ON.",
        "vin": "3N1AB7AP9KL"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "01/14/2021",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388249,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "EVEN A SMALL BUMP IN THE ROAD (NOT EVEN A BIG SPEED BUMP) SOMETIMES CAUSES THE FRONT BUMPER TO RISE AND STRIKE THE BRACKET HOLDING THE FORWARD COLLISION WARNING SENSOR.  THAT THROWS THE SENSOR OUT OF CALIBRATION AND MAKES IT UNRELIABLE.  THE TECH AT AUTO NATION COLLISION IN LAS VEGAS TOLD ME THIS IS A COMMON PROBLEM.  HE SAID THE  BUMPER AND THE BOTTOM OF THE BRACKET ARE TOO CLOSE TOGETHER SO THE BRACKET GETS HIT OFTEN AND DAMAGES THE SENSOR.  THIS IS A SAFETY ISSUE.  YOU THINK YOU HAVE A COLLISION WARING SYSTEM BUT YOU DON'T OR THE SENSOR REPORTS A COLLISION WHEN NONE HAS HAPPENED.",
        "vin": "3N1AB7AP8KY"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "01/11/2021",
        "dateOfIncident": "01/11/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387628,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2019 SENTRA WON'T START AND WE ENDED UP BUYING A BATTERY AND IT STILL WON'T START.  FROM THE RESEARCH I'VE DONE LOOKS LIKE A BREAKING SENSOR. DUE TO THE. REAL LIGHTS NOT LIGHTING UP AT ALL. SEEMS TO BE A REOCCURRING THING FOR SENTRAS. THIS IS A SAFETY ISSUE AND POTENTIAL LAWSUIT DUE TO THE CAR TURNING OFF ON THE ROAD.",
        "vin": "3N1AB7AP2KY"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "01/09/2021",
        "dateOfIncident": "11/17/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11387269,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "LAST MONTH I WAS INVOLVED IN AN ACCIDENT THAT COULD HAVE BEEN AVOIDED IF MY SENSORS WERE WORKING PROPERLY, MY EMERGENCY BRAKE SYSTEM DID NOT EMPLOY AFTER BEING INVOLVED IN AN ACCIDENT I USED MY STANDARD BRAKE THE CAR WENT DOWN BEING REAR-ENDED SOMEBODY BUT I HAD PLENTY OF TIME TO STOP WITH ONLY THE FRONT BRAKES TO BULLYING ALLOWED MY CAR TO NOSEDIVE AND SLIDE EMERGENCY BRAKE WAS NOT RELEASED AND STOPPED WORKING BECAUSE OF SENSORS WERE NO LONGER TELLING THE CAR TO BREAK I HAD FULL COVERAGE INSURANCE AND INSURANCE AND NOT COVERING MY CAR BECAUSE THE CAR LOT DID NOT ADVISE ME OF HIS PROBLEM OR THE RECALLS ON THIS CAR I'VE BEEN WORKING WITH MY CREDIT FOR OVER 2 YEARS NOW AND BECAUSE I'M NEGLECTED TO TELL ME WHAT WAS WRONG WITH THE CAR I HAVE TO SET FOR NOW, AND I ALSO NOTICED THAT ONLY THE DRIVER SIDE AIRBAG DEPLOYED AND ME AND MY DAUGHTER WERE IN THE CAR AND THAT WAS THE ONLY SAFETY FEATURE THAT WAS RELEASED WITH MY CREDIT BEING BAD I WAS FORCED TO A HIGH APR RATE AND NEARLY $40,000 FOR A NISSAN SENTRA THAT WASN'T WORTH $0.25",
        "vin": "3N1AB7AP1KY"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/26/2020",
        "dateOfIncident": "12/19/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385043,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RADIO WILL RANDOMLY COME ON FOR A SECOND WHEN THE CAR IS OFF. I HAVE WENT OUT TO GET SOMETHING OUT OF THE TRUNK & THIS HAS HAPPENED & I HAVE ALSO WENT OUT TO LEAVE & WHEN I WALK OUTSIDE THE RADIO IN THE CAR IS PLAYING WHEN THE CAR HAS NOT BEEN DRIVEN SINCE THE PRIOR DAY. I AM CONCERNED ABOUT THIS ISSUE DRAINING THE CAR BATTERY. THIS IS RANDOM & HAS HAPPENED MORE THAN A DOZEN TIMES.",
        "vin": "3N1AB7AP8KY"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/21/2020",
        "dateOfIncident": "12/21/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384463,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENT PROBLEM WITH EMERGENCY BRAKING SYSTEM. WHEN OBSTRUCTION IS DETECTED THE EMERGENCY BRAKING SYSTEM WILL OVERRIDE ALL USE OF MANUAL BRAKING. THE BRAKE PEDAL WILL GO TO THE FLOOR WITHOUT ACTIVATING ANY FORM OF BRAKES FOR A FEW SECONDS AND THE AUTOMATIC BRAKES DO NOTHING. ONCE WHILE TRYING TO STOP ON A 55MPH HIGHWAY FOR A TRAFFIC LIGHT AND ONCE WHILE ENTERING A ONE LANE CONSTRUCTION ZONE ON A 70MPH INTERSTATE. LOCAL NISSAN DEALER HAS DIAGNOSED THE CAR AS WORKING AS INTENDED BUT I'M SURE IT'S INTENDED FOR THE VEHICLE TO STOP.",
        "vin": "3N1AB7AP5KY"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/20/2020",
        "dateOfIncident": "11/04/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384255,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BATTERY POSITIVE TERMINAL KEEPS GETTING CORRODED AND THE LIGHTS TURN ON AND OFF FROM INSIDE AND OUTSIDE LIKE IF THEIR TURNING ON AND OFF",
        "vin": "3N1AB7APXKY"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/08/2020",
        "dateOfIncident": "12/06/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11378589,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS RECENTLY IN A CAR ACCIDENT. I WAS INJURED DUE TO THE FRONT AIR BAG NOT GOING OFF. THE LIGHT TURNED ON BUT THE AIRBAG DIDN'T COME OUT. I WAS DRIVING ON THE FREEWAY AT THE MOMENT OF THE ACCIDENT.",
        "vin": "3N1AB7AP4KY"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/15/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374739,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I FILLED RECALL POSTCARD ON THE VEHICLES MONTH AGO AND I HAVE NEVER HEARD BACK FOR AN APPOINTMENT TO FIX IT.  THE RECALL # 303564.",
        "vin": "3N1AB7AP2KY"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "11/13/2020",
        "dateOfIncident": "11/10/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374549,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR FREQUENTLY CHIMES WITH THE FORWARD COLLISION WARNING / EMERGENCY BRAKE ASSIST AS THOUGH THERE IS A CHANCE OF A COLLISION.  WHEN IT DOES THIS, THERE IS ABSOLUTELY NOTHING IN FRONT OF MY CAR!  WHEN LEAVING WORK 2 DAYS AGO, I STARTED TO CROSS A LITTLE BUMP IN THE ROAD THAT I CROSS DAILY WITH NO ISSUES; THIS PARTICULAR INSTANCE HOWEVER, MY CAR DECIDED THAT IT WAS AN APPARENT COLLISION BECAUSE MY CAR CAME TO A DEAD STOP FROM ABOUT 15-20 MILES PER HOUR.  FORTUNATELY MY HUSBAND AND I WERE BOTH WEARING OUR SEATBELTS, AND NO ONE WAS BEHIND US AS IT WOULD HAVE CERTAINLY CAUSED AN ACCIDENT.  THE SENSOR/RADAR FOR THE FORWARD COLLISION/EMERGENCY BRAKE ASSIST IS A HAZARD IN MY OPINION.  THE CONCEPT IS FANTASTIC, BUT IF IT'S NOT GOING TO WORK PROPERLY, THEN IT NEEDS TO BE REMOVED FROM VEHICLES, OR AT LEAST BE ABLE TO BE DISABLED INDEFINITELY, NOT JUST WHILE YOU'RE OPERATING THE VEHICLE ONLY TO HAVE TO REMEMBER TO DISABLE THE FUNCTION NEXT TIME YOU'RE DRIVING.",
        "vin": "3N1AB7AP2KY"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/02/2020",
        "dateOfIncident": "11/02/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372641,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WILL NOT START WITH A FULLY CHARGED BATTERY AND FUNCTIONING KEY FAB.  THIS SEEMS TO BE A COMMON PROBLEM WITH THE NISSAN SENTRA FOR YEARS.  NISSAN HAS DONE NOTHING TO RECALL WHAT SEEMS TO BE A FAULTY BRAKE SWITCH.",
        "vin": "3N1AB7AP6KY"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/02/2020",
        "dateOfIncident": "10/02/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362491,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAND NEW NISSAN WITH LESS THAN 11K MILES AND BEEN HAVING NONSTOP ISSUES WITH STARTING THE CAR. THERE'S BEEN MULTIPLE OCCASIONS WHERE THE BRAKE BECOMES VERY STIFF AND HARD EVEN THOUGH THE CAR HAVEN'T SAT FOR LONG. I'VE BROUGHT IT TO THE DEALERSHIP AND CALLED SEVERAL ROADSIDE ASSISTANCE AND STILL HAVE NO SOLUTION TO FIX IT. I'VE SEEN AND READ HUNDREDS OF FORUMS ONLINE AND DECIDED TO CHANGE MY BRAKE SWITCH AND I'M STILL HAVING THE SAME PROBLEM.",
        "vin": "3N1AB7AP3KY"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/19/2020",
        "dateOfIncident": "05/28/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350191,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE I PURCHASE THE VECHILE I HAVE HAD IT BACK AT THE DEALER TO SEVERAL TIMES. IT JERKS WHEN I ACCELERATE, THEN IT WILL SURGE AND THE RPM GO HIGH WHILE IM DRIVING AND RAPIDLY JERKS. HESITATE ALL THE TIME.THIS HAPPENS ANYTIME I AM IN MOTION DRIVING.",
        "vin": "3N1AB7AP2KY"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/17/2020",
        "dateOfIncident": "07/14/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339850,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CRUISE CONTROL SWITCH RELEASES BRAKE SWITCH WHICH SOMETIMES MALFUNCTIONS AND DOES NOT ALLOW THE CAR TO START BECAUSE IT DOES NOT SENSE THE BRAKE BEING PUSHED. THERE IS NO MANUAL WORK AROUND. IT HAS HAPPENED SPORADICALLY BUT RECENTLY WOULD NOT START FOR THREE DAYS. I HAD TO TAKE THE BRAKE SWITCH APART AND CLEAN THE INSIDE OF EXCESS SILICONE THAT GETS DIRT IN IT AND KEEPS THE CONTACT METAL FROM SENSING THE BRAKE BEING PUSHED. THIS IS EXTREMELY DANGEROUS AND ALSO KEEPS THE BRAKE LIGHTS FROM WORKING.*DT*JB",
        "vin": "3N1AB7AP8KL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/14/2020",
        "dateOfIncident": "10/30/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339313,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT SENSOR SAYS OBSTRUCTED VIEW AFTER A COUPLE MINUTES OF DRIVING. THE LIGHT WILL TURN ON AND OFF WHILE BEEPING.",
        "vin": "3N1AB7AP9KY"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/28/2020",
        "dateOfIncident": "06/26/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331281,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST BOUGHT MY 2019 SENTRA 4/20/2020. I WAS DRIVING ON THE FREEWAY FROM LOS ANGELES TO SAN DIEGO & I FELT LIKE MY CAR WAS PULLING BACK, THE GAS WAS DRAINING SO FAST, THE RPM WAS GOING BACK AND FOURTH, THE MPH WASN'T ACCURATE WITH WHAT I FELT I WAS ACTUALLY DRIVING, IF I DRIVE OVER 40MPH THE CAR WILL WOBBLE, NOT ACCELERATING CORRECTLY, I GOT A FULL DIAGNOSTIC DONE NO CODES SHOWED UP, NISSAN SAID I NEEDED TO RESET THE SYSTEM, SO THEY RESET IT, THE ACCELERATION STILL WON'T PICK UP, AND I FEEL THE FRONT OF THE CAR DROPPED! NISSAN SERVICE DEPARTMENT SAYS THE DIAGNOSIS ISN'T SHOWING ANY CODES AND THEY ARE NOT SURE WHAT IS GOING ON I'M AFRAID I WILL LOSE CONTROL OF THE VEHICLE IF IT'S SHAKING SIDE TO SIDE, I'M AFRAID IT WILL STOP ACCELERATING RANDOMLY, TRANSMISSION WILL GO OUT WHILE I'M ON THE HIGHWAY & NISSAN STILL CAN'T FIND THE REASON TO WHY THE CAR IS DOING THAT. THEY HAVE NO ANSWERS AND THIS CAN CAUSE SERIOUS INJURIES TO MYSELF OR OTHER DRIVERS EVEN PASSENGERS. MY NISSAN IS LOSING POWER, NOT ACCELERATING CORRECTLY, I'M LOSING GAS FAST, AND NISSAN CAN'T FIND ANY CODE OR ANYTHING WRONG WITH THE CAR !",
        "vin": "3N1AB7AP2KY"
    },
    {
        "components": "UNKNOWN OR OTHER,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "06/03/2020",
        "dateOfIncident": "05/30/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327081,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE AHEAD DETECTION INDICATOR AND AEB SYSTEM WARNING INDICATOR LIGHT UP EVERY TIME I DRIVE THE CAR. WITHIN 1/2 MILE TO 1 MILE OF DRIVING BOTH THESE INDICATORS COME ON AND WILL NOT GO OUT. I'M NOWHERE NEAR ANY OBSTRUCTIONS, OTHER VEHICLES, OR ANYTHING ELSE AND THE WARNING LIGHTS COME ON. THE DRIVING CONDITIONS HAVE ALWAYS BEEN GREAT - NO RAIN, NO SNOW, SUNNY AND DRY ROADS. THE CAR IS CLEAN. THE SAD PART IS I BOUGHT THIS FROM A NISSAN DEALER WHO CLAIMED THEY DID A CERTIFIED PRE OWNED INSPECTION, WHICH OBVIOUSLY THEY DID NOT.   *TR",
        "vin": "3N1AB7AP0KL"
    },
    {
        "components": "EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/01/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319997,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO I PURCHASED A NEW VEHICLE ON THE 4/28/2019 ZERO MILES. WHEN FIRST BUYING THE VEHICLE THERE WERE NO PROBLEMS. HOWEVER AFTER 4 TO 5 MONTHS PASS BY I NOTICED MY HEADLIGHTS ARE FADING AWAY AS WELL AS THE PAINT OF THE VEHICLE AND WINDSHIELDS. WHEN TAKING THE CAR TO THE DEALERSHIP TTHEY SAID THEY CANNOT HELP ME. THEY ARE CLAIMING THE DAMAGE IS NATURAL CAUSE AND WANT TO CHARGE ME MONEY TO RESTORE THE HEADLIGHTS, PAINT, AND WINDSHIELD ON A BRAND NEW CAR. I INFORMED THE DEALERSHIP I CAME TO BUY A NEW CAR WITH ZERO PROBLEMS INCLUDING THE HEADLIGHTS AND PAINT AND WINDOWS AND STILL THEY DENIED ME HELP. AFTER INFORMING THEM I LOST VISIBILITY ON THE ROAD DO TO THE HEADLIGHTS NOT WORKING THE DID NOT CARE. I'M SCARED DRIVING AT NIGHT, I CAN'T SEE FAR DO TO THE HEADLIGHTS AND WINDSHIELD NOT WORKING PROPERLY AND ITS NEARLY ONLY BEEN 6 MONTH. WHEN TAKING THE VEHICLE TO MY MAKANICK HE INFORMED ME THAT MY LIGHTS WERE POLISHED INCLUDING DETAILING OF THE PAINT AND WINDOW BEFORE THE VEHICLE WAS SOLD TO ME THE VEHICLE WAS MADE TO LOOK NEW. HE EXPLAINED TO ME AT 4 TO 5 MONTHS THE POLISH WOULD REMOVED AND THE CAR WILL BE LEFT LOOKING LIKE HOW IT IS KNOW. AFTER THAT EVENT  I CAME TO REALIZE I BEEN SCAMMED BY THE DEALERSHIP AND NO ONE WANTED TO HELPED ME. I LOOKED FOR HELP FOR A MONTH DRIVING WITH BLURRY HEADLIGHTS AND WINDSHIELDS. WHEN I SEARCH FOR HELP ON YOUTUBE AND FOUND YOUR FIRM NUMBER.",
        "vin": "3N1AB7AP3KY"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/24/2020",
        "dateOfIncident": "02/15/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11319129,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO MY NAME IS [XXX] . I HAVE A STORY I WOULD LIKE RAN. ON JAN. 23, 2020 I BOUGHT A BRAND NEW NISSAN SENTRA. THE CAR COST OVER 18,000 DOLLARS. IT HAD 24 MILES ON IT WHEN I PULLED OFF THE LOT. ON THE MORNING OF FEB. 15, 2020 AT LESS THAN A MONTH OF OWNERSHIP MY TEEN DAUGHTER'S AND I WAS HEADING INTO TOWN FOR BREAKFAST. WE WERE RUNNING DOWN THE HIGHWAY AT 55 MPH WHEN THE CURTAIN AIRBAGS DEPLOYED AT RANDOM. NO WRECK OR ACCIDENT OF ANY KIND. MY LEFT EAR DRUM WAS BUSTED AND  MY DAUGHTER WAS MASSIVELY BRUISED. I TOOK THE CAR BACK TO THE DEALERSHIP AND THEY ISSUED A RENTAL. 5 DAYS LATER THEY CALLED AND TOLD ME THE RENTAL HAD TO BE RETURNED AND NISSAN WAS NOT GOING TO GIVE ANY FINANCIAL ASSISTANCE OF ANY KIND. I CALLED CONSUMER AFFAIRS TO SEE WHY THE RENTAL WAS BEING TAKEN BACK. I WAS INFORMED RUDELY THAT THEY WOULD NOT BE HELPING IN ANY WAY AND AIRBAGS WERE A COMPLEX MACHINE THAT DID NOT DEPLOY WITHOUT CAUSE.  AND THEN WENT ON TO ACCUSE ME OF FRAUD. THE CAR FINALLY GOT INSPECTED AT NISSAN OF COOKEVILLE BY A CONSUMER INSPECTOR WHO STOOD WITH ME AND CONFIRMED THAT THE CAR WAS NOT WRECKED AND THE MALFUNCTION WAS NOT MY FAULT. I JUST TODAY HEARD BACK FROM CONSUMER AFFAIRS TODAY FOR THEM TO TELL ME THAT NISSAN WOULD NOT BE HELPING ME IN ANY WAY. AND VELOCITY HAD SOMETHING TO DO WITH THE RANDOM DEPLOY AND THAT'S WHAT AIRBAGS ARE SUPPOSED TO DO. SO HE LITERALLY TOLD ME THAT AIRBAGS ARE SUPPOSED TO DEPLOY SOMETIMES WITHOUT ANY COLLISION. THEY HAVE FORCED ME TO DRIVE THIS CAR FOR A MONTH AND A HALF WITH MY VIEW OBSTRUCTED AND SEATBELTS NOT WORKING WITH MY CHILDREN AND NOW TELLS ME THEY WILL NOT STAND BEHIND THEIR VEHICLES MALFUNCTION AND IT IS ON ME TO DEAL WITH. THEY WILL ALSO TELL YOU THEY HAVE NEVER HAD TROUBLE WITH AIRBAGS BUT THERE HAS BEEN A HUGE RECALL ABOUT UNSAFE DEPLOYING AIRBAGS FOR A LOT OF NISSAN VEHICLES. PLEASE HELP ME.  *TR*DT*JB*DT  CONSUMER STATED MANUFACTURE AND DEALER HAS BEEN CONTACTED BUT VEHICLE HAS NOT BEEN REPAIRED.*JB",
        "vin": "3N1AB7AP1KY"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/18/2020",
        "dateOfIncident": "02/15/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11318592,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THIS CAR BRAND NEW ON 1/23/2020. IT HAD 24 MILE ON IT WHEN I PULLED OFF THE LOT. ON 2/15/2020 MY DAUGHTER'S AND I WAS HEADING INTO TOWN AND THE CURTAIN AIRBAGS DEPLOYED AT RANDOM. WITHOUT ANY COLLISION, ACCIDENT, OR RUNNING OVER ANYTHING OF ANY KIND.  IT BUSTED MY EARDRUM AND MASSIVELY BRUISED MY DAUGHTER. NISSAN CONSUMER AFFAIRS HAVE BEEN VERY RUDE ABD ARE REFUSING TO HELP WITH A RENTAL OF ANY KIND AND HAVE EVEN WENT SO FAR TO ACCUSE ME OF FRAUD. I AM BEING FORCED TO CONTIBUE DRIVING THE CAR AS IS AND THE SEAT BELTS ARE ALSO LOCKED UP. I WAS SUPPOSED TO HEAR BACK FROM THEM 7 DAYS AGO AND CANNOT GET A CALL BACK OR RETURNED EMAIL FROM THEM.",
        "vin": "3N1AB7AP1KY"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/14/2020",
        "dateOfIncident": "03/10/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318061,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE KEYLESS ENTRY FOB IS SLIGHTLY SENSITIVE. I FINANCED THE CAR ON 3/10/2020. AFTER TAKING A NAP UPON LEAVING THE VACCINATION CLINIC FOR TETNA ADULT SHOT, I SLEPT FROM AROUND 6PM-142AM IN A WOODED AREA PARKING SPOT AT A LOCAL PARK AND WHEN I WOKE UP, MY CAR DOORS WERE UNLOCKED AND MY DRIVER SIDE WINDOW WAS OPEN A LITTLE AND I HAD IT RAISED AND WAS SURE TO LICK THE DOOR PRIOR TO GOING TO SLEEP.  THEN ON 3/11/2029, I WENT TO THE CONVENIENCE STORE FOR A PIT STOP WHEN I ARRIVED BACK TO THE CAR, THE TRUNK WAS OPEN AND WHEN I GOT OUT IF THE CAR I WAS SURE TO LOOK AT IT WHILE HITTING THE LOCK AND PLACED THE KEY IN MY POCKET.",
        "vin": "3N1AB7AP0KY"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/28/2020",
        "dateOfIncident": "01/11/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11312150,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BUTTONS ON MY STEERING WHEEL WORKS WHEN THEY WANT TO..   THEY FRONT RADAR SENSOR CUTS OF AND SAYS IT'S OBSTRUCTED AND THE CRASH LIGHT COMES ON  I WAS DRIVING OUT OF STATE THE FIRST TIME THE RADAR QUIT WORKING UNTIL I COULD SHUT THE CAR OFF AND STARTED IT AGAIN.. THE BUTTONS WAS THE SAME TIME   IT STARTED IN JANUARY THE FIRST TIME THEN HASN'T DONE IT TILL NOW 02-28-2020 CONSTANTLY",
        "vin": "3N1AB7AP9KY"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/11/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308402,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RADIO TURNS OFF AND ON BY ITSELF WITHOUT THE CAR BEING ON. I HAVE WALKED UP TO THE CAR TO HEAR IT PLAYING MUSIC. IT HAPPENS RANDOMLY DRIVING, NOT DRIVING, AND WITH NO POWER TO CAR. I AM WORRIED ABOUT MY BATTERY DRAINING. ALSO, THE AIR CONDITIONER DISPLAY IS BLANK FROM TIME TO TIME. ONLY THE ORANGE LIGHTS ON THE BUTTONS ARE LIT UP. SOMETIME IF I RESTART THE CAR, IT WILL COME BACK ON AS IF IT IS RESET, OTHER TIMES IT DOES NOT HELP. THE DISPLAY SCREEN ABOVE THE AC CONTROL PANEL FREEZES ALONG WITH THE DISPLAY IN BETWEEN THE SPEEDOMETER FROM TIME TO TIME. IT SEEMS AS IF THE COMPUTER SYSTEM DOES WHAT IT WANTS TO AND WHEN IT WANTS.  I HAVE NOT HAD THE CAR FOR 6 MONTHS AND IT'S ALREADY GIVING ME PROBLEMS. IT WAS PURCHASED AT THE END OF SEPTEMBER 2019 FROM A NISSAN DEALERSHIP, BRAND NEW WITH 4 MILES ON IT.",
        "vin": "3N1AB7AP4KY"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/11/2020",
        "dateOfIncident": "02/11/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308425,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERYTIME I DRIVE ABOUT 4 MILES THE FRONT RADAR SENSOR GETS DISABLED AND DISPLAYS A WARNING, THIS DISABLED THE CRUISE AND TURNS OF AUTOMATIC EMERGENCY BRAKING, THIS IS DANGEROUS FOR ME TO DRIVE WITH, I HAVE TAKEN THE CAR TO THE DEALERSHIP 3 TIMES AND ITS STILL HAPPENING, THE DEALERSHIP CLAIMS THEY FIXED IT BUT DID NOT",
        "vin": "3N1AB7AP3KY"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/31/2020",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306365,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY IN DASH SCREEN KEEPS TURNING OFF AND REBOOTING ITSELF WHEN I DRIVE. THIS HAS BEEN AN ONGOING ISSUE SINCE I REPORTED IT IN SEPTEMBER 2019. I REPORTED IT TO DEALERSHIP, THEY SAY A RECALL WAS ISSUED, THEY UPDATED SOFTWARE AND IT STILL DOES IT.",
        "vin": "3N1AB7AP1KY"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/31/2020",
        "dateOfIncident": "01/30/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306409,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY VEHICLE 4/2019 AND TAKEN IT BACK TO THE DEALER AT LEAST 4 TIMES FOR OTHER PROBLEMS AND THEY TELL ME THERE'S NOTHING GOING ON WHEN THEY CHECK IT. I AM NOW EXPERIENCING A NEW PROBLEM AND I TOOK IT BACK TO THE DEALER CONCERNING THE RADIO COMING ON AND OFF WHEN THE CAR WASN'T IN USE. WHEN I WOULD GET INTO THE CAR IT WOULDN'T START AND I WOULD HAVE TO GET IT  BOOSTED TO START. THE BATTERY KEEPS RUNNING DOWN. I WAS TOLD BY THE DEALER THAT THERE HAS BEEN OTHER REPORTS AND THAT THEY ARE BEING TOLD NOT TO FIX PROBLEM UNTIL NISSAN FURTHER INVESTIGATE THE PROBLEM. THEY CLAIMED TO DISMANTLED THE RADIO TO AVOID THE BATTERY FROM RUNNING DOWN BUT ITS STILL DOING THE SAME THING. ALSO IT WAS STATED I COULD TO CONTINUE DRIVING UNTIL THEY CALL IT IN FOR REPAIRS AND STATED THAT THEY COULDN'T GIVE ME A TIME FRAME WHEN IT WILL BE FIXED. I WASN'T OFFERED A LOANER AND WHEN I ASKED I WAS TOLD THEY DIDN'T HAVE ONE AVAILABLE. I TOOK IT IN 1/30/20 AND PICKED IT UP 1/31/20.",
        "vin": "3N1AB7AP7KY"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/24/2020",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301716,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SECOND DAY AFTER PURCHASING VEHICLE THE RADIO WOULD COME ON AND GO OFF EVEN WHEN CAR NOR RADIO WAS ON. IT HAPPENS A LOT. WENT OUT TO GARAGE ONE NIGHT AND RADIO WAS PLAYING. DON'T KNOW HOW LONG IT WAS ON. HAPPENS WHILE DRIVING ON HIGHWAY AND STREETS ALSO. CAME OUT OF WORK RADIO WAS PLAYING IN PARKED CAR.I'M AFRAID BATTERY WILL RUN DOWN OR WORSE ELECTRICAL PROBLEM CAUSING OTHER SAFETY ISSUES WHEN DRIVING CAR. DEALER HAD HAD 22 DAYS WITH NO ANSWER TO REPAIR. JUST BOUGHT OCT. 31ST.",
        "vin": "3N1AB7AP7KY"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/01/2020",
        "dateOfIncident": "07/31/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11292414,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD AN ACCIDENT ON JULY 31ST, 2019 WHERE MY CAR WAS TOTALED AND THE MOTOR WAS LOST COMPLETELY. MY AIRBAGS DID NOT DEPLOY AND THE NISSAN SYSTEM STATED, 'REFER TO OWNER'S MANUAL.' THANKFULLY I WAS WEARING MY SEATBELT AND ONLY HAD MINOR SCRATCHES AND BRUISES.",
        "vin": "3N1AB7AP5KY"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/29/2019",
        "dateOfIncident": "11/23/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282936,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT RADAR COLLISION WARNING ACTIVE, IT DOES NOT SLOW OR STOP THE CAR IN EVENT OF OBSTRUCTION.IT GOES OFF EVERY TIME I START THE CAR AND WITHIN 5 MINUTES OF DRIVING IT FAILS AND DEACTIVATES THE AUTO STOP FUNCTION.",
        "vin": "3N1AB7AP2KY"
    },
    {
        "components": "AIR BAGS,SEATS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/20/2019",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281376,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT BUMPER SENSOR IS DETECTING THINGS IN THE ROAD THAT AREN'T THERE AND AUTOMATICALLY APPLYING THE BRAKES ON MY CAR. WHEN THIS HAPPENS, THERE'S A LOUD ALMOST GRINDING SOUND AND THE CAR BRAKES VERY HARD. THE OTHER ISSUE I'M HAVING IS THE CAR WILL SOMETIMES DETECT SOMEONE IN THE PASSENGER SEAT WHEN IT'S EMPTY AND TURN ON THE BUCKLE SEAT BELT LIGHT AND TURN OFF THE AIR BAG OFF LIGHT FOR THE PASSENGER SEAT.",
        "vin": "3N1AB7AP6KY"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/20/2019",
        "dateOfIncident": "11/17/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11281415,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON FREEWAY LESS THAN 35 MPH, CAR MADE LOUD NOISE FOR 1-2 MINUTES AT SAME TIME I FELT UNDER FLOOR BOARD  SOMETHING PULLING. I TRIED TO SLOW DOWN, BRAKES DIDN'T WORK. I REAR ENDED A CAR. THE CAR GEAR SHIFT POPPED INTO REVERSE; I PRESSED HARDER ON  BRAKES & THEY FINALLY WORKED. I NOTICED A BIG LIGHT ON THE DASHBOARD SAYING 'MALFUNCTION, CHECK OWNERS MANUAL' THERE WAS A GRAY SYMBOL NEAR THESE WORDS. INSIDE THE SPEEDOMETER CIRCLE THAT SAME SYMBOL APPEARED IN BRIGHT YELLOW. AT SOME POINT WITHIN AN HOUR 2 MORE YELLOW SYMBOLS APPEARED ON THE FAR LEFT OF THE DASH, A YELLOW TRIANGLE WITH AN EXPLANATION POINT, AND A CAR WITH 2 CURVED LINES BEHIND THE BACK TIRES. WHEN THE CAR WAS RETURNED TO THE DEALERSHIP I PURCHASED IT FROM, THE STAFF IMMEDIATELY ATTEMPTED TO BLAME ME FOR THE INCIDENT'ASKING WHY DIDN'T I BRING THE CAR IN FOR SERVICE? AND THAT I HAVE TO GET A RENTAL CAR AND MY CAR REPAIR THROUGH MY INSURANCE COMPANY. HE PUSHED THE IDEA OF GETTING THE CAR REPAIRED. I STATED I JUST BARELY GOT THE CAR 3-4 WEEKS AGO BRAND NEW. I LEFT THE CAR TO BE CHECKED BY SERVICE DEPARTMENT. THE NEXT DAY THE SERVICE MANAGER DENIED ANY MALFUNCTION SAYING THERE WASN'T ANY CURRENT CODES JUST PAST CODES; I ASKED WHAT THAT MEANT HE SAID A BRAKE SENSOR AND SOME OTHER DATA I DIDN'T COMPREHEND. HE SAID GET MY INSURANCE TO FIX THE CAR. I SAID NO SIR, I WANT MORE INFORMATION ON WHY THE CAR MALFUNCTION FIRST. ONCE I EXPLAIN TO HIM AGAIN WHAT HAPPENED HE SAID HE WOULD HAVE HIS FORMAN CHECK OUT THIS CAR THE NEXT MORNING; HOWEVER LESS THAN AN HOUR THE SERVICE MANAGER ME BACK TO SAY HE TALKED TO A FIELD TECH ENGINEER AND WAS ADVISED THAT I HAD A RIGHT TO CALL NISSAN CORP TO MAKE A REPORT. I WENT BY SRVC DPT TO GET SOMETHING, THEY TRIED TO GET TO TAKE/REPAIR MY CAR. I DIDN'T. ONCE I SPOKE TO NISSAN CORP THEY SAID IT TAKE 6-8 WEEKS FOR INVESTIGATION ETC TO BE COMPLETED AND FOR ME NOT TO GET CAR REPAIRED.",
        "vin": "3N1AB7AP7KY"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/30/2019",
        "dateOfIncident": "09/02/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277024,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR SOME REASON WHEN I START MY CAR IT REVS UP LIKE MY FOOT IS ON THE GAS. MY RADIO CUTS OFF AND RESTARTS FOR NO REASON. WHEN MY LIGHTS ARE ON AUTOMATIC ONCE MY CAR IS PARKED IT TAKES 15 OR LONGER INTERMITTENTLY FOR THEM TO SHUT OFF.",
        "vin": "3N1AB7AP3KY"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/30/2019",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277082,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN SENTRA. WHILE DRIVING 65 MPH, THE REAR OF THE VEHICLE SWAYED VIOLENTLY FROM SIDE TO SIDE. THE CONTACT ALSO MENTIONED THAT THE SYSTEM MALFUNCTION WARNING INDICATOR ILLUMINATED. CONYERS NISSAN (1420 IRIS DR SW, CONYERS, GA 30094, (678) 233-2448) WAS CALLED AND THE CONTACT WAS INFORMED TO RESTART THE VEHICLE TO GET THE FRONT CRASH SYSTEM TO FUNCTION NORMALLY AGAIN. THE DEALER FURTHER STATED THAT THE VEHICLE WAS DRIVING NORMALLY DUE TO THE WAY IT WAS DESIGNED. THE VEHICLE WAS NOT TAKEN TO A DEALER FOR DIAGNOSTIC TESTING OR REPAIRS. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND THE CONTACT WAS CURRENTLY WAITING FOR A CALL BACK. THE FAILURE MILEAGE WAS 7,682.",
        "vin": "3N1AB7AP1KY"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/28/2019",
        "dateOfIncident": "10/26/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271449,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT RADAR SENSOR IS FAULTY. CAUSING EMERGENCY BRAKING FEATURE TO BECOME DISABLED.",
        "vin": "3N1AB7AP4KY"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/12/2019",
        "dateOfIncident": "10/11/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268061,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING IN TRAFFIC ABOUT 35 MPH ALL OF A SUDDEN TRAFFIC CAME TO STOP. I APPLIED MY BRAKES AND DID NOT GRAB RIGHT AWAY I TURNED THE STEERING WHEEL TO AVOID HITTING THE VEHICLE IN FRONT OF ME. I HIT MY FRONT LEFT CORNER IN THE BACK RIGHT CORNER OF THE OTHER VEHICLE. MY AIR BAGS DID NOT DISCHARGED,MY FRONTAL BRAKE SENSOR GAVE NO WARNINGS . I JUST HAD MY VEHICLE INSPECTED LAST WEEK. I FILED A CLAIM WITH MY INSURANCE COMPANY, MADE A POLICE REPORT. TWO WEEKS AGO I WAS AT THE DEALER ASKING IT THERE WAS ANY RECALLS BECAUSE MY SENSOR LIGHTS COMES ON WHEN NOTHING IS IN FRONT OF ME. I WAS TOLD THAT THERE IS NO RECALLS ON MY VEHICLE. THAT THE RECALL ON THE FRONT SENSOR WAS FOR THE NISSAN ROGUE WHERE THE VEHICLE BRAKES ON ITS OWN.",
        "vin": "3N1AB7AP3KL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/25/2019",
        "dateOfIncident": "09/19/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257899,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 NISSAN SENTRA PURCHASED IN JULY 2019 - MY STEREO WILL REBOOT ON ITS OWN COMPLETELY SHUTTING DOWN AND REBOOTING WITH THE NISSAN/NISSANCONNECT LOGOS. TYPICALLY DOES THIS ON ANY MODE OF THE STEREO AND WILL HAPPEN AFTER ABOUT 4 SONGS ON BLUETOOTH OR IF YOU SKIP MORE THAN TWO SONGS AT A TIME. DOES NOT REALLY IMPACT DRIVING AS I'VE YET TO SEE IT IMPACT USE OF THE BACKUP CAMERA.",
        "vin": "3N1AB7AP0KY"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/12/2019",
        "dateOfIncident": "08/12/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11254994,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT RENTED A 2019 NISSAN SENTRA. WHILE DRIVING ON THE HIGHWAY, THE DRIVER'S SIDE WINDOW EXPLODED AND GLASS FLEW OVER THE CONTACT. THE FAILURE OCCURRED WITHOUT WARNING. THERE WAS A LOUD NOISE WHEN THE GLASS EXPLODED AND THE CONTACT WAS ABLE TO SWERVE AND AVOID A CRASH. THE RENTAL AGENCY CAME OUT, TOWED THE VEHICLE, AND GAVE THE CONTACT A NEW RENTAL VEHICLE. THE CONTACT WROTE THE MANUFACTURER AND AN UNKNOWN DEALER, BUT HAD NOT HEARD BACK WITH A RESPONSE. THE CONTACT SUFFERED HEARING LOSS IN THE LEFT EAR AND WAS SEEING A SPECIALIST. THE FAILURE MILEAGE AND VIN WERE UNKNOWN. *DT*DT    'PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'*JB*JB",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/11/2019",
        "dateOfIncident": "09/09/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254819,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN STOPPED THE VEHICLE GOES TO 4 RPM WHEN TRYING TO DRIVE AFTER BEING STOPPED AT RED LIGHT OR STOP SIGN ANYTIME CAR IS STOPPED AND TRYING TO DRIVE AGAIN.I HAD A FAULTY SWITCH ON 9/8/2019 CAR WOULDN'T  START TOOK TO DEALERSHIP FOR REPAIR AND OIL CHANGE AFTER THAT THE PIC THAT I ATTACHED LIGHTS CAME ON.THOSE LIGHTS WASN'T ON BEFORE.AFTER PULLING OFF DEALERSHIPS LOT I GOT ON HIGHWAY AND LIGHTS CAME ON",
        "vin": "3N1AB7AP1KY"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/06/2019",
        "dateOfIncident": "09/05/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253555,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT RADAR OBSTRUCTION LIGHT ON   NO AEB AVAILABLE WHILE DRIVING",
        "vin": "3N1AB7AP2KL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/31/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252559,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE FRONT END COLLISION LIGHT KEEPS COMING ON.  THIS IS SCARY AS THE CAR HAS NEVER BEEN IN AN ACCIDENT.  IT WILL COME ON WHILE DRIVING OR IN PARK.  IT COMES ON A LOT.  THIS IS A ISSUE THAT NEEDS TO BE FIXED.  THIS FAULTY SENSOR NEEDS TO BE REPLACED.",
        "vin": "3N1AB7AP6KY"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/19/2019",
        "dateOfIncident": "08/04/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245018,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "UNABLE TO USE THE CAR JACK.IT BROKE. TK",
        "vin": "3N1AB7AP5KY"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/06/2019",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241945,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT RENTED A 2019 NISSAN SENTRA. WHILE THE CONTACT WAS USING THE MANUFACTURER SUPPLIED TIRE JACK, THE HANDLE FRACTURED AT THE CONNECTION POINT WHILE ATTEMPTING TO RAISE THE VEHICLE TO CHANGE THE TIRE. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE MANUFACTURER AND LOCAL DEALER WERE NOT NOTIFIED. ENTERPRISE RENT-A-CAR WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "3N1AB7AP5KY"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/28/2019",
        "dateOfIncident": "02/18/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240196,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TIME FREEZES ON DASH SCREEN ALONG WITH WHAT WAS PLAYING ON MY  BLUETOOTH IN DASH CLUSTER SCREEN. RADIO BUTTONS AND PHONE BUTTONS STOP WORKING ON STEERING WHEEL WHEN DASH CLUSTER SCREEN FREEZES.     THE FIRST TIME I BROUGHT MY CAR IN ON 2/18/19 WITH THIS PROBLEM THEY TOLD ME IT WAS MY CHARGER THEN THEY ARE HAVING PROBLEMS WITH IPHONES WITH 2019 NISSAN VEHICLES. STOPPED USING CHARGER.     SECOND TIME BRINGING MY VEHICLE IN FOR SAME CONTINUOUS PROBLEM ON 3/27/19 THEY DID AN ELECTRICAL SYSTEM CHECK BUT COULDN'T FIND ANYTHING. STILL NOT USING CHARGER.    THIRD TIME BRINGING MY VEHICLE IN 5/29/19 ELECTRICAL SYSTEM CHECK WAS DONE AND THEY TOLD ME THAT MY BATTERY WAS LOW CRANK AS WELL. TOLD ME IT IS A SAFETY HAZARD NOW AND THEY HAVE TO REPLACE THE DASH CLUSTER AND BATTERY. THE DEALERSHIP (HARBOR NISSAN) WHERE I PURCHASED THE CAR HAD MY CAR FOR A MONTH (THEY GOT ME INTO A RENTAL CAR THE WHOLE TIME)SO I GOT IT BACK ON 6/28/19 AFTER PARTS WERE REPLACED. NOT EVEN A MONTH OF HAVING MY CAR BACK IT DOES IT AGAIN ON 7/23/19 MY SERVICE ADVISOR WAS TOLD THE CAR MIGHT NEED A HARNESS AND I CALLED 7/27/19 MY SERVICE ADVISOR WAS NOT IN AND THEY TOLD ME I COULD PICK MY CAR UP THEY COULDN'T GET IT TO DO IT FOR THEM. BUT WHEN THEY HAD IT FOR A MONTH IT WAS A SAFETY HAZARD?? NOW ITS NOT?     THIS USUALLY HAPPENS WHEN DRIVING THE VEHICLE FOR OVER AND HOUR OR TWO. IT HAPPENS ON HIGHWAY AND CITY.",
        "vin": "3N1AB7AP9KY"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/25/2019",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234950,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ISSUE WITH FRONT RADAR SENSOR.  THE SENSOR IS CONSTANTLY SAYING SENSOR IS NOT AVAILABLE AND IS DEACTIVATED. IT DOESN'T MATTER IF YOU ARE ON THE HWY OR ON CITY STREET.",
        "vin": "3N1AB7AP2KY"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/01/2019",
        "dateOfIncident": "05/29/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228763,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS COASTING TOWARDS THE TRAFFIC LIGHT WANTING TO MAKE A LEFT HAND TURN WHEN THE LIGHT TURNED YELLOW AND I WAS ALREADY PAST THE POINT WHERE I COULD BACK UP.  I HAD TO HIT THE GAS PEDAL TO MAKE THE TURN IN A QUICK FASHION AND BEAT THE ONCOMING TRAFFIC.  THE CAR JUST PUTTERED ALONG AND I ALMOST GOT HIT BY THE ONCOMING TRAFFIC.  IT SEEMS LIKE THE CVT TRANSMISSION GETS DISENGAGED WHEN THE CAR IS COASTING AT LOW SPEEDS (5-10 MPH) AND THERE IS A LOSS OF POWER TO THE WHEELS WHEN I HIT THE GAS PEDAL AGAIN.  RPM IS 3000 AND THE CAR STILL DOESN'T MOVE QUICKLY ENOUGH TO GET OUT OF THAT DANGEROUS SITUATION.    THE REASON I BELIEVE THAT THE TRANSMISSION IS THE CULPRIT IS BECAUSE WHEN I STOP AT A LIGHT OR STOP SIGN AND I BARELY COME TO A STOP AND I HIT THE GAS PEDAL AGAIN, IT MAKES A JERKING MOTION, LIKE THE TRANSMISSION DIDN'T DOWNSHIFT TO 1ST LIKE IT IS SUPPOSE TO, IT GETS STUCK IN THE HIGH GEAR AND WHEN I HIT THE GAS PEDAL IT DOWNSHIFTS HARD.  I HAVE TO STOP A FEW FEET AWAY FROM THE LIGHT AND THEN RELEASE THE BRAKE A LITTLE IN ORDER FOR IT TO DOWNSHIFT TO 1ST.",
        "vin": "3N1AB7AP9KL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/01/2019",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228765,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRYING TO MERGE INTO THE HIGHWAY TRAFFICE AND I PRESSED ON THE GAS PEDAL TO PICK UP SPEED, BUT THE CAR JUST PUTTERED ALONG WITH THE RPM AT AROUND 3000 - 6000 AND I ALMOST GOT REAR-ENDED BY A VAN WHO GOT REALLY CLOSE TO THE REAR-END OF MY CAR.  THE GENTLEMAN IN THE VAN WAS CLEARLY UPSET AND I KNOW IT WAS MY FAULT BECAUSE MY CAR DID NOT WANT TO PICK UP SPEED.  I HAVE OWNED ABOUT 80 CARS IN MY LIFE AND I HAVE NEVER HAD THIS PROBLEM; I KNOW HOW TO MERGE INTO TRAFFIC VERY WELL, I HAVE BEEN DRIVING FOR 40 YEARS WITHOUT ANY ACCIDENTS OR TICKETS.  I TOOK THE CAR TO CHARLIE CLARK NISSAN DEALERSHIP WHERE I BOUGHT THE CAR AND THEY SAID THERE IS NOTHING WRONG WITH THE TRANSMISSION.    THIS CAR MAKES ME LOOK LIKE I DRIVE LIKE AN OLD LADY, PEOPLE ARE GETTING UPSET, AS IT HAS NO PICK UP POWER AT ALL EVEN THOUGH THE RPM IS PAST 3000.  THERE IS JUST NO WAY OUT OF A POTENTIAL DANGEROUS SITUATION.      THE REASON I THINK IT IS THE TRANSMISSION PROBLEM IS BECAUSE WHEN SHIFTING FROM 2ND TO 3RD IT LOSSES POWER, LIKE WHEN THE TRANSMISSION IS SLIPPING.",
        "vin": "3N1AB7AP9KL"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/19/2019",
        "dateOfIncident": "04/17/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220116,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 NISSAN SENTRA SR. CONSUMER WRITES IN REGARDS TO DAMAGED HOOD ON VEHICLE. *LD *JS    THE MANUFACTURER WAS NOTIFIED AND STATED THAT THERE WAS A DESIGN ERROR THAT CAUSES THE PAINT TO CHIP WHEN THE WIPER BLADES WERE LIFTED. *JS",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/13/2019",
        "dateOfIncident": "05/06/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207263,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FAULTY RADAR ON FRONT OF MY CAR CAUSED SPEED CONTROL AND EMERGENCY BRAKING SYSTEM TO MALFUNCTION WHILE IN MOTION. THIS OCCURRED SPORADICALLY SINCE NEW AND THEN CONSTANTLY FOR LAST 3 MONTHS. I FINALLY TOOK THE CAR IN FOR TROUBLESHOOTING LAST WEEK AND THE RADAR UNIT ON THE FRONT OF THE CAR WAS REPLACED. THIS FIXED THE PROBLEM BUT IT SHOULD BE BROUGHT TO SOMEONES ATTENTION BECAUSE OF THE SAFETY HAZARDS INVOLVED.",
        "vin": "3N1AB7AP2JY"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/07/2019",
        "dateOfIncident": "05/02/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206083,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT COLLISION SENSOR FOR THE VEHICLE IS FAULTY AND TURNS ON WHENEVER IT WANTS , WHICH POSES SAFETY HAZARD TO THE OCCUPANTS OF VEHICLE BECAUSE THE SENSOR CONTROLS THE BREAKS FOR YOUR CAR AND CAN BREAK AUTOMATICALLY IF IT TURNS ON ,WHICH HAPPENS VERY REGULARY.THIS ISSUE HAPPENS DURING DRIVING AND WHILE STOPPED .",
        "vin": "3N1AB7AP7KY"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/05/2019",
        "dateOfIncident": "02/27/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184395,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN SENTRA. WHILE DRIVING AT UNKNOWN SPEEDS, THE VEHICLE SURGED AND ACCELERATED. AN UNKNOWN WARNING INDICATOR ILLUMINATED AND \"UNAVAILABLE RADAR OBSTRUCTION\" WAS DISPLAYED. THE CONTACT RESEARCHED THE FAILURE AND STATED THAT IT WAS RELATED TO A FAULTY SENSOR. THE VEHICLE WAS TAKEN THREE TIMES TO NISSAN OF QUEENS (93-25 ROCKAWAY BLVD, OZONE PARK, (718) 835-8300) WHERE IT WAS DIAGNOSED THAT THE SYSTEM NEEDED TO BE RESET. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS CONTACTED AT 615-725-7687 AND PROVIDED CASE NUMBER: 34643243. NO FURTHER ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS 200. *DT",
        "vin": "3N1AB7AP0KY"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/12/2018",
        "dateOfIncident": "11/06/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161043,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASE 2019 NISSAN SENTRA ON 11/6/2019 WITH 15 MILES AT NISSAN OF MUSKOGEE.  SINCE PURCHASE THE AUTOMATIC EMERGENCY BRAKING (AEB) SYSTEM DEACTIVATES AND SHOWS A WARNING ON THE DASHBOARD 'FRONT RADAR UNAVAILABLE DUE TO OBSTRUCTION.'  A CRASH ICON ALSO ON DASHBOARD AT ALL TIMES. NO CRUISE CONTROL.  THE CAR IS OUT OF BALANCE. THE SENSOR COMES ON AT ALL TIME WETHER OR NOT THERE ARE OTHER VEHICLE NEAR THE CAR.    THE DEALERSHIP AND SERVICE DEPARTMENT ALLEGES THAT I AM THE ONLY ONE WITH THIS PROBLEM AND THE PARTS NOT AVAILABLE. I BROUGHT IT IN TO SERVICE.  THE DEALERSHIP SERVICE BARELY LOOK AT THE CAR NOR CHECK CODES. THE BALANCE IS WORSE.  THIS IS CAUSE BY A FAULTY DEFECTIVE RADAR SENSOR IN THE FRONT GRILL. SERVICE IS NOW WAITING FOR PARTS THAT NISSAN CAN'T GET ANYWHERE.",
        "vin": "3N1AB7AP3KY"
    }
]