[
    {
        "components": "ELECTRICAL SYSTEM,BACK OVER PREVENTION,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/26/2022",
        "dateOfIncident": "03/12/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458434,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Car emergency braking system engaged to start car  battery drained while parked, car will not start lights flicker then say malfunction refer to owners manual, shows the car have no back up warning no head on collision warnings and no reverse warning, car will not recognize key  Does not detect key, or say wrong key car battery immediately dies constantly. Could not get a reading .",
        "vin": "KNMAT2MT2KP"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/25/2022",
        "dateOfIncident": "02/11/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458332,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Hello- The issue with my 2019 Rogue is the AEB system. On or around 2/11 we dropped our vehicle off for our annual state inspection, on 2/12, While driving the vehicle, the \"Malfunction\" light came on along with front/rear collision warnings. Car nearly stopped in the middle of the road. We returned the vehicle to the mechanic, who stated that the computer gave an error code that the battery needed to be changed ($+193). Seemed odd for a three year old car, but we wanted to be safe and changed the battery. On 2/14 we changed the battery. On 2/15 we had a repeat of the earlier occurrence. This timed it happened on a highway! Mechanic suggested taking it to dealership On 2/16 we took car to dealership. They diagnosed the issue as the EZ pass obstructing the camera, and they realigned the laser guidance system ($150). On Feb 15 the car broke down again, 30 miles from home. Same issue. we needed to tow the car to the dealership($300). They held it for a couple of days, and diagnosed the issue as a faulty Crank Sensor ($329). This solved the problem until 3/25, and now the issue is occurring again.   PLEASE HELP! THE CAR IS NOT SAFE AND I DONT WANT ANYONE TO GET HURT!   There are complaints about this issue all over the internet, including reports on the news.",
        "vin": "JN8AT2MV1KW"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/15/2022",
        "dateOfIncident": "03/08/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456882,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving the 2019 Nissan Rogue (with only 19,200 miles) the vehicle suddenly engaged the AEB system. The vehicle was in the process of making a left hand turn when the incident occurred only traveling about 15 mph. As the brakes engaged, the steering wheel locked momentarily before power steering returned, additionally the engine completely died in the middle of the road. Luckily, the forward momentum was just enough for the vehicle to be steered into a side road. Once stopped numerous signals flashed in the dash including “AEB malfunction” and to see the dealer. Vehicle was totally dead and refused to start. A kind stranger assisted in pushing the vehicle to the side of the road. The insurance company sent a tow which allowed for the vehicle to be parked in the driveway. Nissan was informed of the issue and sent a courtesy tow to their local dealer. I was told the vehicle had an issue with the ECU. A special order was placed which took 6 days to arrive. Once installed, it was determined that the ECU was not the issue. As of this writing 7 days has elapsed and no reasonable explanation has been provided for the gross negligence on behalf of Nissan for selling such an unsafe vehicle. Under different circumstances the same event may have resulted in damaged property or worse yet significant injury or death.",
        "vin": "KNMAT2MT3KP"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/10/2022",
        "dateOfIncident": "03/05/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456082,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "while i was on the freeway the 2019 nissan rogue began to stall and the vehicle lost speed i try to get off the freeway almost crashed into on going freeway traffic and it stopped moving i put the car in park and i could not move the gears it was like they were stuck.no warning lights came on.I got the vehicle towed home, Then monday morning i got it towed to the dealer the service rep told me it wouldnt move or anything it needed to see a transmission specialist, i brought this car certified used,worst car ever.",
        "vin": "knmat2mv4kp"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/25/2022",
        "dateOfIncident": "02/21/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454132,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving on I-78W at 65-70 miles and suddenly the automatic emergency break went on and stopped my car.  I look around and there was not car closed to me at all. My heart was Frozen just to imagine what would Happed if there was some behind me or even worse my family with me . This is not the first time. It happen 2 times already and the first one was a few weeks after I got it from the dealer. Every single time I bring it back to the dealer to make sure that everything was fine but they said that was nothing and all it’s good. Apparently no it’s not.",
        "vin": "5N1AT2MV5KC"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/18/2022",
        "dateOfIncident": "01/28/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452909,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Emergency braking system engaging without provocation or cause",
        "vin": "5N1AT2MVXKC"
    },
    {
        "components": "ELECTRICAL SYSTEM,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/03/2022",
        "dateOfIncident": "02/01/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450316,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING CAR, a series of malfunctions occur. It has happened a few times and the problem list just keeps adding on. The first time for no reason at all the collision malfunction light turned on, causing the vehicle to slow down and have almost no power. Car was turned off and on then went away. Same thing happened a couple days in a row. Then while driving I noticed when pushing the rear defroster, the back up camera turned on WHILE DRIVING FORWARD..... the traction control light appeared, followed by the collision (AEB) warning malfunction shortly after. During each encounter with this the rear wiper would turn on very slowly. Now following all the engine light is turning on.",
        "vin": "5N1AT2MV5KC"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "01/30/2022",
        "dateOfIncident": "01/27/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449459,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The front collision warning and braking system engaged while driving 3+ times, most recently on the highway.  This could potentially cause an accident.  The dealership has tried to fix this issue but it continues to happen.  This is a safety issue for this car.",
        "vin": "5N1AT2MV9KC"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/06/2021",
        "dateOfIncident": "12/04/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442771,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Hi, i have a 2019 nissan rogue yesterday I was driving at 60mph and nothing in front of the car suddenly the aeb light flashed and engaged the breaks thank god that no one was behind me.",
        "vin": "KNMAT2MT9KP"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/06/2021",
        "dateOfIncident": "05/27/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442936,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Bought car in March 2021. In May 2021 and today Dec 6, 2021 two times the brakes automatically went on causing the car to brake in traffic and there was nothing in front of me for this to happen, nor where there any weather conditions to cause the automatic braking to happen. It is very scary. And very dangerous as there were cars behind me but no too close, but still a very dangerous thing. I want my money back for this vehicle I have paid for since March 2021 plus the 6000 I put down on the vehicle, or there better be a fix for this issue, as I am not about to lose my life or have an accident that could cause my death and others in the process. I have already notified a lawyer to take this case. When people buy vehicles, they expect a car that saves them, not harm them.",
        "vin": "5N1AT2MV7KC"
    },
    {
        "components": "SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "11/16/2021",
        "dateOfIncident": "11/13/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11440602,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I was involved in a car accident and a minor was in the backseat driver side his seatbelt and buckled during the accident and will no longer click. The seatbelt is broken",
        "vin": "5N1AT2MT4KC"
    },
    {
        "components": "ENGINE,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "11/11/2021",
        "dateOfIncident": "11/11/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440122,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "As I was bumper to bumper in traffic this morning going roughly 30-40 mph, my car stalled, rumbled, and all of my engine lights came on including engine malfunction.  I was unable to accelerate at all, but luckily I was still able to pull over on side road.  I restarted my car and now a couple lights remain, including engine malfunction.  This could’ve been a serious accident if I were going faster.",
        "vin": "5N1ET2MV0KC"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "11/05/2021",
        "dateOfIncident": "11/03/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439462,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Nissan Rogue. The contact stated that while reversing the vehicle, the back-up camera display was black. The dealer was made aware of the failure and scheduled an upcoming appointment for diagnosis. The manufacturer was made aware of the failure and the contact sent a video of the failure however, the manufacturer had not responded. Prior to the failure, the vehicle had been repaired under NHTSA Campaign Number: 19V654000 (Back Over Prevention) by the dealer. The failure mileage was approximately 24,000.",
        "vin": "jn8at2mt2kw"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/29/2021",
        "dateOfIncident": "10/20/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438599,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Engine shuts off while in drive and driving",
        "vin": "5n1at2mt9kc"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/22/2021",
        "dateOfIncident": "10/12/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11437850,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Driver front airbag did not deploy. Driver seat airbag deployed and exploded on the back of driver causing injury. Head to head collision in an intersection. Due to the accident I got major damage in the chest and internal organs. I informed the insurance company that this is a product liability issue. Insurance company declared that the car is totaled. I’m trying to find an attorney to address this issue for me.",
        "vin": "JN8AT2MT7KW"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "10/19/2021",
        "dateOfIncident": "10/18/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437320,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving to work on a congested highway during AM rush hour on 10/18/21, my 2019 Nissan Rogue's AEB engaged the car's brakes while I was driving between 25-30 mph. The nearest car in front of me was approximately 100 feet ahead and there was no reason for it. My foot was lightly on the accelerator and not near my brake when I felt the car lurch and the familiar rumbling of the ABS system. As I reached my foot to where the brake pedal is, I felt that it was already depressed having done so automatically. I immediately tapped the accelerator to release the braking system.  The car behind me had gotten rather close and was honking their horn. I have tried to reproduce the problem in the past 24 hours but have been unable to do so as it happened on its own. There were no warnings or symptoms prior to the incident.  The vehicle is scheduled to be checked by the manufacturer tomorrow. If this had occurred at a high rate of speed, or in adverse weather conditions, it could have caused a multi-car collision resulting in damage to property, injury, or even death.",
        "vin": "5N1AT2MV3KC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/19/2021",
        "dateOfIncident": "10/15/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437402,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "last Friday, Oct 15, 2021 driving by the freeway (no cars around), the sunroof just shatter, making a big hole in the glass, this could be a really bad situation if the cover were opened, thank God the hardcover was closed or we could get covered on glass and could cause a really bad accident. My family's safety was at risk of course. On Saturday morning, I called Clay Cooley Nissan (the dealer where I bought it) to let them know what happened, and they didn't care, they told me they can't help me and that I need to go to the insurance and hang up the phone on me, I called again and the guy was so rude and the same thing. We (my husband and I) look to a place where they can replace it and I put a complaint in the BBB about Clay Cooley Nissan and of course they called me on Monday morning but I just waist my time, they told me they will help and I went all the way to them and nothing. The problem has been confirmed by an independent service because the dealer (Clay Cooley Nissan didn't want to help me). There were no warnings at all about it.",
        "vin": "5N1AT2MT9KC"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": true,
        "dateComplaintFiled": "10/13/2021",
        "dateOfIncident": "10/04/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436543,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The BSW worked however the engineering of this particular BSW on this model is such that I feel it did not provide the queues in such a manner as to gain immediate visual/audible attention.  The BSW is positioned inside the vehicle to the left and right near the sideview mirrors but obscured enough in one's vision that it does not gain ready attention. The audible portion is not adjustable in volume and when on a busy interstate with navigation guiding you it is very difficult to hear.  I was in blind spot collision accident on 10/4/2021 in VA on 395S at 3:30pm EST. I looked, looked again and did not see the vehicle in my blind spot and I genuinely feel that the BSW in this vehicle is not sufficient to alert a driver in those conditions in a manner that garners the drivers immediate attention.  Having been placed in  rental vehicle that has the BSW warning embedded in the sideview mirror itself I find that to be a much more immediate attention grabber than Nissan's BSW construct in my vehicle such that I have purchased aftermarket BSW mirrors to place on my sideview mirrors to prevent /assist with this issue.",
        "vin": "5N1AT2MV2KC"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "10/02/2021",
        "dateOfIncident": "09/29/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435215,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2x in 2021 while driving the automated braking system activated, slowing my car suddenly and unexpectedly. Luckily no cars were behind me or there would have been accidents. Both times I was about 5 feet away from an overhead traffic light.  After June 2021 incident I brought the car to the dealer, who replaced the distance sensor.  This braking happened in September 2021, have not yet contacted the dealer This also occurred once in 2020 however I thought it was a fluke. This seems to be an ongoing and potentially not fixable issue. I am afraid to drive my Rogue.",
        "vin": "JN8AT2MV3KW"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "09/21/2021",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433917,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The first incident occurred in November 2019 with about 5,400 mile on the vehicle. On  a side street College Ave next close to intersection, I experienced a false Automatic Emergency braking and luckily none was right behind me but if they had been I could've definitely been injured.  I took the car in for repair and they reported that they fixed the problem using the solution to a 2017?18 recall.  It happened a second time in April or May  of 2021 on the freeway and I wondered if it was because of the reflective paint on the 15 south San Diego freeway after the onramp at University Ave.  Again, luckily no one was following close behind or I could've been injured but I did not take it in again until a week or so later when it happened a third time in the same place.  The automatic emergency braking system broke hard and I was very shook up, luckily again I avoided an accident but it was a very dangerous situation.  When I took the vehicle in they said the sensor was not working and they assured me they fixed it wouldn't happen again.  Last Tuesday, September 14, 2021, close to the same location of the second and third incident, again, with no cars or objects in front of me the emergency braking system slammed on the brakes in this 4th incident. I was again lucky no one hit me but I did fear for my safety and felt I ran the risk of dying if I drive the car again.  We called Nissan and they said this would qualify for the Lemon Law.  I called and the case number #44716633.  I believe Nissan still hasn't figured out their braking problems in existence since 2017.",
        "vin": "5N1AT2MT6KC"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "08/31/2021",
        "dateOfIncident": "08/31/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431213,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "When starting the car after it sat for 6 days, the brake pedal went to the floor.  Attempted to pump the pedal and still no pedal.  Warning lights came for Automatic Emergency Braking (AEB) System and Rear Automatic Braking (RAB) System.  Looked under the hood and found that there was no brake fluid.  Filled the container, pumped the brakes and still no pedal.  Looked under the hood again and the brake fluid was again empty.  No visible fluid on the ground.  Nissan Roadside Assistance was called and the vehicle will be towed to the dealership.  When the service department was contacted they informed that there has not been any other reports of this kind with regard to the 2019 Nissan Rogue, SV AWD.",
        "vin": "KNMAT2MV0KP"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/17/2021",
        "dateOfIncident": "08/17/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429398,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE LIGHT CAME ON , CHECKED CONDITION WITH READER.  ERROR CODE P0181 WAS DISPLAYED.   FUEL TEMP SENSOR IS A PROBLEM.",
        "vin": "5N1AT2MV9KC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/13/2021",
        "dateOfIncident": "07/20/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429011,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Nissan Rogue. The contact stated while driving 50 MPH, the vehicle inadvertently started shuddering. There were no warning lights illuminated. The contact veered to the side of the road. The contact stated that as she drove the vehicle, she noticed it would shudder whenever she exceeded 50 MPH. The vehicle was taken to the dealer who diagnosed that the sub frame of the front end of the vehicle was detaching from the frame and needed to be replaced. The manufacturer was not made aware of the failure. The vehicle was not repaired. The approximate failure mileage was 27,650.",
        "vin": "5N1AT2MT0KC"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "08/06/2021",
        "dateOfIncident": "06/24/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428019,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Nissan Rogue. The contact stated that while starting the vehicle, the Automatic Emergency Braking (AEB) System Warning Light was illuminated. The vehicle also would not drive forward or reverse at the initial start-up. After turning off and restarting the vehicle, the vehicle operated as designed. The vehicle was taken to the dealer and the dealer reset the AEB code and diagnosed that there was no failure. No repair was performed. The failure recurred. The manufacturer was not made aware of the failure. The failure mileage was 19,502.",
        "vin": "5N1AT2MT7KC"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "08/03/2021",
        "dateOfIncident": "07/20/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427553,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 7/20/21 @ shopping ctr opened door & seat was to floor & Dash not Displaying 'Brake' 'Start'. Sitting in seat took keys frm my pocket, held up near steering wheel & dash displayed start function. During this entire time I was pumping the brakes up & down to the floor. I started the Rogue & called Fuccillio. Yes I can bring it by. When I proceeded to put in gear 'R', the brakes seemed to hold enough. Backed up and felt brakes were normal. At Fuccillio due to time of day and too many customers ahead of me, aske to return on Wed. 7/21/21 at 10:30am. Left the car, waited for Lyft but none called so called friend for pickup at 11:30am. On Thursday at 4:20pm Joseph(Rep) called, he just had the Rogue react 20-mins ago. What did it do? He replied it 'jerked' him in the seat. Friday I went to Fuccillio to pick up a Loaner via Lyft. At this time still no idea what caused the 'Brakes to go to the Floor'. I was informed my Rear brakes were wearing & while there consider new brakes. I did agree since Rogue now has been on roads 4yrs. I purchased the Rogue as a CPO which was a Rental on 2018 for one year according to Carfax with 33K-miles. Joseph(Rep) then said the $120 he quoted to fix brakes & out the door he will cancel and apply $129 for Brake Fluid Change. I told him Fluid was changed at 38K-miles. He insisted he is just moving the one cost over to the fluid ignoring that fluid already done. I could only assume he was wanting money for the 2-days they had my Rogue & could not get it to fail again.  I agreed to brake service & told Rogue would be ready on Saturday 7/24/21. Did not receive call all day so called. They ordered wrong brakes and he had new brakes ordered for Rogues with the Push-Button Emer-Brake Button. Again Rogue ready Mon. 7/26/21. Monday & Tuesday came & went. Wednesday by 4pm drove to Fuccillio. Rogue parked out front. Joseph also did not even have Receipt with my request stating failing brakes. Had to print one up but wording not what I expected.",
        "vin": "5N1AT2MV1KC"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "08/03/2021",
        "dateOfIncident": "03/08/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427584,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving my 2019 Nissan Rogue on the freeway at 65 miles/hr in a clear and sunny day all of a sudden the front collision sensor came on and the car came to a sudden stop. There were no debris, objects on the road. I took the car to Nissan dealership and the technician recalibrated the sensors. Technician confirmed the issue was part of the \"soft\" recall and he reassured me the recalibration will prevent this from happening again. A few months later this happened again while driving on the freeway at 65miles/hr in a clear day. Front collision sensor came on and the car came to a sudden stop. Taking the car back to the dealership to have the sensors inspected again. This is very dangerous as I could have gotten into a serious and life threatening accident if there were other vehicles around me going at 65miles/hr.",
        "vin": "knmat2mtxkp"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/24/2021",
        "dateOfIncident": "07/22/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426264,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I was in a head on collision and the airbags did not deploy. Per the police officer and tow truck driver, both stated they should have deployed.",
        "vin": "KNMAT2MV8KP"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "07/08/2021",
        "dateOfIncident": "07/13/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423889,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2 months after buying the brand new car, I was driving with no one around and the car suddenly brakes on it’s own and shuddered.  The front crash warning light came on.  The car recovered and I took it to dealership.  They replaced the censor.  The censor continues to come on intermittently and I’ve taken it back three times.  They state it could be frost in the lens or a bug.  The last time it happened it was a 90 degree day with no one driving around me.   The radio also comes on without the car being on and frequently switches modes on itself.  It’s been to the dealership a total of 4 or 5 times over the same problem.  The censor has been changed 3 times and as of now the car is not producing any codes when the hook it up but the. Ensor light still comes on from time to time",
        "vin": "5n1at2mv6kc"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/09/2021",
        "dateOfIncident": "05/13/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420357,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD THE CAR FOR LESS THAN 2 YEARS AND THE FUEL TEMPERATURE SENSOR CAUSED MY CHECK ENGINE LIGHT TO COME ON RESEARCH SHOWS THAT PREVIOUS MODELS WERE RECALLED DUE TO A FAULTY FUEL PUMP WHICH IS THE WAY YOU REPALCE THAT SENSOR IVE OWNED CARS FOR MUCH LONGER AND NEVER NEEDED TO REPLACE THE FUEL PUMP ON THEM A BRAND NEW CAR OUTSIDE OF WARRANTY OF COURSE AND ALREADY NEEDING WORK DONE THAT COSTS SEVERAL HUNDRED DOLLARS CLOSE TO A GRAND - HANDS DOWN THE WORST VEHICLE IVE EVER OWNED ITS STOPPED IN THE MIDDLE OFTRAFFIC BEFORE BUT OF COURSE DEALERSHIP COULDNT REPLICATE THAT - THE RADIO COSNTANTLY UNSYNCS WITH DEVICES NEVER PLAYS RIGHT I HAVE TO TURN IT OFF AND TURN IT BACK ON ALL IN THE SAME TRIP JUST TO KEEP PLAYING MUSIC EVERYTHING FROM THE PURHCASE OF THE VEHICLE TO OWNING IT HAS BEENA NIGHTMARE AND APPARENTLY A COSTLY ONE AT THAT",
        "vin": "5N1AT2MT3KC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/01/2021",
        "dateOfIncident": "05/30/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419141,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The high Beam Assist feature of vehicle is malfunctioned and yes it's available for inspection upon request. If the vehicle speed is above 40mph the high beam is turning off and setting the low beam by default even if there are no vehicles insight. In the night the vehicle will be always in low beam mode and hence affects the visibility in the night putting in high risk. No, the problem hasn't been confirmed or reproduced by the dealer.   No, the vehicle or component hasn't been inspected by the manufacturer, police, insurance representatives or others. No warning lamps.",
        "vin": "KNMAT2MT8KP"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "05/27/2021",
        "dateOfIncident": "05/20/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418773,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Nissan Rogue. The contact stated that the forward collision avoidance sensor would active independently while driving at various speeds. During the malfunction, the forward collision avoidance warning light was illuminated. The contact had taken the vehicle to an independent mechanic where she had the fault code was cleared from the system. The contact called a dealer and was informed that the vehicle might have collided with an object for the sensor to illuminate. The contact insisted that the vehicle had not struck an object. The manufacturer was not notified of the failure. The vehicle was not repaired. The failure mileage was approximately 4,000",
        "vin": "5N1AT2MV6KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/21/2021",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418057,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Nissan Rogue. The contact stated that while his wife was driving approximately 30 mph, the Collision Avoidance System erroneously activated causing the vehicle to abruptly stop in the middle of the roadway. During the failure, a second motorist nearly crashed into the rear of the vehicle. The vehicle was taken to the local dealer who serviced the vehicle. No additional information was available. The manufacturer was notified of the failure. The vin was not available. The failure mileage was 10,000.",
        "vin": ""
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "04/23/2021",
        "dateOfIncident": "04/23/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413601,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING IN REGULAR TRAFFIC (35-35) MILES PER HOUR WHEN THE CAR SUDDENLY FLASHED EMERGENCY BRAKE WARNINGS AND SLAMMED TO A GRINDING HALT IN THE MIDDLE OF TRAFFIC. I THOUGHT I HAD BLOWN A TIRE OR HIT SOMETHING, SO I PULLED OFF THE ROAD TO CHECK AND SEE WHAT WAS HAPPENING. NO ONE WAS AROUND ME IN FRONT OR BEHIND. I HAD ENOUGH TIME TO GET OUT OF MY VEHICLE AFTER PULLING OFF INTO THE MEDIAN AND CIRCLE AROUND THE VEHICLE BEFORE ANY CARS PASSED. APPARENTLY, THERE IS A CLASS ACTION LAWSUIT GOING FOR THE 2017 AND 2018 MODEL ROGUE FOR THIS AEB ISSUE. IT IS STILL HAPPENING ON THE 2019 AS WELL. I HAD ANOTHER WARNING ABOUT 30 MINUTES LATER BUT IT DID NOT STOP ME THAT TIME. IT JUST THREW UP THE WARNINGS AND BEEPS.",
        "vin": "JN8AT2MT1KW"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "04/15/2021",
        "dateOfIncident": "03/31/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408311,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS THE FIRST CAR AT A RED LIGHT, WHEN I STARTED DRIVING, THE AUTOMATIC BRAKING SYSTEM WAS ACTIVATED WITH ABSOLUTELY NOTHING IN FRONT OF ME.  THANK GOODNESS THE CAR BEHIND ME WAS PAYING ATTENTION AND WAS ABLE TO AVOID HITTING MY NISSAN ROGUE.  I TOOK IT TO THE DEALERSHIP AND MADE A COMPLIANT THROUGH NISSAN.  THE DEALERSHIP AND NISSAN TECHNICIAN STATED THAT THERE IS NOTHING THEY CAN DO, AS THEY CANNOT REPLICATE THE ISSUE.  IN ADDITION TO THE AEB SYSTEM ISSUE, A WEEK LATER, I WAS PULLING OUT OF A FAST FOOD RESTAURANT AND WHEN I TOOK MY FOOT OFF THE BRAKE, THE CAR LOCKED UP, THE ENGINE LIGHT CAME ON, AND THE CAR TURNED OFF FOR NO REASON.  AGAIN, THE DEALERSHIP AND NISSAN TECHNICIAN STATED THAT IT COULD NOT BE REPLICATED.  THIS IS A VERY DANGEROUS ISSUE AND I NO LONGER FEEL COMFORTABLE DRIVING THE SUV I LOVED.",
        "vin": "KNMAT2MT9KP"
    },
    {
        "components": "UNKNOWN OR OTHER,BACK OVER PREVENTION,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "04/14/2021",
        "dateOfIncident": "04/14/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408029,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS NISSAN ROGUE, IT'S LOADED WITH SENSORS, MALFUNCTION MANY TIMES WITHOUT WARNING, IT HAD LOCKED THE BRAKES BY ITSELF IN DIFFERENT TIMES DAY AND NIGHT, ALSO PICK UP SPEED CAMERAS AS WARNING ALTHOUGH THIS WAS FIXED, WHILE LASTED WAS VERY ANNOYING",
        "vin": "JN8AT2MV7KW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/12/2021",
        "dateOfIncident": "04/04/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 4,
        "odiNumber": 11407729,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TAILGATE AFTER BEING OPENED BY THE USING THE BUTTON ON THE DASH, THE KEY FOB, OR PUSHING THE BUTTON ON THE TAILGATE ITSELF WILL SUDDENLY SHUT. THE BUTTON WAS NOT PUSHED TWICE.  THE CAR WILL GIVE A BEEPING WARNING THAT THE TAILGATE IS SHUTTING. HOWEVER, SINCE THE HUMAN IS NOT EXPECTING THE TAILGATE TO SHUT, HE OR SHE HAS BEEN HIT IN HEAD SEVERAL TIMES. THE CAR IS STATIONARY, IN PARK.",
        "vin": "5N1AT2MT6KC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/29/2021",
        "dateOfIncident": "03/29/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405435,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VOLUME CHANGES ERRATICALLY SOMETIMES WHILE LISTENING TO MUSIC/RADIO. THIS IS A VERY HIGH RISE IN VOLUME WHICH CAN AFFECT DRIVING. ALSO, THERE IS AN ANDROID AUTO ISSUE WITH NISSAN AND THEY HAVE RELEASED A FIX FOR THE SAME FOR OTHER MODELS (NTB20-046). DURING THIS ISSUE EVEN IF THE VEHICLE IS STATIONARY OR IN MOTION, THE SONGS SKIP SOME SECONDS OF CONTENT AND CHANGE VOLUME.",
        "vin": "KNMAT2MV8KP"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/29/2021",
        "dateOfIncident": "03/29/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405471,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RADIO RESET ITSELF YESTERDAY WHILE DRIVING. TODAY, THE SCREEN WENT COMPLETELY BLANK AFTER I SHUT IT OFF AND WENT INTO A STORE FOR 2 HOURS. NOTHING DISPLAYED, NOT EVEN THE BACKUP CAMERA WHEN OUT IN REVERSE.",
        "vin": "KNMAT2MT5KP"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/18/2021",
        "dateOfIncident": "03/15/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403751,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN ROGUE. THE CONTACT STATED THAT WHILE DRIVING 55 MPH, THE VEHICLE INDEPENDENTLY CAME TO AN ABRUPT STOP WITHOUT WARNING AND WITHOUT INCIDENT. DUE TO THE FAILURE, THE CONTACT IMMEDIATELY CALLED MILLER NISSAN (2930 2ND ST S, ST CLOUD, MN 56301) WHERE THE CONTACT WAS INSTRUCTED TO TURN OFF THE EMERGENCY BRAKING SYSTEM AND TO DRIVE THE VEHICLE TO THE DEALER. THE DEALER WAS UNABLE TO DUPLICATE THE FAILURE. THE MECHANIC RECALIBRATED THE SENSORS AS A PRECAUTION. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE CONTACT WAS INFORMED THAT THE VIN WAS NOT UNDER RECALL. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 41,000.",
        "vin": "KNMAT2MTXKP"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/10/2021",
        "dateOfIncident": "12/15/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400192,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY EMERGENCY AUTOMATIC BRAKING SYSTEM LIGHT KEEPS FLASHING AND THERE ARE NO OTHER VEHICLES AROUND ME. CONTINUES TO FLASH EVERY FEW DAYS, WITHOUT ANY TYPE OF OBJECT AROUND ME.",
        "vin": "5N1AT2MV1KC"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/08/2021",
        "dateOfIncident": "03/06/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399842,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019  ROUGE BREAKS FOR NO WHEN NO ONE IS AROUND. DEALER SAYS THEY CAN'T FIND ANYTHING WRONG THIS SEEMS VERY SIMILAR TO THE ISSUE REPORTED ON 2017 AND 2018 MODELS.",
        "vin": "5N1AT2MV7KC"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/10/2021",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395604,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN ROGUE. THE CONTACT STATED THAT WHILE DRIVING 65 MPH, THE FORWARD COLLISION WARNING LIGHT ILLUMINATED AND THE VEHICLE STOPPED ABRUPTLY. AFTER EXPERIENCING THE FAILURE, THE VEHICLE RESUMED NORMAL OPERATION. PRIOR TO THE FAILURE, THE CONTACT STATED THAT THE FORWARD COLLISION WARNING LIGHT INTERMITTENTLY FLASHED ON THE INSTRUMENT PANEL WHILE THE VEHICLE WAS STATIONERY. NEITHER THE DEALER NOR THE MANUFACTURER WERE NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 30,000.",
        "vin": "JN8AT2MT1KW"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/06/2021",
        "dateOfIncident": "01/19/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394951,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN PURCHASED 2019 NISSAN ROGUE, THE AEB WARNING LIGHT CAME ON. DEALER SAID THAT CAR FRESHLY WAXED & COVERED SENSOR. IT WILL AWAY SHORTLY.  SEVERAL DAYS LATER, PROBLEM EXISTED. BROUGHT VEHICLE BACK TO DEALER. SERVICE TECH STATED THAT SOFTWARE WAS OUT OF DATE & UPDATED SOFTWARE.  2 DAYS LATER, AEB WARNING LIGHT CAME BACK ON, AND NOW VEHICLE SUDDENLY BRAKED SLIGHTLY ON IT'S OWN WHILE DRIVING WITHOUT ANY OBSTRUCTION OR INTERFERENCE IN THE CAR'S PATH. AFTER GOOGLING THIS CONDITION, I BECAME AWARE OF NISSAN'S ONGOING PROBLEM WITH THIS MAKE/MODEL. DEALERSHIP NEVER MADE ME AWARE OF ANY PROBLEMS.  NOW ATTEMPTING TO MAKE A FOLLOW-UP APPOINTMENT WITH DEALERSHIP & THEY LEAVE ME ON HOLD & WON'T HELP.",
        "vin": "JN8AT2MV7KW"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "01/27/2021",
        "dateOfIncident": "01/27/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390234,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR LEFT RUNNING (NOT TURNED OFF) WITH TRANSMISSION SET TO PARK BEGAN ROLLING UNTIL HITTING A BUSH. I SEE THAT THERE WAS A SIMILAR PROBLEM WITH 2015 MODELS.*DT*DT*DT",
        "vin": "KNMAT2MT1KP"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/21/2021",
        "dateOfIncident": "11/11/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389288,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING THE VEHICLE LACKS SPEED, JERKS AND DOESN'T HAVE GOOD PICK UP. YOU CAN BE IN MOTION AND IT JERKS, THE TRANSMISSION MAY BE BAD.",
        "vin": "5N1AT2MT9KC"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "01/17/2021",
        "dateOfIncident": "01/14/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388612,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AEB SENSOR HAS BEEN CHANGED, HOWEVER WARNING LIGHT CONTINUES TO FLASH WHEN THERE ARE NO CARS IN FRONT OF VEHICLE. 2017 & 2018 ROGUES HAVE BEEN RECALLED FOR THIS SAME ISSUE. LUCKILY MY CAR HAS NOT BRAKED SUDDENLY YET. I AM CALLING MY NISSAN DEALER AGAIN TO GET IT SERVICED, NOT COMFORTABLE IT WILL FIX THE ISSUE BUT AT LEAST I'LL HAVE A HISTORY OS TRYING TO GET IT REPAIRED.",
        "vin": "5N1AT2MT5KC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/13/2021",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388038,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 NISSAN ROUGE. CONSUMER WRITES IN REGARDS TO REAR VISIBILITY SYSTEM SAFETY RECALL. *LD    THE CONSUMER STATED THE VEHICLE EXPERIENCED ISSUES WITH THE ROAD WARNING SYSTEM. THE SYSTEM WARN OF UNPAVED ROAD EVEN WHEN THE ROAD IS PAVED. THE SYSTEM DOES NOT ALERT WHEN A ROAD IS ACTUALLY UNPAVED. THE PROPILOT AND LANE ASSIST WARNING FUNCTION INTERMITTENTLY. THE RADIO INCREASED IT'S VOLUME RANDOMLY. THE MANUFACTURER WAS NOTIFIED AND DID NOT OFFER ANY ASSISTANCE. *JS",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/10/2021",
        "dateOfIncident": "01/04/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387421,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I PLACE MY FOOT ON THE BRAKES IT RUBS. IT RUBS WHEN YOU DON'T PLACE YOU FOOT ON THE BRAKES. IT WAS REPAIRED IN GILLIAM IN FORT BEND COUNTY. I PLACE IT IN REVERSE IT AUTOMATICALLY RUBS THE ROTATOR.",
        "vin": "JN8AT2MTXKW"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/28/2020",
        "dateOfIncident": "12/18/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385270,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING WITH NO CARS IN FRONT OF MY VEHICLE, THE AUTOMATIC EMERGENCY BRAKING LIGHT ILLUMINATED AND THEN THE CAR AUTOMATICALLY APPLIED THE BRAKES.  THIS HAS HAPPENED SEVERAL TIMES.  THIS SEEMS TO BE AN ISSUE WHEN IT COLDER OUT (BELOW 40 DEGREES).  THIS ISSUE HAS OCCURRED WHEN THE VEHICLE WAS TRAVELING DOWN A RURAL ROAD, SPEED LIMIT 40 AS WELL AS A CITY STREET.",
        "vin": "JN8AT2MV0KW"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/28/2020",
        "dateOfIncident": "11/02/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385273,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "SHOCKS AND STRUTS SOUND AS IF THEY ARE COMING LOOSE AND WHEN BRAKING A LOAD METAL CLANKING SOUND CAN BE HEARD. IT STARTED EARLY NOVEMBER 2020 AND OCCURS ON A DAILY BASIS.",
        "vin": "JN8AT2MT2KW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/06/2020",
        "dateOfIncident": "11/15/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378146,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT DRIVER DOOR DOES NOT LOCK/UNLOCK WITHBUTTON ON REMOTE OR DOOR HANDLE OR INSIDE LOCK/UNLOCK BUTTON. HAS TO MANUALLY LOCK FROM INSIDE. FOR A WEEKS I WAS NOT AWARE THAT MY VEHICLE FRONT DRIVER DOOR WAS UNLOCK SINCE WITH REMOTE IT MAKES LOCK BEEP NOISE. DEALER SAYS IT WILL COST MORE THAN 100 DOLLAR TO JUST FIND PROBLEM. ITS JUST TWO YEAR OLD VEHICLE WITH 38000 MILES(JUST 2000 MORE MILES OVER WARRANTY). LOCAL MECHANIC SAYS ITS DOOR LOCK ACTUATOR THAT SHOULD NOT GO BAD WITHIN TWO YEAR, MUST BE FAULTY PART.",
        "vin": "KNMAT2MT3KP"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "12/04/2020",
        "dateOfIncident": "02/13/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377844,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SEAT MOVE BACK AND FORTH WHEN BRAKING AND ACCELERATING. I CAN ACTUALLY HOLD THE SEAT AND MOVE IT BACK AND FORTH. IT WOULD MOVE ABOUT 1/2'. IT STARING TO CAUSE UNCOMFORTABLE RIDES AND MOST OF ALL HORRIBLE BACK PAIN. MY DOCTOR TOLD ME THAT'S WHAT CAUSE THE PAIN AND AM ABOUT TO SEE MY LAWYER. IMAGINE DRIVING AND YOUR SPINE IS MOVING AND SHAKING BACK AND FORTH. THERE SHOULD BE A RECALL ON THIS PROBLEM. I HAVE READ OTHER ARTICLES AND THEY HAVE THE SAME PROBLEMS. IT'S A SHAME ON NISSAN. I WILL NEVER BUY ANOTHER AND HOPE WILL MILLIONS OF YOU.",
        "vin": "5N1AT2MV7KC"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/04/2020",
        "dateOfIncident": "12/03/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377847,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ANTI-COLLISION WARNING LIGHT PERIODICALLY ACTIVATES WHEN VEHICLE IS IN MOTION, BUT NO COLLISION IS IMMINENT.  OCCURS AT LOW SPEED AS WELL AS AT HIGHWAY SPEED.  SO FAR, WARNING SIGNAL CONTINUES FLASHING, BUT BRAKES HAVE NOT BEEN ACTIVATED.  NOTING OCCURRENCE 12/3/2020, BUT THIS HAS HAPPENED PERIODICALLY SINCE OCTOBER, 2020.",
        "vin": "JN8AT2MV1KW"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/03/2020",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377789,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN ROGUE. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 75 MPH, THE AUTOMATIC EMERGENCY BRAKING SYSTEM ERRONEOUSLY ACTIVATED CAUSING THE VEHICLE TO ABRUPTLY STOP. DURING THE FAILURE, THERE WERE NO OTHER VEHICLES OR OBJECTS NEARBY TO CAUSE THE EMERGENCY BRAKING SYSTEM TO BE ACTIVATED. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER ORR NISSAN LOCATED AT 3131 E. BEEBE CAPPS EXPY, SEARCY, AR 72143, WHO WAS UNABLE TO DUPLICATE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 30,000.",
        "vin": "5N1AT2MT9KC"
    },
    {
        "components": "ELECTRICAL SYSTEM,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/02/2020",
        "dateOfIncident": "08/04/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377462,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FORWARD COLLISION LIGHT ILLUMINATES WHEN THERE IS NO OTHER VEHICLE IN SIGHT HAS DONE THIS NUMEROUS TIMES WHILE DRIVING.",
        "vin": "5N1AT2MV1KC"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/02/2020",
        "dateOfIncident": "11/25/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377464,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE MAKING CLICKING SOUNDS WHEN TURNING THE STEERING WHEEL  TOOK IT TO THE NISSAN DEALER THEY STATED WAS THE UPPER STRUT BUSHINGS  AND BEARINGS NEEDED REPLACEMENT OF COURSE THIS CAR IS OUT OF WARRANTY AND NOT COVERED UNDER THE PRE OWNED WARRANTY,  THIS CAR IS TOO NEW FOR THESE KIND OF ISSUES OF COURSE THEY WANT TO CHARGE ME $1100..00 TO FIX IT, HATE I EVEN BOUGHT THIS CAR...",
        "vin": "5N1AT2MV1KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/30/2020",
        "dateOfIncident": "10/17/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376614,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 NISSAN ROGUE SPORT. CONSUMER STATED THAT AUTOMATIC EMERGENCY BRAKE ENGAGED SUDDENLY WITHOUT WARNING. *LD *JS",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "11/30/2020",
        "dateOfIncident": "11/17/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11377090,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT'S DAUGHTER OWNS A 2019 NISSAN ROGUE. THE CONTACT STATED THAT WHILE HIS DAUGHTER WAS DRIVING AT APPROXIMATELY 35 MPH, THE VEHICLE INDEPENDENTLY VEERED OFF TO THE RIGHT WITHOUT WARNING. DUE TO THE FAILURE, SHE HIT TWO VEHICLES THAT WERE PARKED ON THE SIDE OF THE ROAD. THE AIR BAGS DID NOT DEPLOY UPON IMPACT. THE AUTHORITIES WERE CALLED TO THE SCENE AND A POLICE REPORT WAS FILED.THE CONTACT'S GRANDSON HAD HIT HIS HEAD ON THE WINDSHIELD AND INITIALLY DECLINED MEDICAL ATTENTION; HOWEVER, THE NEXT DAY HE WAS TAKEN A HOSPITAL AND DIAGNOSED WITH A SLIGHT CONCUSSION. DESPITE THE ACCIDENT, THE VEHICLE WAS ABLE TO BE DRIVEN BACK TO THE DAUGHTER'S HOME.  HER INSURANCE THEN TOWED THE VEHICLE TO AN INDEPENDENT MECHANIC WHERE THE VEHICLE WAS DEEMED UNREPAIRABLE AND WAS DESTROYED. THE DEALER NOR THE MANUFACTURER HAD YET TO BE NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 50,000. *DT   THE CONSUMER PROVIDED PHOTOS. *TR",
        "vin": "KNMAT2MT8KP"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/30/2020",
        "dateOfIncident": "10/15/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377152,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN ROGUE. THE CONTACT STATED WHILE HER GRANDDAUGHTER WAS DRIVING APPROXIMATELY 72 MPH, THE VEHICLE SHUT-OFF WITHOUT WARNING. AFTER RESTARTING THE VEHICLE, THE VEHICLE TEMPORARILY OPERATED AS DESIGNED HOWEVER, THE FAILURE RECURRED. THE CONTACT INDICATED THAT THE VEHICLE INADVERTENTLY SHUT-OFF FIVE TIMES WITH IN 90 MINUTES OF DRIVING. THE VEHICLE WAS TAKEN TO CROWN NISSAN LOCATED AT 165 W, PERSHING RD, DECATUR, IL 62526, HOWEVER, THE MECHANIC WAS UNABLE TO DUPLICATE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE, BUT NO ASSISTANCE WAS OFFERED. THE FAILURE MILEAGE WAS 8,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "11/27/2020",
        "dateOfIncident": "11/27/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376733,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AT I-80 WESTBOUND FROM COUNCIL BLUFFS TO OMAHA. JUST AFTER ENTERING IN OMAHA MY NISSAN ROGUE SL SUDDENLY SLOWED DOWN ITS SPEED FROM 65MILES TO 40 MILES FOR NO OBVIOUS REASON. I HAD MY PRO PILOT ASSIST FUNCTION ON AT IT SEEMS THAT THE CAR DECIDED FOR NO REASON TO DECREASE THE SPEED AS THERE WAS NO VEHICLE IN THE FRONT OF THE CAR THAT I COULD HAVE SEEN IN MY LANE. I WAS WORRIED AND GOT PANICKED AS THERE WAS A SEMI TRUCK BEHIND ME. I IMMEDIATELY TURNED OFF THE PRO PILOT ASSIST FUNCTION AND ACCELERATED TO AVOID A REAR END COLLISION FROM THE SEMI. MY FAMILY A 1 YEAR OLD DAUGHTER AND WIFE WERE IN THE SUV WITH ME. I THINK WE COULD HAVE GOT KILLED BY THIS MALFUNCTION OF NISSAN ROGUE. PLEASE DO THE NEEDFUL TO HAVE NISSAN CHECK IT AND TO MAKE SURE IF THIS VEHICLE IS SAFE TO DRIVE.",
        "vin": "5N1AT2MV1KC"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "11/23/2020",
        "dateOfIncident": "11/23/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375932,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "COLLISION LIGHTS CAME ON. NO CARS AROUND. AUTO BRAKING WHEN NOT NEEDED IS VERY DANGEROUS. CHECK BBB, OTHER NISSAN FORUMS. CARS TAKEN TO DEALER WITHOUT RESULTS. THIS SHOULD BE CHECKED AND RECALLED BEFORE SERIOUS INJURY OR DEATH OCCURS. THIS ISSUE SEEMS TO BE TAKEN LIGHTLY WHEN IT SHOULDN'T. VEHICLE IN MOTION ON 4 LANES, SPEED 55 WITH CRUISE SET.",
        "vin": "5N1AT2MV1KC"
    },
    {
        "components": "ENGINE,FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "11/23/2020",
        "dateOfIncident": "07/07/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11375988,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT WAS A LAWYER CALLING ON BEHALF OF HIS CLIENT WHO OWNED A 2019 NISSAN ROGUE. THE CONTACT STATED THAT WHILE HIS CLIENT WAS DRIVING AT 40 MPH,A TRACTOR TRAILER PULLED OUT INTO ONCOMING TRAFFIC AND COLLIDED WITH THE CLIENT'S VEHICLE. THE AIR BAGS DID DEPLOY UPON IMPACT. THE CONTACT STATED THAT THE AUTOMATIC EMERGENCY BRAKING AND THE FORWARD COLLISION WARNING SYSTEMS FAILED TO OPERATE AS NEEDED. EMERGENCY AID ARRIVED AT THE SCENE WHERE BOTH THE DRIVER AND THE PASSENGER WERE TAKEN TO THE HOSPITAL VIA AN AMBULANCE. THE DRIVER SUSTAINED SEVERAL ABDOMINAL INJURIES WHICH INCLUDED SEVERAL CUTS AND BRUISES. THE PASSENGER IN THE VEHICLE WAS RENDERED A PARAPLEGIC DUE TO HER INJURIES. SHE WAS PARALYZED FROM THE WAIST DOWN AND HAS MINIMAL FUNCTIONALITY ABOVE THE WAIST. THE DRIVER OF THE TRAILER SUSTAINED NO INJURIES. A POLICE REPORT WAS FILED AT THE SCENE. THE VEHICLE WAS TOTALED AT THE SCENE AND WAS TOWED TO AN INDEPENDENT MECHANIC. THE CONTACT WAS UNCERTAIN IF THE DEALER OR THE MANUFACTURER WAS EVER NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 2,541.",
        "vin": "5N1AT2MVXKC"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "11/17/2020",
        "dateOfIncident": "11/05/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375102,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "OVER A COURSE OF THREE MONTHS THE AEB LIGHT WILL ACTIVATE ON MY DASH RANDOMLY. IT'LL FLASH THAN DISAPPEAR. AS I WAS GOING UNDER A BRIDGE AT A SPEED OF 40MPH MY CAR RANDOMLY BEGAN SLOWING DOWN WITHOUT ME APPLYING THE BRAKES WHILE UNDER A BRIDGE WITH TRAFFIC BEHIND ME. AT FIRST I DIDN'T THINK ANYTHING OF THE LIGHT BECAUSE THE FIRST TIME IT CAME ON NOTHING HAPPENED. IT JUST FLASHED AND WENT AWAY. THERE HAVE BEEN 3 OTHER OCCASIONS WHERE MY VEHICLE WON'T COME TO A COMPLETE, ABRUPT STOP BUT MY VEHICLE WILL REDUCE SPEED SIGNIFICANTLY AUTOMATICALLY WITHOUT ME APPLYING THE BRAKES.",
        "vin": "5N1AT2MV0KC"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "11/10/2020",
        "dateOfIncident": "10/21/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374035,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN ROGUE.  THE CONTACT STATED WHILE HIS WIFE WAS DRIVING 20 MPH APPROACHING A RAIL ROAD TRACK, THE BRAKES LOCKED UP. THE FORWARD COLLISION AVOIDANCE WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO BOCH NISSAN SOUTH (685 S WASHINGTON ST, NORTH ATTLEBOROUGH, MA 02760, (866) 663-0067) AND DIAGNOSED WITH A FAULTY RADIO SENSOR IN THE BUMPER. THE VEHICLE WAS REPAIRED HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 23,235.",
        "vin": "5N1AT2MV0KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/26/2020",
        "dateOfIncident": "10/26/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11366567,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE EMERGENCY BREAKING SYSTEM BREAKS WHEN I'M DRIVING WITH NO OBSTACLES IN THE WAY. IT'S HAPPENED 4 TIMES. I HAVE TAKEN THE CAR IN FOR THE UPDATE AND IT IS STILL HAPPENING. I'M SCARED DIE MY LIFE. THIS IS VERY DANGEROUS. I WAS ALMOST THROWN THROUGH THE FRONT OF THE CAR. I WAS DRIVING 40 MILES PER HOUR THE FIRST TIME AND I'M AFRAID OF THIS HAPPENING ON THE FREEWAY. EVERY TIME THIS HAS HAPPENED I HAVE BEEN MOVING. TODAY WAS THE FOURTH TIME THIS HAPPENED AND SECOND TIME SINCE THE UPDATE THAT WAS DONE A MONTH AGO.",
        "vin": "5N1AT2MV3KC"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "10/20/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365314,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN ROGUE. THE CONTACT STATED THAT THE EMERGENCY BRAKING SYSTEM ACTIVATED INDEPENDENTLY WHILE DRIVING AND PULLING OUT OF HIS DRIVEWAY. THE DEALER WALLACE NISSAN OF KINGSPORT (2733 E STONE DR, KINGSPORT, TN 37660, (423) 288-5500) INFORMED THE CONTACT THAT THE VEHICLE NEEDED TO BE DIAGNOSED TO KNOW THE CAUSE OF THE FAILURE. THE CONTACT STATED THAT THE FORWARD COLLISION AVOIDANCE CAMERA MAY HAVE DETECTED SOMETHING IN THE DRIVEWAY AND ACTIVATED THE AUTOMATIC EMERGENCY BRAKES. THE MANUFACTURER HAD NOT BEEN CONTACTED. THE FAILURE MILEAGE WAS 10,000.",
        "vin": "JN8AT2MV0KW"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/19/2020",
        "dateOfIncident": "10/19/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11365252,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VOLUME CHANGES ERRATICALLY SOMETIMES WHILE LISTENING TO MUSIC/RADIO. THIS IS A VERY HIGH RISE IN VOLUME WHICH CAN AFFECT DRIVING. ALSO, THERE IS AN ANDROID AUTO ISSUE WITH NISSAN AND THEY HAVE RELEASED A FIX FOR THE SAME FOR OTHER MODELS (NTB20-046). DURING THIS ISSUE EVEN IF THE VEHICLE IS STATIONARY OR IN MOTION, THE SONGS SKIP SOME SECONDS OF CONTENT AND CHANGE VOLUME.",
        "vin": "5N1AT2MT5KC"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "10/15/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364461,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CLOCK SUDDENLY STARTED RESETTING EVERY TIME I TURN ON ENGINE. CANNOT MANUALLY SET TIME AND KEEP IT.   DRIVER'S SEAT DOES NOT CLICK SECURELY IN PLACE.  MOVES BACK AND FORTH WITH MOVEMENT IN SEAT.",
        "vin": "5N1AT2MT8KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/10/2020",
        "dateOfIncident": "10/09/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363679,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING TO WORK YESTERDAY 10/9/2020 ON THE HIGHWAY MY CAR STARTED BEEPING AND SLAMMED ON THE BRAKES FOR NO REASON.  THERE WAS NOTHING IN FRONT OF ME AND THANKFULLY NO CAR TOO CLOSE BEHIND ME. IT WAS A CLEAR DAY. NOTHING ON THE ROAD, NO REASON AND NO SNOW. JUST A HIGHWAY.",
        "vin": "5N1AT2MV8KC"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "10/07/2020",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363270,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPLAINED ABOUT THE DRIVERS SEAT MOVING DURING ACCELRATION AND BRAKING MAKES A CLICKING NOISE BEEN TO THE DEALERSHIP THREE TIMES CHANGED THE BACK OF SEAT, SEAT AND MOTOR  (ALL NEW) STILL HAVE THE ON GOING PROBLEM.",
        "vin": "5N1AT2MV0KC"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "10/05/2020",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362815,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN ROGUE. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE AUTOMATIC EMERGENCY BRAKING ACTIVATED WITHOUT ANOTHER VEHICLE IN NEAR PROXIMITY. THE BRAKE WARNING LIGHT WAS ILLUMINATED. THE VEHICLE FAILED TO RE-START. THE CONTACT WAS UNABLE TO START THE VEHICLE UNTIL THE BATTERY WAS JUMPED. ADDITIONALLY, THE KEY WAS NOT RECOGNIZED ON SEVERAL OCCASIONS. THE CONTACT TOOK THE VEHICLE TO KOEPPEL NISSAN (74-15 NORTHERN BLVD, QUEENS, NY 11372, (917) 382-5226) AND THE VEHICLE WAS REPAIRED UNDER NHTSA CAMPAIGN NUMBER: 19V654000 (BACK OVER PREVENTION) HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 300.",
        "vin": "KNMAT2MV8KP"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/04/2020",
        "dateOfIncident": "10/03/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362679,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2019 NISSAN ROGUE WITH 9,147 MILES BOUGHT IT APRIL OF 2019. I AM EXPERIENCING BRAKE ISSUES AND ELECTRICAL ISSUES. I WAS DRIVING ON THE HIGHWAY FEW WEEKS AGO AND NO CARS NEXT TO ME, THE BRAKES AUTOMATICALLY CAME ON.ANOTHER ISSUE IS WHEN I AM REVERSING AND THE AUTOMATIC BRAKES COME ON.NEXT ISSUE I HAVE I WAS DRIVING COMING HOME, WHEN I REACHED INFRONT OF MY HOUSE I DOUBLE PARKED AND SHUT THE THE CAR OFF, WHEN I TRIED STARTING IT BACK THE CAR WAS NOT STARTING. COMPLETELY DIED ON ME AND THE LIGHT SHOWING NO KEY DETECTED. NOW I JUMPED THE CAR THE NEXT DAY AND IT STARTED.",
        "vin": "KNMAT2MV8KP"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/03/2020",
        "dateOfIncident": "10/03/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362545,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE 3RD TIME, THE EMERGENCY BRAKES, WHILE DRIVING ON AN AVERAGE SPEED ON A LOCAL ROAD,  MY NISSAN ROGUE ACTIVATED WHICH EVEN UNNECESSARY. NO VEHICLES CLOSE TO MY CAR, NOR DEBRIS",
        "vin": "5N1AT2MT3KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/14/2020",
        "dateOfIncident": "09/12/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354826,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST A FEW DAYS AGO WE WERE IN MOTION WITH NO TRAFFIC AROUND ON KY-933 AND THE FEB WARNING LIGHT CAME ON FOR NO REASON AT ALL.  NOTHING HAPPENED, BUT DON'T KNOW WHY THE LIGHT CAME ON.  JUST NERVOUS IT WILL APPLY THE BRAKES FOR NO REASON WHILE DRIVING IN TRAFFIC.  AS FAR AS I KNOW THIS IS THE FIRST OCCURRENCE OF THIS HAPPENING.",
        "vin": "5N1AT2MV7KC"
    },
    {
        "components": "SUSPENSION,SEATS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/03/2020",
        "dateOfIncident": "08/14/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353089,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 NISSAN ROGUE SL SEATS MOVE WHEN STOPPING THE VEHICLE OR ACCELERATING.  TOOK TO NISSAN CANNOT DUPLICATE THE PROBLEM BUT EVERY PASSENGER THAT RIDES IN MY CAR FEELS THE SEAT MOVE AND MAKE NOISE.  SUNROOF MAKES A CREAKING NOISE NISSAN WON'T FIX SAYS CAN'T DUPLICATE THE PROBLEM.  WHEN CAR IS ON UNEVEN GROUND BACK END MAKES A CREAKING NOISE.  AGAIN NISSAN SAID CANT DUPLICATE THE PROBLEM. BUT WHOEVER I TAKE IN MY CAR ASKED ME WHAT IS THAT NOISE?   THIS CAR IS A PIECE OF CRAP!",
        "vin": "5N1AT2MV2KC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/17/2020",
        "dateOfIncident": "02/19/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349788,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "HART NISSAN, IN MECHANICSVILLE, VA, HAS REPLACED MY REAR-VIEW CAMERA AND SENSORS AS MY FORWARD EMERGENCY BRAKING LIGHT WAS COMING ON (WHILE DRIVING)AND MY REAR-VIEW CAMERA WAS FREEZING WHILE BACKING.  THESE PROBLEMS ARE STILL OCCURRING AND ARE MAJOR SAFETY ISSUES.  MY CAR WAS IN THE SHOP LAST TIME FROM JUNE 27TH UNTIL JULY 18TH, 2020 WITH NO RESOLVE.",
        "vin": "JN8AT2MV2KW"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "07/31/2020",
        "dateOfIncident": "01/02/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342478,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN ROGUE. THE CONTACT STATED THAT WHILE DRIVING AT AN UNDISCLOSED SPEED, THE FORWARD COLLISION AVOIDANCE SYSTEM WARNING LIGHT FLASHED WITHOUT ANOTHER VEHICLE NEARBY. THE CONTACT STATED THAT THE COLLISION AVOIDANCE WARNING LIGHT ALSO ILLUMINATED WHILE THE VEHICLE WAS BEING REVERSED. THE CONTACT STATED THAT THE AUTOMATIC BRAKING WAS APPLIED INDEPENDENTLY DURING THE FAILURE WHILE THE VEHICLE WAS BEING REVERSED. THE VEHICLE WAS TAKEN TO NISSAN OF TURNERSVILLE (3400 RTE 42, TURNERSVILLE, NJ 08012, (856)516-6350) HOWEVER, THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS CONTACTED AND NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 12,000.",
        "vin": "JN8AT2MV2KW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/30/2020",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11342297,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN ROGUE. THE CONTACT EXPERIENCED CHEST PAINS AND DIZZINESS WHILE DRIVING THE VEHICLE. THE CONTACT WENT TO THE DOCTOR AND HAD A CARBON MONOXIDE POISONING TEST PERFORMED. THE RESULTS CAME BACK POSITIVE. A CARBON MONOXIDE TEST WAS ALSO PERFORMED IN THE CABIN OF THE VEHICLE WHICH ALSO RETURNED A POSITIVE RESULT. THE VEHICLE WAS TAKEN TO TAMAROFF NISSAN LOCATED AT 28585 TELEGRAPH RD #2, SOUTHFIELD, MI 48034 HOWEVER, THE MECHANIC WAS UNABLE TO IDENTIFY THE CAUSE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 100.*DT*JB*DT  CONSUMER MADE A REPORT TO THE POLICE THAT A SUSPECT HAD BEEN TAMPERING WITH THE CAR WITH A REMOTE CONTROL STARTER TRANSMITTER WHICH HAD BEEN INSTALLED IN THE VEHICLE WHICH TAMPERS WITH THE CARBON MONOXIDE.*JB",
        "vin": "5N1AT2MV1KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/22/2020",
        "dateOfIncident": "07/22/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340965,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC BRAKING SYSTEM JUST COMES ON FOR NO REASON.  FROM A COMPLETE STOP WHEN YOU START PUSHING ON THE GAS THIS COMES ON AND WILL NOT LET YOU GO FORWARD. YOU HAVE TO LIMP OVER TO GET OUT OF EVERYONE'S WAY. ALMOST WAS IN AN ACCIDENT TODAY BECAUSE OF IT. I WAS JUST IN A CITY STREET WHEN THIS HAPPENED. THIS IS THE SECOND TIME THIS HAS HAPPENED EXACTLY THE SAME SITUATION DIFFERENT CITY STREET",
        "vin": "5N1AT2MV3KC"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/17/2020",
        "dateOfIncident": "07/07/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339977,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE HAS AN INTERMITTENT ISSUE WHERE IT SUDDENLY BRAKES WITHOUT CAUSE. I HAVE BEEN IN FOR FIVE REPAIR ATTEMPTS AND AFTER MY FIFTH ATTEMPT IT STILL BRAKED SUDDENLY AND NOW THERE ARE NEW ISSUES, MOST OF CONCERN WAS WHEN MY STEERING JERKED SUDDENLY TO THE RIGHT WHEN I WAS DRIVING ON THE FREEWAY.",
        "vin": "5N1AT2MV3KC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/17/2020",
        "dateOfIncident": "07/15/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340008,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD RECALL SYSTEM UPDATE DONE IN LATE MAY OR EARLY JUNE 2020. THIS WAS SUPPOSED TO BE FOR SOME RADIO ISSUE IS WHAT I WAS TOLD BY THE SERVICE TECH, BUT THE RECALL NOTICE SAID IT WAS FOR THE BACK UP CAMERA. JUNE 6TH WE WENT ON VACATION AND APPORX 20 MILES FROM HOME THE EMA LIGHT THAT COMES ON WHEN THE SYSTEM IS DISABLED ILLUMINATED FOR NO REASON. TURNED OFF CAR AND RESTARTED, THE LIGHT WENT OFF. TWICE IN THE LAST 2 WEEKS, THE FRONT COLLISION LIGHT BLINKED AND THE THREE BEEPS CHIMED, BUT THERE WAS NOTHING IN FRONT OF ME. THIS WEEK, ON 7/15/2020, THE LIGHT BLINKED, THE CHIMES BEEPED AND BRAKING WAS AUTOMATICALLY APPLIED. THIS SCARED THE CRAP OUT OF ME. NOTHING AROUND ME ANYWHERE. NO BRIDGE, NO RR TRACKS, NO GUARDRAIL, CARS OR PEOPLE. NOTHING BUT OPEN ROAD. I TOOK THE CAR TO THE DEALER TODAY AND I THEY ACTED LIKE THEY DIDN'T BELIEVE ME BECAUSE THEY SAID THAT IT DIDN'T LEAVE A \"STAIN\" ON THE COMPUTER. THERE WERE A FEW TIMES THAT THE ALARM WENT OFF PRIOR TO THIS STARTING, BUT THEY WERE WARRANTED AND I FOUND IT HARD TO BELIEVE THAT NOT EVEN THOSE OCCURRENCES WERE RECORDED. SOMETHING IS DEFINITELY WRONG WITH THIS CAR AND I AM AFRAID TO DRIVE IT NOW.",
        "vin": "5N1AT2MT7KC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/16/2020",
        "dateOfIncident": "07/14/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339797,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN A SERIOUS ACCIDENT WHICH SMASHED THE ENTIRE FRONT OF MY CAR TO THE POINT THAT OUT WAS TOTALED. NOT ONE AIRBAG DEPLOYED. WHEN THE ACCIDENT OCCURRED I WAS ENTERING AN INTERSECTION AND MOVING ONLY ABOUT 10 MPH. I HAVE CONTACTED NISSAN BUT HAVE NOT YET HEARD FROM THEM.*DT*JB",
        "vin": "KNMAT2MT9KP"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/10/2020",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338524,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BACKUP CAMERA HAS AN ISSUE. IT'S ON WITH ZERO VISIBILITY. I WONDER IF THIS IS AN ISSUE OF RECALL, BECAUSE I ONLY DROVE IT FOR SIX MONTHS AND AFTERWARDS THE CAMERA HAS STOPPED WORKING. I WENT TO THE DEALER, BUT THEY DIDN'T GIVE ME A WARRANT. I DID MY OWN INVESTIGATION JUST TO FIND OUT THAT THERE IS A LOT OF CAR OWNERS WITH THE SAME PROBLEM. I FEEL UNSAFE BACKING UP WITHOUT A CAMERA OPERATION AS I COULD POSSIBLY CAUSE AN ACCIDENT. AS I AM SHIFTING THE TRANSMISSION USING THE REVERSE GEAR, THE SCREEN DOES NOT DISPLAY PICTURE. PLEASE TAKE A LOOK AT THE ISSUE I HAVE, AND GIVE ME A SOLUTION BECAUSE IT IS UNFAIR. I ONLY PAYED THEM FOR A YEAR. THANK YOU VERY MUCH.",
        "vin": "5N1AT2MT1KC"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "07/10/2020",
        "dateOfIncident": "06/26/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338551,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN ROGUE. THE CONTACT STATED THAT WHILE DRIVING AND ACCELERATING, THE DRIVER'S SEAT MOVED BACKWARDS. THE CONTACT ALSO STATED THAT WHILE COMING TO A STOP THE DRIVER'S SEAT MOVED FORWARD. THE VEHICLE WAS TAKEN TO BROWNS FAIRFAX NISSAN (11010 FAIRFAX BLVD, FAIRFAX, VA 22030, 703-591-8009) TO BE INSPECTED AFTER CALLING THE MANUFACTURER FOR ASSISTANCE. THE CONTACT STATED THAT TWO OTHER VEHICLES WERE TESTED WITH SIMILAR RESULTS. THE MANUFACTURER DECLINED TO HELP. THE MANUFACTURER STATED THAT THE VEHICLE OPERATED AS DESIGNED. THE FAILURE MILEAGE WAS 10,000.",
        "vin": "5N1AT2MV9KC"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "07/10/2020",
        "dateOfIncident": "06/19/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338569,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SEAT MOVES WHEN ACCELERATE AND BRAKING. I HAD BOUGHT THIS VEHICLE ONJUNE 22, 2019. AND I HAD BOUGHT THIS PROBLEM TO THE DEALERSHIP THAT I HAD BOUGHT IT FROM. THEY HAD TOLD ME THAT THIS A COMMON PROBLEM. THIS PROBLEM HAD STARTED IN THE LAST 2 WEEKS JUNE OF 2020. AND MY VEHICLE ONLY HAS 10,009 MILES ONLY. THE DEALERSHIP REPAIR SHOP HAD TOLD ME THE NISSAN CORPORATION REFUSE TO FIX IT UNTIL IT HET WORSEN.",
        "vin": "5N1AT2MV9KC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/08/2020",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338164,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CLOCK ON DASH AND NAVIGATION KEEP RESETTING EVERY TIME THE CAR STARTS",
        "vin": "JN8AT2MV6KW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/06/2020",
        "dateOfIncident": "07/05/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337710,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS ON A STREET ,FOR THE 3TH TIME NOW THE FORWARD COLLISION MALFUNCTION CAME ON ,WAS IN THE SHOP FOR IT BUT IT STARTS DOING IT AGAIN ,WE WILL MAKE A NEW APPOINTMENT ,ALSO THE CAR JUST SLAMMED ITS OWN BRAKES FOR NO REASON NO PHOTOS AVAILABLE FOR THIS EVENTS",
        "vin": "5N1AT2MT7KC"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/30/2020",
        "dateOfIncident": "06/30/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331797,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE \"AUTOMATIC\" BRAKING SYSTEM ENGAGED FOR NO REASON WITH NO OBSTRUCTION OR OBJECT CAUSING THE CAR TO STOP VIOLENTLY AND GREATLY INCREASED THE POTENTIAL FOR AN ACCIDENT.  SPEED WAS MAXIMUM 15 MPH ON A RESIDENTIAL STREET. TRAIN TRACKS WERE BEING APPROACHED BUT WERE 2-3 METERS AWAY, NOTHING ELSE WAS NEAR THE CAR. THIS OCCURRED SHORTLY AFTER HEADING OUT FROM DESTINATION, (<5MIN) FROM START UP. CAR WAS PROCEEDING STRAIGHT WITHOUT TURNING.",
        "vin": "JN8AT2MVXKW"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "06/23/2020",
        "dateOfIncident": "06/19/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330365,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE I WAS DRIVING IN TRAFFIC WITH THE PROPILOT ASSIST AND INTELLIGENT CRUISE, I WAS INVOLVED IN AN ACCIDENT.  MY CAR WAS PACING THE CAR IN FRONT JUST FINE AND WHEN THE CAR STOPPED SUDDENLY IN FRONT MY CAR DID NOT.  BY THE TIME I REALIZED THE CAR WAS NOT GOING TO STOP IN TIME I SLAMMED ON MY BREAKS AND NOTHING HAPPENED. I WAS PRESSING ON THE BRAKES SO HARD THAT THE AIR BAGS DID NOT EVEN TOUCH ME.   I ALSO HAD ISSUES WITH MY CAR SUDDENLY STOPPING FOR NO REASON WHILE PROPILOT ASSIST WAS ENGAGED.  *TR",
        "vin": "JN8AT2MV8KW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/11/2020",
        "dateOfIncident": "02/14/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328278,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT AND BACK SENSORS LIGHT UP ON DASH SAYING MALFUNCTION WHEN DRIVING ON THE ROAD. THEY HAVE TRIGGERED AND INDICATED A HAZARD WAS PRESENT ON SEVERAL OCCASIONS. TWO TIMES SO FAR WHILE DRIVING 70-75 MILES AN HOUR ON I95. ON TWO OCCASIONS WHEN GOING 25-30 MPH THE FRONT SENSOR LIGHTS UP AND NOTHING IS IN FRONT OF THE VEHICLE AND BACK SENSOR GOES OFF WHEN THERE IS NOTHING BEHIND THE VEHICLE AND TRYING TO BACK UP. THIS OCCURRED WHEN VEHICLE WAS PARKED AND THE SENSORS STARTS BLARING WHEN THE CAR IS PUT INTO REVERSE.  *TR",
        "vin": "KNMAT2MV1KP"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/28/2020",
        "dateOfIncident": "05/09/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326388,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 5 SEPARATE OCCASIONS PRIOR TO THE DATE LISTED, THE AUTOMATIC EMERGENCY BRAKING SYSTEM ACTIVATED FOR NO APPARENT REASON. AT APPROXIMATELY 30 MPH ON A RELATIVELY STRAIGHT SECTIONS OF ROAD WITH NO OBSTRUCTIONS AND CLEAR ROAD AHEAD. THE BRAKES ACTIVATED WITHOUT A WARNING CREATING A RAPID DECELERATION AND A SEVERE GRINDING NOISE. THOUGH NO ACCIDENT OCCURRED HAD IT BEEN IN TRAFFIC THE RESULTS WOULD MOST LIKELY HAVE BEEN THE VEHICLE BEING STRUCK FROM THE REAR. THE DEALERSHIP STATES THAT THERE APPEARS TO BE NO OBVIOUS ISSUES AND CAN'T RECOMMEND A FIX. THE EMPLOYEE I SPOKE WITH IN THE DEALERSHIP SERVICE DEPARTMENT  STATED THAT THERE ARE KNOWN ISSUES BUT NO RECALLS OR CORRECTIVE ACTIONS HAVE BEEN MADE FOR THIS PARTICULAR VEHICLE.  *TR",
        "vin": "JN8AT2MV5KW"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/28/2020",
        "dateOfIncident": "04/28/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322562,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STOPS FOR NO REASON WHILE DRIVING(IN MOTION) ON A STRAIGHT ROAD. NO WARNING AND JUST COMES TO AN IMMEDIATE STOP. THIS HAPPENED ON A BRIDGE AND ON A HIGHWAY TWICE. THERE WAS ONCOMING TRAFFIC BUT NO OBSTRUCTION IN FRONT WITHIN 60FT. VEHICLE ALSO CONTINUES TO HAVE COLLISION DETECTION MALFUNCTION EVEN AFTER SENSOR WAS REPLACED BY DEALER.",
        "vin": "5N1AT2MV3KC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/20/2020",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321706,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKUP CAMERA SCREEN FREEZE, CAUSING A VERY DANGEROUS SCENARIO, WHAT WOULD APPEAR MUCH FURTHER IN CAMERA WAS ACTUALLY MUCH CLOSER, BECAUSE CAMERA WAS FROZEN AT EARLIER POSITION. NISSAN RELEASED A RECALL FIX TO THE BACKUP CAMERA, THERE IS DEFINITELY IMPROVEMENT AFTER THE RECALL WAS FIXED, BUT THE PROBLEM STILL OCCASIONALLY PERSISTS, AND STILL NEEDS TO BE ADDRESSED.",
        "vin": "5N1AT2MV2KC"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "04/15/2020",
        "dateOfIncident": "03/03/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11321238,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 NISSAN ROUGE. THE VIN WAS NOT PROVIDED. THE CONTACT STATED THAT WHILE HIS DAUGHTER WAS DRIVING ABOUT 65 MPH, THE AUTOMATIC EMERGENCY BRAKING SYSTEM ENGAGED WITHOUT WARNING. THE DRIVER LOST CONTROL OF THE VEHICLE WHICH WENT OFF THE ROAD, ROLLED AND CRASHED INTO A GRASSY AREA. ALL THE AIR BAGS DEPLOYED.  A POLICE REPORT WAS FILED. THE DRIVER SUSTAINED INJURIES, INCLUDING SPRAINED NECK, TEMPORARY HEARING LOSS AND A CONCUSSION THAT REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS TOWED TO A TOW YARD AND WAS LATER TOWED TO AN UNKNOWN NISSAN DEALER LOCATED IN ORLANDO, FLORIDA. THE CONTACT STATED THAT THE INSURANCE COMPANY DID NOT PHYSICALLY CHECK THE VEHICLE DUE TO COVID19 TO DETERMINE WHETHER THE VEHICLE WOULD BE DECLARED TOTALED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 5,000.",
        "vin": "5N1AT2MV7KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/29/2020",
        "dateOfIncident": "03/14/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319651,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELLING AT APPROXIMATELY 10 TO 15 MILES PER HOUR ON A CITY STREET. I WAS ON A PAVED ROAD AND APPROACHING A BRIDGE THAT HAD METAL GRATES TO TRAVEL ON. AT THE POINT WHERE THE PAVEMENT STOPPED AND THE METAL GRATES STARTED THE VEHICLE SUDDENLY BRAKED FOR NO REASON. I WAS LUCKY THERE WAS NO VEHICLE BEHIND ME OR THERE COULD HAVE BEEN A COLLISION.",
        "vin": "5N1AT2MT7KC"
    },
    {
        "components": "SERVICE BRAKES, AIR,SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/13/2020",
        "dateOfIncident": "09/10/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317862,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN ROGUE. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE WAS BRAKING DUE TO THE FORWARD COLLISION WARNING ERROR ILLUMINATED. THE CONTACT MENTIONED THAT THERE WAS NOTHING IN FRONT THE VEHICLE WHEN THE ERROR ILLUMINATED. THE VEHICLE WAS TAKEN TO MCDONOUGH NISSAN LOCATED AT (1775 AVALON PKWY, MCDONOUGH, GA 30253) WHERE IT WAS DIAGNOSED THAT THERE WAS OBSTRUCTION OF CHASSIS SENSOR AND THAT THE CAMERA NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED HOWEVER, THE FAILURE PERSISTED. THE VEHICLE WAS TAKEN BACK TO MCDONOUGH NISSAN 1775 AVALON PKWY, MCDONOUGH, GA 30253 WHERE THE MECHANIC WAS UNABLE TO DIAGNOSE THE VEHICLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 5,171.*LN*JB",
        "vin": "5N1AT2MT0KC"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/08/2020",
        "dateOfIncident": "03/05/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316822,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AUTO BREAK SYSTEM  CRASH SENSOR LIGHT COMES ON FOR NO REASON, THE BRAKES COME ON BY THEMSELVES WITH NO CARS AROUND. THE TRANSMISSION ALSO FEELS LIKE IT'S SLIPPING WITH HIGH RPMS FROM A DEAD STOP.",
        "vin": "5N1AT2MV5KC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/08/2020",
        "dateOfIncident": "06/19/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316869,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR'S TRANSMISSION ON MY 2019 NISSAN ROGUE SV AWD HAS BEEN SLIPPING FROM THE MOMENT I RECEIVED IT IN LATE MAY, 2019. ON 6/19/2019, I BROUGHT MY CAR TO THE DEALERSHIP TO REPORT THE PROBLEM. SINCE THEN I'VE BROUGHT IN MY CAR FOR REPAIRS ON 10/15/19, 10/18/19, 1/30/20, 2/15/20, 2/20/20, AND 3/7/20. TO NO AVAIL BECAUSE I'VE BEEN REPEATEDLY TOLD THAT THE \"CODES\" ARE NORMAL. ON 1/30/20, THE TRANSMISSION CONTROL BOX WAS REPLACED BUT MY CAR CONTINUES TO HAVE TROUBLE ACCELERATING, SPECIFICALLY IT REVS HIGH, BUT DOES NOT RESPOND/ACCELERATE AS EXPECTED. THIS SITUATION CONTINUES TO ENDANGER ME AND OTHERS ON THE ROAD. TO DATE, MY CAR ONLY HAS 8K MILES.",
        "vin": "JN8AT2MV9KW"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/01/2020",
        "dateOfIncident": "04/18/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315372,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE  SIDE REAR VIEW MIRROR ON THE DRIVER'S SIDE IS EITHER TOO BIG OR IN THE INCORRECT LOCATION. IMPOSSIBLE TO SEE  THE LANE OF PERPENDICULAR TRAFFIC CAN TURN TOO DEEP VERY EASILY . HAVE ADJUSTED THE SEAT IN VARIABLE WAYS TO SOLVE THE PROBLEM ,NO LUCK. #2 THE PRO PIOLOT WHEN IT IS TURNED ON I HAVE TO FIGHT THE WHEEL GOING DOWN A STRAIGHT ROAD I85.EG.)  IT TRIES TO STRAY FROM ONE LINE TO THE OTHER , LIKE A SNAKE GOING FROM ONE LINE ON ONE SIDE OF THE ROAD TO THE OPPOSITE SIDE OF THE LANE. SO I PAID FOR AN OPTION I CAN'T USE.BUT THE MAIN THING IS THAT BIG  BLIND SPOT WHEN TURNING LEFT, YO HAVE TO LOOK TO THE RIGHT SIDE OF THE CAR AND GET HAS CLOSE TO THE RIGHT ,NOT STILL NOT KNOWING IF YOUR CROSSING THE CENTER LINE OR LEFT TURN LANE , THIS ONE BIG BLIND SPOT GOING COWARD, NEEDS CORRECTIONS, I'VE READ MANY POST ON THE PRO &CONS ON THE 2019 NISSAN ROGUE SV. JUST AN ACCIDENT WAITING TO HAPPEN. THE POST THAT HOLDS THE WINDSHIELD IN IS WIDE AND BULCKY TOO ADDING MORE PROBLEMS WITH VISIBILITY. THIS CAR IS SO HARD TO SEE THE TRAFFICK AT AN INTERSECTION.  THANKS FOR LENDING AN EAR, HOPE YOU CAN HELP GET THE PROBLEM CORRECTED.",
        "vin": "JN8AT2MT9KW"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "02/29/2020",
        "dateOfIncident": "01/30/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11312239,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I LEFT MY CAR RUNNING WITH THE TRANSMISSION IN PARK. I WENT INTO MY HOUSE FOR A FEW MINUTES. WHEN I LEFT MY HOUSE I SAW THAT MY CAR WAS ROLLING DOWN THE DRIVEWAY. THE CAR HIT A TREE AND CAME TO A STOP. WHEN I GOT TO THE CAR IT WAS STILL RUNNING AND IN REVERSE GEAR. NO ONE WAS IN THE CAR AT THE TIME. I AM POSITIVE THAT WHEN I LEFT THE CAR IT WAS IN PARK.*DT",
        "vin": "5N1AT2MV3KC"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/28/2020",
        "dateOfIncident": "02/28/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11312179,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HESITATES OR JERKS DURING LOW SPEED",
        "vin": "JN8AT2MV6KW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/22/2020",
        "dateOfIncident": "10/11/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310721,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AEB SYSTEM HAS ENGAGED ON FIVE SEPARATE OCCASIONS WITHOUT ANY VEHICLES BEING AROUND SINCE PURCHASING THE VEHICLE. THESE FIVE OCCASIONS ARE DIFFERENT THAN ANY EXPERIENCE NISSAN HAS HAD. THE AEB LIGHT COMES ON QUITE OFTEN AS WELL; IN CONDITIONS NOT RECOGNIZED BY NISSAN SUCH AS DRIVING AT NIGHT IN CLEAR CONDITIONS AND OTHER TIMES WHEN THE WEATHER/SUN IS NOT THE PROBLEM. NISSAN ADMITS THE VEHICLE AEB CAN ENGAGE WHEN DRIVING OVER AND UNDER BRIDGES, WHILE IN PARKING GARAGES AS WELL AS WHEN ENTERING/EXITING STEEP DRIVEWAYS.THERE ARE CURRENTLY 6,500 MILES ON THE VEHICLE. THE VEHICLE HAS BEEN IN THE SHOP ON FOUR SEPARATE OCCASIONS. THE VEHICLE HAS BEEN KEPT AND DRIVEN TWICE FOR THREE DAYS EACH TIME AND THE SHOP IS UNABLE TO REPRODUCE THE ISSUE. NISSAN CORPORATE WAS CONTACTED AND A TECHNICIAN WAS SENT OUT. THE TECHNICIAN AND I DROVE THE VEHICLE AND WE WERE UNABLE TO REPRODUCE THE ISSUE. IN THEIR CONCLUSION THE VEHICLE IS OPERATING IN NORMAL CONDITIONS. NISSAN CORPORATE WAS CONTACTED AGAIN FOR BUYBACK TO WHICH NISSAN DECLINED AS THEY WERE UNABLE TO REPRODUCE THE ISSUE. EVERY CONTACT TO THE DEALERSHIP OR ANY OTHER NISSAN DEALERSHIP TO FIX THIS ISSUE ENDS UP IN NO CALLBACKS OR REFUSAL OF SERVICE. I AM CURRENTLY IN LITIGATION AND AWAITING TO HEAR BACK FROM NISSAN. THIS IS A SERIOUS ISSUE THAT MANY DRIVERS ARE EXPERIENCING WITH NO ACTION FROM NISSAN. THIS IS UNACCEPTABLE. IT SEEMS THE SERIOUS INJURY AND/OR DEATH OF AN INDIVIDUAL(S) WILL BE THE ONLY WAY NISSAN BRINGS ANY ACTION TO THIS ISSUE.",
        "vin": "5N1AT2MV1KC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/18/2020",
        "dateOfIncident": "12/25/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309837,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN ROGUE. THE CONTACT STATED THAT WHILE DRIVING AT 40 MPH THE VEHICLE DECELERATED INDEPENDENTLY. THE CONTACT STATED THAT THE ACCELERATOR PEDAL HAD TO BE DEPRESSED TO THE FLOORBOARD FOR THE VEHICLE TO RESPOND. THE VEHICLE WAS TOWED TO NISSAN 112 LOCATED AT 730 MEDFORD AVE, PATCHOGUE, NY 11772, (631) 651-1987 HOWEVER, THE VEHICLE WAS NOT DIAGNOSED. THE VEHICLE RECEIVED UNKNOWN REPAIRS HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 3,000.",
        "vin": "KNMAT2MV2KP"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/11/2020",
        "dateOfIncident": "02/05/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308417,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THREE SEPARATE OCCASIONS, THE EMERGENCY BRAKING SYSTEM ENGAGED WHILE DRIVING AT A MODERATE SPEED WITHOUT REASON. TODAY IS THE SECOND VISIT TO THE DEALER TO RECTIFY THE ISSUE.  THE MOST RECENT OCCURANCE WAS 2/5/2020 AND ALMOST CAUSED A  VEHICLE BEHIND ME TO RUN INTO MY SUV.",
        "vin": "KNMAT2MV3KP"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/09/2020",
        "dateOfIncident": "01/04/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308009,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 45 MPH, AT NIGHT ON A 2 LANE STRAIGHT ROAD. THERE WERE NOT ANY CARS COMING AT ME NOR ANY BEHIND ME. THERE WAS NOT ANY OTHER ACTIVITY ON OR NEAR THE ROAD. I HEARD A FEW BEEPS AND THEN THE ABS ENGAGED WHILE I HAD MY FOOT ON THE ACCELERATOR. OUR SPEED IMMEDIATELY DROPPED TO ABOUT 20 MPH WHILE THE CAR SHOOK (THE ABS RESPONSE). THIS HAS HAPPENED TWO MORE TIMES BUT AT SLOWER SPEEDS WHILING BRAKING TO GO INTO A PARKING GARAGE. MY DEALER TECHNICIAN \"CLEARED THE CODES FOUND FROM THE FIRST INCIDENT BUT HAVE NOT DONE ANYTHING ELSE BUT TO SUGGEST THAT THE PLACEMENT OF MY EZ-PASS \"MIGHT\" BE CAUSING THE PROBLEM.I EMAILED THE SERVICE MANAGER TO ASK THEY HE HELP TO FIND A SOLUTION WITH NISSAN AND HE HAS NOT RESPONDED TO MY EMAIL.GIVEN THE HISTORY OF THE 2017 AND 2018 ROGUES I AM NOT FEELING SAFE IN THE CAR.",
        "vin": "KNMAT2MV8KP"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/08/2020",
        "dateOfIncident": "02/08/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307967,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE HIGHWAY AND WAS GOING 55 MPH ALL THE SUDDEN MY AEB LIGHT CAME ON AND MY CAR SUDDENLY STOPPED ON THE ROAD.  THERE WAS NO ONE IN FRONT OF ME AND THANK GOD NO ONE WAS BEHIND ME.    THANK GOD I WASN'T ON A SNOW COVERED ROAD. THIS IS VERY DANGEROUS AND I DON'T WANT TO DRIVE MY SUV ANYMORE!  ALSO WHEN I BOUGHT MY CAR NEW IT HAD A DEFECTIVE STRUT MOUNT AND BEARINGS THAT I HAD TO ARGUE WITH NISSAN TO FIX.  PLEASE DO SOMETHING ABOUT THIS BEFORE SOMEONE GETS KILLED!",
        "vin": "5N1AT2MV2KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/07/2020",
        "dateOfIncident": "01/31/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307720,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING THE CAR AND THE AUTOMATIC BRAKING SYSTEM KICKED IN FOR NO APPARENT REASON.",
        "vin": "5N1AT2MV3KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/03/2020",
        "dateOfIncident": "02/01/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306823,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE CAR ON AUGUST 30, 2019 AND SEVERAL TIMES WHILE BACKING OUT OF THE GARAGE, WITH A SLIGHT DECLINE, OR CLOSE TO THE GARAGE DOOR EDGE, OR CLOSE TO A TRUCK IN THE GARAGE, BRAKES WERE AUTOMATICALLY ENGAGES MAKING A SUDDEN STOP WITH A GRINDING NOISE. ON SATURDAY 2-1-2020, MY WIFE WAS BACKING OUT OF A SHOPPING CENTER PARKING SPACE AND SHE SAID WHEN SHE APPLIED THE BRAKES THE CAR WOULD NOT STOP AND SHE HIT A CAR PARKED IN A SPACE BEHIND HER. SHE FANATICALLY SAYS SHE WAS PRESSING THE BRAKE PEDAL. THERE WAS NO DAMAGE TO EITHER CAR. I HAVE NOT MADE ANY CONTACT WITH A NISSAN DEALER.",
        "vin": "5N1AT2MV5KC"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/27/2020",
        "dateOfIncident": "01/26/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11302155,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING JUST ABOUT TO GET ON A BRIDGE, MY CAR AUTOMATICALLY BREAKED (BROKE)! VERY DANGEROUS, THERE WAS A VEHICLE BEHIND ME.",
        "vin": "JN8AT2MT6KW"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/27/2020",
        "dateOfIncident": "12/07/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302399,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON HIGHWAY AT 5:30AM. NO OTHER CARS AROUND ME, CAR BREAKS HARD OUT OF NOWHERE JERKING ME FORWARD.",
        "vin": "JN8AT2MT4KW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/26/2020",
        "dateOfIncident": "01/23/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302097,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON THE LOCAL WITH NO CARS IN FRONT OR BEHIND THE AEB WARNING LIGHT STARTED FLASHING. THIS SAFETY ISSUES. NISSAN SHOULD FIX ASAP.",
        "vin": "5N1AT2MV5KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/23/2020",
        "dateOfIncident": "01/21/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301323,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING ABOUT 45-50 MPH ON A RURAL HIGHWAY WHEN THE CAR SUDDENLY STOPPED, MADE A LOUD NOISE AND THE LIGHTS FLASHED IN THE STEERING COLUMN.  I WAS ABLE TO CONTINUE DRIVING HOME, BUT THIS WAS VERY ALARMING",
        "vin": "SN1AT2MT5KC"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/16/2020",
        "dateOfIncident": "01/15/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299680,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY 2019 ROGUE IN APRIL, STARTING IN  LATE OCTOBER A LIGHT START COMING ON THE DASHBOARD. I TOOK IT IN AND THE SAID I HAD A RECALL THEY SAY THE FIXED IT. ABOUT A WEEK LATER THE LIGHT CAME ON AGAIN I TOOK IT BACK AND THEY KEEP IT FOR TWO DAYS THEY SAY THEY FIXED IT , A WEEK LATER THE LIGHT CAME BACK ON AGAIN, THEY KEEP THE CAR FOR THE THANKSGIVING BREAK AND SAID THE LIGHT NEVER CAME ON AND THE CANT GET A CODE OFF THE LIGHT TO FIX IT IF THEY LIGHT NEVER COMES ON WITH THEM. I TOOK MY TRUCK BACK AND I WASN'T DRIVING FOR FIVE WEEKS. I STARTED BACK DRIVING THE LAST WEEK IN DECEMBER AND THE LIGHT CAME BACK ON.  ON JANUARY 15 I WAS DRIVING DOWN THE STREET WITH MY FOOT ON THE GAS PEDAL, NOBODY IN FRONT OF ME THE CAR BRAKED ON ITS OWN SCARING ME.. THAT HAD NEVER HAPPENED BEFORE AND THANKFUL NOBODY RAN INTO THE BACK OF ME. I AM TAKING THE CAR BACK IN FOR SERVICE ON FRIDAY. THIS WILL BE THE FOURTH TIME WITH THE LIGHT COME ON THE DASHBOARD AND THE FIRST TIME IT BRAKED ON ME WILL I WAS STILL DRIVING.",
        "vin": "5N1AT2MV9KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/13/2020",
        "dateOfIncident": "01/12/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299134,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY PURCHASED & APPEARS THE VEHICLE BRAKED W/ NOTHING IN AREA (DRIVEWAY) THANKFUL. READING SEVERAL COMPLAINTS ON THIS & CONCERNED. SUDDEN STOPS COULD RESULT IN INJURY OR, INJURIES TO A REAR VEHICLE. SHERI",
        "vin": "5N1AT2MT0KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/09/2020",
        "dateOfIncident": "01/09/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298066,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVING ISSUES WITH THE FORWARD COLLISION SENSOR,  ANYTHING BELOW 34 THE LIGHT ON THE DASH WILL BLINK ON AND OFF. WHEN THIS HAPPENS MY LANE DEPARTURE DOESN'T WORK AND IT ALSO EFFECTS MY AUTO HEAD LIGHTS FROM WORKING AUTOMATICALLY EVEN WHEN IN AUTO MODE. TOOK TO THE DEALERSHIP TWICE NOW AND WAS TOLD THAT THEY CAN'T DUPLICATE THE PROBLEM SO MY CAR WORKS AS INTENDED. THIS IS A MAJOR SAFETY ISSUE.  I WON'T LET MY WIFE DRIVE THE CAR ANYMORE CAUSE I DON'T WANT THE SAFETY  FEATURES THAT I PAID FOR TO FAIL AND THE CAR CRASH.",
        "vin": "KNMAT2MVXKP"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/06/2020",
        "dateOfIncident": "01/06/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297382,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "NISSAN HAS RENEGED ON THE REPURCHASE UNDER LEMON LAW, RIGGED MY VEHICLE SO THAT THE CRASH SYMBOL IS HIDDEN UNDER EMERGENCY BRAKE(AUTOMATICALLY ENABLED WHILE    DRIVING), CAR CONTINUES TO STOP ON ITS OWN(HIGHWAY AND ELSEWHERE); NISSAN NORTH AMERICA AND ANDY MOHR NISSAN PLACED PERMANENT NOTE NOT TO SERVICE MY VEHICLE AT ANDY MOHR, THUS BLOCKING MY PAID WARRANTY, FORCING ME TO DRIVE KNOWN  SAFETY HAZARD WITH POTENTIAL TO CAUSE INJURY OR DEATH TO ME OR EVERYONE AROUND THIS VEHICLE",
        "vin": "5N1AT2MT2KC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/04/2020",
        "dateOfIncident": "01/04/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297068,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FORWARD BREAKING EMERGENCY SYSTEM KEEPS SHUTTING DOWN AND SHOWING A FLASHING WARNING LIGHT ON MY DASH. THE RADAR HAS ALREADY BEEN REPLACED ONCE, BUT THE SIGN PERSISTS ANY TIME IT IS BELOW 30* F OUTSIDE.",
        "vin": "5N1AT2MT4KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/04/2020",
        "dateOfIncident": "01/03/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297082,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 NISSAN ROGUE SL AUTOMATIC BRAKING STOPPED THE CAR FOR UNKNOWN REASON. NO CARS OR OTHER OBSTACLES IN FRONT OF CAR.  TRAVELING ON CITY STREET NEAR INTERSECTION  GOING UNDER AN UNDERPASS. SPEED ABOUT 35 MPF. TIME WAS ABOUT 4:30 PM WITH SUN LOW IN SKY AND SHADOWS IN UNDERPASS. MILAGE ON CAR ABOUT 4,900 MILES.",
        "vin": "SN1AT2MV1KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/02/2020",
        "dateOfIncident": "12/13/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11292546,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AEB LIGHT COMES ON WHEN NO OTHER VEHICLES ARE PRESENT.  IT HAS STAYED ON FOR ABOUT 15 MINUTES WITH NO TRAFFIC AROUND WHILE DRIVING 35-55 MPH. IT HAS ALSO MADE A A GRINDING NOISE AND ENGAGED THE BRAKES WHILE GOING SLOWLY WITH NO CAR OR OBJECT NEARBY AT ABOUT 35MPH. LIGHT HAS ALSO BEEN ON WHILE STOPPED WITH NO VEHICLES AROUND.",
        "vin": "KNMAT2MV6KP"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/02/2020",
        "dateOfIncident": "12/22/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11296680,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AEB LIGHT KEEPS COMING ON. SEEMS TO HAPPEN WHEN IT IS COLD OUT.",
        "vin": "JN8AT2MV9KW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/18/2019",
        "dateOfIncident": "12/18/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289799,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AUTOMATIC EMERGENCY BRAKE LIGHT IS FLASHING FOR NO REASON. EVEN IF MY WINDOW IS CLEAR, AND THERE IS NO OBSTRUCTION IN FRONT OF ME. AND SOMETIMES IT IS FLASHING, IT JUST COMES ON AND OFF AGAIN AND AGAIN.",
        "vin": "5N1AT2MT6KC"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/18/2019",
        "dateOfIncident": "12/16/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289878,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "IN PULLING OUT OF MY DRIVEWAY, BACKING UP AND IN MOTION WITH NO OBSTRUCTIONS, CAR BEGAN HARD BREAKING JERKING MYSELF AND MY PASSENGER FORWARD. THE SAME ACTION OCCURRED FOLLOWING DAY WHILE I WAS IN CAR ALONE BACKING OUT OF DRIVEWAY, THRUSTING/JERKING ME FORWARD WITH HARD BRAKING ACTION, WHILE MY FOOT IS ON ACCELERATOR FOR BACKING UP MOTION.",
        "vin": "5N1ET2MV7KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/17/2019",
        "dateOfIncident": "12/07/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289710,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS LEAVING WALGRENS PARKING LOT IN EAST WENATCHEE WA. WHEN AN ALARM WENT OFF IN MY CAR ANOUCING MY BRAKES FAILED. THE BRAKE PEDAL WAS STIFF AND NOT RESPONDING.. I NOTICED THE BRAKE ICON WAS ON THE DASH .I DROVE LESS THAN600YARDS. TO THE NISSON DEALERSHIP PULLED INTO THE PARKING LOT AND I HAD LESS THE 5% BRAKING CAPACITY.. THEY TOLD ME THE BRAKEBOOSTER FAILED AND IT WLL TAKE APPROXIMATLEY6 WEEKS TO GET A REPLACEMENT PART.",
        "vin": "5N1ET2MV7KC"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/14/2019",
        "dateOfIncident": "12/14/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288997,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON THE EXPRESSWAY  WITH NO CARS IN FRONT OR BEHIND THE AEB WARNING LIGHT STARTED FLASHING.",
        "vin": "5N1AT2MT5KC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/13/2019",
        "dateOfIncident": "12/02/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288954,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM UNABLE TO CONTROL THE FAN FOR THE TEMPERATURE. I CAN'T TURN IT OFF, LOWER OR RAISE IT.",
        "vin": "5N1AT2MV6KC"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/12/2019",
        "dateOfIncident": "11/18/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288571,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 ROGUE EMERGENCY BRAKING SYSTEM HAS TRIGGERED AUTOMATICALLY FOR NO REASON.  NORMAL TRAVEL SPEEDS (APX 30MPH) NO DANGERS IN FRONT OF VEHICLE BUT EBS TRIGGERED AND ABRUPTLY BROUGHT VEHICLE TO STOP.   BROUGHT THE CAR INTO NISSAIN DEALER, WHO \"UPDATED SOFTWARE\" AND HAD SAME ISSUE WITH SYSTEM TRIGGERING A COUPLE OF WEEKS LATER.   BROUGHT BACK TO NISSAIN WHO REPLACED THE RADAR SYSTEM, BUT AFTER A WEEK OR TWO, THE DASHBOARD  LIGHT SIGNALING THERE WAS SOMETHING WRONG WITH THE SYSTEM BEGAN TO BLINK AGAIN EVERY TIME THE VEHICLE WAS TURNED ON.",
        "vin": "JN8AT2MV2KW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/12/2019",
        "dateOfIncident": "12/12/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288575,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS SYSTEM ENGAGES FOR NO REASON.  HAPPENS USUALLY IN THE PARKING GARAGE.  SO FAR IT'S BEEN AT LOW SPEEDS AND NO ONE IS BEHIND ME, BUT THIS COULD BECOME VERY DANGEROUS IF IT HAPPENS ANY OTHER TIME.",
        "vin": "JN8AT2MV4KW"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/10/2019",
        "dateOfIncident": "12/02/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288254,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "OCCASIONALLY MY CAR WOULD DISPLAY THE FORWARD CRASH WARNING FOR NO REASON AND TURN OFF AFTER A FEW MINUTES. LAST WEEK IT CAME UP ON MY DISPLAY SAYING SYSTEM MALFUNCTION. TURNS OUT MY AEB AND FCW ARE ACTING UP. THANKFULLY MY BRAKES DIDN'T LOCK UP AND IT'S AT THE DEALERSHIP. THE DEALERSHIP REPLACED THE FAULTY PART BUT NOW CAN'T GET MY CAR TO ACCEPT THE UPGRADE. THEY TOLD ME I AM ONLY THE SECOND PERSON TO HAVE THIS PROBLEM THAT NISSAN KNOWS OF. THIS HAPPENED WITH LESS THAN 5000 MILES ON MY CAR.",
        "vin": "JN8AT2MV4KW"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/09/2019",
        "dateOfIncident": "12/07/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287908,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS MY 2ND ROGUE 2019, FIRST WAS PURCHASE IN APRIL OF 2019, HAD ISSUE AND NISSAN TOOK IT BACK AFTER I BOUGHT MY CURRENT ROGUE 2019 IN AUGUST. LOST MONEY ON IT BUT I WANT IT A VEHICLE FOR MY SAFETY AND MY FAMILY. MAKE MY STORY SHORT ON 12/07/2019 WARNING LIGHT CAME ON, AEB MALFUNCTION , MIND YOU MY WARNING IS OFF AT ALL TIME ! SO MUCH FOR SAFE VEHICLE! AFTER READING THAT 2017-18 HAVE THIS ISSUES I'M NOT SO SURE ABOUT MY SAFETY DRIVING IT. UNTIL IT S GOING TO TAKE SOMEONE'S LIFE ON THE ROAD ( I'M DRIVING HIGHWAY EVERYDAY) NISSAN GOING TO IGNORE THIS MATTER!   THE MALFUNCTION LIGHT CAME ON WHEN I WAS MERGING INTO HIGHWAY TRAFFIC. NEVER WENT AWAY, I PULL OVER TURNED OFF ENGINE, THEN ON AND LIGHT CAME ON AGAIN.",
        "vin": "JN8AT2MT9KW"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/05/2019",
        "dateOfIncident": "07/09/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287223,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN ROGUE. WHILE DRIVING 55 MPH, THE VEHICLE CAME TO A HARD STOP WITHOUT DEPRESSING THE BRAKE PEDAL. UPON RETURNING TO THE VEHICLE, THE CONTACT NOTICED THAT THE FRONT PASSENGER SIDE WINDOW INADVERTENTLY OPENED AND THE NAVIGATION SYSTEM FAILED TO PROVIDE PROPER DIRECTIONS AND LOCATIONS. THE VEHICLE WAS TAKEN TO PEARSON NISSAN OF OCALA (2060 SW COLLEGE RD, OCALA, FL 34471, (855) 305-3879) WHERE THE AUDIO MODULE WAS REPLACED AND THE SOFTWARE WAS UPDATED; HOWEVER, THE BRAKING FAILURE COULD NOT BE DUPLICATED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURES AND OFFERED THE CONTACT $1,800. THE FAILURE MILEAGE WAS APPROXIMATELY 4,900.",
        "vin": "JN8AT2MT7KW"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/04/2019",
        "dateOfIncident": "08/26/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286877,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN ROGUE. WHILE THE GEAR SHIFTER WAS IN REVERSE, THE VEHICLE SHUT OFF AND THE KEY FAILED TO RELEASE FROM THE IGNITION. ADDITIONALLY, WHILE IN REVERSE, THE VEHICLE ACCELERATED. THE VEHICLE WAS TAKEN TO FAULKNER NISSAN JENKINTOWN (900 OLD YORK RD, JENKINTOWN, PA 19046, (215) 887-8870), BUT THEY WERE UNABLE TO DUPLICATE THE FAILURES. THE FAILURES RECURRED. WHILE THE VEHICLE WAS IN REVERSE, IT MOVED FORWARD. THE CONTACT STATED THAT THE BRAKE PEDAL WAS DEPRESSED TO THE FLOORBOARD, BUT THE VEHICLE FAILED TO RESPOND. THE CONTACT REMOVED THE KEY FROM THE IGNITION TO STOP THE VEHICLE. THE MANUFACTURER WAS CONTACTED AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 300. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/04/2019",
        "dateOfIncident": "11/29/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286982,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY ROGUE IN TO NISSAN AFTER I STARTED LOSING ACCELERATION. THE MECHANIC STATED A BREAK SENSOR WAS INCORRECTLY INSTALLED AND CAUSING THE CAR TO THINK BOTH THE ACCELERATOR AND BREAK WERE BEING APPLIED SIMULTANEOUSLY. THEY STATED THEY CORRECTED IT HOWEVER IT'S STILL  SPORADICALLY HAS ACCELERATION LOSE.",
        "vin": "KNMAT2MTXKP"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/03/2019",
        "dateOfIncident": "12/03/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286692,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TODAY  I NOTICED MY CAR SUDDENLY APPLIED BRAKE AND STOPPED FOR A SECOND, EVEN THOUGH THERE ARE NO VEHICLES IN FRONT. IT HAPPENED ON NORMAL STREET (W.PLANO PARK WAY, PLANO, TX).",
        "vin": "KNMAT2MT0KP"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/02/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286328,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN ROGUE. WHILE DRIVING 35 MPH, THE BRAKE WARNING MESSAGE ILLUMINATED ON THE INSTRUMENT PANEL. ON ANOTHER OCCASION, THE FAILURE RECURRED AND THE BRAKES APPLIED ON THEIR OWN. THE VEHICLE WAS TAKEN TO BURLESON NISSAN (LOCATED AT 300 N BURLESON BLVD, BURLESON, TX 76028, (817) 484-3500), BUT THEY WERE UNABLE TO DUPLICATE THE FAILURES. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS INFORMED OF THE FAILURES. *DL",
        "vin": "5N1AT2MV8KC"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/25/2019",
        "dateOfIncident": "10/26/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281153,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 NISSAN ROGUE. CONSUMER WRITES IN REGARD TO SAFETY RECALL NOTICE 19V-654 REAR VISIBILITY ISSUE. *AS    THE CONSUMER WAS UNABLE TO SEE OUT OF THE REAR WINDOW, AT TIMES DUE TO LARGE BUBBLES IN THE WINDSHIELD. THE CONSUMER STATED THE THERE WERE ACID RAIN SPOTS IN THE PAINT. THE DEALER AND MANUFACTURER WERE MADE AWARE OF THE FAILURE. *JS",
        "vin": "5N1AT2MT7KC"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/24/2019",
        "dateOfIncident": "11/22/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282063,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "SRS LIGHT WILL NOT GO OFF LIKE PAST ROGUE ISSUES",
        "vin": "5N1AT2MT6KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/22/2019",
        "dateOfIncident": "11/22/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281851,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN ROGUE. WHILE DRIVING 74 MPH WITH THE DYNAMIC CRUISE CONTROL ENGAGED, THE VEHICLE BRAKED INDEPENDENTLY WITHOUT THE BRAKE PEDAL BEING DEPRESSED. THE ACCELERATOR PEDAL WAS DEPRESSED UNTIL THE VEHICLE GAINED SPEED. THE VEHICLE WAS TAKEN TO TILTON-JAX NISSAN (3750 N HARRISON ST, DAVENPORT, IA 52806, (563) 241-7953) TO BE DIAGNOSED, BUT THE CAUSE OF THE FAILURE COULD NOT BE DETERMINED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED A CASE NUMBER. THE FAILURE MILEAGE WAS 1,800.",
        "vin": "5N1ET2MV7KC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/21/2019",
        "dateOfIncident": "08/05/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281664,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING THROUGH AIRPORT AND IT WAS AROUND 30 MILES PER HOUR. MY VEHICLE HAD APPLIED EMERGENCY BRAKES EVEN THOUGH THERE WAS NO VEHICLE IN FRONT AND IT HAPPEND TWICE WHEN I PASS THROUGH THAT AREA. MY VEHICLE WAS NOT HIT BY ANY OTHER VEHICLE BUT THIS FEELS MY VEHICLE IS VERY UNSAFE.",
        "vin": "5N1AT2MT7KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/19/2019",
        "dateOfIncident": "11/12/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281027,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IN THE HIGHWAY, SEVERAL TIME OVER THE LAST 2 WEEKS THE AUTOMATIC EMERGENCY BRAKING SYSTEM ENGAGES FOR NO REASON. THE WEATHER CONDITIONS WERE GOOD AND THERE WAS NOTHING IN FRONT OF ME.",
        "vin": "5N1AT2MV7KC"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "11/19/2019",
        "dateOfIncident": "10/05/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281031,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT'S PARENT OWNS A 2019 NISSAN ROGUE. ON SEVERAL OCCASIONS, WHILE THE VEHICLE WAS DRIVEN WITHOUT ANY VEHICLES IN CLOSE PROXIMITY, THE AUTOMATIC EMERGENCY BRAKING SYSTEM ACTIVATED INDEPENDENTLY. THE VEHICLE WAS TAKEN TO HUDSON NISSAN (585 NJ-440, JERSEY CITY, NJ 07305, (201) 345-3775), BUT WAS NOT DIAGNOSED. THE MANUFACTURER WAS CONTACTED AND PROVIDED CASE NUMBER: 37840475. THE APPROXIMATE FAILURE MILEAGE WAS 10,000.",
        "vin": "5N1AT2MVXKC"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/18/2019",
        "dateOfIncident": "11/15/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280943,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I TURNED MY CAR ON AND DROVE ABOUT 1 FOOT IN A PARKING LOT WITH NO CARS OR PEDESTRIANS IN FRONT OF ME  AND MY CAR JUST ROLLED TO A STOP, IT WAS A LITTLE SHAKY AND DIDN'T FEEL RIGHT. THE CAR WAS TOWED TO MY DEALER AND THEY FOUND NO ISSUES WITH THE CAR.  ALSO PRIOR TO THAT THE AUTOMATIC BRAKING LIGHT BLINKS RANDOMLY WHEN NO CARS OR PEDESTRIANS ARE IN FRONT  OF ME. THIS ALSO CONTINUES TO HAPPEN WHETHER I AM IN PARK OR DRIVE.",
        "vin": "5N1AT2MV2KC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/14/2019",
        "dateOfIncident": "11/13/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279967,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TWO SEPARATE OCCASIONS THE FEB (FORWARD EMERGENCY BRAKING) LIGHT HAS STARTED FLASHING WHILE JUST DRIVING DOWN THE ROAD WITH NO REASON TO COME ON. ONE TIME I WAS DRIVING ON A HIGHWAY IN HEAVY RAIN, JUST FIGURED IT BECAUSE OF THE ROAD CONDITIONS. OTHER TIME I WAS DRIVING ON A STREET, IT WAS ON A COLD NIGHT, BUT HAD PERFECT ROAD CONDITIONS AND I WAS THE ONLY ONE ON THE ROAD. BOTH OCCURRENCES HAPPENED WHILE DRIVING STRAIGHT FORWARD.",
        "vin": "5N1AT2MV5KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/12/2019",
        "dateOfIncident": "11/12/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279472,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ONE SUNNY DAY, DRIVING DOWN THE SERVICE ROAD, A CAR SLOWED TO TURN. I SLOWED, THERE WAS PLENTY OF ROOM BUT ALL OF A SUDDEN MY CAR MADE AN AWFUL NOISE AND STOPPED SUDDENLY (THERE WERE CARS BEHIND ME). THEN ONE MORNING, MY AUTOMATIC EMERGENCY BRAKING SYSTEM LIGHT STARTED BLINKING, IT STOPPED WHEN I GOT TO WORK. NOW, ANOTHER MORNING, NO OTHER CARS ON THE ROAD AS IT WAS 4:30 IN THE MORNING. THE ROADS WERE CLEAR/DRY. THE LIGHT STARTS BLINKING AGAIN. THIS TIME I STARTED LOOKING INTO IT AND HAVE SEEN NUMEROUS REPORTS OF THIS BEING A PROBLEM AND PEOPLES CARS SUDDENLY STOPPING FOR NO REASON  BUT YET THEY HAVEN'T FIXED THE PROBLEM OR ISSUED A RECALL?? THIS IS EXTREMELY DANGEROUS AND I'M NOT SURE WHY THIS HASN'T WARRANTED A RECALL. I REALLY HOPE I CAN GET THIS FIXED BEFORE I GET IN AN ACCIDENT OF GOD FORBID, KILLED BECAUSE MY CAR THINKS IT NEEDS TO STOP IN THE MIDDLE OF THE ROAD OR INTERSTATE.",
        "vin": "5N1AT2MV7KC"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/12/2019",
        "dateOfIncident": "08/28/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11279667,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY NEW NISSAN ROGUE HAS ONLY 356 MILES ON IT . UNIVERSAL NISSAN SOLD IT TO ME AND THE CAR'S COMPUTER SEEMS TO BE MALFUNCTIONING.  IT SEEMS TO BE A HARDWARE ISSUE AND NOT A SOFTWARE ISSUE AS THEY TRIED UPDATING THE SOFTWARE WITH NO SUCCESS.     THEY WERE UNABLE TO FIX THE AUTO SAFETY BRAKE.  IT DOES NOT WORK FOR FRONT PEDESTRIANS OR REAR PEDESTRIAN SAFETY.   THE VEHICLE ALSO DOES NOT APPLY THE BRAKES IN TIMES OF EMERGENCIES AS IT IS ADVERTISED TO DO SO.  I HAVE ALMOST BEEN KILLED IN THE CAR BECAUSE THE COMPUTER IS MALFUNCTIONING AND SPEEDING UP INSTEAD OF APPLYING THE BRAKES.  THE CAR IS A DEATHTRAP. I CONTACTED NISSAN CONSUMER AFFAIRS, THEY SAID I HAVE TO TALK TO THE DEALERSHIP.    I ALSO RECEIVED A MILD CONCUSSION WHEN THE LIFT-GATE SMASHED DOWN ON MY HEAD AFTER I WAS CHECKING OUT THE TRUNK.  THE LIFT-GATE WAS OPENING ON ITS OWN WHILE I WAS DRIVING ON THE FREEWAY.  WHEN I STOPPED TO CLOSE IT, IT CAME DOWN AND SMASHED ME IN THE HEAD BEFORE I EVEN ACTIVATED IT.     ALSO, THE CAR IS BURNING GAS QUITE RAPIDLY.  I AM GETTING LESS THAN 16 MILES TO THE GALLON, AND THIS IS MOSTLY FREEWAY DRIVING, EVEN THOUGH IT IS ADVERTISED AT 26 CITY, 31 HWY. .  UNIVERSAL NISSAN TOLD ME THAT I HAVE TO PUT HIGH LEADED PREMIUM GAS OR I WILL NOT GET GOOD MILEAGE, BUT I DON'T THINK THAT IS CORRECT.  THERE WAS ALSO A MYSTERIOUS FIRE BURN BENEATH THE CAR WHEN I PURCHASED IT.    I BROUGHT THE NISSAN ROGUE IN TO BE CHECKED BY UNIVERSAL NISSAN SERVICE, AND THEY KEPT THE CAR FOR FOUR DAYS.   THEY WERE UNABLE TO FIX THE CAR'S COMPUTER.     THE PRO-PILOT ASSIST STEERING CORRECTION, DOESN'T WORK BECAUSE NISSAN'S CUSTOM LEATHER STEERING WRAP FOR THIS MODEL OF ROGUE INTERFERES WITH THE STEERING CORRECTION, YOU HAVE TO CONSTANTLY SQUEEZE THE STEERING WHEEL TO THE POINT OF EXERTION.    I ASKED UNIVERSAL NISSAN TO REFUND MY MONEY, BUT THEY HAVE REFUSED .",
        "vin": "JN8AT2MT1KW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/07/2019",
        "dateOfIncident": "11/07/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278719,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY 2019 NISSAN ROGUE SV ON OCTOBER 23, 2019.  ON 10/25, 10/28, 10/29 AND 11/7 MY AEB (AUTOMATIC EMERGENCY BRAKING) LIGHT STARTED FLASHING.  I WAS NOT EVEN OUT OF MY DRIVE WAY BEFORE IT STARTED FLASHING ON TWO OCCASIONS, ON ONE OCCASION I WAS NOT 2 MILES DOWN A COUNTRY ROAD GOING APPROXIMATELY 50 MPH AND ON THE LAST OCCASION I WAS TRAVELING 75 MPH ON THE INTERSTATE WHEN IT JUST STARTED FLASHING AND FLASHED FOR ABOUT 5 MINS AND THEN STOPPED FLASHING.  THERE IS NOTHING AROUND IT TO SET IT OFF, I CONTACTED THE DEALERSHIP AND I AM STILL WAITING FOR A CALL BACK FROM THE SERVICE DEPARTMENT.      I AM AFRAID THIS FLASHING LIGHT MY LEAD TO SOMETHING WORSE.",
        "vin": "JN8AT2MVXKW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/04/2019",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278144,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN ROGUE. WHILE DRIVING THE VEHICLE INTO THE GARAGE, THE BRAKES ENGAGED INDEPENDENTLY. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT CALLED WOOD MOTOR CHEVROLET (LOCATED AT 600 US-62, HARRISON, AR 72601, (870) 455-4768) AND INFORMED THEM OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 6,100.",
        "vin": "JN8AT2MV6KW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/30/2019",
        "dateOfIncident": "10/30/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277114,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BREAKING ASSIST DIDN'T WORK AND I HAD A FENDER BENDER",
        "vin": "5N1AT2MV7KC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "10/30/2019",
        "dateOfIncident": "10/21/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11277195,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2019 NISSAN ROGUE. WHILE THE BRAKE PEDAL WAS DEPRESSED AT A FUEL STATION, THE ENGINE REVVED INDEPENDENTLY. AS THE ENGINE REVVED, THE VEHICLE ACCELERATED FORWARD INDEPENDENTLY AND CRASHED INTO A PARKED VEHICLE AND A BUILDING. IT WAS DISCOVERED THAT THE VEHICLE WAS TRAVELING 56 MPH WHEN THE FAILURE OCCURRED. THE ALL WHEEL DRIVE ERROR AND MALFUNCTION WARNING INDICATORS FLASHED ACROSS THE INSTRUMENT PANEL AFTER THE CRASH. THE AIR BAGS DID NOT DEPLOY. THE POLICE AND AMBULANCE ARRIVED ON THE SCENE. THE CONTACT'S MOTHER SUSTAINED INJURIES TO HER RIGHT ANKLE, RIGHT WRIST, AND EXPERIENCED WHIPLASH. THE CONTACT SUSTAINED INJURIES TO BOTH ANKLES, BOTH WRISTS, CLAVICLE, SHOULDER, AND ALSO EXPERIENCED WHIPLASH. BOTH OCCUPANTS RECEIVED MEDICAL ATTENTION. POLICE REPORT NUMBER: C201930703 WAS FILED. THE VEHICLE WAS TOWED TO AN INDEPENDENT TOW YARD AND THEN A SECOND WHERE THE INSURANCE COMPANY DEEMED IT DESTROYED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND WAS INFORMED THAT THE CONTACT'S MOTHER WOULD BE CONTACTED IN 3-5 BUSINESS DAYS. THERE WERE NO RECALLS RELATED TO THE CRASH. THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 19V654000 (BACK OVER PREVENTION), WHICH WAS NOT RELATED TO THE FAILURE. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE FAILURE MILEAGE WAS 8,100. *DT*DT*DT*JB",
        "vin": "5N1AT2MV0KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/29/2019",
        "dateOfIncident": "10/27/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11276925,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "8PM AND DARK BUT PERFECT WEATHER OTHERWISE, DRIVING AT 40MPH ON A 2 LANE ROAD WITH NO ONCOMING TRAFFIC THE VEHICLE APPLIED THE BRAKES SO AGGRESSIVELY BY ITSELF FOR NO REASON ABS WAS TRIGGERED BY TIRE SLIPPAGE.  WEIRDLY THE CAR DID NOT COME TO A COMPLETE STOP.  THE DISPLAY ALSO TURNED FROM RADIO STATION ID TO GPS MAP BY ITSELF.",
        "vin": "5N1AT2MV9KC"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/28/2019",
        "dateOfIncident": "10/26/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271455,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD AN ONGOING ISSUE WITH THE AES(AUTOMATIC BRAKING SYSTEM) INDICATOR LIGHT FOR ABOUT A MONTH.  IT STARTED WHEN I HAD 300 MILES ON MY CAR.  THE SENSOR WOULD RANDOMLY COME ON.  THE 1ST FEW TIMES, THE CAR WOULD SLIGHTLY BREAK WHEN THE SENSOR WOULD COME ON.  AFTER AWHILE THE SENSOR WOULD JUST COME ON(WHICH TURNS THE WHOLE SYSTEM OFF WHEN IT IS ON) RANDOMLY WITH NO BRAKING.  I HAVE TAKEN TO DEALERSHIP 3 DIFFERENT TIMES.  THEY HAVE REPROGRAMMED AND REPLACED THE SENSOR.  IT HAPPENED AGAIN.  THEY THEN WANTED ME TO MAKE SURE I PUT MY CAR IN GARAGE FOR A WEEK TO SEE IF IT WAS RELATED TO MOISTURE/FOG ON THE WINDSHIELD BEFORE THEY WOULD REPLACED THE FRONT CAMERA.  I HUMORED THEM AND DID THAT.  TO MY DISMAY, I DROVE IT AND IT GOT WORSE.  I WAS GOING DOWN A HIGHWAY AND RECEIVED FRONT RADAR FAILURE WARNING AND THE SAME INDICATOR CAME ON.  LATER, SAME DAY, I WAS GOING DOWN THE INTERSTATE PASSING A SEMI AND A VEHICLE BEHIND ME AND THE SAME ERROR.  THIS TIME IT KICKED THE CRUISE CONTROL OFF AND IMMEDIATELY SLOWED MY VEHICLE DOWN.  I WAS ALMOST HIT FROM BEHIND.  THIS IS A HUGE SAFETY ISSUE AND THE DEALERSHIP SHOULD HAVE JUST REPLACED THE DARN CAMERA WITHOUT ME HAVING TO TAKE THIS DEATH TRAP HOME.  THEY PROMISED ME I WAS AT NO RISK AND THEN THIS HAPPENED!",
        "vin": "JN8AT2MV5KW"
    },
    {
        "components": "PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "10/24/2019",
        "dateOfIncident": "02/15/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270610,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN ROGUE. THE CONTACT STATED THAT THE EMERGENCY BRAKE ACTIVATED INDEPENDENTLY WHILE DRIVING AT LOW SPEEDS. THE VEHICLE RESUMED NORMAL OPERATION AFTER THE FAILURE OCCURRED. THE CONTACT REACHED OUT TO CREST NISSAN (6600 TX-121, FRISCO, TX 75034, 972-704-1525) AND WAS INFORMED THAT THEY WOULD HAVE TO REPLICATE THE FAILURE TO DETERMINE THE CAUSE. THE MANUFACTURER HAD NOT BEEN NOTIFIED OF THE FAILURE. THE VEHICLE HAD NOT BEEN REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 3,000. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/24/2019",
        "dateOfIncident": "08/15/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270686,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON AUGUST 16, 2019, THE VEHICLE'S AUTOMATIC EMERGENCY BRAKING SYSTEM ENGAGED UNNECESSARILY AS I WAS DRIVING.  I WAS TRAVELING ON A HIGHWAY AT ABOUT 45-50 MILES PER HOUR.  THERE WERE NO OBSTACLES IN THE ROAD, AND NO OTHER VEHICLES, BRIDGES, RAILROAD TRACKS, OR LOW HANGING OBJECTS IN MY PATH.  I DID NOT HAVE AN ACCIDENT, BUT ONLY BECAUSE THERE WASN'T A CAR BEHIND ME AS I CAME TO A COMPLETE STOP IN MY LANE OF THE HIGHWAY.  PRIOR TO THIS INCIDENT, I HAD BEEN GETTING WARNING LIGHTS INDICATING THAT I WAS HAVING A MALFUNCTION WITH THE AUTOMATIC EMERGENCY BRAKING SYSTEM, AND TO SEE MY OWNER'S MANUAL.  SINCE THE INITIAL REPAIR (AUGUST 17-29, 2019), THE VEHICLE'S MALFUNCTION LIGHT HAS COME ON MULTIPLE TIMES.",
        "vin": "5N1AT2MV0KC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/16/2019",
        "dateOfIncident": "10/15/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11268832,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAD THE DRIVERS REAR TIRE GO FLAT ON THE HIGHWAY.   THEN THE PASSENGER SIDE AIRBAGS DEPLOYED  INJURING THE PASSENGER.   THERE WAS NO DAMAGE TO THE  VEHICLE  OTHER THAN THE AIRBAGS DEPLOYING FOR NO REASON!  TRAVEL SPEED WAS CLOSE TO 50MPH.   *DT*DT *TR    CONSUMER STATED HER HUSBAND HAD THE VEHICLE TOWED TO THE NEAREST NISSAN DEALERSHIP THE DAY AFTER THE INCIDENT OCCURRED .*JB*JB",
        "vin": "JN8AT2MT4KW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/16/2019",
        "dateOfIncident": "09/19/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269041,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A BRAND NEW 2019 ROGUE SV ON OCTOBER 15, 2019. I WAS INFORMED BY NISSAN CORP THAT MY CAR (GAVE THEM THE VIN NUMBER) WAS PART OF A RECALL CAMPAIGN FOR THE BACK UP CAMERA. ACCORDING TO THE DATA THIS IS UNREPAIRED. I FOUND THIS OUT TODAY, 10/16/2019, THE DEALERSHIP NEVER BOTHERED TO TELL ME ABOUT IT, AND I AM SURE THEY KNEW. LOOKS LIKE THIS RECALL CAME OUT ON 9/12/2019. SHOULDN'T THE DEALER HAVE FIXED THIS BEFORE SELLING IT TO SOMEONE?",
        "vin": "JN8AT2MT6KW"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/09/2019",
        "dateOfIncident": "10/03/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267327,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONSUMER OWNS A 2019 NISSAN ROGUE. THE CONSUMER STATED THAT WHILE DRIVING APPROXIMATELY 30 MPH, THE VEHICLE SUDDENLY STOPPED MOVING IN THE MIDDLE OF THE ROAD WITHOUT WARNING. THERE WERE NO OTHER VEHICLES IN THE VICINITY AT THE TIME OF THE FAILURE. THE CONSUMER STATED THAT THE ENGINE WAS STILL RUNNING DURING THE FAILURE. THE CONSUMER HAD TO FORCEFULLY DEPRESS THE ACCELERATOR PEDAL IN ORDER TO MOVE THE VEHICLE AND CONTINUE DRIVING. THE VEHICLE WAS NOT DIAGNOSED, BUT AN APPOINTMENT WAS SCHEDULED FOR OCTOBER 11, 2019 WITH AN UNKNOWN NISSAN DEALER. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 4,700. *BF   *AS",
        "vin": "JN1BJ1CRXKW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/08/2019",
        "dateOfIncident": "10/08/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267164,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN A 2 LANE HIGHWAY IN BROAD DAYLIGHT. THE AEB WARNING LIGHT KEPT BLINKING ON AND OFF AND SLIGHTLY BREAKING FOR SEVERAL MILES. IT FINALLY STOPPED BLINKING ON IT'S OWN WITHOUT ME HAVING TO STOP.  I HAVE VIDEO BUT COULD NOT UPLOAD.",
        "vin": "JN8AT2MV5KW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/07/2019",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266763,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS EQUIPPED WITH AUTOMATIC EMERGENCY BRAKING. AT 20MPH MY CAR HAS SLAMMED ON BREAKS WHEN THERE IS NO POTENTIAL COLLISION OR OBSTRUCTION PRESENT. THIS HAS HAPPENED ON SEVERAL OCCASION. LUCKLIY NO CAR WAS BEHIND ME AT THE TIME OR I WOULD A GOTTEN REAR ENDED  OTHERS IN VARIOUS FORUMS HAVE REPORTED THE SAME ISSUES WITH THIS PARTICULAR MODEL.",
        "vin": "JN8AT2MT1KW"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/06/2019",
        "dateOfIncident": "04/08/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266669,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "181 MILES ON CAR WARNING 'MALFUNCTION 'WARNING WITH CRASH SYMBOL GOING 40MPH ALSO EMERGENCY BRAKE SLAMMED ON BACKING UP LOUD STEEL GRINDING SOUND FELT LIKE HIT A BRICK WALL.  SONAR STAYED ON WHILE CAR WAS  OFF AND IN PARK",
        "vin": "JN8AT2MT7KW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/04/2019",
        "dateOfIncident": "10/04/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266198,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AT APPROXIMATELY 45 MPH ON A CLEAR DAY, ON A STRAIGHT ROAD.  ALL OF A SUDDEN THE BRAKES ENGAGED.  THERE WAS NO CAR IN FRONT OF ME.  I WAS ABLE TO GET THE BRAKES TO DISENGAGE BY STEPPING ON THE GAS.",
        "vin": "JN8AT2MV8KW"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/26/2019",
        "dateOfIncident": "09/20/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258440,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A NISSAN ROGUE SV AWD ON JULY 17,2019.  WHILE DRIVING BETWEEN 10-20 MPH I NOTICED THE CAR WOULD SPORADICALLY DECIDE NOT TO ACCELERATE AT ALL . I WOULD FLOOR THE GAS AND THE RPM GAUGE WOULD NOT REGISTER NOR WOULD THE CAR ACCELERATE . THIS ALSO OCCURRED WHILE COASTING THROUGH EZ PASS TOLLS ON THE GARDEN STATE PARKWAY! IMAGINE BEING IN THE LEFT OR MIDDLE LANE AND UNABLE TO ACCELERATE ON HIGHWAYS FROM 20 MPH ! IT ALSO OCCURRED WHILE PULLING ONTO HIGHWAYS AND DRIVING ROUNDABOUTS . NO LIGHTS ON DASHBOARD INDICATE WHAT WAS GOING ON . I CALLED NISSAN ON SEPTEMBER 20,2019 AND TOOK THE EARLIEST APPT SEPTEMBER 23,2019.  I WAS FIRST TOLD THAT AFTER THEY DRIVE MY CAR TEN MILES THEY COULDN'T REPLICATE WHAT OCCURRED SO I COULD TAKE IT HOME . I REFUSED AND SAID THAT WAS UNACCEPTABLE AS THE CAR WAS DANGEROUS. I TOLD THEM TO KEEP IT AND FIND OUT WHAT WAS WRONG. THEY CALLED LATE THAT AFTERNOON AND SAID THEY FOUND I NEEDED A STOP LAMP SWITCH . I WAS TOLD THAT THE CAR 'THOUGHT' I WAS BRAKING AND WOULD NOT LET ME ACCELERATE. I SAID THAT'S DANGEROUS AND OUTRAGEOUS! THEY SAID THE LAME SWITCH HAD INTERMITTENT INTERNAL FAILURE . WHEN I ASKED ( AFTER RESEARCHING IT) THAT THECAR MIGHT NEED TO BE REPROGRAMMED? THEY SAID NO . MY CAR IS BRAND NEW AND UNDER WARRANTY. THIS SITUATION SHOULD NEVER OCCUR IT CAN CAUSE SERIOUS INJURIES TO ALL . PLEASE ISSUE A RECALL REGARDING THIS ! THE CAR WAS GIVENBACK TO ME ON SEPTEMBER 25.2019. I'M WORRIED ABOUT MY SAFETY WHILE DRIVING IT .",
        "vin": "KNMAT2MV2KP"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/23/2019",
        "dateOfIncident": "09/22/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257459,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AT APPROXIMATELY 25 MPH WITH MY FOOT ON THE GAS PEDAL WHEN THE CAR BEGAN TO AUTOMATICALLY BRAKE AND MADE A GRINDING NOISE.  THE AUTOMATIC BRAKING LASTED FOR A FEW SECONDS.  IT WAS A CLEAR SUNNY DAY WITH NO CARS IN FRONT OF ME AND NOTHING IN THE ROADWAY.",
        "vin": "JN8AT2MVXKW"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/20/2019",
        "dateOfIncident": "09/09/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256877,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE OWNER OF A 2019 NISSAN ROGUE AND I HAVE LEARNED THAT THIS SUV (AND PERHAPS OTHER NISSANS AS WELL)  ONLY HAS 4 QUIET CHIMES THAT SOUND WHEN STARTING UP THE CAR TO REMIND THE DRIVER AND PASSENGERS TO BUCKLE UP. THERE IS NO AUDIBLE CHIME AFTER THAT SHOULD ANYONE NOT BUCKLE UP. ONLY A VISUAL ICON BURIED IN THE DASHBOARD PANEL SHOWS THE SEATBELT(S) HAVE NOT BEEN ENGAGED.     SO FOR EXAMPLE IF THE DRIVER OR PASSENGER DO NOT ENGAGE THEIR SEAT BELTS, THEIR DRIVE WHETHER AROUND THE CORNER TO A NEIGHBORHOOD STORE OR A 200 MILE JOURNEY TO VISIT FRIENDS WILL RESULT IN NO AUDIBLE REMINDER TO THE CAR PASSENGERS. THEY WILL NOT HAVE THEIR SEATBELTS ON FOR THEIR TRIP UNLESS THE DRIVERS NOTICES THE ICON AND REMINDS THEM.    ADDITIONALLY IF YOU ARE DRIVING ON A HIGHWAY AND DISENGAGE YOUR SEATBELT, (TO REACH FOR YOUR WALLET, CELL PHONE, KEYS) THERE IS NO AUDIBLE CHIME TO REMIND THE DRIVER OR PASSENGER TO (RE)BUCKLE UP.    I HAVE SPOKEN TO SERVICE AT NISSAN AND NISSAN CORPORATE AND THEY SEE NO PROBLEM WITH THIS.   I FIND THIS TO BE A DERELICTION OF SAFETY ON THE PART OF NISSAN AND FEEL THEY NEED TO RECALL THEIR CARS, AND INSTALL AN AUDIBLE CHIME WHENEVER THE CAR IS IN MOTION AND PASSENGERS ARE NOT WEARING THEIR SEATBELTS.   THERE ARE TOO MANY DISTRACTIONS BUILT INTO OUR LIVES, AND NOT HAVING THIS SAFETY BELT REMINDER CAN AND WILL CAUSE MANY INJURIES FOR NISSAN AUTOMOBILE DRIVERS.   THANK YOU FOR YOUR ATTENTION TO THIS MATTER.",
        "vin": "5N1AT2MT7KC"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/16/2019",
        "dateOfIncident": "08/16/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255520,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL:I PURCHASED MY 2019 NISSAN ROGUE MAY 31, 2019 FROM CLAY COOLEY NISSAN. TWO MONTHS AGO WHILE DRIVING BACK TO WORK MY NISSAN ROGUE AUTOMATICALLY BRAKED; A MONTH LATER MY BLIND SPOT SENSORS FAILED TO COME ON RESULTING IN A WRECK. I HAVE PAID OUT OF POCKET A $1000 DEDUCTIBLE BECAUSE I ASSUMED THERE WAS A GLITCH WITHIN MY CAR. WHILE WATCHING GMA I HAVE LEARNED ABOUT THE RECALL.",
        "vin": "5N1AT2MT1KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/16/2019",
        "dateOfIncident": "07/13/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255706,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO MY NAME IS [XXX] I BOUGHT A NISSAN ROGUE 2019 SL AWD AND SOMETIMES I DRIVE IT HAS STOPPED ME IF THERE IS A CAR IN FRONT.  THERE ARE ONLY 3 TIMES THAT HAVE HAPPENED TO ME BUT I HAD NOT PAID ATTENTION, BUT SEEING THE NEWS THIS WEEK I AM VERY WORRIED ABOUT MY SAFETY, AND THAT OF MY FAMILY I HOPE YOU CAN SOLVE THIS PROBLEM VERY SOON, THANKS FOR YOUR GREAT  JOB..    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "5N1AT2MVXKC"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/13/2019",
        "dateOfIncident": "08/09/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255339,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A NISSAN ROUGE 2019 AND I HAD RPM TOO HIGH (2500) IN SLOW MOTION. ALSO WHEN I WAS IN A HIGHWAY THE SUV STOP AND TURN A LIGHT THAT SAID WARNING MAL FUNCTION. THE SYMBOL THAT APPEARED WAS TWO CARS CRASHING .(SISTEMA DE FRENADO AUTOMTICO). OTHERS CARS ALMOST HIT ME FROM BEHIND. THIS SITUATION OCCURRED SIX TIMES.I HAD TO CALL A TOW TO CARRY MY SUV TO THE DEALER.  MY ROUGE NISSAN 2019 ONLY HAS 476 MILLES. MY NISSAN ROUGE 2019 IS IN THE DEALER FROM AUGUST 12 TO THE PRESENT. THE DEALER PEPE ABAD NISSAN CAYEY PUERTO RICO DID NOT HAVE A DIAGNOSIS ABOUT WHAT CAUSED THIS SITUATION IN MY SUV. I REQUESTED A NEW SUV BECAUSE THEY SOLD ME A DAMAGED SUV. I AM AFRAID ABOUT THAT. I AM DESPERATED BECAUSE OF THE RISK OF HAVE AN ACCIDENT AND CAUSE DAMAGED TO OTHER PERSONS. ALSO,  IAM PAYING FOR SOMETHING DAMAGED THAT THE DEALER SOLD ME  AS NEW AND THAT IS NOT FEAR.",
        "vin": "5N1AT2MT6KC"
    },
    {
        "components": "ENGINE",
        "crash": true,
        "dateComplaintFiled": "09/05/2019",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253321,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR VEHICLES ENGINE QUIT WORKING IN THE CENTER LANE OF A 3 LANE CITY STREET AFTER GIVING OUT A JERKY, VIBRATORY MOVEMENT BRIEFLY. AFTER FEW ATTEMPTS OF TRYING TO RESTART, TURNED ON THE HAZARD LIGHT AND GOT DOWN FROM THE VEHICLE TO CALL THE TOWING COMPANY.  DURING WHICH TIME, AT LEAST 3 CARS RECOGNIZED THE VEHICLE IS STATIONARY AND TOOK A DIVERSION WHILE A TOYOTA TUNDRA DID NOT SEE AND STRUCK THE VEHICLE, WHICH FLEW FEW YARDS AWAY IN THE STREET. THANKFULLY NO ONE WAS HURT.  WE ARE AT A LOSS AS TO WHAT HAPPENED TO THIS BRAND NEW 3 MONTH OLD VEHICLES ENGINE TO STOP ABRUPTLY.  SINCE THE TEMPERATURE WAS HIGH IN 110S, ME AND MY HUSBAND GOT OFF THE CAR, IF NOT WE WOULD HAVE BEEN INSIDE  THE CAR AND WOULD NOT BE ALIVE AT THIS TIME.  THIS WAS A SCARY EVENT THAT NEEDS EXPLANATION",
        "vin": "5N1AT2MT7KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/31/2019",
        "dateOfIncident": "08/29/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252574,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MAKING A RIGHT HAND TURN AT A BUSY INTERSECTION WITH A GREEN LIGHT, GOING APPROXIMATELY 10 MPH THE CAR SUDDENLY BRAKED WITHOUT WARNING. BRAKE PEDAL SLAMMED TO THE FLOOR BRINGING THE CAR TO A COMPLETE STOP. NO OBJECT OR PERSON IN FRONT OF, OR NEAR THE CAR, NEITHER WAS THERE ONE BEHIND ME, THANK GOODNESS. THE INCIDENT LEFT ME SHAKING IN MY SEAT. NOW FEARFUL OF DRIVING MY CAR.",
        "vin": "JN1BJ1CR2KW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/22/2019",
        "dateOfIncident": "08/20/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245891,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 NISSAN ROUGE AEB BRAKE SYSTEMS ENGAGES WITHOUT NOTICE ON SEVERAL OCCASIONS.  I WAS DRIVING THRU A PARKING LOT DURING THE DAY AND IT ENGAGED AND AT NIGHT AND ON A CLOUDY DAY ON A STREET.  TOOK IT TO THE DEALERSHIP THEY INDICATE THAT THERE IS NOT A PROBLEM AND THE CAR IS SAFE BECAUSE THEY COULD NOT REPLICATE THE ACTION.  THE CAR HAS PROBLEMS I DO NOT KNOW WHY THEY CANNOT REPLICATE IT BUT IT DOES BRAKE ON ITS OWN.",
        "vin": "5N1AT2MV6KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/19/2019",
        "dateOfIncident": "08/16/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245035,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING IN A PARKING RAMP WITH NO OBSTRUCTIONS VISIBLE, MY CAR STOPPED AFTER THE AEB WAS ACTIVATED. THERE WAS A LOUD NOISE AND THE CAR STOPPED EVEN THOUGH I HAD MY FOOT ON THE GAS. AFTER IT CAME TO A STOP, IT STARTED AGAIN. THE CAR IS CURRENTLY AT THE DEALERSHIP BEING LOOKED AT.     THIS IS A COUPLE WEEKS AFTER MY CAR HAD AN ERROR WITH THIS SYSTEM POP UP WHEN I WAS DRIVING ON THE EXPRESSWAY.",
        "vin": "5N1AT2MV5KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/16/2019",
        "dateOfIncident": "08/16/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244550,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "EMERGENCY BRAKING SYSTEM SLAMMED BRAKES ON CAR GOING 10 MPH DOWN A PAVED ROAD IN GOOD WEATHER CONDITIONS.  THIS IS THE SECOND TIME AND MY CAR ONLY HAS 1400 MILES.",
        "vin": "5N1AT2MT1KC"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/12/2019",
        "dateOfIncident": "08/10/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243414,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAMERA THAT CONTROLS THE AUTOMATIC BREAKING SYSTEM AS WELL AS THE LANE WARNINGS KEEPS SAYING THERE IS AN OBSTRUCTION BUT THERE ISN'T ONE. I OWNED THE VEHICLE ABOUT 1 HOUR WHEN THE WARNING LIGHT APPEARED AND THEY SAID IT WAS A SIMPLE SOFTWARE UPDATE BUT NOW THEY ARE SAYING IT NEEDS A NEW SENSOR. I WANT TO RETURN THE CAR BUT I AM IN NH WHERE THERE IS NO COOLING OFF PERIOD. I AM AFRAID THIS IS GOING TO BE AN ONGOING ISSUE AFTER READING HERE, PLEASE ADVISE",
        "vin": "5N1AT2MV5KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "08/08/2019",
        "dateOfIncident": "08/06/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242474,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN THE PARKING LOT OF A HOME DEPOT. I TURNED RIGHT INTO AN AISLE WHERE THERE WERE AVAILABLE SPACES. AS I APPROACHED A SPOT I TOOK MY FOOT OFF THE ACCELERATOR TO LET THE CAR SLOW DOWN ON ITS OWN AND RESTED MY FOOT ON THE BRAKE PEDAL GETTING READY TO APPLY THE BRAKE TO BRING IT TO A FULL STOP ONCE I WAS IN THE PARKING SPACE. AS I APPROACHED TO SPACE THE CAR RESPONDED PROPERLY BY  SLOWING DOWN.   I TURNED LEFT WITH MY FOOT RESTING ON THE BRAKE LIGHTLY PRESSING DOWN GETTING READY TO FULLY APPLY THE BRAKE FOR THE FINAL STOP. HOWEVER, AS I PRESSED THE BRAKE  THE CAR KEPT ROLLING AHEAD ON ITS OWN. I THEN  PRESSED THE BRAKE PEDAL HARDER AND HARDER BUT THE CAR KEPT ROLLING AND I PRESSED WITH ALL MY STRENGTH ON THE BRAKE PEDAL BUT IT KEPT ROLLING, NOT STOPPING UNTIL IT HIT THE PARKED CAR IN FRONT.  THERE WAS NO BRAKING POWER AT ALL.  IT APPEARED THERE WAS LITTLE DAMAGE TO THE OTHER CAR, JUST SOME SCRATCHES AND INDENTING OF THE AREA BELOW THE TRUNK LID. MY CAR WAS DAMAGED IN THE RIGHT FRONT FENDER AREA WITH SOME BENDING AT THE HEADLIGHT AREA. THE FENDER IS ALSO MISALIGNED WITH THE HOOD.  ALTHOUGH WE DROVE IT HOME, PUTTING IT IN NEUTRAL WHENEVER WE WERE SLOWING DOWN AND APPLYING THE BRAKES WE WILL NOT DRIVE THIS CAR EVER AGAIN. WE WILL HAVE IT TOWED TO THE DEALER. THE CAR IS EQUIPPED WITH AUTOMATIC FRONT BRAKING, WHICH OBVIOUSLY DIDN'T FUNCTION AND IT SEEMS TO HAVE OVERRIDDEN MY ATTEMPT TO MANUALLY APPLY THE BRAKES. WE WILL HAVE IT TOWED TO THE DEALER AND WANT NISSAN TO REFUND OUR MONEY. THE CAR IS ABOUT TWO MONTHS OLD WITH ONLY A COUPLE OF THOUSAND MILES ON IT. AT PURCHASE THE SALESMAN SAID THERE WERE THE EQUIVALENT OF 17 LAPTOP COMPUTERS IN THE CAR. MAYBE THEY SHOULD HAVE LESS ELECTRONICS AND MORE RELIABILITY.",
        "vin": "5N1AT2MV2KC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/07/2019",
        "dateOfIncident": "05/25/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242320,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WE BOUGHT A BRAND NEW 2019 NISSAN ROGUE AT THE END OF MAY 2019. IT HAS BEEN IN THE SHOP FOR OVER 20 DAYS SINCE WE BOUGHT IT. CURRENTLY IT HAS BEEN IN THE SHOP FOR OVER 2 WEEKS. THEY DON'T KNOW WHAT'S WRONG WITH IT. WE HAVE ONLY MADE ONE PAYMENT ON IT. IT RUNS WITHOUT THE KEY IN THE IGNITION. YOU CAN LITERALLY DRIVE IT DOWN THE ROAD WITH NO KEY IN THE IGNITION. WHAT IS TO KEEP IT FROM POSSIBLY BEING STOLEN? ONCE WE GET IT TURNED OFF, BY OPENING DRIVER DOOR AND TURNING WINDSHIELD WIPERS ON, WE CAN'T GET IT TO START AGAIN WITHOUT TURNING ON WINDSHIELD WIPERS. AFTER THE CAR HAS BEEN OFF FOR A BIT AND PARKED, ALL OF THE INTERIOR COMPONENTS COME ON... AC, RADIO, LIGHTS, ETC. THIS RUNS THE BATTERY DOWN. THE WINDSHIELD WIPERS COME ON OFF WHILE DRIVING AND THEN GET STUCK IN THE MIDDLE OF WINDSHIELD AND YOU CAN'T GET THEM BACK ON TO MOVE THEM OUT OF YOUR LINE OF SIGHT. ALL OF THIS IS DISTURBING!!! WHAT IF THE VEHICLE JUST DECIDES TO STOP RUNNING WHILE SOMEONE IS DRIVING IT OR THE BRAKES GO OUT? ANYTHING CATASTROPHIC COULD HAPPEN AT THIS POINT; WHEN THE MANUFACTURER HAS NO CLUE, WHAT IS WRONG WITH THE VEHICLE OR HOW TO FIX IT.... I WILL NEVER TRUST THE VEHICLE. THEY ORDERED 2 BCM COMPUTERS, BUT COMPUTERS DON'T RECOGNIZE OR RESPOND TO THE CAR.... THEY SPENT 8 HOURS YESTERDAY TRACING ALL WIRING AND FOUND NO BREAKS IN ANY OF THE WIRES. I HAVE PUT IN A REQUEST FOR THEM TO BUY THE CAR BACK, BUT THAT'S \"UNDER REVIEW\".... THEY ARE NOW TRYING TO FIGURE OUT WHICH OF THE 16 MODULES ARE FAULTY. ... THE FIRST TIME IT WAS TAKEN TO THE DEALERSHIP FOR THIS ISSUE, IT ONLY HAD 285 MILES ON IT. THE DEALERSHIPS HAVE PHYSICALLY WITNESSED ALL OF THIS AND I HAVE SEVERAL VIDEOS.",
        "vin": "5N1AT2MT9KC"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/05/2019",
        "dateOfIncident": "08/05/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241754,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE SECOND TIME IT HAPPENED, THE AUTO-BRAKING SYSTEM ENGAGED WHILE I WAS DRIVING THROUGH THE PARKING GARAGE AT MY WORK. I WAS GOING AROUND 5MPH AND NOTHING WAS IN FRONT OF ME.  THE CAR STARTED BEEPING (WARNINGS) AND THEN IT SLAMMED ON THE BRAKES.    I'VE ONLY HAD THE CAR SINCE JUNE 15, 2019.  IT HAPPENED FIRST ON JUNE 27. THE DEALERSHIP SAID THAT IT HAPPENED BECAUSE THE COUPLERS WENT OUT ON MY BACK WHEELS (ON A NEW CAR).   IT HAPPENED AGAIN, THIS MORNING ON 8/5/19. THE DEALERSHIP IS TRYING TO SEND ME ELSEWHERE FOR SERVICE SINCE I AM AN UNHAPPY CUSTOMER AND THEY DON'T WANT TO DEAL WITH ME.",
        "vin": "5N1AT2MV2KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/01/2019",
        "dateOfIncident": "07/28/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241005,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AROUND 500 MILES INTO MY LEASE, MY NISSAN STOPPED ME WHILE I WAS DRIVING DUE TO THE AUTOMATIC EMERGENCY BRAKING SYSTEM ENGAGING. THERE WAS NOTHING AROUND TO BRAKE. I TOOK MY CAR TO THE DEALERSHIP AND THEY REPLACED THE SENSORS. NOW AROUND 4200 MILES, I WAS DRIVING ON AN EXPRESSWAY IN THE RAIN AND MY CAR PRODUCED AN ERROR \"FRONT RADAR UNAVAILABLE DUE TO OBSTRUCTION\". I TOOK IT BACK TO THE DEALERSHIP AND THEY TOLD ME I HAD BUG DUST THAT WAS MESSING WITH THE SENSORS. THEY CLAIMED THERE IS A SERVICE BULLETIN THAT STATES RAIN, SNOW, FROST, BUGS AND PARKING GARAGES CAN CAUSE THE AUTOMATIC EMERGENCY BRAKING SYSTEM TO MALFUNCTION. I DO NOT FIND THIS ACCEPTABLE ESPECIALLY SINCE THIS CAR HAS ALREADY STOPPED ME WHILE I WAS DRIVING FOR NO REASON. I HAVE TO FIGHT THE DEALERSHIPS TO EVEN LOOK AT IT AND THEN AFTER A COUPLE DAYS, THEY TELL ME IT IS \"BUG DUST\" (LITERALLY WHAT THEY TOLD ME). I LIVE IN MN.... I CANNOT AVOID RAIN, SNOW, BUGS OR FROST. THE SENSORS ARE TOO SENSITIVE FOR EVERYDAY DRIVING.",
        "vin": "5N1AT2MV5KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/31/2019",
        "dateOfIncident": "07/31/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240799,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS GOING DOWN THE HIGHWAY AND MY CAR BRAKED FOR NO REASON.  VERY UNSAFE AS THEIR WERE CARS BEHIND ME.",
        "vin": "5N1AT2MT1KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/30/2019",
        "dateOfIncident": "07/30/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240732,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS TRAVELLING DOWN THE ROADWAY ON I-94 EAST IN MY LANE AT APPROXIMATELY 40 MPH.  THE VEHICLE IN FRONT OF ME WAS OVER 2 CAR LENGTHS AWAY AND WE WERE BOTH SLOWING DOWN DUE TO TRAFFIC.  AT NO TIME DID THE VEHICLE IN FRONT OF ME GET CLOSER THAN 15 FEET WHEN MY ROGUE INTELLIGENT BRAKING SYSTEM ACTIVATED AND CAUSED ME TO STOP UNCONTROLLABLY WITH A NEAR MISS TO A VEHICLE BEHIND ME.  BOTH INDICATOR LIGHTS ON THE DASH SHOWED IMPACT WITH OBJECT AND IMPACT WITH VEHICLE.  THE SYSTEM ALLOWED ME TO CONTINUE TRAVEL AFTER MY VEHICLE CAME TO A COMPLETE STOP.  I DEACTIVATED THE EMERGENCY BRAKING AND CONTINUED TO MY DESTINATION.",
        "vin": "JN8AT2MVXKW"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/11/2019",
        "dateOfIncident": "05/23/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231075,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON THE HIGHWAY 4 DAYS AFTER BOUGHT 2019 ROGUE AND MY ACCELERATION WENT DOWN, BRAKES CAME ON AND WARNING/MALFUNCTION \"SYMBOL;\" WENT TO DEALER AND ADVISED \"KNOWN SENSOR ISSUE WHERE DETECT CAMERAS AUTOMATICALLY APPLY BRAKES SENSING DRIVER ABOUT TO HIT SOMETHING\" WAS NEVER DISCLOSED SUCH A HAZARD WAS POSSIBLE. FEEL UNSAFE AS DRIVE ON HIGHWAY CONSTANTLY.",
        "vin": "5N1AT2MT2KC"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "07/10/2019",
        "dateOfIncident": "05/12/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230667,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN ROGUE. WHILE DRIVING VARIOUS SPEEDS, THE AUTO EMERGENCY BRAKING SYSTEM ERRONEOUSLY ACTIVATED AND CAUSED THE VEHICLE TO ABRUPTLY DECELERATE ALTHOUGH A SECOND VEHICLE WAS NOT PRESENT AHEAD. THE VEHICLE WAS TAKEN TO HAMILTON NISSAN (1929 DUAL HWY, HAGERSTOWN, MD), BUT THE CAUSE OF THE FAILURE WAS NOT DETERMINED. AFTER CONSULTING WITH BOTH THE MANUFACTURER AND THE DEALER, THE CONTACT WAS INFORMED THAT THE EMERGENCY BRAKING SYSTEM COULD ERRONEOUSLY ACTIVATE WHILE DRIVING IN THE RAIN, SNOW, OR WHILE DRIVING UNDER A BRIDGE. THE FAILURE MILEAGE WAS 3,700. THE VIN WAS INVALID.",
        "vin": "JN1BJ1CR9KW"
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "07/03/2019",
        "dateOfIncident": "06/26/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11229164,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT RENTED A 2019 NISSAN ROGUE. WHILE DRIVING APPROXIMATELY 6 MPH AND MAKING A RIGHT TURN, THE FRONT PASSENGER SIDE AXLE FRACTURED. AS A RESULT, THE DRIVER LOST CONTROL OF THE STEERING AND CRASHED INTO A PARKED VEHICLE. THE DRIVER SUSTAINED MUSCLE SPASMS AND AN INJURED BACK. MEDICAL ATTENTION WAS NOT RECEIVED. A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS TOWED FROM THE SCENE. THE VEHICLE WAS NOT DIAGNOSED TO DETERMINE THE CAUSE OF THE FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE LOCAL DEALER WAS NOT CONTACTED. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 1,656. *BF*JB",
        "vin": ""
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/03/2019",
        "dateOfIncident": "06/20/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229294,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD THE CAR FOR 13 DAYS, I WAS DRIVING THRU A PARKING GARAGE, GOING LESS THAN 10MPH, THE AUTO BRAKING SYSTEM ENGAGED FOR NO REASON. SLAMMING THE BRAKES ON THE CAR, HARD, AND SEVERAL WARNING ALERTS WENT OFF. DEALERSHIP SAYS THE COMPUTER ISNT SHOWING ANYTHING.  ALSO, SOMETHING WAS/IS GOING ON WITH THE REAR AXLE (WEIRD CLUNKING SOUNDS WHEN I TURN) DEALER REPLACED \"SOMETHING\" BUT HASN'T GIVEN ME A FULL EXPLANATION OF WHAT IT WAS AND DIDNT ASK MY PERMISSION TO WORK ON THE CAR.",
        "vin": "5N1AT2MV2KC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/02/2019",
        "dateOfIncident": "06/27/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228994,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN A LOCAL STREET AT APPROXIMATELY 30 MPH AND THE CAR SUDDENLY STOPPED (AUTOMATICALLY BRAKE).  THIS HAPPENED ON TWO OCCASIONS.  I DISCOVERED THAT THE GEAR STICK SHIFT MOVES FROM DRIVE TO NEUTRAL WITHOUT DEPRESSING THE TRIGGER BUTTON ON THE GEAR STICK AND MAY BE THE CAUSE OF THE PROBLEM.  I LEARNED THAT YOU HAVE TO DEPRESS THE TRIGGER BUTTON TO SHIFT FROM PARK TO REVERSE AND REVERSE TO PARK, BUT NOT TO SHIFT FROM REVERSE TO NEUTRAL, NEUTRAL TO DRIVE OR DRIVE TO NEUTRAL.  I BELIEVE THAT THIS IS A SAFETY HAZARD THAT COULD RESULT IN A TRAGIC ACCIDENT, ESPECIALLY ON A HIGHWAY AT HIGH SPEEDS.",
        "vin": "JN8AT2MV2KW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/30/2019",
        "dateOfIncident": "06/28/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228493,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2 INCIDENTS HAVE OCCURRED IN WHICH THE AUTO EMERGENCY BRAKE SYSTEM ENGAGED  WITH NO OBSTRUCTION IN MY PATH SINCE I PURCHASED THIS VEHICLE ON 6/8/19  1ST INCIDENT WAS 6/13/19 I WAS ENTERING A PARKING GARAGE THERE WERE NO VEHICLES IN MY PATH ONLY A PEDESTRIAN ON THE SIDEWALK NOT NEAR MY VEHICLE, THE AUTO BRAKE ENGAGED AND STOPPED MY VEHICLES ABRUPTLY.  2ND INCIDENT TOOK PLACE 6/28/19 IN SAME PARKING GARAGE ON 2ND LEVEL WHILE DRIVING DOWN ROW OF VEHICLES, NO VEHICLES WERE IN MY PATH, ONLY A PEDESTRIAN AGAIN ON THE SIDEWALK AND WELL AWAY FROM MY VEHICLE, EMERGENCY BRAKE AUTO ENGAGED STOPPING MY VEHICLE ABRUPTLY. BOTH INCIDENTS I WAS DRIVING APPROX 10 MPH.",
        "vin": "1N4AL3AP3FN"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/27/2019",
        "dateOfIncident": "06/20/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222858,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING AT APPROX. 38 MILES PER HOUR, ON SUBURBAN STREET, WITH NO PEDESTRIANS, OBSTACLES, HAZARDS OR OTHER VEHICLES. I WAS TRAVELING IN A STRAIGHT LINE, AND THE CAR BRAKED AUTOMATICALLY WITHOUT ANY PROVOCATION. THE BRAKING WAS SO EXTREMEN, THAT IT BROUGHT  THE CAR TO A HALT IMMEDIATELY.  THIS HAPPENED 2 TIMES WITHIN 2 MONTHS. THE MOST RECENT OCCURENCE WAS JUN 20, 2019. I CALLED THE DEALER AND THEY WERE LESS THAN HELPFUL.",
        "vin": "JN1B31CR4KW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/26/2019",
        "dateOfIncident": "05/17/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222807,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SHOWS 25 TO 32 MPG. UPON PURCHASE RECEIVED 23 MPG ON FLAT HIGHWAY CONTACTED DEALERSHIP WENT BACK IN THEY SAID IT WAS MISSING AN ENGINE UPDATE. WHILE IT WAS IN THE SHOP THEY GAVE A LOANER 2018 ROGUE IT WAS GETTING AN AVERAGE OF 28 MPG IN THE CITY. MY ROGUE WAS DELIVERED BACK TODAY DECLARED FIXED TEST RUN ON THE HIGHWAY MAX MPG IS 25.6. NO PAPERWORK WAS GIVEN ON THE SO CALLED ENGINE UPDATE OR SERVICE PROVIDED.",
        "vin": "5N1AT2MV0KC"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/13/2019",
        "dateOfIncident": "06/13/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219900,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT 2019 NISSAN ROGUE SPORT BRAND NEW ONLY 12 MILES. LESS THAN 1 WEEK LATER, MALFUNCTION WARNING POPPING UP REGARDING AEB AND COLLISION ALERT SYSTEM. HAS OCCURRED 3X IN JUST THE WEEK WHILE DRIVING.",
        "vin": ""
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "05/29/2019",
        "dateOfIncident": "04/06/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11210736,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING A RENTAL VEHICLE, 2019 NISSAN ROGUE, 65 MPH AND WHEN I APPLIED THE BRAKES THEY FAILED, CAUSING ME TO GO ACROSS THE INTERSECTION, THROUGH A FENCE, INTO A DITCH.  THE FRONT END WAS TOTALED. THE AIRBAGS DID NOT DEPLOY.  THE 4 WHEEL DRIVE TOOK OVER AND THE CAR PULLED ITSELF OUT OF THE DITCH EVENTUALLY STOPPING IN A FIELD JUST PRIOR TO GOING OVER AND EMBANKMENT AND INTO A RIVER. ACCORDING TO THE POLICE OFFICER THAT ARRIVED AT THE SCENE, THE BRAKES OF THE VEHICLE WERE PRESSED ALL THE WAY TO THE FLOOR OF THE VEHICLE, ALTHOUGH HE DID NOT ENTER THIS INTO THE WRITTEN REPORT.  HE DID VERBALIZE THAT TO ME ON THE PHONE THE DAY FOLLOWING THE ACCIDENT.  THERE WERE NO SKID MARKS ON THE ROAD INDICATING THAT THE VEHICLE TRIED TO STOP.  I WAS GOING THE SPEED LIMIT OF 65 MPH.  I SUSTAINED 2 FRACTURES OF MY BACK, A CONCUSSION AND A LARGE LACERATION OF MY FOREHEAD.  THE VEHICLE IS CURRENTLY IN STORAGE AND HAS NOT BEEN INSPECTED, YET.  THE COMPUTER OF THIS VEHICLE TOOK OVER AND DROVE ITSELF.  I WAS TAKEN TO A NEARBY TRAUMA CENTER AND ADMITTED FOR 2 DAYS. *DT*JB    CONSUMER STATED THE AIRBAG DID NOT DEPLOY AND THERE WERE NO SKID MARKS ON THE ROAD. CONSUMER ALSO STATED THAT WHEN THE POLICE OFFICER EXAMINED THE VEHICLE THE BRAKE PEDAL WAS PRESSED ALL THE WAY THE FLOOR. PLEASE NOTE THAT I AM CERTAIN THAT I HEARD THE VEHICLE PUT ITSELF INTO 4 WHEEL DRIVE AFTER HITTING THE DITCH.    'PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).' *JB",
        "vin": "KNMAT2MV1KP"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/14/2019",
        "dateOfIncident": "05/10/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207485,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC EMERGENCY BREAKING (AEB) SYSTEM STOPPED WORKING WITHIN 15 DAYS OF VEHICLE OWNERSHIP OF 2019 NISSAN ROGUE SV AWD.   HAD VISITED DEALER TWICE AND THEY SAID THAT ITS FROM NISSAN, THEY CANNOT FIX IT BY THEIR OWN. DIDN'T FIND A RECALL OR UPDATE ANYWHERE. PLEASE INVESTIGATE AND FIX THE PROBLEM.",
        "vin": "JN8AT2MV9KW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/27/2019",
        "dateOfIncident": "03/27/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192063,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STOPPED FOR NO APPARENT REASON WHILE MY WIFE [XXX] WAS DRIVING IT TODAY. SHE WAS DRIVING IT ON A CITY STREET STRAIGHT UPHILL AROUND 20 MILES AN HOUR. SHE WENT UNDER A BRIDGE OVERPASS AND THE SUV SUDDENLY SLOWED AND STOPPED FOR NO APPARENT REASON. THERE WAS NO OTHER PERSON OR VEHICLE AROUND WHEN THIS HAPPENED. IT IS BRAND NEW WITH 340 MILES ON IT AT THE TIME OF THE INCIDENT.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "JN8AT2MV4KW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/25/2019",
        "dateOfIncident": "03/22/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191266,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN ROGUE. WHILE DRIVING APPROXIMATELY 30 MPH, \"ROADWAY NARROW\" APPEARED ON THE INSTRUMENT PANEL AND THE VEHICLE STOPPED, BUT CONTINUED TO IDLE. A FEW SECONDS LATER, THE VEHICLE ACCELERATED NORMALLY. AN APPOINTMENT WAS SCHEDULED WITH BARON NISSAN INC (235 GLEN COVE RD, GREENVALE, NY 11548) FOR DIAGNOSTIC TESTING. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED CASE NUMBER: 35044923. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 140.",
        "vin": "5N1AT2MV9KC"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/21/2019",
        "dateOfIncident": "01/02/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190400,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAND NEW 2019 NISSAN ROGUE SV AWD:     CLIMATE CONTROL IS NOT WORKING PROPERLY ESPECIALLY DURING COLD WEATHER. WHEN TEMPERATURE CONTROL GAUGE IS SET TO 61F, IT BLOWS COLD AIR AND WHEN THE GAUGE IS SET TO 62F, IT IMMEDIATELY BLOWS HOT AIR (80-90F). THIS IMPAIRS MY DRIVING AND POSES A RISK OF AN ACCIDENT BECAUSE I CONSTANTLY HAVE TO TAKE MY RIGHT HAND OFF THE STEERING WHEEL AND MY SIGHT OFF THE ROAD FOR A SECOND OR TWO TO MANUAL SWITCH BETWEEN 61F AND 62F. THIS IS THE ONLY WAY TO REGULATE THE INTERIOR TEMPERATURE. I CONSTANTLY HEAR FROM MY TWO LITTLE KIDS AND WIFE \"IT'S TOO HOT, IT'S TO COLD....IT'S TOO HOT, IT'S TO COLD\". THIS IS VERY FRUSTRATING ESPECIALLY WHEN AFTER THREE TRIPS TO THE DEALER'S SERVICE DEPARTMENT, I WAS TOLD THAT THIS IS NORMAL AS THAT'S HOW NISSAN DESIGNED THE CLIMATE CONTROL DURING COLD OUTSIDE TEMPERATURES. THIS IS DEFINITELY NOT NORMAL TO ME AND MY FAMILY.  CUSTOMER AFFAIR EVEN SCHEDULED A BIASED SUBJECT MATTER INSPECTOR TO MEET WITH ME TO ONLY TELL ME THAT IT'S NORMAL AND WORKING AS DESIGNED. HE TOLD ME THAT IT WILL CONTINUE BLOWING HOT AIR (80-90F) WHEN THE GAUGE IS SET TO 62F EVEN IF THE INTERIOR TEMPERATURE HAS ALREADY REACHED 80F+ FOR A PROLONGED PERIOD OF TIME (AN HOUR OR SO) - THIS MAKES NO SENSE!  THE INSPECTOR TOLD ME THAT EVERY ROGUE IS DESIGNED THAT WAY.  IF I KNEW THIS BEFORE BUYING THE CAR, I WOULD NEVER BUY IT. THE CLIMATE CONTROL DESIGN IS DEFINITELY FLAWED BUT NISSAN IS NOT WILLING TO ADMIT IT. IT NEEDS TO BE RECALLED AND FIXED FOR ALL ROGUES!     OTHER ISSUE I'VE BEEN FACING IS VIBRATIONS ON THE STEERING WHEEL AND ON GAS & BREAK PEDALS WHILE THE CAR IS STATIONARY OR DRIVING ON ANY ROAD. VIBRATIONS ARE COMING FROM THE ENGINE COMPARTMENT. NISSAN SERVICE AGAIN TOLD ME IT'S NORMAL. IT IS NOT!     NISSAN FAILED TO RESOLVE BOTH ISSUES. I HAVE FILED A BBB COMPLAINT.     NHTSA - PLEASE RECALL BOTH CHRONIC ISSUES! THANK YOU!",
        "vin": "JN8AT2MV3KW"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/07/2019",
        "dateOfIncident": "03/04/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184809,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I ONLY HAVE 1700 MILES ON MY NEW ROGUE. I PARK IN A GARAGE AT WORK AND AT HOME. I DROVE 10 MILES IN THE SNOW FROM WORK TO HOME AND MY CAR STARTED SHAKING SO BAD I THOUGHT THE WHEELS WERE GOING TO FALL OFF. I TOOK IT INTO THE NISSAN GARAGE AND THEY TOLD ME I HAVE TO KEEP THE SNOW OFF THE WHEELS AND IT WONT SHAKE. I HAVE NEVER HAD THIS PROBLEM BEFORE IN DRIVING 50 YEARS AND THEY ARE TELLING ME THIS NORMAL. THIS IS NOT NORMAL. I GOT AN AWD CAR SO I COULD DRIVE IN THE SNOW AND NOW I AM BEING TOLD TO KEEP THE SNOW OFF MY WHEELS",
        "vin": "5N1AT2MV7KC"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/26/2019",
        "dateOfIncident": "02/25/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182496,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SPUTTERS THEN STALLS ON I-10 INTERSTATE HWY, CHASSIS CONTROL LIGHT COMES ON. VEHICLE WILL RESTART AND IMMEDIATELY STALL AGAIN YESTERDAY NIGHT. EXTREME SAFETY HAZARD AS THIS OCCURS WITH NO WARNING AND FOR NO APPARENT REASON. THIS HAS HAPPENED ON MULTIPLE OCCASIONS, TODAY, THIS MORNING AT 7:40 AM 2/26/2019 IT HAPPENED ON THE FREEWAY IN A RAINY, CLOUDY AND FAIR VISIBILITY AND I WAS UNABLE TO GET TO THE SIDE OF THE ROAD DUE TO SPEEDS. CAR IS 1 MONTH, BRAND NEW AND DRIVEN FOR 2400 MILES ONLY.",
        "vin": "5N1AT2MT3KC"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/14/2019",
        "dateOfIncident": "02/06/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180030,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I DROVE HOME A BRAND NEW 2019 NISSAN ROGUE SL AWD FROM THE DEALER ON A FRIDAY NIGHT WITH 9 MILES ON IT.  I DROVE IT ON THE HIGHWAY TO GO SKIING THE FOLLOWING DAY AND THEN ON MONDAY EVENING (AFTER 3 DAYS OF OWNING CAR AND 362 MILES), THE ENGINE MALFUNCTION INDICATOR LIGHT WENT ON.  CALLED DEALER AND THEY SAID TO BRING IN TO LOOK AT IT AND ALSO THE NISSAN CONNECT EMAIL STATED TO OPEN/CLOSE GAS CAP.  AFTER DOING SO, A COUPLE OF START/STOPS, THE LIGHT DID NOT COME BACK ON.  I CALLED DEALER AND SAID IF IT COMES ON, I WILL BRING IN BUT LET'S WAIT AND SEE.  ON WEDNESDAY (DAY 5 AND 440 MILES), I WAS COMMUTING HOME FROM WORK AND WHILE IN MIDDLE LANE OF SLOW MOVING TRAFFIC ON A STATE HIGHWAY, 6 MALFUNCTION INDICATOR LIGHTS ALL WENT ON AND THE CAR FELT STRANGE.  AS SOON AS I COULD, I GOT INTO THE RIGHT LANE AND REALIZED I HAD NO ACCELERATION AS IF THE CAR FELT LIKE IT WAS IN NEUTRAL.  I WAS ABLE TO COAST OVER AND INTO A NEARBY PARKING LOT THANKFULLY.  I CALLED DEALER AND THEY ADVISED TO CALL FOR ROAD SIDE ASSISTANCE AND TOW TO THEIR DEALERSHIP.  I WAS GIVEN A LOANER AND HAVE BEEN WORKING WITH NISSAN CONSUMER AFFAIRS.  THE CAR IS STILL NOT REPAIRED AFTER 8 DAYS OF BEING IN SERVICE DEPARTMENT AND THEM WORKING WITH NISSAN SPECIALISTS.  THEY BELIEVE THEY FOUND THE ELECTRICAL CONNECTION ISSUE AND ARE STILL WORKING THROUGH IT AND WILL TEST BUT I DO NOT FEEL SAFE GETTING BACK INTO THIS VEHICLE AFTER HAVING AN ENGINE FAILURE THAT COULD HAVE RESULTED IN SERIOUS INJURY OR WORSE.",
        "vin": "5N1AT2MV5KC"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/22/2019",
        "dateOfIncident": "01/16/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171331,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 NISSAN ROGUE. WHILE DRIVING 55 MPH, THE ABS WARNING INDICATOR ILLUMINATED AND THE BRAKES ENGAGED. THE VEHICLE WAS TAKEN TO MODERN NISSAN OF WINSTON SALEM (5795 UNIVERSITY PKWY, WINSTON-SALEM, NC 27105) TO BE DIAGNOSED, THE FAILURE MILEAGE WAS 850.  *BF  AND IT WAS DETERMINED THAT IT NEEDED TO BE CALIBRATED.*JB",
        "vin": "JN8AT2MV4KW"
    },
    {
        "components": "ELECTRICAL SYSTEM,WHEELS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/14/2019",
        "dateOfIncident": "12/10/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170000,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ON THE STREET DRIVING UP A HILL AND THE MALFUNCTION LIGHT CAME ON I LOOKED IT UP IN  MY MANUEL  BOOK IT SAID DO NOT DRIVE TAKE TO DEALER MY CAR WAS PURCHASED ON NOV 23,2018 THIS HAPPENNED ON DECEMBER 10,2018. I HAD TO CALL A TOW TRUCK THEY TOWED THE VEHICLE AND TOLD ME I CANNOT GET A RENTAL OR LOANER CAR UNTILL NISSAN DETERMINES IT WAS NOT MY FAULT, SO AFTER THEY FINALLY LOOKED AT CAR AND DETERMINED IT WAS A FAULT OF THE MANUFACTURE THIS WAS ON 12/16/2018 , I HAD BEEN WITHOUT A CAR FOR 6 DAYS THEN THEY SAID MY CAR WOULD BE DONE ON THE 17TH AND THEIR WAS NO NEED FOR ME TO GET A LOANER.   ALSO THE VEHICLE HAD A LOUD CLUNKING NOISE WHEN PUT IN GEAR. THEY FOUND THAT THE RADIATOR LOWER SUPPORT BOLTS WERE LOOSE. EVERY TIME I GET IN MY VEHICLE AFTER STOPPING FOR AN HOUR OR MORE THE TIRE PRESSURE IS OFF ON ALL FOUR TIRES I NEED TO FILL WITH AIR ON A DAILY BASIS. THIS IS ABSURD.",
        "vin": "5N1ET2MT9KC"
    }
]