[
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/09/2022",
        "dateOfIncident": "03/08/2022",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455798,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "One morning when I got in my car the windshield had a large crack. Driver side about half way down the crack is from left to right around 12-14”. There is no apparent reason I can see for the crack. I had not driven the car for 2 days prior to the crack appearing.",
        "vin": "4S3GTAD69K3"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/06/2022",
        "dateOfIncident": "03/06/2022",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455422,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The battery dies sporadically when the car has been parked for a short time or a day or two. No telling when it will happen, but suddenly the car will not start. Subaru dealer says there's nothing wrong, but obviously there is.  This has happened three times already, once in 25- degree weather with a 15-degree wind chill.  I have checked all the lights and keep the headlights turned off, as I don't drive at night.   So far this has happened only when the car is parked, but what if it happens when I am driving?  Date given below is the third incident. The others were in late January and February.",
        "vin": "4S3GTAB67K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/17/2022",
        "dateOfIncident": "02/12/2022",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452363,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The windshield cracked spontaneously. There are no signs of chips or any cracks indicating something hit it. The weather was chilly but not freezing and the vehicle was parked and unoccupied. The crack starts at the top and curves/snakes down the middle",
        "vin": "4S3GTAD67K3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/29/2022",
        "dateOfIncident": "04/18/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449392,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Car was purchased in October 2018. In April 2019, just six months after purchase, the windshield was hit by a small rock. This small collision caused a crack to spread across the entire windshield requiring replacement. Windshield was replaced with Original Equipment Manufacturer glass.  In December 2021, just over two years later, another small rock hit the windshield causing another large crack to spread across the windshield. We are now looking to replace for the second time, in just three years of car ownership, which is ridiculous.   Looking online, I see many active lawsuits regarding this issue and the integrity of the Subaru glass. Having used other car brands for many years before purchasing my first Subaru, I know that it is highly unusual for such large cracking to happen from a simple rock ding. Other cars I have used in the past would get a small indent in the glass from being hit by a rock, but it would not spread and damage the entire windshield.   I see I can only submit one date below, so I will submit two of these forms, one for each date.",
        "vin": "4S3GTAM66K3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/29/2022",
        "dateOfIncident": "12/18/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449394,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Car was purchased in October 2018. Just six months later in April 2019, a small rock hit the windshield and led to a crack going across the entire windshield. This was replaced with Original Equipment Manufacturer glass.  In December 2021, just over two years later, another small rock hit the windshield, again causing a crack to spread across the windshield. We are now looking at getting our front windshield replaced twice in just three years of ownership, which is ridiculous. I have seen that there are many active lawsuits again Subaru regarding this issue and the integrity of the glass. I know from previous vehicles that I have used, that usually a rock hitting the windshield may lead to a small indent/imperfection, but I have never experience this level of cracking from a simple rock ding.   I am submitting this form twice to capture the first incident in April 2019 and the second in December 2021.",
        "vin": "4S3GTAM66K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/14/2022",
        "dateOfIncident": "01/07/2022",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447476,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Front windshield spontaneously cracked running from bottom edge of windshield vertically up window for approx 10”",
        "vin": "4s3gtat65k3"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/13/2022",
        "dateOfIncident": "01/12/2022",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447335,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle was purchased new by original owner. Battery died at 5,709 miles and was replaced by dealer. I purchased the vehicle as a CPO. Second battery died at 8,077 miles and was replaced by dealer. Third battery died at 8,836 miles and was replaced by dealer.  Old batteries were disposed of by dealerships, surely, and are not available for inspection. Safety concern is chiefly of failure when the vehicle is off, not during driving. Problem has been confirmed at each dealership visit. Note that there are several class-action lawsuits pending against Subaru for prematurely dying batteries. No warning was given by vehicle except for a slightly longer engine start the time before catastrophic draining of battery and failure of engine start. Though anecdotal, non-Subaru technicians feel it's not defective batteries but rather a defective electrical system, specifically the controller area network.",
        "vin": "4s3gtau64k3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/04/2022",
        "dateOfIncident": "01/02/2022",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446182,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I have a 2019 Subaru Impreza and my windshield cracked for the second time in two years. I was driving and heard a loud pop and the windshield cracked from the top about a foot down. Nothing hit the windshield. The first time this happened, the car was sitting in the driveway. I have an appointment with the dealer tomorrow. I verified that this is happening to others and that there is a class action lawsuit against Subaru for cracked windshields: https://www.torquenews.com/1084/new-ruling-subaru-cracked-windshield-lawsuit-now-adds-25m-cars  My make and model is included.",
        "vin": "4S3GKAA67K3"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/27/2021",
        "dateOfIncident": "10/02/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445030,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "When  driving the vehicle the engine was not getting enough power and it was shifting oddly. I took it in and was told there was excessive carbon buildup on the heads, and there is not a good fix for the problem. Without having the engine torn apart this could of caused the car to not speed up properly or the engine to malfunction while driving the vehicle. This could have caused serious injuries to me or others on the road if the problem would not have been addressed. The vehicle was taken to the Subaru dealership, where the engine had to be taken apart and the heads had to be machined to get the carbon off. I was also told there was no preventative maintenance to avoid this problem. There were no warning lamps, lights, or other warnings to notify me of the problem other than the engine not having normal power when over 2000 RPM. It has also taken the dealership almost 3 months and counting to find and address the issue.",
        "vin": "4s3gkab68k3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/18/2021",
        "dateOfIncident": "12/17/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444239,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHEILD CRACKED FOR NO REASON. Noticed crack after car sat in driveway all day.",
        "vin": "4S3GKAU63K3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/07/2021",
        "dateOfIncident": "11/01/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442949,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The window trim underneath the windshield has a gap. I have taken it to a glass company and they said it was definitely a defect. The bottom trim/molding is separating from the glass and the clips that fit under the windshield do not stay in place. It is rubbing against the bottom of the windshield causing small chips. It’s just a matter of time before it cracks again. It cracked at 9k miles and is now at 13k miles with its second Subaru OEM windshield that has only been on for 2 Months. I feel this is the same situation as the class-action suit on spontaneous cracking windshields on Outback’s and Legacy’s, as well as the one now happening with 2017-2020 Crosstreks.",
        "vin": "4s3gkaj6xk1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/05/2021",
        "dateOfIncident": "01/23/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442745,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Purchased Impreza Limited 10/31/19.  On 1/23/21, car would not start.  AAA said battery not good & installed a new battery.  On 7/4/21 car would not start; battery jumped by AAA.  On 9/10/21 car would not start.  AAA said battery not good & installed a new battery again—3rd battery since I purchased car.  On 7/22/21 Subaru of Morristown said they checked for parasitic drain, and told me it is “within specs.”  They said I don’t drive enough miles.  End of July 2021 I (a senior woman) purchased a Battery Tender which I must attach to the battery whenever the car is parked in my garage.",
        "vin": "4S3GTAU66K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/25/2021",
        "dateOfIncident": "10/24/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438040,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The car windshield cracked while driving without any apparent reason. It is a large horizontal crack on the driver's side which affects visibility.",
        "vin": "4S3GTAD69K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/13/2021",
        "dateOfIncident": "10/10/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436526,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The windshield cowl separates at the bottom of the windshield for reasons such as heat. The separation grows over time and has the potential to detach on the highway partially or entirely. If detached partially, obstructs vision and scares. If entirely, could impact following vehicle.  This problem is reproduced and confirmed by both my dealership and multiple independent online sources. Look for \"windshield cowl seperation\" topics for 17+ imprezas and 18+ crosstreks.  This issue became apparent within the first year of ownership, was serviced at the dealership by replacing the part under warranty, and now has occurred once more in my second year of ownership.  Attached photograph shows the beginning of separation (not the wiper). This can grow in size very quick.  Noted additional details are dated for last occurrence, however as stated 1 more occurrence has occurred 1 year ago at approx 5,000 miles.",
        "vin": "4S3GTAB61K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/05/2021",
        "dateOfIncident": "10/04/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435525,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The windshield of the care cracked without damage. I was sitting with the car in park and just watched it crack. It started from the edge near the seal, and is ~8 inches long. There was no previous damage and nothing hit the window when it happen. There is no chip or area where damage occurred, it just simple cracked for no reason.",
        "vin": "4S3GTAM62K3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/24/2021",
        "dateOfIncident": "03/15/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434275,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I have had the car since December of 2019, and have already replaced the windshield twice. The 2nd windshield I didn’t replace right away, after it was hit by a small rock, and it developed a 2 ft. crack directly across my field of vision. In the few months I waited to replace it I was hit by an additional 2 rocks and immediately developed 2 more large cracks(both over 6 inches). It’s obvious that something is defective about this windshield.",
        "vin": "4S3GKAJ6XK1"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/07/2021",
        "dateOfIncident": "05/08/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11428183,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "On May 8th of this year, my fiancé were involved in a rear end collision. That morning, the Hyundai Tucson in front of us stopped short and we ran into the back of it doing around 35 an hour, and ended up with our vehicle (Subaru Impreza) being totaled. I’d like to provide pictures to show the impact, as even car experts have been surprised that the airbags didn’t deploy. As it turns out, a sedan hitting into the back of an SUV means that the airbag sensors may be untouched (because they’re too low) and therefore, airbags will not deploy, even if the accident severe. To me, that is a defect in the design and should be reconsidered going forward. My fiancé broke his foot , which caused him to be out of work for at least 4 months and I got whiplash.",
        "vin": "4S3GTAC60K3"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/07/2021",
        "dateOfIncident": "08/07/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428195,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "My vehicle starts to shake and the engine acts like it is going to die when I hit around 50-60 mph. I cannot floor it and the vehicle will not let me go any faster then 60mph without it acting like there’s no fuel getting to the engine or something in that sense",
        "vin": "4S3GTAM6XK3"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/27/2021",
        "dateOfIncident": "05/29/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426614,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Thule, Inc.",
                "productMake": "THULE",
                "productModel": "SPRINT BIKE CARRIER",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "The contact owns a 2019 Subaru Impreza equipped with a Thule Bike Carrier Part Number: SOA567B020 as well as  Thule roof cross bars . After his first two uses of  his roof rack, which were a 10 mile trip and then a 400 mile trip, he noticed one of the two  bolts connecting the front of the roof rack to the front roof cross bar had failed . A weld to attach the head of the  bolt to the body of the bolt (i.e., Part# 753-0242-06)  failed and the head separated from  the body of the bolt . This  failure of one bolt made the connection by the front roof rack assembly unit to the front roof cross bar loose, which resulted in the entire bike rook rack being only loosely connected to the roof cross bars and unstable. The manufacturer repeatedly failed to address the  report of this  defect in email exchanges with the contact, although the manufacturer  eventually refunded the  purchase price to the contact . The contact retained the defective bolt and roof rack.",
        "vin": "4S3GTAD64K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/16/2021",
        "dateOfIncident": "07/16/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425205,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Windshield spontaneously cracked while parked .",
        "vin": "4s3gtam66k3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "07/15/2021",
        "dateOfIncident": "04/05/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425008,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving in stop and go traffic on the highway for several minutes. Everything worked fine until one moment when I went to press the brake pedal down and the pedal would not move. I used all my strength to push it down for several seconds. It was locked in position. I could not move it all. My car slid into a semi truck in front of me at a very very low speed. After impact, everything worked again and I was able to pull the car to the side of the road. Initially, I believed the truck behind me had pushed my car causing the brake pedal to lock. I contacted the police and we examined my vehicle. There was no damage from the impact on the front of my car and there was no evidence I had been rearended. Two Subaru shops have examined the vehicle. One theory from the first shop is that an object in the road lifted the car off the road and caused the pedal to fail. The other shop has no theories. Neither shop found any issue with the brakes or the pedal and could not recreate the problem. Extensive repairs have been done to correct damage from a large rock in the road. The Subaru shop doing the repairs said the rock damage would not have affected the brakes. The car can be inspected at any time. My family is wary of driving the vehicle. The brake pedal failed once and the issue has yet to be explained to our satisfaction.",
        "vin": "4S3GTAD6XK3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/11/2021",
        "dateOfIncident": "07/06/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424285,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The windshield spontaneously cracked. It began on the lower passenger side and ended in about the center of the windshield. The car was parked in a residential driveway at the time, and suffered no impact.",
        "vin": "4S3GTAD64K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/24/2021",
        "dateOfIncident": "06/24/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422212,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "My windshield was broken one morning from edge of passenger side all the way through to the driver side deep enough to put my fingernail in when I came outside, no incidents or impact. Subaru dealership fails to replace it or acknowledge the issue.",
        "vin": "4S3GKAJ64K1"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/24/2021",
        "dateOfIncident": "02/16/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418378,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "PROCONTACT TX",
                "productYear": "9999",
                "size": "225/55 R 18 98H",
                "type": "Tire"
            }
        ],
        "summary": "The contact owns a 2019 Subaru Impreza equipped with Continental tire, tire line: Pro-contact TX, Tire Size: 225/55/R16, DOT number: A3T2WC393019. The contact stated that while his wife was driving 65 mph, the rear driver’s side tire experienced a blowout. The contact stated that several warning lights were illuminated. The driver exited the highway and parked at a nearby exit. The contact called the local dealer the next day to have the vehicle towed and the rear driver’s side tire replaced. The contact stated then later received notification of NHTSA Campaign Number: 21T001000 (TIRES) however, the dealer stated that the tire was not included in the recall. The manufacturer had been informed of the failure. The failure mileage was 17,340.",
        "vin": "4S3GTAD61K3"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/19/2021",
        "dateOfIncident": "05/18/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417729,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The battery dies after just sitting in my home after a day.",
        "vin": "4s3gtaa68k3"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/15/2021",
        "dateOfIncident": "02/02/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416655,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 SUBARU IMPREZA. CRACKED WINDSHIELD & DRIVE TRAIN HAD TO BE REPLACE BEFORE 30K MILES",
        "vin": "4S3GKAU67K3"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/05/2021",
        "dateOfIncident": "05/04/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415252,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS SITTING AND BEING STARTED ON A WEEKLY BASIS UNTIL RECENTLY WHERE WE HAD AN ISSUE WITH THE BATTERY NEEDED TO BE REPLACED",
        "vin": "4S3GKAA69K3"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/03/2021",
        "dateOfIncident": "09/02/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415042,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 SUBARU IMPREZA. THE CONTACT STATED WHILE DRIVING 65 MPH, A ROCK STRUCK AND CRACKED THE DRIVER'S SIDE WINDSHIELD. THE CONTACT STATED THAT THE CRACK HAD EXPANDED ACROSS THE WINDSHIELD. THE CONTACT TOOK THE VEHICLE TO CAPITOL SUBARU SERVICE CENTER (920 CAPITOL EXPRESSWAY AUTO MALL, SAN JOSE, CA 95136, (408) 723-1200) WHO INSPECTED AND THEN REPAIRED THE VEHICLE. THE CONTACT STATED THAT A MONTH LATER THE WINDSHIELD WAS CRACKED AGAIN. THE VEHICLE WAS REPAIRED. THE MANUFACTURE WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 25,000.",
        "vin": "4S3GTAD67K3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/22/2021",
        "dateOfIncident": "04/22/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413458,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2019 SUBARU IMPREZA HATCHBACK SPORT HAS A MAJOR PROBLEM I SAW. THE REAR LEFT DISC BRAKE ROTOR CALIPER IS NOT COMPLETELY ENGAGING. ALSO THE COLOR LOOKS LIKE RUST . ADDITIONALLY THE CAR IS VIBRATING AND MAKING WEIRD SOUNDS.",
        "vin": "4S3GTAJ68K3"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/20/2021",
        "dateOfIncident": "07/17/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11412983,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON OR ABOUT JULY 17, 2020, I WAS TRAVELING ON AN INTERSTATE AT APPROXIMATELY 63 MPH WHEN I EXPERIENCED A SUDDEN LOSS OF AIR PRESSURE IN RIGHT FRONT TIRE.  THERE WAS NO WARNING AND NOTHING ON MY DASH INDICATED THAT PRESSURE WAS LOW AT ANY TIRE PRIOR TO THE INCIDENT.  I ALMOST LOST CONTROL OF THE VEHICLE, BUT WAS ABLE TO REGAIN CONTROL OF THE VEHICLE AND GET TO THE BREAKDOWN LANE.  THE TIRE LOST ALL AIR PRESSURE AND THE RIM HIT THE PAVEMENT DESTROYING THE RIM. THE TIRE AND RIM WERE REPLACED BY THE DEALER THAT DAY.  THE TIRE WAS A CONTINENTAL PROCONTACT TX 205/55R16 89V.  DOT A3T2 WC39 2919.",
        "vin": "4S3GTAB62K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/16/2021",
        "dateOfIncident": "04/16/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408384,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST TIME I CAME OUT AND WINDSHIELD WAS JUST CRACKED NOTHING AROUND IT ABOUT 15 IN LONG AFTER REPLACING WINDSHILD I WAS DRIVING DOWN ROAD AND THE THE WINDSHIELD THEN CRACKED OUT OF NOWHERE NOTHING HIT IT NO HARD BUMPS THIS MAKE THE 2ND WINDSHIELD IN 3 MTHS",
        "vin": "4S3GTAD67K3"
    },
    {
        "components": "WHEELS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/16/2021",
        "dateOfIncident": "04/01/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408386,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WHEEL SYSTEM HAS SOME KIND OF SQUEALING IN IT",
        "vin": "4S3GTAD67K3"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/14/2021",
        "dateOfIncident": "04/10/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408077,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "II BOUGHT THIS CAR NEW IN 2019.  I HAVE HAD 8 TIMES WHICH I WOULD BE OUT SOMEWHERE AND THE CAR WOULD NOT START.  I LIVED IN FORT WORTH AND AAA WOULD COME.  AT NO TIME HAS SUBARU ADDRESSED THIS ISSUE OF WHY IT WILL NOT START. I HAD TO TAKE IT TO CLEO BAY IN KILLEN ON SATURDAY THE 10TH BECAUSE I WAS AT LUNCH IN BROWNWOOD AND WHEN I TRIED TO START IT IT WOULD NOT.  I HAD TO GET IT JUMPED AND THEN THE SCREEN FOR THE MAPS AND RADIO ACTED LIKE IT WAS ON DRUGS.  SO I DROVE AND LEFT IT WITH CLEO BAY SUBARU.  THEY SAID THEY DID AN UPDATE TO MY RADIO BUT WON'T ADDRESS THE REAL ISSUE OF WHY THE CAR WOULD NOT START AND I HAD TO GET IT JUMPED.",
        "vin": "4S3GTAU67K3"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/13/2021",
        "dateOfIncident": "04/12/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407930,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE PURCHASING MY VEHICLE IN JANUARY OF 2019 I HAVE HAD TO HAVE THE BATTERY REPLACED 4 TIMES, EACH TIME THE CAR HAS NOT BEEN SITTING FOR MORE THAN A WEEK, NOT BEEN EXPOSED TO EXTREME TEMPERATURES, NOT BEEN LEFT WITH A LIGHT ON OR A DOOR OPEN. THE 2ND, 3RD AND 4TH TIMES THIS HAPPENED I REQUESTED THAT THE VEHICLE BE EXAMINED TO DETERMINE WHETHER THERE WAS AN ISSUE OTHER THAN THE BATTERY AT PLAY, SUBARU HAS NEVER TAKEN THAT INQUIRY SERIOUSLY AND SIMPLY REPLACED THE BATTERY ONLY FOR IT TO DIE A FEW MONTHS LATER.",
        "vin": "4S3GTAA65K3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/10/2021",
        "dateOfIncident": "04/10/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407382,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER A WIND STORM I CAME OUTSIDE TO A SHATTERED BACK WINDSHIELD. MY CAR WAS THE ONLY ONE DAMAGED IN A PARKING LOT FULL OF VEHICLES. IT WAS LEFT IN PARK AT AT APARTMENT COMPLEX.",
        "vin": "4S3GTAD64K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/08/2021",
        "dateOfIncident": "04/08/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407005,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WINDSHIELD MADE A POP SOUND AND CRACKED.  THERE WAS NOW ONE ELSE ON THE ROAD AND NOTHING HIT THE WINDSHIELD.",
        "vin": "4S3GTAB6XK3"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/03/2021",
        "dateOfIncident": "03/25/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406210,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT 5-6 TIMES MY KNEE HAS BUMPED THE KEY DURING NORMAL DRIVING, TURNING IT IN THE OFF POSITION. IT HAS HAPPENED WHILE DRIVING STRAIGHT AND WHILE TURNING. IT HAPPENS MORE FREQUENTLY WHILE ACCELERATING OUT OF A PARKING LOT ONTO A SURFACE STREET. IT HAS LEFT ME DEAD STOPPED IN THE MIDDLE OF ONCOMING TRAFFIC OR HAVING TO COAST TO THE SIDE OF THE ROAD. IT TAKES SEVERAL SECONDS TO RESTART THE CAR BECAUSE I HAVE TO PUT THE CAR IN PARK TO RESTART IT.",
        "vin": "4S3GTAC61K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/29/2021",
        "dateOfIncident": "03/29/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405466,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD CRACKED FOR A THIRD TIME IN 2 YEARS. WINDSHIELD IS AN OEM SUBARU CARLEX WINDSHIELD. VEHICLE WAS ON THE FREEWAY AND THE CRACK APPEARED WITH 15 INCHES IN SPAN.",
        "vin": "4S3GTAC62K3"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/18/2021",
        "dateOfIncident": "12/11/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403690,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DUE TO THE ECO FRIENDLY SOY BASE PARTS IN SUBARU VEHICLES, WE HAVE FALLEN VICTIM TO SQUIRRELS CHEWING ON THE WIRES UNDERNEATH THE HOOD CAUSING EXTENSIVE DAMAGE TO THE VEHICLE. THIS HAS HAPPENED TWICE WITHIN  6 MONTHS. SUBARU STATED THIS WOULD NOT BE COVERED UNDER WARRANTY AND WE HAVE BEEN LEFT WITH THE BURDEN OF THE COST. THIS IS NOT THE FIRST TIME THAT SOMEONE HAS REPORTED SUCH A PROBLEM, AS A CLASS ACTION WAS FILED 11/2017 IN HAWAII REPORTING THE SAME ISSUES WITH RODENTS AND SUBARU'S SOY BASED PARTS.",
        "vin": "4S3GKAC65K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/13/2021",
        "dateOfIncident": "03/11/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402738,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FOUND WINDSHIELD RANDOMLY CRACKING IN A SINGLE LINE FROM TOP CENTER TOWARD THE MIDDLE AND  THEN TOWARD THE LEFT (VIEW FROM INSIDE). CAR HAD BEEN STATIONARY.",
        "vin": "4S3GTAD66K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/21/2021",
        "dateOfIncident": "02/19/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397181,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WINDSHIELD OF MY SUBARU IMPREZA 2019 GOT A CRACK AND CHIP FOR NO REASON, JUST STAYING ON PARKING. NO OBJECTS GOT ONTO THE WINDSHIELD. NO ACTIVITY COULD HAPPEN AROUND THE VEHICLE, BECAUSE PARKING IS VERY LIMITED AND IN A PRIVATE AREA, FAR FROM THE ROAD OR ANY OTHER VEHICLES. NEVER SAW ANY CHIPS BEFORE.  I HAVE MORE PHOTOS OF THAT AREA (BEFORE THE VISIT TO THE DEALER).  SUBARU DEALER (IN EXTON, PA) REFUSED TO REPLACE IT UNDER WARRANTY.   WHEN I LEFT THE CAR AT THE DEALER TO GET OTHER FIXES - THEY MADE THE CRACK BIGGER. AND AGAIN, REFUSED EVEN TO DISCUSS THEIR FAULT.",
        "vin": "4S3GTAB64K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/19/2021",
        "dateOfIncident": "02/18/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397022,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WINDSHIELD CRACKED WHILE PARKED.   STARTING FROM THE EDGE TO ALMOST THE CENTER OF THE WINDSHIELD, NO CHIP NO IMPACT, IT JUST CRACKED.",
        "vin": "4S3GTAD62K3"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/11/2021",
        "dateOfIncident": "02/08/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395794,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER HAVING THE CAR 10 MONTHS BATTERY KEPT DYING. SUBARU REPLACED THE FIRST BATTERY WITH A NEW ONE EXACTLY ONE YEAR AGO. THAT BATTERY JUST DIED ON FEB 8 AFTER NOT BEING DRIVEN FOR 3 DAYS. I NEEDED TO GET IT JUMP STARTED. SUBARU WILL NOT ACKNOWLEDGE THIS AND TOLD ME TO GET A \"SECOND OPINION.\" THIS IS A SAFETY ISSUE NOT A MEDICAL CONDITION.",
        "vin": "4S3GKAC68K3"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/14/2021",
        "dateOfIncident": "01/08/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388199,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 SUBARU IMPREZA. THE CONTACT STATED WHILE DRIVING 30 MPH, A SMALL PEBBLE HIT THE WINDSHIELD WHICH CAUSED A 16 INCH CRACK TO THE WINDSHIELD. THE CONTACT WAS ABLE TO DRIVE TO HIS DESTINATION. THE CONTACT CALLED THE LOCAL DEALER CASEY SUBARU (783 J CLYDE MORRIS BLVD, NEWPORT NEWS, VA 23601: (757) 522-2120) AND WAS REFERRED TO A WINDSHIELD REPAIR SHOP. THE VEHICLE WAS REPAIRED. THE MANUFACTURER HAD NOT BEEN INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 14,000.",
        "vin": "4S3GKAB69K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/11/2021",
        "dateOfIncident": "01/04/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387603,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE WAS LEFT STATIONARY, PARKED OUTSIDE MY APARTMENT OVER THE WEEKEND. AND ON MONDAY I NOTICED A 5 TO 6 INCH CRACK COMING FROM THE RIGHT EDGE OF MY WINDSHIELD. I BELIEVE THIS CRACK IS A RESULT OF THE CURRENT WINDSHIELD LAWSUIT THAT SUBARU IS DEALING WITH. THE SITE I FOUND THE INFORMATION ABOUT THE LAWSUIT TOLD ME TO FILE A COMPLAINT HERE IF MY VEHICLE WAS EFFECTED.",
        "vin": "4S3GTAA68K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/27/2020",
        "dateOfIncident": "11/23/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376759,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WINDSHIELD ON MY 2019 SUBARU IMPREZA KEEPS CRACKING FOR NO REASON OR LIKE THIS LAST TIME WHEN A TINY PEBBLE HIT IT. THERE ISN'T EVEN A MARK ON THE WINDSHIELD NOR CAN ANYTHING BE FELT BUT THERE IS NOW A CRACK IN THE GLASS. AS OF TOMORROW I'LL BE HAVING MY 3RD WINDSHIELD INSTALLED IN UNDER 4 MONTHS.",
        "vin": "4S3GTAD64K3"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/27/2020",
        "dateOfIncident": "07/27/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11351622,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE IS IDENTIFIED IN THE ACCIDENT REPORT AS UNIT 2. UNIT 1 ATTEMPTED TO MAKE AN IMPROPER/CARELESS LEFT TURN ONTO MAUCH CHUNK RD. UNIT 2 WAS IN MOTION TRAVELING STRAIGHT ACROSS THE INTERSECTION WHEN UNIT 1 TRIED TO MAKE AN ILLEGAL LEFT TURN AND  STRUCK UNIT 2. UNIT 1 WAS RESPONSIBLE FOR THE ACCIDENT. INITIAL IMPACT POINT WAS 10 O'CLOCK. AIR BAGS DID NOT DEPLOY ON UNIT 2. UNIT 2 WAS DECLARED A TOTAL LOSS. WITH ALL DAMAGE ON THE FRONT END OF UNIT 2. TIME OF ACCIDENT WAS MONDAY, 7/27/2020. DRIVER OF UNIT #2 SUFFERED ANKLE, LEG, SHOULDER INJURIES ALONG WITH A CONCUSSION. ALL OF THESE SYMPTOMS APPEARED WITHIN 24 HOURS AFTER THE ACCIDENT. DRIVER OF UNIT #2 IS UNDER DOCTORS CARE AT THIS POINT. JURISTICTION IN WHICH INCIDENT OCCURRED IS ALLENTOWN, PA. OWNER OF UNIT 2 HAS RECEIVED SETTLEMENT FOR THE DESTROYED VEHICLE THAT IS NOW OWNED BY ERIE INSURANCE. WE HAVE BEEN IN COMMUNICATION WITH SUBARU TO UNDERSTAND WHY THE AIR BAGS DID NOT DEPLOY. TO DATE ALL WE HAVE GOTTEN IS VERBAL RESPONSES THAT THEY ARE TO INVESTIGATE. WE HAVE SUPPLIED A FULL ACCIDENT REPORT AND PICTURES.",
        "vin": "4S3GTAD65K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/19/2020",
        "dateOfIncident": "05/22/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350262,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS HAPPENED IN MAY 2020. I PURCHASED THE VEHICLE IN OCTOBER 2019. CAR WAS BEING DRIVEN ON BUSY HIGHWAY AND WINDSHIELD CRACKED. NOT SURE IF IT WAS STRUCK BY OBJECT OR NOT. I COULD NOT REALLY SEE IF THE DAMAGE WAS CAUSED BY AN OBJECT. WITHIN A WEEK OF TWO, THE CRACK HAD TRAVELED ALMOST ALL THE WAY ACROSS THE ENTIRE WINDSHIELD. RECENTLY I HAVE NOTICED THAT THE CRACK IS WIDENING. I AM IN THE PROCESS OF REPLACING THE WINDSHIELD. THIS MAY BECOME A SAFETY ISSUE. I FEAR THAT THE ENTIRE WINDSHIELD MAY JUST COLLAPSE. IN MY OPINION, I THINK THESE WINDSHIELDS ARE MADE OF DEFECTIVE MATERIAL THAT IS UNSAFE. THE CRACK  IS NOW AS WIDE AS THE SIZE OF A TOOTHPICK. PLEASE SEE IMAGES.",
        "vin": "4S3GTAD64K3"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/18/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350052,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 SUBARU IMPREZA. THE CONTACT STATED THAT AFTER ACCELERATING FROM A RED LIGHT AND MAKING A RIGHT TURN, THE FRONT WINDSHIELD SUDDENLY CRACKED. THE CRACK WAS LOCATED AT THE BOTTOM DRIVER'S SIDE CORNER OF THE WINDSHIELD AND EXTENDED APPROXIMATELY 2 FEET. THE CONTACT INDICATED THAT NO OBJECT STRUCK THE WINDSHIELD TO CAUSE THE CRACK. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER MARK MILLER SUBARU LOCATED AT 3535 STATE ST, SOUTH SALT LAKE, UT 84115. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 22,400.",
        "vin": "4S3GTAA62K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/07/2020",
        "dateOfIncident": "08/07/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343974,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TODAY, AUGUST 7, 2020 WE NOTICED ON OUR PARKED 2019 SUBARU IMPREZA THE WINDSHIELD WAS CRACKED.  THE CRACK STARTS WHERE THE REVIEW MIRROR IS ATTACHED AND RUNS VERTICALLY ALL THE WAY DOWN.  THIS APPEARS TO HAVE STARTED ON THE INSIDE.  THERE IS NO DAMAGE FROM A ROCK OR OTHER DEBRIS STICKING THE WINDSHIELD.  A SEARCH ONLINE HAS SHOWN MULTIPLE LAWSUITS AGAINST SUBARU FOR DEFECTIVE WINDSHIELDS.  WE HAVE NOT YET CONTACTED SUBARU BUT FELT A COMPLAINT WAS WARRANTED AS THIS APPEARS TO BE AN ISSUE WITH SUBARU VEHICLES.",
        "vin": "4S3GTAM66K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/30/2020",
        "dateOfIncident": "06/30/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331768,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ALONG THE HIGHWAY WHEN I HEARD A SMALL CRACKING SOUND. NO LARGE DEBRIS OR ROCK NOTED FROM HIGHWAY. ALL OF A SUDDEN A LARGE CRACK APPEARED ON THE RIGHT-HAND PASSENGER SIDE AND EXTENDED TO THE MIDDLE OF THE WINDSHIELD. I CALLED SUBARU DEALERSHIP AND SAID THEY WOULD HAVE TO DETERMINE IF IT WAS A STRESS CRACK OR NOT FOR IT TO BE COVERED; THEY DETERMINED THAT IT WOULD NOT BE COVERED BECAUSE IT IS NOT A STRESS CRACK.  *TR",
        "vin": "4S3GTAC61K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/24/2020",
        "dateOfIncident": "10/15/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330641,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A CITY STREET WITH NO TRAFFIC IN FRONT OF ME WHEN MY WINDSHIELD SPONTANEOUSLY STARTED TO CRACK FROM BELOW WHERE I COULD SEE FROM INSIDE THE CAR. THE CRACK QUICKLY SPIDERED OUT. THE CRACK STARTS AT THE BOTTOM OF THE GLASS WHERE IT IS INSTALLED. THE CRACK IS LARGE, WIDE, AND DEEP.  *TR",
        "vin": "4S3GTAJ62K1"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/10/2020",
        "dateOfIncident": "06/10/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328212,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WINDSHIELD DEVELOPED A LONG CRACK SPONTANEOUSLY. DURING THE PANDEMIC I HAVE HARDLY DRIVEN AND I AM CERTAIN IT WAS NOT DUE TO A CHIP.  *TR",
        "vin": "4S3GTAD6XK3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/29/2020",
        "dateOfIncident": "05/29/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326561,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WINDSHIELD HAS DEVELOPED A CRACK WHERE WAS NONE PREVIOUS, NOR HAS THERE BEEN ANY IMPACT. I HAVE BEEN ON FURLOUGH SINCE 24 MARCH, 2020 AND THE VEHICLE HAS BEEN DRIVEN ONCE A WEEK, AT MOST. THE MOST RECENT OUTING WAS ON SUNDAY 24 MAY, 2020 AND WAS WITHOUT IMPACT TO THE WINDSHIELD, NOR HAD ANY CRACK BEEN NOTICEABLE UNTIL TODAY, 29 MAY. THE VEHICLE HAS NOT MOVED FROM ITS' PARKING SPACE SINCE 24 MAY. I HAVE BEEN MAKING DAILY SIGHT INSPECTIONS OF THE VEHICLE SINCE I HAVE NOT BEEN DRIVING IT DAILY.  *TR  *BF  ON 06/15/20 VEHICLE WAS TAKEN TO SAFELITE AND THE WINDSHIELD WAS REPLACED. THE TECHNICIAN WAS UNABLE TO FIND A CAUSE FOR THE CRACK. CONSUMER PAID A $200 REPAIR FOR THE REPAIR. *DL",
        "vin": "4S3GTAB65K3"
    },
    {
        "components": "VISIBILITY,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/26/2020",
        "dateOfIncident": "05/22/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326040,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2019 IMPREZA. HAD THE CAR 6 MONTHS AND HAD TO REPLACE THE WINDSHIELD. A STRAY ROCK HIT THE CAR WHILE GOING ABOUT 35 MPH. SAW NOTHING WHEN IT HAPPENED. THE NEXT DAY A GIANT CRACK ACROSS MY WINDSHIELD. THIS IS BOGUS.  *TR",
        "vin": "4S3GTAC60K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/10/2020",
        "dateOfIncident": "04/14/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324038,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER MY CAR WAS SITTING OVERNIGHT, I CAME OUT IN THE MORNING AND FOUND AN 18\" CRACK IN THE WINDSHIELD. THERE WAS NO INDICATION THE PREVIOUS DAY THAT THERE WAS ANY DAMAGE DONE TO THE WINDSHIELD. THIS IS A KNOWN DEFECT IN THE MANUFACTURERS VEHICLES THAT THE WINDSHIELDS BREAK WITHOUT ANY REASON. CRACK HAS QUICKLY BECOME LARGER SINCE THE INITIAL CRACK, WILL SOON COMPLETELY GO ACROSS THE WINDSHIELD.  *TR",
        "vin": "4S3GTAD63K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/04/2020",
        "dateOfIncident": "05/02/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323189,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD SPONTANEOUSLY CRACKED WHILE PARKED IN DRIVEWAY FOR TWO DAYS.",
        "vin": "4S3GTAA63K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/24/2020",
        "dateOfIncident": "03/09/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322160,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN THE HIGHWAY AT 60 MPH, I HEARD A VERY SMALL CRACKING SOUND AND THOUGHT NOTHING OF IT. ALMOST IMMEDIATELY, I HAD A 14 INCH CRACK PROPAGATING FROM THE BOTTOM EDGE MIDDLE OF THE WINDSHIELD. I COULD NOT FIND A CHIP LOCATION IN THE BOTTOM OF THE WINDSHIELD, NOTING IT MAY HAVE BEEN A VERY SMALL OBJECT THAT DIDN'T MAKE A CHIP. I CALLED SUBARU AND TOLD THEM THE ISSUE, BUT THEY REFUSED TO WARRANTY OR REPLACE IT, AND TOLD ME IT WAS AN ACT OF GOD. WHILE A BROKEN WINDSHIELD IS COMMON WITH LARGE ROCKS AND STONES, I BELIEVE THAT SUBARU KNOWS THAT THERE NEW ACOUSTIC WINDSHIELDS ARE INCREDIBLE WEAK. NEW WINDSHIELDS DO NOT FIX THE ISSUE AND ARE INCREDIBLE EXPENSIVE. THIS CONCERNS ME, IF A LARGER OBJECT WERE TO HIT THE WINDSHIELD, HOW WOULD IT SUSTAIN THE IMPACT FORCES AND PROTECT EVERYONE INSIDE THE VEHICLE?",
        "vin": "4S3GTAA66K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/14/2020",
        "dateOfIncident": "12/20/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321106,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "8000 MILES ON THE CAR.  LARGE CRACK FORMED IN WINDSHIELD ON PASSENGER SIDE AFTER GOING OVER A TYPICAL BUMP IN THE ROAD.  CRACK HAS PROPAGATED ACROSS THE WINDSHIELD QUICKLY.  SUBARU DECLINED A WARRANTY CLAIM.  THIS IS MY 4TH SUBARU, AND NOTHING LIKE THIS HAS EVER HAPPENED BEFORE.",
        "vin": "4S3GTAJ63K3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/08/2020",
        "dateOfIncident": "03/16/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320611,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WOKE UP ONE MORNING AND WENT OUT TO GO TO WORK TO DISCOVER THAT A CRACK HAD FORMED IN THE WINDSHIELD. IT STARTED FROM THE LOWER FRIT. THIS IS THE SECOND TIME A WINDSHIELD ON THIS CAR HAS CRACKED AND BOTH WERE SUBARU BRANDED CARLEX WINDSHIELDS. THE FIRST WINDSHIELD WAS FROM THE FACTORY, OBVIOUSLY, AND THE SECOND ONE WAS INSTALLED AT A SUBARU DEALERSHIP. REALLY ANNOYING SINCE I'VE ONLY HAD THE CAR FOR 14 MONTHS.",
        "vin": "4S3GTAC62K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/02/2020",
        "dateOfIncident": "04/01/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320074,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS ONLY THREE MONTHS OLD WITH VIRTUALLY NO HIGH SPEED HIGHWAY DRIVING.  I CAME OUT TO MY CAR ONE MORNING TO SEE A FOOT LONG CRACK ON MY WINDSHIELD, COMING FROM THE BOTTOM CORNER NEAR WHERE THE WIPERS REST.  BEING THAT I DELIBERATELY DRIVE REALLY FAR FROM THE CARS IN FRONT OF ME, I HAVE A HARD TIME BELIEVING THIS COULD HAVE RESULTED FROM A ROCK.  I FEEL THIS TIES IN WITH THE ONGOING CLASS ACTION LAWSUIT CONCERNING DEFECTIVE WINDSHIELD.",
        "vin": "4S3GTAM68K3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/18/2020",
        "dateOfIncident": "03/02/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318593,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD CRACKED FROM THE LOWER LEFT SIDE OF THE WINDSHIELD AND IS MOVING UPWARD AND ACROSS THE WINDSHIELD. THERE IS NO REASON FOR THE CRACK IT JUST HAPPENED ON ITS OWN. IT HAPPENED WHILE PARKED OVER NIGHT.",
        "vin": "4S3GTAA67K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/14/2020",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318002,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR SENSOR DOES NOT EFFECTIVELY RECOGNIZE CARS IN FRONT OF ME NOW THAT I HAVE NEW WINDSHIELD",
        "vin": "4S3GTAU66K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/14/2020",
        "dateOfIncident": "01/19/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318007,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "A CRACK, LONGER THAN A DOLLAR BILL, RANDOMLY APPEARED ON MY WINDSHIELD ONE DAY WHEN THERE WAS NONE THE PREVIOUS DAY. MY CAR WAS PARKED IN MY DRIVEWAY DURING THIS TIME. THE CRACK WAS VERY CLEAN AND VERY SUDDEN. NO ROCKS OR DEBRIS HIT MY WINDSHIELD. I JUST WOKE UP ONE DAY TO FIND THIS VERY LARGE CRACK. I WENT THROUGH MY GEICO INSURANCE TO FIX MY GLASS THINKING IT WAS A CRACK THAT WAS CAUSED BY COLD TEMPERATURES. THE MONTH OF JANUARY IS THE MIDDLE OF WINTER. BUT A CRACK THAT LARGE WAS VERY SUSPICIOUS REGARDLESS AND FOUND OUT TWO MONTHS LATER THAT IT IS HIGHLY POSSIBLE THAT MY WINDSHIELD WAS DEFECTIVE. I BOUGHT MY CAR NOT TOO LONG AGO IN JUNE OF 2019 AND THE CRACK APPEARED JUST ABOUT 6 MONTHS LATER.",
        "vin": "4S3GKAM63K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/14/2020",
        "dateOfIncident": "02/11/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318070,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN WHITE ROCK RD, EL DORADO HILLS, CA. A TINY PIECE OF METAL MUST HAVE FELL BUT IT HIT THE BOTTOM MIDDLE OF THE WINDSHIELD. IT BARELY EVEN LEFT A MARK, I CONTINUED TO DRIVE TO MAKE IT TO WORK. BY THE TIME I HAD MADE IT HOME IT HAD TURNED INTO A FULL BLOWN VISION PROBLEM. AS I WAS DRIVING IT WOULD MAKE AUDIBLE CRACKING NOISES AND I FIXED IT IMMEDIATELY. NEVER HAVE I SEEN A CARS WINDSHIELD SO VULNERABLE BEFORE.    WHITE ROCK RD IS A BACK ROAD AND I WAS IN MOTION.",
        "vin": "4S3GKAJ60K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/13/2020",
        "dateOfIncident": "03/21/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317951,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD CRACKED TWICE IN A MONTH PERIOD SMALL PEBBLES THAT I'VE HIT BEFORE HAVE NEVER DONE THIS MUCH DAMAGE IT CAUSED  THREE UN REPAIRABLE CRACKS",
        "vin": "4S3GKAB62K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/24/2020",
        "dateOfIncident": "02/16/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311012,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 2/16/2020, WHILE DRIVING AT A NORMAL SPEED (~20MPH) IN CLEAR CONDITIONS IN DOWNTOWN PHILADELPHIA, PA, A SMALL OBJECT (POTENTIALLY A ROCK) FELL OFF AN OVERPASS I WAS DRIVING UNDER, HIT THE PASSENGER SIDE OF THE WINDSHIELD OF MY CAR, AND CAUSED AN APPROXIMATELY 10-INCH CRACK.    THE OBJECT THAT CAUSED THE CRACK WAS NOT LARGE ENOUGH FOR MY PASSENGER TO EVEN NOTICE WHEN IT HIT. THE CRACK IT CAUSED IN THE WINDSHIELD WAS UNREASONABLY LARGE, WHEN OTHER, LARGER OBJECTS (LIKE ROCKS) HAVE HIT THE WINDSHIELD IN THE COURSE OF NORMAL HIGHWAY DRIVING WITHOUT CAUSING DAMAGE.    THE REPAIR COST A TOTAL OF ~$1,000, OF WHICH I WAS RESPONSIBLE FOR $500. I HAVE ATTACHED AN IMAGE OF THE CRACK AND A COPY OF THE INVOICE FROM THE WINDSHIELD REPLACEMENT.",
        "vin": "4S3GTAS66K3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/24/2020",
        "dateOfIncident": "06/24/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311106,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ONLY A FEW MONTHS AFTER LEASING A BRAND NEW 2019 SUBARU IMPREZA SPORT, I WAS DRIVING ON A HIGHWAY I HAVE TAKEN 100'S OF TIMES AND A SMALL ROCK HIT MY WINDSHIELD. THIS CAUSED MY WINDSHIELD TO CRACK AND KEEP SPLITTING UNTIL IT COVERED A GOOD 2 FEET OF THE GLASS. THIS CONTINUED AFTER THE CAR WAS PARKED. I HAD TO PAY MY DEDUCTIBLE TO HAVE THE WINDSHIELD REPLACED. I THOUGHT THIS WAS ODD BECAUSE I HAVE NEVER HAD THIS HAPPEN TO ANY OTHER VEHICLE, ESPECIALLY SO EASILY.",
        "vin": "4S3GKAJ64K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/23/2020",
        "dateOfIncident": "01/20/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310861,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FIRAT EXPERIENCE WAS,  I PARKED MY CAR AND BEEN TO GROCERY STORE WHEN I CAME BACK AND DRIVING THEN I FOUND A CRACK WITH OUT A CHIP CRACK SOUND AND THE SECOND EXPERIENCE ALMOST SIMILAR BEFORE PARKING I FOUND NO CRACK AND WHEN MY CAR WAS STATIONARY WHICH THERE WAS NO MOTION SURPRISINGLY I FOUND ANOTHER CRACK WHICH IS ABOVE 10 INCHES. AND AFTER MY 1ST WINDSHIELD REPLACEMENT I FOUND EYE SIGHT IS NOT WORKING AS WELL AS BEFORE. THERE IS NO PROPER RESPONSE AFTER MY SECOND WINDSHIELD COMPLAINT AND STILL WAITING FOR REPLACEMENT AND I AM DRIVING WITH CRACK WINDSHIELD WHICH I HAVE NO OTHER CHOICE.",
        "vin": "4S3GKAM63K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/27/2020",
        "dateOfIncident": "01/25/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302148,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR'S WINDSHIELD CRACKED OVERNIGHT WHILE SITTING IN A GARAGE, WITH NO IMPACT TO IT. IT IS 2 MONTHS OLD.",
        "vin": "4S3GTAA63K3"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/06/2020",
        "dateOfIncident": "01/05/2020",
        "fire": true,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297486,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR CAUGHT FIRE ON THE MORNING OF SUNDAY, JANUARY 5, 2020 WHILE STATIONARY IN A PARKING LOT. THE CAR HAD BEEN STATIONARY FOR APPROXIMATELY 12 HOURS. THE ATTENDING FIRE DEPARTMENT FELT THE FIRE STARTED IN THE ENGINE COMPARTMENT, AND CONSUMED THE ENTIRE CAR BY THE TIME IT WAS EXTINQUISHED. THE CAR WAS A TOTAL LOSS. THE CAR RAN PERFECTLY UNTIL THEN, AND HAD IT'S ROUTINE 1ST SERVICE BY A SUBARU DEALER AROUND 5,000 MILES. MORE PHOTOS ARE AVAILABLE.",
        "vin": "4S3GKAB62K3"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/05/2019",
        "dateOfIncident": "11/27/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287221,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 SUBARU IMPREZA. WHILE DRIVING VARIOUS SPEEDS, THE HEADLIGHTS DIMMED AS THE VEHICLE SLOWED DOWN. WHEN THE VEHICLE CAME TO A COMPLETE STOP, THE HEADLIGHTS BRIGHTENED AND OPERATED NORMALLY. THE CONTACT TOOK THE VEHICLE TO STUCKEY SUBARU (500 BROAD ST, HOLLIDAYSBURG, PA 16648, (814) 695-9862), BUT THEY WERE UNABLE TO DUPLICATE THE FAILURE AND DEEMED THE MATTER TO BE A NORMAL FUNCTION. THE MANUFACTURER WAS NOTIFIED AND STATED THAT THEY WERE AWARE OF THE MATTER; HOWEVER, THEY DID NOT HAVE A RESOLUTION AND THE VEHICLE WAS NOT INCLUDED IN A RECALL. THE CONTACT WAS PROVIDED CASE NUMBER: 1-50768087045. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 1,600.",
        "vin": "4S3GTAJ61K3"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/22/2019",
        "dateOfIncident": "11/20/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281776,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN SHIFTING QUICKLY INTO 4TH GEAR ON THE MANUAL TRANSMISSION AT HIGHER RPM'S (ABOVE 3000), THE GEAR GRINDS. IF YOU SHIFT SLOWLY, IT DOESN'T. IT SEEMS TO BE ONLY THE 4TH GEAR DOING THIS. MY CAR HAS 1300 MILES ON IT. I AM WONDERING IF IT BECAUSE THE RPM'S HANG WAY TOO LONG. I HAVE BEEN DRIVING A MANUAL DAILY FOR 28 YEARS. I AM ALSO A PROFESSIONAL TRUCK DRIVER, SO I KNOW HOW TO PROPERLY DRIVE A STICK SHIFT. THE RPM HANG IS VERY ANNOYING AND COULD POTENTIALLY BE THE PROBLEM OF THE 5SPEED TRANSMISSION.",
        "vin": "4S3GKAJ65K1"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/12/2019",
        "dateOfIncident": "09/11/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255104,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STOPPED RUNNING WHILE DRIVING DOWN THE STREET. AUTOMOBILE WAS TOWED TO DEALER YESTERDAY (9-11-19).  DEALER, CALLED TODAY (9-12-19)  SAID PROBLEM IS A BAD FUEL PUMP AND MAY TAKE UP TO A MONTH TO GET THE ORDERED PART DELIVERED AND INSTALLED. NEW VEHICLE PURCHASED APRIL, 2019 A LITTLE LESS THAN 2800 MILES ON ODOMETER.",
        "vin": "4S3GTAD60K3"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/19/2019",
        "dateOfIncident": "07/15/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244945,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 SUBARU IMPREZA. WHILE DRIVING VARIOUS SPEEDS OVER BUMPS IN THE ROAD, THE CONTACT HEARD AN ABNORMAL DRAGGING, SCRAPING NOISE EMERGING FROM THE DRIVER'S SIDE OF THE VEHICLE. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO BUSAM SUBARU (6195 DIXIE HWY, FAIRFIELD, OH 45014) WHERE IT WAS DIAGNOSED THAT THE SHOCKS AND STEERING RACK ASSEMBLY NEEDED TO BE REPAIRED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND PROVIDED CASE NUMBER: 1-45992198970. THE CONTACT WAS PROVIDED A LOANER VEHICLE. THE FAILURE MILEAGE WAS 600. *BF*JB",
        "vin": "4S3GTAJ66K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/13/2019",
        "dateOfIncident": "08/10/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243542,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD CRACKED SPONTANEOUSLY. WAS DRIVING DOWN A SMOOTH OPEN ROAD AT 40MPH AND HEARD THE SOUND OF A CRACK. I LOOK TO MY PASSENGER SIDE AND A LONG CRACK WAS THERE. THE CRACK ITSELF STARTS FROM THE BOTTOM OF THE GLASS AND MAKES ITS WAY UP AND ACROSS. AGAIN, DRIVING DOWN AN OPEN ROAD SO THERE WAS NO OTHER VEHICLE IN FRONT OF ME TO KICK UP DEBRIS.",
        "vin": "4S3GKAM62K3"
    },
    {
        "components": "STEERING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/12/2019",
        "dateOfIncident": "07/24/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243254,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER OWNING THE CAR FOR A MONTH, I NOTICED THE HOOD HAD BECOME UNEVEN WHERE IT MEETS THE FRONT END. I ALSO BEGAN TO NOTICE A WIDER GAP BETWEEN THE HOOD AND THE RIGHT FENDER THAN ON THE LEFT SIDE. THIS GAP HAS WIDENED. WHEN I TOOK THE CAR BACK TO ALBANY SUBARU, THE SERVICE MANAGER MADE SOME ADJUSTMENTS THAT MADE MINIMAL IMPROVEMENTS TO THE HOOD WHERE IT MEETS THE FRONT END, THOUGH IT IS STILL UNEVEN. THE RUBBER GASKET STILL DOESN'T FILL THE GAP. THIS MADE THE GAP BETWEEN THE RIGHT FENDER AND HOOD EVEN WIDER. I TOOK THE CAR BACK TO ALBANY SUBARU. THE SERVICE MANAGER RAISED THE HOOD PAD ON ONE SIDE AND LOWERED IT ALL THE WAY ON THE OTHER SIDE AND DOCUMENTED THE CAR IS WITHIN SUBARU SPECS. I CONTACTED SUBARU. THEY WANT ME TO TAKE THE CAR TO ANOTHER DEALER FOR A SECOND OPINION. I AM WAITING FOR THE SECOND DEALER TO CALL ME BACK TO SCHEDULE AN APPOINTMENT.  I HAVE ALREADY SENT SUBARU PHOTOS OF THE PROBLEMS AND MY CONCERN THAT THE GAP IS CONTINUING TO GET WIDER AS I DRIVE.  THE OTHER ISSUE IS THE STEERING. THERE HAVE BEEN FOUR TIMES WHERE THE STEERING SEEMS TO MOMENTARILY DISAPPEAR. BY THIS I MEAN I GET THE FEELING THE STEERING WHEEL IS COMPLETELY LOOSE, NO NORMAL TENSION WHILE HOLDING THE STEERING WHEEL STRAIGHT. BY THE TIME I CAN REACT, THE NORMAL TENSION RETURNS TO THE STEERING WHEEL.  THE SERVICE MANAGER TOLD ME THIS IS THE LANE DRIFT MONITORING OF THE CAR. I TOLD HIM I EXPERIENCE A QUICK VIBRATION OF THE STEERING WHEEL WHEN DRIFTING LANES, NOT A COMPLETE LOSS OF STEERING. HE IGNORED ME AND SAID THE STEERING IS FINE.  NHTSA WEB SITE ONLY LET ME UPLOAD ONE PHOTO. I HAVE FIVE PHOTOS TO SHOW MEASUREMENTS ON ALL SIDES OF  THE HOOD GAPS",
        "vin": "4S3GTAU62K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/29/2019",
        "dateOfIncident": "07/28/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240289,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "IN LESS THAN 3,000 MILES OF OWNERSHIP THE WINDSHIELD STARTED MAKING CREAKING NOISES AND WITHIN TWO WEEKS IT SUDDENLY GAVE WAY TO A STRESS CRACK ABOUT 14 INCHES LONG ABOUT TWO-THIRDS OF THE WAY UP THE WINDSHIELD ON THE PASSENGER SIDE STARTING AT THE EDGE OF THE WINDSHIELD.",
        "vin": "4S3GTAA64K1"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/23/2019",
        "dateOfIncident": "06/23/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222002,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WINDSHIELD SPONTANEOUSLY CRACKED WHILE THE CAR WAS SITTING IN THE DRIVEWAY. THE CAR HAS 3,000 MILES AND THE WAS NO PREVIOUS ROCK OR STONE IMPACT OR CHIP.",
        "vin": "4S3GKAM61K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/22/2019",
        "dateOfIncident": "06/19/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221895,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD SPONTANEOUSLY CRACKED. I WAS PULLING OUT OF DRIVEWAY AND STOPPED TO PLUG IN MY PHONE WHEN THE WINDSHIELD POPPED AND CRACKED. THERE WAS NO FLYING DEBRIS THAT HIT THE WINDSHIELD THEN OR PREVIOUSLY. WE TOOK TO DEALERSHIP FOR ASSESSMENT BECAUSE WE FELT IT WAS A STRESS CRACK, BUT THEY SAID IT WASN'T AND THEY WOULDN'T REPLACE IT.",
        "vin": "4S3GTAT67K3"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/13/2019",
        "dateOfIncident": "12/19/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195959,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WILL NOT TRACK STRAIGHT.  AT 60 MPH+ YOU MUST MAKE CONSTANT SMALL STEERING CORRECTIONS TO KEEP THE CAR IN YOUR LANE. IT CONSTANTLY DARTS SIDE TO SIDE.   THE STEERING WHEEL ALSO WILL NOT SELF CENTER AFTER A TURN. YOU HAVE TO PHYSICALLY PULL THE WHEEL BACK TO CENTER THE LAST 5 DEGREES TO GET THE CAR TO GO STRAIGHT.    THERE IS NO ONCENTER FEEL IN THE STEERING.  THE DEALER TRIED ALIGNMENT TO NO AVAIL.  DEALER DROVE 2 OTHER NEW CARS OFF HIS LOT AND NOTICED THE SAME CONDITION SO HE CONTACTED SUBARU",
        "vin": "4S3GTAT63K3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/10/2019",
        "dateOfIncident": "03/09/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185650,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER OWNING MY CAR FOR FIVE MONTHS THE WINDSHIELD IS CRACKED AGAIN I HAVE HAD IT REPLACED TWICE ALREADY. THERE IS A SERIOUS DEFECT IN THE WINDSHIELD THAT SUBARU IS USING ON THE IMPREZA VEHICLE",
        "vin": "4S3GTAM63K3"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/05/2019",
        "dateOfIncident": "01/05/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165423,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "SRS AIRBAG LIGHT STAYS ON.  CAR ONLY GAS 150 MILES.",
        "vin": "4S3GTAD65K3"
    }
]