[
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/24/2021",
        "dateOfIncident": "06/11/2021",
        "fire": false,
        "manufacturer": "Tiffin Motorhomes, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426274,
        "products": [
            {
                "manufacturer": "Tiffin Motorhomes, Inc.",
                "productMake": "TIFFIN",
                "productModel": "ALLEGRO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "RV Diesel Exhaust Fuel (DEF Head) Sensor failure. This failure rendered our RV broken down and undriveable  (\"derate\" mode of 5 mph)  roughly 1,500 miles from home, on the freeway, in approx. 105 degree weather. We had our family with us & our dog. Note; we did NOT have a tow vehicle to transport us to a safe area. This constituted a VERY UNSAFE TO FATAL CONDITION / SITUATION!!!  Typically, RV's are not operated on a daily, or even weekly basis such as big rig trucks by truckers. That being stated, the DEF (diesel exhaust fuel) lifespan is greatly shortened (contaminated, crystallized) if not used on a regular basis.  -Being that these Diesel Exhaust Fuel Sensor failures have been occurring & re-occurring at a astronomical rate across the country, we firmly believe that RV's should be exempt from requiring DEF / DEF Sensors, period.   Please do not wait until there is a FATALITY, OR POSSIBLE GREATER FATALITIES  before making this change retroactive for all RV's nationally.",
        "vin": "5VBBA37A8KA"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/13/2021",
        "dateOfIncident": "05/03/2021",
        "fire": false,
        "manufacturer": "Tiffin Motorhomes, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416422,
        "products": [
            {
                "manufacturer": "Tiffin Motorhomes, Inc.",
                "productMake": "TIFFIN",
                "productModel": "ALLEGRO",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WE ARE HAVING A PROBLEM WITH THE SIDING CRACKING ON OUR TIFFIN ALLEGRO OPEN ROAD 36.  AFTER RETURNING FROM A PERIODIC MAINTENANCE SESSION AT LAZYDAYS RV DEALERSHIP (SEFFNER, FL) AND SETTLING IN AT OUR CAMPGROUND IN LAKELAND FL, WE NOTICED ON JANUARY 17, 2021 THAT OUR CAMPER DISPLAYED AN APPROXIMATELY TEN-INCH-LONG CRACK IN THE SIDING ON THE PASSENGER SIDE, JUST TO THE LOWER RIGHT CORNER OF THE SLIDE OUT ON THAT SIDE (SEE PICTURE).  WE EMAILED TIFFIN'S SERVICE DEPARTMENT, WHICH RESPONDED BY SAYING THAT THEY WERE AWARE OF SIMILAR ISSUES AND OFFERED TO PAY FOR ITS REPAIR.  WE MADE AN APPOINTMENT TO HAVE LAZYDAYS EFFECT THAT REMEDY.  SCHEDULING CONCERNS DICTATED THAT THE APPOINTMENT WAS NOT UNTIL MAY 3, 2021.  IN THE MEANTIME, WE REMAINED IN PLACE AT OUR LAKELAND CAMPGROUND.  UPON OUR RETURN TO LAZYDAYS, THE SERVICE REPRESENTATIVE POINTED OUT THAT A SECOND NEW CRACK HAD DEVELOPED ON THE PASSENGER SIDE, TRAILING FROM BELOW THE PASSENGER WINDOW HEADING TOWARDS THE DOOR FRAME (SEE PICTURE).  THE SERVICE REPRESENTATIVE SAID HE HAD WORKED A SIMILAR ISSUE RECENTLY ON ANOTHER TIFFIN OPEN ROAD IN WHICH TIFFIN PAID FOR THE REPAIR.  WE ALSO NOTED THAT THE FIRST CRACK WE IDENTIFIED HAD SEPARATED FURTHER.  AT THIS TIME, WE BECAME CONCERNED ABOUT THE OUTER BODY DELAMINATING WHILE DRIVING.   TIFFIN HAS YET TO PROVIDE AN EXPLANATION CONCERNING THIS.  IN ADDITION, TIFFIN'S LOCAL REPRESENTATIVE AT LAZYDAYS REFUSED TO OFFER SUFFICIENT WARRANTY ASSISTANCE TO PAY FOR BOTH CRACKS.  HE ALSO SAID, WITHOUT HAVING LOOKED AT OUR RV, THAT IT WAS SAFE TO DRIVE FROM TAMPA UP TO ITS FACILITIES IN RED BAY, AL.  WE EXPRESSED OUR CONCERN ABOUT THE SAFETY OF DRIVING THAT FAR, GIVEN THAT THESE TWO APPARENTLY STRUCTURAL CRACKS DEVELOPED AFTER THE TWO SHORT 25 MILE DRIVES BETWEEN OUR LAKELAND CAMPGROUND AND LAZYDAYS.  WE CANNOT IMAGINE WHAT WOULD HAPPEN DURING A SEVERAL HUNDRED-MILE JOURNEY.",
        "vin": "1F66F5DY5J0"
    }
]