[
    {
        "components": "ENGINE",
        "crash": true,
        "dateComplaintFiled": "03/27/2022",
        "dateOfIncident": "03/08/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458532,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I marked engine on the above as I did Not see anything about gas pedal acceleration.  At a slow speed turning a sharp right to enter a drive through restaurant, I had my right foot on the brake. The car suddenly accelerated on its own,  causing me to jump a curb & lose control. I landed between the restaurant building & drive through, taking out the signs & drive through.  It was sudden & a nightmare. Busted both front tires & We had to get a flatbed truck to remove. Some employees there remarked that I missed a pole by a few inches. They helped me out of the car, taking me inside the restaurant. I was crying & very emotional, but explained what happened.  I phoned my husband immediately & he came. I didn’t hit another car or hurt anybody. I was stoved up & shook up, but otherwise ok. I did get a back X-ray later because of pain, but thankfully no compressed fracture. The police was called & took my registration & helped get a tow truck. I explained what happened.  My husband asked that it be taken to the a Toyota dealership, but it was not as they do not have a repair shop there. The car is in a local shop for repair that the adjuster recommended. Have not received the first part for it as yet.  Insurance adjuster says $8500 in damage by phone, but we do not have a copy of this appraisal as yet. We will need to take it to Toyota for testing as soon as repairs are done & driveable, but regardless,  this is really what happened & I will be afraid to drive this car again.  This is vey dangerous & I could have been killed or killed somebody. We bought our car new in Early 2019 & I really liked it.  I’m posting this now because Toyota should want to know this information asap for the safety of their customers!",
        "vin": "4T1B61HK2KU"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "03/07/2022",
        "dateOfIncident": "03/07/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11455618,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "In JuneOf 2019 I got side swiped on the driver’s side beginning at the driver’s door while driving; the airbags did not deploy. The matter was taken care of by mutual agreement between attorney and other drivers insurance company (AAA). On 03/02/22 I was attempting to renew registration when I was informed that I had to take vehicle to dealer due to a recall on make and model before new registration could be issued. In the evening of 03/02/22 I stopped at the dealer and explained to one of the service reps that I was there because of a recall and he stated that there was a problem with airbags deploying WHILE driving; but it was too late in the evening because they were getting ready to close and the issue would take 2-3 hours to inspect. The following morning prior to the service department opening I dropped the car off for service. However, the service invoice makes no mention of the airbag system inspection. Instead, the invoice is for a low pressure fuel pump issue. As for my safety being affected, I now understand why the attorney handling the insurance claim as well as AAA’s insurance adjuster on the matter both stated “that’s odd” when they asked me (at separate times) if the airbags had deployed and I answered “no”. Apparently, according to the service techs comment on the recall having to do with airbags,  my safety was in danger at the time of the accident in 2019. But instead of showing that the issue was taken care of on the invoice, in less than 24 hours the problem went from airbags to a low pressure fuel pump. How was my safety put at risk? Being that the impact occurred at the driver’s door while I was driving and airbags failed to deploy, had I not veered to my right up the curb I could’ve suffered serious injury to the left side of my body, at least. Has the problem been reproduced? Unknown. Has the vehicle component been inspected? From techs statement on 03/02/22 and invoice on 03/03/22, UNKNOWN. No warnings of any kind.",
        "vin": "4T1B31HK3KU"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/26/2022",
        "dateOfIncident": "02/25/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454197,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Firstly I have experienced some weird behavior when accelerating from a stop and the vehicle quickly ramped up the rpm over 5k without shifting at all until correcting itself at the speed I was desiring. I wasn't stepping hard on the pedal at all and was just trying to get to 30 mph.   Additionally I experienced some hard shifting when accelerating abruptly as well. Making the acceleration not very smooth when passing someone in high speed traffic.",
        "vin": "4t1b11hk5ku"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/14/2022",
        "dateOfIncident": "01/14/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451946,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Toyota Camry. The contact stated while driving at various speeds, the brake pedal would make abnormal sounds when depressed. There were no warning lights illuminated. The vehicle was taken to the local dealer where it was diagnosed that the front rotors needed to be replaced. The contact stated that the vehicle was repaired; however, the failure reoccurred while driving. The contact stated that while driving at 40 MPH, an unknown warning message illuminated, indicating brake failure, and she heard abnormal sounds coming from under the hood of the vehicle. The contact veered to the side of the road, opened the hood, and noticed that the sounds were coming from the engine compartment. The contact was able to continue to drive the vehicle. The vehicle was taken to a second dealer; Frontier Toyota Service & Parts (23621 Creekside Rd, Valencia, CA 91355) who informed her that they could not duplicate the failure. The contact stated that the failure had been reoccurring while driving and the vehicle was taken back to the dealer where it was diagnosed that the vacuum pump and the front rotors needed to be replaced but the vehicle was not repaired. The dealer informed the contact that she would be responsible for the cost of the vacuum pump replacement since the repair was not covered under the vehicle warranty and the VIN was not included in NHTSA Campaign Number: 21V890000 (Service Brakes, Hydraulic). The vehicle was not repaired. The manufacturer was not notified of the failure. The failure mileage was approximately 35,000.",
        "vin": "4T1B11HK4KU"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/09/2022",
        "dateOfIncident": "02/09/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451240,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Toyota Camry. The contact stated that while driving at an undisclosed speed, the vehicle hesitated to accelerate while the accelerator pedal was depressed. The vehicle was not diagnosed nor repaired by an independent mechanic or the dealer. The manufacturer was made aware of the failure. The vehicle had previously been serviced by the dealer under an unknown NHTSA Campaign for the fuel pump. The failure mileage was approximately 44,000.",
        "vin": "4T1B11HK1KU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/31/2022",
        "dateOfIncident": "01/30/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449587,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving the car and heard a noise coming from the front and the car started stalling. Then the car stopped completely and would not turn on anymore. I got out and there was oil on the ground. A mechanic looked at the car and noted that pieces of the engine shattered and the was a crack on the engine, and there was a lot of oil that had leaked. The car has only 30,000 miles on it.",
        "vin": "4T1B11HK8KU"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "01/27/2022",
        "dateOfIncident": "01/27/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449187,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Issue with braking and vehicle stalls",
        "vin": "4T1B61HK9KU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/14/2022",
        "dateOfIncident": "12/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447538,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Toyota Camry. The contact stated that while driving at an undisclosed speed, the braking system warning message was displayed. The vehicle was taken to the dealer. The dealer replaced the brake pads; however, the failure recurred. The vehicle was taken back to the dealer and diagnosed with brake power booster and vacuum pump failure. The brake power booster and vacuum pump needed to be replaced. The vehicle was not repaired and remained at the dealer. The manufacturer was made aware of the failure but informed the contact that there was no recall associated with the VIN. The contact related the failure to NHTSA Campaign Number: 21V890000 (Service Brakes, Hydraulic) however, the VIN was not included in the recall. The failure mileage was approximately 95,000.",
        "vin": "jtnb11hk4k3"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/05/2022",
        "dateOfIncident": "12/02/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11446342,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Toyota Camry. The contact's daughter stated while driving approximately 5 mph where the contact's vehicle was impacted by another vehicle on the passenger side which resulted in none of the air bags being deployed. The contacts daughter was injured and sustained whiplash, sprain back, cervical and lumbar issues, headaches, migraines and sought medical treatment. A police report was taken and the vehicle was towed to an insurance lot where it was diagnosed as destroyed. The contact stated no warning lights were illuminated. The manufacturer was informed of the failure. The failure mileage was approximately 24,000.",
        "vin": "4T1B11HK0KU"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/29/2021",
        "dateOfIncident": "12/17/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445430,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Consul screen keeps going blank. Software updated by the dealer, still happening. Approached the dealer today, they want to tale a screen shot when it happens. This may cause an accident. Per dealer this screen connects  which almost all the electronics. Called Toyota about the same, they are saying dealer is the best to advise but screen shot  while driving is not advisable.   Reporting as this is seems to be safety issue.  Dealer told me there is no guarantee this will be fixed.",
        "vin": "4t1b61hk3ku"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/10/2021",
        "dateOfIncident": "12/09/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443391,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Unknown",
        "vin": "4t1b61hk3ku"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/23/2021",
        "dateOfIncident": "10/28/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441425,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "UNKNOWN and my incident and cause for my 2019 toyota camry will goes as the same other people description issues with 2019 Toyota Camry",
        "vin": "4T1B11HK2KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/15/2021",
        "dateOfIncident": "11/02/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440571,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I purchased my camera a few months back. My first complaint would be about the electrical system I assume. The automatic headlight feature does not work, it has caused my battery to die twice, when the driver door is open the interior lights don’t come on, and it will rarely start when using the key fob from inside to warm the vehicle. After purchasing I found out it had actually been wrecked & the carfax were not factual, assuming that could be a cause and not the actual vehicle being faulty. The main concern is that it sometimes doesn’t shift or struggles and will unexpectedly jerk into gear, then while cruising it seems to have some sort of lagging feel to it, also like a jerking feeling. I believe it may be a transmission issue but it feels very unsafe if you’re trying to maneuver in traffic when the vehicle isnt shifting properly almost causing another car to hit you",
        "vin": "4t1bz1hk0ku"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/03/2021",
        "dateOfIncident": "10/29/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439175,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "LDA Malfunction Check engine light Secondary Break Malfunction",
        "vin": "4T1B11HKXKU"
    },
    {
        "components": "AIR BAGS,FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "10/30/2021",
        "dateOfIncident": "10/29/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11438771,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "on 10/29/2021 my daughter was a passenger in her car and was involved in a rear end collision @ approximately 65-70 MPH upon collision with a Toyota Rav4. The Air Bags DID NOT deploy, The seat belt allowed her forward with her breast catching most of the impact, and the front camera system that should have detected the stopped Rav 4 did not alert. We had no error codes nor lights on this car prior and were not aware of any potential recalls. This is a complete failure of a car and safety systems that should have protected her. The entire reason this car was bought WAS to protect her and it completely and utterly failed. She is now in the ER with a broken sternum and currently being evaluated to see if any other vessel damage. We bought this car with the utmost in trust for the safety platform of Toyota as she is a double organ transplant recipient and at this time i am unsure if her transplanted kidney has been injured. The recall needs to immediately be expanded and we should have KNOWN PRIOR that this car had a potential issue and complete failure of all the front end collision safety systems! How is it that the air bags completely failed to deploy? Even the Virginia State Trooper on scene commented that he could not see why they had not deployed. I will follow up with more information and pictures as I obtain them after I make sure my daughter, her kidney graft and her boyfriend are ok.  I am attaching pictures of the car and of the car that was hit. At this time I only have the exterior pictures but will get the State Police Report and also will try to get interior pictures of the car.",
        "vin": "4T1BZ1HK1KU"
    },
    {
        "components": "SERVICE BRAKES,LANE DEPARTURE,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "10/26/2021",
        "dateOfIncident": "10/26/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438298,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "1st time this happened I turned car on around 4am after work and numerous alerts came on (LDA,CHECK ENGINE LIGHT,PRE-COLLISION SYSTEM,PARKING BRAKE MALFUNCTION,SECONDARY COLLISION BRAKE SYSTEM).I Kept turning car on and off but still alerts light up and not allow me to drive due to brakes on.  Had to disconnect battery then connect and alerts were gone. 2nd time I was driving and all sensor lights came up again. Locked up my brakes and luckily no cars near by that could have hit me. Took video of the issues when happened. Also on my screen the messages appear of what was malfunctioning. I am scheduling appointment for issue to be checked. But have had other people state same issue happened to them and decided to report issue. Will see if dealer finds issue, even though others people with same issues have not got a resolved issue from dealers. 1st incident was on 10/22/21 and 2nd incident was on 10/26/21",
        "vin": "4T1B61HK2KU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/15/2021",
        "dateOfIncident": "10/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436884,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "There is always a huge delay when accelerating with this car which has to do something with the transmission. If you press your foot on the gas, it will jerk and delay then take off. If you have to quickly accelerate to avoid a crash, you are not going to be able to since the car keeps doing this. I had a car speed towards me and I needed to get out of the way, but this delayed my acceleration and jerked. Luckily the other car braked and my car moved away enough after the delay to avoid any crash. This needs to be fixed on the 2019 models.",
        "vin": "4t1b61hk4ku"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/13/2021",
        "dateOfIncident": "10/12/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436690,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "There is a lag when stepping on the gas pedal.",
        "vin": "4T1B11HK1KU"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/14/2021",
        "dateOfIncident": "09/13/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432946,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Note - three similar incidents within 20 minutes.  Incident 1 - When pulling out of a parking lot and into traffic my 2019 Camry lost power and would not accelerate. It took me several seconds trying to figure out what was happening. I first thought engine stalled but that was not the case. I noticed a message pop up (and quickly disappear) on the dash display saying to \"release the accelerator pedal\" (may not be exact wording of the message as it happened very quickly). I took my foot off the accelerator pedal for a few seconds and then was able to regain acceleration control. When first starting to pull out of the parking lot the vehicle accelerated normally. I originally had more than ample time to pull out into the traffic but after the incident cars were stopping behind me as I was coasting. I had all other control (steering and braking).  Incident 2 - (Five minutes after incident 1) When doing a slow easy U-turn, my Camry lost power and would not accelerate.  Again my first thought was that the engine stalled but that was not the case. A message popped up (and quickly disappeared) on the dash display but I had no time to read it as I was trying to get out of traffic. I believe it was similar to \"release the accelerator pedal\".  I took my foot off the accelerator pedal for a couple of seconds and then was able to regain acceleration control.   Incident 3 - (about 5 minutes after incident 2). When pulling into the center turn lane from the normal travel lane, my Camry lost power and would not accelerate. I first thought the engine stalled but again that was not the case. I noticed a much longer message pop up (and quickly disappear) on the dash display but I had no time to read it. I took my foot off the accelerator pedal for a couple of seconds and then was able to regain acceleration control.",
        "vin": "4T1B11HK9KU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/21/2021",
        "dateOfIncident": "08/02/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430015,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Transmission is some times shifts slow and then fast acceleration when pulling in traffic it hesitate to go all most like you are going to be hit by another car",
        "vin": "4T1B11HK1KU"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/18/2021",
        "dateOfIncident": "07/13/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429617,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Toyota Camry. The contact stated that there was an abnormal odor of fuel inside and around the vehicle. The vehicle was taken to the local dealer where the vehicle was cleaned however, the failure recurred. The vehicle was previously repaired under NHTSA Campaign Number: 20V682000 (Fuel System, Gasoline).  The contact was concerned about a possible fire while driving the vehicle. The manufacturer was not notified of the failure. The failure mileage was approximately 21,000.   Vehicle has been repaired.",
        "vin": "4T1B11HK0KU"
    },
    {
        "components": "STEERING,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/17/2021",
        "dateOfIncident": "08/17/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429516,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle stalled in traffic at an intersection. Several warning lights displayed at the same time and was unable to steer or safely pull to the side of the road. Car would not start until key was removed and restarted. Was very fortunate that traffic was minimal and an accident was avoided. I'm certain this is secondary to the fuel pump recall that apparently, for some reason does not have a fix.",
        "vin": "4T1B11HKXKU"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/09/2021",
        "dateOfIncident": "08/09/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428352,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 TOYOTA Camry. The contact received a recall notification for NHTSA campaign number: 20V682000 (Fuel System, Gasoline) however, the part to do the recall repair was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was notified of the issue. The part was not available for the repair. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "4T1B61HK9KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/26/2021",
        "dateOfIncident": "06/12/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426406,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "On multiple occasions, and recently more frequently, when pulling out into traffic the vehicle stalls completely. There have also been numerous occasions when I try to accelerate that my vehicle stalls in traffic at stop signs or lights. There have been several close calls with accidents because of this.",
        "vin": "4T1BZ1HK2KU"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/25/2021",
        "dateOfIncident": "07/10/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426363,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "We had our fuel pump replaced in March 2021 by recall on our 2019 Camry. Four months later, at 70 mph on the interstate,  the engine cut out several times with the engine jerking on and off. Also, we had multiple malfunctions and warning lights on dash which included but were not limited to  LDA Malfunction, Pre-collision system malfunction, secondary brake system malfunction, check engine light on and reduced cruise control malfunction. We were lucky and managed to get off the road without getting hit from behind. We got off the interstate and managed to get home in \"limp mode\" with the engine cutting out another 4-5 times. On July 16, 2021, the dealer installed a second fuel pump after they reproduced the problem and verified the pump installed in March, 2021 was the problem. The mechanic said the defective fuel pump would be returned to Toyota for them to cut open and examine. There were no messages or symptoms prior to this failure with multiple warning lamps and malfunction messages appearing as the fuel pump failed. Spouse now will not drive the car and I do not trust it.",
        "vin": "4T1B11HK1KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/18/2021",
        "dateOfIncident": "07/18/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425319,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I received a recall remedy notice from Toyota (recall no. 20V-682) which says the subject vehicles are equipped witha low-pressure fuel pump which may stop operating, which increases the risk of crash when a vehicle stall occurs while driving. I contacted local dealership but I was told that the parts are currently not in stock and needs to be ordered. After I followed up several times, the parts are still not available. My vehicle registration will be expired at the end of July 2021. Without the recall issue being addressed, I would not be able to pass the inspection and then not able to get sticker renewed. The vehicle has not been recently inspected and there were no warnings or noticeable symptom. In short, the dealer is unable to address the issue in a timely manner which makes my renewal of registration impossible.",
        "vin": "4t1b11hk6ku"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/16/2021",
        "dateOfIncident": "01/15/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425130,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "my vehicle was part of the fuel pump recall for 2019 Camry, after taking it to my local dealer the fuel pump was replaced in January 2021. After driving the vehicle a week or so I noticed the exact same issues were happening again. Stalling at red lights, sluggish to take off and random jerking of the vehicle as if it were running out of gas. Took the vehicle back, dealership test drove it and told me this was characteristic of a Camry. I have owned two other Camrys in the past and have NEVER had an issue like this. PLEASE HELP.",
        "vin": "4T1B11HK1KU"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/12/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424371,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Toyota Camry. The contact stated while driving at various speeds, the vehicle would hesitate upon the depression of the accelerator without warning. The contact then discovered that her vehicle was included in NHTSA campaign number: 20V682000 (Fuel System, Gasoline). The contact then took the vehicle to the dealer and the recall repair was performed. Soon after the repair, the failure recurred. The contact called the same dealer and made an appointment for the vehicle to be serviced. The manufacturer was not notified of the failure. The vehicle was not repaired. The failure mileage was unknown.",
        "vin": "4t1b11hk1ku"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/12/2021",
        "dateOfIncident": "07/09/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424487,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Toyota Camry. The contact stated that after the vehicle was started, the Air Bags/Seatbelt pre-tensioner warning light illuminated. The vehicle was taken to the dealer where it was diagnosed that the Air Bags/Seat Belt pre tensioner failed and needed to be replaced. The vehicle was not repaired. The failure recurred. The contact referenced NHTSA Campaign Number: 19V567000 (Air Bags) as a possible solution to the failure however, the VIN was not included. The manufacturer was not notified of the failure. The failure mileage was approximately 74,000.",
        "vin": "4T1B11HK5KU"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/28/2021",
        "dateOfIncident": "06/21/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422706,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Toyota Camry. The contact stated that while the vehicle was in for routine maintenance, it was determined that the steering inner tie rods were loose, and the entire steering rack needed to be replaced. The cause of the failure was not yet determined. The vehicle was repaired, and the failure was remedied. The manufacturer was notified of the failure. The failure mileage was 46,302.",
        "vin": "4T1B11HK5KU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/17/2021",
        "dateOfIncident": "06/10/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421277,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The 2019 Toyota camry having issues with the transmission. When accelerating from a complete stop, the transmission hesitate for a few seconds before it jolts forward when shifting gears. it also does this when traveling at a higher speed. When I slow down approaching a red at 30mph, the light will turn green and when I try accelerating it jerks pretty bad. Another thing I've experienced is the car shaking or rattling while drive early in the morning. always happens between 630-700am. Ive gone to Toyota and they said the car have to get used to me driving.",
        "vin": "4T1B11HK9KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/17/2021",
        "dateOfIncident": "05/17/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417513,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Car suddenly accelerated after putting the car in park mode. The acceleration stopped after I pumped the brakes. Now there is a warning light on the car.",
        "vin": "4t1b11hk9ku"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/23/2021",
        "dateOfIncident": "03/12/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407668,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 TOYOTA CAMRY. CONSUMER WRITES REGARDING DEFECTIVE TIRES. *LD     THE CONSUMER REQUESTED ASSISTANCE WITH THE PURCHASE OF NEW TIRES THAT WERE NEEDED IN ORDER TO PASS THE STATE INSPECTION.*JS",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/23/2021",
        "dateOfIncident": "04/21/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413501,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL FLASHERS STOPPED WORKING IN VEHICLE INCLUDING HAZARD AT 39,000 MILES BUT MAKES THE NOISE AS IF YOUR SIGNALS ARE ON.  CHECKED FUSES AND IT IS NOT A FUSE SO IT MUST BE FAULTY EQUIPMENT.   THE HEATED MIRRORS HAVE NOT WORKED SINCE DAY 1, I THOUGHT THE CAR DID NOT COME WITH THEM UNTIL I SAW THE FUSE WHEN CHECKING THE SIGNAL LIGHTS.",
        "vin": "4T1B11HK9KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/21/2021",
        "dateOfIncident": "04/10/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413161,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2019 CAMRY WAS TAKEN IN FOR SERVICE UNDER THE FUEL PUMP RECALL AND AFTER PICKING THE VEHICLE UP AFTER REPAIR WE DROVE THE VEHICLE FOR 45 MINUTES AND HAD A POUNDING HEADACHE, NAUSEA AND CLOSE TO VOMITING FROM FUEL VAPORS INSIDE THE VEHICLE. THE VEHICLE WAS RETURNED TO THE DEALER AND THEY STATED IT WAS OK. THE NEXT MORNING WE WOKE UP TO OUR GARAGE SMELLING DUMPED OUT GASOLINE AND THE INSIDE OF THE CAMRY WAS OVERWHELMED WITH GASOLINE ODOR AND VAPORS.  WE CALLED THE LOCAL FIRE DEPARTMENT WHO HAD TWO FIRE DEPARTMENT CREW EXAMINE THE VEHICLE AND THEY AGREED IT SMELLED LIKE GASOLINE INSIDE THE VEHICLE.  THE VEHICLE WAS RETURNED TO THE DEALER AND THEY HAD A FACTORY REP LOOK AT THE FUEL PUMP WHO STATED AS REPORTED TO US THERE WAS NOT A PROPER SEAL.  WE PICKED UP THE VEHICLE ON 4/17/21 AND ON 4/20/21 AS THE SHAMPOO SMELL WAS GOING AWAY FROM WHERE THEY SHAMPOOED THE BACK SEAT THE GASOLINE SMELL IS NOW THERE AGAIN.  THE ONLY WAY TO PROPERLY FIX THIS INSTEAD OF GUESSING WHERE THE FUEL LEAK IS WOULD BE TO USE A GAS DETECTOR THAT MEASURES IN PARTS PER MILLION AND LOCATE THE LEAK AND ALSO LIKELY REPLACE THE CARPET AT A MINIMUM.  WE NEED YOUR HELP IN RESOLVING THE SERIOUS SAFETY ISSUE.",
        "vin": "4T1B11HK5KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/08/2021",
        "dateOfIncident": "04/08/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407100,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I DON'T HAVE THIS CAR ANYMORE, I CHANGED THIS CAR TO TOYOTA TACOMA 2021",
        "vin": "4T1B11HKXKU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/07/2021",
        "dateOfIncident": "08/10/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406894,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON ACCELERATION VEHICLE HESITATES IF CAR IS STARTED FROM A COMPLETE STOP YOU PRESS ON THE GAS PEDAL AND IT TAKES LIKE 1 TO 5 SECONDS BEFORE YOU FEEL ANY ACCELERATION.",
        "vin": "4T1B11HK6KU"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/06/2021",
        "dateOfIncident": "02/16/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406731,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA CAMRY. THE CONTACT STATED WHILE DRIVING 50 MPH, THE VEHICLE JERKED AND VIBRATED ABNORMALLY. THE CONTACT STATED THAT THE FAILURE RECURRED SEVERAL TIMES. THERE WAS NO WARNING LIGHT ILLUMINATED. THE CONTACT TOOK THE VEHICLE TO DARCARS KIA OF FREDERICK (5826 URBANA PIKE, FREDERICK, MD 21704) TO BE DIAGNOSED. THE CONTACT STATED THAT THE VEHICLE WAS REPAIRED HOWEVER, SHE WAS NOT INFORMED AS TO WHAT CAUSED THE FAILURE OR WHAT WAS REPAIRED. THE CONTACT STATED THAT THE FAILURE RECURRED. THE VEHICLE WAS NOT YET REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 31,000.*DT*DT*LN",
        "vin": "4T1B11HKXKU"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/29/2021",
        "dateOfIncident": "03/03/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405284,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "STRUCTURAL ISSUE WITH TIRE- GOLF BALL SHAPED BUBBLE ON THE SIDE OF THE TIRE",
        "vin": "4T1B11HKXKU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/23/2021",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404584,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 5 SEPARATE OCCASIONS THE BRAKE PEDAL WENT ALMOST COMPLETELY TO THE FLOOR BOARD WHEN TRYING TO STOP. I HAD TO PUMP THE BRAKES 2 TO 3 TIMES TO BUILD PRESSURE TO COME TO A STOP. I'VE TAKEN IT TO THE DEALER SEVERAL TIMES, ONLY FOR THEM TO TELL ME THEY CAN'T DUPLICATE MY CONCERNS. EVEN THOUGH I TOLD THEM IT HAPPENS RANDOMLY. IT'S NOT SOMETHING THAT CAN BE EASILY DUPLICATED. THIS IS A VEHICLE THAT I'M AFRAID TO DRIVE. FOR MY SAFETY, MY PASSENGERS AND FOR THE GENERAL PUBLIC ON THE ROAD",
        "vin": "4T1B11HK7KU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/23/2021",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404595,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE I BOUGHT MY 2019 CAMRY IN SEPTEMBER OF 2019. ON 5 DIFFERENT OCCASIONS WHEN I APPLIED THE BRAKES. THE BRAKE PEDAL WENT ALMOST COMPLETELY TO THE FLOORBOARD. I HAD TO PUMP THE BRAKE PEDAL SEVERAL TIMES TO BUILD PRESSURE TO STOP. IT'S HAPPENED TWICE ON THE HIGHWAY AND 3 TIMES ON CITY STREETS. I'VE TAKEN IT IN TO THE DEALERSHIP MULTIPLE TIMES. ONLY FOR THEM TO TELL ME THEY CAN'T DUPLICATE MY CONCERNS. I'VE STATED TO THEM EVERY TIME THAT IT HAPPENS RANDOMLY WHILE I'M DRIVING. IT'S NOT SOMETHING THAT CAN BE EASILY DUPLICATED.",
        "vin": "4T1B11HK7KU"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/22/2021",
        "dateOfIncident": "11/02/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404185,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA CAMRY. THE CONTACT STATED THAT THE VEHICLE INTERMITTENTLY FAILED TO START-UP WITHOUT WARNING AFTER SEVERAL ATTEMPTS. THE CONTACT STATED THAT THE VEHICLE STALLED INTERMITTENTLY WHILE DRIVING AT VARIOUS SPEEDS, WITHOUT WARNING. THE CONTACT THEN RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V682000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE VEHICLE WAS TAKEN TO FLOW TOYOTA OF STATESVILLE (997 FOLGER DR, STATESVILLE, NC 28625) HOWEVER, THE MECHANIC WAS UNABLE TO DUPLICATE THE FAILURE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS 6,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.  *JS",
        "vin": "4T1B11HK6KU"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/17/2021",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403548,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA CAMRY. THE CONTACT STATED THAT WHILE HIS WIFE WAS DRIVING 65 MPH, THE VEHICLE STARTED TO HESITATE. THE CONTACT STATED THAT THERE WAS NO WARNING LIGHT ILLUMINATED. THE VEHICLE WAS DRIVEN TO HER DESTINATION. THE VEHICLE WAS TAKEN TO CARLOCK TOYOTA OF TUPELO (882 CROSS CREEK DR, SALTILLO, MS 38866, (662) 842-6428) WHERE IT WAS DIAGNOSED WITH NEEDING TO RESTART THE TRANSMISSION CONTROLLER. THE VEHICLE WAS REPAIRED BUT CONTINUED TO EXPERIENCE THE FAILURE. THE VEHICLE WAS TAKEN BACK TO THE DEALER FOUR TIMES AND TRANSMISSION CONTROLLER THREE TIMES. THE VEHICLE WAS ALSO REPAIRED UNDER NHTSA CAMPAIGN NUMBER: 20V682000 (FUEL SYSTEM, GASOLINE). THE CONTACT STATED THAT THE FAILURE PERSISTED. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 6,000.",
        "vin": "4T1B11HK2KU"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "03/15/2021",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403096,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA CAMRY. THE CONTACT STATED THAT THE PASSENGER'S SIDE BLIND SPOT INDICATOR WARNING LIGHT INTERMITTENTLY FAILED TO OPERATE AS NEEDED, WITHOUT WARNING. THE CONTACT HAD TAKEN THE VEHICLE TO LITHIA TOYOTA OF MEDFORD (1420 N. RIVERSIDE AVE, MEDFORD, OR 97501) AND WAS INFORMED THAT THE BLIND SPOT INDICATOR LIGHT WAS OPERATING AS DESIGNED. THE MANUFACTURER WAS NOTIFIED TWICE OF THE FAILURE AND REFERRED HER TWICE TO THE LOCAL DEALER FOR ASSISTANCE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "4T1B11HKXKU"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/14/2021",
        "dateOfIncident": "03/14/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402945,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENTLY THE CAR WILL LURCH AHEAD.  THIS IS UPON START FROM A STANDING START AND ALSO ON THE HIGHWAY WHEN ACCELERATING.  OUR SERVICE WRITER SAID THAT THERE HAVE BEEN SEVERAL COMPLAINTS BUT THAT IS JUST THE WAY IT IS.  I HAVE NEVER HAD A CAR ACT THIS WAY BEFORE AND I THINK IT IS A SAFETY ISSUE.  THIS HAS BEEN A PROBLEM SINCE WE BOUGHT THE CAR.",
        "vin": "4T1B11HK6KU"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/12/2021",
        "dateOfIncident": "03/04/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402677,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWN A 2019 TOYOTA CAMRY. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V682000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. TRACY TOYOTA (2895 NAGLEE RD, TRACY, CA 95304) AND THE MANUFACTURER WERE MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "4T1B11HK0KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/01/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398427,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE FIRST TIME, I'M STARTING TO FEEL THE ISSUES OF THE RECALL. MY CAR WILL NOT ACCELERATE REGARDLESS OF HOW HARD I PRESS THE GAS. IT TENDS TO IDLE HIGH WHEN IN PARK OR AT RED LIGHTS. THIS IS DANGEROUS, AND I'M ANNOYED THAT THERE HAS NOT BEEN A REMEDY FOR A KNOWN ISSUE.",
        "vin": "4T1B11HK8KU"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/28/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398298,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY 2019 CAMRY IN NOV 2019.  IT HAS A TENDENCY TO BE SLUGGISH AND I THOUGHT IT WAS DUE TO IT BEING A 4 CYLINDER UNTIL I RECEIVED THE RECALL.  NOW, I AM CONCERNED ABOUT TAKING TRIPS ANYWHERE FOR FEAR OF IT STALLING OUT.",
        "vin": "4T1B61HK9KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/27/2021",
        "dateOfIncident": "02/17/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398198,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BEFORE FINDING OUT ABOUT THE FUEL/STALL RECALL I HAD A COUPLE OF ISSUES WHICH I DID REPORT TO THE PANAMA CITY, FL TOYOTA DEALERSHIP WHERE I PURCHASED MY 2019 TOYOTA CAMERY. EACH TIME THEY CHECKED IT OUT I WAS INFORMED THAT THEY COULD NOT SEE OR FIND ANYTHING IN THE CARS SYSTEM (I'M GUESSING THE CARS COMPUTER/DIAGNOSTIC SYSTEM I DON'T KNOW). I KNOW THIS THE CAR SHUTTERS/VIBRATES/SPUTTERS WHATEVER OR HOWEVER YOU'D LIKE TO EXPLAIN IT, LIKE IT HAS BAD GAS IN IT. I RUN ONLY GOOD GAS NO LOW GRADES. THEN I FOUND OUT ABOUT THIS RECALL AND HAVE CALLED THE PC TOYOTA DEALERSHIP SERVICING DEPARTMENT 5 OR 6 TIMES THAT I KNOW OF AND KEEP GETTING PUT OFF THAT THEIR HQ OFFICE HASN'T APPROVED THE REPAIRS TO DATE. SO I NOW AM SCARED TO DRIVE IT!!!!!! I HAVE ALWAYS BEEN TREATED AND BEEN TAKEN WELL CARE OF BY THE PC DEALERSHIP BUT AT THIS POINT I AM SO DISAPPOINTED/ANGRY/UNSATISFIED WITH THIS CAR/PC DEALERSHIP AND TOYOTA IN GENERAL. MY LIFE AND OTHER CONSUMERS THAT TRUST/TRUSTED IN THIS PRODUCT/VEHICLE ARE NOW IN DANGER OF DRIVING A CAR THAT COULD STALL AND CRASH AND THAT COULD CAUSE INJURY AND POSSIBLY EVEN DEATH BECAUSE OF THIS RECALL ISSUE. AND WE KEEP GETTING PUT OFF WITH THEM SAYING KEEP DRIVING THE CAR AND CONTACT US IF IT GETS WORSE. THEY MAKE YOU FEEL LIKE YOU'RE BEING DISHONEST WHEN CALLING INTO THEIR SERVICE DEPARTMENT TELLING THEM WHAT'S GOING ON WITH THEIR MALFUNCTIONING PRODUCT. OR EVEN WHEN YOU TAKE IT IN AND THEIR TECH'S TELL YOU THEY COULDN'T OR CAN'T FIND ANYTHING YOU SAID. MY CAR IS GETTING WORSE EACH TIME I DRIVE IT. AND THE TRUTH IS WE ALL TAKE OUR LIVES INTO OUR OWN HANDS WHEN WE CHOOSE TO DRIVE THESE MALFUNCTIONING CARS, BECAUSE IF WE DO PASS SOMEONE AND THE CAR STALLS WE'RE  TOAST!! IF THE CAR STALLS EVERYTHING TURNS OFF AND LOCKS UP!! COMMON SENSE!!!",
        "vin": "4T1B11HK8KU"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/26/2021",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398105,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SEATBELT OCCUPANT SENSOR GOES OFF WHEN I AM IN MOTION AND THERE IS NO ONE IN MY BACK SEAT. SOMETIMES, WHEN I PLACE ITEMS LIKE GROCERIES OR OTHER PERSONAL BELONGINGS IN MY BACKSEAT AND BEGIN DRIVING IT READS AS A PERSON AND THE SYSTEM BEGINS TO WARN ME THAT THE SEAT BELTS ARE NOT CONNECTED. OTHER TIMES, THERE WILL BE AN ACTUAL PERSON SITTING IN THE BACKSEAT WITHOUT THEIR SEATBELT ON AND THE SYSTEM WILL NOT WARN ME WHILE DRIVING. THIS IS EXTREMELY DANGEROUS AND ANNOYING. IF I'M DRIVING ALONE AND THE SEAT BELT WARNING BEGINS TO GO OFF THERE IS NO WAY FOR ME TO DISABLE IT UNLESS I PULL OVER AND BUCKLE IN THE SEAT BELTS. THIS IS A MAJOR SAFETY CONCERN BECAUSE IF I AM NOT AWARE SOMEONE HAS TAKEN OFF THEIR SEATBELT I CAN NOT BE PROACTIVE IN PREVENTING THEIR INJURIES IF AN ACCIDENT WERE TO OCCUR.",
        "vin": "4T1B11HK6KU"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/22/2021",
        "dateOfIncident": "12/25/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397339,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MULTIPLE OCCASIONS (ABOUT 3-4 TIMES A WEEK) WHEN STARTING MY VEHICLE THE ENGINE STALLS AND I HAVE TO RETRY AT LEAST TWICE FOR MY CAR TO START. AT RED LIGHTS THE VEHICLE LAGS AND TAKES A MOMENT TO PICK UP SPEED. OFTEN IN A JERKING MOTION. WHEN ACCELERATING TO SPEEDS ABOVE 20-80 MPH THE STALLING STARTS AGAIN AND DOES NOT FEEL SAFE WHILE DRIVING. WE NOTIFIED OUR DEALERSHIP ABOUT THE ISSUE WHEN GETTING SERVICED AND THEY STATED THEY COULD NOT PROVIDE ANY INFORMATION ON WHY IT WAS DOING THIS. WE HAVE HAD THIS PROBLEM SINCE DECEMBER 2019 AND HAS PROGRESSIVELY GOTTEN WORSE. ONCE WE RECEIVED THE NOTIFICATION ABOUT THE FUEL PUMP RECALL WE REQUESTED FOR THE DEALERSHIP TO TAKE OUR CAR IN FOR THE RECALL FUEL PUMP AND THEY REFUSED TO TAKE OUR CAR AND ADVISED US TO GO TO OTHER TOYOTA/ LEXUS DEALERSHIPS. THE OTHER TOYOTA/LEXUS DEALERSHIPS TOLD US TO GO BACK TO THE ORIGINAL DEALERSHIP WERE WE GET ARE CAR SERVICED AT HAVE THEM TAKE OUR CAR IN FOR SERVICE. WHEN WE WENT TO THE ORIGINAL TOYOTA DEALERSHIP WHERE WE PURCHASED OUR CAR FROM, THEY STILL REFUSED TO PROVIDE A RENTAL SINCE WE EXPLAINED THEM HOW UNSAFE THE CAR IS WHILE DRIVING. WE HAVE TRIED EMAILING AND DO NOT GET ANY RESPONSES. WE ALSO TRIED CALLING TO SPEAK WITH THE MANAGER BUT NONE OF THE MANAGERS HAVE TAKEN OUR CALLS OR TRIED TO CALL US BACK.",
        "vin": "4T1B11HK2KU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/22/2021",
        "dateOfIncident": "02/15/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397346,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA CAMRY. THE CONTACT STATED WHILE DRIVING 40 MPH AND DEPRESSING THE BRAKE PEDAL, THE VEHICLE ATTEMPTED TO MOVE FORWARD AND BRAKE SIMULTANEOUSLY. THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER ED MORSE DELRAY TOYOTA (2800 S FEDERAL HWY, DELRAY BEACH, FL 33483, (561) 770-3157) WHERE IT WAS NOT DIAGNOSED HOWEVER, A DETERMINATION WAS NOT OFFERED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE AND THE CONTACT WAS AWAITING A RESPONSE. THE FAILURE MILEAGE WAS APPROXIMATELY 5,000.",
        "vin": "4T1B11HK2KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/22/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397371,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "A RECALL IS OUT, BUT YET, A REMEDY HASN'T BEEN GIVEN. IT'S A VERY OBVIOUS ISSUE, AND IT NEEDS TO BE FIXED. IT EVEN SAYS THAT A CRASH COULD OCCUR BECAUSE OF THIS PROBLEM. I HAVE 3 KIDS I HAUL AROUND, SO I AM RISKING THEIR SAFETY, ALONG WITH MINE.",
        "vin": "4T1B11HKXKU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/22/2021",
        "dateOfIncident": "02/22/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397420,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2019 TOYOTA CAMRY, WHICH I BOUGHT CERTIFIED USED IN JULY 2020 HAD A RECALL THAT I NEVER RECEIVED NOTICE OF AND ONLY FOUND OUT BECAUSE I CALLED THE DEALER ON SOMETHING UNRELATED. TOYOTA SAYS THEY SENT 1 LETTER TO ME, WHICH IS NOT ENOUGH FOR A FLAW OF THIS SIZE AND SAFETY IMPLICATION. IT IS NO. 20V682. TOYOTA DOES NOT  YET HAVE A REMEDY FOR MY MODEL AND THEREFORE I'VE BEEN DRIVING WITH A CAR THAT COULD STALL AT HIGH SPEEDS. THEY DO NOT DEFINE HIGH SPEED. COMMUNICATION HAS BEEN [XXX] AND THE REMEDY SHOULD HAVE BEEN PROVIDED, GIVEN THE SERIOUS NATURE OF THE RECALL.  *TR    PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "4T1B11HK1KU"
    },
    {
        "components": "UNKNOWN OR OTHER,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "02/21/2021",
        "dateOfIncident": "02/19/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397189,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PROBLEM IS WITH THE REAR CAMERA SYSTEM. I GET A MESSAGE SAYING \"RCD OFF\" AND \"RCD UNAVAILABLE.\" THE REAR CAMERA WORKS BUT IS MISSING THE YELLOW GRID LINES, AND IT DOES NOT ALERT IF A PEDESTRIAN OR VEHICLE IS APPROACHING FROM THE SIDE. THIS HAPPENS WHENEVER THE VEHICLE IS IN REVERSE, WHETHER IT IS MOVING OR STAIONARY. THIS IS A SFAETY RISK BECAUSE THE DRIVER IS NOT ALERTED IF A PEDESTRIAN OR OTHER VEHICLE IS APPROACHING, WHICH COULD LEAD TO  VEHICLE DAMAGE, INJURY OR DEATH.",
        "vin": "4T1B11HK5KU"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/19/2021",
        "dateOfIncident": "09/18/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397004,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA CAMRY. THE CONTACT STATED THAT THE VEHICLE FAILED TO START-UP. THE CHECK ENGINE WARNING LIGHT WAS ILLUMINATED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V682000 (FUEL SYSTEM, GASOLINE) AND THE VEHICLE WAS TAKEN TO JOHN ELWAY'S CROWN TOYOTA (1201 KETTERING DR, ONTARIO, CA 91761) WHERE THE VEHICLE WAS REJECTED TO BE SERVICED DUE TO THE PART NOT BEING AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT STATED THAT THE VEHICLE REMAINED AT THE DEALER TWO MONTHS UNREPAIRED WITH THE PART NOT YET AVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 11,238.",
        "vin": "4T1B11HK1KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/16/2021",
        "dateOfIncident": "01/04/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396422,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHENEVER THE AIR CONDTIONING SYSTEM IS USED, THERE IS A STRONG CHEMICAL SMELL GETTING INTO THE CABIN.  TOOK IT TO THE DEALER SERVICE AND THEY SAID IT IS NOT COVERED UNDER THE 30K WARRANTY (CAR IS AT 24K MILES)   OUR BIGGEST CONCERN IS THAT THIS MAY POSE A HEALTH HAZARD TO THE OCCUPANTS OF THE CAR, SINCE IT IS OBVIOUS SOME TYPE OF CHEMICAL IS GOING THRU THE A/C VENTS; AND THAT THE TOYORA DEALER IS NOT HONORING THE WARRANTY SERVICE.",
        "vin": "4T1B11HK5KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/15/2021",
        "dateOfIncident": "02/14/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396216,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA UNABLE TO FIX OPEN RECALL FOR FUEL SYSTEM.",
        "vin": "4T1BZ1HK9KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/10/2021",
        "dateOfIncident": "12/07/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395517,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED RECALL FROM TOYOTA  DECEMBER 7, 2020 STATING EXISTING FUEL PUMP MAY STOP OPERATING.  \"IF A VEHICLE STALL OCCURS WHILE DRIVING, THIS COULD INCREASE THE RISK OF A CRASH.\"  COMPANY CURRENTLY HAS NO REMEDY AND WE HAVE AN UNSAFE CAR THAT WE ARE PAYING OFF.",
        "vin": "4T1B11HK7KU"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/09/2021",
        "dateOfIncident": "01/25/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395415,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA CAMRY. THE CONTACT DISCOVERED WHILE ATTEMPTING TO SELL HIS VEHICLE, THAT THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 20V682000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. TOYOTA 101 (386 CONVENTION WAY, REDWOOD CITY, CA 94063) WAS CONTACTED AND IT WAS CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND OFFERED NO ASSISTANCE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "4T1B11HK7KU"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/08/2021",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395136,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA CAMRY. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V682000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CALLED LIA TOYOTA OF ROCKLAND (618 NY-303, BLAUVELT, NY 10913, (845) 367-4219) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "4T1B11HK2KU"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/07/2021",
        "dateOfIncident": "01/11/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395054,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I HAD LEFT MY HOUSE, I PRESSED THE THROTTLE AND THE CAR WOULDN'T GO, IT WAS COASTING STILL, BUT ITS LIKE IT WOULDN'T GO. THEN, I PUMPED THE THROTTLE AND PUT IT ALL THE WAY TO THE FLOOR. IT HAD FINALLY WENT. THIS CAR ALSO SEEMS TO HAVE A MASSIVE DELAY WHEN WE PRESS THE THROTTLE AT STOP LIGHTS. I HAVE CONTACTED TOYOTA ABOUT THE RECALL, WHICH THEY DID NOT INFORM ME OF, I HAD TO LOOK IT UP MYSELF DUE TO THE NATURE OF THE ISSUES I WAS EXPERIENCING. SURE ENOUGH. FUEL PUMP SHOWED UP ON THE RECALL WHICH WOULD MAKE SENSE TO WHY I'M EXPERIENCING THESE ISSUES, THE ENGINE IS NOT GETTING ENOUGH GAS. NOT ONLY DID TOYOTA NOT INFORM ME OF THE RECALL BUT THEY STILL HAVE NOT FOUND A \"REMEDY\" FOR THE ISSUE, WHILE I HAVE SEEN A COUPLE PEOPLE COMMENTING ON THEIR FACEBOOK PAGE THAT THEIR HAD BEEN FIXED. ALSO, HAD FOUND OUT I'M NOT THE ONLY ONE TOYOTA HAD NOT INFORMED OF THE RECALL AND SEEMS TO BE A LAWSUIT CURRENTLY BECAUSE OF THAT. I HAVE A NEWBORN. WHATS GOING TO HAPPEN IF THE FUEL PUMP GOES OUT WITH HIM IN IT?",
        "vin": "4T1B11HK4KU"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/06/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394935,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WONT EVEN HAVE A VEHICLE IN FRONT OF ME WHILE DRIVING AND THE AUTOMATIC BRAKING COMES ON IT FLASHES RED ON THE INSTRUMENT PANEL AND IT STARTS EMERGENCY BRAKING I DONT FEEL THIS IS VERY SAFE IT HAPPENS EVERY SO OFTEN LIKE  THIS WEEK IT WILL DO IT BUT NEXT WEEK IT DOESNT DO IT",
        "vin": "4T1B11HK2KU"
    },
    {
        "components": "SUSPENSION,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/05/2021",
        "dateOfIncident": "02/20/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394768,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE IDLES SPORADICALY, NOISY WHEN IDLING. ACCELLARATION RESPONSE IS SLOW FROM POINT OF CONTACT.",
        "vin": "4T1B11HK6KU"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/05/2021",
        "dateOfIncident": "11/10/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394812,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE STALLS MAKING IT UNSAFE TO SWITCH LANES WHILE BEING AT A STOP AND BEING ON THE FREEWAY. THIS RECALL HAS BEEN OPEN SINCE NOVEMBER AND MY REMEDY IS STILL NOT AVAILABLE.",
        "vin": "4T1B61HK3KU"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/05/2021",
        "dateOfIncident": "11/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394814,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA CAMRY. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V682000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT STATED THAT THE LOCAL DEALER BRISTOL TOYOTA (2283 GRAND ARMY OF THE REPUBLIC HWY, SWANSEA, MA 02777) WAS CONTACTED HOWEVER, THE PARTS WERE STILL NOT AVAILABLE FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "4T1B61HK5KU"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "01/30/2021",
        "dateOfIncident": "01/29/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390799,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING YESTERDAY (1/29/21) AND I WAS GOING ABOUT 40MPH I CAME UP ON THE RESET OF ANOTHER VEHICLE WHO'S BREAK LIGHTS WERE DISABLED AND I ALMOST DID NOT BREAK IN TIME TO AVOID COLLISION. THIS WAS THE SECOND TIME I'VE NOTICED MY BREAKING ASSIST NOT WORKING. BACK IN OCTOBER 2019 I NOTICED AN ISSUE WITH MY AIR BAGS AS WELL. THEY WOULD BEEP AND GO OFF AS THOUGH SOMEONE WAS SITTING IN THE SEATS AND THERE WAS NO ONE THERE. DUE TO MY OWN BELIEFS I ASSUMED IT WAS PARANORMAL ACTIVITY HOWEVER I DID MAKE A COMPLAINT WHEN I GOT MY OIL CHANGE IN THE FOLLOWING WEEKS. THEY TOLD ME TO LET THEM KNOW IF IT CONTINUED AND IT MAY HAVE DONE IT ONCE OR TWICE SINCE THEN BUT NOT OFTEN. I'M NOT SURE IF IT IS ENOUGH TO REPORT.",
        "vin": "4T1B11HK0KU"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/29/2021",
        "dateOfIncident": "01/04/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390598,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAS AN INTERMITTENT ACCELERATION ISSUE. YOU WILL HAVE TO PRESS THE GAS PEDAL ALL THE WAY TO THE FLOOR SOMETIMES JUST TO GET IT TO 40 MPH. ALSO AT HIGH SPEED, THE VEHICLE WILL SHAKE ON THE HIGHWAY. SOMETIMES WHEN THIS OCCURS THE STEERING WHEEL BECOMES STIFFER.",
        "vin": "4T1B11HKXKU"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/27/2021",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390233,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA CAMRY. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V682000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CALLED DENNY MENHOLT TOYOTA (1920 E MALL DR, RAPID CITY, SD 57701; (605) 342-2490) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "4T1B11HK4KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/20/2021",
        "dateOfIncident": "10/28/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389047,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA CAMRY. THE CONTACT RECEIVED A RECALL NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V682000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD EXPERIENCED A FAILURE AS AN ABNORMAL NOISE APPEARED FROM THE REAR WHERE THE FUEL TANK WAS LOCATED. THE VEHICLE WAS TAKEN TO THE DEALER (TOYOTA OF BOARDMAN 8250 MARKET ST, BOARDMAN, OH 44512 (330) 333-7218) FOR A DIAGNOSTIC TEST, HOWEVER, THE TECHNICIAN WAS UNABLE TO DUPLICATE THE FAILURE. THE VEHICLE WAS NOT REPAIRED AND THE FAILURE RECURRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. VIN TOOLS CONFIRMS PARTS NOT AVAILABLE. THE FAILURE MILEAGE WAS APPROXIMATELY 35,674.",
        "vin": "4T1B11HK9KU"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/14/2021",
        "dateOfIncident": "01/14/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388187,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I AM AT THE RED LIGHT AND IS ABOUT TO GO THERE IS ACCELERATION DELAY THAT HAPPENS WHICH I BELIEVE TO BE DANGEROUS. EVEN WHEN AM DRIVING AND I WAS TO SPEED UP THERE IS ACCELERATION DELAY.",
        "vin": "4T1B11HK2KU"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/13/2021",
        "dateOfIncident": "12/07/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388039,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 TOYOTA CAMRY. CONSUMER WRITES IN REGARDS TO FUEL PUMP SAFETY RECALL. *LD    THE CONSUMER STATED THERE WAS NO REMEDY FOR THE RECALL REPAIR. *JS",
        "vin": "4T1B11HK7KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/11/2021",
        "dateOfIncident": "09/09/1919",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387502,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE RECEIVED NOTICES REGARDING THIS LOW PRESSURE FUEL FROM. CONSUMERS REPORT , OHIO DEPT OF MOTOR VEHICLES AND NOW FROM TOYOTA.  . I HAVE CALLED THE DEALERSHIP ONCE A MONTH THREE TIMES,  BUT THEY KEEP SAYING THEY EXPECT A REMEDY NEXT MONTH.",
        "vin": "4T1B11HK8KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/10/2021",
        "dateOfIncident": "07/05/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387379,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL GAUGE INCORRECTLY DISPLAYS THE FUEL IN THE TANK.  FOR EXAMPLE I CAN DRIVE 160 MILES AND THE GAUGE HAS NOT MOVED SINCE IT WAS FILLED UP.  FURTHER I DROVE OVER 600 MILES AND THE FUEL GAUGE INDICATED 1/4 BUT WHEN I FILLED UP THE CAR IT TOOK 13.6 GALLONS OF GAS.  THE TANK CAPACITY IS 14.5 GALLONS SO THAT MEANT I ONLY HAD 0.9 GALLONS OF GAS YET THE CAR SHOWED 1/4 OF THE TANK OF FUEL.  THIS COULD LEAD TO THE CAR RUNNING OUT OF GAS BEFORE THE CAR'S FUEL GAUGE INDICATED.  THIS IS A CLEAR SAFETY ISSUE.  I HAVE HAD THE CAR IN FOR REPAIR 4 TIMES AT THE DEALER BUT TOYOTA REFUSES TO CORRECT THE ISSUE",
        "vin": "4T1B11HK9KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/04/2021",
        "dateOfIncident": "12/30/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386471,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR RECALL FOR DEFECTIVE LOW PRESSURE FUEL PUMP.  RECALL WAS STARTED IN 1/2020.  MY VEHICLE WAS ADDED IN 10/2020 AND I WAS NOTIFIED ON OR AROUND 12/30/2020.  THIS IS A VERY SERIOUS, POTENTIALLY LIFE THREATENING ISSUE. TOYOTA HAS INDICATED A REPLACEMENT PART FOR MY CAR MAY BE AVAILABLE BY THE END OF 2/2021.  NOT GUARANTEED.  IF I CAN GET THE REPLACEMENT PART AT ANOTHER SERVICE STATION, TOYOTA WILL ONLY PAY FOR THE PART NOT THE LABOR.  THIS IS UNACCEPTABLE AND POTENTIALLY LIFE THREATENING.  TOYOTA HAS KNOWN ABOUT THIS ISSUE FOR A YEAR.  I MADE THE DECISION TO LEASE FOR THE GIRST TIME SO I WOULDN'T HAVE UNEXPECTED REPAIRS OR PROBLEMS.  TOYOTA HAS HANDLED THIS POORLY AND TOYOTA IS NOT MAKING CUSTOMER SAFETY A PRIORITY.  .",
        "vin": "4T1B11HKXKU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/29/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385412,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE RUNS VERY ROUGH, STOPPING AND STARTING IN TRAFFIC VERY DANGEROUS AS THE FUEL IS NOT GETTING TO THE ACCELERATOR",
        "vin": "4T1B11HK1KU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/29/2020",
        "dateOfIncident": "12/21/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11385415,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA CAMRY SE. THE CONTACT STATED THAT HIS WIFE WAS DRIVING AT 50 MPH ON THE HIGHWAY AND A TRAILER FROM ANOTHER VEHICLE  DETACHED AND CAME INTO THE LANE.  THE VEHICLE HIT THE TRAILER IN THE FRONT PART AND IT WENT AIRBORN AND FLIPPED OVER AND LANDED ON THE PASSENGER SIDE OF THE VEHICLE. IT THEN ROLLED TWO TIMES AND LANDED ON THE SIDE OF THE HIGHWAY IN A MARSH IN AN UPRIGHT POSITION. THE ONLY AIR BAGS THAT DEPLOYED WERE THE SIDE CURTAIN AIR BAGS. OUT OF THE TEN AIR BAGS ONLY TWO ENDED UP DEPLOYING.THE WIFE AND TWO OTHER PASSENGERS WERE TRANSPORTED BY AMBULANCE TO THE HOSPITAL FOR PRECAUTIONARY REASONS INCASE OF INTERNAL INJURIES. AT THE HOSPITAL THE XRAYS WERE NEGATIVE OF THE CHEST AND  PELVIC AREAS AND ELBOW. ONE OF THE PASSENGER'S ANKLE WAS BROKEN. THE INJURIES WERE MOSTLY SEVERE BRUISING OVER SEVERAL AREAS ESPECIALLY FROM THE SEAT BELTS. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOTALED. BOTH THE FRONT AND REAR BUMPERS WERE TORN OFF, THE DRIVER'S SIDE WAS SMASHED IN. THE FRAME BAR ON THE DRIVER'S SIDE UNDER THE HOOD WAS BENT. THE UNDERSIDE OF THE   VEHICLE WAS RIPPED OFF  AND ALL FOUR WHEELS WERE BENT OUT. THERE WAS  DAMAGE TO REAR AXEL AND FRONT SWAY BARS. THE PASSENGER SIDE OF THE VEHICLE WAS ALSO SMASHED IN AND REAR WINDOW WAS SHATTERED. THE VEHICLE WAS TOWED FROM THE CRASH AREA. THE DEALER AND MANUFACTURER HAD NOT BEEN NOTIFIED YET. THE FAILURE MILEAGE WAS 33,400.",
        "vin": "4T1B11HK4KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/23/2020",
        "dateOfIncident": "10/07/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384706,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT CITY SPEEDS AND APPLYING BRAKES HARD THE CAR WILL PERIODICALLY SPEED UP AND STARTS SHUTTERING.  I NEED TO SHIFT CAR TO NEUTRAL TO PREVENT AN ACCIDENT.  I HAVE TAKEN THE CAR TO THE DEALER AT LEAST, BUT NOTHING IS FOUND.",
        "vin": "4T1B11HK2KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/22/2020",
        "dateOfIncident": "11/21/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384506,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "IM UNABLE TO LOCATE MY STOLEN VEHICLE I WAS AWAY AND MY HOUSE WAS BROKEN INTO MY CAR WAS STOLEN I AM UNSURE IF THE KEYS WERE LEFT IN THE HOUSE FOR FAVORITE CAR MY IDENTIFICATION SOCIAL SECURITY CARD EVERYTHING WAS STOLEN IN MY PURSE ALONG WITH A FEW OTHER PRICE ELECTRONICS AND I'M JUST TRYING TO FIGURE OUT HOW TO GET THIS TAKEN CARE OF HIS I NEED MY CAR AND I KEEP RUNNING INTO WALLS IF WE'RE TRYING TO GET MY INFORMATION AND ACCESS MY RENTAL CAR AND EVERYTHING ELSE BECAUSE I DO NOT HAVE IT IDENTIFICATION",
        "vin": "4T1B11HKXKU"
    },
    {
        "components": "SERVICE BRAKES,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/19/2020",
        "dateOfIncident": "12/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384202,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED NOTICING THAT THE CAR WAS FEELING WEAK WHEN ACCELERATING, AND WITH NO REASON AT ALL, AT SPEEDS AROUND 70MPH THE CAR SHUTS DOWN COMPLETELY. YOU LOSE STEERING AND BRAKING CAPABILITIES WHICH MAKES IT HARD TO SAFELY MERGE INTO THE EMERGENCY LANE. TOYOTA HAS A KNOWLEDGED THE RECALL BUT WITH NO REMEDY AS OF YET (IT HAS BEEN SINCE OCTOBER 2020 THAT THEY RECALL WAS ISSUED), AND SAYS CAR IS UNSAFE THAT IF I DRIVE VEHICLE TO STAY IN RIGHT LANE OF INTERSTATE WHICH TO ME IS JUST AS DANGEROUS AS TRAVELING IN ANY LANE ON INTERSTATE, THOUGH THEY RECOMMENDED NOT DRIVING VEHICLE. AS FAR AS I CAN TELL, THE VEHICLE ONLY WILL STALL OUT AT A HIGHER SPEED (AROUND 70MPH).",
        "vin": "4T1B11HK2KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/14/2020",
        "dateOfIncident": "11/23/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383450,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS VERY LITTLE POWER. I AM AFRAID TO MAKE LEFT HAND TURNS IN TRAFFIC BECAUSE I NEVER KNOW IF THE CAR WILL MOVE WITH PROPER AND ACCURATE SPEED.  THE VEHICLE HAS HAD A RECALL OF THE FUEL SYSTEM FOR WHICH THE MANUFACTURER DOES NOT HAVE A FIX FOR.  MY TIRES CONSTANTLY LOSE AIR SINCE THE DAY I BOUGHT THE CAR. MY GAS TANK ACCESS DOOR DOESN'T OPEN PROPERLY, ALSO SINCE I BOUGHT THE CAR.  THE DASH SCREEN GOES OFF SPONTANEOUSLY.",
        "vin": "4T1B11HK9KU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/04/2020",
        "dateOfIncident": "11/11/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377902,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA CAMRY. THE CONTACT STATED THAT THE VEHICLE WAS RUNNING ROUGH AND JERKING WHILE DRIVING. THERE WERE NO WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS NOT YET TAKEN TO A DEALER. THE VIN WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 20V682000 (FUEL SYSTEM, GASOLINE). THE CONTACT STATED THAT SHE CALLED THE MANUFACTURER AND LEFT A VOICEMAIL BUT, HAD NOT YET RECEIVED A CALL BACK. THE FAILURE MILEAGE WAS APPROXIMATELY 20,000.",
        "vin": "4T1B11HK0KU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/04/2020",
        "dateOfIncident": "11/21/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377940,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING STARTED WORKING INTERMITTENTLY WHILE DRIVING, NOT AT ALL AT LOW SPEEDS REQUIRING MUCH STRONGER INPUT FROM DRIVER. TOOK CAR TO DEALER WHO REPLACED GEAR ASSEMBLY, ELECTRIC AND SHAFT ASSEMBLY, STEERING. CAR HAS 55K MILES THEREFORE NOT UNDER WARRANTY. THE DEALER POINTED TO CORROSION LIKELY CAUSED BY MY DRIVING SLOWLY THROUGH SALT WATER (MY ROAD FLOODS IN SPRING TIDES). BUT PEOPLE DRIVE IN SALTY CONDITIONS IN THE SNOW BELT EVERYDAY. I FEEL ANYTHING THAT CAUSES THE STEERING OF A CAR TO CEASE NORMAL OPERATION LIKE THIS IS POTENTIALLY DANGEROUS.",
        "vin": "4T1B31HK1KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/04/2020",
        "dateOfIncident": "12/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377985,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CONTACTED SURPRISE ARIZONA TOYOTA FRIDAY MORNING ON 12/4/2020 REGARDING FUEL PUMP.  AFTER CAR IS TURNED OFF FUEL PUMP KEEPS RUNNING. NO RESPONSE FROM TOYOTA AND WE HAVE THE FULL WARRANTY. PAID EXTRA FOR IT. VERY CONCERNING. REALLY NEED THEM TO TAKE IMMEDIATE ACTION. 8500 MILES ON 2019 TOYOTA SE CAMRY",
        "vin": "4T1B11HK1KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/29/2020",
        "dateOfIncident": "11/27/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376915,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT THIS EMAIL CLEARLY STATING THAT MY 2019 TOYOTA CAMRY IS INVOLVED IN A RECALL, SO I SCHEDULED A APPOINTMENT AT NORTHRIDGE TOYOTA IN NORTHRIDGE CALIFORNIA ON NOVEMBER 27TH AT 8AM, AND THEY TOLD ME THEY DIDN'T HAVE THE FUEL PUMP REPLACEMENT. I'M VERY ANGRY, IT'S NOT SAFE TO DRIVE MY VEHICLE. PLEASE HELP!!!!!!    'YOUR VEHICLE MAY BE INVOLVED IN A SAFETY RECALL AND MAY CREATE A SAFETY RISK FOR YOU OR YOUR PASSENGERS. IF LEFT UNREPAIRED, A POTENTIAL SAFETY DEFECT COULD LEAD TO INJURY OR EVEN DEATH. SAFETY DEFECTS MUST BE REPAIRED BY A DEALER AT NO COST TO YOU.'    NHTSA RECALL ID NUMBER :20V682  MANUFACTURER :TOYOTA MOTOR ENGINEERING & MANUFACTURING  SUBJECT :FUEL PUMP MAY FAIL",
        "vin": "4T1B11HKXKU"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/24/2020",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376218,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA CAMRY. THE CONTACT STATED WHILE DRIVING 20 MPH, WHEN HE HEARD AN ABNORMAL NOISE. THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE CONTACT ALSO STATED WHILE STARTING THE VEHICLE AND DEPRESSING THE ACCELERATOR PEDAL, THE VEHICLE STARTED VERY SLOWLY. THE VIN WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 20V682000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE VEHICLE WAS TAKEN TO LOCAL DEALER TOYOTA OF BOWIE (16700 GOVERNOR BRIDGE RD, BOWIE, MD 20716; 301) 867-1600) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS APPROXIMATELY 23,700. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "4T1B11HK8KU"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/12/2020",
        "dateOfIncident": "10/12/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374294,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA CAMRY. THE CONTACT WAS MADE AWARE OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CALLED ISLAND TOYOTA (1591 HYLAN BLVD, STATEN ISLAND, NY 10305; (833) 966-0345) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "4T1B11HK1KU"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/09/2020",
        "dateOfIncident": "11/07/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373813,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA CAMRY. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CALLED HARTFORD TOYOTA SUPERSTORE (135 W SERVICE RD, HARTFORD, CT 06120; (860) 278-5411) WHERE IT WAS CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.*DT  *TR",
        "vin": "4T1B11HK7KU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/02/2020",
        "dateOfIncident": "10/31/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11372777,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD A CAR ACCIDENT ON THE HIGHWAY AT A  45MPH AND THE AIR BAGS DID NOT DEPLOYED. THE OTHER CAR, WHICH AIR BAGS DEPLOYED, WAS AT FAULT AND THE IMPACT TO THE FRONT OF OUR CAMRY WAS AT EXTENSIVE.     OUR CAR WAS GOING AT A 45 MPH GOING SOUTHBOUND WHEN A NISSAN 2017 FRONTIER  MADE A LEFT TURN IN FRONT OF THE CAR.  THE TRUCK WAS ALSO IN MOTION AT TIME OF THE ACCIDENT.     THE ACCIDENT WAS AT A HIGHWAY GOING SOUTHBOUND.  THE TRUCK WAS GOING NORTHBOUND AND MADE A LEFT TURN.",
        "vin": "4T1B11HK4KU"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/30/2020",
        "dateOfIncident": "10/29/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372403,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE VEHICLE FROM A DEALER IN JUNE OF 2020 AND WAS UNAWARE OF ANY ONGOING RECALLS OR THAT ANY REQUIRED SERVICE HAD NOT BEEN COMPLETED.  I'VE HAD THE VEHICLE IN THE SHOP MULTIPLE TIMES FOR ENGINE STALLING WHILE DRIVING, ENGINE SHAKING, MISFIRING, AND LOSS OF FORWARD MOMENTUM.  NOT ONCE DID THEY TELL ME ABOUT THE RECALL OR THAT TOYOTA WAS AWARE OF THE PROBLEM UNTIL I TOOK THE VEHICLE TO A DIFFERENT AUTOMOTIVE SHOP.  THE NEW SHOP GAVE ME ALL THE RECALL INFORMATION AND ADVISED THAT THE VEHICLE IS NOT SAFE TO DRIVE. THE ENGINE WILL SPUTTER AND SHAKE IN IDLE AND IN REVERSE. CONSISTENTLY THE VEHICLE SHAKES AND RUNS VERY ROUGH WHEN IN IDLE, REVERSE OR ATTEMPTING TO ACCELERATE FROM STOP LIGHTS, RED LIGHTS, PARKING LOTS, ETC.  DEALERSHIP TOLD ME THAT I WASN'T USED TO THE ELECTRONIC FUEL IGNITION AND THAT THE SPUTTERING AND DELAY IN FORWARD MOMENTUM WAS NORMAL. ONE TIME I WAS DRIVING 65MPH AND THE VEHICLE STALLED WHILE ON A ISLAND CAUSEWAY.  LUCKILY I WAS IN THE RIGHT HAD LANE AND WAS ABLE TO GET OFF THE ROAD SAFELY.  ANOTHER TIME THE VEHICLE STALLED WAS IN A PARKING LOT (AGAIN SLOW SPEED) AND AGAIN IN REVERSE.  THE VEHICLE DID SUSTAIN RODENT DAMAGE TO WIRING ON 2 OCCASIONS WHICH THE DEALERSHIP REPAIRED, NOTED THE MULTIPLE ENGINE MISFIRES AND \"CLEARED THE CODES\".  THE VEHICLE RAN BETTER FOR ABOUT A WEEK AND THEN THE SAME PROBLEM BEGINS REOCCURRING.  THE SPARK PLUGS CONTINUE TO FOUL DUE TO THE ENGINE FUEL PRESSURE ISSUE.",
        "vin": "4T1B11HK5KU"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/05/2020",
        "dateOfIncident": "09/28/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362942,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN THE DRIVE THRU QUEUE AT BURGER KING AND I HAD THE BRAKE HOLD ACTIVATED, WAITING FOR MY TURN. THE CAR JUST VIBRATED AND SHUT DOWN. I TRIED TO START IT AGAIN IT NEVER STARTED. ON THE DASH IT SAID COOLANT TEMP HIGH, CHARGING SYSTEM MALFUNCTION, DRIVE START CONTROL MALFUNCTION,BRAKE OVERRIDE MALFUNCTION.  I THOUGHT I NEEDED ANTIFREEZE SO I WALKED TO SUNOKO TO BUY ONE. TRIED TO PUT SOME IN BUT ANTIFREEZE WAS FULL SO I COULDN'T TOP UP. THE ANTIFREEZE IS IN THE TRUNK. I TRIED TO GET A JUMP THINKING IT WAS THE BATTERY BUT IT STILL DIDN'T START. I TOWED TO TOYOTA AND NOW THEY'RE TELLING ME THE COMPUTERS ARE NOT COMMUNICATING RIGHT WITH EACH OTHER. MY GAS SAYS 65535MI DISTANCE TO EMPTY. MY CAR IS BEEN SITTING AT THE DEALERSHIP FOR A WEEK NOW AND THEY DIDN'T GIVE ME A LOANER CAR EVEN THOUGH I HAVE WARRANTY ON IT.",
        "vin": "4T1B61HK7KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/05/2020",
        "dateOfIncident": "10/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362954,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE WILL STALL AND STOPS RANDOMLY. IT IS LOSING POWER AT STOP SIGNS AND STOP LIGHTS WHEN I HIT THE BRAKES. A FEW TIMES IT LOSE POWER TEMPORARY WHILE IN MOTION. IT KEEP SHOWING \"CHARGING SYSTEM MALFUNCTION AND STOP IN A SAFE PLACE\" MESSAGE WHEN THIS HAPPENS. IT WILL GO BACK TO NORMAL AFTER 5 MINUTES AND THEN THE WHOLE THING REPEATS A DAY OR TWO LATER. I TOOK IT TO TOYOTA DEALERSHIP TO FIX BUT THEY CONCLUDED THE CAR IS ALRIGHT SINCE THERE IS NO CHECK ENGINE. BUT THE PROBLEM IS THERE AND THE CAR KEEPS UNSAFE STOPPING. MY VEHICLE PROBLEM SEEMS SIMILAR TO THOSE OF JANUARY 13TH 2020 \"FUEL PUMP MAY FAIL RECALL\" NHTSA CAMPAIGN NUMBER 20V012000.",
        "vin": "4T1B11HK8KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/04/2020",
        "dateOfIncident": "09/16/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362607,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE 2019 CAMRY XSE V6 HAS ACCELERATION PROBLEM FROM STOP TO TAKE OFF IT JERKS WHEN I PRESS GAS ALSO SCARED TO DRIVE ON HIGHWAY WHEN I TAKE OVERTAKE IT COULDN'T ACCELERATE QUICK AS SHOULD IT IS VERY RISKY TO DRIVE TOYOTA DOESN'T KNOW THIS ISSUE AND THEY DON'T HAVE SOLUTION YET FOR THIS PROBLEM I HAVE SEEN SO MANY COMPLAINTS FOR SAME REASON NO RECALL YET",
        "vin": "4T1BZ1HK9KU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/04/2020",
        "dateOfIncident": "01/08/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362710,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS MAKING A LEFT TURN (FROM A STOP SIGN) OUT OF MY NEIGHBORHOOD AND THE CAR HESITATED THEN, ALL OF A SUDDEN IT REV'D UP, AND SHOT FORWARD.  I'M SURE THE NEIGHBORS THOUGHT I WAS HOT RODDING.  THIS HAPPENED AGAIN ON A SEPARATE DAY WHEN I WAS WAITING TO TURN LEFT AT A TRAFFIC LIGHT.  THERE WAS A PICKUP TRUCK COMING FROM THE OPPOSITE DIRECTION, BUT HE WAS FAR ENOUGH AWAY, SO I GAVE IT SOME GAS TO START MY TURN.  MY CAR HESITATED AND I THOUGHT THE PICKUP WAS GOING TO HIT ME, BUT THEN MY CAR REV'D UP AND LUNGED FORWARD AS PREVIOUSLY.  I THOUGHT THAT MAYBE IT HAD SOMETHING TO DO WITH MAKING LEFT TURNS, BUT ONE DAY I WAS DRIVING ABOUT 40 MPH ON A 45 MPH LEVEL ROAD AND I GAVE IT GAS TO INCREASE MY SPEED TO 45 ---- THE SAME THING HAPPENED ---- HESITATION, REV'D UP, LUNGED FORWARD.  IT STILL DOES IT, BUT I'M TRYING TO BE VERY CAREFUL DRIVING IT BECAUSE I DON'T KNOW IF I'M GOING TO BE THE NEXT TRAFFIC FATALITY, OR WORSE, CAUSE SOMEONE ELSE TO BE KILLED OR MAIMED.  I ALSO TOLD THE SERVICE REP WHEN I TOOK MY CAR IN FOR REGULAR MAINTENANCE AND ASKED IF THEY COULD CHECK IT.  HE TOLD ME THEY HAD CHECKED IT AND IT'S OKAY.  I LOOKED AT THE SERVICE REPORT BUT, I COULDN'T FIND WHERE THEY HAD CHECKED IT.  I STARTED LOOKING FOR INFO VIA THE INTERNET ON THIS PROBLEM AND FOUND OTHER SITES THAT HAD PEOPLE COMPLAINING ABOUT IT.  SO, THE NEXT REGULAR MAINTENANCE I TOOK MY CAR IN FOR, I MENTIONED IT TO THE SERVICE REP AND TOLD HIM ABOUT ALL THE COMPLAINTS I'VE READ CONCERNING THIS PROBLEM OF HESITATION, ETC.  I SAID IT SEEMS THAT IT MUST BE NORMAL FOR THIS CAR AND THAT'S WHY THE MECHANIC SAID IT WAS OKAY.  HE AGREED THAT IT'S NORMAL FOR THIS CAR, BUT I HAVE NOTHING IN WRITING THAT HE SAID THAT OR THAT THE PROBLEM WAS EVEN CHECKED.  YOU NEVER KNOW WHEN IT WILL HAPPEN.  IT HAPPENS IN ALL THREE DRIVING MODES.  CHECK: HTTPS://WWW.CARGURUS.COM/CARS/DISCUSSION-M7_DS895703",
        "vin": "4T1B11HK1KU"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/03/2020",
        "dateOfIncident": "10/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362585,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BACK MIDDLE SEAT BELT IS NOT CLICKING INTO LOCK. I AM UNABLE TO BUCKLE MY SONS CARSEAT INTO THE MIDDLE SEAT BECAUSE THE BELT WILL NOT LATCH. I HAD THIS ISSUE IN MY PREVIOUS CAMRY THAT ENDED GETTING TOTALED SO I NEVER HAD TIME TO FILE THE COMPLAINT. BUT I HAVE IT ON VIDEO. IF MY CHILD WOULD OF BEEN IN THE CAR ACCIDENT WITH MY IN MY OLD CAR, HE WOULD OF ENDED UP OUT THE FRONT WINDSHIELD DUE TO A FAULTY SEAT BELT. THIS IS NOW THE SECOND TOYOTA CAMRY XSE THAT HAS THE SAME ISSUE. PLEASE ADDRESS THIS BEFORE A CHILD GETS SERIOUSLY INJURED.",
        "vin": "4T1BZ1HK1KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/29/2020",
        "dateOfIncident": "09/25/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361909,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AROUND 65 MPH WHEN SUDDENLY THE CAR LOST THE POWER, STARTING  SHAKING   AND ALL LIGHTS TURNED ON (CHECK ENGINE,SEAT BELTS, CRUISE CONTROL ETC.",
        "vin": "4T1B11HK6KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/26/2020",
        "dateOfIncident": "09/24/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361239,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I EXPERIENCED FUEL PUMP FAILURE WHILE DRIVING ON CITY STREET, I WAS ABLE TO STOP CAR SAFELY AND RESTART IT. MY VEHICLE DID NOT RECEIVE RECALL ACCORDING TO FOLLOWING DIRECTIVE:  JANUARY 13, 2020 NHTSA CAMPAIGN NUMBER: 20V012000  FUEL PUMP MAY FAIL  IF THE FUEL PUMP FAILS, THE ENGINE CAN STALL WHILE DRIVING, INCREASING THE RISK OF A CRASH.  NHTSA CAMPAIGN NUMBER: 20V012000  MANUFACTURER TOYOTA MOTOR ENGINEERING & MANUFACTURING  COMPONENTS FUEL SYSTEM, GASOLINE  POTENTIAL NUMBER OF UNITS AFFECTED 1,830,752    RIVERVIEW TOYOTA MESA,AZ REPLACED FUEL PUMP 9/25/2020 UNDER WARRANTY. I COMMEND THE SERVICE TEAM THERE FOR THEIR PROFESSIONALISM HANDLING THIS SITUATION.",
        "vin": "4T1B11HK7KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/25/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361078,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITIONER FREQUENTLY BECOMING OVERRUN WITH BACTERIA BUILDUP. HAPPENS OVER TIME THROUGH NORMAL OPERATION.",
        "vin": "4T1B31HK6KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/23/2020",
        "dateOfIncident": "09/23/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360712,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE HAS 24K MILES ON IT AND I AM STARTING TO FREQUENTLY NOTICE THAT WHEN I PUSH ON THE GAS PEDAL THAT THE CAR HESITATES AND IT TAKES IT A FEW SECONDS TO GO FORWARD. THIS DOES NOT SEEM LIKE THIS IS NORMAL AND COULD CAUSE AN ACCIDENT IF I EVER NEEDED TO ACCELERATE VERY QUICKLY. THIS HAS HAPPENED AT STOP LIGHTS AND WHILE IN MOTION ON THE HIGHWAY.",
        "vin": "4T1B11HK6KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/19/2020",
        "dateOfIncident": "09/19/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11359964,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WAS DRIVING ON THE HIGHWAY AND SUDDENLY IT STALLED AND JUST WOULDN'T ACCELERATE DESPITE ME PRESSING THE GAS AND CONTINUES TO DECELERATE.  IT STARTED VIBRATING AND I HAD TO PARK BY THE SIDE OF THE ROAD, TURNED IT OFF AND TURNED IT BACK ON. WHEN I TURNED ON THE IGNITION A CHECK ENGINE LIGHT WAS TURNED ON. THEN I TOOK MY CAR TO AUTOZONE JUST TO GET AN ERROR CODE, THEN I TOOK THE RESULT  TO MY MECHANIC AND HE TOLD ME I HAVE A GAS PUMP FAILURE. WE BOTH DID OUR RESEARCH AND DISCOVERED THAT CARS MANUFACTURED WITHIN THE SAME MONTH AND YEAR (OCTOBER 2018) TOYOTA CAMRY WERE RECALLED. I TOOK IT TO MY DEALERSHIP, THIS IS A FAIRLY NEW VEHICLE ONLY 16,000 MILEAGE AND A YEAR OLD.BUT THEY WOULDN'T ADDRESS MY CONCERN, JUST BECAUSE MY VIN WASN'T INCLUDED ON THE RECALL LIST.",
        "vin": "4T1B11HK8KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/03/2020",
        "dateOfIncident": "08/12/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353038,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "APPLE CAR PLAY FREEZES. TOP OF THE SCREEN IS THE ONLY THING VISIBLE. THE BOTTOM HALF OF SCREEN IS BLACK. I HAVE HAD THIS ISSUE SINCE I PURCHASED THE CAR IN JULY 2018 . I HAVE A 2019 SE AND TOYOTA KEEPS A  SAYING IT'S THE IPHONE. I HAVE HAD THE XR AND THE SE CURRENTLY. I HAVE DONE A HARD RESET MYSELF WITH CORPORATE AS WELL.AFTER OVER 15 VISITS TO TOYOTA THEY REPLACED THE RADIO. UNFORTUNATELY IT'S STILL FREEZING.",
        "vin": "4T1B11HK9KU"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/02/2020",
        "dateOfIncident": "08/17/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352698,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AT NIGHT,ESPECIALLY ON A VERY DARK ROAD, MY HEADLIGHTS, ESPECIALLY IN THE LOW BEAM MODE, SEVERELY RESTRICT MY VISION. I CAN ONLY VIEW THE ROAD BY LOOKING THROUGH THE LOWER PART OF THE WINDSHIELD. THE VIEW THROUGH THE UPPER PART IS TOTALLY DARK AS IF OBSTRUCTED BY AN OBJECT.  I AM CONCERNED THAT THIS IS A DANGEROUS SAFETY ISSUE AND IT PLACES MYSELF AND OTHERS AT RISK OF DEATH OR SERIOUS INJURY. I HAVE SEEN THIS ISSUE REPORTED BY OTHERS ONLINE AND I AM UNCOMFORTABLE WITH THE FACT THAT NHTSA HAS NOT INFORMED ME OF THIS PROBLEM NOR HAS TAKEN ANY ACTION TO CORRECT IT.",
        "vin": "4T1B31HK0KU"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/20/2020",
        "dateOfIncident": "08/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350419,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA CAMRY. THE CONTACT STATED WHILE DRIVING AT UNKNOWN SPEEDS, THE VEHICLE LOSS MOTIVE POWER AND SHUT-OFF HOWEVER, THE VEHICLE WAS RESTARTED. THERE WERE NO WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS TAKEN TO CARIBBEAN AUTO MART (4523 ESTATE CHARLOTTE AMALIE, ST THOMAS 00802, U.S. VIRGIN ISLANDS, 1(340)777-7600) AND DIAGNOSED. THE CONTACT WAS INFORMED THAT THE FAILURE WAS DUE TO FUEL PUMP. THE CONTACT WAS INFORMED THAT PARTS WERE ON BACK ORDER. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 8,000.*DT  THE VEHICLE WAS REPAIRED 15 DAYS LATER BUT UNFORTUNATELY THEY DID NOT CHANGE ALL THE RECALL PARTS. THEY CONTINUE TO FAIL THE CUSTOMERS OF THE VIRGIN ISLANDS BY TYPICALLY IGNORING THE IMPORTANCE OF INFORMING THEN ABOUT THE DANGERS OF THESE RECALL AND FAILED PARTS.  IT IS POSSIBLE WE ARE BEING DISENFRANCHISE AND NEED TO BE PROTECTED UNDER THE ANTITRUST LAWS. THE OWNER OF THE DEALERSHIP CONTROLS MORE THAN 85% OF THE MARKET, WHICH MIGHT BE A VIOLATION OF ANTITRUST LAWS.*JB",
        "vin": "4T1BZ1HK3KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/19/2020",
        "dateOfIncident": "08/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350308,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STOPS WORKING AND RUNS ROUGH AND THE DEALER SAID IT'S A BAD FUEL PUMP BUT DOESN'T HAVE A RECALL",
        "vin": "4T1B11HK0KU"
    },
    {
        "components": "POWER TRAIN,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/14/2020",
        "dateOfIncident": "07/10/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349205,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR, SINCE THE PURCHASE AT 51 MILES, IS CONSTANTLY NOT ACCELERATING WHEN I PUSH THE GAS. I HAVE TAKEN IT TO ALLEN TOYOTA, 11 JULY 2020, WHERE THEY STATED THERE WAS A KNOWN ISSUE WITH CALIBRATION. THE CALIBRATION WAS COMPLETED, BUT THE CAR IS STILL DOING THE SAME THING. ONCE THE CAR HAS BEEN IN PARK AND STATIONARY FOR A FEW HOURS, IT IS AWFUL WHEN TAKING OFF BECAUSE THE CAR JERKS AND ACTS AS IF IT WILL TURN OFF. THE CAR NOW IS JERKING WHEN DRIVING ON THE INTERSTATE AT 70 MPH DAILY. THIS IS DANGEROUS SINCE I CANNOT DEPEND ON THE CAR TO SPEEDUP WHEN AND AS NEEDED AND I'M AFRAID IT MY STALL AND CAUSE AN ACCIDENT.",
        "vin": "4T1B11HK8KU"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/14/2020",
        "dateOfIncident": "01/22/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349265,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA CAMRY. THE CONTACT STATED UPON ENTERING HER VEHICLE, THE CHECK ENGINE WARNING LIGHT WAS DISPLAYED ON THE INSTRUMENT PANEL. ADDITIONALLY, THE BRAKES LCD WAS ALSO DISPLAYED ON THE INSTRUMENT PANEL. THE VEHICLE WAS TAKEN TO TOYOTA OF BOWIE (16700 GOVERNOR BRIDGE RD, BOWIE, MD 20716) HOWEVER, THE DIAGNOSTIC TEST WAS UNABLE TO DETERMINE THE CAUSE FOR THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 14,000.",
        "vin": "4T1B11HK5KU"
    },
    {
        "components": "SUSPENSION,STRUCTURE,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "08/13/2020",
        "dateOfIncident": "07/27/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11348956,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TOYOTA CAMRY 2019 (VEHICLE 1) WAS HIT BY THE VEHICLE COMING IN OPPOSITE DIRECTION AND TRYING TO TAKE LEFT TURN AT FULL SPEED. THE CAR WAS BADLY HIT ON THE DRIVER SIDE FRONT BENDER. THERE WAS IMMEDIATE OIL LEAK FROM THE ENGINE. THE SUSPENSION WAS BADLY BROKEN AND TWISTED ON THE DRIVER SIDE. AIR BAGS DID NOT GOT DEPLOYED IN MY CAR BUT WERE DEPLOYED IN THE TOYOTA RAV4 (VEHICLE 2). THE DRIVER 2 HAD BLOODIED NOSE FROM AIR BAG DEPLOYMENT. THE PASSENGER AIR BAGS IN VEHICLE 2 WERE ALSO DEPLOYED BUT THERE WAS NO ACTUAL PASSENGER.",
        "vin": "4T1B11HKXKU"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/12/2020",
        "dateOfIncident": "08/10/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348748,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING I SLOWED DOWN DUE TO A CAR BEING IN FRONT OF ME BUT WHEN I PRESSED ON THE GAS THE CAR STALLED AND WOULD NOT PICK UP SPEED OR ACCELERATE. MY CAR HAS 24,000 MILES AND HAVE NOTICED A HESITATION WHEN IN TRAFFIC DURING STOP AND GO TRAFFIC WHEN I FIRST PURCHASED THE CAR 6,000 MILES BUT RECENTLY AT 24,000 MILES 1 INSTANCE OF STALLING",
        "vin": "4T1B11HK3KU"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/25/2020",
        "dateOfIncident": "07/25/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341436,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "LCD DISPLAY SHOWING   -CHECK ENGINE  -PRE COLLISION SYSTEM MALFUNCTIONING  - SECONDARY COLLISION BRAKE SYSTEM MALFUNCTIONING  -DRIVE START CONTROL MALFUNCTIONING     SEVERAL WARNING SIGNS ON RPM DISPLAY",
        "vin": "4T1B11HK8KU"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/13/2020",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339020,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FIRST PROBLEM: THE CAR HAS ACCELERATION DELAYS, IT BUCKS AND LAGS WHEN SWITCHING LANES AND DRIVING IN HEAVY TRAFFIC. THE CAR JERKS WHEN ACCELERATING AT SLOW SPEEDS. I ALMOST GOT INTO A    SERIOUS ACCIDENT DUE TO THE ACCELERATION DELAYS WHEN MAKING A LEFT IN HEAVY TRAFFIC.    THE SECOND PROBLEM IS, I RECEIVED A VEHICLE ALERT MESSAGE ON MAY 30TH AT 10:30AM REGARDING THE SRS AIRBAG SYSTEM. \"A MALFUNCTION IN THE SRS AIRBAG SYSTEM HAS BEEN DETECTED. CONTACT YOUR TOYOTA DEALER TO HAVE YOUR VEHICLE INSPECTED.\" THE AIRBAG CHECK LIGHT NEVER LIGHTED SO I DIDN'T SEE THIS MESSAGE UNTIL A MONTH IN A HALF LATER. DANGEROUS FOR MY PASSENGER WHICH IS USUALLY MY OLDEST SON. THE CAR IS IN THE DEALERSHIP NOW AND THEY ARE TRYING TO FIGURE OUT THE AIRBAG ISSUE.    I FEEL UNSAFE IN MY CAR DUE TO ACCELERATION DELAYS. THE VIN# IS NOT IN THE RECALL LIST AND I DO NOT UNDERSTAND WHY NOT. IT HAS THE SAME ISSUES AS THE OTHER CARS BEING RECALLED.    THE THIRD PROBLEM: VERY RANDOMLY THE SEAT BELT ALERT ALARM WILL START BEEPING WHILE I'M DRIVING MY SMALLEST SON. BOTH OF US HAVE OUR SEAT BELTS AND I DO NOT OWN A BIG HEAVY BAG. THE CAR WONT STOP UNTIL I PULL OVER, PARK, TURN IT OFF AND ON. THIS IS NOT NORMAL BUT IT HAPPENS VERY RANDOMLY.",
        "vin": "4T1B11HK5KU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/07/2020",
        "dateOfIncident": "08/22/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337970,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "IN STOP AND GO TRAFFIC, TRAVELING AT SLOW SPEEDS WITH AC ON IN THE MIDDLE OF SUMMER, IF CHANGING TO A FASTER LANE, HAVING THE GAS FLOORED, THE CAR WOULDN'T ACCELERATE/DOWN SHIFT THAT LASTED ABOUT 5-10 SECONDS BEFORE IT ACCELERATED. ONE TIME, A CAR THAT WAS TWO CARS IN FRONT OF ME PULLED OUT AND HE WAS GONE, WHILE I WAS STILL SITTING THERE WITH NO ACCELERATION AND ANOTHER CAR QUICKLY APPROACHING FROM THE REAR! I WAS TOLD THAT OTHERS WERE COMPLAINING ABOUT THESE ISSUES, THEY FELT THE PROBLEM BUT IT IS NORMAL OPERATIONS FOR THE 4 CYL CAMRY'S, THAT THE TRANSMISSION IS COMPUTER CONTROLLED, AND THERE WASN'T ANYTHING THEY COULD DO UNTIL TOYOTA PUT OUT A MOD FOR THE COMPUTER. THEY SAID TOYOTA SHOULD HAVE SOMETHING OUT SOON  WITH ALL THE COMPLAINTS, BUT IT HAS BEEN ALMOST A YEAR AND NO REPAIR AVAILABLE.",
        "vin": "4T1B11HK0KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/06/2020",
        "dateOfIncident": "06/27/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337655,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS IN MOTION ON THE INTERSTATE AT 70 MPH.  THE CHECK ENGINE LIGHT CAME ON AND THE ENGINE BEGAN TO STALL.  I HAD TO PULL OVER ON SIDE THE ROAD TO PREVENT FROM GETTING HIT BY AN 18 WHEELER FROM THE REAR. I WAS ABLE TO DRIVE THE VEHICLE A WHILE LONGER BEFORE THE ENGINE STALLED AGAIN.  I HAD TO GET THE VEHICLE TOWED TO THE NEAREST TOYOTA DEALERSHIP.  THEY REPORTED AN ISSUE WITH THE FUEL PUMP.  THE DEALERSHIP REPORTED HAVING MANY ISSUES WITH THE FUEL PUMP FOR THE 2019 CAMRY. ON THE DATE OF JUNE 29TH REPAIR APPOINTMENT, THEY REPORTED THEY FUEL PUMP IS ON BACK ORDER AND THEY WOULD NOT BE ABLE TO GET THE PART UNTIL JULY 22ND, 2020 DUE TO SO MANY VEHICLES HAVING THAT DEFECT. HOWEVER, THE PART IS UNDER WARRANTY AND WOULD BE COVERED.  AS A RESULT, I HAD TO PRIVATELY RENT A VEHICLE WITHOUT BEING OFFERED A LOANER CAR OR A RENTAL FOR 2 WEEKS.  I HAD TO SPEND APPROXIMATELY 1,000 IN EXPENSES TO COVER THE COST OF NOT HAVING A VEHICLE. THE VEHICLE WAS TOWED TO A DEALERSHIP IN A REMOTE AREA FAR FROM HOME AND WORK.  MY DISABLED MOTHER HAD TO BOOK A HOTEL TO CHECK THE VEHICLE STATUS THE FOLLOWING DAY WITH MY FATHER. I'VE HAD THE VEHICLE FOR 8 MONTHS WITH 29,000 MILES.   WHEN I PLACED MY VIN NUMBER IN THE SYSTEM, MY VEHICLE WASN'T IDENTIFIED OR QUALIFIED AS A RECALL IN THE SYSTEM DESPITE THE DEALERSHIP CONFIRMING THEIR WERE PROBLEMS WITH THE FUEL PUMP AND THE DESCRIPTION OF THE VEHICLE DEFECT MATCHING ONE OF THE 5 IDENTIFIED RECALLS  RELATED TO THE TOYOTA CAMRY.  BASED ON MY VIN #, MY VEHICLE DIDN'T QUALIFY FOR ANY RECALLS, WHEN I CALLED THE TOYOTA RECALL OFFICE, THEY REPORTED MY VEHICLE DIDN'T MEET RECALL STANDARDS .THE  KELLY BLUE BOOK REPORTED 5 DIFFERENT RECALLS AND THEIR DESCRIPTIONS IN RELATION TO THE 2019 CAMRY.  I NOTICED THE FUEL PUMP DEFECT/SYMPTOMS MATCHED  WITH MY VEHICLE OUT OF THE 5 IDENTIFIED RECALLS.",
        "vin": "4T1B11HK4KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/26/2020",
        "dateOfIncident": "06/24/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331057,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "HESITATION UPON FUEL DEMAND WHILE ALREADY IN MOTION AND AT TAKE-OFF, NO DASH LIGHTS CAME ON.  *TR",
        "vin": "4T1B11HK9KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/26/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331086,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I CALL NHTSA ON JUNE 25TH NO MAKE A COMPLAINT THAT I STILL DO NOT HAVE A RECALL RESOLUTION TO A SAFETY RECALL (NHTSA RECALL NUMBER 304250)  THE NHTSA REP INFORMS ME TOYOTA DOES HAVE A REMEDY AND TO CALL A DEALER. I INFORM THE NHTSA REP TOYOTA CORPORATION AND DEALERS ARE POOR MANUFACTURES AND HAVE PROBLEMS, AND HE INFORMS ME TO MAKE A COMPLAINT TO CONTACT THE FEDERAL TRADE COMMISSION.  I ALSO NOTICE ON  JUNE 26TH THE DAY AFTER SPEAKING WITH THE NHTSA REP, THE NHTSA WEBSITE INDICATES THE REMEDY FOR THE RECALL IS NOT READY:      JAN 13,2020   MANUFACTURER RECALL NUMBER20TA02  NHTSA RECALL NUMBER20V012  RECALL STATUSRECALL INCOMPLETE.  *TR",
        "vin": "4T1BZ1HK4KU"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/22/2020",
        "dateOfIncident": "06/21/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329985,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY PURCHASED A 2019 CAMRY PRE-OWNED. IT RAN FINE FOR A WEEK UNTIL IT WOULD START A JERKING MOTION AND THE ENGINE JUST TURNS OFF WHILE I AM DRIVING. I AM CONCERNED THAT THIS COULD CAUSE AN ACCIDENT ESPECIALLY ON A BUSY HIGHWAY. THANKFULLY I WAS NEAR AN AUTOZONE.  WHILE IN THE JERKING MOTION, THE CHECK ENGINE LIGHT COMES ON AND THE STEERING WHEEL LOCKS.  THIS IS THE 3RD TIME IN A WEEK THAT THE CAR HAS STALLED OUT WHILE DRIVING.  *TR",
        "vin": "4T1B11HK0KU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/17/2020",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329393,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE LACKS POWER AFTER SLOWING DOWN AT A YIELD SIGNS OR CORNERS, (NOT EVERY TIME) WHEN YOU TRY TO INCREASE SPEED IT TAKES A SECOND FOR THE POWER TO INCREASE.  ON HIGHWAYS, THE RPMS WILL INCREASE OR DECREASE 100-700 AT TIMES WITH OR WITHOUT THE CRUISE CONTROL ENGAGED SEEMS TO BE A FUEL SUPPLY ISSUE. BEEN TO TWO DIFFERENT DEALERSHIPS AND THEY CAN NEVER DUPLICATE THE ISSUE IN THE SERVICE CENTERS.  STARTED RIGHT BEFORE THE 15,000 MILE SERVICE AND CONTINUES NOW AT 30,000 MILE SERVICE.  *TR",
        "vin": "4T1BZ1HK9KU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/12/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328610,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE CAR STOPS AND THEN GETS READY TO TAKE OFF THERE IS HESITATION WHEN APPLYING GAS. CAR OFTEN LAGS. DOES NOT ACCELERATE CONSISTENTLY AS IT SHOULD. PRIMARILY OCCURS AFTER CAR IS MOVING SLOWLY AND SEEMS AS IF THE CAR IS STRUGGLING TO TAKE OFF, THIS HAPPENS UPON STOPPING AT A TRAFFIC LIGHT AND TAKING OFF AND UPON DRIVING ON THE EXPRESSWAY THEN TRYING TO GET UP TO THE SPEED WITH TRAFFIC.  *TR",
        "vin": "4T1B61HK5KU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/10/2020",
        "dateOfIncident": "06/10/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328117,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION HESITATES WHEN SHIFTING UNDER PARTIAL AND FULL THROTTLE. TRANSMISSION SHIFTS UP TO TOO HIGH OF A GEAR IN THE ECONOMY MODE.  *TR",
        "vin": "4T1B11HK9KU"
    },
    {
        "components": "EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/26/2020",
        "dateOfIncident": "05/23/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325923,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS COMPLAINT IS FOR ALL CARS.  WHEN DRIVING IN HEAVY RAIN IT IS IMPORTANT TO TURN ON HEADLIGHTS IN ORDER FOR THE TAILLIGHTS TO ILLUMINATE.  ALMOST NO ONE DOES THIS ANYMORE DUE TO DRL AND AUTOMATIC HEADLIGHTS.  DURING A RECENT VERY HEAVY RAINSTORM IT WAS ALMOST IMPOSSIBLE TO SEE CARS AHEAD OF ME, ALMOST RESULTING IN A COLLISION.  IT SHOULD BE MANDATORY THAT THE TAILLIGHTS COME ON ANYTIME THE WIPERS ARE ACTIVE.  THIS IS SERIOUS.  *TR",
        "vin": "4T1B11HKXKU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/12/2020",
        "dateOfIncident": "03/21/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324286,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED END OF NOV 2018. TWO MONTHS LATER, STEERING KEPT GOING OUT SPORADICALLY.  HAVE TAKEN IT IN MULTIPLE TIMES STARTING IN 3/19, AGAIN IN APRIL, AGAIN IN MAY WHEN THEY REPLACED THE STEERING GEAR.  STEERING CONTINUED TO GO OUT RANDOMLY.  TOOK IT IN AGAIN IN OCTOBER 2019 - STEERING GOING OUT.  REPLACED ACTIVE GEAR SHUTTER, ONLY TO HAVE THE LIGHT COME BACK ON 3 MILES AWAY.TOOK CAR BACK AGAIN 21 DAYS LATER AND THEY STILL CAN'T FIND THE PROBLEM. ON MAY 10TH, WENT OUT MULTIPLE TIMES ON A WINDY CANYON. TODAY, MAY 12, THEY REFUSED TO EVEN LOOK AT THE CAR.  WE HAVE  NO CHOICE BUT TO TAKE LEGAL ACTION. WE HAVE ALL DOCUMENTATION.  ANY ASSISTANCE YOU CAN PROVIDE WOULD BE HELPFUL.  WE ARE NOW BEING TOLD IT IS OUT OF WARRANTY, BUT THE PROBLEM WAS  NEVER FIXED.",
        "vin": "4T1B21HKXKU"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/11/2020",
        "dateOfIncident": "11/15/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324120,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA CAMRY.  THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. TOYOTA OF BROADMAN (8250 MARKET ST, BOARDMAN, OH 44512) WAS CONTACTED AND CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "4T1BZ1HK9KU"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/11/2020",
        "dateOfIncident": "04/25/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324156,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2019 TOYOTA CAMRY HYBRID LE WHICH PURCHASED AS BRAND NEW. AFTER 2-3 MONTHS OF DRIVING, I NOTICED THAT AT LOW SPEEDS AND PARTICULARLY WHEN THE ROAD IS VERY FLAT IF THE CAR HITS ANY KIND OF POTHOLE OR BUMP, THERE IS A GRINDING NOISE COMING FROM THE FRONT BREAKS (OR MAYBE THE CVT GEARS ENGAGING FOR REGENERATIVE BREAKING) AND SOMETIMES EVEN THE ABS LIGHT STARTS SHINING IN THE DASHBOARD. THIS IS NOT EASILY REPLICABLE BUT IT'S MOST LIKELY TO HAPPEN WHEN SLOWING DOWN BEHIND A STOP SIGN OR RED LIGHT. AT HIGHER SPEEDS OR IF THE BREAKS ARE APPLIED WITH HIGHER FORCE THIS ISSUE IS ALMOST ENTIRELY NOT PRESENT. ALSO, I'VE NOT NOTICED IT WHILE THE VEHICLE IS TURNING, IT USUALLY ONLY HAPPENS WHEN SLOWING DOWN ON A STRAIGHT AND FLAT ROAD AND SUDDENLY ONE OF THE TIRES GOES OFF BALANCE.  *TR",
        "vin": "4T1B31HK0KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/07/2020",
        "dateOfIncident": "05/07/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323794,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BLUETOOTH NOT WORKING PROPERLY WITH IPHONES. TOYOTA+ALEXA IS NOT WORKING AT ALL. TOYOTA BLAMING ON APPLE IPHONES.  *TR",
        "vin": "4T1B11HK2KU"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/17/2020",
        "dateOfIncident": "04/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321390,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE OFTEN HAS EXTREME HESITATION WHEN APPLYING GAS.  CAR OFTEN LAGS.  DOES NOT ACCELERATE CONSISTENTLY AS IT SHOULD. PRIMARILY OCCURS AFTER CAR IS MOVING SLOWLY.  *TR",
        "vin": "4T1B11HK1KU"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/28/2020",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319561,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE STALLING, AS IF FUEL PUMP NOT WORKING PROPERLY, WHEN VEHICLE IS IN MOTION ON CITY STREETS AND HIGHWAY.",
        "vin": "4T1B11HK8KU"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/28/2020",
        "dateOfIncident": "02/17/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319589,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "YES, I DEFINITELY NEED YOUR HELP MY MOTHERS VEHICLE ALARMED SRS MALFUNCTION IN AIRBAG SYSTEM. THIS HAPPENED AFTER GETTING MY VEHICLE SERVICED AT THE TOYOTA DEALERSHIP THAT IT WAS PURCHASED FROM. WHERE WE HAD OTHER ISSUES PRIOR ALL WITHIN THE PURCHASE & MAKES US TO BELIEVE MAYBE CAUSING ISSUE POSSIBLY. VEHICLE SERVICE OIL CHANGE 2/17 THEN STARTED ALARMING 2/18. TOOK TO ANOTHER SISTER TOYOTA DEALERSHIP 2/19 TO 2/28. DROVE VEHICLE WITH NO AIRBAGS HOME. THEN TOWED IT BACK TO ORIGINAL DEALERSHIP FROM 3/17 TO TODAY 3/28. WHO NOW WANT US TO PUT A CLAIM IN WITH USAA FOR $3,000 HARNESS. INSURANCE ISN'T GOING TO COVER. SO NOW MAY BE FORCED TO DRIVE THE VEHICLE WITH NO AIRBAGS HOME ONCE AGAIN. PLEASE HELP THIS IS MY MOTHER'S VEHICLE & I TAKE CARE OF HER. SHE HAS DEMENTIA & I'M OVERWHELMED WITH THIS CRAZY SITUATION.",
        "vin": "4T1B11HK6KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/20/2020",
        "dateOfIncident": "01/16/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318764,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION IS VERY SLOW ON COMPUTING THE SPEED. IF YOU'RE DRIVING AND SLOW DOWN, THE CAR STILL STAYS IN THE GEAR BEFORE YOU SLOWED DOWN. IT ACTUALLY TAKES A WHILE FOR IT TO ADJUST MAKING THIS CAR A SAFETY HAZARD. MAKING TURNS AND ACCELERATING A VERY DANGEROUS IN THIS VEHICLE AND IT NEEDS TO BE ADDRESSED.",
        "vin": "4T1B11HKXKU"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/08/2020",
        "dateOfIncident": "02/27/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316917,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PROBLEM IS WHEN THE CAR WAS RUNNING AND I PRESSED THE GAS PEDAL THE CAR DID NOT ACCELERATE, IT TOOK AROUND 2 SECONDS FOR THE CAR TO ACCELERATE BUT IT SPEEDS UP SUDDENLY. THIS FACT MAY LEAD TO AN UNEXPECTED ACCIDENT FOR THE DRIVER.    BESIDES I CHECKED THE VEHICLE ALERT HISTORY, THERE IS A RECORD THAT SHOWED A CHECK ENGINE ALERT REGARDING \"A MALFUNCTION IN THE ELECTRONIC CONTROL OF THE ENGINE, THROTTLE, OR AUTOMATIC TRANSMISSION HAS BEEN DETECTED\" (SEE THE ATTACHED IMAGE FOR DETAIL)",
        "vin": "4T1B11HKXKU"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/05/2020",
        "dateOfIncident": "03/04/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316289,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IN CRUISE CONTROL ON THE FREEWAY I HAVE NOTICED THAT WHEN A CAR PASSES YOU WHEN IT CHANGES LANES IN FRONT OF YOU  IT DECREASES THE SPEED FROM 68 MPH TO AN ABRUPT 57 MPH EVEN WHEN I HAVE 6 TO 7 CAR LENGTHS BETWEEN THE CAR IN FRONT OF ME, WHEN THIS OCCURS.I STOPPED USING THE CRUISE CONTROL FEATURE BECAUSE THIS COULD CAUSE AN ACCIDENT IF A CAR BEHIND ME WAS FOLLOWING TO CLOSE AND WOULD  CRASH INTO MY REAR OF MY VEHICLE",
        "vin": "4T1B11HK1KU"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/29/2020",
        "dateOfIncident": "02/28/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11312201,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY REAR BACK SEAT AIR BAG SEAT BELT SENSOR WILL NOT STOP GOING OFF WITHOUT BEING THE SEATBELT BEING CONNECTED. OR WHEN MY DAUGHTER SIT IN THE MIDDLE OF THE BACKSEAT WITH SEAT BELT CONNECTED IT GOES OFF NON STOP WHILE SHE IS SITTING IN THE SEAT WITH HER SEATBELT ON. I JUST BOUGHT THIS CAR HAS NOT BEEN 1 WEEK AND THIA IS A MAJOR SAFTY PROBLEM.",
        "vin": "4T1B11HK1KU"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/27/2020",
        "dateOfIncident": "09/03/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311828,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I DRIVE MY CAR, IT HESITATES AND FEELS LIKE ITS LOSING POWER, IT DOES IT ALL THE TIME IT'S NOT JUST A FEW TIMES. AND IT DOESN'T MATTER WHAT SPEED I'M DRIVING IT STILL DOES IT. IT ACTS LIKE IT'S NOT GETTING ENOUGH FUEL TO THE ENGINE. IT DOES IT ON THE HIGHWAY, ON CITY STREETS. IT ACTS LIKE IT WANTS TO SHUT OFF, AND I'M AFRAID THAT IT'S GOING TO GOING DOWN THE ROAD. NOT SURE IF IT'S A FUEL ISSUE OR IF ITS SOMETHING IN THE MOTOR, BUT IT REALLY NEEDS CHECKED OUT AND FIXED. I'VE COMPLAINED ABOUT THIS PROBLEM FOR ALMOST 6 MONTHS NOW AND NOTHING HAS BEEN DONE.",
        "vin": "4T1B11HK7KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/18/2020",
        "dateOfIncident": "11/27/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309932,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR DOES NOT FULLY WARM UP TO OPERATING TEMPERATURE WHEN WEATHER TEMPERATURE OUTSIDE IS UNDER 45 DEGREES. TEMPERATURE GAUGE WILL CONSTANTLY MOVE TOWARD COLD WHEN I AM IDLING OR STOPPED AT A STOP LIGHT AND I HAVE TO DRIVE AGGRESSIVELY FOR THE ENGINE TO GET TO OPERATING TEMPERATURE. HEAT BLOWS LIKE WARM TO COLD BECAUSE OF THIS.",
        "vin": "4T1B11HK3KU"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/14/2020",
        "dateOfIncident": "02/12/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309174,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "LOW SPEED WIPER STOPS WORKING SOMETIMES IN THE RAIN.HIGH SPEED WORKS OK. DEALER COULD  DID NOT FIND PROBLEM OR MAYBE DID NOT CHECK LONG ENOUGH.",
        "vin": "4T1B11HK9KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/05/2020",
        "dateOfIncident": "11/19/2019",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307338,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON NOV 19 2019 MY HUSBAND WAS DRIVING OUR 6 WEEK OLD NEW CAMARY ON THE INTERSTATE. HE HEARD A BACKFIRE SOUND BY THE TIME HE COULD PULL OVER THE CAR HAD NO POWER AND HE GOT OUT THERE WERE FLAMES AND SMOKE COMING FROM UNDER THE CAR. THE CAR BURNED TO THE GROUND A TOTAL LOSS NOTHING LEFT BUT THE FRAME",
        "vin": "4T1B11HK5KU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/03/2020",
        "dateOfIncident": "01/12/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306747,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPLAINT ABOUT PRODUCT QUALITY FRONT DOOR APPLIQUE FLAT BACK MOULDING AND REAR DOOR APPLIQUE FLAT BLACK MOULDING. THE PARTS LISTED ABOVE HAVE MELTED FROM THE SUN. THE WARRANTY REFUSES TO COVER THIS ISSUE THIS IS A BRAND NEW 2019 TOYOTA CAMRY AND TOYOTA SHOULD STAND UP TO SUPPORT THE QUALITY OF THEIR PRODUCTS.",
        "vin": "4T1B11HK6KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/27/2020",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302210,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HEATER INTERMITTENTLY DOES NOT HEAT, THUS DOES NOT CLEAR WINDOWS IN VERY COLD WEATHER WHILE DRIVING.",
        "vin": "4T1B61HK2KU"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/16/2020",
        "dateOfIncident": "06/24/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299932,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM HAVING ISSUES WITH MY 2019 CAMRY SE. WHEN I AM ON A COMPLETE STOP OR AFTER SLOWING DOWN TO OR UNDER 6 MPH AND ATTEMPTING TO REGAIN SPEED, THE CAR TAKES A SECOND OR TWO TO RESPOND. THIS IS VERY CONCERNING, ESPECIALLY WHEN YOU ARE ON A COMPLETE STOP AND THERE IS A LOT OF INCOMING TRAFFIC.",
        "vin": "4T1B11HK8KU"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/15/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299434,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR SOMETIMES STALLS ON ACCELERATION DURING A STOP, LIKE AT A RED LIGHT OR STOP SIGN. CITY STREET DRIVING.",
        "vin": "4T1B11HK0KU"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/15/2020",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299454,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2019 CAMERY COMPLETELY STALLS AT TAKE OFF. YOU GO TO ACCELERATE AND IT STALLS.  I HAVE BROUGHT THIS TO MY DEALERSHIPS ATTENTION AND THEY SAY THINGS ARE FINE. THIS IS VERY DANGEROUS WHEN YOUR IN THE FREEWAY AND TRYING TO PASS OR MERGE. I HAVE DROVE PLENTY OF CARS AND NEVER HAD A ACCELERATION ISSUE. THIS DOES IT AT A FULL STOP IT TAKES FOREVER TO GET GOING ON THE TAKE OFF. THIS HAS TO BE A MAJOR ISSUE AS I HAVE READ UP ON IT AND LIVING PROOF MY CAR DOES IT AS WELL. I HAVE WENT TO ANOTHER DEALERSHIP NOT ASSOCIATED WITH MINE AND THEY SAID THERE IS A ISSUE, BUT CAN'T WORK ON IT BECAUSE THE CAR IS UNDER WARRANTY AND NEEDS TO GO TO A TOYOTA DEALERSHIP. WHICH I AGREED; HOWEVER THE TOYOTA DEALERSHIPS SAY IT'S FINE. THIS IS VERY AWFUL.",
        "vin": "4T1B61HK6KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/14/2020",
        "dateOfIncident": "09/04/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299359,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP HAS BEEN CAUGHT RUNNING THE MORNING AFTER PARKING MULTIPLE TIMES. IN TANK FUEL PUMP RUNNING WHEN CAR IS PARKED AND TURNED OFF. WEAR ON THE IN TANK FUEL PUMP RUNNING FOR HOURS CAUSES ACCELERATED WEAR AND  POTENTIAL FAILURE. ISSUE HAS HAPPENED FREQUENTLY SINCE THE INITIAL DATE.",
        "vin": "4T1B11HK1KU"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/09/2020",
        "dateOfIncident": "11/22/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298217,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WINDSHIELD IN MY 2019 TOYOTA CAMRY SEEMS TO HAVE CRYSTALS AND CHIPS IN IT. I NOTICE THIS AS SOON AS I PURCHASED IT, WHEN LIGHT REFLECTS ON IT. THERE ALSO SEEMS TO BE  SCRATCHES. IT IS A NEW CAR ONLY HAD 27 MILES ON IT WHEN I PURCHASED IT.",
        "vin": "4T1B11HK1KU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/08/2019",
        "dateOfIncident": "08/22/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287741,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2019 CAMRY SE HAS A JERKY TRANSMISSION. THE PROBLEM OCCURS AT LOW SPEED AND SEEMS MORE SYSTEMATIC WHEN REACCELERATING FROM A ROLLING STOP. AFTER SLOWING DOWN TO UNDER 15 MPH OR SO AND ATTEMPTING TO REGAIN SPEED (BEFORE REACHING A FULL STOP), THE CAR TYPICALLY TAKES A SECOND OR TWO TO RESPOND TO THROTTLE INPUT THEN LURCHES FORWARD IN AN AGGRESSIVE AND POTENTIALLY DANGEROUS WAY. THIS IS NOT A MINOR INCONVENIENCE THAT ONE GETS USED TO OR CAN LEARN TO LIVE WITH. I BELIEVE IT HAS THE POTENTIAL TO CAUSE HARM TO ME AND OTHERS IN BUSY TRAFFIC.",
        "vin": "4T1B11HK1KU"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/13/2019",
        "dateOfIncident": "11/06/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279740,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "HESITATION ON ACCELERATION FROM A SLOW ROLL OR ROLLING  STOP. CAR EXHIBIT A HESITATION ON ACCELERATION FROM A SLOW ROLL  OR ROLLING STOP UNDER THE FOLLOWING CONDITIONS.  &#61623; 6 MPH OR BELOW  &#61623; IMMEDIATELY FOLLOWING A 3 ' 1 DOWNSHIFT  &#61623; LESS THAN 40% ACCELERATOR PEDAL APPLICATION",
        "vin": "4T1B11HK3KU"
    },
    {
        "components": "AIR BAGS,EQUIPMENT",
        "crash": true,
        "dateComplaintFiled": "11/10/2019",
        "dateOfIncident": "10/09/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11279288,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PTS18-48081",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I HAVE A 2009 CAMRY THAT I LEASED ON 3/8/19.  ON 10/9/19 I WAS INVOLVED IN AN ACCIDENT, NOT CITED, THE CAR THAT HIT ME FROM THE REAR DOING 90 MPM UPON INPACT PUSHED IN FROM SOUTH BOUND TO EAST BOUND.  I WAS THEN HIT ON RIGHT FRONT SIDE BY AN 18 WHEELER AND HAD 4 RADIAL FRACTURES ON MY LEFT ARM; MY LEFT HAND FLIPPED OVER BACKWARDS ON MY FOREARM AND BONES PROTRUDED FROM EACH SIDE OF ARMS.  NOT ONE AIRBAG WAS DEPLOYED FROM THE INCEPTION OF THE ACCIDENT TO THE ACCIDENT ON MY ARM.  I NOW HAVE A TOTALED CAMRY; I HAD SURGERY ON MY LEFT ARM TWO DAYS LATER, LOST OF WAGES AND DISABLED ON MY LEFT SIDE.  TOYOTA IS NOT TAKING ANY RESPONSIBILITY FOR THIS SITUATION AS IF THE AIRBAGS HAD DEPLOYED; I WOULD NOT HAVE THIS RADIAL FRACTURE, WHICH IS WHAT I WAS PAYING FOR BY LEASING THIS TOYOTA CAMRY 2019.  I NEED HELP.  I HAVE PICTURES OF THE OUTSIDE OF THE CAR AS WELL AS INSIDE THE CAR SHOWING NO AIRBAGS DEPLOYED.",
        "vin": "4T1B11HK2KU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/08/2019",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278869,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT A 1 SECOND DELAY IN ACCELERATION ESPECIALLY AFTER COASTING OR A ROLLING STOP.",
        "vin": "4T1B11HK0KU"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/04/2019",
        "dateOfIncident": "04/16/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278079,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD WARNING BRAKES FLASHES  APPEARS. FREEWAY  AND CITY 5X HAPPEN NO CAR BEHIND OR FRONT OF THE VEHICLE STOP IN THE MIDDLE OF FREEWAY ...",
        "vin": "4T1B61HKXKU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/25/2019",
        "dateOfIncident": "10/05/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270925,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "POUR TAKE OFF AND POWER ON THE ENGINE AND ENGINE NOCKING LIKE BAD PISTONS SOUND AND VERY NOISY ENGINE.",
        "vin": "4T1B61HKXKU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/21/2019",
        "dateOfIncident": "09/18/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11270054,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2019 TOYOTA CAMRY. WHILE DRIVING 10 MPH, THE FORWARD COLLISION SYSTEM FAILED TO ENGAGE CORRECTLY AND CAUSED THE CONTACT TO SLAM ON THE BRAKE PEDAL. AS A RESULT, THE EMERGENCY BRAKING SYSTEM DID NOT ENGAGE AND THE CONTACT CRASHED INTO ANOTHER VEHICLE. THE AIR BAGS DID NOT DEPLOY. THE CONTACT SUSTAINED MINOR INJURIES TO THE RIGHT SHOULDER, BACK, AND NECK. MEDICAL ATTENTION WAS NOT RECIEVED. A POLICE REPORT WAS NOT FAILED. THE VEHICLE WAS TOWED BY THE CONTACT'S INSURANCE COMPANY TO A COLLISION CENTER. THE VEHICLE WAS DEEMED TOTALED. TOYOTA OF OLYMPIA (6969 TYEE DR. SW, TUMWATER, WA 98512, (360) 539-3939) WAS CONTACTED, BUT DID NOT ASSIST. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE MANUFACTURER WAS CONTACTED AND PROVIDED CASE NUMBER: 1908201158. THE FAILURE MILEAGE WAS APPROXIMATELY 1,942.",
        "vin": "4T1B61HK5KU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/18/2019",
        "dateOfIncident": "10/17/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269478,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION STARTING FROM A COMPLETE STOP DOESN'T SEEM TO BE PROPER. IT REVS UP A LOT BEFORE SHIFTING GEAR. TRANSMISSION IS ALSO JERKY/HESISTANT WHEN DOING A SUDDEN DOWN-PRESS ON THE GAS-PEDAL",
        "vin": "4T1B11HKXKU"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/09/2019",
        "dateOfIncident": "09/28/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267385,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA CAMRY. THE CONTACT STATED THAT THE DEFROSTERS FOR THE FRONT AND REAR WINDOWS WERE NOT INSTALLED PROPERLY. THE CONTACT SPOKE WITH TOYOTA OF BRAINTREE (210 UNION ST, BRAINTREE, MA 02184, 781-848-9300) AND WAS INFORMED THAT THE DEFROSTER WAS NOT INSTALLED IN THE FRONT WINDOW AND COULD NOT BE INSTALLED BY THEM. THE DEALER STATED THAT THE CONTACT WOULD HAVE TO TRADE IN HER VEHICLE FOR ANOTHER ONE AND LOSE HER $6,177.13 DOWN PAYMENT IN THE PROCESS. THE CONTACT STATED THAT THEY WOULD PAY THE TAXES ON THE NEW VEHICLE AND INSTALL AN ALARM SYSTEM THAT COST $2,000. THE REMAINING $4,177.13 COULD NOT BE TRANSFERRED TO THE NEW VEHICLE BECAUSE IT WAS USED UP AS A DOWN PAYMENT ON THE OLD VEHICLE. THE MANUFACTURER INFORMED THE CONTACT THAT THERE WAS NOTHING THEY COULD DO AND ADVISED HER TO WORK IT OUT WITH THE DEALER. THE FAILURE MILEAGE WAS 200.",
        "vin": "4T1B11HK4KU"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/07/2019",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266792,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE NEW CAR HAS DOES NOT ACCELERATE FOR SOMETIME AT STOP AND GO AND NO MATTER HOW MUCH U PRESS THE GAS PEDAL, AND WHEN YOU PRESS HARDER FOR A WHILE A JERKY QUICK GEAR CHANGE HAPPENS WITH UNINTENDED ACCELARATION RATES. THIS BECAME PARTICULARLY OF CONCERN ON FREEWAY/TOLLWAY WHEN I TRIED CHANGING LANES AS THE TRAFFIC STARTED CLEARING,PUTTING ME AT RISK WITH FAST MOVING TRAFFIC.    THE ABOVE EXPERIENCE OF GEAR SHIFT OR ACCELARATION ISSUE IS CONSISTENT BEHAVIOR SINCE I OWNED THIS CAR FOR PAST 2 WEEKS",
        "vin": "4T1B11HK4KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/04/2019",
        "dateOfIncident": "08/21/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266036,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAND NEW 2019 CAMRY WITH ISSUES . FRONT CRASH CAMERA WILL SAY THAT IT IS OFF BUT IT IS ON. APPLE CARPLAY RADIO FREEZES, GLITCHES AND SHUTS OFF.",
        "vin": "4T1B11HK9KU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/25/2019",
        "dateOfIncident": "08/08/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257037,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 TOYOTA CAMRY. CONSUMER WRITES IN REGARDS TO UNINTENDED ACCELERATION. *LD    THE CONSUMER STATED WHILE ATTEMPTING TO MAKE A U TURN THE STEERING WHEEL YANKED IN THE OPPOSITE DIRECTING. THE VEHICLE'S SPEED ACCELERATED UNCONTROLLABLY AND BRUSHED A PARKED CAR, HIT A TREE THAT IN TURN FELL ON A HOUSE. THE CAME TO A REST AFTER IT HIT THE TREE. THE AIR BAGS DID NOT DEPLOY. THE FLOOR MAT WAS NOT PRESSING AGAINST THE PEDAL. THE VEHICLE WAS TOTALED. THE MANUFACTURER STATED THE VEHICLE COULD NOT BE INVESTIGATED DUE TO THE VEHICLE BEING SO DESTROYED. *JS *JS",
        "vin": "4T1B11HK2KU"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "09/23/2019",
        "dateOfIncident": "09/11/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257441,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR WAS INVOLVE IN AN AUTO  ACCIDENT AND IT WAS SERVE AND THE FRAME BENT AND PUSH IN BUT THE SEAT BELT DID NOT LOCK AND NO AIRBAG WAS DEPLOYED.  BRAND NEW CAR ONLY 7,000 MILES",
        "vin": "4T1B11HK6KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/21/2019",
        "dateOfIncident": "09/12/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257155,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PLASTIC PART BELOW MY VENT BUT ABOVE THE NAVIGATION SCREEN MELTED. I WAS DRIVING FROM FLORIDA TO SOUTH CAROLINA. BEFORE I LEFT I KNOW IT WASNT THERE BECAUSE I CONNECTED MY PHONE TO THE CAR. THEN I STOPPED IN GEORGIA FOR A BREAK. AS I WAS DRIVING MY PHONE RUNG AND I WENT TO HIT ANSWER ON MY SCREEN I NOTICED IT. IM NOT SURE IF IT HAPPENED AS I WAS DRIVING OR WHEN I STOPPED. SO I CONTACTED THE TOYOTA PLACE IN VIRGINIA WHERE I PURCHASED THE VEHICLE AND WAS TOLD TO TAKE IT TO THE NEAREST TOYOTA PLACE. THE NEXT DAY I TOOK IT MY CAR TO FLORENCE TOYOTA IN FLORENCE SC. THEY TOOK PICTURES AND SENT THEM TO CORPORATE. THE FOLLOWING WEEK I CONTACTED THEM TO SEE WHAT WAS SAID. I WAS TOLD THAT IT LOOKS LIKE AIR FRESHNER GOT ON IT AND CAUSED IT TO MELT AND  ITS NOT COVERED BY MY WARRANTY. SO I REPLIED I DO NOT KEEP AIR FRESHNER IN THAT VENT I KEEP THEM IN MY SIDE VENTS SO THATS NOT POSSIBLE. THEN I CALLE D TOYOTA CORPORATE OFFIC AND I WAS TOLD THEY CAN NOT COVER IT BECAUSE ITS NOT AND MANUFACTURE  ERROR AND IT WOULD CAUSE ME $7000 TO REPLACE. I JUST PURCHASED THIS CAR IN APRIL AND ITS JUST SEPTEMBER NOTHING SHOULD BE MELTING IN THIS CAR AND IF AIR FRESHNERS CAN CAUSE THIS PLASTIC TO MELT ITS NOT A GOOD QUALITY CAR!",
        "vin": "4T1B11HK5KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/18/2019",
        "dateOfIncident": "07/12/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256501,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CHROME SURROUNDING THE TACHOMETER AND SPEEDOMETER, AS WELL AS THE CHROME SURROUNDING THE INSIDE OF THE STEERING WHEEL AND THE CHROME TOYOTA EMBLEM ON THE STEERING WHEEL AND THE CHROME SURROUNDING THE START BUTTON AND THE CHROME AROUND THE SHIFTER ALL CAUSE SUBSTANTIAL GLARE FOR THE DRIVER (AND PASSENGER) WHEN THE SUN IS OUT.  THIS GLARE MAKES IT DIFFICULT TO SEE THE SPEEDOMETER, TACHOMETER, AND MOST OF ALL THE ROAD AND DASH.  THERE IS NO EASY WAY TO BLOCK THIS GLARE AND STILL BE ABLE TO OPERATE THE VEHICLE SAFELY.",
        "vin": "4T1B11HK2KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/10/2019",
        "dateOfIncident": "09/07/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254568,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE CAR NOT EVEN 4 MONTHS IN AND I STARTED HEARING A \"KNOCKING SOUND\"  IN THE ENGINE.  I TOOK VIDEOS OF IT. I NOTICED THE THE KNOCKING SOUND COMES ON WHEN I DRIVE IT FOR A WHILE. I TOOK THE CAR THE DEALERSHIP AND SHOWED THEM THE VIDEO.  THE SERVICE TECH DROVE IT AND SAID HE DIDN'T HEAR ANYTHING. THEY RAN TESTS ON IT AND THEY SAID NOTHING IS WRONG WITH THE CAR.  THE SERVICE REP SAID HE DROVE THE CAR FOR 5 MINS ON THE STREET. BUT I TOLD HIM THE SOUNDS STARTS AFTER I DRIVE THE CAR FOR A WHILE AND IN THE FREEWAY.  THEY SENT ME HOME AND SAID NOTHING IS WRONG. I DROVE THE CAR AGAIN ON THE FREEWAY AND THE SOUND CAME BACK ON.  I ALSO HAVE FELT WHAT OTHER CAMRY USERS ARE SAYING ABOUT THE LACK OF ACCELERATION WHEN DRIVING THE CAR.  IT DOES TAKE TIME TO PICK UP SPEED AND IT CAN BE DANGEROUS WHEN MERGING ONTO FREEWAYS AND LANES.   NEED TO GET THIS FIX OR THEY NEED TO MAKE A RECALL ON THIS MODEL.",
        "vin": "4T1B11HK6KU"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/07/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242253,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING UP A HILL, THE CAMRY WOULD NOT ACCELERATE WITH THE GAS PEDAL FULLY PRESSED. AT THE TOP OF THE HILL, THE CAMRY WITH THE TRANSMISSION IN DRIVE BEGAN ROLLING BACKWARD DOWN THE HILL AT WHAT WAS APPROXIMATELY 25-30 MPH. THE BRAKE WOULD NOT STOP THE MOVEMENT OF THE CAR. EVENTUALLY, THE EMERGENCY BRAKE WAS ALSO PUT IN PLACE. THE CAMRY ROLLED DOWN THE ENTIRE HILL AND STOPPED WHEN THE BACK TIRE HIT THE CURB. THE CAR WAS STILL ON AND IN DRIVE MODE.    WE DID NOT COLLIDE WITH ANY OTHER CARS BECAUSE MOST WERE OFF THE STREET. IT WAS EXTREMELY DANGEROUS. FORTUNATELY, WE COULD HAVE BEEN SEVERELY INJURED OR WORSE.  THIS TOOK PLACE ON A CITY STREET. THE HILL IS VERY WALKABLE. THE FACT THAT THE CAR WOULD NOT ACCELERATE WITH THE GAS PEDAL FULLY DEPRESSED IS ALARMING FOR A NEW CAR WITH LESS THAN 4 MONTHS OF USE. THE BRAKES WOULD NOT STOP THE CAR FROM ROLLING BACKWARD WHILE THE TRANSMISSION WAS IN DRIVE.     ONCE THE CAR STOPPED, IT SHOWED A CAR FAILURE NOTICE. THE CAR WAS TOWED TO TOYOTA AND REMAINS WITH THE DEALERSHIP TODAY. .",
        "vin": "4T1B11HK8KU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/02/2019",
        "dateOfIncident": "07/15/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241254,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION ON THIS CAR DOES NOT SHIFT THE WAY IT SHOULD. WHEN ACCELERATING FROM A STOP THE TRANSMISSION SEEMS TO HAVE TROUBLE DECIDING WHAT GEAR IT SHOULD BE IN AND THE SHIFT POINTS ARE TOO HIGH ESPECIALLY WHEN SHIFTING INTO 3RD OR 4TH GEAR. THERE IS SOME SERIOUS HESITATION THAT SHOULD NOT BE PRESENT. ALSO, WHEN DOWNSHIFTING IT FEELS LIKE SOMEONE TAPPED THE BRAKE PEDAL BECAUSE IT SLOWS DOWN SIGNIFICANTLY. IF A CAR BRAKES IN FRONT OF ME AND I HAVE TO SLOW DOWN AND THEN GET BACK ON THE GAS TO SPEED BACK UP IT TAKES TOO LONG FOR THE CAR TO GET UP TO SPEED TO KEEP UP WITH TRAFFIC. THIS HAS ALL HAPPENED ON SIDE STREETS AS I HAVE NOT TAKEN THE CAR ON THE HIGHWAY YET.",
        "vin": "4T1B11HK5KU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/19/2019",
        "dateOfIncident": "07/19/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233471,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA CAMRY. WHILE DRIVING 5 MPH, THE ACCELERATOR PEDAL WAS DEPRESSED TO THE FLOORBOARD, BUT THE VEHICLE FAILED TO ACCELERATE. THE CONTACT HAD JUST HAD THE VEHICLE SERVICED AT MODESTO TOYOTA (LOCATED AT 4513 MCHENRY AVE, MODESTO, CA 95356, (209) 529-2933) WHERE THE TRANSMISSION WAS REPLACED. THE VEHICLE WAS TAKEN BACK TO THE DEALER, BUT THE FAILURE COULD NOT BE DUPLICATED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 9,617.",
        "vin": "4T1B61HK9KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/12/2019",
        "dateOfIncident": "07/11/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231263,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 TOYOTA CAMRY PARKED IN THE DRIVEWAY OF MY HOUSE, SUNROOF SHATTERED WHEN CAR DOOR CLOSED.  THE PIECES FELL ON THE DRIVEWAY BUT DID NOT FALL INTO THE CAR AS THE SUN SHADE WAS CLOSED.  THERE IS NOW A HOLE IN THE SUNROOF LARGE ENOUGH FOR YOUR HAND TO PASS THROUGH.",
        "vin": "4T1B11HK5KU"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/12/2019",
        "dateOfIncident": "03/15/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231356,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA CAMRY. THE CONTACT RECENTLY PURCHASED THE VEHICLE AND KEPT HEARING AN ABNORMAL NOISE COMING FROM THE FRONT END. THE CONTACT TOOK THE VEHICLE TO BILL KIDD'S TOYOTA (10401 YORK RD, COCKEYSVILLE, MD 21030, (410) 666-8900) WHERE IT WAS DIAGNOSED THAT THERE WAS A ROD STUCK IN ONE OF THE TIRES. THE TIRE WAS REPLACED AT BROWNS TOYOTA (7167 RITCHIE HWY, GLEN BURNIE, MD 21061, (410) 761-9000). THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED A CASE NUMBER. THE FAILURE MILEAGE WAS 6,000. THE VIN WAS INVALID.",
        "vin": "4T1811HK8JU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/09/2019",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230508,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I RENTED A 2019 TOYOTA CAMRY FOR 9 DAYS.  MANY TIMES WHILE ACCELERATING THE ENGINE LOST POWER.  IT WAS ESPECIALLY DANGEROUS WHEN ATTEMPTING TURNS IN FRONT OF ONGOING TRAFFIC.  THE CAR WOULD START TO GO THEN JUST SEEM TO DIE AS I WAS MAKING THE TURN.  THEN ENGINE LIGHTS WOULD COME ON AND IT WOULD JUST START COASTING.  THE CAR NEVER STALLED IT JUST WOULD NOT GO.  I LEARNED VERY QUICKLY TO NOT THINK I COULD MAKE A TURN INTO THE ONCOMING TRAFFIC SAFELY UNLESS I HAD ENOUGH ROOM TO COAST ACROSS THE INTERSECTION.  ALSO IT IWAS VERY DANGEROUS WHEN TRYING TO MERGE INTO TRAFFIC.  I LOOKED THIS UP ON THE INTERNET AND IT SEEMS TO BE A VERY COMMON PROBLEM WITH CAMRY'S BUT I DO NOT UNDERSTAND WHY THERE IS NOT A RECALL OR, AT LEAST, A INVSTIGATION STARTED BY NHTSA.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/08/2019",
        "dateOfIncident": "07/08/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230039,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER WINDOW DOES NOT GO DOWN ALL THE WAY HAVE TO TRY SEVERAL TIMES AND WHEN I PUT IT UP IT SEEMS TO WANT TO JUMP OFF TRACK. PUSHES WINDOW SLIGHT INWARD.  RIGHT REAR PASSENGER WINDOW MAKES STUTTERING MOTION WHEN GOING UP. NOT GOOD",
        "vin": "4T1B11HK3KU"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/08/2019",
        "dateOfIncident": "07/08/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230251,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "LANE ASSIST LIGHT AND FRONTAL CRASH LIGHT BOTH TURN ORANGE/OFF WHEN OUTSIDE TEMPERATURE REACHES OVER 100 DEGREES.",
        "vin": "4T1B11HK1KU"
    },
    {
        "components": "POWER TRAIN,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/05/2019",
        "dateOfIncident": "07/04/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229575,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR IN HIGHWAY SPEED WHEN THE LAST SPEED ENGAGE THE CAR STARTS TO SHAKE FOR FEW SECONDS YOU CAN  FEEL MORE ON HILLS AND WHEN PRESS THE GAS TO PASS A CAR I FEEL LIKE SOMETHING IS NO RIGHT  AND WHEN YOU MAKE A STOP AND PRESS THE GAS TO GO FORWARD SOMETIMES THE TRANSMISSION FEELS LIKE IS NO PAIR WITH THE ENGINE I REALLY FEEL WORRIED FOR MY WIFE IF THIS CAR CAN BE IN NEUTRAL OR NO POWER ON THE HIGHWAY THE CAR DOESN'T FEELS RIGHT,  THIS PROBLEM STARTS TO HAPPEN A WEEK AGO THE CAR ONLY HAVE 6000 MILES",
        "vin": "4T1B11HK1KU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/27/2019",
        "dateOfIncident": "06/22/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222998,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY PURCHASED A 2019 TOYOTA CAMRY IN FEBRUARY. I'VE NOTICED THAT WHILE DRIVING THE VEHICLE, THE ENGINE SEEMS TO HESITATE AND JERK WHEN ACCELERATING. THIS IS A CAUSE FOR CONCERN BECAUSE WHEN SLOWING DOWN AND GIVING THE VEHICLE GAS, IT CAUSES THE RPMS TO SHOOT UP AND THE CAR JERKS FORWARD. THIS CAN CAUSE THE VEHICLE TO STRIKE A VEHICLE OR ANYTHING IN FRONT OF IT. IT IS NOT ANY DIFFERENT IF THE VEHICLE IS STATIONARY OR IN MOTION. IN EITHER SITUATION THE VEHICLE IS HESITATING AND JERKING WHILE ACCELERATING. IT IS ALSO DANGEROUS TO TURN INTO ONCOMING TRAFFIC. IF THE CAR STRUGGLES TO ACCELERATE IT CAN CAUSE A COLLISION.",
        "vin": "4T1B11HK7KU"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/24/2019",
        "dateOfIncident": "05/09/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222287,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST GOT THE CAR ABOUT A MONTH AND A 1/2 AGO EVERYTHING SEEMED FINE UNTIL 2 WEEKS LATER AFTER I PURCHASED THE VEHICLE I NOTICE SOME LAGGING AND HARD JERKING IN THE TRANSMISSION WHEN I BARELY PUSH THE ACCELERATOR I NOTICE FROM 1ST TO 2ND GEAR IT HAD A HARD TIME WANTING TO KNOW WHEN TO SHIFT AND WHEN TO WANNA GO SMOOTH THEN A WEEK AND A 1/2 LATER THE LANE DEPARTURE LIGHT TURNS ON AND THE CRASH CONTROL I TURNED THEM OFF BUT IT STILL TURNED ON EVEN KNOW I WENT INTO THE VEHICLE SETTINGS TO TURN THEM OFF A WEEK FOLLOWING THE LIGHTS STARTED COMING ON MORE PROGRESSIVE EXCEPT THIS TIME IT DEACTIVATES ALL THE CAMERAS FRONT AND BACK I WENT 3 TIMES AND THE MAIN MECHANIC SAID NOT EXAGGERATING *ITS LIKE A PHONE IT NEEDS TO LEARN HOW TO WORK ITSELF OVER TIME IT WILL GET BETTER THE ONLY WAY WE CAN FIX IT IS WHEN YOU BRAKE DOWN AND GET TOWED* ALL KNOW IS, IS THAT THE VEHICLE DOESN'T SEEM TO KNOW WHEN TO WANT TO SHIFT CORRECTLY THERE IS A LAG WHEN PUSHING THE PEDAL, WHEN YIELDING AND GO IT JERKS HARD WHEN SLOWING DOWN I FEEL IT DOWNSHIFTING HARD EITH LITTLE THUDS AND MY SENSOR LIGHTS COME ON AND DEACTIVATE MY CAMERAS",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/15/2019",
        "dateOfIncident": "04/16/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220274,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION IS VERY CLUNKY THRU THE GEARS. I HAVE AN AUTOMATIC, SOMETIMES ITS DELAYED WHEN I'M TRYING TO ACCELERATE, ITLL HESITATE BEFORE TAKING OFF. IV FOUND IF YOU PULSE THE GAS PEDDLE AND LET UP RIGHT AS IT STARTS TO HESITATE THEN BACK DOWN AGAIN ITLL KINDA AVOID IT BUT I'M NOT ALWAYS SUCH AN ACTIVE DRIVER. EVEN DOWN SHIFTING ITLL BE CLUNKY AND TAKE A SEC TO FULLY DO IT. LIKE IF YOU PULL INTO A DRIVEWAY THAT'S SLANTED UP YOU FIRST OF ALL HAVE TO SLOW DOWN TO ENTER AND WHEN DOING THAT IT'S ALL SLOW AT DOWN SHIFTING THEN U GOTTA HIT THE GAS SOME TO GO UP THE DRIVEWAY AND IT'S ALL DELAYED AT ACCELERATING SO THE WHOLE PROCESS IS JUST CLUNKY AND DOES NOT FEEL RIGHT. MAKES ME FEEL THE TRANSMISSION IS GONNA BURN OUT EARLY. THEY SAY THE 2018 MODELS AND UP USE SOME COMPUTERIZED TRANSMISSION...I JUST WANT TO IT RESPOND ACCORDINGLY AND TO NOT BE SO SLUGGISH ABOUT IT. SOMETIMES I'M SCARED TO PULL OUT IN FRONT OF TRAFFIC BECAUSE IT WONT RESPOND RIGHT AWAY AND I'LL BE AT A CRAWLING SPEED TILL IT RESPONDS UNLESS I FLOOR IT FAST AND LET UP BEFORE IT REVS PAST 3 ON THE RPM THEN TAP IT AGAIN. IT'S LIKE IT WAKES IT UP OR SOMETHING I DONT UNDERSTAND.",
        "vin": "4T1B11HK0KU"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/07/2019",
        "dateOfIncident": "06/06/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218465,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED MY 2019 TOYOTA CAMRY XLE COUPLE OF WEEKS BACK WITH 5 MILES ON IT.  NOTICED THE VEHICLE HAD ISSUES WITH ACCELERATION.  WHEN RESUMING TO DRIVE FROM A RED LIGHT OR STOPPED POSITION, THE CAR SEEM TO HAVE A MAJOR DELAY IN ACCELERATION AND MAKES A LOUD ENGINE NOISE WHEN PRESSING THE GAS PEDAL.  EVEN PRESSING DOWN A BIT MORE ON THE GAS PEDAL DURING THIS INITIAL ACCELERATION, THE CAR DOES NOT REACT MUCH AND BARELY PICKS UP SPEED.  THERE IS A MAJOR DELAY, ONE THAT CAN BE DANGEROUS WHEN MERGING ONTO A HIGHWAY WHERE QUICK ACCELERATION IS NEEDED TO AVOID BEING A HAZARD TO OTHER MOTORISTS.  HAVE NOT TAKEN VEHICLE BACK TO TOYOTA SERVICE DEALER BUT DID TEXT MY SALESMAN AND DESCRIBED THE ISSUE AND HE SAID TO SETUP AN APPOINTMENT.  I HAVE A FEELING THE SERVICE DEPARTMENT WILL COME BACK SAYING IT'S NOTHING IS WRONG AND FUNCTIONING NORMALLY.  TO ME THIS IS A MAJOR DESIGN FLAW THAT HAS SAFETY CONCERNS TIED TO IT.  PLEASE HELP IN ANY WAY YOU CAN.  NEED TOYOTA TO DO A RECALL ON THIS VEHICLE IN ORDER TO FIX THIS ISSUE.*DT",
        "vin": "4T1B11HKXKU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/07/2019",
        "dateOfIncident": "06/07/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11218526,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAGS DID NOT DEPLOY. NOT A SINGLE AIR BAG WENT OFF. I COULD'VE DIED.   I WAS GOING 65MPH WHEN I DROPPED SOMETHING AND WENT TO PICK IT UP AND I LOST CONTROL OF THE VEHICLE STRIKING THE GUARD RAIL ON THE LEFT SIDE, THEN THROWN INTO THE RIGHT SIDE OF THE ROADS GUARD RAIL WHERE I STOPPED FINALLY. THE FIRE DEPARTMENT WERE SHOCKED THE AIR BAGS DIDNT GO OFF BECAUSE EVERY SINGLE ONE SHOULD HAVE. I'M HURT FROM THIS INCIDENT AND POSSIBLY COULD'VE BEEN LESS INJURED HAD THE AIR BAGS DEPLOYED",
        "vin": "4TB11HK6KU2"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/05/2019",
        "dateOfIncident": "06/04/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217982,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS AN ISSUE WITH SHIFTING FROM 1ST TO 2ND. WHEN PRESSING GAS PEDAL THE CAR BRIEFLY ACCELERATES AND THEN THE RPM DROPS AND THE CAR ALMOST DECELERATES. WHEN PRESSING THE GAS PEDAL AGAIN THE CAR STARTS TO JERK BACK AND FORTH UNTIL THE GAS PEDAL IS RELEASED. THE PROBLEM IS VERY REPRODUCIBLE AND MY SALES MANAGERS AT TOYOTA SUNNYVALE WERE TRYING TO CONVINCE ME THAT THIS IS NORMAL. THEY EVEN CLAIMED TO HAVE DRIVEN A NUMBER OF OTHER SIMILAR CARS AND TOLD ME THAT ALL OF THEM HAVE THIS \"NORMAL\" BEHAVIOR (WHICH CONFIRMS THAT A LOT OF CARS SHOULD HAVE THIS PROBLEM). THEY ALSO SAID THE CAR IS \"LEARNING\", WHICH IS TOTALLY BOGUS. AFTER APPROACHING THEM WITH SERVICE BULLETIN T-SB-0330-17 WHICH DESCRIBES THE EXACT SAME PROBLEM BUT FOR 2018 MODEL, THEY CLAIMED MY CAR CAN'T HAVE THIS PROBLEM SINCE BULLETIN IS FOR 2018, BUT THE CARS HAVE EXACT SAME TRANSMISSIONS.",
        "vin": "4T1B11HK5KU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/04/2019",
        "dateOfIncident": "01/31/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217700,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES VIBRATE SINCE 10,000 MILES. DEALER WAS ADVISED AT FIRST SERVICE. BRAKES HAVE GOTTEN PROGRESSIVELY WORSE OVER TIME. DRIVING AS NORMAL, NO EXCESSIVE BRAKING HAS BEEN DONE. BRAKES SKIPPING WHEN APPLIED.  DEALER HAS OFFERED NO ASSISTANCE.",
        "vin": "4T1B11HK4KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "05/25/2019",
        "dateOfIncident": "04/09/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11209928,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INVOLVED IN A HIT AND RUN ACCIDENT ON 4/9/19 THAT RESULTED IN $7,600 + PROPERTY DAMAGE TO MY VEHICLE AS WELL AS INJURIES AND NO ONE ANSWERED THE SOS CONNECT SYSTEM AFTER IT WAS CALLED POST ACCIDENT. MY VEHICLE HAS BEEN IN THE BODY SHOP SINCE THE ACCIDENT AND I JUST GOT IT BACK THIS PAST THURSDAY 5/23/19. ON 5/24/19 I TRIED TO TEST THE SOS SYSTEM AT LEAST 5 TIMES AND STILL RECEIVED NO RESPONSE. THE VEHICLE WAS IN MOTION DURING ALL CALLS, PROCEEDING STRAIGHT ON CITY ROADS. I HAVE AUDIO FOOTAGE FROM MY DASH CAM TO SUPPORT IT DID NOT WORK BUT THEY ARE TOO LARGE TO UPLOAD.",
        "vin": "4T1B11HKXKU"
    },
    {
        "components": "AIR BAGS,STRUCTURE,ENGINE",
        "crash": true,
        "dateComplaintFiled": "05/20/2019",
        "dateOfIncident": "05/18/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208742,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 18, 2019 CAR WAS HIT BY ANOTHER CAR WHILE MAKING A TURN AND  LANDED HARD  BY THE FRONT IN A DIRTY PIT AREA NEAR A GAS STATION NONE OF THE AIRBAGS WENT OFF AND THE FENDER LOOKS DAMAGE.",
        "vin": ""
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/10/2019",
        "dateOfIncident": "05/09/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206887,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAND NEW CAMRY 2019 (3,105 MILES, OWNED FOR 2 MONTHS) LOST ALL POWER WHILE DRIVING ON THE HIGHWAY - DRIVER CONSOLE (SPEEDOMETER, SCREEN, ETC) WAS COMPLETELY TURNED OFF - HAD TO PULL OVER IMMEDIATELY.    UPON TURNING THE VEHICLE OFF AND RESTARTING, THE FOLLOWING WAS DISPLAYED; MASTER WARNING LIGHT (YELLOW TRIANGLE WITH EXCLAMATION MARK), POWER STEERING WARNING LIGHT, DRIVER SCREEN IN CONSOLE DISPLAYED MESSAGE READING \"STEERING POWER LOW. VISIT YOUR DEALER\". VEHICLE WAS TURNED BACK OFF.    AFTER A FEW MINUTES, THE VEHICLE WAS RESTARTED - NONE OF THE PREVIOUS WARNINGS WERE DISPLAYED. NO SYMPTOMS OR ISSUES HAVE OCCURRED SINCE.    TOOK VEHICLE TO THE DEALER THE NEXT DAY AND NOTHING WAS FOUND. SUSPICIOUS COMPONENTS / POTENTIAL ISSUES WERE CHECKED AND NOTHING WAS FOUND. WAS TOLD TO RETURN IF IT HAPPENS AGAIN.",
        "vin": "4T1B11HK7KU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/27/2019",
        "dateOfIncident": "02/14/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204162,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERAL TIMES WHILE DRIVING WEST, INTO AN AFTERNOON SUN, I HAVE EXPERIENCED A BLINDING SUN REFLECTION FROM THE BACK SECTION OF THE HOOD.  THE STYLING OF THE HOOD CREATES A BLINDING SUN GLARE.  THE LAST 1 625 INCHES OF THE HOOD IS AT A NEGATIVE PLANE.  THE ARCH OF THE REAR SECTION OF THE HOOD, COMBINED WITH THE NEGATIVE PLANE, INTENSIFIES SUN REFLECTION TO AN UNSAFE LEVEL.  THE REFLECTION OF THE SUN INTO THE DRIVERS EYES HAS A BLINDING EFFECT AND OBLITERATES THE HEADS UP DISPLAY.",
        "vin": "4T1BZ1HK6KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/15/2019",
        "dateOfIncident": "10/15/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196231,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "PUSH TO TALK USUALLY DOES NOT WORK. GPS NOT RECOGNIZING VERIFIED ADDRESSES AND VERY INACCURATE. BLUETOOTH CONNECTION OF PHONE AND TOYOTA SYSTEM DISCONNECTING AND CONNECTING DURING CALLS. HAVE DOCUMENTED EACH PROBLEM WITH PHOTOS AND WITNESSES, BUT SINCE CAN NOT BE DUPLICATED IN SHOP, THEY IGNORE.  TOYOTA DEALER AND NATIONAL CLAIMED A SOFTWARE UPDATE NEEDED, BUT NONE AVAILABLE AND THEY DO NOT SEEM TO CARE ABOUT PROBLEM, NOW JUST A CASE NUMBER TO NATIONAL. DEALER HAS TRIED. THIS APPEARS TO BE A KNOWN PROBLEM WITH TOYOTA. THIS OCCURS STATIONARY AND WHAT IS ALLOWED, WHEN DRIVING.TOYOTA NOT STANDING BY WARRANTY AND WILL NOT REPLACE UNIT!",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/25/2019",
        "dateOfIncident": "03/21/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191485,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DECELERATING AND THEN TRYING TO ACCELERATE VEHICLE STALLS AND DOES NOT ACCELERATE WHEN YOU PUSH VEHICLE ACCELERATION PEDAL. ITS HAPPENS QUITE OFTEN WHEN YOU SLOW AT INTERSECTIONS OR FOR A TURN AND THEN TRY TO ACCELERATE, IT PAUSES AS IF THE ENGINE HAS DIED BUT ENGINE IS RUNNING, JUST NO RESPONSE WHEN YOU PUSH GAS PEDAL FOR ONE OR TWO SECONDS. ONE TIME WHILE TRYING TO PAS A SLOW TRUCK ON A TWO LANE HIGHWAY, PULLED OUT TO PASS AND THEN TRIED TO ACCELERATE, VEHICLE JUST STALL AS IF ENGINE HAD STOPPED AND WAS LEFT IN ON COMING TRAFFIC WITH OUT BEING ABLE TO ACCELERATE FOR A FEW SECONDS, VERY SCARY.  IT SEEMS TO HAPPEN MORE OFTEN AT LOWER SPEEDS WHEN DECELERATING AND THEN TRYING TO ACCURATE.  VEHICLE BEHIND ME ALMOST IMPACTED REAR OF MY VEHICLE WHEN I TRIED TO ACCELERATE TO KEEP UP WITH TRAFFIC BUT VEHICLE STALLED. BUT IT HAS HAPPENED ON THE FREEWAY AS WELL. I HAVE HAD IT HAPPENED TO ME AT  LEAST TEN OR MORE TIMES WHEN I HAVE DRIVEN MY WIFE'S VEHICLE.",
        "vin": "4T1B61HK9KU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/11/2019",
        "dateOfIncident": "03/11/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185878,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "REACCELARATION SHOCK, TRANSMISSION LAG, ESPECIALLY UPON RE-ACCELERATION FROM COASTING OR WHEN TRYING TO OVERTAKE SOMEONE ON THE HIGHWAY, DANGEROUS. LUGGING AND SHIFT SHOCK ON DOWNSHIFTING AND UPSHIFTING, FEELS LIKE YOU GET REAR ENDED SOMETIMES.  WHEN ON A COMPLETE STOP AND STEP ON THE GAS PEDAL THE CAR FEELS LIKE IT'S STUCK IN NEUTRAL AND THEN IT JERKS INTO GEAR.",
        "vin": "4T1B11HK3KU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/05/2019",
        "dateOfIncident": "02/16/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184434,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SEEM VERY UNRESPONSIVE WHEN PRESSING ACCELERATOR.  REVS UP TO 2500 BEFORE TRANSMISSION ENGAGES.  ALMOST WAS HIT WHEN MAKING A LEFT TURN.",
        "vin": "4T1B61HK7KU"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/19/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170998,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR MANUFACTURER LIKE TOYOTA HAS AUTOMATIC HIGH BEAM INSTALLED IN ALL OF THEIR VEHICLES SINCE 2017. IT CAUSES EXTREME DISCOMFORT FOR OTHER CAR DRIVERS ON THE HIGHWAY,ESPECIALLY THOSE DRIVING IN SAME DIRECTION. THE HIGH BEAM FROM THE CAR BEHIND REFLECTS ON THE DRIVER IN THE CAR WITH IN FRONT VIA THE SIDE MIRROR. THE PROBLEM IS EXACERBATED DUE TO WHITE LIGHTS ON THESE CARS.  THE GLARE FROM THE CAR BEHIND IS SO MUCH, THAT EVENTUALLY I HAVE TO LOWER MY SIDE VIEW MIRROR SUCH THAT I CANNOT EVEN SEE THE CARS BEHIND. THIS IS BECOMING INCREASINGLY FREQUENT ISSUE ON THE HIGHWAYS AND INTERSTATE.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/20/2018",
        "dateOfIncident": "10/27/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162642,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA CAMRY. THE CONTACT STATED THAT THE ENGINE MADE A LOUD CLICKING NOISE. WHILE DRIVING AT AN UNKNOWN SPEED, THE VEHICLE VIBRATED AND SHOOK. THE VEHICLE WAS TAKEN TO SWOPE TOYOTA (1085 NORTH DIXIE HIGHWAY, ELIZABETHTOWN, KY 42701, 270-737-2181) WHERE IT WAS DIAGNOSED THAT THE VEHICLE MAY NOT HAVE THE CORRECT MOTOR. THE VEHICLE WAS ALSO TAKEN TO OXMOOR TOYOTA (8003 SHELBYVILLE ROAD, LOUISVILLE, KY, (502) 565-0086). THE DEALER TEST DROVE THE VEHICLE AND WAS UNABLE TO DUPLICATE THE ENGINE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED  THE FAILURE MILEAGE WAS 1,500.",
        "vin": "4T1B11HK2KU"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/09/2018",
        "dateOfIncident": "12/03/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11157121,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE EXHAUST LEAK.ENGINE KNOCKING LOUD .IDLE AIR CONTROLLER NOT WORK STRUCK OPEN.RPM HIGH AND LOW AT STOP SIGNAL",
        "vin": "4T1B11HK8KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/13/2018",
        "dateOfIncident": "11/12/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151359,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN CAR IS RUNNING ON CITY STREET AND I LET GO THE GAS PEDAL, AND THEM I TRY TO PRESS THE GAS WHILE IS RUNNING THERE IS A BANG IN THE TRANSMISSION LIKE THE GEAR ARE NOT CHANGING SMOOTH.  ANOTHER PROBLEM IS WHEN CAR IS RUNNING AND I PRESS THE GAS PEDAL THE CAR DOES NOT ACCELERATE, IT TAKE LIKE 2 SECOND FOR THE CAR TO ACCELERATE  BUT THE CAR IT FEEL LIKE THE TRANSMISSION IS GOING BAD. TOOK IT TO THE DEALER 2 TIME AND THEY SAY EVERYTHING IS FINE. I HAVE THE CAR FOR ABOUT  8 MONTHS AND IT HAPPENING  LIKE TWICE A MONTH.",
        "vin": "4T1B11HK5JU"
    }
]