[
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/31/2021",
        "dateOfIncident": "07/30/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427262,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "SEE ATTACHED PDF FILE",
        "vin": "4T1BZ1FBXKU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/18/2021",
        "dateOfIncident": "06/17/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421426,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "There is a bad smell coming from the air ducting especially when the AC is set to recycle the cabin air.  The smell is so nauseating that you have to roll the windows down while driving down the road or parked.  The Toyota dealership charged me $155 +/- to clean the ducting on a less than 2-year-old car with approximately 35,000 mi on it.  I'm not sure how long their cleaning service will keep the smell removed.  I've owned multiple vehicles in my lifetime and never encountered this problem. This should not be happening on a new vehicle.",
        "vin": "4T1B21FB7KU"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "05/17/2021",
        "dateOfIncident": "05/10/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417486,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "This incident has happened twice in three years.  Hence it is a very rare occurrence.  Both times involved the same events.  Cruise control was on.  I was traveling in the left lane of the interstate highway, approaching an 18-wheel truck which was in the right lane.  When I was approximately 50 feet from the rear of the truck, the truck began to enter my lane.  I suspect I was in the trucker's blind spot.  My car did not sense the truck.  The cruise control did not disengage.  The brakes did not engage.  But the MOST troublesome was that the car did not respond to my pressing on the brake pedal.  I had to press 4 or 5 times before the cruise control would disengage and the brakes engage.  Since I was traveling approximately 70 mph, the distance between my car and the truck (each time) closed rapidly.  In the first instance, the truck tire hit my right front fender.  I moved to the shoulder of the road and eventually the car braked.  In the second case, I avoided collision by about 10 feet.  I use the cruise control frequently and in EVERY other circumstance, the sensors on my car have worked correctly and disengaged the cruise control and I have never had a problem with breaking.  I suspect a blind spot in the sensor system but why, only in this situation, does the brake system fail to disengage the cruise control when i press on the brake is a very troublesome mystery to me.  Answering question on web page:  My safety - life threatening, No dealer consultation, Regular maintenance schedule maintained, No warnings.",
        "vin": "4T1B21FB9KU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/10/2021",
        "dateOfIncident": "03/10/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400221,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "LOW-PRESSURE FUEL PUMP",
        "vin": "4T1BZ1FB9KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/13/2021",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387823,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE IS EQUIPPED WITH A LOW PRESSURE FUEL PUMP WHICH MAY STOP OPERATING IF THIS WAS TO HAPPEN THE VEHICLE WILL STALL AND NOT BE ABLE TO RESTART AND IF IT HAPPENS WHILE DRIVING ON THE INTERSTATE WHICH I DRIVE 45 MINS ONE WAY TO WORK DAILY THEN THE CAR WILL LOCK UP AND I WONT BE ABLE TO MOVE IT AND COULD CAUSE ACCIDENTS TO WHERE THE VEHICLE COULD EXPLODE AND TOYOTA HAS NO IDEA HOW TO FIX IT AND ITS BEEN SITTING SINCE OCT 2020. I HAVE CONTACTED THEIR CORPORATE OFFICE AND THE DEALERSHIP IN WHICH NEITHER ARE WILLING TO WORK WITH ME IN REGARDS TO PAYMENTS BEING EXEMPT TILL THEY KNOW HOW TO FIX MY CAR. THEY SAID ITS EITHER I WAIT IT OUT TILL THEY KNOW OR TRADE IT IN FOR AN EQUAL TRADE. MY ISSUE HERE IS THE CAR HAS LOST EQUITY IN IT SO THE NEW LOAN WOULD PROBABLY BE UPSIDE DOWN ON THE LTV WHICH IS COSTING ME, THEY PULL MY CREDIT WHICH WOULD MAKE IT GO DOWN, DONT GET ME WRONG ITS LOAN WORTHY BUT WHY SHOULD I HAVE TO GO THRU ALL THIS RED TAPE WHEN THEY ARE THE ONES WHO CAUSED THE ISSUE BY SELLING A LEMON TO CUSTOMERS.  WHY DO I HAVE TO CONTINUE TO MAKE PAYMENTS ON A CAR THAT I HAVE ONLY OWNED SINCE MAY 2020 AND HAS BEEN SITTING SINCE OCT THAT I CAN ONLY LOOK AT ...I MEAN HOW LONG DOES ONE HAVE TO PAYOUT WITHOUT GETTING ANYTHING IN RETURN? THIS CANNOT BE LEGAL FOR THEM TO CONTINUE TO CHARGE PEOPLE FOR PRODUCTS THEY CANT USE??? I LOVE THIS AVALON AND IT IS TOP OF THE LINE WITH THE EXTRAS SO I AM COMPLETELY HAPPY WITH IT BUT TOYOTA IS NOT BEING FAIR.  THEY HAVE GIVEN ME THE RENTAL CAR SO I DONT LOOSE MY JOB BUT THAT IS SOMETHING THEY SHOULD DO FOR GOD SAKES. AND THAT DOESNT HAVE ANYTHING TO DO AT ALL WITH THE PAYMENTS I HAVE TO PAY ON A CAR I CAN ONLY LOOK AT FOR THE LAST 4 MONTHS...PLEASE HELP ME   THANK YOU IN ADVANCE.",
        "vin": "4T1BZ1FB4KU"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/22/2020",
        "dateOfIncident": "01/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384521,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA AVALON. THE CONTACT STATED THAT THE DYNAMIC CRUISE CONTROL HAD BECOME INOPERABLE. THE CONTACT STATED THAT WHILE DRIVING AT 60 MPH, THE DYNAMIC CRUISE CONTROL MALFUNCTIONED AND THE AUTOMATIC EMERGENCY BRAKING ACTIVATED AND THE VEHICLE CAME TO AN ABRUPT STOP. THE CONTACT STATED THAT THE FAILURE WAS WORSE WHILE DRIVING IN INCLEMENT WEATHER. THE VEHICLE WAS TAKEN TO SCOTT CLARK TOYOTA (13052 MARIE GARRIS RD, MATTHEWS, NC 28105) TO BE TEST DRIVEN. WHILE BEING TEST DRIVEN ALONG WITH THE TECHNICIAN, THE FAILURE RECURRED. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 12,000.",
        "vin": "4T1BZ1FB1KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/17/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375061,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER SEEING A NEWS REPORT ABOUT A FUEL PUMP RECALL IN TOYOTA AVALONS, I CHECKED MY VIN ON THE NHTSA WEBSITE AND, INDEED, MY VEHICLE IS INCLUDED IN THE RECALL.  I IMMEDIATELY CONTACTED MY SALESPERSON AT THE TOYOTA DEALERSHIP AND ASKED HIM TO CHECK ON THE RECALL RESOLUTION.  HE RESPONDED THAT THERE WAS NO REMEDY AVAILABLE YET. SINCE THE RECALL OCCURRED IN JANUARY 2020, IT IS UNACCEPTABLE THAT THERE IS NO REMEDY YET.  I HAVE NEVER RECEIVED ANY DOCUMENTATION OR CORRESPONDENCE FROM TOYOTA REGARDING THIS RECALL.  I AM A SENIOR CITIZEN WITH IMPAIRED HEALTH WHO LIVES ALONE.  IT IS CRITICAL THAT I HAVE A SAFE VEHICLE TO DRIVE TO MY FREQUENT MEDICAL APPOINTMENTS.  THAT IS WHY I PURCHASED THIS VEHICLE IN THE FIRST PLACE.  I DO HAVE TO DRIVE ON HIGHWAYS IN ORDER TO GET TO THESE APPOINTMENTS AND THIS RECALL MAKES ME VERY ANXIOUS!",
        "vin": "4T1BZ1FB1KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "10/29/2020",
        "dateOfIncident": "09/07/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11367055,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA AVALON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED WHILE TURNING INTO HER NEIGHBORS DRIVEWAY, WHEN THE VEHICLE BEGAN TO STALL AND THEN ACCELERATED FORWARD. THE CONTACT LOST CONTROL OF THE VEHICLE AND CRASHED INTO THE NEIGHBORS METAL FENCE. THE CONTACT STATED AN UNKNOWN RED SIGN WARNING LIGHT WAS ILLUMINATED. THE AIR BAGS FAILED TO DEPLOY. A POLICE REPORT WAS NOT FILED. THE CONTACT DID NOT SUSTAIN ANY INJURIES OR SEEK MEDICAL ATTENTION. THE VEHICLE WAS TOWED TO REPAIR FACILITY AND HAD COSMETIC REPAIRS. THE VEHICLE WAS REPAIRED. THE MANUFACTURER HAD BEEN INFORMED OF FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 6,240.",
        "vin": "4T1BZ1FB2KU"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/07/2020",
        "dateOfIncident": "05/06/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363252,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA AVALON. THE CONTACT STATED THAT THE FRONT AND REAR WINDSHIELDS WERE CLOUDY. THE CONTACT ATTEMPTED TO CLEAN THE WINDSHIELDS HOWEVER, THE FAILURE RECURRED. THE VEHICLE WAS TAKEN TO HOSELTON CHEVROLET (909 FAIRPORT RD, EAST ROCHESTER, NY 14445) WHERE IT WAS INSPECTED HOWEVER, THE MECHANIC WAS UNABLE TO DUPLICATE THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 10,000.",
        "vin": "4T1BZ1FBXKU"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/13/2020",
        "dateOfIncident": "08/31/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338968,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN STARTING THE CAR AND PROCEEDING TO ACCELERATE THE CAR STALLS. THERE HAVE BEEN SEVERAL INCIDENTS WHERE THE CAR HAS DONE THIS (EACH TIME BEING TAKEN TO SERVICE AT TOYOTA). ONE IN PARTICULAR ALMOST BEING HIT BY A TRUCK WHEN GOING FROM A RED LIGHT TO GREEN LIGHT.ANOTHER ONE TURNING OUT OF A PARKING LOT AND HAVING TO MAKE SURE THERE WAS ABSOLUTELY NO CARS COMING MY DIRECTION IN FEAR OF BEING HIT WHILE TURNING AND CAR STALLING. THESE ISSUES HAVE BEEN TOO MANY SINCE I HAVE PURCHASED THE CAR. THIS MATTER HAS BEEN TAKEN UP TO CUSTOMER RELATIONS AND REVIEWING HOW MANY TIMES I HAVE TAKEN THIS VEHICLE IN THEY CONTINUE TO TELL ME THAT THEY HAVE NOT FAILED TO REPAIR MY CAR. I HAVE CONTINUED TO TAKE THE CAR TO BE SERVICED AND DIAGNOSTIC COMES UP WITH NO PROBLEMS IN THE COMPUTER SYSTEM. *I ALSO HAVE VIDEOS AND ALL OF MY SERVICE INVOICES REGARDING THE STALLING ISSUE THAT HAS YET TO BE CORRECTED.*",
        "vin": "4T1B21FB5KU"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/06/2020",
        "dateOfIncident": "02/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337033,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 TOYOTA AVALON. CONSUMER WRITES IN REGARDS TO FUEL PUMP SAFETY RECALL. *LD    THE CONSUMER STATED THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME COMPLETING THE RECALL REPAIR. *JS *JS",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/01/2020",
        "dateOfIncident": "06/26/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331907,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLES BLIND SPOT MONITOR ON THE PASSENGER SIDE IS NOT OPERATIONAL AND DOES NOT SHOW VEHICLES IN THE BLIND SPOT ON THE MIRROR OVER 70% OF THE TIME GIVING THE DRIVER A FALSE SENSE THE LANE IS CLEAR.   IT APPEARS THE SYSTEM GETS WORSE THE LONGER YOU DRIVE AND ALMOST NO USABLE WHEN DRIVING OVER 40 MILES.  THE DRIVER SIDE BLIND SPOT MONITOR SYSTEM WORKS AS IT SHOULD.  UPON SOME RESEARCH ON LINE, IT APPEARS THIS IS A COMMON ISSUE AND TOYOTA INDICATES IT WORKS TO SPECS, BUT BASED OFF THE FACTORY MANUAL DOES NOT.",
        "vin": "4T1BZAFB3KU"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/01/2020",
        "dateOfIncident": "04/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331972,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA AVALON. THE CONTACT STATED THAT WHILE DRIVING 35-40 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS RESTARTED. ADDITIONALLY, WHILE THE VEHICLE WAS IDLING, THE VEHICLE HESITATED WITH THE CHECK ENGINE WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO TOYOTA OF TRI-CITIES (6321 W CANAL DR, KENNEWICK, WA 99336, (509) 736-9900) BUT WAS NOT DIAGNOSED NOR REPAIRED. THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 40,000. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "4T1BZ1FB7KU"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/29/2020",
        "dateOfIncident": "06/26/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331481,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SIDE WALL BLEW OUT WHILE DRIVING ON I93.  *TR",
        "vin": "4T1B21FB1KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/21/2020",
        "dateOfIncident": "07/15/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329983,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE NOT HEART ABOUT MY RECALL WHICH IS ONGOING AND IS DANGEROUS, I WANT IT REPAIRED AS SOON AS POSSIBLE AS IT CONCERNING, AS PER TOYOTA, A MALFUNCTIONED FUEL PUMP, PLEASE HELP",
        "vin": "4T1BZ1FB2KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/17/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324901,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "NO UPDATE REGARDING THE NHTSA RECALL ID #20V012 REMEDY.",
        "vin": "4T1BZ1FB9KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/08/2020",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323813,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL PUMP FAILED, MY 2019 TOYOTA AVALON STALLED IN TRAFFIC PUTTING EVERYONE IN HARMS WAY. AND THERE WAS  NO WAY TO GET TO SAFETY, MANY WERE AT RISK, WHY? THE CAR WAS IN MOTION AND STOPPED! IT WAS A TURN AFFECTING DRIVERS BEHIND ME, IN FRONT OF ME, INVOLVING TRAFFIC ON TWO STREETS OF AN INTERSECTION.  *TR",
        "vin": "4T1BZ1FB6KU"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/08/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323841,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA AVALON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE LOCAL DEALER AND MANUFACTURER WERE NOT CONTACTED. THE CONTACT HAD NOT EXPERIENCE A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "4T1BZ1FB1KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/21/2020",
        "dateOfIncident": "02/04/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321787,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE ROAD THE VEHICLE WILL STALL AS IF IT'S NOT GETTING ANY FUEL.  WHEN THE VEHICLE IS PARKED AND TURNED OFF I CAN HEAR THE FUEL PUMP RUNNING.",
        "vin": "4T1BZ1FB5KU"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/16/2020",
        "dateOfIncident": "04/20/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321306,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT LEASED A 2019 TOYOTA AVALON.  THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE).  THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE WAS RUNNING ROUGH. THERE WERE NO WARNING LIGHTS ILLUMINATED. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE LOCAL DEALER AND MANUFACTURER WERE NOT CONTACTED. THE FAILURE MILEAGE WAS 10,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "4T1BZ1FB1KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/01/2020",
        "dateOfIncident": "03/17/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319947,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTHING HAS HAPPENED YET, BUT I HAVE A NEW CAR, 4800 MILES ON IT, 3/17/20  I REC'D A RECALL NOTICE BECAUSE ITS FUEL INJECTION SYSTEM, TOYOTA SAYS, MAY SUDDENLY STOP WORKING WHILE I AM DRIVING AND I WON'T BE ABLE TO RESTART THE CAR ASSUMING I HAVEN'T BEEN KILLED. I DO NOT WANT A CAR WITH THIS PROBLEM AND TOYOTA SAYS THEY HAVE NO FIX CURRENTLY! I HAVE WRITTEN TO THEIR CHIEF LEGAL COUNSEL FOR A REPLACEMENT OF MY FAULTY AUTO WITH A NEW VEHICLE (NOT THE SAME MODEL WITH THE PROBLEM) OF A MODEL OF COMPARABLE VALUE. I DON'T THINK I SHOULD RISK MY LIFE WHILE TOYOTA LOOKS FOR A FIX FOR A LIFE-THREATENING FLAW. REGISTERED LETTER SENT TO TOYOTA CHIEF LEGAL COUNSEL 3/31/20. I HAVE NO SAFE VEHICLE TO DRIVE, BUT I DO NOT WANT TO DRIVE A CAMRY OR COROLLA LOANER WHEN I AM COVERED BY A WARRANTY FOR THE 2019 AVALON I PAID CASH FOR IN FULL!",
        "vin": "4T1BZ1FB4KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/08/2020",
        "dateOfIncident": "03/05/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316848,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I PUMP 91 GASOLINE AT QUICK TRIP IT WANT TAKE BUT 4 DOLLARS AND CLICK OFF! THEN WHEN I TAKE THE PUMP OUT IT SPITS ALL THE GAS OUT THAT WAS PUT IN! THEN I PROCEED TO CUM N GO IT FILLS CORRECTLY! IT WAS THE 3RD TIME I WAS ON HIGHWAY SEEN A QUICK TRIP AND GAS WOULD NOT TAKE! LAST TRY WAS QUICK TRIP PUMP 7 ABOUT 6:20 MUSKOGEE OKLAHOMA THURSDAY 3/5/2020! JUST WONDERING IF IT WAS CAR OR GAS STATIONS PROBLEM!",
        "vin": "4T1B21FBXKU"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/07/2020",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316681,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CHANGING INTERSECTION IN THE CITY STREETS ENGINE STALLS LIKE ITS NOT GETTING ENOUGH FUEL.",
        "vin": "4T1BZ1FB0KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/07/2020",
        "dateOfIncident": "03/10/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316755,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR MOSTLY PARKED IN THE GARAGE. LATELY, IT'S GETTING WORSE AND NOTICING ENGINE RUNNING ROUGH, STALL AT SPEED ABOUT 20 MPH AND HUMMING FROM UNDER REAR OF THE CAR HOURS AFTER IT'S SHUT OFF.",
        "vin": "4T1BZ1FB0KU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/24/2020",
        "dateOfIncident": "02/23/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11311011,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN A MAJOR ACCIDENT.  I WAS DRIVING ALONG A LOCAL ROAD, PROBABLY ABOUT 30MPH.  I WAS STRUCK BY ANOTHER CAR ON THE DRIVER'S SIDE OF MY CAR, AND THEN SPUN INTO A MEDIAN AND STRUCK A TREE.  MUCH OF THE CAR WAS DESTROYED.  THE WINDSHIELD WAS BROKEN AND DISPLACED FROM THE FRAME ON THE DRIVER'S SIDE.  NO AIR BAGS WENT OFF.  I WAS RESTRAINED BY THE SEAT BELT ONLY.   THE FAILURE OF THE AIRBAGS IS OF GREAT CONCERN.",
        "vin": "4T1BZ1FB3KU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/21/2020",
        "dateOfIncident": "07/29/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310505,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERY TIME CAR IS FILLED UP, THERE IS A STRONG ODOR OF GASOLINE AS IT SITS IN MY GARAGE.  AFTER DRIVING IT A BIT, THE ODOR GOES AWAY UNTIL I FILL IT AGAIN.  I DON'T TOP IT OFF, YET THIS HAPPENS EVERY SINGLE TIME.",
        "vin": "4T1B21FB5KU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/15/2020",
        "dateOfIncident": "01/16/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309436,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THIS CAR ABOUT 5 MONTHS AGO AND EVERYTHING WAS FINE UNTIL A MONTH AGO. EVERY TIME I'M DRIVING LESS THAN 35 MPH I FEEL A ROUGH DOWN SHIFT IS NOT THAT BAD, BUT I NOTICE IT. IT ONLY HAPPENS WHEN I'M DRIVING SLOW, MORE SPECIFICALLY IN THE CITY.TOYOTA HASN'T SENT ANYTHING REGARDING THIS PROBLEM. I THOUGHT IT WOULD GO AWAY BUT IT HASN'T.",
        "vin": "4T1BZ1FB8KU"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/09/2020",
        "dateOfIncident": "02/04/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307980,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS, WHEN ON LOW BEAM, IN NON AMBIENT LIGHT CONDITIONS (TOTAL DARKNESS) DO NOT PROJECT FAR ENOUGH TO DETECT PERSONS WALKING ON THE SIDE OF THE ROAD OR CARS PARKED ON THE SIDE OF THE ROAD, ESPECIALLY IF THE ROAD IS UNDULATING (DIPS, CURVES, HILLS). HEADLIGHT PROJECTION CAN BE REDUCED TO 1 1/2 CAR LENGTHS ON DIPS ON DARK NIGHT.  THE LOW BEAM CUTOFF LINE CAN BE AN ISSUE AS THERE IS NO VISION THRU THE UPPER HALF OF THE WINDOW IN SUCH CONDITIONS.",
        "vin": "4T1BZ1FBXKU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/24/2020",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301532,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS HAS HAPPENED SINCE I BOUGHT THE CAR NEW.  AFTER FILLING THE VEHICLE, A VERY STRONG GAS ODOR EMITS FROM THAT GAS TANK NEAR THE GAS CAP.  AFTER PARKING IN THE GARAGE OVERNIGHT, THE ENTIRE GARAGE HAS A VERY STRONG ODOR AND IT EVEN LEAKS INTO THE HOUSE.  DEALERSHIP HAS INSPECTED AND SAYS NOTHING IS WRONG, BUT IT IS DANGEROUS AS THERE HAS TO BE A LEAK OR SEAL ISSUE.",
        "vin": "4T1B21FB5KU"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/10/2019",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288116,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA AVALON. WHILE DRIVING IN LOW LIGHT CONDITIONS OR AT DUSK, THE HEADLAMPS FAILED TO PROVIDE SUFFICIENT ILLUMINATION. THE CONTACT STATED THAT THE VEHICLE WAS UNSAFE TO OPERATE. THE VEHICLE WAS TAKEN TO JOSEPH AIRPORT TOYOTA (1180 W NATIONAL RD, VANDALIA, OH 45377, (937) 898-8060) TO BE INSPECTED. THE HEADLAMPS WERE ADJUSTED, BUT THE FAILURE CONTINUED. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 4,500.",
        "vin": "4T1BZ1FB7KU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/25/2019",
        "dateOfIncident": "11/24/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282119,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THESE ISSUES OCCUR CONSISTENTLY WHILE DRIVING ON A LOCAL SIDE STREETS AT LOW SPEEDS, BETWEEN 0-35 MPH.  (1) WHEN EXECUTING A STOP AND GO EITHER AT A STOP LIGHT OR A STOP SIGN, MY 2019 AVALON XLE EMITS A \"JERKING\" MOTION BEFORE IT DECIDES TO KICK INTO GEAR.  THE \"JERKING\" CAN EASILY BE FELT INSIDE THE VEHICLE.  THERE ARE MULTIPLE DRIVERS EXPERIENCING THIS \"JERKING\".  I THOUGHT THE \"JERKING\" WAS OCCURRING WHILE THE VEHICLE WAS WARNING UP, BUT \"JERKING\" OCCURS AT ALL TIMES.  (2) WHEN TRAVELLING AT 30-35 MPH, AND AFTER RELEASING PRESSURE OFF THE ACCELERATOR, THE VEHICLE FEELS LIKE IF THE BRAKES ARE SLOWLY BEING APPLIED INSTEAD OF COASTING DOWN THE STREET.  I BELIEVE THE TRANSMISSION IS DOWNSHIFTING IN SUCH A WAY THAT IT FEELS LIKE THE BRAKES ARE BEING APPLIED.  THE ABOVE ISSUES HAVE BEEN OCCURRING SINCE PURCHASING THE VEHICLE WITH LESS THAN 10 MILES ON THE ODOMETER.  I WAS TOLD TO WAIT FOR A TOYOTA SERVICE BULLETIN TO BE PUBLISHED, BUT I DID NOT RECEIVE ANY GUARANTEE THAT SUCH A BULLETIN WOULD EVER BE PUBLISHED.  I HAVE FILED SEVERAL CASES AT TOYOTA HEADQUARTERS AND WAS TOLD MY CASE WOULD BE REVIEWED BY THE TRANSMISSION ENGINEERING DEPARTMENT.  AGAIN, NO GUARANTEE THAT THE TRANSMISSION ENGINEERING DEPARTMENT WOULD EVER REVIEW MY CASE. AND I HAVE NOT RECEIVED ANY RESPONSES OR FOLLOW UPS EMAILS FROM TOYOTA HEADQUARTERS RE: MY 2019 AVALON TRANSMISSION ISSUES.",
        "vin": "4T1BZ1FB4KU"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/14/2019",
        "dateOfIncident": "10/31/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279958,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 3600 MILES, WHILE DRIVING ON A CITY STREET, CAN  CHECK ENGINE LIGHT CAME ON PLUS ALL THE OTHER WARNING LIGHTS AND MALFUNCTION MESSAGES ABOUT EVERY SENSOR IN THE CAR, CAR LOST POWER AND ACCELERATION, ENGINE STARTS SOMETIMES ONLY. DEALER DIAGNOSIS WAS A FULL TANK OF E85 GAS, GAS STATION DOES NOT SELL THAT AND NO ANY OTHER COMPLAINT OF E85. DID MY OWN TESTING, DOESN'T SEEM LIKE ANY ETHANOL IN GAS. I SAVED ALL THE GAS FOR FURTHER TESTING. I COMPLAINED TO TOYOTA CORP BUT THEY STOOD BY AND SUPPORTED THE DEALER DIAGNOSIS. GAS STATION INSURANCE CARRIER DENIED THE CLAIM.  EVEN IF IT WAS E85 GAS, THIS SHOULDN'T HAVE ALL THIS IMPACT ON THIS AVALON AND ITS COMPUTER SYSTEM.",
        "vin": "4T1BZ1FB4KU"
    },
    {
        "components": "SUSPENSION,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/04/2019",
        "dateOfIncident": "10/31/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278189,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "*** SUSPENSION & OE TIRE BRIDGESTON EL440   - ROLLING WHILE CORNERING ON UNEVEN/BUMPY ROAD  - NOT SURE BUT I FEEL TIRE STANDING WAVE SOMETIMES  - I REPLACED IT WITH MICHELIN PREMIER A/S AND GOT BETTER GRIP AND 50%-LESS-ROLLING EFFECT.    *** BLIND SPOT MONITOR(BSM) IS UNRELIABLE  - NOT PROPERLY WORKS SOMETIMES  - IT CANNOT DETECT A CAR PASSING BY AT HIGH SPEED.  - IT CANNOT DETECT A CAR AT A TINY BIT OVER PERMISSIBLE ANGLE, ESPECIALLY MERGING ROAD. (I FEEL THAT BSM ANGLE IS TOO NARROW OR SHORT AND IT WORKS ONLY WHEN THE OBJECT IS EXACT PARALLEL TO MY CAR.)  - I WOULD LIKE THIS BSM TO BE ALWAYS ON AT ANY TIME AND CONDITION.",
        "vin": "4T1BZ1FB7KU"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/23/2019",
        "dateOfIncident": "09/21/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270499,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING OUR NEW 2019 TOYOTA AVALON DOWN THE FREEWAY IT WANDERS AND MOVES AROUND . THE CAR SEEMS TO CHASE THE SMALL LINES THAT ARE GROUND INTO CONCRETE FREEWAY. I TOOK .THE CAR BACK TO THE TOYOTA DEALERSHIP AND THE CHECKED THE 4 WHEEL ALIGNMENT, WHICH WAS WITHIN PERFECT SPECS. THE CAR STILL CONTINUES TO DRIFT AND WANDER TO THE POINT THAT IT SEEMS UNSAFE. I CONTACTED TOYOTA CORPORATE WARRANTY. THEY OPENED A CASE # 1909232297. THEY TOLD ME A TOYOTA FIELD ENGINEER WOULD COME OUT AND DRIVE THE CAR TO ASSESS THE PROBLEM. I RECEIVED A CALL TODAY FROM TOYOTA CORPORATE INFORMING ME THAT THEY WHERE NOT SEND ANYONE OUT. WE SHOULD SIMPLY DEAL WITH THE PROBLEM ON OUR OWN",
        "vin": "4T1BZ1FB7KU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/23/2019",
        "dateOfIncident": "08/19/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246041,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE OIL CONSUMPTION - NEW VEHICLE  NEWLY PURCHASED 2019 TOYOTA AVALON XLE (6 CYL) HAS EXCESSIVE OIL CONSUMPTION. REQUIRED ADDITION OF 2 QUARTS OF OIL AT 2,000 MILES.  NO LEAKS EVIDENT UNDER CAR.  AT 3,100 \"LOW OIL\" LIGHT CAME ON, BUT COULD NOT CHECK BECAUSE DEALER TAPED DIPSTICK TO PREVENT ME FROM CHECKING. DEALER TEARING APART ENGINE.",
        "vin": "4T1BZ1FB0KU"
    },
    {
        "components": "STRUCTURE,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "08/05/2019",
        "dateOfIncident": "07/15/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11241658,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HUSBAND, AN 84 YEAR OLD, WAS DRIVING THE CAR AND GOT INTO A DOUBLE ACCIDENT.  FIRST, HE WAS PARKED IN A PARKING LOT AND HE GOT IN THE CAR AND BACKED UP.  AS HE BACKED UP HE HIT A VEHICLE PARKED BEHIND HIM CAUSING THAT VEHICLE TO HIT TWO OTHER VEHICLES.  (PLEASE NOTE:  WE ARE STILL WAITING FOR FULL POLICE REPORT FOR INFORMATION AS TO EXACTLY HOW FAR HE WOULD HAVE BACKED, BUT I BELIEVE NOT MUCH MORE THAN 1 TO 2 CAR LENGTHS.)  THIS CAR HAD THE TOYOTA CARE PACKAGE INSTALLED, WHICH INCLUDED THE SAFE BACKING FEATURES TO SLOW A VEHICLE WHEN BACKING AND ANOTHER OBJECT IS BLOCKING THE PATH.  MY QUESTION - WHAT HAPPENED TO THESE SAFETY FEATURES.    MY HUSBAND LEFT THAT ACCIDENT AND DROVE ABOUT 1 BLOCK DOWN THE STREET, RUNNING THE END OF THE YELLOW LIGHT AND INTO RED LIGHT, AND HIT THE RIGHT REAR OF ANOTHER VEHICLE.  HIS VEHICLE THEN DROVE OUT-OF-CONTROL INTO THE CORNER PLANTER AND HIT A SIGN, WHICH THEN FELL ONTO TWO VEHICLES.  IT IS MY UNDERSTANDING THAT AFTER HE HIT THE TAIL OF THE VEHICLE, HIS VEHICLE SPED UP INTO THAT PLANTER AREA.  AGAIN, THE VEHICLE IS EQUIPPED WITH THE SAFETY FEATURES THAT ARE SUPPOSED TO SLOW OR STOP THE VEHICLE - BUT DIDN'T.    MY HUSBAND WAS IN THE WRONG - AND SHOULD NOT HAVE BEEN DRIVING.  HOWEVER, HE WAS THE ONE HURT THE WORST WITH 7 BROKEN RIBS, A BROKEN FEMUR, A BROKEN NOSE, AN INJURY TO THE SPLEEN AND BLEEDING ON THE BRAIN.  MY CONCERN IS THE FUNCTIONING OF THE SAFETY FEATURES THAT TOYOTA DEALERS ARE TOUTING ABOUT THE VEHICLES.",
        "vin": "4T1BZ1FB8KU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/01/2019",
        "dateOfIncident": "06/30/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228593,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA AVALON HYBRID WITH KEYLESS IGNITION.  CAR IS SILENT BUT MAY STAY ON WHEN PARKED IN GARAGE.  THERE IS NO WARNING SOUND OR LIGHT IF CAR IS LEFT ON AND CAR IS SILENT, BUT AS BATTERY DRAINS, THE ENGINE MAY COME ON 20 MIN LATER AND GENERATE CARBON MONOXIDE. I AM AN ALERT DRIVER BUT THIS HAS HAPPENED TWICE. MORE THAN 17 TOYOTA OWNERS HAVE DIED OF CARBON MONOXIDE POISONING. THIS IS AN EASY SOFTWARE FIX. TOYOTA SAYS IT WILL FIX IN 2020, BUT THERE IS NO SOFTWARE FIX COMING FOR HYBRIDS ALREADY SOLD.",
        "vin": "4T1B21FB5KU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/11/2019",
        "dateOfIncident": "01/10/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195557,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA AVALON. WHILE DRIVING VARIOUS SPEEDS IN STOP AND GO TRAFFIC, THE ACCELERATOR PEDAL WAS APPLIED, BUT THE VEHICLE HESITATED AND SPONTANEOUSLY ACCELERATED. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO TOYOTA OF CEDAR PARK (5600 183A, LEANDER, TX 78641, (512) 379-7575) WHERE IT WAS DIAGNOSED THAT THE SOFTWARE NEEDED TO BE UPDATED, BUT STATED THAT THE VEHICLE WAS PERFORMING AS DESIGNED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND PROVIDED CASE NUMBER: 1904010349. THE MANUFACTURER ADVISED THE CONTACT TO CALL THE LOCAL DEALER. THE FAILURE MILEAGE WAS 3,500.",
        "vin": "4T1BZ1FB4KU"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/02/2019",
        "dateOfIncident": "02/04/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193319,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN THE ROAD WITH THE ADAPTIVE CRUISE CONTROL ON THE CAR RANDOMLY SLAMS ON THE BRAKES.  THIS HAS HAPPENED MULTIPLE TIMES.  IT HAS HAPPENED ON HIGHWAY DRIVING AND STREET DRIVING.",
        "vin": "4T1BZ1FB6KU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/03/2019",
        "dateOfIncident": "03/02/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183716,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "REPORTED THIS TO DEALER. THEY COULDN'T FIND ANYTHING WRONG AT THE TIME. KEEPS HAPPENING : BLIND SPOT MONITORING AND CROSS TRAFFIC ALERT MALFUNCTION ALERTS",
        "vin": "4T1BZ1FB4KU"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/20/2019",
        "dateOfIncident": "09/11/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181381,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA AVOLON. THE CONTACT STATED THAT THERE WAS DISCOLORATION ON THE HEADLIGHT UNITS. AS A RESULT, THE CONTACT COULD NOT SEE THE ROAD CLEARLY AT NIGHT AND HIS VISION WAS IMPAIRED. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO DCH TOYOTA OF TORRANCE (2909 PACIFIC COAST HWY, TORRANCE, CA 90505, (424) 271-2340) TO BE DIAGNOSED; HOWEVER, FURTHER DIAGNOSTIC TESTING WAS NEEDED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 14,000.",
        "vin": "1N4AL3AP5DN"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/29/2019",
        "dateOfIncident": "01/29/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11172808,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH BLIND SPOT MONITORING AND CROSS TRAFFIC ALERT - MALFUNCTION ALERTS, KEEPS POPPING UP REGULARLY.  MULTIPLE TRIPS TO THE DEALER, WITH NO RESOLUTION.  TOYOTA INDICATES THAT THIS IS A PROB AND ARE WORKING ON AN SOLUTION.  IT IS NOT CLEAR WHAT THAT IS.  SEEMS LIKE ISSUE POPS UP MORE WHEN IT IS VERY COLD OR VERY WET.  TOYOTA SAYS THEY ARE LOOKING INTO IT, BUT NOT SURE WHAT THEIR PLAN IS.  TOYOTA CASE #1901292206 FOR TODAY.",
        "vin": "4T1BZ1FB1KU"
    }
]