[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/28/2019",
        "dateOfIncident": "05/18/2019",
        "fire": false,
        "manufacturer": "Tracker Marine, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210427,
        "products": [
            {
                "manufacturer": "Tracker Marine, LLC",
                "productMake": "TRACKER MARINE",
                "productModel": "BASS TRACKER",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 TRAILSTAR BOAT TRAILER MODEL BASSTRKXL HAD THE SAFETY PIN FAIL WHILE PULLING UP THE LAUNCH RAMP AFTER LAUNCHING THE BOAT AND THE TRAILER WAS EMPTY AND THE MPH WAS LESS THAN 5. THE CHEAP AND THIN FACTORY INSTALLED SAFETY PIN BACKED ITSELF OUT CAUSING THE TONGUE TO UNLOCK AND THE TRAILER POPPED OFF THE BALL. NOT ONLY DID THE PIN FAIL, BUT BOTH FACTORY INSTALLED SAFETY CABLES DID ALSO AND THIS CAUSED THE TRAILER TO CAREEN OUT OF CONTROL DOWN THE LAUNCH RAMP AFTER THERE WAS NOTHING HOLDING IT ON TO THE TRUCK ANY LONGER. THE SAFETY CABLE ON THE PASSENGER SIDE OF THE TRUCK RIPPED COMPLETELY OFF THE TRAILER BECAUSE THE FACTORY INSTALLED WASHED WAS SMALLER IN DIAMETER THEN NECESSARY TO ANCHOR IT TO THE TRAILER. THE SAFETY CABLE ON THE PASSENGER SIDE OF THE TRUCK DIDN'T RIP FREE FROM THE TRAILER, BUT THE CABLE FAILED WHEN THE S-HOOK COMPLETELY STRAIGHTENED OUT AND BROKE FREE FROM THE TRUCK. IN ADDITION TO THE S-HOOK STRAIGHTENING OUT, IT ALSO HAS A FRACTURE IN IT THAT IS APPROXIMATELY TWO THIRDS OF THE DIAMETER. ONCE ALL 3 OF THESE FACTORY INSTALLED SAFETY MEASURES FAILED WITH A WEIGHTLESS TRAILER, THE WIRING HARNESS WAS THEN YANKED OUT OF THE TRUCK AND GRAVITY TOOK OVER AS THE TRAILER SLIDE DOWN THE LAUNCH RAMP ON THE TONGUE OF THE TRAILER SEVERING THE WIRE HARNESS IN THE PROCESS. THANKFULLY THE TRAILER TURNED ITSELF HORIZONTALLY AND CAME TO REST BEFORE HITTING ANY VEHICLES, BOATS, TRAILERS OR PEOPLE. I DID SOME RESEARCH ONCE RETURNING THE TRAILER HOME AND IT TURNS OUT THAT I FOUND THIS SAME VERY COMPLAINT WITH THE SAME TRAILER MANUFACTURER DATING AS FAR BACK AS 2006. I'M VERY GLAD NOBODY WAS HURT, BUT AM SHOCKED THAT NOTHING HAS BEEN DONE BY TRAILSTAR OR THE NHTSA TO ADDRESS THESE FAULTY SAFETY MEASURES. SOMEONE EASILY COULD HAVE BEEN SERIOUSLY HURT OR DIED AND I CAN'T IMAGINE WHAT WOULD HAVE HAPPENED IF THERE WAS A BOAT ON IT WHEN THIS OCCURRED.",
        "vin": "7J511ZH11KB"
    }
]