[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/28/2021",
        "dateOfIncident": "02/23/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398306,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SEQUOIA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FEBRUARY 23RD, 2021, WHILE DRIVING APPROXIMATELY 60 MILES PER HOUR ON I-40, THE MOON ROOF ON MY 2019 TOYOTA SEQUOIA INEXPLICABLY EXPLODED. IT WAS WELL BEFORE RUSH HOUR AND THERE WAS NO TRAFFIC TO SEND DEBRIS TOWARDS ME. NOTHING HIT ME. THE GLASS EXPLODED OUTWARD. THERE WAS NO OTHER DAMAGE TO THE ROOF OF MY VEHICLE.",
        "vin": "5TDYY5G19KS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/18/2020",
        "dateOfIncident": "05/07/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329523,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SEQUOIA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS COMMUNICATION IS IN REFERENCE TO A KNOWN FUEL PUMP PROBLEM FOR WHICH WE RECEIVED AN INTERIM NOTICE OF RECALL SOME TIME PRIOR TO 5/7/2020 (EXACT DATE UNKNOWN DUE TO COVID SHUT DOWN DELAYS).  THERE IS STILL NO REMEDY/REPLACEMENT PART AVAILABLE. TOYOTA CUSTOMER SERVICE TIER 2 SUPPORT HAS SUGGESTED THAT I REACH OUT THROUGH NHTSA FOR ASSISTANCE IN EXPEDITING A SOLUTION THROUGH TOYOTA MANAGEMENT.  THE REASON THIS IS SO CRITICAL IS THAT THIS VEHICLE IS PART OF AN EMERGENCY SERVICES FLEET OWNED BY DOWNSTREAM CASINO RESORT, AN ENTERPRISE OF THE QUAPAW NATION (TRIBAL).  IT IS A SPECIALTY VEHICLE WHICH CARRIES LAW ENFORCEMENT PERSONNEL AND CANINE OFFICERS TO AND FROM MULTIPLE TRIBAL ENTERPRISES AND OTHER LOCATIONS AS REQUESTED BY OTHER LAW ENFORCEMENT AGENCIES.  PERIODICALLY TRAVEL OCCURS AT HIGH RATES OF SPEED AND OVER LONG DISTANCES, UP TO 400 MILES.  RELIABILITY OF THE VEHICLE IS CRITICAL TO THE LIVES OF THOSE IN IT, THOSE THEY SERVE, AS WELL AS THOSE THEY COULD POTENTIALLY BE TRAVELING TO ASSIST.  IF THIS KNOWN DEFECTIVE PART FAILS DURING ONE OF THOSE PROCESSES IT COULD BE CATASTROPHIC.   WE PURCHASED THESE VEHICLES NEW FROM A MANUFACTURER WE BELIEVED COULD SERVE THE RELIABILITY NEEDS OF OUR FLEET.  WHILE WE UNDERSTAND THAT THERE ARE ALWAYS UNKNOWN POSSIBILITIES, WE ARE DISAPPOINTED THAT A REMEDY IS STILL NOT AVAILABLE, AND WE HAVE BEEN UNABLE TO OBTAIN A COMMITMENT FOR AN EXPEDITED REMEDY TO, WHAT FOR US, IS A CRITICAL CONCERN.  AGAIN, AS SUGGESTED, BY TOYOTA CUSTOMER SUPPORT, WE ARE REQUESTING ASSISTANCE IN PUSHING FOR AN EXPEDITED REMEDY.  THANK YOU,   [XXX],  RISK MANAGER, DOWNSTREAM CASINO RESORT - AN ENTERPRISE OF THE QUAPAW NATION  [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *CC *TR",
        "vin": "5TDBY5G17KS"
    }
]