[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/14/2022",
        "dateOfIncident": "01/16/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451920,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Toyota Yaris. The contact initially stated that multiple attempts were needed to start his vehicle. When the vehicle would start, the transmission would hesitate upon the depression of the accelerator pedal with several unknown warning lights illuminated. Upon investigation underneath the hood, the contact discovered sticks and chewed wiring which he linked to squirrels. Since the initial discovery, the contact had seen squirrels entering and leaving the engine compartment on two separate occasions. The dealer had been notified of the failure but offered no assistance. The manufacturer was also notified of the failure and provided a case number. The contact ordered the parts to replace the wiring harness and air filter cover however, the vehicle was not yet repaired. The failure mileage was approximately 14,700.",
        "vin": "3mydlbyv5ky"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/15/2022",
        "dateOfIncident": "01/15/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447638,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I went to the dealership to get my safety recall fixed and i was informed that my safety recall cannot be fixed. This is a problem because I am risking my life every time I drive this car I want to know if getting a lawyer to resolve this issue is the best solution to getting this problem solved",
        "vin": "3MYDLBYV9KY"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/11/2022",
        "dateOfIncident": "08/06/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446982,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Recall for dangerous issue (risk of crash due to faulty fuel pump) has been unresolved since mid 2021. Have contacted several Toyota dealerships who have said they aren’t able to repair fuel pump since a solution for recall hasn’t been issued yet. Contacted Toyota corporate to ask for rental car until a repair is confirmed and they stated they cannot guarantee a rental will be reimbursed and have no timeline for fuel pump solution. Have been unable to drive my car on highway for six months as it feels unsafe.",
        "vin": "3MYDLBYV3KY"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/01/2021",
        "dateOfIncident": "11/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438869,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 TOYOTA YARIS. CONSUMER WRITES IN REGARDS TO ISSUE WITH THE BATTERY.",
        "vin": "99999999999"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/12/2021",
        "dateOfIncident": "10/12/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436523,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Our vehicle got recalled and we're worried for the safety of our kids in a small unstable 2019 Toyota Yaris",
        "vin": "3MYDLBYV8KY"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/06/2021",
        "dateOfIncident": "09/05/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431894,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "After shopping I tried to start my car.  It did a lot of shuttering and the check engine and battery lights came on.  It would not run.  I called AAA and they said the battery was fully charged.  When the AAA tow service came the car started and ran fine.  When I got home I checked with my OBD II tool.  The code was P0087 Fuel Rail/System Pressure - Too Low.",
        "vin": "3MYDLBYV0KY"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/22/2021",
        "dateOfIncident": "07/09/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426044,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "It was about 90+ degrees Fahrenheit on a Friday afternoon..(prior to this date my wife expressed concern that the  car did not accelerate as quickly as she thought it should)  we drove in to the parking area of the Mall...we were undecided where to park and stopped the car. We tried to restart the car but it would not start. It would try to crank but that was all. Since it was so hot we thought that the air conditioner might have drained the battery. We called the AAA and found that it was not the battery. He suggested that the TOYOTA DEALERSHIP was a few b locks away that we should have them do further testing....we wanted to at first go home but instead went to the dealership--the car failed to start at all in the doorway of the Service entrance..it would try to crank but that was all just a grinding sort of noise.......(We thought that TOYOTA would pay for our incidental expenses since the car was under warranty...so far we have received nothing but TOYOTA did pay for a car rental on the following Monday.....) The problem was a failed Fuel Pump as the service man pointed out  the error message was for low pressure on fuel pump.  This was serious if we were on the freeway or traveling home for some distance in remote areas..they obviously could be a collision or we would be stranded without any form of help.....  The dealer explained the the fuel pump was replaced by an updated or modified  model not the same one in the car...They kept the original pump.....",
        "vin": "3MYDLBYV7KY"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/26/2021",
        "dateOfIncident": "06/21/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422391,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Unknown. Lights on dashboard came on. Check engine light came on. Car started jerking front and back while driving, accelerating, and braking.",
        "vin": "3MYDLBYV0KY"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/31/2021",
        "dateOfIncident": "03/31/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405750,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA YARIS. THE CONTACT TOOK THE VEHICLE TO LOU FUSZ TOYOTA (10725 MANCHESTER RD, ST. LOUIS, MO 63122) TO BE SERVICED FOR AN UNKNOWN MANUFACTURER'S RECALL TO RE-PROGRAM THE ENGINE. AFTER THE VEHICLE WAS SERVICED, THE KEYFOB FAILED TO LOCK AND UNLOCK THE VEHICLE. ADDITIONALLY, THE PUSH TO START BUTTON FAILED TO START THE VEHICLE. THE CONTACT NOTIFIED THE DEALER OF THE FAILURE. THE DEALER SUGGESTED THAT THE CONTACT RECORD A VIDEO OF THE FAILURE EXPERIENCED SO IT COULD BE SENT TO THE MANUFACTURER. THE VEHICLE WAS NOT TAKEN BACK TO THE DEALER FOR DIAGNOSIS OR REPAIRS. THE MANUFACTURER WAS NOT INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS 13,833.",
        "vin": "3MYDLBYV9KY"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/20/2021",
        "dateOfIncident": "03/20/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404060,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FROM JULY 2020 - JAN 2021, I EXPERIENCED MY VEHICLE CRANKING BUT NOT STARTING ON MULTIPLE OCCASIONS. I TOOK IT IN SEVERAL TIMES TO BE FIXED, BUT THE PROBLEM WAS INTERMITTENT AND COULD NOT BE DUPLICATED. HOWEVER, THE LAST TIME I PICKED IT UP FROM TOYOTA (PROBLEM COULD NOT BE DUPLICATED), IT HAPPENED AND I CALLED THE SERVICE ADVISOR OVER, AND HE EVEN TRIED TURNING IT, BUT IT WOULDN'T START. THE SOLUTION WAS THE KEY FOB. I INQUIRED HOW THEY KNEW IT WAS THE KEY FOB, BUT THEY DID NOT GIVE ME AN ANSWER. FEBRUARY 2021 IT STARTED TO HAPPEN AGAIN..BUT HAS NOT OCCURRED AS OF MARCH 2021. I THINK WHEN IT SHUTS OFF DRIVING ON THE FREEWAY, THEN MAYBE TOYOTA WOULD INVESTIGATE THIS MORE.    THE SECOND PROBLEM THAT HAS HAPPENED INFREQUENTLY IN 2020 WAS MY BACKUP CAMERA BEING BLACKED OUT OR GLITCHY. AS OF FEBRUARY 2021, THIS WOULD OCCUR FREQUENTLY, HOWEVER INTERMITTENT AS WELL. I SHOWED THE SERVICE ADVISOR THE VIDEO OF THE PROBLEM, BUT THEY COULDN'T FIX IT IF THEY CAN'T REPLICATE IT. I CONTACTED TOYOTA CUSTOMER SERVICE AGAIN TO ADDRESS THESE TWO PROBLEMS.     I THINK 2019 TOYOTA YARIS IS A LEMON VEHICLE WITH NOT MANY SOLD, THEREFORE UNLIKELY FOR TOYOTA TO TAKE ACTION IF THERE IS NO CLASS ACTION LAWSUIT MANDATING THEM. PERHAPS IT MADE FINANCIAL SENSE SIMILAR TO THE FORD PINTO.    I WOULD ADVISE MORE PEOPLE WITH 2019 TOYOTA YARIS TO POST HERE, SO NHTSA COULD INVESTIGATE, CALL TOYOTA CUSTOMER SERVICE SO THEY CAN ACCOUNT FOR THE PROBLEMS, OR REACH OUT TO A LAWYER, BECAUSE YOU SHOULD NOT BE FIXING A NEW CAR TO THIS EXTENT...",
        "vin": "3MYDLBYV5KY"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/19/2020",
        "dateOfIncident": "11/19/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375457,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS MORNING (11/19/2020) AT APPROXIMATELY 4:50AM I TURNED ON MY CAR AND SAT IN THE DRIVEWAY TO LET IT WARM UP. USUALLY WHILE IT WARMS UP I GET MY BLUETOOTH CONNECTED AND GET MY MUSIC GOING, BUT THIS TIME IT WOULDN'T CONNECT. I FIGURED MY HUSBAND HAD BEEN PLAYING AROUND WITH THE SETTINGS AGAIN SO I HAD HIM COME OUTSIDE TO LOOK AT IT. IT STILL WOULDN'T EVEN BRING UP OUR PHONES SO I SHUT THE CAR OFF, WAITED MAYBE 30 SECONDS AND TURNED IT BACK ON. THIS TIME IT BROUGHT UP OUR PHONES BUT STILL WOULDN'T CONNECT AND A MESSAGE POPPED UP ON THE SCREEN SAYING \"UNABLE TO CONNECT- UNKNOWN ERROR\". AT THIS POINT I SAID FORGET IT, I'VE GOT TO GET TO WORK. I PUT THE CAR IN REVERSE AND IMMEDIATELY NOTICED THAT THE BACK-UP CAMERA WASN'T WORKING. FIGURED I'VE ALREADY GOT AN APPOINTMENT WITH TOYOTA IN THE MORNING SO I'LL BRING THAT TO THEIR ATTENTION AS WELL. BEFORE I MADE IT OUT OF TOWN I STARTED SMELLING A FAINT BURNING WIRE SMELL AGAIN. EVERY TIME I MENTIONED IT TO MY HUSBAND HE'D SAY HE COULDN'T SMELL IT SO I THOUGHT MAYBE I WAS IMAGINING IT. FINALLY MADE IT TO THE HIGHWAY WELL ON MY WAY TO WORK AND DECIDED TO TRY THE CRUISE CONTROL. GOT TO THE SPEED LIMIT, TURNED IT ON, DROVE FOR A FEW, GOT PARANOID ABOUT DEER AND DECIDED TO TURN IT OFF. IT DID NOT TURN OFF. I PRESSED THE OFF BUTTON AND IT ACCELERATED. TRIED THE OFF BUTTON AGAIN AND AGAIN IT ACCELERATED. TRIED THE DOWN BUTTON, ACCELERATED AGAIN. THOUGHT MAYBE THERE'S A CROSSED WIRE SO I TRIED THE UP BUTTON, YOU GUESSED IT. STARTED GOING FASTER. IT ALLOWED ME TO BREAK AND STOP SO I PULLED OVER AND TURNED OFF THE CAR FOR A FEW MINUTES. WHEN I TURNED IT BACK ON EVERYTHING WAS FUNCTIONAL AND WAS STILL FUNCTIONING AS EXPECTED AFTER WORK. TO BE CLEAR, I DID NOT TRY THE CRUISE CONTROL AGAIN.",
        "vin": "3MYDLBYV7KY"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/18/2020",
        "dateOfIncident": "08/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11359776,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR BROKE DOWN IN THE HEAT. THE CAR WOULD NOT START AFTER VEHICLE STOPPED. THE VEHICLE COOLED OFF AFTER 1 HOUR IT STARTED. WE TOOK TO TOYOTA. THEY THOUGHT IT WAS A BATTERY. THEY REPLACED IT. THE BROKE DOWN ON THE SAME ISSUE 1 WEEK LATER. WE TOOK IT AGAIN TO TOYOTA. THEY SAID NOTHING WAS WRONG WITH IT. WE TOOK IT HOME.  IT BROKE DOWN AGAIN ON THE 09/01/2020. THE CAR HAS BEEN THERE SINCE TH 1ST OF THE MONTH. IT IS FUEL ISSUE PROBLEM AND THERE IS A LOT OF CARS OUT THERE FOR THE SAME PROBLEM.  THE PARTS ARE ALL ON BACK ORDER NOW. THATS WHY IT IS TAKING SO LONG. THE PARTS ARE BACK ORDER UNTIL THE 24TH OF THE MONTH. WE ARE GOING TO REPORT THIS CAR HAS A LEMON.",
        "vin": "3MYDLBYV4KY"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/18/2020",
        "dateOfIncident": "10/02/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309980,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE THE 11TH MONTH OF OWNING THE AIR CONDITIONING IS NOT WORKING WHEN USED IN LONG DRIVES OF MORE THAN 1 HOUR.  THE BLOWER START TO LOOSE POWER AND THEN NO MORE COLD.  THE BLOWER KEEP BLOWING AIR BUT SLOW, NO COLD BREEZE.  THIS HAPPEN WHEN VEHICLE IS IN MOTION IN THE HIGHWAY.",
        "vin": "3MYDLBYV8KY"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/06/2019",
        "dateOfIncident": "08/04/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241985,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SUNDAY, AUGUST 4TH DROVE APPROXIMATELY 3 MILES DOWN ROUTE 650 ON NEW HAMPSHIRE AVENUE, SILVER SPRING, MD.  STOPPED AT THE ATM ENROUTE TO CHURCH.    GOT BACK INTO THE VEHICLE AND TRAVELLED APPROXIMATELY 1 MILE PROCEEDING TO THE EAST WEST HIGHWAY EXIT ON LEFT.  SUDDENLY THE CAR STARTED MAKING A PULLING OR STRAINING  NOISE.  I WAS SHOCKED SINCE THE CAR WAS BRAND NEW AND I HAD RECENTLY JUST PURCHASED THE CAR.  SUDDENLY THE CAR LOCKED AND I HAD NO CONTROL OF IT.  I INDICATED TO THE CAR IN BACK TO GO AROUND ME.  I IMMEDIATELY PULLED UP THE EMERGENCY BRAKE SINCE I HAD NO CONTROL OF THE CAR AND COASTED ACROSS THE STREET AND PARKED.  THEN I CALLED ROAD   SERVICE AND INFORMED THEM WHAT HAD OCCURRED.  THEY INFORMED ME THAT THE CAR WAS INOPERABLE AND WOULD NEED TO BE TOWED TO THE DEALERSHIP FOR SERVICE ON MONDAY.  A TOW TRUCK ARRIVED ABOUT 1 HOUR LATER.  THE GENTLEMAN GOT IN THE CAR AND NOW WAS ABLE TO GET  THE CAR BACK IN THE PARK POSITION (WHICH I WAS NOT ABLE TO DO EARLIER).  HE WAS NOW ABLE TO TURN THE CAR OFF AND RESTART IT.  I THEN GOT IN MY CAR DROVE AROUND WHILE THE TOW TRUCK WAITED.  THEN I WENT HOME TERRIBLY SHAKEN UP AT WHAT COULD HAVE HAPPPENED.",
        "vin": "3MYDLBYV3KY"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/25/2019",
        "dateOfIncident": "03/02/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234880,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE WINDSHIELD THAT IS A SAFETY HAZARD.  MAKES IT HARD TO JUDGE DISTANCE TO THE CURB OR VEHICLE NEXT TO YOU. FEAR GETTING INTO ACCIDENT WITH CURRENT WINDSHIELD HOWEVER TOYOTA STATES IT IS NORMAL EVEN THOUGH IT DISTORTS YOUR VISION WHEN DRIVING. AFTER FIVE MONTHS TOYOTA HAS DONE NOTHING TO CORRECT THE DEFECT AND ENSURE MY SAFETY WHILE DRIVING THEIR CAR.",
        "vin": "3MYDLBYV2KY"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/06/2019",
        "dateOfIncident": "05/05/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218385,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH ONLY 500 MILES ON IT I HAD ALIGNMENT ISSUE WITH THIS BRAND NEW CAR TOYOTA YARIS 2019 WHICH WAS PURCHASED ON APR 2019. AFTER I TOOK MY CAR TO TUSTIN TOYOTA DEALERSHIP, THEY FIXED THE ALIGNMENT FOR THE FIRST TIME I HAD THE SAME ISSUE I TOOK MY CAR THERE FOR THE SECOND TIME THEY SAID NOTHING WRONG WITH IT WHILE I HAD DOCUMENT OF ALIGNMENT FAILED WHICH IM ATTACHING IT. I STILL HAVE SAFETY PROBLEM THAT IS EITHER RELATED TO STEERING,TIER, SUSPENSION, BEAM TORSION OR ANYTHING ELSE THAT CAUSE MY CAR FEELING LIKE DRIFTING OR SLIDING TO RIGHT OR LEFT WHILE DRIVING AROUND 60MPH OR ABOVE. FEELS LIKE DRIVING ON SLIPPERY SNOWY ROAD. I CANT HAVE MY CAR CONTROLLED EVEN THOUGH BY HOLDING THE STEERING VERY TIGHT AND ITS A HUGE ROAD WITH SO MANY TRUCKS WHICH CAN BE SO DANGEROUS. I HAVE PASSED 2 SERIOUS ACCIDENT ALREADY AND HAVE A FEELING THIS CAR WITH 185 INCH TIER IS ONLY DESIGNED FOR CITY OR FOR SPEED BELOW 60AND THATS HOW MET TOYOTA SAFETY AND EXPECTATION AS THEY CONFIRMING THEIR SAFETY AND NOT PROVIDING ANY OTHER HELP!!!  VERY DISAPPOINTED SUCH A BIG COMPANY IS RE BADGING MAZDA 2 AND SELL IT UNDER TOYOTA WITH SAFETY ISSUE.  THEY NEED TO GET RECALL ON THESE TYPE OF CAR IF THEY THINK THIS CAR DOESNT HAVE ANY ISSUE AND THE CAR IS TOTALLY FINE BEFORE SOME BIG LAWSUIT IS TAKING PLACE.  I CONCERN ABOUT MY AND OTHER VEHICLE SAFETY WHILE DRIVING AND NEED TO REPORT THIS TO TAKE SOME ACTION",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/06/2019",
        "dateOfIncident": "05/12/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218380,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH ONLY 500 MILES ON IT I HAD ALIGNMENT ISSUE WITH THIS BRAND NEW CAR TOYOTA YARIS 2019. AFTER FIX THAT I STILL HAD SAFETY PROBLEM THAT IS EITHER RELATED TO STEERING,TIER, SUSPENSION, BEAM TORSION OR ANYTHING ELSE THAT CAUSE MY CAR FEELING LIKE DRIFTING OR SLIDING TO RIGHT OR LEFT WHILE DRIVING AROUND 60 OR ABOVE. FEELS LIKE DRIVING ON SLIPPERY SNOWY ROAD. I CANT HAVE MY CAR CONTROLLED EVEN THOUGHT BY HOLDING THE STEERING VERY TIGHT. I HAVE PASSED 2 SERIOUS ACCIDENT ALREADY AND HAVE A FEELING THIS CAR WITH 185 INCH TIER IS ONLY DESIGNED FOR CITY OR FOR SPEED BELOW 60 MPH AND THATS HOW MET TOYOTA SAFETY AND EXPECTATION!!!  VERY DISAPPOINTED SUCH A BIG COMPANY IS RE BADGING MAZDA 2 AND SELL IT UNDER TOYOTA WITH SAFETY ISSUE.  THEY NEED TO GET RECALL ON THESE TYPE OF CAR IF THEY THINK THIS CAR DOESNT HAVE ANY ISSUE AND THE CAR IS TOTALLY FINE BEFORE SOME BIG LAWSUIT IS TAKING PLACE.  I CONCERN ABOUT MY AND OTHER VEHICLE SAFETY WHILE DRIVING AND NEED TO REPORT AND FOLLOW UP ON THIS",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/28/2019",
        "dateOfIncident": "01/25/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11172589,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WENT TO DEALERSHIP ON WESTERN 1/7/19 BOUGHT A NEW VEHICLE 2019 TOYOTA YARIS LE THE SAME DAY THE VEHICLE STOPPED ON ME WHILE IN TRAFFIC ON 33RD AND KING DRIVE ALL THE LIGHTS TURNED RED AND CAME EVEN BEFORE LEAVING THE DEALERSHIP THE ENGINE LIGHT CAME ON AND THE AGENT IGNOCIO TOLD ME THAT 'IT'S NOTHING IT WILL GO AWAY'. THE SAME THING HAPPENED 1/11/19 AND 1/25/19 IN TRAFFIC ON LAKESHORE DRIVE AND THE VEHICLE STOPPED WHILE IN DRIVE MODE AND ALL LIGHTS CAME ON AGAIN WINDOWS WERE STUCK DOORS WERE NOT UNLOCKING AND THE KEY WAS IN THE VEHICLE AS WELL. I WAS SCARED FOR MY LIFE AND COULD BEEN KILLED THAT DAY. TOYOTA DEALERSHIP IS NOT DOING ANYTHING ABOUT THE ISSUE I TOLD THEM THIS IS A MANUFACTURER DEFECT BECAUSE THERE IS NO WAY A BRAND NEW VEHICLE WILL HAVE ENGINE LIGHT INCLUDING ALL OTHER LIGHTS ON AND STOP ON ON ITS ONW IN TRAFFIC.",
        "vin": "3MYDLBYV1KY"
    }
]