[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/29/2021",
        "dateOfIncident": "06/26/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11422870,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I own a 2019 Toyota Sienna with 52,200 kms.  I bought it January 29, 2021. On Saturday, June 26, 2021, I was exiting the Quebec to Lévis ferry on the Lévis side.  As I went up the metal ramp at 10-12 km/hr, ALL the airbags suddenly deployed with a great boom.  We hit nothing.  ALL The front and side airbags deployed.  The front windshield was broken and one of the side windows was totally shattered.  In fact it was not there any more.  Pieces of broken glass flew all over the car and hit us. The vehicle filled up with smoke.  On board was my wife and I and our two special needs sons.  We had to hurriedly get them unstrapped and hand them to ferry workers on the outside. I was the only one injured.  I received the airbag straight in my face and it hurt my neck.  I have had a headache and neck ache ever since (today is June 29). I ignore the reason for which the airbags deployed.  But I do know that Toyota has had to recall other 2019 Siennas for spontaneous deployment of their airbags.  Maybe it is an airbag defect.  My vehicle was still under warranty. The fire department and police were on the scene.  The Levis Ferry director wrote a report. The Levis police report is LVS-210626-008.  Thank you.",
        "vin": "5TDKZ3DC9KS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/15/2021",
        "dateOfIncident": "05/13/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416695,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WAS PARKED IN A PARKING LOT AND TURNED OFF. WE WERE ENTERING THE VEHICLE AND THE AUTOMATIC SIDE DOOR OF THE VAN FAILED TO REOPEN UPON SENSING SOMETHING IN THE WAY. THE DOOR CLOSED AND SOMEONE'S FOOT WITH SHOE WAS CAUGHT IN THE CLOSED DOOR.",
        "vin": "5TDDZ3DC0KS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/11/2021",
        "dateOfIncident": "04/19/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11416074,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA SIENNA. THE CONTACT STATED THAT WHILE GETTING HIS CHILD FROM THE REAR PASSENGER SLIDING DOOR WITHOUT WARNING THE SLIDING DOOR CLOSED ON THE CHILDS RIGHT HAND. THE CHILD WAS TAKEN TO THE HOSPITAL TO TREAT THE INJURIES.  THE VEHICLE HAD NOT BEEN REPAIRED OR DIAGNOSED. NO DEALER WAS CONTACTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED THE CONTACT WITH A CASE NUMBER. THE FAILURE MILEAGE WAS APPROXIMATELY 50,000.",
        "vin": "5TDYZ3DC0KS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/10/2020",
        "dateOfIncident": "11/04/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374055,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FUEL PUMP HAS BEEN REPLACED BY THE DEALER WITH THE RECALLED PART.  THE VEHICLE STILL DOES THE SAME THING IT HAS BEEN DOING SINCE PURCHASING.  IT ACTS LIKE IT IS NOT GETTING GAS SO HESITATES MULTIPLE TIMES CONSTANTLY WHILE DRIVING.  SOMETIMES I PULL OUT AND THERE IS A DELAY IN THE ENGINE GETTING GAS THEN IT KICKS IN AND IS A JERKY RIDE. IT MOSTLY HAPPENS BELOW 45 MPH.  I HAVE FELT THE DELAY OCCASIONALLY ABOVE 55 MPH.  THE PROBLEM IS NOT THE FUEL PUMP THAT THEY ARE RECALLING SINCE I ALREADY HAVE THE NEW ONE AND THE PROBLEM IS NOT FIXED.",
        "vin": "5TDYZ3DC8KS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/30/2020",
        "dateOfIncident": "08/26/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352091,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WENT TO THE TOYOTA DEALERSHIP AT 62-10 NORTHERN BLVD QUEENS NY 11377 ON AUGUST 26TH AT 9.00AM. THEY SAID THEY CAN NOT FIX MY RECALL PROBLEM BECAUSE I HAVE A FR CONVERSIONS( WHEEL CHAIR CAR)PLEASE SUGGEST ME WHAT SHOULD I DO?   THANK YOU.",
        "vin": "5TDKZ3DC3KS"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/30/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331738,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. ALAMO TOYOTA LOCATED AT 18019 NORTH U.S. HWY 281, SAN ANTONIO, TX 78232, (210)494-1604, WAS CONTACTED AND CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE CONTACT STATED THAT THE VEHICLE WAS MODIFIED TO TRANSPORT HER DAUGHTER WHO WAS WHEELCHAIR BOUND. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TDXZ3DC4KS"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/16/2020",
        "dateOfIncident": "06/16/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329119,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. AN UNKNOWN DEALER WAS CONTACTED AND CONFIRMED THAT PARTS WERE NOT AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TDZZ3DC7KS"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/16/2020",
        "dateOfIncident": "03/16/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329250,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA SIENNA. THE CONTACT STATED THAT ON SEVERAL OCCASIONS AFTER REFUELING, THE VEHICLE FAILED TO RESTART. AFTER SEVERAL ATTEMPTS, THE VEHICLE RESTARTED WITH THE CHECK ENGINE WARNING LIGHT ILLUMINATED. PRIOR TO THE FAILURE THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PARTS TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. STAPP INTERSTATE TOYOTA (8019 RASPBERRY WAY, FREDERICK, CO 80504) WAS CONTACTED AND CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE VEHICLE REMAINED AT THE DEALER HOWEVER, WAS NOT REPAIRED. THE CONTACT WAS PROMISED A LOANER VEHICLE WHICH WAS NOT PROVIDED. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS APPROXIMATELY 24,500. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TDYZ3DC6KS"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/16/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329283,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA NOTIFIED OWNERS OF A FUEL PUMP PROBLEM IN JANUARY 2020. IT IS NOW 6 MONTHS LATER AND TOYOTA STILL DOES NOT HAVE A FIX FOR THIS PROBLEM. I AM UNABLE TO SAFELY USE MY CAR AND NOT EVEN THE TOYOTA DEALERSHIP WILL OFFER ME ENOUGH MONEY TO COVER MY LOAN IN ORDER TO SELL THE CAR. I AM PAYING $600 A MONTH FOR A CAR I CAN'T USE AND CAN'T SELL.  *TR",
        "vin": "5TDDZ3DC4KS"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/10/2020",
        "dateOfIncident": "02/15/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328217,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA SIENNA. THE CONTACT STATED THAT ON NUMEROUS OCCASIONS, THE VEHICLE FAILED TO START. THE VEHICLE WAS TAKEN TO OURISMAN FAIRFAX TOYOTA (10287 FAIRFAX BLVD, FAIRFAX, VA 22030) WHERE THE CONTACT WAS INFORMED THAT THE FAILURE WAS DUE TO THE KEYFOB BEING PLACED IN HER PURSE WHILE ATTEMPTING TO START THE VEHICLE. THE CONTACT CONTINUED TO EXPERIENCE THE FAILURE INTERMITTENTLY. THE CONTACT THEN RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE SAME DEALER WAS CONTACTED AND CONFIRMED THAT THE PART WAS NOT AVAILABLE FOR THE RECALL REMEDY. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR.  THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND INFORMED THE CONTACT TO REQUEST A LOANER VEHICLE FROM THE NEAREST AUTHORIZED DEALER. THE CONTACT STATED THAT HER VEHICLE WAS CUSTOM MADE FOR HER SON WHO HAS A DISABILITY AND THAT A LOANER VEHICLE WOULD NOT SUFFICE. THE FAILURE MILEAGE WAS 1,749. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TDYZ3DC6KS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/01/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326794,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I LEASE A 2019 TOYOTA SIENNA. THERE HAS BEEN A RECALL SINCE JANUARY, 2020 ON THE FUEL PUMP WHICH MAY CAUSE THE CAR TO STOP OPERATING AND COULD INCREASE THE RISK OF A CRASH. TOYOTA HAS NOT STILL NOT REMEDIED THE RECALL. I HAVE CALLED FOR THE PAST FIVE MONTHS, AND YET THE RECALL IS STILL IN THE INTERIM STAGE. THIS IS A BREACH OF THE LEASE AND CAUSES US TO BE UNABLE TO USE THE VEHICLE. DUE TO THE DANGER IN DRIVING THE CAR, I CONTACTED 4 DIFFERENT TOYOTA DEALERS TO OBTAIN A COMPARABLE RENTAL CAR THAT TOYOTA HAS AGREED TO PROVIDE.  NOT ONE OF THE DEALERSHIPS I CALLED HAS A COMPARABLE CAR IN THEIR FLEET. I ALSO CALLED TOYOTA CUSTOMER EXPERIENCE TWICE AND ON BOTH OCCASIONS THEY HUNG UP ON ME STATING THAT THEIR AGENTS WERE \"TOO BUSY\". IN ADDITION, THIS HAS CAUSED US TO CANCEL A ROAD TRIP.  *TR",
        "vin": "5TDJZ3DC0KS"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/28/2020",
        "dateOfIncident": "05/28/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326403,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED 2019 SIENNA WITH 4K MILES , REGULARLY CHANGED OIL TOGETHER WITH TIRE INSPECTION. NOW OUR CAR HAVE 29K MILE AND AT THE TIME THAN WE WAS CHANGING OIL  , THEY TOLD US WE NEED NEW TIRES . IT IS NO WAY  ITS NORMAL FOR BRAND NEW CAR WITH MICHELIN TIRES TO NEED NEW SETS OF TIRES . WE FOUNDED ITS MAIN PROBLEM WITH THIS CAR , SO MANU PEOPLE COMPLAINS . PLEASE HELP US SOLVE THIS PROBLEM.  *TR",
        "vin": "5TDYZ3DC1KS"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/04/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323288,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. AN UNKNOWN DEALER WAS CONTACTED AND CONFIRM PARTS NOT AVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "5TDXZ3DC3KS"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEAT BELTS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/01/2020",
        "dateOfIncident": "01/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319901,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FIRST WEEKS SEEMED LIKE EVERYTHING WAS FINE WITH THE VEHICLE UNTIL WE STARTED FEELING LOW LEVELS OF ELECTRICAL SHOCKS.  IT WAS MOSTLY ON THE STEERING WHEEL SO WE THOUGHT THAT THE SENSATION WOULD GO AWAY, BUT IT ACTUALLY STARTED GOING WORSE TO THE POINT THAT WE STARTED HAVING DISCOMFORT ON THE SEATBELT AND THE LAST THREE WEEKS BEFORE WE DROPPED THE VEHICLE AT THE DEALERSHIP THE HAZARD STARTED TO INTENSIFY AND GET STRONGER. THE SEATBELT OF THE 2019 TOYOTA SIENNA HAD PROVIDED A LOT OF PAIN TO MY OVARIES (TO THE POINT THAT MY PERIOD HAD BEEN ALTERED DURING THE MONTHS OF OCTOBER TO DECEMBER 2019), IT CAUSED SO MUCH PAIN IN MY STOMACH WHILE BEING A DRIVER AND A PASSENGER SPECIALLY THE LAST THREE WEEKS BEFORE I DROPPED THE VEHICLE AT THE DEALERSHIP. ALSO DUE TO THE FACT THAT I AM FIVE FEET TALL, THE SEATBELT RESTED ON MY NECK WHICH WAS THE MOST UNCOMFORTABLE EXPERIENCE.  IN THOSE PAST THREE WEEKS PRIOR TO DROPPING IT AT THE DEALERSHIP, I EVEN FELT SHOCKS FROM THE SEATBELT WHILE IT WAS RESTING ON MY NECK CAUSING NUMBNESS IN MY LEGS. ON REGARDS OF THE STEERING WHEEL, I FELT ELECTRICAL SHOCKS THAT CAUSED TINGLING IN MY HANDS GOING ALL THE WAY UP TO MY ELBOW CAUSING PAIN ON MY ELBOWS (HAVING GREATER DISCOMFORT ON MY LEFT ARM AS I TENDED TO DRIVE MOST WITH MY LEFT HAND) AND MAKING MY ARMS FEEL TINGLING AND EVENTUALLY NUMBNESS.",
        "vin": "5TDZZ3DC2KS"
    },
    {
        "components": "EXTERIOR LIGHTING,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/15/2020",
        "dateOfIncident": "01/14/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299633,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "PULLED OUT INTO ONCOMING TRAFFIC AND VEHICLE HESITATED AND WOULD NOT ACCELERATE. DASH LIGHTS CAME ON AND CAR STALLED. ATTEMPTED TO CRANK VAN AND IT RESTARTED BUT WOULD BARELY MOVE WITH THE ACCELERATOR PRESSED FULLY. HAD TO CALL A TOW TRUCK TO HAVE IT DELIVERED TO THE DEALER. I CALLED TOYOTA ROAD SIDE ASSISTANCE NUMBER AND 2.5 LATER NO ONE SHOWED UP. CALLED AGAIN AND DEMANDED A DIFFERENT TOW COMPANY RESPOND AND 30 MINUTES LATER SOMEONE WAS AT THE SCENE. THIS EPISODE STATED 230 PM AND VAN WAS PICKED UP 637PM.",
        "vin": "5TDYZ3DC9KS"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/08/2019",
        "dateOfIncident": "09/28/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278845,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I PULLED ONTO A HIGHWAY AND REACHING ABOUT 25 MPH THE 2019 SIENNA HESITATED FOR AT LEAST 10 SECONDS AS IF IT WAS NOT GETTING GAS.  I PRESSED THE GAS WANTING TO GET OUT OF THE WAY OF TRAFFIC AND IT JUMPED SLIGHTLY BUT WOULD NOT GO.  THEN IT KICKED IN WITH A FEW HESITATIONS AND TOOK OFF.  ANOTHER 100' OR SO, IT DID IT AGAIN.  PRIOR TO THIS I HAD ALREADY BROUGHT IT TO TOYOTA COMPLAINING THAT THERE IS A HESITATION WHEN THE VAN IS NOT WARMED UP YET BETWEEN 20-40 MPH.  IT IS ONLY SLIGHT, BUT NOTICEABLE AND FEELS LIKE IT IS NOT GETTING GAS. THE VAN DOES THIS EVERY TIME AFTER IT HAS BEEN SITTING LONG ENOUGH TO COOL DOWN.  THE LONG HESITATION ONLY HAPPENED TWICE SO FAR (DANGEROUS ENOUGH!), THERE HAVE BEEN A FEW SHORTER ONES, AND THEN THERE IS THE EVERY TIME SLIGHT HESITATION.  TOYOTA HAS TOLD ME NOTHING SHOWS IN THEIR DIAGNOSTICS AND THEY DO NOT KNOW WHAT IS WRONG.  THEY TRIED CUTTING THE POWER TO THE COMPUTER TO RESET THE MEMORY, BUT THIS DID NOT CHANGE ANYTHING.",
        "vin": "5TDYZ3DC8KS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/13/2019",
        "dateOfIncident": "07/25/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243690,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERIOR OF VAN WAS CONSUMED WITH FUEL VAPORS. EXTERIOR FRONT OF VAN ENGINE COMPARTMENT ALSO SMELLS LIKE A FUEL LEAK. PROBLEM TAKEN TO DEALER AND THEY COULD NOT FIND THE SOURCE OF LEAK. VAN WAS RELEASED TO ME IN A UNSAFE CONDITION. INTERMITTENT FUEL SMELL BECAME MORE PROGRESSIVE TO THE POINT THE VAN WAS NOT ABLE TO BE DRIVEN TO TO SAFTEY CONCERN OF FIRE. SECOND TRIP TO DEALER THEY COULD NOT FIND SOURCE OF FUEL LEAK. DESCRIPTION OF PROBLEM. WHEN VAN WAS DRIVEN WITH OR WITHOUT AC FUEL VAPORS WOULD BE NOTICED ON THE EXTERIOR OF THE VAN. THIS PROGRESSED TO THE INTERIOR WHILE DRIVING. I ALSO TESTED THE VAN WITH THE ENGINE ON AND BOTH AC ON/OFF WITH THE VAN IN THE PARKED POSITION AND STILL NOTICE A VERY STRONG ORDER OF FUEL VAPORS. THE VAN IS UNSAFE FOR TRANSPORTATION ON PUBLIC ROADS AND UNSAFE TO DRIVE IN WITH MY FAMILY. THE PROBLEM WAS NOTICED WHEN THE VAN WAS STATIONARY OR IN MOTION ON CITY/HIGHWAYS.",
        "vin": "5TDXZ3DC3KS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/23/2019",
        "dateOfIncident": "07/23/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234122,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A CONCERN THAT THE FRONTAL IMPACT SENSOR ON MY VAN MAY NOT BE WORKING.  I BOUGHT THE VAN NEW ABOUT 3 WEEKS AGO.  IN THAT TIME I HAVE DRIVEN IT AROUND TOWN, ON THE FREEWAY AND MADE A ROUNDTRIP TO CAL.   IN THAT ENTIRE TIME I HAVE NEVER RECEIVED ANY TYPE OF AUDIBLE OR VISUAL ALERT THAT A FRONTAL IMPACT IS ABOUT TO HAPPEN.  I HAVE THE SENSITIVITY SET TO VERY HIGH.  OVER THE COURSE OF THE LAST FEW WEEKS, I HAVE TRIED TO SAFELY SIMULATE THE CONDITIONS IN WHICH THE FRONTAL IMPACT SHOULD ACTIVATE, BUT I HAVE NOT HEARD ANYTHING OR SEEN ANY TYPE OF VISUAL ALERT.  I TOOK IT INTO THE DEALERSHIP TODAY AND WAS TOLD EVERYTHING IS FINE WITH IT.  HOWEVER, I STILL BELIEVE THAT IT IS NOT WORKING CORRECTLY, SINCE THE VEHICLE HAS NEVER MADE ANY TYPE OF AUDIBLE OR VISUAL ALERT OR WARNING.",
        "vin": "5TDYZ3DC9KS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/20/2019",
        "dateOfIncident": "06/30/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233527,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "AS SOON AS I GOT HOME AFTER PURCHASING MY 2019 TOYOTA SIENNA SE, I NOTICED THE POPPING NOISE COMING FROM BOTH FRONT DOOR HINGES.  I GUESS I MISSED THAT POPPING NOISE WHEN I TOOK THE DELIVERY OF THE CAR AT THE DEALERSHIP.  THE POPPING NOISE CAN BE HEARD EVERY TIME EITHER FRONT DOORS HINGES ARE IN MOTION.  I HAVE READ THAT MANY OF THE PREVIOUS YEAR TOYOTA SIENNAS HAS THE SAME POPPING NOISE ISSUE DUE TO THE DEFECTIVE DOOR CHECK POCKETS.",
        "vin": "5TDXZ3DC6KS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/09/2019",
        "dateOfIncident": "03/26/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206615,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TOLD THERE IS  A RECALL  UTA VAN  UNDER WARRANTY",
        "vin": "5TDZZ3DC0KS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/04/2019",
        "dateOfIncident": "02/15/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184017,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "IMMEDIATELY AFTER PURCHASING THIS NEW 2019 TOYOTA SIENNA I BECAME AWARE OF THE VEHICLE HAVING ACCELERATION PROBLEMS WHILE ATTEMPTING TO ACCELERATE GRADUALLY IN A LOW SPEED/LOW TORQUE SETTING. THIS OCCURS AT WHAT COULD BE DESCRIBED AS PARKING LOT SPEEDS, 5 TO 25 MPH, PRIMARILY, ALTHOUGH THE VEHICLE HESITATES AND THEN LURCHES ALSO AT HIGHER SPEEDS WHEN DOWNSHIFTING TO GAIN TORQUE IN A 30-50 MPH RANGE ALSO.    THIS HESITATION, BALKING, AND THEN RAPID LURCHING FORWARD AT LOW SPEEDS HAS CAUSED PASSENGERS TO COMMENT ABOUT \"WHIPLASH\" AND BEING PUSHED BACK INTO THEIR SEATS WHEN THE VEHICLE DOES ENGAGE WITH UNEXPECTED FORWARD MOTION.    THIS VEHICLE WAS PURCHASED ON 2-18-2019. AFTER DRIVING THE VEHICLE FOR A REASONABLE AMOUNT OF TIME AND MILES I CONTACTED OUR SALES AGENT WHO SET A SERVICE APPOINTMENT FOR MONDAY FEB 25, 2019.    ON 2-25-2019 I DROVE THE VEHICLE TO THE DEALER'S SERVICE DEPT WITH \"MILEAGE IN\" OF 250 MI. AND \"MILEAGE OUT\" OF 251.    SERVICE INVOICE NUMBER 784852 STATES THAT THE ECU WAS CALIBRATED AND RESET.     UPON DRIVING THE VEHICLE IT BECAME OBVIOUS THAT THE PROBLEMS WERE NO DIFFERENT AND PERHAPS WORSE. ON MARCH 1, 2019 I RETURNED THE VEHICLE TO THE DEALER AND TOOK THE SERVICE MANAGER AND A TECH-EXPERT FOR A RIDE. THE TECH ACKNOWLEDGED THE STALL AND LURCH PHENOMENON AND SAID HE \"HAS DEALT WITH THIS BEFORE\".     THE TECH AND THE SERVICE MANAGER TOLD ME THEY WERE OPENING A CASE WITH TOYOTA FOR POSSIBLE INPUT TO RESOLVE THIS PROBLEM.    I BELIEVE THIS A SERIOUS POTENTIAL SAFETY ISSUE AS THE FORWARD LURCHING OF THE VEHICLE COULD RESULT IN SERIOUS INJURY AS A RESULT VEHICLE DESIGN AND ENGINEERING. OTHER TOYOTA OWNERS HAVE DISCUSSED THIS PROBLEM VIA INTERNET FORUMS. IT WOULD APPEAR TO AFFECT 2018 & 2019 SIENNAS WITH \"THROTTLE BY WIRE\" DESIGN AND THEIR 8 SPEED TRANSMISSION.",
        "vin": "5TDKZ3DC1KS"
    }
]