[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/01/2022",
        "dateOfIncident": "04/01/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459236,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 TOYOTA TUNDRA. CONSUMER WRITES IN REGARDS TO MISSISING BRAKE SENSOR.",
        "vin": "5TFEM5F1XKX"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/11/2021",
        "dateOfIncident": "02/13/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443484,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Pre collison warning system has turned itself off in the rain and states visit dealer for service. Never logs data and on when you get to dealer. Same system has also flash \"Brake\" on the highway at 65 mph when a dry sunny day and no cars around. I am worried it may actually brake by accident causing loss of control. Went to dealer on both occasions and because it doesn't log the data there was nothing they could do. Did my own research and there was a technical service bulletin for certain VINS (not mine) to \"repair\" this module behind the grill. It was done to my truck but not by my dealership before I took ownership. It should not have been done and Route 44 toyota just did nothing. I asked for a replacement and they wouldn't because there wasn't any codes listed to warrant it because the TSB wasn't for my truck even though someone did it. On their TSB it recommends replacement for my current issues but they wouldn't do it.",
        "vin": "5tfby5f13kx"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/19/2021",
        "dateOfIncident": "11/17/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441054,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "My son was driving to Mineral Wells to get something to eat on Wednesday 11/17/21 at 8:00 at night on FM 52 South.  All of a sudden the steering wheel falls in his lap.  He picked it up and shoved it onto the column and was able to steer the truck onto the side of the road without hitting anything.  He looked underneath the steering wheel assembly and 2 of the 4 ubolts where missing.  Where did they go - if they were ever there in the first place.  The steering wheel has had some vibration and we have had the truck front end aligned and the wheels balanced.  I had it in not long ago for an inspection/oil change/tire rotation.  After I left the dealership the wheel felt a little loose and there was some vibration but I thought it was the road and it did stop vibrating.  I also drive a Prius and I thought maybe I'm just not used to the way the truck feels.  I told my son when I got home that it felt loose and he said he would keep an eye on it.  Then Wednesday night the steering wheel falls off and the whole column falls out.  What is this?  I also drive the truck and I do not think I would have had #1 - the strength to pick the wheel up and force it back onto the column or #2 - the sense to even do that.  I would have had an accident.  The Shottenkirk dealership does not want to deal with the problem even though I have an extended warranty so today Freeman Toyota calls me and they are picking up the truck and will be doing the repair work. Bottom line - my son could have been killed or injured, I drove the truck Monday in Ft. Worth going 70+mph and I could have been killed or injured. How does a steering wheel/steering column loose ubolts and falls off/collapses?",
        "vin": "5TFDW5F12KX"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/08/2021",
        "dateOfIncident": "09/08/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432219,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "3 times in the last few mos the BRAKE! warning came on. Nothing was causing this warning to engage. This happened again today. Another issue is when the Valdosta Toyota (GA) dealer attempted to fix the fuel pump recall on 22 JUL 2020 it was assembled incorrectly. I called the dealership and told them to come and get my Tundra because gas was dripping onto my driveway. They sent a tow truck and it was supposedly fixed and they brought it back to me in about 2 hrs. It really does run the way it did before they “re-fixed” it. Very often now when it is driving I feel something like a failing fuel pump. It fades away but it is not comfortable taking it long distances. It feels like there is a clog in the fuel system or something, although there is not. I have 33,400 miles on it today and I can’t help but wonder if Valdosta Toyota didn’t just exchange the original fuel pump with a different used one?",
        "vin": "5TFEY5F14KX"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "05/26/2021",
        "dateOfIncident": "05/22/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418682,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Toyota Safety Sense (TSS) malfunctions sporadically while driving. Warning lights illuminate and Dynamic Radar Cruise Control (DRCC) disengages when activated while driving. The Pre-Collision System (PCS) is turned off and flashes with the following error messages. - Pre-Collision System Malfunction - Visit Your Dealer - Auto Headlight System Malfunction - Visit Your Dealer - LDA Malfunction - Visit Your Dealer This has happened twice, first right after purchasing the vehicle brand new in 2019 and most recently last week on 5/22/2021. I took the vehicle into the dealer on 5/25/2021 and they seemed aware of this issue, but stated they could not reproduce it and there were no error codes logged. I showed them the video of this happening (link below) while driving through Nevada. I was told the errors will not disable the vehicle or put it into limp mode, but my concern is when this happens while using DRCC, which almost made me drive into the back of a tractor trailer on Interstate 80. The speed limit on I-80 in Nevada is 80 MPH. https://drive.google.com/file/d/1WrxgM8SJeB02eO4a6E9tbyCeAr6gRRHs/view?usp=sharing",
        "vin": "5TFDY5F14KX"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/05/2021",
        "dateOfIncident": "02/05/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394866,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK STALLING WHILE DRIVING ON HIGHWAY. THIS IS THE 3RD TIME THIS HAPPENED BUT WHAT SCARED ME THIS TIME IT SHUT OFF WHILE DRIVING. VERY HAZARDOUS AND ALMOST CAUSED A BAD ACCIDENT.",
        "vin": "5TFDY5F13KX"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/08/2021",
        "dateOfIncident": "12/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387178,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA TUNDRA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT STATED THAT THE VEHICLE EXPERIENCED THE FAILURE STATED IN THE RECALL SUMMARY WITH SEVERAL UNKNOWN WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS TAKEN TO QUALITY TOYOTA LOCATED AT 1125 W. LINCOLN AVE, FERGUS FALLS, MN 56537, (218)998-1900 WHERE THE DEALER CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 8,500. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TFBY5F19KX"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/05/2021",
        "dateOfIncident": "01/04/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386556,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE REQUIRES MULTIPLE RESTART ATTEMPTS AND THE ENGINE RUNS ROUGH. WARNING LIGHTS AND CHECK ENGINE LIGHT ILLUMINATED ON INSTRUMENT PANEL. LOSS OF POWER AND STALLING HAS OCCURRED WHILE DRIVING. SYMPTOMS OCCURRED MULTIPLE TIMES SINCE VEHICLE PURCHASE.",
        "vin": "5TFDW5F12KX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/28/2020",
        "dateOfIncident": "10/28/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385318,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA TUNDRA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V682000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TFEM5F19KX"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/20/2020",
        "dateOfIncident": "09/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11365455,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE ROAD ON THE FREEWAY WHERE THE SPEED LIMIT WAS 75 MPH. WHILE DRIVING MY PASSENGER SAID I PASSED OUT, FLOORED THE GAS PEDAL AND JERKED THE STEERING WHEEL TO THE LEFT. I THEN DROVE THROUGH THE MEDIAN AND INTO ONCOMING TRAFFIC REACHING 90 PLUS MPH, MISSING TWO CARS, AND JUMPING A 4 FOOT BARBED WIRE FENCE WITHOUT TOUCHING THE FENCE. I CONTINUED INTO THE DESERT UNTIL MY PASSENGER WAS ABLE TO PUT THE TRUCK IN PARK HITTING A FEW TREES AND BUSHES ALONG THE WAY. I THEN WOKE UP WHEN PARAMEDICS AND FIRST RESPONDERS WERE ALREADY THERE. ME AND THE PASSENGER WERE BOTH WEARING OUR SEATBELTS AND MY PASSENGER DID NOT AQUIRE ANY INJURIES. I HAD A SIEZURE TO CAUSE THE ACCIDENT AND HAVE HAD MULTIPLE ONES SINCE THEN A MONTH AGO. THE FRONT OF MY TRUCK WAS MANGLED AND THE FRAME WAS BENT IN TWO PLACES. THE ISSUE IS I SUFFERED 4 FRACTURES IN MY SPINE TOP OF THE LUMBAR AND BOTTOM 3 OF MY THORASIC. I AM CURIOUS AFTER TALKING TO THE MECHANIC WHO LOOKED OVER MY TRUCK AS TO WHY MY AIRBAGS DID NOT DEPLOY DURING THE ACCIDENT. IN SUMMARY I WAS IN AN ACCIDENT THAT TOTALED MY TRUCK, AND THE AIRBAGS DID NOT DEPLOY AND I SUFFERED MULTIPLE SPINAL FRACTURES.",
        "vin": "5TFDY5F13KX"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/10/2020",
        "dateOfIncident": "08/10/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348371,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2019",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Michelin North America, Inc.",
                "productMake": "MICHELIN NORTH AMERICA",
                "productModel": "LTX A/T 2",
                "productYear": "9999",
                "size": "LT 275/70R18",
                "type": "Tire"
            }
        ],
        "summary": "VIBRATION IN TIRES COULD NOT BE BALANCED.  THREE COMPLETE SETS(4) AND TWO REPLACED RECENTLY.  I KEPT THE TIRES",
        "vin": "5TFHY5F18JX"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/09/2020",
        "dateOfIncident": "05/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338340,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2019 TOYOTA TUNDRA.  MY HANDS FREE BLUETOOTH BEGAN DISCONNECTING AND RESTARTING MY RADIO.  I THOUGHT IT WAS MY IPHONE 8 SO I BOUGHT A BRAND NEW PHONE IPHONE XR.  STILL DISCONNECTING FROM HANDSFREE.  I TOOK MY TRUCK TO MY LOCAL DEALER AND THEY TOLD ME ITS A KNOWN ISSUE AND TO BUY AN ANDROID PHONE.  I HAVE ALSO CONTACTED TOYOTA'S 1-800-331-4331 CUSTOMER SERVICE (CASE NUMBERS [XXX] & [XXX]) THEY TOO TELL ME ITS A KNOWN ISSUE AND THEY ARE PUTTING IT OFF ON APPLE.  I LIVE IN A HANDS FREE STATE AND CANNOT USE MY MY BLUETOOTH.  TOYOTA NEEDS TO FIX THIS FOR SAFETY PURPOSES AND TICKETING PURPOSES!  I'VE FOUND MANY OTHER TOYOTA OWNERS REPORTING THE SAME THING ON TOYOTA FORUMS.  MY TRUCK IS STILL UNDER WARRANTY AT THE LEAST THEY NEED TO INSTALL AN UP TO DATE STEREO TO MAKE IT WORK ON MY BLUETOOTH.  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "5TFDY5F18KX"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/14/2020",
        "dateOfIncident": "05/30/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328742,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "APPARENLY THE STARTER KEEPS CONNECTED TO THE MOTOR AND THE MOTOR DOES NOT TURN ON. THIS HAS HAPPENED ON SEVERAL OCASSIONS AND THE TUNDRA IS NOW AT THE TOYOTA DEALER WAITING FOR A SOLUCTION FROM TOYOTA.  THE DASH INDICATES NOT READY TO DRIVE AND IT ALWAYS HAPPENS WHEN THE VEHICLE IS STATIONARY.",
        "vin": "5TFRM5F10KX"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/15/2020",
        "dateOfIncident": "05/05/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324704,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "RADAR SENSOR ON THE FRONT OF THE TRUCK WAS PREVIOUSLY BROUGHT INTO THE DEALERSHIP PURSUANT TO A RECALL.  MONTHS LATER THE RADAR SENSOR IS AUTOMATICALLY BRAKING, WHILE I AM DRIVING, WITHOUT ANY VEHICLE OR OBSTACLE IN FRONT OF MY TRUCK.  THIS HAD HAPPENED TWICE IN THE PAST COUPLE OF MONTHS.  DATE BELOW IS AN ESTIMATE OF THE MOST RECENT EVENT.  *TR",
        "vin": "5TFHY5F16KX"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/04/2020",
        "dateOfIncident": "04/24/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323249,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I LINK MY NEW IPHONE11 PRO MAX TO THE RADIO IT TURNS THE RADIO OFF THEN BACK ON AND IT REPEATS UNTIL I DISABLE THE BLUETOOTH ON MY PHONE. THIS IS A SAFETY HAZARD AS I CAN NOT BE HANDS FREE ON MY PHONE.",
        "vin": "5TFHY5F10KX"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/08/2020",
        "dateOfIncident": "02/24/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320603,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA TUNDRA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V012000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. DURANGO MOTOR COMPANY (1200 CARBON JCT, DURANGO, CO 81301), CONFIRMED PARTS WERE NOT AVAILABLE FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TFUY5F16KX"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/05/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316461,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I DO NOT HAVE ANY ISSUES BUT I CONCERN IN REGARDS TO THE TOYOTA MOTOR RECALLED OF VEHICLES' FUEL PUMPS ISSUE THAT MY 2019 TUNDRA IS ON THE RECALLED.",
        "vin": "5TFHY5F18KX"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/15/2020",
        "dateOfIncident": "01/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309395,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AT 55 MPH ON A DARK ROAD WITH NO SHOULDER WHEN THE TRUCK BEGAN SHAKING VIOLENTLY IN THE MIDDLE OF A BANKER LEFT TURN. HAD DRIVEN APPROXIMATELY 2 MILES FROM HOME WHEN PROBLEM SUDDENLY OCCURRED. OVERWHELMING SMELL OF BURNING BRAKES OUTSIDE WHEN I OPENED THE DOOR AND THE REAR DRIVER SIDE WHEEL WAS HOT. TRUCK TOWED TO DEALERSHIP THE NEXT DAY FOR DIAGNOSIS/REPAIR. DEALER DETERMINED PARKING BRAKE ADJUSTMENT PERFORMED AT 5,000 MILE SERVICE WAS IMPROPERLY DONE. THEY ADJUSTED PARKING BRAKE AND RELEASED VEHICLE. DROVE APPROXIMATELY 5 MILES DOWN FREEWAY AND SAME PROBLEM OCCURRED AFTER EXITING FREEWAY (AFTER A BANKED RIGHT TURN), BUT I COULD HEAR BRAKES SCREECHING THIS TIME. SMELLED BURNING BRAKES AND REAR PASSENGER WHEEL WAS HOT. RETURNED TO DEALERSHIP FOR FURTHER SERVICE AND TRUCK DRIVE NORMALLY EXCEPT FOR PERSISTENT BRAKE SQUEAK. DEALER REPLACED BRAKES AND RESURFACED ROTORS LAST WEEK. ISSUE HAS NOT OCCURRED AGAIN AS OF THIS DATE.",
        "vin": "5TFHY5F17KX"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/29/2020",
        "dateOfIncident": "01/29/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302902,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FLASHING FRONT AMBER TURN SIGNAL LIGHTS ARE NOT ADEQUATELY VISIBLE TO OTHER DRIVERS WHEN DRL OR HEADLIGHTS ARE ON. DUE TO THIS OTHER DRIVERS OFTEN DON'T SEE TURN SIGNAL FROM THE FRONT OF THE VEHICLE.",
        "vin": "5TFUY5F11KX"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/31/2019",
        "dateOfIncident": "10/29/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277396,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA TUNDRA. WHILE DRIVING APPROXIMATELY 70 MPH, AN EXPLOSION WAS HEARD. THE VEHICLE WAS PULLED OVER AND THE CONTACT NOTICED THAT THE SUN ROOF EXPLODED WITHOUT AN IMPACT OR WARNING. THERE WERE NO INJURIES. THE CONTACT CALLED OAKBROOK TOYOTA AT 630-789-9600 (LOCATED AT 550 E OGDEN AVE, WESTMONT, IL 60559) AND WAS INFORMED THAT THE FAILURE HAD TO BE CAUSED BY SOMETHING STRIKING THE SUN ROOF. THE DEALER DENIED ALL RESPONSIBILITY. THE MANUFACTURER WAS CALLED, BUT THERE WAS NO RESPONSE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 4,800. *LN",
        "vin": "5TFAY5F14KX"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/12/2019",
        "dateOfIncident": "10/11/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268048,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING WITH CRUISE CONTROL AT 30 MPH, THE ENGINE LIGHT TURNED ON , AND  SUDDENLY THE ENGINE SHUT DOWN, NO BRAKES AND NO POWER STEERING. I WENT TO TURN RIGHT AT THE NEAREST AVAILABLE SIDE STREET SO I WOULD GET OUT OF THE WAY OF TRAFFIC.  AS I WAS TRYING TO TURN RIGHT, THE STEERING WHEEL WAS VERY HARD TO TURN AND I ENDED UP ON THE WRONG SIDE OF ROAD AND IMPEDING TRAFFIC.  LUCKILY THE ROAD WAS SLIGHTLY UPHILL AND THE TRUCK WAS ABLE TO COME TO A STOP.  I THEN APPLIED THE EMERGENCY BRAKE AND TURNED THE KEY TO THE OFF POSITION.  I TRIED RESTARTING THE TRUCK TO GET IT OUT OF THE OPPOSITE SIDE OF THE ROAD AND AT THAT TIME IT CRANKED AND IT HAD A STALLED RUBBLE SOUND FOR ABOUT 3 SECONDS AND THEN SHUT DOWN AGAIN.  AT SOME POINT THE TRANSMISSION BECAME LOCKED AND THE TOW TRUCK DRIVER HAD TO USE THE SHIFT LOCK RELEASE TO GET IT ON THE FLATBED.",
        "vin": "5TFFY5F18KX"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/01/2019",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265465,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE #4157 INCANDESCENT TURN SIGNAL BULBS ON THE FRONT OF THE TRUCK ARE FAR TOO DIM AND GET DROWNED OUT BY THE LED DAYTIME RUNNING LIGHTS AND LED HEADLIGHTS. THEY ARE ALSO TOO FAR BACK IN THE HEAD LIGHT HOUSING TO BE SEEN FROM THE OPPOSITE SIDE OF THE VEHICLE. THESE ARE THE ONLY FRONT TURN SIGNALS SINCE THERE ARE NONE IN THE MIRRORS. ALL TURN SIGNAL BULBS AND BRAKE LIGHT BULBS SHOULD BE LEDS. HTTPS://YOUTU.BE/HUAOTOB6C_S",
        "vin": "5TFDY5F16KX"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/10/2019",
        "dateOfIncident": "09/10/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254513,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 40 MPH THE WARNING LIGHT 'ACCELERATOR AND BRAKE PEDALS DEPRESSED SIMULTANEOUSLY ' CAME ON AND THE TRUCK SLOWED DOWN SIGNIFICANTLY, WHICH ALMOST CAUSED AN ACCIDENT.  THE BRAKE PEDAL WAS NOT BEING USED WHILE DRIVING.",
        "vin": "5TFHY5F19KX"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/07/2019",
        "dateOfIncident": "06/07/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242225,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA TUNDRA. WHEN THE CONTACT DIMMED THE HEADLIGHTS, THERE WAS LIMITED VISIBILITY. THE CONTACT WAS UNABLE TO SEE MUCH FURTHER BEYOND THE HOOD. THE CONTACT DESCRIBED THE CONDITION AS BEING SIMILAR TO HAVING A BRICK WALL IN FRONT OF HIS VEHICLE, BLOCKING THE HEADLIGHTS. THE VEHICLE WAS TAKEN TO DICK DYER TOYOTA (240 KILLIAN COMMONS PARKWAY, COLUMBIA, SC 29203, (803) 786-4111) WHERE IT WAS DETERMINED THAT THE HEADLIGHTS WERE IN THE SPECIFICATIONS FOR PARTS. THE DEALER ONLY TESTED THE VEHICLE DURING THE MORNING RATHER THAN AT NIGHT WHEN THE TESTING WAS NEEDED. THE MANUFACTURER WAS CONTACTED AND PROVIDED A CASE NUMBER. THE MANUFACTURER CALLED THE DEALER AND CONFIRMED THAT EVERYTHING WAS OK. THE FAILURE MILEAGE WAS 3,500.",
        "vin": "5TFDW5F11KX"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/07/2019",
        "dateOfIncident": "08/05/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11242251,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE PARKED ON BOAT LAUNCHING RAMP 25-30% SLOPE CONCRETE SURFACE WITH 24 FOOT ALUMINUM TRAILER IN TOW; BOAT OFF TRAILER, TRUCK FACING AWAY FROM WATER, TRAILER CLOSEST TO WATER.  SUNNY, RAMP WAS DAMP, WITH SOME WOOD AND AQUATIC VEGETATION ON RAMP.  VEHICLE WAS IN 2 WHEEL DRIVE.  AFTER UNLOADING BOAT USING A LAUNCH CORD AND PULLING BOAT ONTO RAMP, DEPRESSED BRAKE AND MOVED SHIFTER FROM DRIVE TO PARK.  PARK ENGAGED AND STEPPED FROM VEHICLE WHEN TRUCK BEGAN TO ROLL BACKWARD.  LUNGED INTO CAB, SAW SHIFTER WAS NOW IN NEUTRAL! WAS ABLE TO REACH SHIFTER AND ATTEMPTED TO PUT INTO PARK.  GEAR SHIFT MOVED TO PARK BUT VEHICLE CONTINUED TO ROLL AND I HEARD AN AUDIBLE CLICKING FROM TRANSMISSION AREA.  TRUCK (AND ME) CONTINUED BACKWARD INTO LAKE, ALMOST DROWNED BUT FOR HELP OF A GOOD SAMARITAN ON SHORE.  WHEN TRUCK RECOVERED IT WAS IN PARK, WRECKER OPERATOR HAD TO MANUALLY BYPASS THIS TO LOAD ON FLATBED.  MY PRIOR 2019 TUNDRA CREW CAB DID SAME THING I CANNOT BELIEVE THIS HAPPENED.  IN 2007 ON YOUR SITE SOMEONE REPORTED SAME TUNDRA ISSUE UNDER CONTROLLED CONDITIONS.  SOMETHING IS WRONG WITH THIS TRUCK'S TRANSMISSION.  NEVER HAPPENED UNDER ANY OTHER CIRCUMSTANCES BUT I ASSURE YOU IT IS GOING TO RESULT IN SOMEONE DYING I ALMOST DID.  BOTH CLAIMS HANDLED BY USAA INSURANCE, DATE OF ACCIDENT MONDAY, 5 AUG,",
        "vin": "5TFBY5F15KX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/24/2019",
        "dateOfIncident": "03/13/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234335,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR AXLES AREN'T THE PROPER FIT, CAUSING THEM TO SHAKE WHICH CAUSES THE ROTORS TO VIBRATE THAT PRODUCES AN SQUEAKY/STRETCHING NOISE WHEN BRAKING. WAS ORIGINALLY TOLD IT WAS NORMAL UNTIL I CONTACTED TOYOTA CUSTOMER CARE. SERVICE TECHS STATES THAT 'IT'S SAFE TO DRIVE' BUT I DIDN'T TRUST IT. MY TRUCK ISN'T THE ONLY TRUCK, THERE ARE SERVAL MORE THAT  MAKING THIS SAME EXACT NOISE. ABOUT TO TURN MY TRUCK BACK IN TO TOYOTA UNDER THE LEMON LAW.",
        "vin": "5TFRM5F17KX"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/04/2019",
        "dateOfIncident": "04/16/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217845,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA TUNDRA. WHILE THE CONTACT WAS LOADING WOOD INTO THE VEHICLE, THE BED CAVED IN ON THE VEHICLE. SHORTLY AFTER, THE TAILGATE FRACTURED. THE BODY OF THE VEHICLE COULD BE PUSHED IN BY HAND. THE VEHICLE WAS TAKEN TO L AND S TOYOTA (248 AUTO PLAZA DRIVE, BECKLEY, WV 25801, (304) 252-8548) WHERE IT WAS DIAGNOSED THAT A NEW BED LINER NEEDED TO BE INSTALLED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE, BUT NO ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS 2,000. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/14/2019",
        "dateOfIncident": "05/14/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207751,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 TOYOTA TUNDRA. CONSUMER WRITES IN REGARDS TO POOR CRASH TEST RATING. *LD    *JS",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/11/2019",
        "dateOfIncident": "04/09/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195636,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "LESS THAN 3000 MILES WHEN INCIDENT HAPPENED.    WHILE DRIVING AT 55 MPH ON A HIGHWAY THE DASH SCREEN SAID BRAKE AND A CHIME WAS HEARD. IT WAS LATE EVENING 3 DAYS AGO AND THEIR WAS ABSOLUTELY NO OTHER VEHICLES AROUND ME. MY INITIAL REACTION WAS TO BRAKE HOWEVER I DID NOT. IT ALSO HAPPENED TWO ADDITIONAL TIMES AT ABOUT 45 MPH ON THE FINAL FEW MILES FROM MY HOME.    THE INDICATOR DID NOT STAY ON LONG ENOUGH TO GET A PHOTO OF IT.    WHEN I RETURNED HOME I FILED A CASE WITH TOYOTA USA. I THEN CALLED THEM THE NEXT DAY. TODAY I CONTACTED THE DEALER ABOUT TAKING IT IN FOR THE TO CHECK. AT THAT TIME THE SERVICE REP ADVISED ME THERE IS A RECALL ON THE PART SENSOR ON THE ANTI COLLISION AVOIDANCE SYSTEM.     I RECEIVED AN EMAIL REPLY FROM TOYOTA USA HOWEVER THE REPLY DID NOT PROVIDE ME WITH ANY INFORMATION , OTHER THAN THE CASE WAS GOING TO BE ENTERED INTO THEIR DATABASE.     THEY WILL PLACE A FOAMY TAPE ON THE BACK OF THE SENSOR AFTER RUNNING A DIAGNOSTIC ON IT. THIS SEEMS A BIT UNDER DONE AND A BAND AID FOR WHAT COULD BE A SAFETY HAZARD. IF IT IS A WATER ISSUE (NO RAIN ON THE DAY IT HAPPENED AND DIDN'T HAPPEN ON THE WAY TO MY DESTINATION)    I RESEARCHED THE VIN FOR THE RECALL AND I RECEIVED \"THERE IS NO RECALL ASSOCIATED WITH MY VIN, ANSWER.    HOPEFULLY THE NHTSA WILL DO A SIMPLE WEBSITE SEARCH AND SEE THE NUMBERS OF PEOPLE HAVING THIS ISSUE. I PREFER NOT TO HAVE ANY SAFETY ISSUES WHILE TRANSPORTING MY FAMILY IN THE VEHICLE.",
        "vin": "5TFDY5F1XKX"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/20/2019",
        "dateOfIncident": "03/13/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190254,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA TUNDRA. WHILE DRIVING 65 MPH, THE SUN ROOF EXPLODED WITHOUT IMPACT. THERE WERE NO INJURIES. THE VEHICLE WAS TAKEN TO BIG TWO TOYOTA OF CHANDLER (1250 S GILBERT RD, CHANDLER, AZ 85286) AND THE CONTACT WAS INFORMED THAT THEY WOULD REPLACE THE SUN ROOF. THE MANUFACTURER WAS NOT CONTACTED. THE VEHICLE WAS NOT REPAIRED. THE VEHICLE WAS CURRENTLY AT THE DEALER. THE FAILURE MILEAGE WAS 5,142.",
        "vin": "5TFHY5F15KX"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/15/2019",
        "dateOfIncident": "02/15/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180222,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "PCS SYSTEM ON 2019 TOYOTA DISPLAYS THAT THE SYSTEM IS \"ON\" BUT THE ICON ON THE DASH SHOWS \"OFF\". I HAVE PICS TO PROVIDE PROOF. BEEN HAPPENING BEFORE THE FIRST SRVC ON THE TRUCK. WHEN IN DURING SRVC TO EXPLAIN, DEALERSHIP DIDN'T FIND PROBLEM. LEFT AND IT CAME BACK ON AGAIN. SINCE THE 5K SRVC THIS HAPPENS PRETTY MUCH DAILY, I'M NOT SURE IF THE PCS IS GOING TO WORK OR NOT AS I HAVE BECOME LEARY OF THIS FEATURE BEING A SAFETY FEATURE AND MORE OF AN ANNOYANCE WITH TOYOTA NOT TAKING OWNERSHIP IN CORRECTING IT. MULTIPLE FORUMS ON THIS SUBJECT HAVE BEEN DOCUMENTED AND OTHER CASES HAVE BEEN STARTED AT NHTSA FOR THIS SAME CONTINUED PROBLEM. A SAFETY FEATURE THAT DOESN'T WORK ISN'T A SAFETY FEATURE; IT'S A DISASTER WAITING TO HAPPEN.",
        "vin": "5TFFY5F12KX"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/09/2019",
        "dateOfIncident": "02/09/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11175851,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING WITH THE ADAPTIVE CRUISE CONTROL SET A MESSAGE WILL APPEAR \"RADAR CRUISE CONTROL UNAVAILABLE CLEAN SENSOR\". THIS MESSAGE WILL APPEAR WITH NO ADVERSE WEATHER CONDITIONS. DUE TO THIS ERROR THE CRUISE CONTROL NO LONGER WORKS AND THE PRE-COLLISION WARNING SYSTEM NO LONGER WORKS. ALSO RANDOMLY A \"BRAKE!\" MESSAGE WILL APPEAR AND THE VEHICLE AUTOMATICALLY SLAMS ON THE BRAKES WHEN NO EMERGENCY EXISTS CREATING A HAZARD FOR VEHICLES BEHIND.",
        "vin": "5TFHY5F1XKX"
    }
]