[
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/21/2022",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457583,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Volkswagen Tiguan. The contact stated that while his wife was driving approximately 55 MPH, the vehicle lost motive power and stalled with several unknown warning lights illuminated. Since the initial failure, the failure occurred intermittently and the vehicle would restart soon after failure. The contact had taken the vehicle to a dealer however, the mechanic was unable to diagnose or duplicate the failure. The manufacturer was not notified of the failure. The vehicle was not repaired. The failure mileage was approximately 4,000.",
        "vin": "3VV2B7AX0KM"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/19/2022",
        "dateOfIncident": "01/07/2022",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457427,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "My Tiguan is doing the same thing as the Atlas. I have been told by the Dealer and the Vw representative that did a physical inspection of my vehicle. That the issues are the same. I was doing 70 mph on the highway all the dash lights went on and then the breaks engage bring my vehicle to a complete stop. This was in March of 2021. Vehicle was taken straight to dealer I was told then what was happening. And was told the issed was resolved. Then in  January 2022 the vehicle did the same thing once at a low speed, and again that same morning going 30 mph, were the truck behind us did everything he could to avoid hitting the vehicle as my vehicle came to a complete stop. I was the front car and thankfully the truck behind me was the only other vehicle on the road. I pulled in to a parking lot, I attempted to back up and the vehicle would not go in to reverse. I had to have my vehicle towed to the dealership where has sat since January. They have not been able to repair the unit. As they are waiting for a wire harness for the door.  Vw corporate has been notified and is not been helpful at this point.",
        "vin": "3vv3b7ax0km"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/21/2022",
        "dateOfIncident": "02/16/2022",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453255,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "1. Seat belt in middle row. Seat belt will not retract. 2.electric system. Driver door contact switch, car still running, electric brake, drive window will not roll up, passenger window on left side will not roll up, driver door will not unlock.",
        "vin": "3VV3B7AX4KM"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/21/2022",
        "dateOfIncident": "02/21/2022",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453315,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving on clear road with sunny skies when vehicle break system warning light came on and vehicle suddenly and without warning began breaking. The sudden breaking of the vehicle with no reason or cause surprised me and put me in a dangerous position that could have resulted in an accident. Luckily the vehicle behind me was far enough behind where it was able to break without rear ending me. There was no warning that the vehicle had sense something on the road (none which were visible to me) before slamming the breaks. I will be reporting this to the dealer, but it has occurred twice before and I’ve always been told they don’t see any issues on there side, only been told to write down time, road conditions and location where it occurred so they could look into the system next time.",
        "vin": "3vv2b7ax8km"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/28/2021",
        "dateOfIncident": "12/22/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445343,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Passenger and driver air bag lights have come on 3 times (not working). Huge safety concern",
        "vin": "3VV2B7AX5KM"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "10/24/2021",
        "dateOfIncident": "10/24/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437978,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving 25mph with no vehicles or other obstructions ahead, the vehicle forward collision warning audibly warned of an imminent crash, displayed a visible indicator on the dashboard screen, and applied strong braking force for about 2 seconds as I had been accelerating slightly. There were vehicles directly behind mine which may have collided with me if I had stopped suddenly. There was no risk of a frontal collision. This occurred as the vehicle was driving on a standard asphalt road and approached a red brick style crosswalk (there were no pedestrians). This has not been reproduced or inspected by law enforcement, a dealer, or others. There was no warning prior to this event.",
        "vin": "3VV2B7AX5KM"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/12/2021",
        "dateOfIncident": "10/12/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436492,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Automatic start/stop feature malfunctioned while vehicle was at a complete stop in a left hand turn lane at the front of an intersection. Caused major traffic jam because vehicle would not restart. No warning signals were given prior to failure, car engine simply turned completely off and dashboard message then read to \"manually restart engine\". Attempted to do so but it did not work. After that, I randomly started turning the car off and on, switching from park to drive in whatever order to try to get the engine to restart since manually restarting the \"normal\" way did not seem to work. While the car was not restarting, the yellow engine light did appear, I am not sure exactly when. No one's safety was at risk in this particular instance, however it could have been depending on when this problem occurs. It has happened twice prior to this incident but both times occurred in a parking lot, not in open traffic. Eventually, after about 5 minutes the car did restart and I was able to resume driving. The vehicle has not yet been inspected by anyone for this particular issue and therefore not reproduced or confirmed by a dealer or independent service center.",
        "vin": "3VV3B7AX9KM"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/12/2021",
        "dateOfIncident": "09/12/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432688,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Windshield washer fluid lost without using it.  Have to add a gallon of the windshield washer fluid every 4 months.",
        "vin": "3VV0B7AXXKM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/23/2021",
        "dateOfIncident": "08/20/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430149,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "We bought a new 2019 tiguan for my 16 year old daughter.  At just over 5 thousand miles, she was driving the car home from school when all the electric power was lost.  The engine kept running, but she lost all the lights, headlights, break lights, radio, ac, speedometer, etc.  Basically everything stopped working except the engine.  Obviously this was a safety concern for me because she's 16 and didn't have headlight, or break lights, or a speedometer, just to name a few.  Volkswagen dealership in mckinney, TX, began diagnosing the issue.  They changed the battery and said the car was fixed.  Unfortunately, as my now 17 year old daughter was driving, the car all the sudden lost all power again.  The danger is that the car starts and performs perfectly at first, but will shutdown everything but the engine while she's driving!  So this is the 2nd time this has happened.  The car went back to the dealership and they a \"software update\", and claimed that corrected the problem eventhough I suspect they dint truly believe they fixed it.  So my daughter starts her car and drives down the road with no problems, until, for the individual time, she loses power while driving over 50 mph.  So the car is at the dealership for a 3rd time.  The car has just over 5 thousand miles on it.  Volkswagen keeps claiming they've corrected the problem, and keeps returning an unsafe vehicle to my daughter.",
        "vin": "3VV1B7AX5KM"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/18/2021",
        "dateOfIncident": "08/16/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429634,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I was involved in a collision where I hit another vehicle with the front passenger side. The air bags did not deploy on mine, and the seat belt did not lock into place causing me to hit the steering wheel. The police verified this upon inspection immediately after the accident happened. I have spoken with Volkswagen many times about the transmission lagging and requiring excessive acceleration. Because of the lag I have almost been hit many times, as well as almost hit others due to the increase in speed after the lag.",
        "vin": "3VV2B7AX8KM"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "07/08/2021",
        "dateOfIncident": "04/14/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424005,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Front assist goes off for no reason engaging the brakes. Dealership told me to turn it off and fill out reports if it continues to happen. Filled out reports with photos and returned after having my vehicle for over a month they state that the front assist engaging for no reason is normal operation.",
        "vin": "3VV2B7AX3KM"
    },
    {
        "components": "STRUCTURE,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "05/06/2021",
        "dateOfIncident": "04/23/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415365,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DOOR LATCH MALFUNCTIONS REQUIRED MULTIPLE VISITS TO MECHANIC TO DIAGNOSE. LOCKED AND UNLOCKED RANDOMLY. AS IN WOULD LOCK ME OUT OR IN THE VEHICLE REQUIRING I USE AN ALTERNATE DOOR (NOT DRIVER DOOR) TO EXIT MY VEHICLE.     EMERGENCY BREAK ASSIST ENGAGES IN GUTTERS AND DRIVEWAYS. ESSENTIALLY ANYTHING THAT ISN'T FLAT TERRAIN MAY RESULT IN THE TIGUAN SLAMMING ON THE BREAKS FOR YOU COMING TO A COMPLETE STOP. EVEN WHEN APPROACHING DIPS, GUTTERS,  DRIVEWAYS  OR DIFFERENT INCLINES YOU HAVE A VERY LIKELY CHANCE OF THE EMERGENCY SYSTEM ENGAGING BREAKS.",
        "vin": "3VV2B7AX2KM"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/16/2021",
        "dateOfIncident": "02/02/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408417,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A SECOND COMPLAINT ABOUT THE HEADLIGHTS ON MY VEHICLE. THE LOW BEAMS DO NOT ILLUMINATE THE ROADWAY SAFELY.  I COMPLAINED TO THE MANUFACTURER WHO REFERRED ME TO THE DEALER. WHO STATED THAT THERE IS NO ADJUSTMENT THAT CAN BE MADE. PER THE DEALERS DESCRIPTION  THE VEHICLE ONLY UTILIZES ONE BULB FOR HIGH AND LOW BEAMS. THERE IS A SHIELD THAT COMES DOWN TO CREATE THE LOW BEAMS. WITH THAT BEING SAID, IN THE LOW BEAM POSITION THE SHIELD CREATES DISTINCT LINE THAT ONLY ILLUMINATES A SHORT DISTANCE OF ROAD IN FRONT OF THE VEHICLE. THIS ALSO CREATES A WALL OF DARKNESS BEYOND THAT. NO DIFFUSION OF LIGHT JUST GOING INTO THE DARKNESS BLIND. THIS TO ME IS A VERY DANGEROUS SITUATION..",
        "vin": "3VV4B7AX4KM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/08/2021",
        "dateOfIncident": "02/28/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407117,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 VOLKSWAGEN TIGUAN. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE WOULD BLOW HOT AIR. THE CONTACT HAD TAKEN THE VEHICLE TO HARPER VOLKSWAGEN (9901 KINGSTON PIKE, KNOXVILLE, TN 37922) WHERE THE TECHNICIAN INSPECTED THE A/C UNIT AND FOUND NO FAULT WITH THE SYSTEM. AS THE FAILURE CONTINUED, THE CONTACT TOOK THE VEHICLE BACK TO THE DEALER WHERE SHE WAS INSTRUCTED TO PURCHASE A THERMOMETER AND KEEP TRACK OF THE TEMPERATURE READINGS INSIDE THE VEHICLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE WHERE SHE WAS INFORMED THAT THEY STOOD BEHIND THE DIAGNOSTIC OF THE MECHANIC AND OFFERED NO FURTHER ASSISTANCE. THE CONTACT ALSO SENT AN EMAIL TO THE MANUFACTURER DOCUMENTING THAT THE TEMPERATURE READING INSIDE THE VEHICLE WAS ABOVE NORMAL. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 2,742.*DT*DT*DT  THE CONSUMER STATED THE VEHICLE WAS TAKEN TO A LOCAL FIRE DEPARTMENT WHERE IT WAS DETERMINED THE AIR FROM THE VENT REACHED 180 DEGREES.",
        "vin": "3VV0B7AX6KM"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/18/2021",
        "dateOfIncident": "02/18/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396852,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE WAS PARKED IN A SLIGHTLY SLOPED DRIVEWAY AND TURNED OFF. AFTER 2 MINUTES, CAR WENT BACK APPROX. 100 FEET  THROUGH WALKWAY AND ENDED UP IN THE MIDDLE OF MAIN ROAD. THIS IS A SERIOUS MALFUNCTION OF THE VEHICLE AS IT CAN CAUSE INJURY TO SOMEONE. WHEN CALLED THE CUSTOMER SERVICE CENTER, THE REP SAYS THERE IS A RECALL ON ENGINE AND TRANSMISSION CONTROL SOFTWARE UPGRADE BUT I WAS NOT NOTIFIED ABOUT THIS RECALL. IN ADDITION, ON THE NTHSA WEBSITE IT SAYS THE UPGRADE IS FOR \"UPDATE TO ADDRESS ELEVATED TAILPIPE EMISSIONS THAT WERE FOUND DURING VEHICLE TESTING\".",
        "vin": "3VV1B7AX7KM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/02/2021",
        "dateOfIncident": "02/02/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394236,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 VOLKSWAGEN TIGUAN. CONSUMER WRITES IN REGARDS TO ISSUES WITH AUTOMATIC BRAKING SYSTEM. *LD    THE CONSUMER STATED THE AUTOMATIC BRAKING SYSTEM WAS OVERLY SENSITIVE AND DISTRACTING. THE CONSUMER STATED TWICE THE VEHICLE SHUT DOWN. THE CONSUMER STATED THE AUTOMATIC BRAKING SYSTEM GENERAL ACTIVATES WHEN BACKING OUT OR IN A DRIVE THRU. THE DEALER WAS CONTACTED AND STATED THE VEHICLE OPERATED AS DESIGNED.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/29/2021",
        "dateOfIncident": "02/02/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390648,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS ARE LED AND THIS VEHICLE IS EQUIPPED WITH AFS. ADAPTIVE FRONT LIGHTING SYSTEM. I BELIEVE THE HEADLIGHTS DO NOT ILLUMINATE THE ROADWAY ADEQUATELY. THERE IS AN AREA THAT IS JUST IN FRONT OF THE VEHICLE THAT ONE CAN SEE THE ROADWAY. THEN THERE IS A DEFINITE LINE THAT BASICALLY CREATES A WALL OF DARKNESS, THAT PREVENTS ONE FROM SEEING ANYTHING BEYOND THAT, THIS CREATES A BLIND AREA. ANY OTHER VEHICLES THAT I HAVE DRIVEN OVER THE YEARS PROVIDE LIGHTING THAT ILLUMINATES THE AREA IN FRONT OF THE VEHICLE AND THEN DEFUSES THE LIGHT FURTHER TO SEE DOWN THE ROADWAY, AND DOES NOT CREATE A WALL OF DARKNESS. I HAVE BROUGHT THIS UP TO VW AND THE DEALER WHO STATES THAT THE SYSTEM IS OPERATING CORRECTLY. I HAVE BEEN TOLD THAT THE SYSTEM ONLY UTILIZES ONE BULB FOR BOTH LOW BEAMS AND HIGH BEAMS, WITH A SHIELD THAT COVERS A PORTION OF THE LIGHTING TO CREATE THE LOW BEAMS. I GUESS THAT IS WHY THE LIGHTING HAS A VERY DEFINITIVE LINE CUTTING IT OFF BLUNTLY, THEREFORE CREATING A WALL OF DARKNESS, THIS LITERALLY CREATES A BLIND AREA FOR WHICH ONE CANNOT SEE A SUFFICIENT AREA IN FRONT OF THE VEHICLE. TO OPERATE IT SAFELY. TO ME THIS CREATES A VERY UNSAFE CONDITION WHEN DRIVING UNDER NORMAL CONDITIONS WITH LOW BEAMS ON. AS EXPLAINED TO ME THE SHIELD GOES UP FOR WHEN THE HIGH BEAMS ARE ACTIVATED,  I HAVE SEEN SOME ONLINE POSTS THAT OTHERS ARE EXPERIENCING THE SAME THING, PLEASE ADVISE AS TO WHAT TO DO REGARDING THIS ISSUE THANK YOU, [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *CC  *TR",
        "vin": "3VV4B7AX4KM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/25/2021",
        "dateOfIncident": "01/23/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389854,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "KESSI KEY FOB LOSES POWER/CONNECTIVITY IN COLD WEATHER. OCCURRED TWICE IN 20-25 DEGREE TEMPERATURE. UNABLE TO UNLOCK WITH REMOTE KEY. REQUIRES POPPING OFF LOCK CYLINDER COVER, USING KEY BLADE TO OPEN DOOR, SETS OFF ALARM, MUST HOLD KEY CLOSE TO A DESIGNATED AREA ON STEERING COLUMN TO START..IF THERE IS ENOUGH POWER/TRANSMISSION LEFT IN KEY FOB. COULD BE LEFT STRANDED & HAVE TO BE TOWED. KESSI KEY FOB NO LONGER OPERABLE. MUST GO TO DEALER TO GET NEW BATTERY. STORE BOUGHT BATTERIES DO NOT WORK IN MOST CASES.     HAVE HAD MULTIPLE VW'S WITH KESSI KEY FOB IN PAST AND NEVER HAD ISSUE WITH KEY BECOMING INOPERATIVE IN COLD WEATHER.",
        "vin": "3VV2B7AX9KM"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/21/2021",
        "dateOfIncident": "01/16/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389191,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF LEAKED WHILE CLOSED FILLING THE CAR WITH GALLONS OF WATER, CREATING WATER DAMAGE AND RISK OF ELECTRICAL FAILURES. THE VEHICLE WAS PARKED IN A DRIVEWAY.     THERE IS AN EXISTING CLASS ACTION LAWSUIT REGARDING THIS PROBLEM, HOWEVER THE OWNERS WERE NOT MADE AWARE, AND THE SOONEST DEALERSHIP APPOINTMENT TO REMEDY THE ISSUE WAS 1 WEEK FROM THE CALL, WITH NO SENSE OF URGENCY.     THIS IS UNACCEPTABLE FOR A VEHICLE UNDER MFG WARRANTY, WHICH IS NOT SAFE TO DRIVE IN THE MEAN TIME.",
        "vin": "3VV2B7AX7KM"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/07/2021",
        "dateOfIncident": "07/14/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387045,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STARTED LEAKING FLUIDS 2 WEEKS AFTER PURCHASING. THE CAR HAS NOW BEEN IN 6 TIMES FOR LEAKING OIL FLUIDS, AS WELL AS NOISY BRAKES, AND A BUCKING TRANNY. HAS HAD SEALS REPLACED, BOOT REPLACED AND IS NOW LEAKING AGAIN 1/2021 IN THE FRONT, AND ALSO LEAKING IN THE REAR OF THE CAR.",
        "vin": "3VV2B7AX1KM"
    },
    {
        "components": "AIR BAGS,FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "12/04/2020",
        "dateOfIncident": "10/30/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11377883,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2019 VOLKSWAGEN TIGUAN.  THE CONTACT STATED THAT WHILE DRIVING AT 65 MPH, WHEN A VEHICLE IN FRONT SUDDENLY STOPPED CAUSING THE CONTACT TO REAR END THEIR VEHICLE. THE VEHICLE'S FORWARD COLLISION PREVENTION SYSTEM HAD FAILED TO ALERT THE CONTACT THAT THERE WAS A VEHICLE IN FRONT. THE AIR BAGS FAILED TO DEPLOY. THE VEHICLE WAS TOWED. THE VEHICLE WAS DEEMED TOTALED. THE CONTACT DID RECEIVE ABDOMINAL, CHEST, AND BACK INJURIES. MEDICAL ATTENTION WAS NEEDED. A POLICE REPORT FILED. THE VEHICLE WAS TAKEN TO THE DEALER (HENDRICK VOLKSWAGEN OF CONCORD LOCATED AT 7500 HENDRICK AUTO PLAZA NW, CONCORD, NC 28027; (704) 743-4110) WHO WERE MADE AWARE OF THE FAILURE, HOWEVER, THE MANAGER HAD  CONTACTED THEM BACK AS PROMISED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AN OPENED A CASE REGARDING THE FAILURE. THE FAILURE MILEAGE WAS 37,997.*DT*JB",
        "vin": "3VV2B7AX6KM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/29/2020",
        "dateOfIncident": "10/28/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372310,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "REGARDLESS OF OUTSIDE AMBIENT OR ENGINE OPERATING TEMPERATURE.  WHEN EVER THIS VEHICLE POWERS DOWN (AKA SLEEP MODE) WHEN IT IS RESTARTED THIS VEHICLE REQUIRES A MINIMUM OF 2:20 SECONDS OF IDLE TIME BEFORE ENGINE RPM WILL DROP BELOW 1000 RPM SO IT CAN BE SAFELY PLACED INTO GEAR.  THIS HAPPENS IN 105 DEG TX DAYS IN THE PARKING LOT OF THE GROCERY STORE AS WELL AS THE GARAGE IN THE MORNING.  DEALER SAYS \"NO CODES\", SO IT IS WORKING AS DESIGNED!  AN ACQUAINTANCE AT WORK HAS 2018 TIGUAN AND HIS DOES NOT DO THIS.  THIS WASTES GAS AND IS BAD FOR THE ENVIRONMENT.  WENT TO DEALER 2X THUS FAR.  THEY DO NOT CARE.",
        "vin": "3VV1B7AX0KM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/29/2020",
        "dateOfIncident": "10/28/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372318,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "SPORT SHIFT.  THIS IS AN UNDERPOWERED AND SOMETIMES CONFUSED VEHICLE.  MOST OWNERS SAY TO DRIVE IN \"SPORT\" MODE TO HELP IT NOT HESITATE AS MUCH WHEN ACCELERATING FROM A STOP (CAN HAVE LONG HESITATION FOR NO APPARENT REASON) AND WHEN PASSING AT HIGHWAY SPEEDS.   PER MANUAL \"SPORT MODE WILL NOT ALLOW TRANSMISSION TO GO INTO HIGHEST GEAR\" WHICH IS 8TH GEAR.   HOWEVER ONCE IN SPORT MODE, AND CRUISING WITH STEADY SPEED AND RPM, IF YOU PLACE SELECTOR TO MANUAL MODE THE SHIFT INDICTOR IMMEDIATELY DISPLAYS 8 WITH NO CHANGE IN ENGINE TONE OR RPM.  THIS INDICATES TO ME THAT THE TRANSMISSION IS ALREADY IN 8TH GEAR AGAINST DESIGN AND OPERATION MANUAL  DESCRIPTION.  I BELIEVE THIS IS A CONTRIBUTING FACTOR FOR THE SLUGGISH TRANSMISSION RESPONSE DURING NORMAL OPERATION WHICH DOES NOT SEEM VERY DIFFERENT FROM SPORT MODE AND WILL CAUSE PREMATURE TRANSMISSION PROBLEMS SOME OWNERS HAVE COMPLAINED ABOUT.  DEALER SAYS THERE ARE NO CODES SO THIS IS NORMAL.",
        "vin": "3VV1B7AX0KM"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/29/2020",
        "dateOfIncident": "10/28/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372314,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE BASIC S MODEL.  WE INTENTIONALLY PURCHASED THIS BASE MODEL TO EXCLUDE THE HI-TECH OPTIONS KNOWN TO FAIL.  WE WANTED AN IGNITION KEY TO ELIMINATE THE NECESSITY OF A FOB AND PUSH BUTTON START.  WE WERE NOT MADE AWARE OF THE FACT YOU CANNOT LOCK THIS VEHICLE WITHOUT USING THE DOOR FOB THEY PROVIDED!!  WE WERE LED TO BELIEVE IT WAS A CONVENIENCE TO LOCK AND UNLOCK BUT NOT NECESSARY.    WITH OUR OTHER VEHICLES ONCE OUTSIDE OF THE VEHICLE, WE WILL PRESS THE ELECTRIC DOOR LOCK BUTTON TO LOCK THE LOCK, CLOSE DOOR AND DOORS LOCKS.  VW DOES NOT ALLOW THE LOCKS TO BE ACTIVATED UNLESS DOOR IS CLOSED WHICH MEANS IF YOU DO NOT USE FOB, THE DOORS REMAIN UNLOCKED!  AFTER ABOUT 3 MONTHS OF OWNERSHIP WE REALIZED WE WERE NOT LOCKING THIS VEHICLE WHEN EXITING.  THIS IS A SAFETY AND THEFT ISSUE.",
        "vin": "3VV1B7AX0KM"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/02/2020",
        "dateOfIncident": "09/25/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362475,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 VOLKSWAGEN TIGUAN. THE CONTACT STATED THAT WHILE HIS WIFE WAS DRIVING 40 MPH, SHE HEARD AN ABNORMAL SOUND COMING FROM THE SUN ROOF. THE DRIVER CONTINUED DRIVING TO HER RESIDENCE. AFTER PARKING THE VEHICLE, SHE NOTICED THAT THE SUN ROOF PANEL HAD SHATTERED. THE DRIVER STATED THERE WAS NO IMPACT THAT CAUSED THE FAILURE. THE CONTACT CALLED THE LOCAL DEALER CHAPMAN VOLKSWAGEN OF TUCSON LOCATED AT 4500 E 22ND ST, TUCSON, AZ 85711, (520) 445-4090 AND MADE THE DEALER AWARE OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER HAD NOT BEEN INFORMED OF FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 20,000. *LN",
        "vin": "3VV4B7AX6KM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/24/2020",
        "dateOfIncident": "08/23/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350833,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE'S FRONT ASSIST COLLISION SENSOR WILL ENGAGE ITSELF WHILE GOING DOWN SOME DRIVEWAYS REGARDLESS OF HOW SLOW OR ANGLED I TRY TO EXIT (I ALWAYS MAKE SURE THAT MY EXIT AND TURNS ARE SAFE FROM ANY ONGOING TRAFFIC SO THE SENSOR IS ONLY BEING TRIPPED FROM GROUND IN FRONT OF THE SENSOR). I HAVE BEEN ALMOST BEEN REAR ENDED THREE TIMES BECAUSE OF THIS AND ALMOST HIT FROM THE SIDE WHEN THE THE SENSOR ENGAGED WHEN I WAS MORE THAN HALFWAY OUT INTO THE FIRST LANE TO MAKE MY TURN. I HAVE ENGAGED SEVERAL VW SERVICE TECHNICIANS ABOUT A PERMANENT FIX BUT THEY SAID THAT THEY ARE AWARE OF THE PROBLEM AFTER HEARING OF SEVERAL OTHER COMPLAINTS BUT THERE IS NO PERMANENT FIX. IT IS THE DRIVER'S RESPONISBILITY TO MANUALLY TURN OFF THE FRONT ASSIST COLLISION SENSOR EACH AND EVERY TIME YOU INTEND TO DRIVE THE CAR.",
        "vin": "3VV3B7AX0KM"
    },
    {
        "components": "STRUCTURE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/12/2020",
        "dateOfIncident": "07/28/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348803,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS HAD A WATER LEAK FROM THE PANORAMIC SUNROOF. I SAW THE WATER COMING IN FROM THE BACK PASSENGER SEATBELT HOLES ON BOTH SIDES OF THE CAR. I BROUGHT THE CAR IN TO GET FIXED, I WAS NEVER TOLDWHAT THE ISSUE WAS AND HAD TO ASK FOR OFFICIAL PAPERWORK.  APPARENTLY THE SUNROOF DRAIN LINES WERE \"KINKED AND CLOGGED.\"  MY CAR WAS IN SERVICE 7/28/20-7/30/20 FOR THAT ISSUE.  THERE WAS SIGNIFICANT MOLD GROWTH ON THE REAR FLOORBOARDS AND SMELLED OF MILDEW.  I NOTICED SEVERE CONDENSATION ON ALL INTERIOR WINDOWS 8/4/20 AND MADE AN APPOINTMENT TO GET MY CAR LOOKED AT 8/6/20.  I COULD NOT DRIVE THE CAR RIGHT AWAY SINCE I COULD NOT SEE OUT OF THE WINDOWS.  I HAD TO PHYSICALLY DRY THEM WITH A TOWEL.  I WAS THEN TOLD THEY COULD NOT FIND A LEAK, BUT THERE WAS STILL WATER ENTERING THE CAR AND THE FLOORBOARDS WERE WET.  THE CAR HAS BEEN IN THE SHOP SINCE.  ANOTHER CAR WAS IN SERVICE FOR THE SAME EXACT ISSUE WHILE I WAS THERE, I WITNESSED THE MOLD MYSELF.   I RESEARCHED MY VIN AND THERE WAS NO RECALLS OR SERVICE BULLETINS FROM VW.",
        "vin": "3VV3B7AX5KM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/12/2020",
        "dateOfIncident": "08/12/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348912,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONTAL BRAKING ASSIST. IT LOCKS UP EVEN WHEN IT IS TURNED OFF. IT WILL JUST BRAKE VERY SUDDENLY., CAUSING THE CAR TO LOCK UP. THERE DOESNT EVEN HAVE TO BE A REASON FOR IT. THIS HAS HAPPENED SEVERAL TIMES DURING THE YEAR I HAVE HAD THE CAR. THIS HAS HAPPENED IN MOTION, AND CITY STREET.",
        "vin": "3VV3B7AX2KM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/11/2020",
        "dateOfIncident": "07/08/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348735,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE MY 2019 VW TIGUAN WAS SERVICED IN EARLY JULY 2020 THE HORN HAS WORKED INTERMITTENTLY. IT WAS FIRST NOTICED WHEN LOCKING THE CAR USING THE REMOTE. THE HORN SOUNDED ONLY SOMETIMES WHEN LOCKING THE CAR BY THE REMOTE. AFTER RECOGNIZING THIS IT WAS NOTICED THAT WHEN DRIVING OR STATIONARY TIME THE HORN WORKED ABOUT HALF THE TIME IT WAS PRESSED. THE DEALER CLAIMED TO HAVE FIXED IT TODAY (8/11/2020) AND THE HORN WORKED WHEN THE CAR WAS LOCKED BY THE REMOTE ON ARRIVING HOME. ON TESTING THE LOCKING AGAIN THE HORN DID NOT WORK AND WE TESTED THE HORN BY PRESSING IT AND THERE WAS ALSO NO SOUND AGAIN. I AM RETURNING TO THE DEALER IN STONE MOUNTAIN, GA AGAIN ON 8/12/2020. THIS IS A SERIOUS SAFETY ISSUE AS ONE CANNOT WARN PEDESTRIANS OR OTHER VEHICLES IN AN EMERGENCY SITUATION.",
        "vin": "3VV3B7AX2KM"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "08/06/2020",
        "dateOfIncident": "08/06/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348350,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 VOLSKWAGEN TIGUAN. CONSUMER WRITES IN REGARDS TO FRONT ASSIST AND ADAPTIVE CRUISE CONTROL FAILURE. *LD    THE CONSUMER STATED THE FRONT ASSIST SYSTEMS MAY FAIL IF THE VEHICLE GOES OUT OF ALIGNMENT AS LITTLE AS 1/1OOTH OF AN INCH. THE REAR OF THE VEHICLE THRUSTS FORWARD.  *JS",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/04/2020",
        "dateOfIncident": "08/04/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343346,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A RESIDENTIAL STREET WITH NO CARS IN FRONT OF ME AND MY AUTONOMOUS EMERGENCY BRAKING SYSTEM ENGAGED ITSELF BRINGING MY CAR TO AN ABRUPT STOP. THERE WAS NOTHING IN THE STREET, ON THE FRONT ON MY CAR, OR IN FRONT OF ME.",
        "vin": "3VV3B7AX1KM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/31/2020",
        "dateOfIncident": "07/21/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342608,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AUTOMATIC BRAKING SYSTEM ACTIVATED TWICE IN SIX WEEKS WHILE PULLING OUT FROM A PARKING LOT ONTO A CITY STREET. THIS HAPPENED AT 2 DIFFERENT LOCATIONS. BOTH TIMES WHEN THIS OCCURRED THE VEHICLE WAS TURNING RIGHT AND CAME TO A COMPLETE STOP 1/3RD TO 1/2 THROUGH THE TURN.",
        "vin": "3VV4B7AX1KM"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/06/2020",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337750,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 VOLKSWAGEN TIGUAN. THE CONTACT STATED THAT THE WINDSHIELD WIPERS INDEPENDENTLY SLOWED DOWN UPON THE VEHICLE CEASING FORWARD MOTION. THE CONTACT STATED THAT WHILE DRIVING IN THE RAIN AT APPROXIMATELY 35 MPH AND UPON MAKING A LEFT TURN, THE WINDSHIELD WIPERS INDEPENDENTLY SLOWED DOWN TO INTERMITTENT SPEED WITH THE WINDSHIELD WIPERS SET TO FULL SPEED. THE CONTACT CALLED GRAHAM VOLKSWAGEN (801 W 41ST ST, SIOUX FALLS, SD 57105) AND NOTIFIED THE DEALER OF THE FAILURE. THE CONTACT WAS INFORMED BY THE DEALER AND AN INDEPENDENT MECHANIC THAT THE FAILURE WAS NOT A KNOWN ISSUE WITH SIMILAR VEHICLES. THE MANUFACTURER HAD YET TO BE NOTIFIED OF THE FAILURE. THE VEHICLE HAD YET TO BE REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 5,000.",
        "vin": "3VV0B7AX8KM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/22/2020",
        "dateOfIncident": "05/22/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330012,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUNROOF EXPLODED WHILE DRIVING AT ABOUT 45 MPH ON TOP OF AN OVERPASS.  FILE A CASE WITH VW AND THEY REFUSE TO FIX THE ISSUE. CASE NUMBER WAS [XXX].  WE WERE TRAVEL ON RT 13 IN VIRGINIA THROUGH A SMALL TOWN.     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "3VV2B7AX9KM"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/17/2020",
        "dateOfIncident": "06/04/2020",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329287,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS BEGINNING TO MERGE SOUTH ON I75  BUT PULLED OVER ON THE SHOULDER BEFORE MY SPEED REACHED APPROX 50 MPH AND I WAS LESS THAN .2 MILES ON THE  RAMP. I IMMEDIATELY PULLED OVER WHEN I COULD SMELL AND  SAW SMOKE COMING OUT OF THE VENTS ON THE DASH. UPON EXITING THE CAR I SAW FLAMES UNDER THE HOOD. WHILE I WAS GETTING MY CHILDREN OUT OF THE CAR, A FEW MEN HAD STOPPED TO HELP WITH FIRE EXTINGUISHERS, BUT THEY WERE UNSUCCESSFUL.    THE FIRE CHIEF THOUGHT THAT THE CAUSE MAY HAVE BEEN AN ELECTRICAL SHORT OR SOME SOFT OF MANUFACTURING DEFECT. I AM NOT CERTAIN WHAT CAUSED THE FIRE UNDER THE HOOD, BUT DO KNOW THAT I HAD NOT HAD ANY ISSUES WITH THE CAR UNTIL JUNE 4TH. IT WAS A 2019 ;EASE THAT I HAVE BEEN LEASING LESS THAN A YEAR. THE CAR WAS BRAND NEW WHEN I ROLLED IT OFF THE LOT. IT WAS IN THE DEALERSHIP ON 1/31 FOR SCHEDULED MAINTENANCE.  *TR",
        "vin": "3VV2B7AX5KM"
    },
    {
        "components": "VISIBILITY,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/05/2020",
        "dateOfIncident": "06/03/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327423,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY AND MY PANORAMIC SUNROOF EXPLODED CAUSING GLASS TO FALL IN ON MYSELF AND MY 5 YEAR OLD DAUGHTER.  *TR",
        "vin": "3VV2B7AX1KM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/03/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327194,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "NEW 2019 TIGUAN S 4MOTION PURCHASED IN FEB 2020 AND HAS ABOUT 8K MILES. ALREADY HAVING ISSUES WITH HARD SHIFTING (BOTH UP AND DOWN) AND HAVE HAD THE VEHICLE CHUG/STALL AND ALMOST CAUSE A CRASH 2 TIMES NOW BECAUSE IT WOULDN'T ACCELERATE. ALL OF THESE ISSUES ARE AFTER ABOUT HALF HOUR OF DRIVING. HARD DOWNSHIFT IS NORMALLY AROUND 20-30MPH AND UP SHIFT 30-40. NEVER JERKED BEFORE AND NOW IT'S HARD AND VERY UNSAFE.  *TR",
        "vin": "3VV0B7AXXKM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/11/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317502,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE CONSISTENTLY DIES UPON ENTERING TRAFFIC LOCALLY OR HIGHWAY DEALER SAYS THERE IS NO FIX IT'S BEEN IN THE SHOP AT LEAST THREE TIMES THEY'VE DENIED THE LAST REQUEST FOR A REVIEW BUT IT HAS BECOME A SERIOUS SAFETY ISSUE",
        "vin": "3VV3B7AX9KM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/11/2020",
        "dateOfIncident": "02/15/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317633,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN EXPERIENCING INTENSE THROTTLE LAG. THIS HAPPENS EVERY TIME I STOP BUT IT IS VERY EXCESSIVE WHEN ROLLING (10MPH) AND PRESS THROTTLE. IT HAS BECOME A SAFETY CONCERN AS IF I AM MERGING INTO TRAFFIC AND HAVE TO PAUSE WHILE OTHER CARS ARE AROUND I FEEL IT IS VERY UNSAFE. I HAVE SPOKEN TO OTHER 2019 TIGUAN OWNERS AND THEY HAVE EXPERIENCED THE SAME ISSUE. AND DOING MY RESEARCH I HAVE SEEN SOME DEALERSHIPS HAVE FIXED THIS ISSUE WHILE OTHERS HAVEN'T.",
        "vin": "3VV3B7AX8KM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/05/2020",
        "dateOfIncident": "03/05/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316480,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING IN WINDY CONDITIONS, 4 SEPARATE TIMES ON ONE DAY, SENSOR WENT OFF. RED CAR GRAPHIC ON MY SCREEN WITH \"SIDE IMPACT\" WAVE LINES ON THE SIDES AND CAR AUTOMATICALLY BRAKED SUDDENLY.   HAPPENED IN CITY, WHILE IN MOTION. NO OTHER CARS IN CLOSE PROXIMITY AT TIME OF SENSOR WARNING AND BRAKING. 3 OF 4 TIMES HAPPENED AS WAS DRIVING NORTH INTO A STRONG NORTH WIND.   NEVER HAD THIS WARNING THROWN BEFORE.",
        "vin": "3VV2B7AX7KM"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/04/2020",
        "dateOfIncident": "09/26/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306980,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS BEEN IN SERVICE 5 TIMES SINCE PURCHASED. CAR STALLS AND DOES NOT RESTART.",
        "vin": "3VV2B7AX9KM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/03/2020",
        "dateOfIncident": "02/01/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306861,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD A RENTAL FROM ENTERPRISE AND AFTER DRIVING IT FOR ABOUT 1 WEEK IT DIDN'T START AND WAS LEAKING GASOLINE MASSIVELY.",
        "vin": "3VV2B7AX7KM"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/27/2019",
        "dateOfIncident": "12/20/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291461,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN HAVING SERIOUS STALLING ISSUES WITH THIS CAR...SINCE THE 1ST DAY I RECEIVED IT. WHEN I AM DRIVING THE CAR WOULD REFUSE TO ACCELERATE LIKE GETTING ON AND OFF EXITS ON EXPRESSWAY...CHANGING LANES ETC...IT ALSO STALLS AND THE ENGINE STOPS WHILE DRIVING..THE CAR HAS A LANE DEPARTURE ASSIST WHICH PULLS THE CAR FROM 1 LANE INTO THE OTHER VIOLENTLY...I AM HOPING TO GET THIS CAR REPLACED WITH ANOTHER LINE FROM VW ONLY BECAUSE MY LEASE IS 5 MNTHS OLD...THEY ARE REFUSING TO HELP ME BECAUSE THERE IS NO RECALL, MAYBE IF SOMEONE  DIES THEY WILL GIVE A RAT'S [XXX] ABOUT THIS ISSUE...AN ISSUE THEY HAD I. 2014....EASE LOOK INTO THIS..FAMILIES CAN DIE FROM THIS PROBLEM.  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "3VV4B7AX5KM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/23/2019",
        "dateOfIncident": "07/22/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290941,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED CAR IN JULY 2019 AND THE CARNET HAS NEVER FUNCTIONED PROPERLY. AFTER CALLING CUSTOMER CARE AND CARNET I WAS TOLD TO TAKE IT INTO THE DEALERSHIP. AFTER TWO SEPARATE VISITS AND LEAVING MY CAR FOR SEVERAL DAYS I WAS TOLD IT'S A KNOWN ISSUE AND THERE'S NOTHING THEY CAN DO.  I HAVE A CASE OPEN WITH CUSTOMER CARE SINCE AUGUST 2019 AND FOLLOW UP EVERY FEW WEEKS, AS THEY TYPICALLY FORGET TO PROVIDE ME WITH THE PROMISED UPDATE EVERY TWO WEEKS.  EACH UPDATE IS THE EXACT SAME --- THERE ARE NO UPDATES AT THIS TIME AND NO TIMELINE FOR A FIX.  THEY ALSO WILL NOT PROVIDE ANY COMPENSATION UNTIL THE ISSUE IS RESOLVED.      THE CARNET APP HAS NOT WORKED CORRECTLY -- KICKS ME OUT REGULARLY, SAYS MY CAR IS UNLOCKED WHEN IT IS LOCKED, UNABLE TO SEND DESTINATIONS FROM THE APP TO MY CAR, ETC.  THE BUTTONS IN THE CAR ALSO DO NOT WORK WHEN PRESSED, WHICH MEANS IN AN EMERGENCY SITUATION IT WILL NOT WORK.",
        "vin": "3VV4B7AX8KM"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/21/2019",
        "dateOfIncident": "09/02/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290649,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO SEPARATE PROBLEMS.   #1 ON TWO SEPARATE OCCASIONS THE CARS EMERGENCY SYSTEM ACTIVATED WITH NO CARS OR ANYTHING IN PROXIMITY. VW JUST CLEANED SENSORS . IT HAPPENED ONCE AFTER THAT WHILE PARKING THE CAR.  #2 WITH ONLY 8000 MILES ON THE BRAKES PULSE WHEN APPLIED. WE WERE TOLD JUST WAIT FOR 1 YEAR SERVICE AND IT WILL BE LOOKED AT. THE TIGUAN WENT IN FRIDAY MORNING AND WE WERE INFORMED THE BRAKE ROTORS ARE WARPED. VW NORTH AMERICA RECOMMEND ROTORS AND ASSOCIATED HARDWARE TO FIX THE PROBLEM. TROUBLESOME ISSUE WITH ONLY 10000 MILES LES THAN I YEAR OLD.",
        "vin": "3VV4B7AX4KM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/12/2019",
        "dateOfIncident": "10/20/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288668,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PLASTIC OIL PAN AT THE BOTTOM OF THE ENGINE OF MY 2019 VOLKSWAGEN TIGUAN 2.0T STARTED LEAKING WHILE I WAS ON THE HIGHWAY, NEARLY STRANDING MY FAMILY. IT WAS VERY DISAPPOINTING TO SEE ANY VEHICLE USING A FRAGILE, UNPROTECTED PLASTIC OIL PAN AT THE BOTTOM OF THE ENGINE, ESPECIALLY THE TIGUAN, WHICH IS MARKETED AS A SPORT UTILITY VEHICLE.",
        "vin": "3VV1B7AX4KM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/04/2019",
        "dateOfIncident": "09/05/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286851,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS CAR AND THE CAR-NET IN MY CAR HASN'T WORKED SINCE THE DAY I BOUGHT THE CAR. I HAVE CONTACTED VW MULTIPLE TIMES AND I JUST KEEP GETTING THE 'THEY'RE WORKING ON IT ' WITH NO RESOLUTION IN SITE.",
        "vin": "3VV2B7AX1KM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/17/2019",
        "dateOfIncident": "08/05/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280610,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN A SIDE ROAD IN A PARKING LOT WITH NO CARS IN FRONT OF ME AND NO ONE IN BACK OF ME. SUDDENLY THE CAR BRAKED AND THREW ME FORWARD. IT SCARED THE LIVING DAYLIGHTS OUT OF ME. THERE WAS NO REASON WHY THIS HAPPENED. THERE WAS NOTHING IN THE ROAD. I REPORTED THIS PROBLEM TO VOLKSWAGEN AND THEY HAD NO ANSWER AND TOLD ME TO DISABLE THE BRAKING SENSOR WHICH I DID. I FELT THE NEED TO REPORT THIS ISSUE SINCE I FELT THIS WAS A POSSIBLE DEFECT IN THE BRAKING SENSOR. IF THIS WOULD HAVE HAPPENED ON A BUSY ROAD I COULD HAVE BEEN HIT FROM BEHIND. AGAIN THERE WAS NO REASON FOR THE SUDDEN BRAKING. THIS IS A LEASED CAR AND WHEN I TURN IT IN I JUST WANT TO LET THEM KNOW THAT THE SENSOR IS TURNED OFF FOR THE NEXT PERSON WHO LEASES IT AND HAS NO IDEA IT IS TURNED OFF. IN SUMMARY, I WAS GOING AROUND 35-40 MPH WHEN THIS BRAKING OCCURRED WITH NO REASON WHATSOVER. THANK YOU FOR YOUR TIME.",
        "vin": "3VV0B7AX7KM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/29/2019",
        "dateOfIncident": "01/08/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11276937,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION DOESN'T SEEM TO WORK SWIFTLY. DEFINITELY A LAG GOING ON THAT IS FELT IN THE ACCELERATION OF THE VEHICLE. EVERYTHING ELSE IS GREAT WITH THE CAR",
        "vin": "3VV3B7AX7KM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/15/2019",
        "dateOfIncident": "10/14/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268473,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2019 VW TIGUAN WITH 2 LITER TURBO MOTOR HAS A RANDOM AND REPEATED ENGINE \"STALL\" ISSUE.  THE ENGINE DOES NOT DIE BUT REMAINS AT IDLE (1000 RPM), IN EITHER D OR S AUTO TRANS MODE, BUT THERE IS NO FORWARD MOVEMENT EVEN THOUGH THE GAS PEDAL IS AGAINST FLOOR BOARD AND  THEN THERE IS A RUSH OF POWER, THIS DELAY LASTS FROM 1 TO 5 SECONDS, JUST ENOUGH TO CAUSE TRAFFIC MERGING ISSUES.  THIS PROBLEM USUALLY OCCURS FROM STANDING START WHEN DRIVEN STRAIGHT AHEAD OR TURNING.  SO FAR HAS NOT OCCURRED ABOVE 50MPH WHEN ENTERING FREEWAY.    THIS HAS OCCURRED SINCE CAR WAS DELIVERED NEW WITH 40 MILES ON ODOMETER AND CONTINUES NOW AT 1200 MILES AND USUALLY AT SPEEDS FROM 0 - 25 MPH AND UNDER 2000 RPM.  I SPOKE TO THE LOCAL VW SERVICE MANAGER AND HE SUGGESTED IT WAS JUST TURBO LAG.  I HAVE OWNED TURBO CARS IN PAST AND THIS IS NOT TURBO LAG, IT IS A LOSS OF \"SIGNAL\" DUE TO DRIVE BY WIRE TECHNOLOGY WHICH SHOULD NEVER BE ALLOWED ON A VEHICLE!!!!!!!!!!!!!!!!!    OTHERWISE THE MOTOR OPERATES FINE, PROVIDING DECENT GAS MILEAGE AND POWER WHEN ON-BOOST ABOVE 2000 RPM.  OUR LAST NEW CAR A 2016 GMC TERRAIN WAS ALSO DRIVE BY WIRE BUT NEVER EXHIBITED THIS ISSUE.   THERE ARE NUMEROUS COMPLAINTS ONLINE DUPLICATING THIS PROBLEM WHICH I HAD HOPED WAS CLEARED UP IN OLDER VERSIONS, EVIDENTLY NOT.",
        "vin": "3VV1B7AX1KM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/23/2019",
        "dateOfIncident": "09/23/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257315,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TERRIBLE WIND VIBRATION NOISE / THUMBING THAT CAUSES PHYSICAL DISCOMFORT IN EARS THE MOMENT ONLY 1 WINDOW IS ROLLED DOWN IN THE CAR. FRONT WINDOW DOWN REQUIRES TO OPEN BOTH FRONT WINDOWS TO BALANCE; CANNOT LOWER A REAR WINDOW WITHOUT AT LEAST OPENING 1 FRONT WINDOW / USUALLY REQUIRES OPENING BOTH FRONT WINDOWS. IF ONLY ONE REAR WINDOW IS OPEN PLUS FRONT WINDOW(S) THE WIND MOVEMENT RESULTS IN ITEMS IN THE LOADING AREA IN THE TRUNK BEING LIFTED UP AND IF LIGHTS EVEN SUCKED TO THE BACK SEAT. APPEARS TO BE SIGNIFICANT DESIGN FLAW ON VEHICLE. WHEN CLOSING WINDOWS HAVE TO CLOSE REAR WINDOWS FIRST BEFORE CLOSING FRONT WINDOWS, OTHERWISE THE AIR PRESSURE ON THE EAR CANAL IS SO STRONG THAT IT CAUSES EAR DISCOMFORT.",
        "vin": "3VV2B7AX8KM"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/04/2019",
        "dateOfIncident": "09/03/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253151,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I LEASED MY 2019 TIGUAN IN MARCH 2019. SHORTLY AFTER (~1,500 MILES),  I EXPERIENCE MY 1ST ACCELERATION FAILURE. WHILE ATTEMPTING TO TURN LEFT WITH ONCOMING TRAFFIC (WITH MY 4 YEAR OLD IN THE BACK SEAT), MY CAR WOULD NOT ACCELERATE ALTHOUGH MY FOOT WAS PRESSING THE GAS PEDAL TO THE FLOOR. AFTER MULTIPLE SECONDS AND MULTIPLE ATTEMPTS TO ACCELERATE FORWARD, I PUT THE VEHICLE IN PARK, TURNED IT OFF, TURNED IT BACK ON, PUT IN DRIVE, AND WAS ABLE TO COMPLETE THE TURN. THANKFULLY THE VEHICLES COMING TOWARDS ME WERE PAYING ATTENTION AND HALTED, OR IT WOULD'VE RESULTED IN A COLLISION.    THIS FAILURE HAPPENED 3 MORE TIMES SHORTLY AFTER, 1 OF THE THEM OCCURRING WHEN MY HUSBAND WAS DRIVING.    WHILE GETTING MY VEHICLE IN FOR SERVICE, 1 OF THE VW EMPLOYEES MENTIONED THEY RECEIVE CALLS REGARDING THIS SAME FAILURE EVERY WEEK, SOMETIMES EVERY DAY. A 2ND VW EMPLOYEE MENTIONED THEY HAVE NEVER RECEIVED A CALL ON THIS FAILURE FOR MY VEHICLE. ????.  THE DEALERSHIP PERFORMED A 26M1 SOFTWARE UPGRADE THAT 'SHOULD FIX THE PROBLEM.'    CONCERNED FOR NOT ONLY THE SAFETY OF MY FAMILY, BUT THE SAFETY OF THE DRIVERS AROUND ME, I FILED A CLAIM WITH VW CORPORATE AND ASKED TO BE REMOVED FROM MY LEASE DUE TO THE FAILURES ALMOST RESULTING IN MULTIPLE CAR ACCIDENTS. THEY REFUSED TO ALLOW ME TO GET OUT OF THE LEASE AS MY EXPERIENCED FAILURES 'DO NOT WARRANT THE ABILITY TO BE REMOVED FROM THE VEHICLE.'    SHORTLY AFTER THE SOFTWARE UPGRADE, MY CHECK ENGINE LIGHT CAME ON AND I'VE EXPERIENCED THE SAME FAILURE 3 MORE TIMES (1 OF THEM WHILE ATTEMPTING TO REVERSE).  HERE WE ARE AGAIN' I HAVE A SERVICE APPOINTMENT SCHEDULED FOR 09/10 AND OPENED MY VW CORPORATE CLAIM BACK UP.",
        "vin": "3VV2B7AX4KM"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/30/2019",
        "dateOfIncident": "03/09/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252384,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SOUNDS AS IF IT IS BOTTOMING OUT WHEN DRIVING OVER UNEVEN SURFACES OR SMALL DIPS AT ANY SPEED. NOISE IS MOSTLY IN THE FRONT WITH HEAVY CONCENTRATION ON THE PASSENGER FRONT TIRE. PARTICULARLY AROUND 30-40 MILES PER HOUR. VEHICLE HAS PREVIOUSLY BEEN IN (AFTER 3 DAYS OF OWNING IT 03/09/2019 FOR A REAR SHOCK REPLACEMENT ON THE DRIVERS REAR). AFTER OWNING THE VEHICLE FOR 6 MONTHS THE NOISE HAS GOTTEN WORSE. BROUGHT IT TO THE DEALER AGAIN 08/17/2019 AND NO ISSUES WERE FOUND. I TOOK THE TECH ON A LONG TEST DRIVE ON THE ROADS (PARKWAY) I TRAVEL DAILY MAX SPEED IS 45. HE HEARD THE NOISE AND STATED I WAS MAXING OUT MY SUSPENSION (THIS WAS AT 30MPH)  AND THE NOISE I WAS HEARING WAS THE SUSPENSION HITTING THE BUMPERS UNDERNEATH AND NOT THE ACTUAL VEHICLE, THIS WAS COMPLETELY NORMAL.NOISE CAN ALSO BE HEARD GOING OVER SPEED BUMPS AND DRIVEWAY CURBS AT EVEN LOWER SPEEDS). I  HAVE DRIVEN OTHER TIGUANS AND VOLKSWAGON MODELS ON THE SAME ROADS AND THIS DOES NOT APPEAR TO HAPPEN. MY VEHICLE CURRENTLY DOES NOT SHOW UNDER THE ANY CURRENT COIL RECALLS.  I WOULD LIKE SOMEONE TO PLEASE REVISIT THIS VIN TO SEE IF THIS VEHICLE COULD ALSO BE PART OF THE RECALL.",
        "vin": "3VV3B7AX5KM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/28/2019",
        "dateOfIncident": "08/24/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252098,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLES BRAKE LINE THAT WENT INTO THE ABS SYSTEM WAS NOT TIGHT ENOUGH AND BRAKE FLUID LEAKED OUT RESULTING IN THE FAILURE OF THE BRAKING SYSTEM. THE LOSS OF THE BRAKING SYSTEM COULD BE FELT WHILE DRIVING, AND EVENTUALLY RESULTED IN THE VEHICLE NOT STOPPING. FORTUNATELY, NO ONE WAS INJURED. THE VEHICLE WAS NEW AND HAD 185MILES ON IT WHEN THE BRAKES FAILED.",
        "vin": "3VV2B7AX3KM"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/27/2019",
        "dateOfIncident": "08/18/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246675,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "NEW CAR, 2 MONTHS OLD, 3,000 MILES. ISSUE HAS HAPPENED 4X. FIRST ISTANCE, TURNING LEFT ONTO A MAJOR 3 LANE ROAD, CAR SUDDENLY LOSES POWER AND THEN CHUGS TO CATCH SPEED LEAVING YOU POWERLESS WITH THE FOOT PEDDLE TO THE FLOOR. SECOND INSTANCE, EXITING A SHOPPING CENTER, LIGHT TURNED GREEN, STEPPED ON GAS PEDDLE AND CAR BOGGED AND SPUTTERED AS IF OUT OF GAS AND STALLED IN MIDDLE OF INTERSECTION. ONCE I GOT IT STARTED AGAIN IT MOVED FORWARD. AT NEXT TRAFFIC LIGHT IT SPUTTERED AGAIN AND WOULD NOT GO EVEN AFTER PUMPING GAS PEDDLE. CREEPS TO A ROLLING RUN AND THEN GOES. THIRD INSTANCE WAS ENTERING AN ON-RAMP FROM A STOP LIGHT, CAR SPUTTERED AS IF OUT OF FUEL AGAIN AND BARELY MADE IT OUT OF INTERSECTION WHERE I HAD TO PULL OFF THE ROAD TO GET THE CAR GOING. 4X SAME AS ABOVE. I'M NOW AT DEALER FOR SECOND TIME- NO REPAIR AND THEY SAY VW IS AWARE OF SOME CUSTOMERS EXPERIENCING THIS ISSUE NO FIX AT THIS TIME. VERY DANGEROUS TO DRIVE ON ATLANTA CITY STREETS. I'M NERVOUS TO PUT MY FAMILY BACK IN THE CAR.",
        "vin": "3VV3B7AX3KM"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/27/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246709,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A LOUD THUMPING NOISE COMING FROM THE FRONT SUSPENSION. THIS ONLY HAPPENS ON DOWNWARDS ROAD BUMPS (DOES NOT HAPPEN ON SPEED BUMPS). HAPPENS WHILE IN MOTION. THE FASTER THE VEHICLE IS, THE LOUDER THE NOISE BECOMES. DEALER IS UNABLE TO IDENTIFY THE ISSUE. THE VEHICLE HAS 11K MILES AT THE MOMENT, AND ISSUES IS THERE SINCE IT WAS BRAND NEW. DEALER SUGGESTED WE WAIT UNTIL PROBLEM GETS WORSE SO THEY CAN IDENTIFY IT EASIER. DOCUMENTED IN THE PAPERWORK THAT A COMPLAINT WAS ENTERED, BUT THEY WERE UNABLE TO \"REPLICATE\". I HAVE MANY INSTANCES RECORDED ON MY DASHCAM, HOWEVER NHTSA DOES NOT HAVE THE OPTION TO UPLOAD A VIDEO.",
        "vin": "3VV4B7AX0KM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/19/2019",
        "dateOfIncident": "08/08/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245075,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO TIMES MY PANORAMIC SUNROOF ON MY 2019 VOLKSWAGEN TIGUAN HAS EXPLODED. THE FIRST TIME WAS FEB. 13, 2019, JUST A COUPLE OF MONTHS AFTER I PURCHASED THE VEHICLE BRAND NEW. THE SECOND TIME WAS A WEEK AND A HALF AGO ON AUG. 8, 2019. BOTH TIMES THE PANORAMIC SUNROOF EXPLODED I WAS ON THE HIGHWAY GOING TO WORK AND DRIVING ABOUT 60MPH. IT SOUNDED BOTH TIMES LIKE A GUN SHOT GOING OFF IN MY CAR. THERE WAS NO WARNING EITHER TIME, IT JUST HAPPENED AND WAS VERY FRIGHTENING. BOTH TIMES IT HAPPENED I WAS FAR ENOUGH BACK FROM OTHER VEHICLES. THE MOST RECENT EXPLOSION WAS WORSE. A HUGE HOLE WAS LEFT AND PIECES WERE FLYING OFF BEHIND MY VEHICLE. THANKFULLY I HAD THE MESH SCREEN CLOSED, SO NONE OF THE GLASS CAME INTO THE VEHICLE ON ME. THE HOLE THAT WAS LEFT THE SECOND TIME WAS HUGE AND FLARED OUTWARDS, WHICH INDICATES A DEFECT IN THE MANUFACTURING OF THE GLASS. IT IS A DEFINITE SAFETY RISK. THANKFULLY BOTH TIMES IT HAPPENED I WAS ABLE TO MAINTAIN CONTROL OF THE VEHICLE BUT I WORRY IF IT HAPPENS AGAIN. THANKFULLY IT WASN'T RAINING EITHER TIME, IF IT WAS I MIGHT HAVE GOTTEN IN AN ACCIDENT WITH THE RAIN COMING IN ON ME AND KEEPING ME FROM BEING ABLE TO SEE THE ROAD. THERE SHOULD BE A RECALL ON THE 2019 VOLKSWAGEN TIGUAN PANORAMIC SUNROOF.",
        "vin": "3VV3B7AX0KM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/19/2019",
        "dateOfIncident": "02/13/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245078,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO TIMES MY PANORAMIC SUNROOF ON MY 2019 VOLKSWAGEN TIGUAN HAS EXPLODED. THE FIRST TIME WAS FEB. 13, 2019, JUST A COUPLE OF MONTHS AFTER I PURCHASED THE VEHICLE BRAND NEW. THE SECOND TIME WAS A WEEK AND A HALF AGO ON AUG. 8, 2019. BOTH TIMES THE PANORAMIC SUNROOF EXPLODED I WAS ON THE HIGHWAY GOING TO WORK AND DRIVING ABOUT 60MPH. IT SOUNDED BOTH TIMES LIKE A GUN SHOT GOING OFF IN MY CAR. THERE WAS NO WARNING EITHER TIME, IT JUST HAPPENED AND WAS VERY FRIGHTENING. BOTH TIMES IT HAPPENED I WAS FAR ENOUGH BACK FROM OTHER VEHICLES. THE MOST RECENT EXPLOSION WAS WORSE. A HUGE HOLE WAS LEFT AND PIECES WERE FLYING OFF BEHIND MY VEHICLE. THANKFULLY I HAD THE MESH SCREEN CLOSED, SO NONE OF THE GLASS CAME INTO THE VEHICLE ON ME. THE HOLE THAT WAS LEFT THE SECOND TIME WAS HUGE AND FLARED OUTWARDS, WHICH INDICATES A DEFECT IN THE MANUFACTURING OF THE GLASS. IT IS A DEFINITE SAFETY RISK. THANKFULLY BOTH TIMES IT HAPPENED I WAS ABLE TO MAINTAIN CONTROL OF THE VEHICLE BUT I WORRY IF IT HAPPENS AGAIN. THANKFULLY IT WASN'T RAINING EITHER TIME, IF IT WAS I MIGHT HAVE GOTTEN IN AN ACCIDENT WITH THE RAIN COMING IN ON ME AND KEEPING ME FROM BEING ABLE TO SEE THE ROAD. THERE SHOULD BE A RECALL ON THE 2019 VOLKSWAGEN TIGUAN PANORAMIC SUNROOF.",
        "vin": "3VV3B7AX0KM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/07/2019",
        "dateOfIncident": "06/18/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242396,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CARNET IN-CAR SYSTEM DOESN'T WORK. BROUGHT HOME THE NEW 2019 TIGUAN WITH ONLY 5 MILES ON IT AND WHEN I PUSHED THE CARNET BUTTONS....NOTHING. CONTACTED THE DEALER AND THE SERVICE DEPARTMENT TOOK TWO DAYS TO TRY TO FIX IT. I WAS TOLD THERE WAS NO FIX. IT'S A SOFTWARE PROBLEM AND VW MUST COME UP WITH A FIX. OVER 2 MONTHS LATER, STILL FIX. THIS IS A SAFETY ISSUE AND VERY FRUSTRATED WITH VW.",
        "vin": "3VV2B7AX6KM"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/15/2019",
        "dateOfIncident": "06/21/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11232134,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE FREQUENTLY SHAKES/SHUDDERS VIOLENTLY UNDER LIGHT/NORMAL ACCELERATION IN STOP-AND-GO TRAFFIC, CREATING A SAFETY HAZARD AND EXTREMELY UNCOMFORTABLE DRIVING SITUATION. I PURCHASED IT A FEW WEEKS AGO AND HAVE APPROXIMATELY 1300 MILES ON IT - THIS HAS BEEN HAPPENING SINCE I TOOK DELIVERY. UNDER LOAD, SHORTLY AFTER THE TRANSMISSION SHIFTS AND AS THE VEHICLE REACHES APPROXIMATELY 9-11 MPH AT 2000RPM, THE ENTIRE VEHICLE SHUDDERS AS IF THE ENGINE IS BEING LUGGED OR IS MISFIRING. THIS REALLY ONLY OCCURS AFTER THE VEHICLE HAS HAD SUFFICIENT TIME TO WARM UP AND HAS BEEN DRIVEN FOR SOME TIME IN RUSH-HOUR TRAFFIC. IT IS MORE PRONOUNCED WITH THE ADAPTIVE CRUISE CONTROL TURNED ON. THE SHAKING/SHUDDERING HAS MADE ME EXTREMELY DIZZY AND NAUSEOUS TO THE POINT WHERE I HAVE ALREADY BECOME PHYSICALLY SICK TO MY STOMACH ONCE. I HAD TO CUT OFF 3 LANES OF TRAFFIC TO REACH THE SHOULDER SO I COULD AVOID GETTING SICK IN THE CAR - THIS WAS ON 7/8/2019, A WEEK AGO TODAY. SEVERAL PASSENGERS WILL NO LONGER RIDE IN THE CAR WITH ME. I HAVE RETURNED THE VEHICLE TO THE SELLING DEALER TWICE OVER THIS ISSUE AND ALTHOUGH THEIR EFFORTS TO DIAGNOSE IT WERE MADE IN GOOD FAITH, THEY HAVE BEEN UNABLE TO REPRODUCE IT. I HAVE SEVERAL VIDEOS OF THIS ISSUE THAT I ATTEMPTED TO SHARE WITH THE DEALERSHIP UPON DROPPING IT OFF THE SECOND TIME, WHICH THE SERVICE TECHNICIAN TOLD ME HE DID NOT VIEW AFTER I PICKED THE CAR UP. I ALSO RECENTLY DISCOVERED THAT MY EMERGENCY COMMUNICATION/AIRBAG DEPLOYMENT NOTIFICATION SYSTEM (CAR-NET), IS COMPLETELY NON-FUNCTIONAL DUE TO A SOFTWARE BUG AND WILL NOT WORK AT ALL UNTIL VOLKSWAGEN COMES UP WITH AN UPDATE FOR IT (PER THE DEALER). I AM EXTREMELY UNCOMFORTABLE CONTINUING TO DRIVE THE VEHICLE FOR THESE REASONS AND CONTINUE TO FEEL SICK TO MY STOMACH EVERY TIME I USE IT TO COMMUTE TO OR FROM MY JOB, WHICH IS JUST OVER 30 MILES FROM MY HOME.",
        "vin": "3VV4B7AX2KM"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/09/2019",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230520,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AUTOMATIC BREAKING SENSORS WENT OFF FOR NO REASON. CAR STARTED BREAKING ON IT'S OWN. LUCKILY NO CAR BEHIND ME. CAR WAS IN MOTION ON A 35 MPH PART OF ROUTE 30 IN INDIANA WHEN IT STARTED TO BREAK SUDDENLY. TOOK IT TO THE DEALERSHIP AND THEY COULD NOT REPLICATE IT. I SENT VOLKSWAGEN A MESSAGE AND THEY DIDN'T REPLY.",
        "vin": "3VV2B7AX4KM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/08/2019",
        "dateOfIncident": "07/07/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229998,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WASDRIVING DOWN A RESIDENTIAL STREET  NO CARS IN FRONT OR BEHIND. THE AUTONOMOUS BRAKES ACTIVATED AND BROUGHT CAR TO FULL STOP FOR NO REASON.",
        "vin": "3VV2B7AX1KM"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/05/2019",
        "dateOfIncident": "07/04/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229635,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CARS BREAKING ASSISTANCE BRINGS THE CAR TO A COMPLETE STOP AT ANY SPEED. IT WILL BREAK WHEN NOTHING IS AROUND, WHEN BACKING OUT OF DRIVEWAY, DRIVING DOWN FREEWAY, AND PULLING OUT ONTO THE ROAD.",
        "vin": "3VV3B7AX2KM"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/03/2019",
        "dateOfIncident": "07/02/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229296,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED CAR JUNE 30, CHECK ENGINE LIGHT ILLUMINATED ON WAY HOME FROM DEALER.    NEXT DAY CHECK ENGINE LIGHT OFF, BRAKE POWER BOOST FAILURE FLICKER ON SCREEN, AUTO START/STOP NOT FUNCTIONING, RESTART CAR ALL GONE.    NEXT TRIP TIRE PRESSURE WARNING, UNABLE TO RESET.    HAD TO GO TO AN APPOINTMENT AND WAS HEADING TO DEALER ON THE WAY HOME, CAR WENT BLACK, LOST ACCELERATION, NO RESPONSE FROM THROTTLE WHILE DRIVING 75MPH ON BUSY FREEWAY.      HAD TO COAST ACROSS FIVE LANES OF TRAFFIC TO BE SAFE.    RESTART CAR, DROVE TO DEALER.  TOTAL AMOUNT OF MILES ON CAR 152.    PURCHASED SUNDAY EVENING 6:30 PM IN REPAIR AFTER NEAR COLLISION TUESDAY EVENING 5:00 PM.",
        "vin": "3VV2B7AX8KM"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/01/2019",
        "dateOfIncident": "06/19/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228837,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THE TIGUAN BRAND NEW FROM THE DEALERSHIP WITH HIGH HOPES FOR OUR FAMILY SUV. ALMOST IMMEDIATELY I NOTICED THAT THE VEHICLE HESITATED TO ACCELERATE FROM A STOPPED POSITION A FEW TIMES, BUT COULDN'T BELIEVE I WAS HAVING A PROBLEM SO SOON AFTER BUYING THE CAR.   WHEN I REALIZED THAT THIS WAS A RECURRING CAR ISSUE AND NOT USER ERROR, WE HAD ONLY OWNED THE CAR FOR 3 WEEKS AND THE CAR HAD ROUGHLY 1200 MILES.   IT WAS ABSOLUTELY TERRIFYING WHEN I WAS TURNING LEFT DURING RUSH HOUR TRAFFIC WITH MY 12 MONTH OLD SON IN THE BACK SEAT AND MY CAR WOULD NOT ACCELERATE BEYOND ABOUT 5 MILES PER HOUR. LUCKILY THE DRIVER COMING TOWARDS ME ON THE MAIN ROAD SLOWED DOWN WITH ENOUGH TIME FOR ME TO MAKE MY LEFT TURN AND COAST RIGHT INTO A NEARBY SUBDIVISION. I PRESSED MY FOOT ONTO THE ACCELERATOR TO THE FLOOR AND IT TOOK ABOUT 20 SECONDS FOR IT TO KICK INTO SPEED. I TOOK THE CAR TO THE DEALERSHIP WHERE I ASSUMED IT WOULD BE FIXED.   AFTER 9 DAYS IN THE SHOP, THEY CLAIM THEY DROVE THE VEHICLE 80 MILES AND COULDN'T DUPLICATE THE ISSUE. THEREFORE, THEY WANT ME TO PUT MY FAMILY BACK INTO THE CAR THAT IS COMPLETELY UNSAFE TO DRIVE. THEY TRIED TO TELL ME THAT IT WAS THE \"TURBO LAG\" THAT I AM EXPERIENCING WHICH, IN THE LONG RUN, A MANAGER ADMITTED TO MY FIANCE AND I IS UNTRUE ISN'T EVEN WHAT WE ARE EXPRESSING AS THE PROBLEM.  AFTER TALKING TO 3 MANAGERS, WE FINALLY FOUND SOMEONE WHO IS HEAD OF THE SERVICE DEPARTMENT AT THE DEALERSHIP WHO SYMPATHIZED WITH OUR ISSUE AND IS LETTING US USE A LOANER UNTIL VOLKSWAGEN CALLS US BACK, BUT THIS IS ONLY AFTER I SHOWED THEM ALL OF THE OTHER REVIEWS ON THIS WEBSITE THAT STATE OUR EXACT ISSUE.  NOW WE WAIT TO SEE IF VOLKSWAGEN WILL DO THE RIGHT THING OR IF THEIR CUSTOMER SERVICE IS AS TERRIBLE AS THE DEALERSHIP WHERE WE BOUGHT IT WHEN WE WENT IN WITH A REAL AND TERRIFYING ISSUE.  THIS IS THE BEGINNING OF WHAT WILL BE A RECALL. UNSAFE AND SCARY.",
        "vin": "3VV2B7AX1KM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/21/2019",
        "dateOfIncident": "06/05/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221732,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 VOLKSWAGEN TIGUAN. WHILE THE CONTACT'S DAUGHTER WAS DRIVING 40 MPH, THE EPC, OIL, AND SYSTEM/POWER WARNING INDICATORS ILLUMINATED. THE CONTACT STATED THAT THE VEHICLE BEGAN TO HESITATE WHEN THE ACCELERATOR PEDAL WAS DEPRESSED. THE VEHICLE WAS TOWED TO CAPISTRANO VOLKSWAGEN (LOCATED AT 32922 VALLE RD, SAN JUAN CAPISTRANO, CA 92675, (949) 493-4511) WHERE IT WAS DIAGNOSED THAT THE ENGINE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 920.",
        "vin": "3VV1B7AX2KM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/30/2019",
        "dateOfIncident": "05/21/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11216926,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT COALITION SENSON AND WARNING LIGHT GOES ON FOR NO REASON WHILE DRIVING AT A LOW SPEED DISABLELING THE SENSON. THIS HAS HAPPENED ABOUT 5 TO 6 TIMES ON VARIOUS DATES WHILE DRIVING IN THE CITY AND I HAVE TO STOP TURN THE CAR OFF AND ON IN ORDER TO RESET THE COMPUTER BY ITSELF. SOMETIMES IT WILL TURN OFF BY ITSELF TOO!.    DRIVER SIDE MIRROR LIGHT COALITION SENSON WAS ACTIVATING ALL THE TIME WHILE DRIVING ON THE HIGHWAY WITHOUT ANY CARS AROUND. NEVER NOTICED THIS HAPPENING BEFORE, BECAUSE I LIVE IN QUEENS NY AND I USUALLY DRIVE TO THE CITY AND I HAVE LOTS OF CARS ALL THE TIME SO IT'S CONSTANTLY TURNS ON AND OFF.",
        "vin": "3VV2B7AX2KM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/20/2019",
        "dateOfIncident": "04/03/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208709,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BIG MANUFACTURER DEFECT ISSUE ON TIGUAN WINDSHILED.   BOUGHT NEW 2016 VW TIGUAN ON 2016 APR, WINDSHIELD BROKE IN TWO WEEKS, WHILE I'M DRIVING IN A LOCAL WAY, SLIGHT TURING RIGHT, CROSSING TRAFFIC @45 MILE/H, (HWY 75 TO EAST EXCHANGE, ALLEN, TX, 75002) NO TRUCKS SEEN.   BOUGHT NEW 2019 VW TIGUAN ON 2019 MAR, WINDSHIELD BROKE IN APR, WITHIN A MONTH. A QUIET HIGHWAY, NO BIG TRUCKS PASSING BY, AND SPEED @ 65MILE/H.(HWY 75 @ RENNER)  ASKED DEALER TO REPORT AS QUALITY OR DESIGN ISSUE, WITH NO RESPONSE.",
        "vin": "3VV1B7AXXKM"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/18/2019",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208380,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAND NEW 2019 VW TIGUAN FWD NEXT DAY AFTER BUYING SHOWED MULTIPLE PROBLEMS THAT RELATED TO TRANSMISSION AND BREAKING AND A UNKNOWN SOURCE OF RATTLING SOUND.     I NOTICED WHEN I COLD START THE TIGUAN AND LET IT IDLE FOR 3-4 MINUTES THE NORMAL ENGINE SOUND SLOWLY GOES DOWN BUT A LOUDER AND MORE NOTICEABLE RATTLING SOUND COMES UP. IT IS HEARD WHILE DRIVING ALSO. IT'S CONCERNING BUT WHAT IS MORE CONCERNING IS THE THAT THE TIGUAN HESITATES WHILE SHIFTING GEARS.     I NOTICED IT HAPPENS WHILE ACCELERATING FROM A STOP. NOT ONLY IT HESITATES TO ACCELERATE YOU'D FEEL THE CARS STRUGGLE WHILE SHIFTING GEARS. EACH TIME THE GEAR IS SHIFTING YOU COULD FEEL THE CAR IS AT A CONFUSED STATE AND SO YOU FEEL IT THUMP.     AT OTHER TIMES I'VE EXPERIENCED THE CAR ALMOST STALLS WHERE THE RPM GOES UP BUT TRANSMISSION SLIPS. IT DOESN'T CHANGE GEAR.     THE WORST OF ALL IS THAT WHILE SLOWLY BREAKING THE CAR TRIED TO SPEED UP. THE RPM IS ALSO SEEN TO GO UP. THE VERY UNFORTUNATE NEWS IS THAT THOUGH THE DEALER'S TECHNICIAN DROVE WITH ME AND SAW THE ISSUE THEY DON'T HAVE A FIX. VW CORPORATION ALSO ISN'T PROVIDING A FIX. THERE'S OTHER REPORTS OF SIMILAR PROBLEMS.     THE TIGUAN HAS A KNOWN TRANSMISSION PROBLEM ACCORDING TO OTHER OWNER REPORTS. IT MAY NOT BE ALL TIGUAN BUT MY CAR IS A LEMON. THE PROBLEM PROBABLY HAS TO DO WITH WHICH LOCATION THE CAR WAS MANUFACTURED.     THIS IS A VERY BIG SAFETY CONCERN. I AM VERY WORRIED ABOUT SUCH ERRATIC ISSUES 2ND DAY. HOW DID VW GET PAST SAFETY BOARDS. THEY NEED TO SOLVE THIS ISSUE BEFORE DEVASTATING EVENTS SUCH AS DEATH OR OTHER THINGS OCCUR. NO VEHICLES SHOULD SLIP GEARS WHILE ACCELERATING NOR SPEED UP WHILE BREAKING.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/08/2019",
        "dateOfIncident": "02/22/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194689,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON DRIVING MY NEW 2019 VOLKSWAGEN TIGUAN THIS PAST WINTER. IT WAS A VERY COLD WINTER DAY, WHEN STARTING MY CAR IT WOULDN'T GO IN REVERSE. , THEN STARTED TO GO, IN REVERSE . I PUT IT INTO D DRIVE .. I WOULD PUTT ( GO AND STOP) LIKE IT WAS RUNNING OUT OF GAS . THERE WAS PLENTY OF GAS IN IT . IT CONTINUED TO DISPLAY THE EPC YELLOW WARNING LIGHT. THE LIGHT SIGNAL IS ENGINE CONTROL MALFUNCTION . I HAVE NOTIFIED MY DEALERSHIP I PURCHASED IT FROM. THE STATE IT WILL DO THAT WHEN IT IS VERY COLD OUT. IT IS NOW SPRING TIME. IT HAS DONE IT TWICE",
        "vin": "3VV287AX0KM"
    },
    {
        "components": "AIR BAGS,STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/01/2019",
        "dateOfIncident": "02/20/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183563,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FIRST DAY I DROVE MY NEW 2019 TIGUAN SEL HOME, I OPENED THE PASSENGER DRIVER-SIDE DOOR AND THE HANDLE GOT STUCK AND WOULD NOT GO BACK IN...MADE AN APPOINTMENT FOR 2-DAYS LATER TO GET THIS FIXED.    DURING THE 2-DAY WAITING PERIOD, I WAS STOPPED IN A TURNING LANE ON A FOUR-LANE, LIGHTED ROAD TO MAKE A U-TURN. WHEN I HIT THE GAS PEDDLE TO GO THE CAR JERKED FORWARD, AND WENT TO A STANDSTILL FOR ABOUT 5-SECONDS WHILE MY FOOT WAS FIRMLY PRESSING THE GAS PEDDLE. THIS CAUSED THE TWO ONCOMING VEHICLES TO HAVE TO SCREECH TO A STOP; AND THE VEHICLE IN THE MIDDLE LANE HAD TO SWERVE TO AVOID HITTING ME AND SPIN OUT. WHEN THE TIGUAN STARTED MOVING FORWARD, I HAD TO PULL OVER BECAUSE I WAS SHAKING. THE SAME ISSUE HAPPENED AGAIN THE NEXT DAY, BUT NO ONCOMING CARS WERE IN SIGHT.    WENT IN FOR THE DOOR APPOINTMENT, I TOLD THE SERVICE REP ABOUT ENGINE AND ASKED TO SPEAK TO A MANAGER. AN ASSISTANT MANAGER CAME OUT,  I TOLD HIM ABOUT THE ENGINE, AND HE RESPOND THAT'S A VW AND GAVE ME A HUG AND TWO FREE T-SHIRTS.     NEW DOOR HANDLE HAD TO BE ORDERED DUE TO CORROSION, HAD TO COME BACK 3-DAYS LATER TO HAVE IT FIXED. DURING THOSE 3-DAYS, THE PASSENGER SEAT SEAT BELT WARNING SOUND STARTED RANDOMLY GOING OFF, ALONG WITH THE AIRBAG LIGHT FLASHING ABOVE THE HAZARD LIGHT WHEN MY HANDBAG WAS ON THE SEAT. REPORTED THAT AND THE ENGINE ISSUE AGAIN AT NEXT APPOINTMENT. HAD TO LEAVE THE CAR FOR TWO DAYS...AT PICK-UP WAS TOLD EVERYTHING WAS TESTED FINE, BUT VW DID NOT BOTHER TO TEST THE SEAT SENSOR. WAS INSTRUCTED TO NOT PUT ANYTHING ON THE PASSENGER SEAT, AS STATED IN THE CAR'S MANUAL.    REQUESTED A NEW VEHICLE, OR LET ME OUT OF MY LEASE DUE TO FEELING TOTALLY UNSAFE...WAS DENIED BY BOTH CORPORATE AND DEALER.     MONEY SHOULD NEVER COME BEFORE SAFETY, SO I PAID $3000 TO BREAK MY LEASE TODAY AS VW CORP & DEALER TOLD ME TO GET BACK IN THAT CAR.    THIS IS A DEADLY SAFETY ISSUE.",
        "vin": "3VV3B7AXXKM"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/13/2019",
        "dateOfIncident": "02/12/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11179811,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR STOPPED ACCELERATING UNEXPECTEDLY IN THE MIDDLE OF THE FREEWAY WHILE I WAS DRIVING ABOUT 60MPH. ALL KINDS OF EMERGENCY LIGHTS CAME UP FOR NO APPARENT REASON, AND THE CAR BLOCKED. THE GEAR WAS LOCKED AND WOULDN'T RESPOND TO RESTARTING THE CAR. THE CAR HAD TO THE TOWED, AND AFTER GETTING IT IN THE TRUCK I REALIZED THAT ONE SIDE OF THE HEADLIGHTS WEREN'T WORKING. THE CAR HAS ONLY 1700 MILES.  A SIMILAR BUT LESS SEVERE EVENT HAPPEED THREES DAYS BEFORE. I TOOK IT TO THE DEALER'S SERVICE AND THEY SAID THEY COULDN'T FIND ANYTHING WRONG WITH THE CAR.",
        "vin": "3VV3B7AX9KM"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/18/2018",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162269,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH HEADLIGHT HAVE EXTENSIVE CONDENSATION WITHIN THE HEADLIGHT HOUSING. INCIDENT OCCURRED OVERNIGHT WHEN THE CAR WAS STATIONARY, IN A CLOSED PARKING LOT. CAR WAS DRIVEN FROM THE DEALER LOT TO THE CUSTOMER'S PARKING LOT A NIGHT BEFORE DURING RAINY WEATHER.     THE CONDENSATION COVERS THE LED MODULES OF THE TURN SIGNAL AT THE BOTTOM OF THE SAME HOUSING, AND DEPENDING ON THE OUTSIDE TEMPERATURE AND HOW LONG THE CAR WAS OPERATING, THE CONDENSATION MOVES UPWARDS TO THE FRONT OF THE LOW BEAMS. VOLKSWAGEN SERVICE DEPARTMENT STATES THIS INCIDENT IS NORMAL. NO ACTION WAS TAKEN ON TWO DOCUMENTED SERVICE VISITS FOR THE SAME ISSUE. FIRST INCIDENT OCCURRED WHEN CAR WAS ONE DAY OLD. CAR HAD APPROXIMATELY 15 MILES ON THE ODOMETER.",
        "vin": "3VV4B7AX0KM"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/01/2018",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11155365,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "NEW CAR WITH 9 MILES SAT IN THE GARAGE OVERNIGHT. IN THE MORNING,THERE WAS SPOTTING  CONDENSATION INSIDE ONE OF THE LIGHTS(DRIVER SIDE). DROVE IT TO THE DEALER AND BY THAT TIME CONDENSATION HAS OCCURRED INSIDE BOTH OF THE LIGHTS.",
        "vin": "3VV2B7AX7KM"
    }
]