[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/18/2021",
        "dateOfIncident": "11/18/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440877,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "BEETLE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "2019 VOLKSWAGEN BEETLE. CONSUMER WRITES IN REGARDS TO DEFECTIVE BRAKES.  THE CONSUMER STATED WHILE DRIVING THE VEHICLE, ON 3 DIFFERENT OCCASIONS, THE BRAKES WENT OUT. THE CONSUMER REQUESTED THAT THE VEHICLE BE BOUGHT BACK OR REPLACED. *JS",
        "vin": "3VWFD7AT1KM"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/08/2021",
        "dateOfIncident": "10/07/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436068,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "BEETLE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "Wheel Hubs and Wheel Bolts.  All four wheels and almost all the bolts affected.  Replaced rear Hubs & all Bolts, after a three bolts were unable to be removed without extra effort by a mechanic.  I have one bolt that indicates the bolt threads were deformed.  The issue could impact the ability of the bolts to hold the wheels on safely.",
        "vin": "3VW5DAAT0KM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "09/03/2021",
        "dateOfIncident": "08/15/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431672,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "BEETLE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "My 2019 VW Beetle, AT, keyless entry was parked in a store parking lot.  When I left the vehicle it wouldn't lock.  I thought my fob battery died.  I came out of the store about 30 minutes later and my car had rolled away.  It came to rest about 50 feet away, up against a fixed object light pole.  I was shocked!  My rear bumper sustained damage.  I got in my car and saw it was in D.  I guess I left it in D, turned off the push button start/stop and it rolled away after I left it.  I then did some checking and found that when push button start/stop tech is installed in many cars with the added safety features of audible sounds or transmissions ratcheting into park when stopped with transmission in Drive, which are standard safety features on most newer cars, but were not standard on my car. The car did not alert me to anything being wrong.  This is a safety hazard.  I noted that VW recalled their keyed entry Beetles for Rollaway Risks, but did not include key-less entry vehicles.  A call to VW ensued and a case number was assigned, #04874410.  Regional personnel Cathy was coordinating the case which she said caused an internal report to be filed.  On Sept 3 at approximately noon, she called me to say that the accident was my fault, for parking incorrectly, VW would not pay to have my rear bumper fixed, nor would they take any responsibility.  This Rollaway Risk could have been deadly, it could have been worse.  I would hate to see someone killed for being in similar circumstances.  VW is negligent in their response, these cars should be recalled for being a safety hazard to the general public.  I am deeply concerned with the nonchalant attitude of VW.  My husband's Lincoln ratchets into Park when he stops the car using the button if left in Drive.  Ford does the same thing.  Nissan makes an audible noise alerting the driver to something being amiss.  VW is not even on the ballpark on this, what a shame!",
        "vin": "3VWJD7AT5KM"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/17/2021",
        "dateOfIncident": "02/17/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396601,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "BEETLE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH THE DEFROSTER ON WHILE DRIVING IN TOWN, THE WINDSHIELD CRACKED FROM THE UPPER CORNER PASSENGER SIDE.",
        "vin": "3VWFD7AT4KM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/14/2020",
        "dateOfIncident": "07/14/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339418,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "BEETLE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STALLS WHILE DRIVING. THIS HAS HAPPEN A TOTAL OF 4 TIMES OVER A 10 DAYS.",
        "vin": "3VWFD7AT2KM"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/08/2020",
        "dateOfIncident": "03/05/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316854,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "BEETLE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "FUSE THAT CONTROLS READING OR MAP LIGHT IN CABIN AND EXTERNAL LIGHTING OUTSIDE FOR NIGHT DRIVING CONTINUALLY FAILS (3).  SAFETY ISSUE BECAUSE REAR LIGHTS AT NIGHT ONLY COME ON WHEN BRAKES APPLIED.",
        "vin": "3VWJD7AT8KM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/29/2019",
        "dateOfIncident": "12/27/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291941,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "BEETLE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY NEW 2019 VOLKSWAGEN S COUPE HAS A SIGNIFICANT TURBO LAG. SO MUCH SO, THAT I DO NOT FEEL SAFE DRIVING THE CAR. I WAS MAKING A TURN AT AN INTERSECTION AND IT WAS AS THOUGH THE CAR LOST ALL POWER WHEN I EXCELLERATED. IT GOES FROM NO EXCEATION WHEN MOVING FROM STOPPED POSITION TO SURGING VERY FAST UPON THE CAR AHEAD OF ME. I FEEL THAT THIS IS A VERY SERIOUS ISSUE AND THAT MY LIFE MAY BE AT RISK. IT SEEMS THE ACCRETION CANNOT BE CONTROLLED!! THIS IS A CONTINUING PROBLEM WHEN I AM  STOPPED AND HIT THE EXCELLERATOR TO GO FORWARD . I DON'T KNOW HOW MUCH LONGER I CAN DRIVE THE CAR  WITHOUT A SERIOUS CRASH!!",
        "vin": "3VWFD7AT1KM"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/02/2019",
        "dateOfIncident": "10/30/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277664,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "BEETLE",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT HEADLIGHT BEAM HAS A DISTINCTIVE BLIND SPOT ON THE LEFT SIDE AND A DOUBLE NOTCH ON THE RIGHT SIDE.  VOLKSWAGEN REFUSES TO ADDRESS THIS AS THEY SAY IT'S BY DESIGN THOUGH I HAVE SEEN ANOTHER BEETLE, SAME MODEL YEAR WITH THE SAME HIDS, HAVE A COMPLETELY NORMAL HEADLIGHT BEAM.   WITH THE BEAM LIKE IT IS, IT MAKES DRIVING THE CAR AT NIGHT UNSAFE, ESPECIALLY ON BLACK ASPHALT ROADS.  I'VE ESCALATED THIS TO VOLKSWAGEN OF AMERICA AND THEY INSIST THIS IS BY DESIGN AND IS DUE TO THE SHUTTER THAT COMES DOWN WHEN USING THE NORMAL HEADLIGHT BEAM.  OUR OTHER VEHICLE IS A GMC ACADIA WITH THE SAME SYSTEM AND IT DOES NOT DO THIS.  ON THE BEETLE THE IF I SWITCH IT TO HIGH BEAMS THE BLIND SPOT AND NOTCH GO AWAY.  ALSO VOLKSWAGEN CLAIMS THAT THE LEFT HEADLIGHT IS AIMED LOWER ON PURPOSE AS TO NOT BLIND ONCOMING TRAFFIC.  THE CAR SITS SO LOW I DON'T SEE HOW THAT'S NEEDED, ESPECIALLY WHEN OUR ACADIA WHICH SITS UP HIGHER DOESN'T DO THIS. I DID TAKE A LOOK AT A COUPLE OF OTHER 2019 BEETLES AT ANOTHER DEALERSHIP AND THE HEADLIGHT BEAMS WERE ALL DIFFERENT; STILL A BLIND SPOT AND NOTCHES BUT IN DIFFERENT SPOTS.       THE BLIND SPOT AND NOTCHES ARE SEEN BOTH STATIONARY AND IN MOTION.  I HAVE PICTURES AND VIDEO OF BOTH.  I FEEL THIS IS A DESIGN DEFECT THAT WILL LEAD TO AN ACCIDENT AT NIGHT AS  IT HINDERS THE DRIVERS VIEW ON THE LEFT SIDE.  VOLKSWAGEN HAS IGNORED MY CONCERNS AND REFUSES TO ADDRESS THIS.  I'M VERY CONCERNED FOR OUR SAFETY AND MY WIFE AND I REFUSE TO DRIVE THE CAR AT NIGHT BECAUSE OF THIS.  VOLKSWAGEN'S 'REMEDY' IS TO TRADE IT IN.   WE LOVE THE CAR, JUST NOT THE HEADLIGHTS AT NIGHT.  PLEASE INVESTIGATE.  I HAVE ATTACHED TWO PHOTOS; ONE LOW BEAM AND ONE HIGH BEAM SO THAT YOU CAN SEE THE DIFFERENCE.",
        "vin": "3VW5DAAT9KM"
    }
]