[
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "09/10/2020",
        "dateOfIncident": "02/01/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354266,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 VOLKSWAGEN PASSAT. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE COLLISION AVOIDANCE SYSTEM INDEPENDENTLY ACTIVATED CAUSING THE VEHICLE TO ABRUPTLY STOP EVEN THOUGH THERE WERE NO VEHICLES OR OBJECTS NEARBY. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER FAIRFIELD VW LOCATED AT 5071 LYCOMING MALL DR, MONTOURSVILLE, PA 17754 HOWEVER, THE CAUSE OF THE FAILURE WAS NOT DETERMINED. ADDITIONALLY, ON SEVERAL OCCASIONS THE VEHICLE WOULD NOT START WHEN PUSHING THE START/STOP BUTTON AND THE MESSAGE \"NO KEY DETECTED\" WAS SOMETIMES DISPLAYED. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE FAILURE MILEAGE WAS 15,000.",
        "vin": "1VWLA7A32KC"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/05/2020",
        "dateOfIncident": "03/29/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307253,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 VOLKSWAGEN PASSAT. THE CONTACT STATED WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE IDLED WITH THE EPC LIGHT AND THE CHECK ENGINE WARNING LIGHT ILLUMINATED. ADDITIONALLY, THE VEHICLE WAS BELABORED WHILE SHIFTING GEARS AND AT LOW SPEEDS. THERE WAS AN ABNORMAL SOUND COMING FROM THE ENGINE. THE VEHICLE WAS TAKEN TO THE DEALER (HERITAGE VOLKSWAGEN CATONSVILLE 6624 BALTIMORE NATIONAL PIKE, BALTIMORE, MD 21228) FOR DIAGNOSIS AND REPAIRS. THE CONTACT WAS INFORMED THAT THE FUEL PUMP MODULE AND FUEL INJECTORS NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE BUT OFFERED NO ASSISTANCE OR RESOLUTION. THE APPROXIMATE FAILURE MILEAGE WAS 6,000. *TP",
        "vin": "1VWLA7A39KC"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/17/2019",
        "dateOfIncident": "02/22/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289555,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS SOLD WITH REMOTE START FEATURE.  DEALER AND SALESMAN KNEW THE REMOTE START DID NOT WORK.  THIS WAS A SELLING POINT ON THE CAR.  THEY KEEP PUTTING OFF FIXING THE ISSUE WITH THE CAR.",
        "vin": "1WVMA7A37KC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/26/2019",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282392,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE VEHICLE IS AT SLOWER SPEEDS, IT IS CONSTANTLY SHIFTING TO TRY AND SAVE ON FUEL. THIS RESULTS IN THE VEHICLE NOT PROVIDING A CONSISTENT RIDE. THE NOISE WHEN IT SHIFTS IS VERY LOUD AND CAN SOMETIMES BE FELT THROUGH A JERKING MOTION. BRINGING THE VEHICLE IN TO THE DEALERSHIP RESULTED IN THEM SAYING THEY KNOW IT'S AN ISSUE AND HOPEFULLY VW COMES OUT WITH A SOFTWARE FIX. IT'S NOT COMFORTING KNOWING THAT THE DEALERSHIP KNOWS THERE'S AN ISSUE AND NOTHING IS BEING DONE.",
        "vin": "1VWLA7A35KC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/26/2019",
        "dateOfIncident": "10/06/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282393,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE VEHICLE IS OFF, THE FACTORY REMOTE START DOES NOT FUNCTION. THE CAR WILL TURN OVER, BUT IMMEDIATELY DIE. VW HAS KNOWN ABOUT THIS SINCE LATE 2018, BUT HAS NOT DONE ANYTHING TO FIX THE ISSUE. I PURCHASED MY VEHICLE IN JUNE OF 2019, AND THE VEHICLE WAS SOLD TO ME WITHOUT THE DEALERSHIP LETTING ME KNOW THE REMOTE START WOULD NOT WORK. I HAD TO FIND OUT MYSELF ON A COLD MORNING. I EVEN CALLED TO LET THEM KNOW WHAT WAS GOING ON AND THEY HAD ME BRING IT IN EVEN THOUGH THEY ALREADY KNEW THERE WAS AN ISSUE. HOW CAN VW GET AWAY WITH SELLING A FEATURE ON A VEHICLE THAT DOES NOT WORK A YEAR AFTER THEY ARE AWARE OF IT?",
        "vin": "1VWLA7A35KC"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "11/12/2019",
        "dateOfIncident": "11/11/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279616,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 11/10/2019 WHILE DRIVING I CONSTANTLY FELT BURNING SENSATION ON MY RIGHT THIGH WHILE ON THE HIGHWAY AT SPEEDS AROUND 70 MILES. THE NEXT DAY ON 11/11/2019 WITH THE FAMILY AND KIDS MY RIGHT THIGH STARTED FEELING LIKE ITS BURNING. SUBSEQUENTLY WE STARTED SMELLING SOMETHING BURN AND SWITCHED OFF ALL HEAT AND HEATED SEATS AND DROVE BACK HOME WITH OUT ANY HEAT IN 15 F . ON ARRIVAL WE NOTICED THAT THE HEATED SEAT GOT SO HOT THAT IT BURNT A HOLE IN THE DRIVER CAR SEAT AND MELTED THE LEATHER .  WE ALL GOT EXTREMELY SCARED OF A POSSIBLE FIRE IN THE CAR AND COULD HAD GOT INJURED OR STRANDED ON A VERY COLD DAY. THERE ARE 100'S OF SIMILAR ISSUES POSTED ONLINE BUT I AM NOT SURE WHY THIS IS NOT BEING FIXED. IF THE CLOTHS  FIRE CATCHES ON AND WE ARE ON A FREEWAY AT A HIGH SPEED THEN MY FAMILY'S LIFE COULD BE ENDANGERED IF I LOOSE CONTROL BECAUSE OF THIS BURN. THE CAR IS 2019 JANUARY VW PASSAT BOUGHT FROM VW  AND IS ALMOST BRAND NEW . I HAVE TAKEN A DEALER APPOINTMENT AND WILL BE VISITING ON 11/16/2019 TO GET THIS CHECKED AND PROBABLY FIXED. BUT SHOULD I TRUST THAT THIS WONT HAPPEN AGAIN ?",
        "vin": "1VWLA7A39KC"
    },
    {
        "components": "STEERING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/05/2019",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278248,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HESITATES ERRATICALLY AND UNPREDICTABLY WHEN ACCELERATING MOST NOTICEABLY FROM A DEAD STOP, AND AT SLOW SPEEDS WHILE TURNING. ATTEMPTING TO ACCELERATE FROM A STOP TO CROSS A STREET IN BUSY TRAFFIC THE CAR WILL JUST SIT UNRESPONSIVE FOR SECONDS AND BARELY ACCELERATE AND THEN UNPREDICTABLY ACCELERATE.  DUE TO THE VEHICLE BEING THE R-LINE, IT DRIFTS ALL OVER THE ROAD. I HAVE HAD 4 WHEEL ALIGNMENTS ON THE CAR WITH ONLY 6400 MILES ON IT.",
        "vin": "1VWMA7A3XKC"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/12/2019",
        "dateOfIncident": "07/08/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231408,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD BEGAN CRACKING IN THE MIDDLE FROM PASSENGER SIDE TOWARD DRIVER SIDE. NO ROCK OR OTHER DEBRIS HIT WINDSHIELD.  IT IS A CONTINUOUS CRACK THAT IS A FINE LINK CRACK THAT CONTINUES TO SPREAD.",
        "vin": "1VWLA7A35KC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/29/2019",
        "dateOfIncident": "06/02/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228401,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "SPEEDOMETER READS 2 MPH LOWER THAN ACTUAL SPEED AT 70 MPH AS MEASURED BY RADAR INSTRUMENTS ON ROAD AND MY GPS WHICH READS THE SAME AS THE RADAR.  I ALSO AM DRINKING A LOANER VEHICLE OF THE SAME MAKE AND MODEL AND READS 1 MPH SLOWER AT 70 MPH.  ALSO HAVE HAD MANY PROBLEMS WITH THE VEHICLE AIR CONDITIONING.  THEY ALSO LIED ABOUT THE FUEL ECONOMY POSTED ON THE WINDSHIELD.  IT IS CONSISTENTLY LOWER THAN THE MILEAGE LISTED BOTH FOR CITY, HIGHWAY, AND AVERAGE.  THIS IS ALSO TRUE ON THE LOANER VEHICLE.  ALMOST LIKE THE DIESEL EMISSIONS PROBLEM THEY HAD WITH MY 2015 PASSAT!",
        "vin": "1VWLA7A30KC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/16/2019",
        "dateOfIncident": "04/11/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196817,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "NORMAL HEEL TOE RELATIONSHIP BETWEEN GAS PEDAL AND BRAKE IMPOSSIBLE. WHILE DRIVING, I WENT TO STEP ON BRAKE. POSITION OF PEDAL WAY AHEAD OF GAS PEDAL. RESULT I WAS PUSHING DOWN ON FIRE WALL. WHEN I TRIED TO STEP ON BRAKE, MY FOOT WAS TRAPPED BEHIND THE BRAKE PEDAL.",
        "vin": "1VWLA7A32KC"
    }
]