[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/27/2020",
        "dateOfIncident": "08/20/2020",
        "fire": false,
        "manufacturer": "Hawkeye Leisure Trailers, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351495,
        "products": [
            {
                "manufacturer": "Hawkeye Leisure Trailers, Ltd.",
                "productMake": "YACHT CLUB",
                "productModel": "1825B",
                "productYear": "2019",
                "type": "Vehicle"
            },
            {
                "manufacturer": "TREDIT TIRE & WHEEL CO INC",
                "productMake": "TREDIT",
                "productModel": "TREDIT",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "ON THE DATE INDICATED AND FOURTEEN MILES INTO A TRIP, THE RIGHT REAR TREDIT RAINIER ST145R12 TIRE THAT CAME ON MY TANDEM AXLE BOAT TRAILER PURCHASED NEW IN JULY 2019 SUFFERED A BLOWOUT WITH COMPLETE TREAD SEPARATION AT 55MPH.  AMBIENT TEMPERATURE WAS 84 DEGREES AT THE TIME, THE ROADWAY WAS IN GOOD CONDITION WITH NO HAZARDS, AND IT IS A 75 MILE TWO LANE 55MPH MAX SPEED LIMIT ROUTE WE TAKE EVERY TWO WEEKS DURING THE SUMMER.  THE TREAD WRAPPED AROUND THE TRAILER AXLE, BENT A 3/16\" STEEL FENDER BRACKET WELDED TO THE FRAME, AND TORE THE FENDER OFF.  THE TIRES HAD LESS THAN 3000 MILES ON THEM, THE TRAILER WAS KEPT IN A GARAGE, AND THE TIRES WERE ALWAYS INFLATED TO THE MANUFACTURER SPEC OF 80PSI COLD.  THE OTHER THREE TIRES WERE CHECKED WHEN I PULLED OVER TO CHANGE THE TIRE.  THEY WERE COOL TO THE TOUCH AND READ 82PSI, AND ALL TIRES WERE VERIFIED AT 80PSI BEFORE LEAVING HOME. I INSTALLED MY SPARE AND I REMOVED THE OTHER TIRES WHEN I GOT HOME.  THERE I FOUND THAT THE LEFT FRONT TIRE WAS BALLOONED TO ABOUT AN INCH LARGER DIAMETER THAN THE OTHER TWO TIRES.  I HAD IT REMOVED FROM THE WHEEL AND FOUND LARGE BUBBLES INSIDE ALL THE WAY AROUND THE TIRE INDICATING THE TREAD WAS SEPARATING FROM THE BELT LAYER ON IT AS WELL AND IT WAS A MIRACLE THAT IT DIDN'T BLOW OUT AS WELL DURING THE TRIP.  THE DATE CODE ON ALL FOUR TIRES IS 4418, AND WHAT I ASSUME IS THE MOLD CODE IS TR088-01 ON THE REARS AND TR088-02 ON THE FRONTS SO THE TWO FAILED TIRES WERE NOT ONLY DIFFERENT AXLES AND SIDES OF THE TRAILER BUT ALSO DIFFERENT MOLDS.  I REPLACED ALL FOUR NEARLY NEW TIRES THAT WERE STILL UNDER WARRANTY WITH ANOTHER BRAND AT MY OWN EXPENSE.  I STARTED A WARRANTY CLAIM WITH TREDIT TIRE & WHEEL, THE WARRANTY/TIRE PROVIDER, REQUESTING REIMBURSEMENT NOT REPLACEMENT BECAUSE I WOULD NOT PUT THOSE TIRES ON ANY VEHICLE AGAIN AND KEPT THE REMOVED TIRES SHOULD THEY REQUIRE INSPECTION.",
        "vin": "4H1062724K0"
    }
]