[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/11/2021",
        "dateOfIncident": "10/04/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436324,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "GIULIA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving at highway speed when the glass sunroof exploded without warning. It had been functioning as expected prior to this. Some glass entered the vehicle, but there were no injuries. The vehicle is available for inspection and is scheduled to be inspected by an insurance rep. It has already been inspected by a dealer representative, who claimed damage was caused by debris striking the vehicle, however I have DASH CAM VIDEO that  contradicts this version of events.( I will forward video upon request. ) Manufacturer has denied warranty coverage for repair which includes paint damage from broken glass.",
        "vin": "zarfanbn0l7"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/15/2021",
        "dateOfIncident": "06/08/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429152,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "GIULIA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "inaccurate fuel gauge reading i have sent it to the dealer two times it still not reading correct the fuel gauge stays at three quarters. even i fill it to the top. the dealer told me to read the owner manual or i am not filling it correct.0608",
        "vin": "zarfaman7l7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/15/2021",
        "dateOfIncident": "01/16/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408310,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "GIULIA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKUP CAMERA IS VERY DIM ESPECIALLY ON THE VERY OUTSIDE OF THE VIEW.   NOT BRIGHT ENOUGH TO DISCERN PEDESTRIANS WALKING BEHIND THE VEHICLE WHICH COULD POSSIBLY CAUSE BODILY HARM.  DEALER SAYS IT IS WITHIN THEIR SPECIFICATIONS AND THERE IS NOTHING THEY CAN DO.  I'VE FOUND SEVERAL FORUMS ON THIS VERY SUBJECT AND SOME CLAIM THERE IS A FIX USING A COMPUTER PROGRAM THAT LIGHTENS THE CAMERA TO A USEFUL LEVEL.   I TOOK THIS ISSUE UP TO THEIR CUSTOMER CARE AND THEY SAY THE DEALER CAN'T DO ANY MORE AND THE CASE IS CLOSED.  I HAVE HAD SEVERAL VEHICLES, ALL MAKES AND MODELS AND NOT ONE OF THEM HAD A CAMERA THIS DANGEROUS.",
        "vin": "ZARFAMANXL7"
    }
]