[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/20/2022",
        "dateOfIncident": "01/19/2022",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448154,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Yesterday I driving my AUDI Q5 2020 on the expressway , then with no warning multiple warning and error messages suddenly appeared on dashboard. The Entire car immediately shut down in middle of the expressway, no  time  for me to put on my hazard, no time for me to safely pull over ..With difficulty moving it to safety.   The car wouldn't start and I was in the middle of the expressway which put me at great risk along with my  passengers and surrounding vehicles.... I was scared and shocked    Very dangerous !!!!",
        "vin": "WA1Anafy1l2"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/30/2021",
        "dateOfIncident": "11/24/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442139,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Gateway control modular failure.  At dealer currently. We took pictures. Multiple reports of the exact same thing on Audi forums online.  Audi confirmed same issue.   While driving car it suddenly stopped and the emergency brake was automatically applied.  No warning, no way to Live the car to safety, all the warning lights began to flash, windows started to rolling up and down. Then the car just turned off. Unable to start it, turn it on, move it, nothing.   Needed a special tow truck to have it towed to dealer.   A serious safety issue. I am 8 m pregnant, had my brother and 4 year old nephew in car.   I am concerned for my safety but equally concerned for every Q5 has this gateway module in this location.  Every person driving a Q5 and other drivers can be affected by the design flaw of the location/ lack of protection of this  gateway module.    We were lucky we were not on the highway. What if this happened on a highway at high speeds or in a curve.",
        "vin": "Wa1bnafy5l2"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/15/2021",
        "dateOfIncident": "07/14/2020",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11421025,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "On July 14, 2020, my daughter and I drove my leased Audi Q5 to Cari’s sister’s home. As I pulled in the driveway, and before I turned off the vehicle and exited the car, smoke began to billow from the engine compartment and enter the interior. My daughter and I were suddenly engulfed by white smoke, and evacuated the vehicle immediately. With the use of a garden hose and fire extinguishers, my sister, brother-in-law, and I were able to subdue the fire until the fire department arrived and extinguished it fully. My Audi Q5 was totaled due to this fire that, suddenly and without warning, engulfed the engine compartment. After the incident, Audi inspected the vehicle.  Ultimately, Audi stated that the cause/origin of the engine compartment fire was due to the turbocharger electronic waste gate malfunction.             My daughter and I were stunned, shocked, and scared by the car’s sudden and unexpected combustion. Naturally, the trauma and terror of having a car ignite for seemingly no reason are significant, and weigh on my daughter and me. First, the terror of having to fend off a car fire from surrounding people and property is arduous and horrible. Second, my daughter, to this day, still thinks that a car in which she is a passenger may erupt in flames at any given moment. She does not realize that this may have been a one-off accident, and fears simply riding in a vehicle as a result. No person should have to go through the harrowing experience of pulling their daughter out of a burning car and extinguishing the fire before it can damage even more property or take a life. Importantly, the smoke that engulfed the vehicle’s passenger compartment exacerbated my asthma. For months after the incident, my breathing was strained and I suffered more severe asthma symptoms. Audi/VW made a minimal offer and I have had to engage attorneys to seek compensation for the damages my daughter and I suffered as a result of this incident.",
        "vin": "WA1ANAFYXL2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/13/2020",
        "dateOfIncident": "08/09/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349103,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY PURCHASED A 2020 AUDI Q5.   IT WAS 6 WEEKS OLD AND HAD ABOUT 2300 MILES ON THE ODOMETER.   WHEN PULLING OUT OF A PARKING SPACE THE CAR DIED.  I COULD NOT GET IT STARTED NO MATTER WHAT I DID.  I COULD NOT EVEN GET THE FLASHERS TO TURN ON (TO THE IRE OF THOSE TRYING TO EXIT THE LOT.)      AFTER HAVING IT TOWED (I WAS ON VACATION, NO LESS!) I LEARNED THAT THE ELECTRICAL DISTRIBUTION SYSTEM WAS DEFECTIVE AND HAD TO BE REPLACED.  I AM JUST GRATEFUL THIS DID NOT GIVE OUT ON A 55 + MPH HIGHWAY, WHICH COULD HAVE BEEN LIFE THREATENING.      ALSO, SINCE THE GEAR SHIFT IS ELECTRIC, THERE IS A WAY TO PUT THE CAR IN NEUTRAL FOR TOWING PURPOSES.  THIS SYSTEM DID NOT WORK AND MY CAR HAD TO BE TOWED BACKWARD WHILE IN DRIVE.",
        "vin": "WA1ANAFY8L2"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/27/2020",
        "dateOfIncident": "02/20/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322405,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "OVERALL PROBLEM:      AUDI Q5 2020 APPEARS TO HAVE A COMPUTER MALFUNCTION THAT INSTANTLY DISABLES ALL SYSTEMS. VEHICLE 'SHUT ITSELF OFF' AT A BRIEF STOP AND BECAME VERY DIFFICULT TO CONTROL, ROLLING INTO INTERSECTION.     DETAILS:    I STOPPED CAR AT RESIDENTIAL NEIGHBORHOOD STOP SIGN (BRIEF AND COMPLETE STOP, NO WAIT), IMMEDIATELY READY TO PROCEED FORWARD. AUDI'S 'AUTO STOP/START' FEATURE SHUT OFF THE ENGINE, THEN IMMEDIATELY ALL ELECTRONICS SHUT DOWN. THE CAR BASICALLY 'TURNED ITSELF OFF.'     VEHICLE THEN BEGAN DRIFTING/COASTING INTO INTERSECTION. CONTROLS WERE UNRESPONSIVE. I REALIZED THE POWER BRAKES AND POWER STEERING WERE DISABLED. I BRAKED VERY HARD, WHICH STOPPED THE CAR. HAD TO KEEP BRAKES PRESSED VERY HARD TO KEEP CAR FROM MOVING. IGNITION BUTTON WAS UNRESPONSIVE.    I THEN NOTICED A SMALL MESSAGE ON THE DASHBOARD CONTROLS WHICH READ SOMETHING LIKE 'START/STOP IGNITION SYSTEM DISABLED ' PUT CAR IN P.' (THIS WAS THE ONLY WORKING ELECTRICAL FEATURE I NOTICED, THE EVENT WAS FRIGHTENING AND DISORIENTING, BUT I'M FAIRLY SURE NOTHING ELSE WAS FUNCTIONING). I THEN SHIFTED GEARSHIFT TO PARK, AND WAS ABLE TO START THE CAR AND DRIVE AWAY.    I REPORTED PROBLEM TO DEALER. DEALER CLAIMED TO INSPECT VEHICLE, AND SAID THEY WERE UNABLE TO FIND ANYTHING WRONG. DEALER SAID VEHICLE'S COMPUTER HAD NO RECORD/MEMORY OF THE INCIDENT. DEALER ALSO SEEMED RESISTANT TO PROPERLY DOCUMENTING THE INCIDENT ON THEIR PAPERWORK.    I REPORTED THE PROBLEM TO AUDI CORPORATE IN AUBURN HILLS MI, EXPLAINING I NO LONGER FELT SAFE DRIVING THIS CAR, AND WOULD NOT DRIVE IT AGAIN. AUDI CLAIMED TO PERFORM THEIR OWN INVESTIGATION, AND THEIR BRIEF REPLY SAID THAT THEY WERE NOT OBLIGATED TO DO ANYTHING UNDER APPLICABLE LEMON LAWS.    CAR WAS IN 3RD MONTH OF LEASE, ~150 MILES. PREVIOUSLY I DROVE AN AUDI A4 2017 FOR 3 YEARS SO I WAS/AM VERY FAMILIAR WITH THE WAY AUDIS OPERATE.",
        "vin": "WA1BNAFY3L2"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/29/2020",
        "dateOfIncident": "11/30/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315339,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ANY TIME MY APPLE CELL PHONE SE MODEL IS IN THE PASSENGER SEAT, THE  SEAT BELT UNBUCKLED ALARM INTERMITTENTLY IS ACTIVATED ON THE DASH. I SEE THIS AS A SAFETY ISSUE PARTICULARLY IF A CHILD WAS IN THE BACK SEAT, SINCE IT COULD BE REALIZED AS A FALSE ALARM, BUT ACTUALLY BE A TRUE UNBUCKLING SOMEWHERE IN THE VEHICLE. THIS OCCURS WITH THE VEHICLE IN MOTION, BUT THE PHONE STATIONARY (IE. NOT TRAVELING OVER ROAD BUMPS, POTHOLES OR CORNERING) AND IS UNPREDICTABLE. THIS HAS BEEN OCCURRING SINCE I TOOK POSSESSION NOV 30 LAST YEAR AND WAS NOT ABLE TO BE RECTIFIED BY THE  DEALERSHIP OR BY THEM CONTACTING AUDI CENTRAL FOR GUIDANCE.  ALL THAT WAS DONE  WAS RESETTING THE ELECTRONICS TO FACTORY SETTINGS WHICH DID NOT SOLVE THE PROBLEM.  ONLY SUGGESTION WAS NOT TO ALLOW THE PHONE TO SIT IN THE SEAT?",
        "vin": "WA1CNAFY7L2"
    }
]