[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/04/2022",
        "dateOfIncident": "03/03/2022",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455274,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "On more that one occasion, after starting the car and putting the car in drive, the display continues to show that the car is in PARK. I can drive several hundred feet with the display showing PARK. Then the display will go totally dark and, after several seconds, it will show that the car is in DRIVE.",
        "vin": "waud8af21ln"
    },
    {
        "components": "ELECTRICAL SYSTEM,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "11/12/2021",
        "dateOfIncident": "06/09/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440289,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Various components and system malfunctioned.  Vehicle is in dealership for 3rd time on electrical/software/hardware troubles, SOS module.  Yes, the vehicle is available for inspection.  The car stopped me on a major highway thinking that I was not available \"Emergency Assist, Driver take over the wheel\" when I had both hands on the wheel, going straight and was fully in control of the vehicle.  The car slowed down from 70 mph and the trailing truck behind me almost rear ended me.  Yes, the problem has been confirmed by the dealer.  The vehicle and components are being inspected/serviced at the Fort Collins Audi dealer.  Yes, warning messages as well as the vehicle pumping on the break and jerking the seat belt.  These started in Jun 2021 at 1400 miles and continued to the time I turned in the vehicle on 19 Oct 2021 at approx 13500 miles. I am attaching an 11 page documentation of dates, times and mileage of each incident that the vehicle's computer systems are not functioning properly and the safety features are not reliable or make the driver feel safe with bogus warnings, or warnings that are erroneous.",
        "vin": "WAUE8AF25LN"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "10/26/2021",
        "dateOfIncident": "06/09/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438252,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "- Multiple computer/modules/safety features.  YES, the vehicle is available for inspection - The Emergency Assist with Driver Not available came on and slowed my car down to the point I almost got rear ended by the truck that came up from behind - The problemS randomly occur and are intermittent, but I have accurate documentation of when they have occurred. The dealer has my Audi A6 now for the 3rd time with the same issues.  They just told me that they saw a lane assist problem occur but did not give me details. - The vehicle is currently at the dealer for the 3rd time and they are talking with the manufacturer - Yes, plenty of warnings coming up and have started Jun 2021 at 1400 miles  I have kept track of when my car has given erroneous or real issues over the last few weeks.  When I bring the vehicle in today, 19 Oct 2021, it is the third time you will have it in for the same issues.   The car is scaring me because the safety issues are not safe and it seems as if the sensors are not working properly and seeing things that are not there and activating without any concerns to do so.    One of these times, the emergency assist came on when I was driving highway speeds and had both hands on the wheel going straight on a dry road and sunny skies (13 Oct), beeped at me 4-5 times with the message continuing to show on dash, the car jerked with the automatic brakes being pumped and no driver intervention as the seat belt was tightening on me, kept the emergency assist on to slow me down to the point that I almost got rear ended by the truck that was following me.  I was driving normally/straight on a straight road within the lines with both hands on the wheel and there was NO reason for the emergency assist to come on.  This is only one example of the car having a mind of it’s own when it is not warranted.  I am afraid that the vehicle will CAUSE me to have an accident instead of protecting me from one. I have word doc of dates/times of incidents, too numerous to list.",
        "vin": "WAUE8AF25LN"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "07/19/2021",
        "dateOfIncident": "06/14/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425432,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I have multiple safety features that are suddenly malfunctioning. The care suddenly braked when traveling at 80mph in the HOV lane.  The pre sense function suddenly braked the car while another was passing in the opposite direction.  The emergency assist tried to steer me into a car in the lane adjacent to mine.  Multiple warning messages have appeared in the dash board.  This is blamed by my dealer on a software update that recently occurred.  He states that he has multiple other similar complaints.  He has only suggested that I turn these safety features off and has had not solution to repair them.   I feel like my vehicle is an accident waiting to happen.  The date below is when these things began to happen",
        "vin": "waum2bf2xln"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/17/2021",
        "dateOfIncident": "04/18/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425258,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "This issue has been happening since I got the car and is getting worse by the day. The car only has about 11,000 miles and I bought it when it had almost 10,000 miles.  Something in the dashboard and behind the instrument panels (A/C Controls and User Screens) makes a lot of Vibration Noises/Sounds as the car is slowly accelerated or as we drive over some uneven road. It seems like there is something loose. And this is getting worse by the day. When you pay a top price for a luxury car like Audi you expect that the care is built solid and not with cheap parts... it is very disappointing to see that a luxury car like Audi A6 will make these type of noises when the car is practically brand new.",
        "vin": "WAUE8AF2XLN"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/27/2021",
        "dateOfIncident": "02/27/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398232,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AUTOMATED EMERGENCY BRAKING RANDOMLY KICKS IN.. THIS HAS HAPPENED TWO TIMES IN THE PAST 3 MONTHS.  NOTHING WAS AROUND TO CAUSE THE AEB TO ACTIVATE.  THIS COULD HAVE CAUSED A SERIOUS ACCIDENT IF SOMEONE WAS DRIVING BEHIND ME AT THE TIME. IT JOLTED PASSENGERS IN THE CAR. THE CAR CAME TO A COMPLETE STOP AND NOTHING IN THE VICINITY, NO ONCOMING TRAFFIC, NO PEDESTRIANS, NO ANIMALS....",
        "vin": "WAUL2AF2XLN"
    }
]