[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/10/2022",
        "dateOfIncident": "03/10/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456018,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "OnStar system and WiFi intermittently do not work, was told that this is a known issue when radio is being used, no fix. In my case radio was not being used, so this does not apply.  Seat/mirror position memory gradually changes over time. Does not recognize that exit function has been turned off.  Signal lights randomly flash (without indicator on dash flashing) when car is at idle & mirrors are folded.   Tire Pressure monitoring system, not accurate and will notify driver that tires are underpressured by 10lb or more. Dealership reset them and are now fine.  Brakes on passenger front randomly grind since day one of ownership  Dealership told me that there is an obvious electrical issue, however since no codes are being thrown, they cannot repair it. Best that can be done is to continue to drive it and show up at a dealership when problems are occurring. OnStar diagnostics was able to determine vehicle was not connecting. Dealership indicated they'd let GM know about the issue, but nothing else could be done for what is a relatively new vehicle. Also was told they would not ensure that vehicle was not affected by structural issues because the VIN was not listed",
        "vin": "5gaevbkw7lj"
    },
    {
        "components": "VEHICLE SPEED CONTROL,WHEELS,FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "06/17/2021",
        "dateOfIncident": "06/04/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421292,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "On June, 4th, 2021 in the morning I went to Markham Park with my 13 year old daughter for the covid vaccine. We arrived and right after the shot on her we stopped our Tesla in a line where we should wait for about 15/20 minutes to see if everything was fine with my daughter. While the car was stopped in the line, I was talking to my daughter and the car started moving in the direction of the car in front of us and it hit the car many time till I turned the steering wheel to go away from there. Everything was very fast and confusing. I`m still trying to understand what happened with the car. The car was out of control and the car never tried to break or stop. I think it has stopped because I pressed the P button. I am so frightened and scared about what happened. My daughter and I, the passengers in the car in front of us and the people in the park could have been seriously injured. I opened a report at Tesla in the same day.",
        "vin": "5gaerbkwxlj"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "05/19/2021",
        "dateOfIncident": "03/08/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11417759,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONTACT OWNS A 2020 Buick Enclave C1. THE CONTACT STATED THAT HIS WIFE REVERSED OUT OF THE GARAGE HOWEVER HAD TO STRAIGHTEN THE WHEELS. THE CONTACT PLACED THE GEAR IN THE DRIVE AND WITHOUT WARNING, THE VEHICLE ACCELERATED FORWARD CRASHING INTO THE GARAGE DOOR. NO AIRBAGS DEPLOYED. MEDICAL ATTENTION WAS CONTACTED. A POLICE REPORT WAS MADE. THE CONTACTS WIFE SUSTAINED INJURIES TO HER BACK AND NECK (WHIPLASH). THE CONTACTS WIFE SUSTAINED A SEIZURE 3 ADDITIONAL TIMES ON THE WAY TO THE HOSPITAL WHICH SHE STAYED AT OVERNIGHT. THE VEHICLE WAS TOWED BY INSURANCE TO A COLLISION SHOP FOR REPAIRS TO THE FRONT-END BUMPER AND GRILL. NO DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED A CASE NUMBER. THE FAILURE MILEAGE WAS APPROXIMATELY 2,000.",
        "vin": "5GAERBKW7LJ"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/10/2021",
        "dateOfIncident": "04/02/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415777,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 BUICK ENCLAVE. THE CONTACT STATED THAT WHILE DRIVING DOWNHILL AT APPROXIMATELY 75 MPH, THE VEHICLE DECELERATED TO APPROXIMATELY 20 MPH WITH 'CAN NOT SHIFT IN THIS POSITION' MESSAGE DISPLAYED ON THE INSTRUMENT PANEL. THE VEHICLE WAS TOWED TO SOMERSET BUICK LOCATED AT 1850 W. MAPLE RD, TROY, MI 48084, WHO DIAGNOSED THAT THE FUEL TANK SENSOR WAS FAULTY. THE FUEL TANK SENSOR WAS REPLACED HOWEVER, THE FAILURE RECURRED. THE TRANSMISSION SERVICE REQUIRED MESSAGE WAS DISPLAYED ON THE INSTRUMENT PANEL. THE CAUSE OF THE FAILURE WAS NOT YET DETERMINED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 7,100.",
        "vin": "5GAEVAKW8LJ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/08/2021",
        "dateOfIncident": "02/12/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415643,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE GRINDING NOISE",
        "vin": "5GAEVBKW2LJ"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/14/2020",
        "dateOfIncident": "12/13/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383291,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FACTORY RUNNING BOARDS ON 2020 BUICK ENCLAVE ICE UP IN WINTER DRIVING BLOCKING THE DRIVER AND PASSENGER DOORS FROM OPENING.  VEHICLE CAN BE PARKED AND IF ICE ACCUMULATES OR SNOW MELTS AND FREEZES THE DOOR WILL NOT OPEN.  IF VEHICLE IS IN MOTION AND ICE/SLUSH BUILD UP AND FREEZE THE DOORS WILL NOT OPEN.",
        "vin": "5GAERDKW3LJ"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/10/2020",
        "dateOfIncident": "12/09/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11382917,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A STATE HIGHWAY WITH OPEN FIELDS ON BOTH SIDES.  THERE WERE NO OTHER CARS OR TRUCKS ON THE ROAD.  CLEAR BLUE SKY AND THE TEMPERATURE WAS ABOUT 50 DEGREES.  NO WINDOWS WERE OPEN IN THE CAR.  I WAS ON CRUISE CONTROL AT 62 MPH.  THERE WAS WHAT I CAN ONLY DESCRIBE AS AN EXPLOSION SOUND SOMETHING CLOSE TO THE SOUND OF A 45ACP PISTOL DISCHARGE..  LUCKILY I HAD THE SUN SCREEN CLOSED OR I WOULD HAVE HAD GLASS EVERYWHERE.  THE FRONT SUNROOF HAD EXPLODED AND THERE WAS A 18\" HOLE IN THE MIDDLE OF IT.  THE FORCE OF THE BREAK WENT UP, MEANING THE EDGE OF THE BROKEN GLASS WAS RAISED ABOUT AN INCH AND A HALF ABOVE THE REST OF THE GLASS AND WINDOW FRAME.  THAT KIND OF A BREAK IS CAUSED BY STRESS NOT FROM SOMETHING LIKE A STONE HITTING IT..  THE CAR WAS PURCHASED IN AUGUST SO THE CAR IS ONLY 4 MONTHS OLD.  I IMMEDIATELY DROVE THE CAR TO BERGSTROM MOTORS IN GREEN BAY, WISCONSIN, FOR THEM TO FIX IT.  THEY TOOK PICTURES.  SERVICE MANAGERS NAME IS [XXX].  HE HAS ALL THE INFORMATION.  THERE IS NO POLICE REPORT.  [XXX] GOT BACK WITH ME TODAY, DECEMBER 10, 2020, AND TOLD ME BUICK WOULD NOT PAY FOR THE REPAIRS BECAUSE IT'S GLASS.  I WAS TOLD THE REPAIR WOULD BE ABOUT $1000.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "5GAEVCKW2LJ"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/27/2020",
        "dateOfIncident": "11/22/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376503,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE JERKS AT LOW SPEEDS WHEN ACCELERATING.  BRAKES GRIND WHEN APPLIED AT HARD BRAKING OR REGULAR BRAKING.",
        "vin": "5GAEVCKW8LJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/08/2020",
        "dateOfIncident": "09/10/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363339,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR SUNSHADE CLIP HAS BROKEN TWICE IN THE 5 MONTHS.",
        "vin": "5GAERBKW4LJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/01/2020",
        "dateOfIncident": "06/13/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331938,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT BRAND NEW  2020 BUICK ENCLAVE, WITH 4 MILES ON IT, ON 6/13/20. STARTED HAVING TRANSMISSION PROBLEMS ALMOST IMMEDIATELY. THE CAR WOULD JERK HARD (HARD SHIFT) WHEN PUSHING ON THE GAS AND ALSO ANYTIME IT WAS PLACED IN PARK. ON 6/21/20 THE CHECK ENGINE LIGHT CAME ON AND THE VEHICLE WOULD BARELY SHIFT. CALLED LOCAL BUICK - GM DEALERSHIP TO GET REPAIRED. LOCAL SHOP RESTARTED COMPUTER ON 6/24/20 AND SAID THAT IT WAS GOOD TO GO. DROVE IT LESS THAN 3 MILES BEFORE SERVICE ENGINE LIGHT CAME BACK ON AND JOLTING STARTED AGAIN. ON THE DRIVE BACK TO THE DEALERSHIP THE VEHICLE CAME TO A HARD JOLTING ABRUPT STOP ON THE ROAD. VEHICLE WOULD NO LONGER START OR SHIFT. HAD TO LEAVE VEHICLE IN THE MIDDLE OF THE ROAD UNTIL DEALERSHIP COULD COME GET IT. ON 6/26/20 DEALERSHIP CALLED TO SAY THAT THE VEHICLE WAS RUNNING GOOD AND READY TO PICK UP. ON 6/27/20 DROVE CAR ABOUT 15 MINUTES BEFORE THE HARD SHIFT STARTED HAPPENING AGAIN AND THE CHECK ENGINE LIGHT CAME BACK ON. WHEN ATTEMPTING TO SHIFT INTO REVERSE, THE VEHICLE HARD JOLTED US BACKWARDS AND THEN DIED. THE VEHICLE WOULD NO LONGER START OR SHIFT GEARS. ON 6/28/20 GOT THE VEHICLE TO START SO DROVE THE VEHICLE, AS IT WAS STILL HARD SHIFTING, BACK TO THE DEALERSHIP AND DROPPED IT OFF. THE DEALERSHIP STILL HAS IT AS OF TODAY AND HAS REFUSED TO GIVE US ANY PAPERWORK FROM OUR PREVIOUS 2 ATTEMPTS AT GETTING IT FIXED HOWEVER GAVE US FALSIFIED DOCUMENTATION STATING THAT WE ONLY BROUGHT IT IN THE SHOP 1 TIME, WHEN IT ACTUALLY IS THE 3RD TIME TO BE TAKEN IN FOR THE SAME PROBLEM TO BE FIXED. GM HAS REFUSED TO REPLACE THIS DEFECTIVE VEHICLE NOR RETURN OUR MONEY PAID FOR IT.",
        "vin": "5GAERBKW4LJ"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/22/2020",
        "dateOfIncident": "06/21/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330057,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A 2020 BUICK ENCLAVE, (OWNED BY GMC) WITH 6 MILES ON IT, 1 WEEK AGO. YESTERDAY THE CHECK ENGINE LIGHT CAME ON AND THE CAR STARTED JERKING ANYTIME THE TRANSMISSION SWITCHED GEARS. I CALLED TO TRY TO GET IT IN TO A CERTIFIED BUICK DEALERSHIP TO BE LOOKED AT AND NOWHERE CAN GET IT IN FOR 3-5 DAYS AND NONE OF THE DEALERSHIPS WILL GIVE A LOANER CAR UNTIL THE TIME OF THE VEHICLE APPOINTMENT. I CONTACTED BUICK DIRECTLY REGARDING THIS AND THEY TOLD ME THE SAME THING, THAT WE CAN'T GET A SAFE DRIVING VEHICLE, UNTIL THE ONE WE HAVE CAN BE LOOKED AT BY A DEALERSHIP AND IF WE TAKE IT TO AN UN-CERTIFIED SHOP THAT IT WOULD NOT BE COVERED. SO NOW I AM STUCK WITH EITHER DRIVING AN UNSAFE CAR 50 MILES ON THE HIGHWAY TO WORK FOR THE NEXT FEW DAYS OR NOT BEING ABLE TO GO TO WORK. THIS IS A BRAND NEW CAR DRIVEN STRAIGHT OUT OF THE FLOOR ROOM! BUICK IS PUTTING PEOPLE'S LIFE AT RISK BY INSISTING THAT WE DRIVE THIS UNSAFE VEHICLE ON THE HIGHWAY UNTIL WE CAN GET IT LOOKED AT! LOOKS LIKE A HUGE LAWSUIT IN THE MAKING!!!!!  *TR",
        "vin": "5GAERBKW4LJ"
    }
]