[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/19/2022",
        "dateOfIncident": "12/11/2020",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452950,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "RYKER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 Ryker 600 has wobble on left hand turns. Has been in for service 9 times (currently in at this time).  Concern is I am going to loose control and end up in a ditch, off the side of a mountain or hitting another vehicle.  Before wobble started bike would throw VSS codes.",
        "vin": "3JB2FEF25LJ"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/11/2021",
        "dateOfIncident": "09/04/2021",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432553,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "RYKER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "While riding the bike with my 9 year old son as a passenger we came up on a slow vehicle.  Attempted to pass in a passing lane to the left side of the slow car, we were traveling about 50 mph.  The both lanes were flat and straight with no rough pavement.  I got into the left land and throttled to accelerate.  Once slightly ahead of the car I started to turn to the right to complete the overtake and upon pulling the handlebars to initiate the turn it stated hard braking both front wheels like the abs kicked in.  I released throttle and kept straight and now the car is beside us again. Throttled into a little to attempt to pass again and the same thing happened again.  When attempted to turn right it started locking both front brakes up.  This time I noticed vss flashing on dash.  I throttled hard this time as the car was now beside us and held on for dear life and once moving straight and not turning it quit the braking / shaking.  We pulled off  up the road and gathered our thoughts and even the slow car stopped to check on us and thought our wheel was falling off. Only happened those 2 times and thes rest of day was fine. Truly a dangerous situation and if it had been my wife on my bike instead of my 60lb son, i don't think I could've overpowered the jerking of the handlebars and I think we would've wrecked.",
        "vin": "3JB2GEG29LJ"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/26/2021",
        "dateOfIncident": "07/26/2021",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426526,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "RYKER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The dealership refuses to perform the safety recall because I did not purchase the vehicle from them",
        "vin": "3jb2feg20lj"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/14/2020",
        "dateOfIncident": "11/25/2020",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383352,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "RYKER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 CAN-AM RYKER. THE CONTACT STATED THAT WHILE DRIVING 20 MPH, HE HEARD AN ABNORMAL CLUNKING SOUND COMING FROM THE FRONT PASSENGER'S SIDE WHEEL. UPON INSPECTION, THE CONTACT DISCOVERED THE LUG NUT HOLDING THE WHEEL WAS BARELY TIGHTENED AND COULD BE LOOSENED BY HAND. DESPITE THE NUT BEING TIGHTENED AFTER THE INITIAL FAILURE, THE FAILURE PERSISTED SHORTLY AFTER. DUE TO THE FAILURE, THE CONTACT HAD THE VEHICLE TRANSPORTED TO HIS RESIDENCE. NEITHER THE DEALER NOR THE MANUFACTURER WERE NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 350.",
        "vin": "3JB2GEG26LJ"
    },
    {
        "components": "WHEELS",
        "crash": true,
        "dateComplaintFiled": "09/12/2020",
        "dateOfIncident": "09/07/2020",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11354625,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "RYKER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT RIGHT WHEEL (TIRE AND HUB) CAME OFF AT ABOUT 50MPH. THEN STRUCK ANOTHER MOTORCYCLE RIDER",
        "vin": "3JB2FEF27LJ"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/13/2020",
        "dateOfIncident": "02/08/2020",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309051,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "RYKER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 CAN-AM RYKER. THE CONTACT STATED THAT WHILE HIS DAUGHTER WAS DRIVING ABOUT 25 MPH, THE PASSENGER'S SIDE FRONT WHEEL DETACHED FROM THE VEHICLE. THE VEHICLE WAS TAKEN TO THE TAMPA BAY POWER SPORTS DEALER, LOCATED AT 13521 N FLORIDA AVE, TAMPA, FL 33613, WHERE THE CONTACT WAS REFERRED TO THE MANUFACTURER. THE CONTACT WAS ALSO INFORMED THAT THE VEHICLE MIGHT HAVE STRUCK AN OBJECT THAT CAUSED THE FAILURE. THE MANUFACTURER DECLINED TO TAKE RESPONSIBILITY FOR THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 750.",
        "vin": "3JBVWAV22LK"
    }
]