[
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/13/2022",
        "dateOfIncident": "12/09/2021",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456527,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Grievance/Complaint for 2020 X5 BMW Firer December 9, 2021 (49 days Owner) I was on my way to work, and I stopped at the local Bank of America drive through. While on my way, I received two (2) malfunction message saying the same thing, “ Scam Likely 1-470-781-9727; (Check Control)   Vehicle key missing, Close message; Vehicle key not available or malfunctioning. Drive-ready mode cannot be started. See Driver’s Manual for further information.”  (This was the message/malfunction.) I took a picture and call my salesperson, Mr. Preston at BMW of Gwinnett Place and informed him that the key was in the cup, so I tried to place it on the dashboard.  I did not understand why I received a malfunction message the key missing because the car would not go anywhere without a key, however, he asked me to send the picture to him and I did. As I was getting out my X5, I began to have anxiety and became traumatized (praying, crying, yelling etc.) at this point, thinking my X5 is going to catch a fire and blow up the bank. I went into the Bank to alert them of the X5 smoking so that they can evacuate if needed. I went back to my X5 to gather as much as I could of my Christmas gifts and other Items quickly.  At that time another lady was standing on the side walk and asked if she could help me removed the items from my X5.I was hysterical, and my hand was bleeding from grabbing items out the X5. My safety and others was at risk. The X5 could have been in my garage on firer and my house and family could have died and lost everything; The seat belt could have locked with me in it and I could have died. The bank ATM drive through could have blown up and all the customers could have been injured.BMW of North America insisted that I fill on my insurance because the the engineers did an observation investigation and did not see any fault of manufacture or electrical issue.The vehicle is now under the investigation of my insurance and I have not been notified of the cause at this time.",
        "vin": "5UXCR4C0XLL"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/09/2021",
        "dateOfIncident": "04/08/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443270,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Purchased the car Feb 2020.  Over 6 months ago, back seat belts (middle and left side) stopped working.  Seat belt will not click.  Brand new car with nonfunctioning seat belts.  Been trying to get hold of the dealer to fix and did not get anywhere.  After months of hassle, they ordered the seat belts to be replaced.  After dropping off the car, I get an email asking me to approve the fix for a cost of $1,100.    Want to report malfunctioning unsafe car with nonworking seat belts (brand new car, a little over 1 year old) and a dealer that want to charge me for their malfunctioning seat belts.  anyone that get in the car in the back is not safe.  cannot use the car due to safety issues.",
        "vin": "5UXCR6C02L9"
    },
    {
        "components": "ELECTRICAL SYSTEM,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "09/23/2021",
        "dateOfIncident": "09/23/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434061,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "My 2020 X5 is equipped with Rear Cross Traffic Warning however it does not warn when traffic is crossing.  The car will be in reverse, i can be very close to either a car or a person and there are no audible or visual warnings until the object stops moving or is within inches of the vehicle.  I have taken it to my dealership several times however they are stating its in full working function even though it does not do what BMW advertises how that system should work.  This is both very dangerous and false advertising by BMW!  I have videos to prove this claim however the upload section doesn't allow videos.",
        "vin": "5UXCR6C08L9"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "07/25/2021",
        "dateOfIncident": "07/25/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426368,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Backing out of my garage to a street with a 25 mph speed limit, the vehicle is supposed to alert the driver with a warning sound and or brake if a vehicle is crossing behind the vehicle.  This feature has never worked and the dealer can't find any problem.  This condition has been report on several internet websites with no resolution.",
        "vin": "5UXCR6C08L9"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "05/24/2021",
        "dateOfIncident": "05/22/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418267,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Automatic braking system.  Traveling about 50 MPH the automatic brake activated, there was nothing even close to my vehicle, my passenger's head was jerked forward. I had the vehicle in for computer problems about two weeks ago, concerning the radio and dash board displays, not knowing about the automatic braking problem at that time, ( this is the second incident involving the automatic brake, first time I didn't think too much about it since I had just purchased the vehicle I thought maybe a new car bug ). I was told that there was no fix for the problems I took it in for , and that Germany was notified and they had no solution, when a fix was found I would be notified. Now I'm now realizing more is affected by the faulty computer system then I first thought. My main concern is getting rear ended on the highway which I travel quite often. This incident occurred Saturday evening, today I'm contacting the dealership, we will see what happens with a more serious problem.",
        "vin": "5UXCR6C04L9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/28/2020",
        "dateOfIncident": "10/25/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366895,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AUTO-DIMMING FEATURE OF THE DIGITAL INSTRUMENT PANEL ON 2020 BMW X5 MODELS IS POORLY IMPLEMENTED, AND UNDER VARIABLE LIGHTING CONDITIONS (CLOUDY, SNOWY, SUNRISE, SUNSET), IT DIMS AT INAPPROPRIATE TIMES, SUCH AS WHEN DRIVING TOWARD THE SUN AT SUNRISE OR SUNSET.  THIS MAKES THE DISPLAY EXTREMELY DIFFICULT TO READ AND UNSAFE.  THE AUTO-DIMMING FEATURE FOR THE INSTRUMENT PANEL IS ONLY APPROPRIATE UNDER NIGHT-DRIVING CONDITIONS.",
        "vin": "5UXCR6C08L9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/16/2020",
        "dateOfIncident": "08/12/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349724,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SAMSUNG GALAXY S9 PHONE SEEMS INCOMPATIBLE WITH MY X5. ABOUT EVERY 30 MINUTES THE NAV DISPLAY AND HALF THE INSTRUMENT PANEL BLACK OUT FOR ABOUT 10 SECONDS THEN RESTARTS. THIS OCCURS ON THE HIGHWAY AND IN THE CITY.",
        "vin": "5UXCR6C01L9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/17/2020",
        "dateOfIncident": "06/13/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329328,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITIONING QUIT WORKING ON DAY 2 OF OWNERSHIP.  DEALER SAYS THE COMPRESSOR NEEDS TO BE REPLACED AND THERE IS A LEAD TIME BETWEEN 2 WEEKS AND 2 MONTHS.  AFTER PURCHASING A CAR THAT COST ABOUT $125,000 AND DRIVING IT ONE TIME, IT HAD TO BE SENT TO THE SHOP.  SINCE IT IS SO HOT WHERE I LIVE, DRIVING THE CAR IS OUT OF THE QUESTION.  BMW DID GIVE ME A LOANER CAR, BUT THE VALUE OF THE LOANER IS ABOUT 45% OF THE CAR I PURCHASED.  *TR",
        "vin": "5YMJU0C07L9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/14/2020",
        "dateOfIncident": "05/07/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324581,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "NAVIGATION DISPLAY AND RIGHT SIDE OF INSTRUMENT PANEL GO BLANK INTERMITTENTLY AND THEN RESET AND COME BACK ON AFTER ABOUT 10 SECONDS. DISPLAY GOES OFF DURING PERIODS OF DRIVING AND OR STATIONARY WITH VEHICLE ENGINE RUNNING. OCCURS DURING TIMES AT HIGHWAY SPEEDS AND CITY DRIVING.  *TR",
        "vin": "5UXCR6C01L9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/21/2020",
        "dateOfIncident": "04/20/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321779,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE HAS NOT BEEN INVOLVED IN ANY ACCIDENTS AS A FUNCTION OF THIS DESIGN FLAW.  THE FOLLOWING OCCURS WHEN VEHICLE IS IN MOTION OR STATIONARY:  DURING DAYTIME DRIVING, WHEN HEADLIGHTS ARE NOT TURNED ON, THE DIGITAL INSTRUMENT PANEL AND DIGITAL CONTROL PANEL DIM UNDESIRABLY, MAKING THEM DIFFICULT TO READ AND CREATING UNSAFE DRIVING CONDITIONS.  THIS IS UNDESIRABLE BEHAVIOR IS MOST PREVALENT ON CLOUDY DAYS AND AT SUNRISE AND SUNSET.  THE DIMMING NEEDS TO BE INACTIVE IF HEADLIGHTS ARE OFF.  IF HEADLIGHTS ARE ON, IT NEEDS TO BE INACTIVE IF BRIGHT LIGHT IS DETECTED THROUGH WINDSHIELD (SUNRISE, SUNSET) -OR- IF BRIGHT LIGHT IS DETECTED INSIDE THE CABIN.",
        "vin": "5UXCR6C08L9"
    }
]