[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/28/2022",
        "dateOfIncident": "02/05/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458675,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "My 2020 Silverado HD truck requires a replacement wiring harness and DEF tank and is basically inoperable. This is a known issue for GM and spans multiple model years.GM continued to produce throughout multiple model years knowing that owners may be stranded and unable to use these vehicles because of the defective parts. Hardships for owners would include loss of income and exposure to various dangerous conditions. The DEF tank has a heater system that can get exposed to the DEF fluid because of a poor design and poor manufacturing standards resulting in short circuit. GM will replace the wiring harness and combination tank/heater assembly under warranty. The parts are supposedly on NATIONAL BACK ORDER, yet GM continues to manufacture and ship new 2022 models with the required parts needed for repairs. GM will not provide alternate transportation. Supposedly in excess of ten thousand trucks are affected. Warm climate owners and warm temperatures may affect this issue positively. GM has no policy for a timely response to this issue. Trucks will become unsafe to operate when the electronic controls limit the truck speed to 5 mph or less. An operator may become stranded and exposed to dangerous highway conditions if stranded with this issue.",
        "vin": "1GC4YNEY4LF"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/27/2022",
        "dateOfIncident": "01/24/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458547,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The DEF heater/tank shorted out. The DEF system has thrown a code 3 times in the little over a year I’ve owned the truck. This final time I was told that the tank needs to be replaced. The truck has now been in the shop for 2 months and there is still no ship date on the replacement tank. The tanks are on a national back order. From what I understand there are about 9,000 people waiting for this DEF tank countrywide. I now have a $60k work truck that I am paying for but cannot use with no reasonable end in sight.",
        "vin": "1GC4YLEY2LF"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/18/2022",
        "dateOfIncident": "03/12/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457303,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Service DEF message in truck that will soon result in reduced speed. Local and purchasing dealers both stated a new DEF tank is needed. A tank is not available and is on back order.",
        "vin": "1GC4YLEY7LF"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/14/2022",
        "dateOfIncident": "03/14/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456577,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "DEF tank heater short causes wiring harness to melt and fault on diesel trucks, enabling limp mode. Limp mode is dangerous when hauling trailers over long distances.  Faulty part is on 6 month backorder. No reparations from GM.",
        "vin": "1gc4yley4lf"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/11/2022",
        "dateOfIncident": "01/22/2022",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451528,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Chevrolet Silverado 2500 HD. The contact stated that while driving at 50 MPH, a warning alarm engaged and advised that there was an emission system issue and the vehicle needed to be serviced within 160 miles. The transmission warning light illuminated. The contact stated that she parked at some point to run an errand and upon restarting the vehicle, a death issue system alarm engaged indicating that the vehicle needed to be repaired within 90 miles. The vehicle was taken to the local dealer where the failure was diagnosed as a dead issue and one of the pins on the wiring harness had burnt and was starting to melt. The local dealer informed the contact that the death tank and wiring harness needed to be replaced; however, the parts for the repair were not available the vehicle was not drivable. The vehicle was not repaired. The manufacturer was notified of the failure and advised the contact the parts for the repair were not available. The vehicle was not repaired. The failure mileage was approximately 20,000.",
        "vin": " 1GC4YPEY3L"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/10/2022",
        "dateOfIncident": "01/10/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446923,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "While plowing, my ABS brake light came on along with a warning that the ESC was disabled and a trailer brake system warning.. This appears to have been a recall for 2020 1500's but I have a 2500. It would appear the recall needs to be expanded.",
        "vin": "1gc4yme79lf"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "12/07/2021",
        "dateOfIncident": "12/04/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443007,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Truck on its own Shift from Park to Drive on its own while at idle.  Summary: My 2020 Silverado 2500HD was in the driveway idling in Park.   The vehicle was empty and I was checking the garage for screws from a project I had just completed and I wanted to make sure they were all picked up before I parked the truck in the garage so that I did not get a flat tire.    After looking for screws and assuring myself everything was cleaned I proceeded into the third bay of our garage and right behind me by an inch the truck proceeded into the garage at a good rate of speed and crashed into the house.  I quickly ran through the third bay and to the vehicle as it was still wanting to proceed into the house.   I quickly shifted it into Reverse from Drive backed up about 2 to 3 feet and placed the truck back into Park again and placed the emergency brake on and shut the truck off...",
        "vin": "1GC4YREY7LF"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/01/2021",
        "dateOfIncident": "11/17/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442206,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The brake pads which were installed from the factory are known by GM as being defective. This was acknowledged when technical bulletin 20-NA-020 was released.   The brake pads were know to contain low scorch friction material which can lead to premature wear.   When this was discovered, GM began installing new pads which have a high scorch friction material and feature a new lining shim on the backing plate.   GM failed to notify their customers of this problem. GM has done this deliberately since once the vehicle reaches over 7,500 miles, the pads are no longer under warranty.   I discovered my vehicle was effected from this due to increasingly hearing a high pitch screeching sound coming from the vehicle. After immediately noticing the issue, I scheduled a service appointment and conducted my own research of this issue. This is when I discovered the technical bulletin. Due to my vehicle having over 7,500 miles, I was advised the cost for replacement is my responsibility.   The cost for replacement including parts and labor from Chevrolet is approximately $750-$800.  This issue is a direct safety concern and a known problem which GM failed to notify their customers of. GM deliberately withheld this information to shift the cost burden of replacement to customers beyond the 7,500 mile warranty period.",
        "vin": "1GC4YNEY2LF"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/08/2021",
        "dateOfIncident": "06/25/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423913,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Chevrolet Silverado 2500. The contact stated while driving 38 mph, he noticed the steering wheel was loose. The contact started to hear an abnormal sound coming from the vehicle. The contact stated while driving over a small bump in the roadway, the vehicle inadvertently steered to the right. The contact took the vehicle to the local dealer however, the mechanic was unable to duplicate the failure. The contact took the vehicle to an independent mechanic, where it was diagnosed with needing the pitman arm and idler arm to be replaced. The contact called the local dealer and made them aware of the repair that was needed on the vehicle. The vehicle was not repaired. The manufacturer was informed of the failure. The failure mileage was approximately 20,000.",
        "vin": "1GC4YREY3LF"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/16/2021",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417370,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Front brakes are squealing and don’t seem to stop like they should. Loud squeal starting at 5,000 miles and still continuing.",
        "vin": "1GC4YNEYXLF"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "04/22/2021",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413375,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 CHEVROLET SILVERADO 2500. THE CONTACT STATED THAT THE REAR BACK UP CAMERA FAILED TO OPERATE AS NEEDED WHILE DRIVING OVER A BUMP. THERE WAS NO WARNING LIGHT ILLUMINATED. THE CONTACT SPOKE WITH RESSLER CHEVROLET (8474 HUFFINE LN, BOZEMAN, MT 59718) WHERE HE WAS INFORMED THAT THERE WAS NO FIX FOR THE FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND A CASE WAS FILED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "1GC4YME74LF"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/24/2021",
        "dateOfIncident": "02/19/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397721,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 CHEVROLET SILVERADO 2500. THE CONTACT STATED THAT WHILE DRIVING, THE VEHICLE INDEPENDENTLY SHIFTED INTO FOUR WHEEL DRIVE. THE CONTACT STATED THAT THE VEHICLE WAS MANUALLY SHIFTED BACK INTO DRIVE. THE CONTACT STATED THAT THE FAILURE DESTROYED THE FRONT END, THE DIFFERENTIAL, AND AXLE. THE CONTACT WAS CONCERNED THAT THAT THERE WAS A MANUFACTURER'S DESIGN FLAW WITH THE VEHICLE. THE VEHICLE WAS TAKEN TO RADLEY CHEVROLET (3670 JEFFERSON DAVIS HWY, FREDERICKSBURG, VA 22408) HOWEVER, THE TECHNICIAN WAS UNABLE TO DUPLICATE THE FAILURE. THE VEHICLE WAS LATER TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE FRONT DIFFERENTIAL WAS DAMAGED AND NEEDED TO BE REPLACED. THE TECHNICIAN MENTIONED THAT THE FAILURE WAS DUE TO THE DESIGN FLAW OF THE AUTO MODE FEATURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 8,400.",
        "vin": "1GC4YREY3LF"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/22/2021",
        "dateOfIncident": "02/03/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397309,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE IS LESS THAN 1 YEAR OLD WITH ABOUT 11500 MILES. MY SERVICE EXAUST SYSTEM WARNING LIGHT ILLUMINATED AND PROVIDED A WARNING THAT MY SPEED WOULD BE REDUCED IN A SET AMOUNT OF MILES. AFTER ADDING ADDITIONAL DEF FLUID TO DETERMINE IF THAT WAS THE ISSUE MY CAR THE CAR RETURNED AN ERROR OF SERVICE DEF SYSTEM. THIS THEN LOWERED THE AMOUNT OF DRIVING MILEAGE UNTIL MY CAR WOULD BE FORCED TO A REDUCED SPEED. THIS OCCURRED WHILE OPERATING THE VEHICLE AND MAY HAVE RESULTED IN DAMAGE TO MY VEHICLE OR OTHER MOTORIST WHEN TRAVELING ON AN EXPRESSWAY. THE DEALER EXPLAINED THAT THEY HAD OTHER CARS IN FOR THE SAME ISSUE AND IT TOOK OVER A MONTH TO GET THE PARTS IN FOR REPAIR. ADDITIONALLY GM HAS PROVIDED NO GUIDANCE OR WARNING REGARDING THE ISSUE.",
        "vin": "1GC4YNEY6LF"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/02/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394327,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS A DIESEL HAS ABOUT 13,000 MILES ON IT ONLY. RECEIVED A WARNING ON THE DASH WHILE VEHICLE WAS IN MOTION THAT THE DEF SYSTEM HAS AN ISSUE AND TO SEE THE OWNER MANUAL. SAYS ABOUT 80 MILES UNTIL MAX SPEED WILL ONLY BE 65 MPH. TOOK TO DEALER AND STATED THAT IT IS THE DEF PUMP IN THE TANK. THE PART IS ALMOST IMPOSSIBLE TO GET RIGHT NOW BECAUSE IT HAS BEEN FAULTY ON SO MANY OF THESE VEHICLES AND HAS NEEDED REPLACEMENT. HAVE TO LEAVE VEHICLE AT DEALERSHIP UNTIL THEY CAN GET A PART IN OTHERWISE VEHICLE CANNOT BE DRIVEN.",
        "vin": "1GC4YREY0LF"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/22/2021",
        "dateOfIncident": "01/22/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389395,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKES HAVE BEEN SQUEALING REALLY LOUD. IT DOES NOT MATTER IF THE TRUCK IS CLEAN OR DIRTY THE BRAKES WILL SQUEAL. THEIR IS A SERVICE BULLETIN OUT TO FIX THIS PROBLEM ON TRUCKS BUILT BEFORE 9/01/2019, BUT SINCE MY TRUCK WAS BUILT ON 9/09/2019 THE PROBLEM SHOULD HAVE BEEN FIXED. THE DEALER DOES NOT WANT TO REPLACE THE BRAKES EVEN THOUGH THEY SQUEAL. THE BRAKES SQUEALING CONTINUE TO BE A PROBLEM AND SHOULD ALSO BE REPLACED UNDER WARRANTY ON TRUCKS BUILT AFTER 9/09/2019.",
        "vin": "1GC4YREY6LF"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/13/2021",
        "dateOfIncident": "07/03/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387819,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "AT HIGHWAY SPEEDS OF 55-80MPH THE VEHICLE HAS A CONSTANT VIBRATION IN THE STEERING WHEEL.  THIS HAS BEEN A PROBLEM SINCE PURCHASED BRAND NEW IN JULY '20.  AT 1,350 MILES, IN AUGUST '20, I HAD THE TIRES ROTATED AND BALANCED, NOTHING CHANGED.  AT 5,700 MILES, IN JANUARY '21, I HAD THE TIRES ROTATED AND BALANCED AGAIN, NOTHING CHANGED.  I FOUND THAT GM HAS A TSB OUT BUT IT IS NOT A RECALL TO FIX THE ISSUE OR REPLACE THE BAD TIRES.  SEE GM TSB #19-NA-240.",
        "vin": "1GC4YREYXLF"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/08/2020",
        "dateOfIncident": "12/07/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378488,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "AT SPEEDS ABOVE 58MPH THE STEERING WHEEL VIBRATES TERRIBLY. THE TRUCK HAS BEEN AT THE DEALERSHIP 16 HOURS OUT OF THE LAST 20 DAYS I HAVE OWNED IT. THEY HAVE DONE OVER A DOZEN ALIGNMENTS AND TIRE BALANCES WITHOUT MAKING IT ANY BETTER. I HAVE ASKED FOR TIRE REPLACEMENTS OR OTHER CHANGES TO THINGS THAT WOULD MAKE IT VIBRATE AND THEY SAY NOTHING IS WRONG WITH THE TIRES. SEEMS LIKE THEY ARE STUMPED ON WHAT TO DO OTHER THAN CONTINUING TO BALANCE THE TIRES.",
        "vin": "1GC4YPEY7LF"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/05/2020",
        "dateOfIncident": "12/05/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378011,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING IN A SNOW STORM AND THE HEADLIGHTS PACKED IN VERY THICKLY WITH HEAVY WET SLUSHY SNOW AND NO LIGHT WENT THROUGH AND I COULD NOT SEE THE ROAD. THE HEADLIGHT LENS AND THE SURROUNDING TRIM FORM A V-SHAPED TROUGH AROUND THE LIGHT THAT DOESN'T ALLOW THE SNOW TO SLIDE OFF FROM WIND AND BUMPS.  THE SHAPE ACTUALLY ENCOURAGED SNOW TO ACCUMULATE  AND COVER THE ENTIRE LENS AND THE LED LIGHTS RUN SO COOL THEY DON'T CAUSE ANY SNOW TO MELT. I HAD TO PULL OFF THE ROAD AND CLEAN THE HEADLIGHTS MANUALLY TWICE DURING A 26 MILE TRIP.",
        "vin": "1GC4YNE7XLF"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/25/2020",
        "dateOfIncident": "04/12/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376297,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FOLLOWING A VEHICLE WITH 4-5 CAR LENGTHS BETWEEN, THE VEHICLE IN FRONT OF US DID A PANIC STOP IN HEAVY TRAFFIC. WHEN TRYING TO STOP OUR NEW TRUCK AL IT DID WAS SKID WITHOUT ANY NOTICEABLE ABS ACTIONS. WE WERE TRAVELING APPROXIMATELY 65MPH AT THE TIME OF THE PANIC STOP. TRUCK ONLY HAD 4000 MILES ON IT AT THE TIME OF THE ACCIDENT. ROADS WERE DRY.",
        "vin": "1GC4YME74LF"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/27/2020",
        "dateOfIncident": "10/27/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366768,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "10/26/20 WHILE TRAVELING ON THE FREEWAY FOR THE LAST FEW DAYS, I NOTICED THAT THE STEERING FELT LOOSE. I TOOK THE TRUCK TO LES SCHWAB TO HAVE THE TIRES CHECKED AS A PRECAUTION. ON 10/27/20 I INADVERTENTLY RAN OVER SEVERAL POTHOLES ON THE FREEWAY AND THE FORCE OF THE PASSENGER SIDE TIRE HITTING THE POTHOLE FORCED THE STEERING WHEEL OUT OF MY HAND. I HAVE OWED THIS VEHICLE JUST UNDER TWO WEEKS, WHICH WAS BOUGHT NEW AND CURRENTLY HAS 630 MILES ON THE ODOMETER. WHILE RESEARCHING, I CAME ACROSS ANOTHER POST WITH SIMILAR STEERING ISSUES. NOT SURE IF THIS IS ISOLATED; HOWEVER THE DEALER WILL BE NOTIFIED IN THE MORNING.",
        "vin": "1GC4YWE77LF"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/23/2020",
        "dateOfIncident": "10/22/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366110,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THREE DAYS AFTER PURCHASING MY 2020 CHEVY 2500 SILVERADO, ON SEPTEMBER 28TH, 2020 AROUND 1253 I TRIED TO START MY TRUCK AND IT WOULDN'T START.  THE TRUCK TURNED OVER BUT SEEMED LIKE IT WASN'T GETTING FUEL.  I THEN RECEIVED A DIAGNOSTIC ALERT.  AFTER CHANGING THE RELAY THE TRUCK RAN FINE.  I THEN SCHEDULED TO TAKE IT IN TO THE DEALER ON OCTOBER 5,2020 TO HAVE A DIAGNOSTIC DONE ON THE TRUCK AND THEY FOUND NOTHING.  THE VERY NEXT DAY IT DID THE SAME THING ON OCTOBER 6TH, 2020.  I THEN SCHEDULED TO HAVE IT TAKEN IN AGAIN AND FOUND OUT THAT THE FUEL CONTROL MODULE ON SEVERAL OTHER GM VEHICLES WHERE FAULTY ON NEW VEHICLES.  I HAD TO CANCEL MY SECOND APPOINTMENT DUE TO THE DEALER WOULDN'T PROVIDE ME WITH A LOANER CAR WHILE THEY WORKED ON MY TRUCK.  THIS VEHICLE IS UNDER WARRANTY.  THEN AGAIN ON THE OCTOBER 20TH, 2020 THE VEHICLE WOULD NOT START.  AFTER CHANGING OUT THE RELAY SWITCH IT SEEMED TO RESET THE SYSTEM AND STARTS AND RUNS FINE AND THE CHECK ENGINE LIGHT GOES OFF.  I WORK IN EMERGENCY SERVICES AND NEED MY TRUCK TO RUN WHEN I TURN THE KEY OVER.  THERE'S NO COMMON FACTOR LEADING TO THIS LACK OF TURNING OVER.  AND MY DEALER IS NOT WORKING WITH ME TO COME TO A SOLUTION TO THIS PROBLEM.  THIS HAS HAPPENED ON 3 OCCASIONS AT RANDOM TIMES.",
        "vin": "1GC4YNE76LF"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/07/2020",
        "dateOfIncident": "04/23/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363162,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS SEVERAL ELECTRICAL / COMPUTER PROBLEMS  INCLUDING BUT NOT LIMITED TOO. ELECTRIC PARKING BRAKE APPLIES ITSELF AT CERTAIN TIMES. HILL START ASSIST ALSO APPLIES ITSELF AT TIMES BOTH ON LEVEL GROUND. EXCESSIVE PRESSURE NEEDED TO STOP VEHICLE COMING DOWN EXPRESSWAY RAMP WITH DIESEL EXHAUST BRAKE ON AND NO TRAILER ATTACHED. BRAKES SMELL HOT AFTER STOPPING. VEHICLE WAS STOPPED WITH ELECTRIC BRAKE PROBLEM & HILL START ASSIST. BRAKE SMELL WAS AFTER VEHICLE WAS STOPPED FROM DRIVING APPROX. 25 MILES. EXCESSIVE BRAKE PRESSURE WAS NEEDED TO STOP VEHICLE ON GRADE WITH DIESEL EXHAUST BRAKE ON. UNKNOWN REASON FOR THESE PROBLEMS. ELECTRIC PARKING BRAKE SELF APPLIES WHEN GETTING OUT OF VEHICLE AFTER PLACING GEAR SHIFT IN PARK. HILL START COMES ON AT TRAFFIC LIGHT, TRUCK IN GEAR WHEN ACCELERATING FROM STOP. I HAVE CELL PHONE PHOTOS OF THE PARKING BRAKE ACTING UP BUT DO NOT KNOW HOW TO TRANSFER THEM.",
        "vin": "1GC4TPEY9LF"
    },
    {
        "components": "STEERING,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/01/2020",
        "dateOfIncident": "09/29/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362314,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER OWNING THE BRAND NEW TRUCK FOR LESS THAN 24 HOURS (APPROXIMATELY 170 MILES ON THE ODOMETER OF THE VEHICLE), I WAS DRIVING IN A STRAIGHT LINE ON A 2 LANE HIGHWAY AT APPROX. 50-55MPH. MY FOOT WAS LIGHTLY ON THE ACCELERATOR, MAINTAINING SPEED, AS I HAD JUST PASSED THROUGH A TRAFFIC CIRCLE ABOUT A MILE PRIOR, AND WAS IN A SMALL LINE OF \"TRAFFIC\" TRAVELLING ON THE ROAD. THE REAR WHEELS BEGAN TO LIGHTLY SHAKE (IT FELT SIMILAR TO DRIVING ON RUMBLE STRIPS) FOR APPROXIMATELY 3-5 SECONDS, THEN SEVERAL WARNING LIGHTS ON THE DASH LIT UP AND THE TRUCK VIOLENTLY \"JERKED\" THEN PULLED AND DRIFTED ONTO THE RIGHT SIDE OF THE ROAD, ONTO THE SHOULDER. THE TRUCK THEN SPUTTERED AND STALLED. I DID NOT ATTEMPT TO RESTART OR MOVE THE VEHICLE, INSTEAD WORKED WITH THE DEALERSHIP TO OBTAIN A TOW TRUCK.",
        "vin": "1GC1YNE7XLF"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/30/2020",
        "dateOfIncident": "08/30/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352124,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAB IS LEAKING RAIN WATER IN THE BACK DRIVER SIDE CORNER OF THE CAB! I JUST NOTICED IT WHILE WE WERE DRIVING IN THE RAIN. IT LOOKS LIKE IT HAS OCCURRED TWICE BEFORE BECAUSE OF STAINS.",
        "vin": "1GC4YPEY0LF"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/23/2020",
        "dateOfIncident": "06/28/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341057,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION LOCKED UP WHEN SLOWING DOWN AT A EXIT FROM OHIO TURNPIKE. THE VEHICLE WAS THRONE INTO A SKID JUST MISSING TWO LIGHT POLES. THE VEHICLE ONLY HAD 505 MILES ON IT ,THE DEALER INSTALLED A NEW TRANSMISSION IN IT . WE NOW HAVE 650 MILES ON IT AND HOPE THIS OR OTHER ISSUES OF SAFETY DON'T ARISE .WE HOPE THAT THERE ARE NOT OTHER TRUCKS OUT THERE WITH THIS PROBLEM .",
        "vin": "1GC4YPEY7LF"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/21/2020",
        "dateOfIncident": "11/22/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340774,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE ALWAYS PULLS TO THE RIGHT. AFTER TWO INSPECTIONS AND ALIGNMENT CHECKS BY THE GM DEALER THEY STATED THAT IT IS A SOFT WEAR PROBLEM THAT THEY HAVE NO FIX FOR. IT TAKE CONSIDERABLE EFFECT TO KEEP THE VEHICLE ON THE ROADWAY. ALSO THEIR IS AN ISSUE WITH THE STEERING SYSTEM. THE STEERING WHEEL CAN BE PULLED OUT OF THE DRIVERS HAND IF A POT HOLE IS ENCOUNTERED. THERE HAS ALSO BEEN TWO SITUATION WHEN HARD BRAKING WAS REQUIRED THE VEHICLED PULLS HARD TO THE LEFT.",
        "vin": "1GC4YNE73LF"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/18/2020",
        "dateOfIncident": "03/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318639,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK STARTED MAKING VERY STRANGE NOISE,, CAME HOME LET TRUCK SIT, WENT TO RESTART AND ENGINE LIGHT CAME ON, TRUCK MADE VERY HORRIBLE SOUND, AND STARTED SPITTING OIL OUT OF THE SIDE OF THE BLOCK. HOLE IN BLOCK AND AT LEAST ONE PISTON DESTROYED.",
        "vin": "1GC4YLE77LF"
    }
]