[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/04/2022",
        "dateOfIncident": "01/26/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459476,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The passenger door is attached properly, when the truck reach 70 mph or higher and little cross wind, there is really loud noise like the brakes sticking. I was afraid the door might flew off while I'm driving and I have infant in the back. I took the truck in to the dealership where I purchased and the problem was never fixed. when I took the truck back the 2nd time, the dealership told me to take my truck to GM dealership. I took the truck to the GM dealership hour later my truck was ready, apparently this problem happened to another vehicle. Now the noise is worst and it's on both side when I'm driving 70mph or higher with cross wind. I took the truck back to the dealership and now I'm waiting on parts to arrive 2 weeks later no call back. It's been one year 6 months with less than 19000 miles, afraid the doors might pop off and still the problem is not fixed.",
        "vin": "3GCPWCED7LG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/25/2022",
        "dateOfIncident": "03/21/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458308,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle developed a sensation at approximately 28,000 miles similar to driving over a rumble strip. At approximately 32,000 miles this was diagnosed as a failing torque convertor. There are TSBs related to this for the 8 speed transmission, but dealer stated no known TSBs exist for the 6 speed. The truck is currently in the shop getting the torque convertor replaced and should be available for pick-up in the upcoming week.  Rumble strip sensation occurred under light throttle acceleration and presented more frequently on an incline. There were occurrences on flat ground, but this was not as common. The vibration occurred most often at highway speeds of around 70 MPH, but also occurred several times in the ranges of 20-30 and 40-50 MPH. Tachometer reading during these occurrences was around 1,500 - 2,000 RPM. Issue was intermittent and would come and go. Most of the time the sensation was mild, but periodically the vibration would be severe enough the driver felt like he had been rear-ended.   A separate symptom would occur while going up hills and the tachometer would bounce up and down approximately 300 RPMs with a noticeable surging sensation. When presenting, the vehicle would surge forward every few seconds until the hill had been crested. This only occurred at highway speeds with cruise set and would not present when the rumble strip vibration was present.",
        "vin": "3GCPYCEH6LG"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/10/2022",
        "dateOfIncident": "03/04/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456081,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving down I27 10 miles south of Lubbock when my 2020 Silverado 1500 3.0 Diesel engine stopped accelerating. I was going 75 miles per hour and the truck just stopped causing trauma for me and my family we were lucky enough to get to the side of the road. I ended up calling gm roadside assistance and they sent a tow truck to pick us and the truck up. The truck wouldn't engage into drive nor reverse. Once towed to the dealership, Gene Messer Chevrolet, in Lubbock, Texas, a service tech mentioned that a ton of the lifters bending push rods are going out on the late 2019, 2020 model silverado due to cheaper lifters added to the vehicles due to Covid shortage supplies. In essence, they wanted to get these models out with no regard to safety of the consumer. I'm not pleased with the craftsmanship GM has lined out on these trucks, this could've ended way worst. They jeopardized my families safety for profits. Right now the truck is still awaiting diagnostics still won't drive nor reverse per dealer service tech. It's just a terrible situation, the truck is new only has 25,500 miles on it, this needs to be recalled.",
        "vin": "1GCUYGET9LZ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/19/2022",
        "dateOfIncident": "02/12/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453049,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "After putting my vehicle in reverse, my backup camera did not come on and gave a warning that the camera was not working.",
        "vin": "1GCUYEED8LZ"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/02/2022",
        "dateOfIncident": "01/26/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449985,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Upon starting the vehicle for the second time one day, when placing the automatic transmission into 'D' - Drive, it began to roll backwards as if it was in Neutral on a slight decline and the brakes had to be applied to avoid rolling downhill backwards. After attempting to place it back into 'P' - Park and back into 'D' - Drive and attempting to try 'R' Reverse to try to get it to move forward properly, it would not go forward. After several tries and restarting the vehicle completely, it finally attempted to move forward but would only do so at a reduced speed and would not respond to the accelerator pedal beyond a certain amount. After trying again, it appeared to move forward a bit better, but then upon stopping at a stoplight and attempting to pull out for a left turn onto the road, the speed again was reduced and I had to immediately place it into 'R' - Reverse to avoid an accident due to oncoming traffic. Finally I was able to get it to move forward a bit better and was heading directly for the dealership but since the power just was not getting to the wheels (transmission?) I pulled over and shut off the truck for a few minutes. Upon starting the truck again, it seemed to move forward better after that but had the 'check engine light' illuminated. The truck is at the dealership now, they have had it nearly a week and said they will not begin to look at it for another week at least since they only have 2 technicians who can look at it.",
        "vin": "3GCUYDED1LG"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/27/2022",
        "dateOfIncident": "01/27/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449175,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "It seems the top suspension arm on my front passenger side broke.",
        "vin": "3GCUYDET3LG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/27/2022",
        "dateOfIncident": "01/21/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449183,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "My 2020 Trail Boss recently had a break fail on the front right. The brakes are metal to metal and the brake sensor is reading 54% brake life left. GM says that there is only one brake sensor on the front of the truck and its on the right hand side. When I spoke to Chevy customer service I was told they have received several calls regarding this matter. Chevy service department is saying there is nothing wrong with any of the equipment, but I find it hard to believe that brakes wear this way normally. If they did I would think Chevy would have 2 brake sensors for each wheel.",
        "vin": "3GCPYFED5LG"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/23/2022",
        "dateOfIncident": "01/22/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448505,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The infotainment screen brightness is set too high, such that turning the brightness setting down enough for the infotainment screen to not be too bright turns the backlighting on the instrument cluster down to where it's almost unreadable. In this specific case I was trying to use Apple Maps through Carplay for navigation in an unfamiliar rural area, where lighting on the roads is almost inexistent besides in towns. During the day it's not too much of an issue, but any time between dusk and dawn one must make a choice between visibility out the windshield and being able to quickly read anything on the instrument cluster. It is my opinion that this issue is enough of a safety hazard to force GM to make changes, but unfortunately isn't the most egregious \"feature\" of this screen. That title belongs to what happens when you put the vehicle in reverse at night. It seems whoever designed it thought the view of the backup camera on the infotainment screen is the only thing you should be able to see, since it changes the brightness back to its daytime setting. This makes seeing out of the vehicle in any direction where the screen is even slightly in your view almost impossible. It also means you must wait a second or two for your eyes to adjust if you want to, for example, look at the backup camera on the screen then look out the rear window. In my case, even looking out the rear window into a garage with a light on was difficult after looking at the backup camera view. Add to all of this any kind of vision issues like needing prescription glasses or contacts, and your eyes are constantly trying to adjust between being able to see what your next turn might be and being able to read any signage that may be present. Simply put, it seems GM took the idea of making the vehicle a rolling smart device to be the primary use, even above having the ability to see where you're going safely.",
        "vin": "1GCRYBEH7LZ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/05/2021",
        "dateOfIncident": "12/05/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442723,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I was going shopping and noticed my check engine light flashing, it flashed around 20 times then turned off. When I got done shopping, I started up my truck to leave and I had no power steering and the dash had Service ESC on it and the traction control light was on, So I slowly started to drive home with no power steering I drove around one mile and stopped for a coffee. When I jumped back in the truck the power steering was working and all lights and messages were off Being Sunday (12-5-21) no dealer was open, the truck has around 34,000 miles on it This is not the first time the check engine light came on and the dealer checked the codes and it was clear I checked with my code reader and no codes either",
        "vin": "3GCUYDED3LG"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/29/2021",
        "dateOfIncident": "11/28/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441900,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I started my truck up and the dashboard warned me with service ESC and also Service Power Steering drive with care. Steering wheel was very hard to turn obviously no matter what way. I only got like 14,169 miles on the truck. I left it sitting for about 2 hrs. And it's supposedly back to normal. No lights some how.",
        "vin": "3GCUYBEFXLG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/04/2021",
        "dateOfIncident": "11/02/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439337,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle has approximately 15789 miles.  Loud taking sound coming from engine began November 2, 2021 as I was on Highway.  Dealer advises all 8 lifters and cam need replacement. My investigation reveals that this is a persistent problem with this type of vehicle and many reports have been made about this same issue throughout the USA.  My service advisor advised me that they have already repaired several of the same vehicles for the same problem.  Engine is defective and requesting a recall to release entire engine now that this engine will need major overhaul.",
        "vin": "3GCPYFED3LG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/18/2021",
        "dateOfIncident": "10/09/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437199,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "High Pressure fuel pump failed external fuel leaking onto exhaust of truck. Lucky the truck didn't catch on fire. Would have if I kept driving.       What component or system failed or malfunctioned, and is it available for inspection upon request? High Pressure fuel pump (external leak) under GM warranty they have the parts. Flannery Chevrolet Bad Axe MI      How was your safety or the safety of others put at risk? Gas leaking on Hot catalytic converter and cross over pipe. Skid plate was full of fuel. A fire under the truck would have made it very difficult to get out of the vehicle once stopped.      Has the problem been reproduced or confirmed by a dealer or independent service center? Towed vehicle to dealership and they diagnosed High Pressure fuel pump leaking. they replaced the pump and appears to he resolved now.        Has the vehicle or component been inspected by the manufacturer, police, insurance representatives or others? Not that I know of. GM warranty covered repairs. Vehicle only has 13, 720 miles on it.       Were there any warning lamps, messages or other symptoms of the problem prior to the failure, and when did they first appear? Driving down the road started to notice a really bad fuel smell and after stopped you could hear the fuel hissing as it dripped on exhaust pipe. Vehicle sat for 10 mins and had puddle of gas under the front of the transmission. Start the engine again and it continued to drip. I Called towing to come get it.",
        "vin": "1GCPYFED5LZ"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/12/2021",
        "dateOfIncident": "10/03/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436469,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Whine sound possible torque converter does not go away.  Surging or delay in switching into second gear upon first start up and put in drive.",
        "vin": "1gcuyeed3lz"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/04/2021",
        "dateOfIncident": "10/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435352,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "While towing at a GCWR of over 29,000 pounds, my truck displayed the “check trailer wiring“ message on the DIC. I’m glad that my vehicle alerted me to a situation with the trailer wiring, however, when this message is displayed it completely shuts off the brake output to the trailer brakes.   It was incredibly nerve-racking and quite dangerous when traveling 70 mph down the freeway and then suddenly hitting traffic and realizing I had zero trailer brakes to assist me in stopping to avoid an accident.   Once I was able to return home, I pulled the breakaway pin on the trailer and all brakes worked perfectly fine. I then pulled all the hubs on the trailer axles and found one brake magnet had wore down to the coil. Obviously this is an issue and needs to be replaced, but the fact that my truck cut break output to all the brakes completely is very dangerous and unacceptable.   This is a serious safety issue since there is nothing that can be done while on the road to fix this. If I had been traveling in the mountains as I will be next week, this could easily have caused a much more serious situation.   This situation has been discussed among other owners of the same vehicle who experienced the same situation. There is a message that comes up on the DIC, but at that point it’s too late since the trailer brakes are already turned off by the vehicle.   It seems to me that unless there is a serious short or the truck senses and extremely high amperage overload that it should continue work and send brake power to a trailer even if there is one single component that fails. That is the way that brake controllers have worked since they were invented, and now this new “Integrated Trailer Brake Controller” is much less safe.",
        "vin": "1GC4YTEY5LF"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/17/2021",
        "dateOfIncident": "09/12/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433325,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "At 11,000 miles my car began to wobble dangerously. I took it to the dealership and they informed me that two Pins were missing from the alignment cams. They blamed Goodyear for not doing a good alignment at 3,000 miles. Goodyear says they see a lot of these issues in their shop and believes GM needs to recall and fix this issue on all of its models. The repair cost me $459.69. GM said this was not covered under warranty, since someone else did the alignment. This doesn't see fair and I think the government needs to look into this.",
        "vin": "3GCUYGEDXLG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/12/2021",
        "dateOfIncident": "07/05/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432641,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "- My back up camera developed a fish eye distortion.  - It makes it hard to see how close something is behind you, making it dangerous backing up with children in the area. - Yes, although the dealer is trying to claim it is ''normal'', even though it was not that way when I bought the truck, or I would not have purchased it.  - There were no warning lamps or other symptoms prior to the problem. It appeared before 2,500 miles were on my vehicle.",
        "vin": "3GCPWBEH7LG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/31/2021",
        "dateOfIncident": "11/28/2020",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11431242,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owned a 2020 Chevrolet Silverado 2500. The contact stated the seat heater was disengaged but failed to respond, causing the seat to remain hot. There were no warning lights illuminated. The vehicle was not diagnosed nor repaired by an independent mechanic or dealer. The contact stated the failure had been reoccurring. The contact stated while the vehicle was parked and running, she heard an abnormal popping sound coming from the vehicle, as she turned around, she noticed smoke coming out of the vehicle. The contact stated a fire had started underneath the driver seat and she was able to extinguish it with the assistance of emergency units. The contact stated she sustained mild burns on her hands and arms but did not seek medical assistance. A police report was not filed. The vehicle was towed to a tow lot, where it was totaled. The dealer was notified of the failure. The manufacturer was notified of the failure and did not provide any assistance. The approximate failure mileage was 5000.",
        "vin": "1GC4YNEY2LF"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/30/2021",
        "dateOfIncident": "07/27/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430983,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Esc light comes on brake systems failure max speed 62 mph and tralier brake systems.  Abs light , engine light, traction light all come on",
        "vin": "1gcpwbef3lz"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "08/23/2021",
        "dateOfIncident": "08/22/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430093,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving home in my neighbor I was approaching vehicle ahead of me which was stopped. I applied the break pedal which went loosely all the way to ground and unresponsive. Due to my inability to stop on time I rear ended the vehicle. No warning that there was an issue with my breaks what so ever. The only thing that I did have going on was my trucks front panel (gauges & stereo screen) weren't functioning. I went to turn on my pick up and it behaved as if battery was dead. I let it sit for a few minutes and attempted to start it once again and it started right up. The issue was the stereo screen stayed black and only the fuel gauge and speedometer were functioning. In the end I ended up being at fault  in the accident and reported it to my insurance.",
        "vin": "1GCRYDED8LZ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/21/2021",
        "dateOfIncident": "06/12/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425855,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The radio continuously keeps blacking out turning off and back on over and over. Radio has been replaced and everything and it’s still an issue.",
        "vin": "3gcpwaeh3lg"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/28/2021",
        "dateOfIncident": "06/15/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422562,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "After a morning’s fishing, I drove the boat to the launch site to retrieve and load onto the trailer.   Started my 2020 1500 Silverado in the parking lot and went about 75 feet to the launch and retrieved the boat.  While I was retrieving the boat, I left the Silverado motor running.  After boat pickup, drove about 75 feet in the lot to rig the boat for travel and shut off the Silverado engine.  After rigging was completed, started the truck and there was no power steering.  The following two messages were present on the DIC: “service power steering drive with care” and “service ESC”.  I can’t believe that this truck with less than 2800 miles was exhibiting such a major problem.  Restarting the tuck multiple times did not clear the error messages.  Since I live about three miles from the lake, I decided to take a chance and drove home and left the truck in the street.  Called the dealer and made a service appointment. After about an hour, I went out and started the truck in an attempt to park it in the driveway.  The messages had disappeared and power steering was functional.  Also, I did some searching on the internet and found many other owners of 2020 1500 Silverado that had the exact same loss of power steering and messages that I had experienced.  The dealer informed me that although there were many communication error codes present, they were not able to find the cause of the problem.  They requested that I leave the truck with them and they will try to reproduce the power steering failure.  The dealer didn’t seem to care, even after I mentioned that there were many others with identical problems and surely someone in Chevrolet engineering knows of the problem and how to fix it.  Their response was that they were not aware of any known documented problems like mine.  I think I’m getting the run around.  They still have the truck after twelve days and no solution. My wife refuses to drive the 2020 1500 Silverado with such an unsafe condition.",
        "vin": "1gcrygelxlz"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/21/2021",
        "dateOfIncident": "05/21/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421671,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Service ESC and Parking Brake error.  Drove to work with no issues.  Started up to drive home and I kept hearing a \"Ping\" noise like hail hitting my roof.  Then I thought my transmission was going out while driving.  It is almost like it is firing out of order.   Dealership ordered multiple parts: Misfire in cylinder 4 plus issue with the heads and push rod.  GM decided that the issue it to be repaired rather than a new engine be put in.",
        "vin": "1gcpyfel6lz"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/20/2021",
        "dateOfIncident": "06/20/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421538,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Momentary loss of electrical power going over bumps, stabilitrak warning then complete loss of cabin power, engine power and power steering. Corrects after approx 1 sec.",
        "vin": "3gtu2uec0fg"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/20/2021",
        "dateOfIncident": "06/19/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421583,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving all warnings lights came on and all gage needles started moving back and forth.",
        "vin": "3GCUYDED7LG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/18/2021",
        "dateOfIncident": "06/18/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421440,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Popping sound and hard shifting during low RPM between low gears.",
        "vin": "1GCPYCEFXLZ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/03/2021",
        "dateOfIncident": "05/18/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419541,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Chevrolet Silverado 1500. The contact stated while driving 10 mph, the vehicle drove through a puddle of water, shuddered and jerked then loss motive power. The contact was not able to restart the vehicle. The contact had the vehicle towed to a local dealer who inspected the vehicle and diagnosed the failure as water entering the engine, and that the engine needed to be replaced. The vehicle was not yet repaired. The manufacturer was notified of the failure. The failure mileage was 21,400.",
        "vin": "3gcpyfed5lg"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/01/2021",
        "dateOfIncident": "05/21/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419225,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Service ESC and Service Parking Brake error. This was followed by loud pinging noises from the engine. Sounds like a misfire and knocking heads or valves.",
        "vin": "1gcpyfel6lz"
    },
    {
        "components": "STEERING,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/28/2021",
        "dateOfIncident": "05/28/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418841,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving 50mph and the truck starts bucking, backfiring, and missing. Code appeared on the dash stating service ESC. Lack of Power steering and braking I parked the truck.",
        "vin": "3GCPYFED4LG"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/28/2021",
        "dateOfIncident": "05/28/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418895,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "At least 3 times while driving the entire radio and information system has shut down while driving and completely gone black for 2-3 minutes and reset to factory reset  This does not show as recall but worried that it may shut down vehicle completely   Have told dealership during routine maintenance and they said they find no problem   Obviously there is a reason this is happening",
        "vin": "1GCPYCEF0LZ"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/26/2021",
        "dateOfIncident": "05/17/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418619,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I was leaving work on May 17th and got in my 2020 Silverado and started the vehicle. Immediately codes were thrown on the dash stating that the power steering was out and that the ESC system needed serviced. The traction control system/ESC light was also illuminated on the dash. I was unable to turn the steering wheel whatsoever. I turned the vehicle off and restarted approximately three times all of which still were displaying the codes listed above.  I let the truck sit for approximately 20 minutes and the codes had cleared themselves and the vehicle was functioning as it should. I immediately drove to the dealership and had it serviced. Dealership stated there was a programming issue related to the EBCM, which if I'm not mistaken was a recall already issued for the 2019 models.   I have seen many instances online of this same issue occurring and sometimes impacting the ability to brake (if vehicle was in motion at time of onset). My onset occurred at approximately 14,000 miles while in park. Since the servicing (approximately 1 week) issue has not been replicated, but I am not sure if the problem has been fixed or if the computer is just functioning properly and will glitch again at some point in the future.",
        "vin": "3GCPYCEH6LG"
    },
    {
        "components": "PARKING BRAKE,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/19/2021",
        "dateOfIncident": "05/18/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417754,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Chevrolet Silverado 1500. The contact stated while driving approximately 40 MPH, the vehicle suddenly started to shake and misfire. The contact stated that the ESC warning and service parking brake warning lights were illuminated. The contact coasted to the side of the road and restarted the vehicle. The contact took the vehicle to the dealer who diagnosed that the electronic stability control module had performed an automatic reset as designed. After the reset, the misfire occurred. The vehicle was not repaired. The manufacturer was made aware of the failure. The approximate failure mileage was 7,700.",
        "vin": "3GCPYFED8LG"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/09/2021",
        "dateOfIncident": "05/05/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415698,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TRUCK HAS ALREADY HAD A SHIMMY FEEL IN THE TRANSMISSION AROUND 60 MPH IT SHOOK AND WOULD SLIP GEARS. I JUST HAD IT GET WORSE THIS WEEK. I ALSO NOTICED THAT THE FRONT END IS NOT SHAKING REALLY BAD FROM 60-75 MPH ON NEWLY PAVED ROADS. THE TRUCK USED TO DRIVE LIKE A DREAM NOW ITS DRIVING SO ROUGH AND THERE IS SOMETHING GOING ON!",
        "vin": "1GCUYEED3LZ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/28/2021",
        "dateOfIncident": "01/05/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414320,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE DOES NOT SHIFT INTO 4WD LOW RANGE. THE VEHICLE HAS BEEN TAKEN TO THE DEALER 4 TIMES TO CORRECT THE ISSUE BUT THE ISSUE STILL OCCURS.",
        "vin": "3GCUYDET7LG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/19/2021",
        "dateOfIncident": "03/03/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11412907,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "INFOTAINMENT SYSTEM RANDOMLY SHUTS DOWN COMPLETELY(SCREEN TURNS OFF ALONG WITH ALL AUDIO AND CONNECTED DEVICES). ALSO THE USB PORT REFUSES TO CONNECT AND/OR RANDOMLY DISCONNECTS ITEMS ATTACHED TO IT. THIS HAPPENS WHILE THE VEHICLE IS STOPPED OR IN MOTION. IT HAS DONE IT ON THE HIGHWAYS, FREEWAYS, INTERSTATES, CITY STREETS, COUNTRY ROADS, DIRT TRAILS, MY WORKS PRIVATE PROPERTY, EVERYWHERE IN SHORT. HAPPENS ON HOT SUMMER DAYS AND COLD WINTER NIGHTS. ITS 100% RANDOM. CHEVY KNOWS OF THE ISSUE BUT HAS REFUSED TO FIX FOR MORE THAN A YEAR NOW.",
        "vin": "1GCRYCEF6LZ"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/16/2021",
        "dateOfIncident": "07/13/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11408361,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INVOLVED IN AN ACCIDENT THAT INCLUDED A ROLE OVER AND THE AIR BAGS DID NOT DEPLOY. GM SENT OUT ENGINEERS TO INVESTIGATE BUT SAID NOTHING WAS WRONG EVEN THOUGH THE AIR BAG MALFUNCTION LIGHT CAME ON DURING AND AFTER THE ACCIDENT. MY ROOF, WINDSHIELD WAS CAVED IN AND MY FRONT END TOOK HEAVY DAMAGE.  ALL FOUR TIRES WERE BLOWN AND THEY SAID NOTHING WAS WRONG WITH THE AIR BAG SYSTEM.  ONSTAR REPORTED THE AIR BAG ISSUE TO ME THROUGH EMAIL AS WELL.",
        "vin": "3GCUYDET6LG"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/15/2021",
        "dateOfIncident": "04/14/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408208,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MICHELIN TIRE EXPLODED WHILE DRIVING ON A HIGHWAY APPROXIMATELY 30 MPH, NO PROBLEMS BEFORE. ONLY 14,500 MILES DRIVEN",
        "vin": "3GCPWDEK6LG"
    },
    {
        "components": "STRUCTURE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/10/2021",
        "dateOfIncident": "04/09/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407413,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE BOUGHT NEW FROM DEALER DEC 2020.  I DECIDED TO REPLACE SOME LIGHTS SO, I LOWERED THE SPARE TIRE FOR BETTER ACCESS WHILE REPLACING A LIGHT BULB.  I NOTICED EVERYWHERE THE SPARE TIRE AND THE FRAME CROSS MEMBERS COME INTO CONTACT THE PAINT HAS RUBBED AWAY AND RUST HAS BEGUN TO FORM. ALSO, THE SIDEWALL OF THE SPARE TIRE HAS CORRESPONDING SPOTS WHERE THE RUBBER HAS WORN AWAY. THIS LEADS ME TO HAVE CONCERNS AS TO THE SPARE TIRE'S AVAILABILITY IN THE EVENT OF A FLAT.",
        "vin": "3GCUYBEF9LG"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/05/2021",
        "dateOfIncident": "04/05/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406377,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE LIGHT HAS COME ON 3 TIMES WITH A TRUCK WITH ONLY 9000 MILES ON IT I TOOK IT TO THE DEALERSHIP WHO GAVE ME A CODE OF P12A6 THEY TOLD ME CHEVROLET IS AWARE OF THIS PROBLEM BUT HAS NOT COME UP WITH SOLUTION YET OR EVEN WROTE A PROGRAM TO REFLASH THE COMPUTER. NOW I HAVE A PAPER WEIGHT IN MY DRIVEWAY AND BEING THAT I LIVE IN A DUAL TOWN TRYING TO FIND A DEALERSHIP THAT WILL FIX IT AND PROVIDE RENTAL CAR OR TRUCK. THIS DEFECT CAN BE MULTIPLE REASONS WITH THE ENGINE HARNESS WIRES CHAFFING OR TORQUE CONVERTER OR TRANSMISSION PLUS THE WHOLE ELECTRICAL SYSTEM NOT CRANKING OVER THE TRUCK FROM WHAT I WAS TOLD LAST TIME. NOW I'M WAITING TILL 730 TO CALL A DEALERSHIP SEE IF THEY HAVE A ROLL TRUCK TO PICK IT UP AND GET IT TO A DEALERSHIP WHERE THEY CAN TRY TO FIX THIS PROBLEM.",
        "vin": "3GCUYDEDXLG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/04/2021",
        "dateOfIncident": "03/22/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406304,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 SILVERADO 1500 DURAMAX. TORQUE CONVERTER FAILED WITH 6700 MILES ON NEW LEASED VEHICLE. ORIGINALLY BEGAN HAVING TRANSMISSION ISSUES IN NOV 2020 WITH SURGING WHILE STOPPED IN COLD WEATHER. DEALER RESEATED ALL CONNECTIONS. BEGAN TO HAVE LOUD WHINING WHEN SHIFTING. TOOK BACK TO DEALER AND INFORMED IT IS TURBO WHINE. NOT CONVINCED. MARCH 2021 BEGAN SURGING AGAIN. RETURNED TO DEALER AND KEPT FOR WEEK. MECHANIC STATED COULD NOT PRODUCE PROBLEM. AS I DROVE TO THE MAIN STREET AT DEALERSHIP BEGAN SURGING. RETURNED TO SERVICE, MGR GOES WITH ME AND CONFIRMS ISSUES WITH WHINE AND SURGE. BACK IN THE SHOP. THAT WAS 22 MARCH AND AS OF 8 APRIL; TORQUE CONVERTER FAILURE AND ORDERED NEW BELL HOUSING. GOING ON 4 WEEKS WITHOUT TRUCK.",
        "vin": "3GCPWCET6LG"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/02/2021",
        "dateOfIncident": "12/12/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406157,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY LIGHTS IN THE DASH INSIDE THE TRUCK. GO FROM BRIGHT, TO DARK BLACK ALL THE TIME SINCE APRIL 2020. MY 4 WHEEL DRIVE ENGAGE, WONT WORK. 12/12/2020 IN THE SNOW TRYING TO DRIVE HOME",
        "vin": "3GCUYEED8LG"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/28/2021",
        "dateOfIncident": "03/27/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405187,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS TRUCK HAS 2700 MILES ON IT. GOT IN TO DRIVE IT HOME FROM THE STORE TODAY AND THE SERVICE ENGINE LIGHT IS ON. SAYS STABILITRAK ERROR AND ANTILOCK BRAKE ERROR. BRAKE PEDAL FELT STRANGE SO I WAS AFRAID TO DRIVE IT AFTER READING SIMILAR STORIES ABOUT TRUCKS VEERING OR NOT BRAKING WHEN THE PEDAL IS DEPRESSED. CALLED DEALER TO SCHEDULE SERVICE. THIS TRUCK HASN'T EVEN HAD ITS FIRST OIL CHANGE YET AND ALREADY HAVING ELECTRICAL PROBLEMS.",
        "vin": "3GCPYFED8LG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/23/2021",
        "dateOfIncident": "03/23/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404413,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS OF STEERING . I STARTED TRUCK AND PUT IN DRIVE AS I WAS TRYING TO DRIVE FORWARD I REALIZED THE STEER WHEEL WOULD NOT TURN AT ALL. I LOOKED DOWN TO SEE LIGHTS ON THE DASHBOARD SERVICE ESC AND SOMETHING ABOUT LOSS OF STEERING ON THE INFO SCREEN. I CANT BELIEVE THIS TRUCK IS NOT EVEN A YEAR OLD HAVE AN ISSUE LIKE THIS. I AM LUCKY I WASN'T AT HIGHWAY SPEEDS OR IN TRAFFIC AND JUST IN MY DRIVEWAY. I TURNED TRUCK OFF AND RESTARTED IT AND IT SEEMS AS NOTHING HAPPENED . EVERYTHING IS NORMAL AND NO LIGHTS ON. I TELL YOU I AM VERY SCARED AND WORRIED TO DRIVE THIS VEHICLE AND CANNOT BELIEVE THIS HAS BEEN OVERLOOKED BY GM AND THE NHTSA SINCE I HAVE SEEN AND HEARD MULTIPLE COMPLAINTS ABOUT THIS.",
        "vin": "3GCUYDED5LG"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/20/2021",
        "dateOfIncident": "03/20/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404058,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY KEEPS DISCHARGING.  MAKING SURE NO LIGHTS LEFT ON IN VEHICLE.   TOTALLY DRAINED BATTERY IN JUST 3-4 DAYS WITHOUT CRANKING OR MOVING. AFTER RECHARGE CRANKED NORMALLY",
        "vin": "3GCUYEED3LG"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/09/2021",
        "dateOfIncident": "03/09/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399935,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS TRUCK DOESN'T EVEN HAVE 7500 MILES ON IT. IT WAS DRIVEN TO WORK THIS MORNING WITHOUT ISSUE AND PARKED FOR APPROXIMATELY FOUR HOURS. UPON ATTEMPTING TO START IT FOR LUNCH HOUR THREE MESSAGES SHOWED UP IN THE DIC: 1) 'SERVICE ESC', 2) 'SERVICE POWER STEERING', AND 3) 'PARK ASSIST OFF'. IN AN ATTEMPT TO EVALUATE I PULLED THE TRUCK FORWARD AND THE AVAILABLE STEERING REFLECTED AN INOPERABLE POWER STEERING SYSTEM. I BACKED INTO THE SPOT AGAIN AND SHUT THE TRUCK DOWN. I STARTED THE TRUCK AND SHUT IT DOWN FOUR OR FIVE MORE TIMES WITH THE SAME MESSAGES PRESENTED (ALTHOUGH PARK ASSIST STOPPED APPEARING) AND ONLY ON THE LAST TIME DID THE MESSAGES GO AWAY AND POWER STEERING RETURNED.",
        "vin": "3GCUYEED0LG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/07/2021",
        "dateOfIncident": "02/22/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399596,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ONE OF THE COOLANT HOSES RUBS UP AGAINST THE CRANKSHAFT CAUSING HOSE TO BUST AND LEAK REDUCED ENGINE POWER LIGHT COMES ON AND CHECK ENGINE LIGHT CHEVY HAD TO USE A DIFFERENT HOES TO NOT RUB AGAINST THE CRANKSHAFT",
        "vin": "3GCPWBEK9LG"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/23/2021",
        "dateOfIncident": "08/28/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397632,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FRAME PAINT PEELING OFF WITHIN 6 MONTHS. DRIVERS AND PASSENGER SIDE FRAME ABOVE REAR AXLES. MULTIPLE COMPLAINTS DOCUMENTED ON CHEVY FORUMS. PAINT FALLS OF WITH SIMPLE WASH EXPOSING BARE METAL FRAME WHICH WILL LEAD TO PREMATURE RUST AND CORROSION",
        "vin": "1GCPYFED2LZ"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/23/2021",
        "dateOfIncident": "11/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397634,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR PASSENGER PILLAR LEAKING AND CAUSING RUST, STAINING OF HEADLINER AND PILLAR COVERS.  DOCUMENTED BY MANY OWNERS ON CHEVY FORUMS. LEAK MAY BE FROM ROOF SEAL OR REAR WINDOW.",
        "vin": "1GCPYFED2LZ"
    },
    {
        "components": "UNKNOWN OR OTHER,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "02/18/2021",
        "dateOfIncident": "01/25/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396836,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TRUCK IS ONLY A YEAR OLD AND ONE MORNING I WAS REVERSING OUT OF DRIVEWAY AND BACK UP CAMERA STOPPED WORKING",
        "vin": "3GCUYEED6LG"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/09/2021",
        "dateOfIncident": "02/03/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11395340,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE GOT INTO AN ACCIDENT WHERE SHE REAR ENDED FORD FIESTA AND HIT IT SO HARD THAT VEHICLE PUSHED A 2006 DODGE FULL SIZE PICKUP 100 FEET DOWN THE STREET AND THE AIRBAGS DIDN'T DEPLOY",
        "vin": "3GCPYFED2LG"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": true,
        "dateComplaintFiled": "01/22/2021",
        "dateOfIncident": "10/07/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389374,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKUP CAMERA ONLY IS FUNCTIONAL IN PERFECT WEATHER CONDITIONS. IF IT'S DARK WITH NO LIGHT, THE CAMERA HAS RESOLUTION SIMILAR TO A 1950 TUBE TV. IF IT'S RAINY OR CLOUDY, THE BACKUP CAMERA IS NOT FUNCTIONAL EITHER. THERE ARE NUMEROUS YELLOW LINES AND EXTREMELY POOR QUALITY PICTURE IN MANY OTHER CONDITIONS TOO. CHEVY HAS NOT DONE ANYTHING TO FIX THIS ISSUE IN MY TRUCK. THE VISIBILITY IS SO BAD I HIT MY TRAILER HITCH ON THE BUMPER 7' OFF OF MY HITCH LOCATION. I COULDN'T SEE THAT MY TRAILER WAS THAT CLOSE TO ME ON THE SCREEN",
        "vin": "1GCRYDED8LZ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/21/2021",
        "dateOfIncident": "01/21/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389305,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MULTIPLE INSTANCES OF SERVICE ESC, SERVICE PARKING BRAKE AND CHECK ENGINE LIGHT COME ON. THE BRAKES ARE THEN AFFECTED AND ARE TOUGH TO PRESS CAUSING THE BRAKING TO BE SLOWED DOWN AND THE ABS KICKED ON WHILE IN MOTION.",
        "vin": "1GCPYFEL7LZ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/10/2021",
        "dateOfIncident": "12/14/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387422,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 SILVERADO RST 1500 4X4 ALLSTAR WITH 8 SPEED TRANSMISSION. AT 4,000 MILES DEVELOPED A SHUTTER IN TRANSMISSION AND SLIPPING AND HARD SHIFTING MAINLY BETWEEN GEAR 1-2. BAD ENOUGH WHEN YOU START FROM A STOP WHEN IT SHIFTS YOU FALL FORWARD. THE ACCELERATION  PUSHES YOU BACK AND THEN IT JUST SLIPS TO NO WHERE TILL IT CATCHES AND GOES. CONTACTED SHOP AND WAS TOLD AT 1ST OIL CHANGED THEY WOULD FLUSH THE FLUID PER THE SERVICE BULLETIN. THIS MADE IT WAY WORSE. SHIFTING IS MORE ROUGH AND SHUDDER IS MORE FREQUENT. TOOK IT BACK FOR THE 2ND TIME AND HAD TO DRIVE WITH A TECH SO THEY COULD EXPERIENCE THE ISSUE. IT IS GOING BACK TO THE SHOP TOMORROW 1/11/2020 WITH ONLY 7,500 MILES WITH HOPES OF A NEW TORQUE CONVERTER. THIS SHOULD BE A RECALL AND RESULT IN A CLASS ACTION. THIS ISSUE IS SO COMMON AND THIS TRUCK IS BRAND NEW. HAD IT IN SHOP WITH 2,000 MILES WITH AN OIL LEAK.",
        "vin": "3GCPYEEK2LG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/09/2021",
        "dateOfIncident": "01/03/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387306,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AROUND 40 MPH AND HIGHER TRUCK SUFFERS EXTREME WIND NOISE WHICH THE DEALERSHIP DESCRIBES AS WIND TURBULENCE. TRUCK SOUNDS LIKE A WINDOW IS CRACKED OPEN WHILE DRIVING EVEN THOUGH ALL WINDOWS ARE ALL THE WAY UP.",
        "vin": "1GCPWDED4LZ"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/30/2020",
        "dateOfIncident": "12/27/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385569,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS TRUCK IS 2 MONTHS OLD AND ONLY HAS 2300 MILES ON IT. ON SUNDAY 12/27, THE TRUCK WOULD NOT START. ALL DASH PANEL AND LIGHT INDICATOR WARNINGS CAME ON INCLUDING 4 WHEEL DRIVE ASSIST FAILURE, BRAKE SYSTEM FAILURE, TPS FAILURE, CHECK ENGINE, BATTERY ERROR, ETC. AFTER JUMP STARTING THE BATTERY, THE TRUCK TURNED ON BUT THE CHECK ENGINE LIGHT STAYED ON ALL DAY. ON MONDAY 12/28, THE TRUCK DID NOT START AGAIN HOWEVER, THIS TIME, NO INDICATOR LIGHTS, DASH PANEL OR ANYTHING CAME ON AND I WAS ALSO UNABLE TO EVEN LOCK THE TRUCK. IT WAS TOWED TO THE DEALERSHIP AND AFTER 2 DAYS THEY STILL HAVE NOT FOUND THE PROBLEM WITH THE TRUCK ALTHOUGH THEY HAVE INDICATED THERE IS A CLEAR PROBLEM. THE TRUCK IS STILL CURRENTLY AT THE DEALERSHIP.",
        "vin": "1GCPYFED2LZ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/18/2020",
        "dateOfIncident": "12/18/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384134,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "DROVE TO WORK NO ISSUES NO LIGHTS AFTER WORK I START THE TRUCK CHECK ENGINE LIGHT IS ON SERVICE EBRAKE LIGHT IS ON AND THE EBRAKE LIGHT IS FLASHING TRUCK WILL NOT MOVE EBRAKE IS STUCK ON AND I DID NOT SET THE BRAKE WHEN I PARKED",
        "vin": "3GCPYCEF4LG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/16/2020",
        "dateOfIncident": "10/18/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383820,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 CHEVROLET SILVERADO 1500. THE CONTACT STATED WHILE DRIVING 55 MPH DOWNHILL, THE VEHICLE INDEPENDENTLY SHIFTED INTO NEUTRAL WITH AN UNKNOWN WARNING LIGHT ILLUMINATED. THE CONTACT STATED THAT THE VEHICLE RESUMED NORMAL OPERATION AFTER THE VEHICLE WAS TURNED OFF AND RESTARTED. THE CONTACT STATED THAT THE FAILURE RECURRED SEVERAL TIMES. THE VEHICLE WAS TAKEN TO YOUNG BUICK GMC (325 OVERLAND AVE, BURLEY, ID 83318) TO BE DIAGNOSED. THE VEHICLE WAS REPAIRED HOWEVER, THE FAILURE PERSISTED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 21,000.  ## VIN PASSED ## CHEVROLET 2020 SILVERADO  ##",
        "vin": "1GC4YUEY2LF"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/14/2020",
        "dateOfIncident": "12/05/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383399,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "IN MAY I PURCHASES A 2020 SILVERADO. ON DECEMBER 05TH, 2020. I WAS DRIVING ON THE INTERSTATE HEADING HOME FROM MY SON'S FOOTBALL GAME . THE \"SERVICE BRAKE SYSTEM\" MESSAGE DISPLAYED ON THE VEHICLE'S DASHBOARD. BRAKING BECAME SLUGGISH AND STIFF. I INITIAL THOUGHT THE BRAKE FLUID HAD HAD LEAKED OUT.  THE VEHICLE MAINTAINED POWER TO ALL OTHER SYSTEMS.  ONCE HOME I CHECKED THE ENGINE BAY AND BRAKE CALIBERS AND FOUND THEM TO BE INTACT. AT THIS TIME THE VEHICLE HAS 12,400 MILES. AFTER A INITIAL ASSESSMENT, WAS INFORMED THAT IT WAS DETERMINED TO BE A  \"COMPUTER GLITCH\" THAT WAS EFFECTING THE TRANSMISSION AND BRAKE SENSORS. THE BRAKE MODULE WAS REPLACED AND TRANSMISSION \"SOFTWARE\" WAS UPDATED. THIS WAS COMPLETED ON DECEMBER 09TH, 2020. UPON COMPLETION THE TECHS CONDUCTING A \"DRIVE TEST\", AT WHICH TIME THE WARNING APPEARED AGAIN. MY VEHICLE REMAINS AT THE SERVICE DEPARTMENT, WHILE THEY \"TROUBLESHOOT\" THE PROBLEM. DUE TO THE VAGUE RESPONSES BEING PROVIDED BY THE DEALERSHIP SERVICE STAFF AND THE LACK OF AN ESTIMATED TIME LINE FOR THE COMPLETION OF THE REPAIRS. I BELIEVE THERE IS A MUCH LARGER ISSUE THAT THEY DON'T WANT TO REVEAL.",
        "vin": "3GCPWCED2LG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/13/2020",
        "dateOfIncident": "12/11/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383220,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "DROVE TO SAMS CLUB AND RETURNED TO MY TRUCK AN HOUR LATER. TURNED ON THE TRUCK AND I HAD A SERVICE POWER STEERING MESSAGE, DRIVE WITH CARE WARNING AS WELL AS SERVICE ESC. IT WAS REALLY HARD TO TURN THE STEERING WHEEL. I TURNED OFF THE TRUCK AND PULLED OUT THE MANUAL. AFTER 5 MINUTES, I TURNED THE TRUCK ON AND NO CHANGE. I KEPT READING AND ABOUT 15 MINUTES LATER I TURNED ON THE TRUCK AGAIN AND THIS TIME THE STEERING WAS BACK TO NORMAL WITH NO DASH MESSAGES. I DROVE HOME AND SCHEDULED AN APPOINTMENT FOR 12/14/202 WITH MY DEALER, ANCIRA CHEVROLET, SAN ANTONIO, TEXAS. I READ ON THE INTERNET THAT OTHER SILVERADO OWNERS ARE HAVING THE SAME PROBLEM. MY TRUCK ONLY HAD 4,529 MILES WHEN THIS HAPPENED.",
        "vin": "3GCPWCED6LG"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/09/2020",
        "dateOfIncident": "12/08/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378629,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING AT ABOUT 75-80MPH, ON A HIGHWAY, - BRAKES ENGAGED, SLOWING VEHICLE BY ABOUT 15MPH CAUSING THE TRUCK TO JERK AS IF IT MISSED A GEAR. \"SERVICE ESC\" DIAGLOGUE, TRACTION CONTROL LIGHT, AND CHECK ENGINE LIGHT CAME ON.",
        "vin": "3GCPYCEF7LG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/09/2020",
        "dateOfIncident": "12/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378663,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "IM GETTING A HARD CLUNK SOUND WHEN SHIFTING INTO REVERSE. IT JUST STARTED HAPPENING AND ITS NOT FREQUENT ENOUGH TO TAKE IT IN TO REPLICATE.",
        "vin": "3GCUYEED2LG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/07/2020",
        "dateOfIncident": "11/08/2020",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378377,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY NEW 2020 CHEVY SILVERADO TRAIL BOSS TRUCK BURNED DOWN IN MY FRONT YARD. I HAD DRIVEN IT THAT MORNING FOR A SHORT DURATION AND IT WAS OPERATING NORMAL. I ARRIVED HOME AROUND 1:30PM, PARKED IT AND AWOKE TO IT FULLY ENGULFED IN FLAMES JUST BEFORE MIDNIGHT. THE TRUCK HAD BEEN PARKED FOR APPROXIMATELY 10 HOURS BEFORE IT IGNITED.",
        "vin": "3GCPYFED8LG"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/02/2020",
        "dateOfIncident": "11/27/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377565,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ATTEMPTING TO START FROM A STOP AT AN INTERSECTION WHEN THE AUTO START/STOP FUNCTION HAS STOPPED THE ENGINE, THE VEHICLE WILL FREQUENTLY HESITATE TO START, THEN ONCE STARTED EXHIBITS UNUSUAL ENGINE/TRANSMISSION BEHAVIOR.     THIS TRUCK IS NOW ON ITS FIFTH CHECK-ENGINE LIGHT SERVICE FOR IDENTICAL FAILURES OF THE AUTO START/STOP FUNCTION. THE GM ONSTAR DIAGNOSTICS REPORTS INDICATE 2 FAILURE MODES, ONE WITH THE ENGINE/TRANSMISSION AND THE OTHER WITH THE LITHIUM-ION BATTERY.    I HAVE SEVERAL CONCERNS. 1, I MAY BE STRANDED AT AN INTERSECTION WITH A VEHICLE THAT WILL NOT RESTART AND/OR HAS STALLED IN THE INTERSECTION AND 2, THE LITHIUM-ION BATTERY WILL FAIL CATASTROPHICALLY LEADING TO A VEHICLE FIRE.",
        "vin": "3GCPYFED7LG"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/18/2020",
        "dateOfIncident": "11/06/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375293,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "REPETITIVE FAULTS OF THE AUTO START/STOP SYSTEM. I HAVE NOTIFICATIONS ON THREE SEPARATE OCCASIONS WHILE DRIVING THE VEHICLE FROM THE ONSTART DIAGNOSTICS SERVICE OF TWO IDENTICAL FAULTS. ONE, A DEFECT WITH THE ENGINE & TRANSMISSION SYSTEM AND ONE A DEFECT WITH THE LITHIUM-ION BATTERY. TO DATE THERE HAS NOT BEEN AN EFFECTIVE REPAIR. THE LATEST ATTEMPT, REPLACING THE LITHIUM-ION BATTERY, SOMEHOW HAS FORCED THE SYSTEM TO NO LONGER FUNCTION UNDER ANY CONDITION. DRIVING CONDITIONS VARIED EACH TIME.",
        "vin": "3GCPYFED7LG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/10/2020",
        "dateOfIncident": "11/05/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374057,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILLE SITTING AT A RED LIGHT, THE AUTOMATIC ENGINE STOP FEATURE ACTIVATED AND STOPPED THE ENGINE. WHEN I RELEASED THE BRAKE AND STEPPED ON THE GAS PEDDLE THE ENGINE DID NOT RESTART. THE VEHICLE HAD TO BE TOWED IN FOR REPAIR. THE DEALER MADE REPAIRS IN A SOMEWHAT TIMELY FASHION EXCEPT THAT THE PART HAD TO BE ORDERED FROM THE FACTORY AS NONE WERE AVAILABLE. WOULD HAVE THOUGHT A STARTER DESIGNED TO START AND STOP NUMEROUS TIMES A DAY WOULD HAVE LASTED JUST A WHILE LONGER?",
        "vin": "1GCRYEEK1LZ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/06/2020",
        "dateOfIncident": "11/06/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373477,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2019-2021 SILVERADO'S HAVE A MAJOR SAFETY ISSUE WITH THEIR REARVIEW CAMERAS AT NIGHT TIME. THE INFOTAINMENT SCREEN ON THESE VEHICLES DIMS APPROPRIATELY AT NIGHTTIME TO ENSURE SAFE VIEWING OUTSIDE OF THE VEHICLE, HOWEVER AT NIGHTTIME WITH THE INFOTAINMENT SCREEN DIMMED, WHEN SHIFTING INTO REVERSE THE SCREEN GOES TO FULL BRIGHTNESS AND MAKES VISIBILITY OUTSIDE OF THE VEHICLE ALMOST IMPOSSIBLE ON PARTIALLY LIT AREAS. THIS CAUSES SAFETY ISSUES AS YOU ARE NOT ABLE TO MAKE USE OF YOUR MIRRORS TO SEE OBSTRUCTIONS OR OBSTACLES. THIS IS FURTHER MAGNIFIED AS THE QUALITY OF THE REAR VIEW CAMERA AT NIGHT IS VERY POOR, SO THE POOR CAMERA QUALITY COUPLED WITH THE INABILITY TO EVEN USE THE VEHICLES MIRRORS TO SEE OUTSIDE CAUSES SAFETY ISSUES.    MANY OTHERS HAVE COMPLAINED AND DOCUMENTED THIS SAME ISSUE AND HAVE RAISED CONCERNS WITH GM AND DEALERSHIPS TO NO AVAIL. THIS SHOULD BE AS SIMPLE AS A SOFTWARE UPDATE TO MAINTAIN SCREEN BRIGHTNESS WHEN SHIFTING INTO REVERSE DURING NIGHTTIME OR DARK CONDITIONS.",
        "vin": "3GCUYDED3LG"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/02/2020",
        "dateOfIncident": "10/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372671,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "1ST OCCURRENCE, 9840 MILES- SLOWING TO STOP SIGN, ABOUT 10MPH, TRUCK JUMPED VIOLENTLY, FELT LIKE I WAS REAR-ENDED. SERVICE PARKING BRAKE, SERVICE ESC, TRACTION CONTROL OFF MESSAGES AND CEL ON. STUCK IN GEAR. RESTARTED TRUCK, RESUMED NORMAL OPERATION BUT CEL REMAINED.  2ND OCCURRENCE, 9865 MILES - 65MPH ON HIGHWAY GOING AROUND CURVE, TRUCK JUMPED VIOLENTLY CAUSING REAR END TO BREAK FREE SLIGHTLY, THOUGH I KEPT CONTROL. TRANSMISSION NOW SEVERAL GEARS LOWER AND STUCK THERE, TURNING 2400 RPM AT 65MPH. SAME THREE WARNING MESSAGES AND CEL. TRIED MANUAL TRANSMISSION MODE, BUT IT DISPLAYED NO GEAR INDICATION, AND THE +/- BUTTONS DID NOTHING. PULLED OFF HIGHWAY, RESTARTED, ALL MESSAGES WENT AWAY, CEL REMAINED. TRUCK RESUMED NORMAL OPERATION.  3RD OCCURRENCE, 9905 MILES (ON THE WAY TO THE DEALER) - I WAS STOPPED AT TRAFFIC LIGHT, FIRST IN A STRING OF CARS. LIGHT TURNED GREEN, I STARTED TO ACCELERATE, JUST INTO THE INTERSECTION, TRUCK JUMPED VIOLENTLY, SAME WARNING MESSAGES, STILL HAD THE CEL FROM THE LAST TIME. TRUCK WAS NOW STUCK IN A HIGHER GEAR, COULD BARELY GET THROUGH INTERSECTION. VEHICLE BEHIND ME NARROWLY MISSED REAR-ENDING ME, AND OTHERS WERE BLOWING HORNS AS I LIMPED TO THE FAR SIDE OF INTERSECTION.     THIS IS A MASSIVE SAFETY CONCERN. IF ANY OF THE ABOVE SCENARIOS HAD OCCURRED ON SNOWY/ICY ROADS, I COULD HAVE INJURED OR KILLED SOMEONE, INCLUDING MYSELF AND/OR MY [XXX] YEAR-OLD.     DEALER REPLACED TCM, BUT IS STILL NOTING \"LOSS OF COMMUNICATION\" CODES BEING GENERATED. A CHEVY ENGINEER HAS REQUESTED THEM TO INVESTIGATE THE WIRE HARNESS FOR DAMAGE IN A PARTICULAR LOCATION, SUGGESTING CHEVY KNOWS OF A MANUFACTURING ISSUE. IF THAT'S SO, AND CHEVY HASN'T ISSUED A RECALL - OR EVEN A TSB - THEN THIS POSES A STRONG CASE FOR NEGLIGENCE ON THEIR PART. ARE THEY WAITING FOR SOMEONE TO GET INJURED OR DIE BEFORE ACTING ON THIS? I'VE NOW BEEN WITHOUT THE TRUCK FOR 10 DAYS.  PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "3GCUYDET9LG"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/22/2020",
        "dateOfIncident": "10/22/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365843,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO AND DASHBOARD ELECTRONICS SHUTOFF COMPLETELY WHILE DRIVING AND THEN WILL COME BACK ON A MINUTE LATER! LOOSES ALL CONNECTIONS TO PHONE, MAPS, BLUETOOTH ETC...., THEN OUT OF THE BLUE TODAY THE AIRBAG LIGHT AND SERVICE SAFETY RESTRAINT SYSTEM WARNING CAME ON! THIS IS SO DANGEROUS AND IS GOING TO CAUSE ME TO HAVE A WRECK!",
        "vin": "3GCPWBEH9LG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/19/2020",
        "dateOfIncident": "10/11/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365199,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKUP CAMERA IS COMPLETELY WASHED OUT AT NIGHT AND DURING THE DAY IS FUZZY AND OUT OF FOCUS. DEALER SAYS THIS IS NORMAL. ITS A SAFETY ITS A SAFETY HAZARD TO ME.",
        "vin": "1GCRWBEK4LZ"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/12/2020",
        "dateOfIncident": "10/11/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363932,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUCK HAS ~3000 MILES.  WHILE DRIVING THE TRUCK AT HIGHWAY SPEED (65 MPH), A WARNING CAME ON THE DASH \"ENGINE POWER REDUCED\", FOLLOWED BY A CHECK ENGINE LIGHT, AND THEN THERE WAS NO RESPONSE FROM THE THROTTLE/GAS PEDAL.  THE ENGINE WAS STILL RUNNING, BUT NO POWER WAS AVAILABLE WHEN PUSHING ON THE GAS PEDAL.  LUCKILY, I WAS ABLE TO PULL OFF OF THE HIGHWAY; HOWEVER, IF THIS WOULD HAVE HAPPENED CROSSING TRAFFIC OR ON A BUSY HIGHWAY, THE RESULTS COULD HAVE BEEN FATAL.  I WAS SURPRISED AND SHOCKED TO SEE A NEW TRUCK PROVIDE ZERO POWER FROM THE GAS PEDAL.  THIS IS A SIGNIFICANT RISK TO CONSUMERS, DRIVERS, AND OTHER CARS ON THE HIGHWAY.  WHEN I PUT THE TRUCK ON A CODE READER, I RECEIVED THE CODE P26C0.  THE LOCAL DEALERSHIP STATED THAT I AM NOT THE ONLY ONE EXPERIENCING THESE ISSUES WITH THE 3.0 DURAMAX DIESEL.",
        "vin": "3GCUYGET1LG"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/11/2020",
        "dateOfIncident": "10/09/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363811,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2020 SILVERADO 1500 LT TRAIL BOSS WITH JUST OVER 5000 MILES ON IT WITH ONE PREVIOUS RECALL WHICH WAS COMPLETED. ON THIS OCCASION I WAS TRAVELING ON THE HIGHWAY AT ROUGHLY 65MPH WHEN ALERT SOUNDS CAME ON FOLLOWED BY A MESSAGE ON THE CLUSTER SAYING TO SHIFT THE VEHICLE TO NEUTRAL AND PUSH START BUTTON. I DID THAT AND THERE WAS NO RESPONSE. I WAS IN THE FAST LANE AND DID NOT HAVE ENOUGH SPEED TO GET TO SHOULDER SO I PULLED TO CENTER TURN LANE OF HIGHWAY TO STOP. I ATTEMPTED TO START THE VEHICLE SEVERAL TIMES OVER 5-10 MINUTES WITH NO RESPONSE. CLUSTER GAUGES WOULD CYCLE LIKE WHEN VEHICLE IS STARTED, BUT IT DID NOT ENGAGE THE STARTER. I ALSO TRIED TO REMOTE START FROM KEY FOB WITH SAME RESPONSE. THERE WAS TRAFFIC TRAVELING AT HIGH SPEED IN OPPOSING DIRECTION ON EITHER SIDE SO IT WAS UNSAFE TO INSPECT THE VEHICLE. I USED ONSTAR TO GET ROADSIDE ASSISTANCE AND ABOUT 15 MIN LATER POLICE SHOWED UP TO PROVIDE ASSISTANCE. ONSTAR SAID IT WOULD BE CLOSE TO AN HOUR FOR A TOW, BUT POLICE GOT ME ONE ABOUT 15 MINUTES LATER. LUCKILY TEXAS COPS ARE PRETTY COOL SO WE JUST HUNG OUT UNTIL TOW TRUCK ARRIVED.",
        "vin": "1GCPYFEL8LZ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/09/2020",
        "dateOfIncident": "10/07/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363601,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "HOLLOW VALVE STEM FAILURE.  METAL SHARDS GOT INTO THE OIL & SEIZED UP THE MOTOR.  WAS DRIVING 35MPH AT NIGHT ON A BUSY 2 LANE CITY STREET, NO SHOULDER.  LESS THAN 1,200 MILES ON THE ENGINE",
        "vin": "1GCPYFEL1LZ"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/07/2020",
        "dateOfIncident": "08/31/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363144,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "CHEVY SILVERADO 1500 - HAS A FEEL LIKE RUNNING OVER RUMBLE STRIPS AND GOES AWAY. OCCURS AT OR BETWEEN 60 AND 65 MPH. IT ISN'T CONTINUOUS AT ALL. DOESN'T DO IT AT LOWER SPEEDS OR HIGHER SPEEDS THAT I CAN FEEL. TRUCK WAS PURCHASED BRAND NEW IN 2020",
        "vin": "1GCRYEEDXLZ"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/06/2020",
        "dateOfIncident": "10/05/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363011,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN PUTTING THE VEHICLE IN REVERSE WHEN ITS DARK THE BACK UP CAMERA COMES ON THE RADIO SCREEN.  WHEN DOING SO THE BRIGHTNESS OF THE SCREEN CAUSES THE INABILITY FOR MY EYES TO ADJUST TIMELY.  THIS BRIGHTNESS ALSO CAUSES MY INABILITY TO SAFELY USE MY SIDE MIRRORS BECAUSE OF THIS BLINDING EFFECT.  THERE IS NO WAY TO DIM NOR TURN OFF THIS FEATURE.  THIS HAS ALWAYS DONE THIS SINCE DELIVERY AND I'VE BEEN TO THE DEALER MULTIPLE TIMES FOR OTHER SOFTWARE UPDATES AND RECALLS.  THIS STILL HASN'T BEEN ADDRESSED AND IS A MAJOR SAFETY CONCERN.",
        "vin": "1GCRWCETXLZ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/04/2020",
        "dateOfIncident": "09/26/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362658,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUCK IS NEW WITH 700 MILES. SEPTEMBER 26TH 2020 I CAME TO A STOP AT A LIGHT.AS I TOOK OFF THE TRUCK STARTED TO JERK AND THE CHECK ENGINE LIGHT CAME ON. I IMMEDIATELY DROVE IT HOME. AS I WAS DRIVING HOME WHILE IN MOTION THE TRUCK WOULD JERK WHEN IT WAS CHANGING GEARS. I RECEIVED A TEXT FROM GM THAT SAID TO HAVE THE ENGINE OR TRANSMISSION SERVICED WITHIN 7 DAYS. I DID NOT DRIVE IT UNTIL I WAS ABLE TO TAKE IT TO CHEVY.  SEPTEMBER 28TH 2020 ON THE WAY THERE THE VEHICLE DID THE SAME THING. ON SEPTEMBER 30TH 2020 THE CHEVY TECHNICIAN SAID THE TRUCK WAS READY HE SAID THE PROBLEM WAS A TRANSMISSION CONTROL MODULE THAT WAS NOT PLACED CORRECTLY. I PICKED THE TRUCK UP OCTOBER 1ST 2020 AND DROVE IT STRAIGHT HOME JUST FINE. OCTOBER 2ND IN THE MORNING DRIVING TO WORK THE TRUCK STARTED TO JERK AGAIN AND THE CHECK ENGINE LIGHT CAME ON AND I RECEIVED ANOTHER TEXT FROM GM SAYING TO HAVE THE ENGINE OR TRANSMISSION SERVICED WITHIN 7 DAYS. ON THE WAY TO CHEVY I HAD TO STOP AT A LIGHT WHEN THE LIGHT CHANGED GREEN THE TRUCK DID NOT WANT TO TAKE OFF AND STARTED TO ROLL BACK AND I ALMOST HIT A VEHICLE. I PUT THE TRUCK IN PARK TURNED IT OFF RESTARTED IT THEN SAFELY DROVE IT TO CHEVY. TODAY IS OCTOBER 4TH AND I HAVEN'T HEARD ANYTHING FROM CHEVY I DID NOT BELIEVE THAT A TRANSMISSION CONTROL MODULE WOULD BE PLACED INCORRECTLY FROM THE FACTORY I BELIEVE THIS TRUCK HAS SOME KIND OF DEFECT AND IS UNSAFE TO DRIVE UNTIL CHEVY FIGURES OUT THE PROBLEM.",
        "vin": "3GCPWBEK9LG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/28/2020",
        "dateOfIncident": "09/28/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361587,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER PARKING FOR ABOUT AN HOUR STARTED THE TRUCK AND GOT WARNINGS FOR SERVICE ESC AND SERVICE POWER STEERING, DRIVE WITH CAUTION. TURNED ENGINE OFF AND ON A FEW TIMES, NO CHANGE. CALLED ONSTAR, THEY SAID THEY COULD SEND ROADSIDE ASSISTANCE, I CHOSE NOT TO GET THE SERVICE AS WE WERE IN THE MIDDLE OF NOWHERE DOWN A SINGLE TRACK DIRT ROAD. DROVE HOME WITH NO POWER STEERING, TRACTION WARNING LIGHT ON THE WHOLE WAY. TURNED ENGINE OFF THEN ON AGAIN AND THE ISSUE WAS RESOLVED. IT LOOKS LIKE THERE HAVE BEEN SERVICE BULLETINS/RECALLS FOR SIMILAR ISSUES BUT NOTHING ACTIVE ON MY TRUCK WITH 2100 MILES. SOFTWARE/SENSOR PROBLEMS LIKE THIS CAN LEAD TO VERY DANGEROUS SITUATIONS. THANKS FOR THE WORK YOU DO AT NHTSA",
        "vin": "3GCUYGEL3LG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/24/2020",
        "dateOfIncident": "09/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360910,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 CHEVROLET SILVERADO 1500. THE CONTACT STATED THAT THE BACK OVER PREVENTION CAMERA FAILED TO FUNCTION AS DESIGNED. THE VEHICLE WAS TAKEN TO ANDERSON CHEVROLET (31201 AUTO CENTER DR, LAKE ELSINORE, CA 92530), AND THE CONTACT WAS INFORMED THAT THE INFOTAINMENT SYSTEM WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT STATED THAT THE VEHICLE WAS NEW AND THAT THE VEHICLE WAS TAKEN TO THE DEALER FOR THE RUNNING BOARD AND THAT THE VEHICLE REMAINED AT THE DEALER. THE CONTACT STATED THAT THE DEALER DECLINED TO EXCHANGE THE VEHICLE FOR ANOTHER VEHICLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 100. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/17/2020",
        "dateOfIncident": "09/16/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355567,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN FOOT BRAKE AND EMERGENCY BRAKE IS RELEASED AND TRUCK IS PUT IN D POSITION, LOUD POP IS HEARD AND TRUCK LUNGES FORWARD ALL AT ONCE WITH NO EXCELERATION. CHEV DEALERS IN AREA WON'T SEE VEHICLE FOR OVER 2 WEEKS EVEN WITH SAFETY RECALL OUT.  TRIP CANCELLED.  NEVER BUY A CHEV!!!",
        "vin": "3GCNYAEF8LG"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/10/2020",
        "dateOfIncident": "08/24/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354130,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 CHEVROLET SILVERADO 1500. THE CONTACT STATED WHILE DRIVING 60 MPH HAULING A LOAD, THE VEHICLE STARTED PULLING TO LEFT. THE CONTACT TURNED THE STEERING WHEEL SIDEWAYS TO STRAIGHTEN THE VEHICLE. THE VEHICLE SHIFTED SIDEWAYS WHENEVER THERE WAS A BUMP IN THE ROADWAY. THE CONTACT DROVE THE VEHICLE HOME AT A REDUCED SPEED. THE CONTACT STATED THAT THE FRONT WAS ALSO RUBBING AGAINST THE AXLE. THE VEHICLE WAS TAKEN TO FELDMAN CHEVROLET OF LIVONIA (32570 PLYMOUTH RD, LIVONIA, MI 48150, (734) 367-4664) AND DIAGNOSED WITH A BENT SUBFRAME. THE CONTACT WAS INFORMED THAT THE REPAIR WAS NOT COVERED UNDER WARRANTY OR A RECALL. THE CONTACT WAS INFORMED THAT THE CAMBER NIPPLES FRACTURED CAUSING THE SUBFRAME TO BEND. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE CONTACT WAS INFORMED THAT AN INTERNAL INVESTIGATION WOULD BE CONDUCTED AND HE WOULD BE GIVEN A CALLBACK. THE FAILURE MILEAGE WAS 9,800.",
        "vin": "1GCPYCEF3LZ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/08/2020",
        "dateOfIncident": "09/06/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353746,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR WINDOW SPONTANEOUSLY SHATTERED L. NOTHING HIT THE THE WINDOW AND THERE WAS NO EVIDENCE THAT AN OBJECT HIT THE WINDOW. THE BOTTOM CORNERS BROKE FIRST. THE TRUCK WAS PARKED AND OFF IN A PARKING LOT. THERE IS SEALANT ON ONE END OF THE WINDOW THAT APPEARS TO HAVE COME OUT.",
        "vin": "3GCPWBEH1LG"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/27/2020",
        "dateOfIncident": "08/12/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351536,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 SILVERADO 1500 CUSTOM CREW CAB 4.6L, V6.  PURCHASED TRUCK ONAUGUST 10, 2020. TOOK IT TO DEALER ON AUGUST 17, 2020 BECAUSE OF JERKING FORWARD AT LOW SPEED (20-25 MPH) AND REAR BRAKES MAKING A DEEP RUBBING SOUND.  OF COURSE, TECHNICIAN SAID THERE WERE NO PROBLEMS (BECAUSE HE COULD NOT DUPLICATE) THE JERKING MOTION.  AFTER PICKING UP MY TRUCK, I NOTICED THAT THEY DID NOT EVEN ADDRESS THE BRAKE ISSUE, NOR DID THE SERVICE ADVISOR NOTE IT ON THE FORM.",
        "vin": "3GCPWBEH2LG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/25/2020",
        "dateOfIncident": "08/24/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351153,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "INOPERABLE INFOTAINMENT SYSTEM / BACKUP CAMERA / RADIO / ONSTAR. UPON STARTING VEHICLE, SCREEN STAYS BLACK AND NONE OF THE AFOREMENTIONED SYSTEMS WILL OPERATE.",
        "vin": "3GCUYEET2LG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/18/2020",
        "dateOfIncident": "07/31/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349997,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 CHEVROLET SILVERADO 1500. THE CONTACT STATED THAT THE KEY CEASED IN THE IGNITION AND THE VEHICLE WOULD NOT START. SEVERAL UNKNOWN WARNING LIGHTS ILLUMINATED INCLUDING THE CHECK ENGINE WARNING LIGHT. THE CONTACT STATED THAT SEVERAL UNKNOWN DEALERS WERE CONTACTED BY PHONE. THE CONTACT STATED THAT AN INDEPENDENT MECHANIC WAS ABLE TO GET THE VEHICLE STARTED HOWEVER, THE CHECK ENGINE WARNING LIGHT WAS AGAIN ILLUMINATED. THE CONTACT STATED THAT THE VEHICLE HAD BEEN TAKEN FIVE TIMES TO SEVERAL UNKNOWN DEALERS WITH THE PURGE VALVE BEING REPLACED THREE TIMES. THE VEHICLE WAS TAKEN TO JIM BROWNE CHEVROLET BUICK GMC OF DADE CITY (10741 U S 301, DADE CITY, FL 33525, (352) 567-1222) AND REMAINED AT THE DEALER WHILE THE MECHANICS ATTEMPTED TO DUPLICATE THE FAILURE BY DRIVING THE VEHICLE OVER SEVERAL DAYS AND SEVERAL MILES. THE MANUFACTURER WAS CONTACTED AND INFORMED OF THE FAILURE. THE CONTACT WAS REFERRED TO THE DEALER AND PROVIDED A CASE NUMBER. THE CONTACT WAS ALSO PROVIDED A CASE NUMBER. THE FAILURE MILEAGE WAS 13,900.",
        "vin": "3GCPWBEK8LG"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/12/2020",
        "dateOfIncident": "08/12/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348927,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I WENT IN THE STORE THIS AFTERNOON, WHEN I RETURNED TO MY TRUCK AND STARTED IT UP I HAD A SERVICE POWER STEERING DRIVE WITH CARE WARNING AS WELL AS SERVICE ESC.  I SHUT THE TRUCK OFF, WAITED A FEW MINUTES AND RESTARTED THE TRUCK, THE WARNING WAS STILL THERE SO I CALLED THE DEALER AND THEY SENT OUT A SERVICE TECH AND SERVICE MGR, THEY COULDN'T FIGURE IT OUT AND HAD IT TOWED TO BACK TO THE DEALER THE TRUCK ONLY HAS 1400 MILES ON IT",
        "vin": "1GCPWDED6LZ"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/10/2020",
        "dateOfIncident": "08/10/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348513,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS ON VACATION AND WENT TO EAT SUPPER APPROXIMATELY AN HOUR LATER RETURNED TO VEHICLE CRANKED UP TRUCK AND WENT TO LEAVE (IN REVERSE) WHEN I CUT THE WHEEL THE TRUCK HAD NO POWER STEERING AND SO I PRESSED THE BRAKE AND IT WAS BARELY WORKING, LUCKILY I WASN'T GOING TO FAST AND WAS ABLE TO STOP BEFORE HITTING THE VEHICLE BEHIND ME. CHECK ESC LIGHT CAME ON. HAD TO DISCONNECT THE BATTERY TO RESET THE COMPUTER",
        "vin": "1GCUYBEF8LZ"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/06/2020",
        "dateOfIncident": "08/05/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343608,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FOLLOWING ALL TAKES PLACE WHILE DRIVING THE VEHICLE ON THE INTERSTATE AND CITY, AT HIGHER RATES OF SPEED AND WHEN TRAVELING AT A SLOWER SPEED - WHICH IS AN EXTREME DANGER - EVERY DASH WARNING LIGHT CAME ON AND WARNING MESSAGES FLASH (BRAKES, STEERING, TRAILER, FUEL, ETC) ROLL FROM MESSAGE TO MESSAGE, BRAKES GET SOFT AND HARD TO STOP, TRUCK TRIED TO STALL AND SLOWED DOWN LIKE IT WAS LOSING POWER (THIS HAPPENED WHILE ROLLING AT 45 MPH), AC STOPPED WORKING (FAN WORKING BUT COLD AIR STOPS), TRUCK LUNGED FORWARD WHILE ENGAGING THE BRAKES TO SLOW DOWN AT A RED LIGHT, STEERING DEFINITELY STIFFER DUE TO LACK OF POWER ASSIST. THESE SAME MESSAGES AND WARNING LIGHTS WILL ALSO CONTINUE TO FLASH WHEN THE TRUCK IS PARKED. THIS ISSUE STARTED AT 3300 MILES ON JULY 8TH, THEN IT HAPPENED AGAIN JULY 24TH, THEN AGAIN AUG 4TH/5TH.",
        "vin": "1GCUYEED6LZ"
    },
    {
        "components": "STEERING,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/30/2020",
        "dateOfIncident": "04/21/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342317,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 CHEVROLET SILVERADO 1500. THE CONTACT STATED THAT WHILE PULLING OUT OF THE DRIVEWAY AT APPROXIMATELY 5 MPH, THE BRAKE PEDAL WAS DEPRESSED AND WENT TO THE FLOORBOARD BEFORE STOPPING THE VEHICLE. THE CHECK ENGINE AND SERVICE BRAKING SYSTEM WARNING LIGHTS WERE ILLUMINATED. ADDITIONALLY, THE ENGINE POWER REDUCED AND POWER STEERING ASSIST FAILURE MESSAGES WERE DISPLAYED ON THE INSTRUMENT PANEL. THE CONTACT STATED THAT THE POWER STEERING WAS TEMPORARY AND RETURNED TO NORMAL OPERATION. THE VEHICLE WAS TAKEN TO JOE BASIL CHEVROLET (5111 TRANSIT RD, DEPEW, NY 14043, (716)683-6800) TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE BRAKING SYSTEM NEEDED TO BE REPROGRAMMED. THE CONTACT WAS INFORMED THAT THE BRAKE FAILURE WAS RELATED TO NHTSA CAMPAIGN NUMBER: 20V116000 (SERVICE BRAKES, HYDRAULIC). THE RECALL REPAIR WAS PERFORMED. THE MECHANIC WAS UNABLE TO IDENTIFY THE CAUSE OF THE POWER STEERING FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 1,451.",
        "vin": "3GCPYBEH5LG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/20/2020",
        "dateOfIncident": "07/19/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340368,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED THE ENGINE AND HAD NO POWER STEERING. I HAD A MESSAGE THAT SAID SERVICE ECS  I BELIEVE. POWER STEERING HAS STARTED WORKING AGAIN SINCE.",
        "vin": "3GCPWBEF3KG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/17/2020",
        "dateOfIncident": "07/05/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340002,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I STOP SLOWLY THE BRAKE PEDAL STARTS TO MAKE A NOISE AND STARTS TO SHAKE. YOU CAN LITERALLY FEEL YOUR FOOT SHAKING WHEN STOPPING SLOWLY. IT DOES NOT MAKE IT EVERY TIME BUT WHEN IT DOES IT MAKES IT LIKE 4 TIMES. I FIRST NOTICED THIS WHEN DRIVING ON THE HIGHWAY WHILE ON A ROAD TRIP THEN IT STARTED DOING IT ON THE CITY STREET. IT DOES IT WHEN YOU ARE MAKING A STOP BUT HAVENT STOPPED COMPLETELY BECAUSE WHEN YOU COME TO A COMPLETE STOP IT STOPS DOING IT.",
        "vin": "3GCUYEED0LG"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/17/2020",
        "dateOfIncident": "03/26/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340017,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE WAS DELIVERED TO ME IN LATE MARCH 2020. NEW SMYRNA BEACH CHEVROLET SOLD ME TWO FAULTY VEHICLES. THE FIRST THEY TOOK BACK AND NOW THIS SECOND VEHICLES BACK UP CAMERA WORKS INTERMITTENTLY FROM DAY ONE. GM NOR THE DEALER SHIP CAN LOCATE THE REPLACEMENT PART AND THIS HAS BEEN ON-GOING FOR 3 MONTHS NOW. I DO NOT FEEL SAFE DRIVING A VEHICLE THAT HAS A FAULTY CAMERA. I FEAR THAT AS A RESULT, BODILY INJURY COULD RESULT TO SOMEONE ELSE. GM HAS FAILED TO GIVE ME AN ETA ON THE PART, FAILED TO PUT ME IN A LOANER VEHICLE, AND FAILED TO RESOLVE THE PROBLEM BY OFFERING ADEQUATE TRADE ASSISTANCE TO GET ME INTO A WORKING VEHICLE.",
        "vin": "3GCPYFEDXLG"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/12/2020",
        "dateOfIncident": "07/11/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338941,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE SYSTEM FAILURE ON 2020 CHEVROLET SILVERADO 1500. MULTIPLE DASH WARNINGS NOTIFYING OF BRAKE FAILURE, ESC FAILURE, AND SERVICE BRAKE SYSTEM WARNING",
        "vin": "3GCPWCED5LG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/05/2020",
        "dateOfIncident": "07/05/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337568,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "DEAD BATTERY AT 1400 MILES... NO WARNINGS AND NO LIGHTS LEFT ON, NO EXCUSES!",
        "vin": "1GCRYEED6LZ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/27/2020",
        "dateOfIncident": "06/27/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331267,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS PARKED AT A LOCAL LAKE WHEN I STARTED MY 2020 CHEY TRUCK AND NOTICED SEVERAL WARNINGS ON MY INSTRUMENT CLUSTER. BRAKE SYSTEM FAILURE, CHECK ENGINE LIGHT, SERVICE ESC & SERVICE TRAILER BRAKE. I BACKED UP SLOWLY AND NOTICE MY BRAKE PEDAL WAS HARD AND IT TOOK A LOT OF EFFORT TO GET IT TO STOP. THERE WAS A WARNING THAT SAID DRIVE NO FASTER THAN 43 MPH. THE TRUCK WOULD NOT EXCEED 43 MPH. I DROVE IT HOME ABOUT 3 MILES. WHEN I GOT HOME I TURNED OFF & RESTARTED THE TRUCK ALL ERROR CODES WERE GONE, BUT THE ENGINE LIGHT WAS STILL ON. THE BRAKES SEEM TO BE WORKING FINE, BUT I AM STILL TAKING IT TO THE DEALER MONDAY TO BE SAFE. I HAVE READ THAT THIS IS A COMMON PROBLEM AND SHOULD BE A RECALL, BUT I COULD NOT FIND ONE FOR MY VEHICLE. EVERYONE THAT OWNS ONE OF THESE TRUCKS SHOULD BE INFORMED ABOUT THIS ISSUE. IF PEOPLE ARE NOT AWARE OF THIS PROBLEM THERE WILL BE SOME SERIOUS ACCIDENTS BECAUSE OF THESE BRAKE FAILURES. NEVER THOUGHT I WOULD HAVE THIS PROBLEM FROM A CHEVY.",
        "vin": "3GCPWCED6LG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/26/2020",
        "dateOfIncident": "06/25/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331032,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE&#65279;&#65279; BRA&#65279;KE &#65279;ASS&#65279;&#65279;&#65279;&#65279;&#65279;&#65279;&#65279;IS&#65279;T&#65279;  SERVICE&#65279; ESC&#65279;  *TR",
        "vin": "1GCRYDEK3LZ"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/23/2020",
        "dateOfIncident": "06/17/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330260,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS STOPPED N THE DRIVE THRU AT IN-N-OUT WITH MY FOOT ON THE BRAKE AND THE ECO SYSTEM HAD TURNED OFF THE MOTOR. IT SPONTANEOUSLY TURNED BACK ON WITHOUT ME LIFTING MY FOOT OFF OF THE BRAKE AND THE  TRANSMISSION ENGAGED AND THE TRUCK LAUNCHED FORWARD APPROXIMATELY 12-18 INCHES.  THIS IS THE SECOND TIME THIS HAS HAPPENED TO ME.  IT ALSO HAPPENED ONE NIGHT ABOUT 2 MONTHS AGO. THIS COULD HAVE BEEN VERY DANGEROUS, I COULD HAVE HIT SOMEONE OR THEIR CAR OR I COULD HAVE EVEN RECEIVED WHIPLASH MYSELF.  *TR",
        "vin": "3GCUYDED7LG"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/15/2020",
        "dateOfIncident": "06/14/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328823,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INFOTAINMENT SYSTEM GOES TO MAX BRIGHTNESS AT NIGHT BLINDING THE DRIVER MAKING IT NEAR IMPOSSIBLE TO USE MIRRORS. THERE IS NO ADJUSTMENT TO CORRECT THIS.  *TR",
        "vin": "1GCPYFED2LZ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/08/2020",
        "dateOfIncident": "06/07/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327726,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TWO SEPARATE OCCASIONS: ON THE HIGHWAY AT SPEEDS OF APPROX 50-70 MPH, THE POWER STEERING FEEDBACK WHILE MOVING THROUGH A LEFT CURVE FAILED.  THE WHEEL DID NOT REACT BACK TO THE CENTER WHEN THE STEERING WHEEL WAS \"LET GO\". THE STEERING WHEEL FELT \"DEAD\" AND STAYED IN THE LEFT TURN POSITION. WHEN COMING OUT OF THE LEFT TURN/CURVE, THE WHEEL HAD TO BE FORCED BACK TO CENTER. PULLING OVER AND TURNING THE TRUCK OFF AND THEN ON, SEEMED TO FIX THE ISSUE TEMPORARILY. FEELS EXTREMELY UNSAFE.  *TR",
        "vin": "3GCUYEED1LG"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/08/2020",
        "dateOfIncident": "06/06/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327757,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "INFOTAINMENT SCREEN IS TOO BRIGHT FOR NIGHT DRIVING.  NO DIMMER CONTROL.  THE BACKUP CAMERA IS SO BRIGHT YOU CANNOT SEE OUT OF THE CAB.  I ALMOST RAN INTO A TREE TYING TO BACK THIS THING UP AT NIGHT.  DRIVING AT NIGHT, I WAS CONSTANTLY DISTRACTED BY THE BRIGHTNESS OF THE DISPLAY.   YOU CAN TURN OFF THE DISPLAY, BUT IF YOU NEED NAVIGATION THAT DOESN'T WORK.   YOU CAN DIM THE INTERIOR LIGHTS, BUT BY THEE TIME THE INFOTAINMENT SCREEN IS DIM ENOUGH YOU CAN NO LONGER SEE THE GAUGES.  THE VEHICLE WAS IN MOTION.  *TR",
        "vin": "1GCUYBEF3LZ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/29/2020",
        "dateOfIncident": "05/28/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326551,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 SILVERADO LT WITH ONLY 4660 MILES WAS PARKED IN A NEIGHBORHOOD DRIVE WAY WHERE OUR 17 YEAR OLD SON HAD SPENT THE NIGHT WITH A FRIEND. HE STARTED THE TRUCK TO LEAVE AND IMMEDIATELY HAD SEVERAL ALARMS; BRAKE SYSTEM FAILURE, DRIVE NO FASTER THAN 62 MPH, SERVICE TRAILER BRAKE, SERVICE ESC. HE TRIED TO EASE OUT OF THE DRIVE TO TEST BRAKES, ABOUT 5-10 MPH; HE HAD NO BRAKES, ZERO  BRAKES! HE ROLLED TO THE EDGE OF THE DRIVEWAY AND TURNED THE TRUCK OFF. AFTER ABOUT 5 MINS HE STARTED THE TRUCK AGAIN AND THE BRAKES WERE WORKING AND ALARMS WERE CLEARED BUT CHECK ENGINE LIGHT REMAINED ON. THIS WAS A VERY DANGEROUS SITUATION AND COULD HAVE LED TO MUCH WORSE ENDING. AFTER RESEARCHING ONLINE, WE FOUND THAT THIS IS VERY COMMON AND GM HAS DONE 2 RECALLS ON THIS PROBLEM YET IF YOU AREN'T AWARE OF IT, YOU, YOUR FAMILY OR OTHER INNOCENT DRIVERS COULD BE KILLED BECAUSE GM AND THE NHTSA HAVE NOT MOVED STRONGLY ENOUGH TO WARN OWNERS, THERE SHOULD BE A NATIONWIDE 'DO NOT DRIVE' ALERT ISSUED ON THESE VEHICLES. I HAVE CONTACTED MY ATTORNEY TO SEE HOW TO PROCEED AND OUR SON WILL NOT RISK HIS LIFE IN THIS TRUCK AGAIN. NO BRAKES AND NO EMERGENCY BRAKE!! WOULD GM'S CEO LET THEIR 17 YEAR OLD DRIVE THESE DANGEROUS TRUCKS? THE NHTSA NEEDS TO TAKE IMMEDIATE DIRE ACTION ON THIS, LOOK AT YOUR OWN WEBSITE AT HOW MANY COMPLAINTS THERE ARE ON THIS EXACT PROBLEM! MY ATTORNEY READ YOUR SITE AND HE SAYS YOU ALL CAN'T DENY KNOWING THE PROBLEM EXIST, TAKE ACTION BEFORE DRIVERS DIE. GM AND NHTSA ARE BEING NEGLIGENT ON THIS AND I WILL GLADLY TESTIFY IN ANY CLASS ACTION LAWSUIT AND UNFORTUNATELY THERE WILL BE SOME. GM SHOULD DO THE RIGHT THING AND IMMEDIATELY ADVISE ALL DRIVERS OF 2019-2020 CHEVY SILVERADOS TO STOP DRIVING THEIR NEW $40,000 TRUCKS AND CALL A LOCAL DEALER TO COME GET IT. DRIVERS WHO READ THIS PLEASE BE ADVISED, THIS IS VERY DANGEROUS AND SOME GM DRIVER WILL DIE BECAUSE OF THIS BRAKE FAILURE.  *TR",
        "vin": "3GCPWCEK7LG"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/22/2020",
        "dateOfIncident": "05/22/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325525,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2020 SILVERADO 1500 THE BACK UP CAMERA IS SO BRIGHT AT NIGHT TIME (THE SCREEN BRIGHTNESS AND ITS WHITE WASHED/ TOO HIGH OF CONTRAST) THAT IT MAKES IT UNSAFE TO BACK UP AT NIGHT TIME. I AM BLINDED BY THE SCREEN AND CANT EVEN USE THE SCREEN.  *TR",
        "vin": "1GCPYFED5LZ"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/20/2020",
        "dateOfIncident": "05/13/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325350,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE VEHICLE AND 7 DAYS LATER IT WOULD NOT START AND THE BATTERY WAS COMPLETELY DEAD HAD TO BE TOWED TO THE DEALERSHIP.  *TR",
        "vin": "1GCPYFED5LZ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/12/2020",
        "dateOfIncident": "05/11/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324334,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS MY SECOND COMPLIANT, ON 5/7/20,  AFTER  MY SHIFT ENDED.  THE TRUCK  WOULD NOT START.  I CALL THE SALES PERSON, WE WENT OVER SEVERAL STEPS AND IT STILL WOULD NOT START. I CALLED ON STAR. SHE SAID WILL DO  A DIAGNOSTIC. WHEN  SHE STARTED EVERY THING WELL OUT.  I CALL BACK BY PHONE AFTER AN HALF HOUR..THEY SENT ME A JUMPER. THE NEXT   DAY I TAKEN IT TO THE DEALER. THEY RESET EVERY THING. SAID BEFORE I PURCHASED IT MAY  HAVE SAT ON THE 6 MONTH. I HAD  IT FOR WEEKS!  ON 5/II/20,  I TURNED  THE ENGINE OFF GOT OUT AND LOCKED  THE TRUCK. A FEW SECONDS CAME BACK  AND UNLOCK  TRUCK, OPEN THE DOOR THE RADIO WERE STILL ON. AFTER THAT IT CUT OFF.  I WAS PARTED AT BJS.  *TR",
        "vin": "3GCUYEED8LG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/05/2020",
        "dateOfIncident": "03/25/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323321,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "AT COLD START UP, THE TRUCK IMMEDIATELY ILLUMINATED THE CHECK ENGINE LIGHT WITH A MESSAGE OF REDUCED ENGINE POWER. A SHUT DOWN AND RESTART PRODUCED THE SAME RESULTS. SHUT THE TRUCK OFF AND PULLED THE TROUBLE CODE P26BB. NEXT START UP, CHECK ENGINE LIGHT WAS STILL ON, BUT THE REDUCED ENGINE POWER MESSAGE WAS GONE. DROVE IT TO THE DEALER WITH NO PROBLEMS, WHERE THEY DIAGNOSED A FAULTY COOLANT FLOW VALVE. 38 DAYS LATER IT STILL SITS AT THE DEALER STILL NOT REPAIRED. IF THIS PROBLEM WAS TO HAPPEN UNEXPECTEDLY WHILE DRIVING, REDUCED ENGINE POWER COULD PRODUCE DANGEROUS CONDITIONS IN CERTAIN SITUATIONS ( IE PULLING INTO TRAFFIC, MERGING).  *TR",
        "vin": "3GCUYDET0LG"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/05/2020",
        "dateOfIncident": "05/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323426,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAND NEW TRUCK WITH ONLY 450 MILES.   FIRST INCIDENT WAS CHECK ENGINE LIGHT CAME ON , BRAKE PEDAL WAS REALLY HARD TO PRESS ALMOST HIT CAR INFRONT OF ME.  SECOND INCIDENT ALL LIGHTS CAME BACK UP   ABS,SRS, TRAILER BRAKE MODULE, PARKING BRAKE,  TRUCK WILL NOT GO FASTER THAN 42MPH. AND BRAKE PEDAL WAS REALLY HARD AGAIN. CALL ONSTAR FOR A DIAGNOSTIC AND  CODE CAME UP,  C05B0,P25A2.  CHECK ENGINE LIKE CAME OFF.  WENT TO DEALER TODAY AND THEY SAID NOTHING CAN BE DONE , BECAUSE NO LIGHT  IS ON.  SERVICE ADVISOR REFUSE TO PUT SCANNER TO READ ANY STORED CODE.  SERVICE ADVISOR SAY IT CAN BE THE COMPUTER IS RESENTING,   NEED TO KEEP DRIVING VEH UNTIL CHECK ENGINE LIGHT COMES BACK ON AGAIN.  NO FEEL SAFE ON  NEW VEH WITH NO BRAKES TWICE.  *TR",
        "vin": "1GCPWBEK5LZ"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/03/2020",
        "dateOfIncident": "05/03/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323147,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING VEHICLE (OURS DOES NOT HAVE THE STOP START TECHNOLOGY); HOWEVER WHEN IDLING LOW OR COMING TO A STOP THE VEHICLE WILL JERK THEN DIE.  THE MOTOR WILL COMPLETELY SHUT OFF; STALLING, THE ONLY WAY TO RESTART IS TO PUT THE VEHICLE IN NEUTRAL OR PARK AND TURN IGNITION AGAIN. THE MOTOR SHUTS OFF ENTIRELY USER IS UNABLE TO DRIVE; PRESENTS A HUGE SAFETY ISSUE.  PUSHING GAS PETAL DOES NOT WORK EVEN IF IT DID HAVE THE STOP START TECHNOLOGY.",
        "vin": "1GCPYCEF9LZ"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/03/2020",
        "dateOfIncident": "04/18/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323150,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "IT CUT OFF AT A STOP AND AFTER I STOP WITH WITH  MY FOOT ON THE BRAKES. I FELL BUMP IN THE REAR OF THE TRUCK, LIKE I BEEN REAR END AND THE REAR SHAKES. SOME THE THE AS WELL. IT CUT OF AFTER I STOP A FEW SECONDS AND START RIGHT BACK UP. IN DRIVE WAY IDLES ABOUT 15  OR LONGER, IT CUTS OFF. I HAVE TO RESTART IT. AND TAKING OFF IN HESITATION AND SOME TIMES MOVEMENT IN THE REAR  AND UNDER THE TRUCK. BOTH STATIONARY  AND IN MOTION.",
        "vin": "3GCUYEED8LG"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,TRACTION CONTROL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/17/2020",
        "dateOfIncident": "04/12/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321384,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TRACTION CONTROL SYSTEM DISENGAGES WITH WHILE VEHICLE IS IN MOTION AND MULTIPLE WARNING LIGHTS ARE ACTIVATED. (TCS, CHECK ENGINE LIGHT, AND \"ENGINE OPERATING AT REDUCED POWER\"  WHILE VEHICLE IS IN MOTION. THIS IS A NEW VEHICLE AND INCIDENT OCCURRED AT LESS THAN 300 MILES. THIS SEEMS TO OCCUR WHILE BRAKING: FIRST WHILE DRIVING IN TRAFFIC (TRAVELING AT <25MPH), THEN WHEN SLOWING ON APPROACH TO HIGHWAY OFF RAMP (TRAVELING AT <45MPH).  *TR",
        "vin": "3GCPYFED0LG"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/14/2020",
        "dateOfIncident": "04/14/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321113,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS ISSUE HAS HAPPENED MULTIPLE TIMES, IN THE CITY, HIGHWAY, AND DEFINITELY WHILE I WAS IN MOTION. THIS HAS ALMOST CAUSED ME TO REAR END ANOTHER DRIVER. I GET A ABS WARNING AND MY SPEED IS LIMITED TO 62MPH. MY BRAKES ARE HARDER TO PRESS ON AND DOESN'T SLOW DOWN THE TRUCK NORMALLY. I GET A ABS SIGN, TRACTION CONTROL SIGN, AND A CHECK ENGINE SIGN. THE TRUCK IS ALMOST BRAND NEW WITH ONE PREVIOUS OWNER, AND ONLY 15K MILES. THIS ISSUE NEEDS TO BE RESOLVED, THIS  IS UNACCEPTABLE. A TRUCK IS A LETHAL MACHINE AND IF I'M NOT ABLE TO STOP THE TRUCK HOW IT SHOULD BE STOPPED, I COULD POSSIBLY HURT OR KILL SOMEONE.",
        "vin": "1GCRWCED5LZ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/13/2020",
        "dateOfIncident": "04/11/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321035,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ON A VERY RAINY DAY I WAS DRIVING AROUND THE BLOCK I WENT THROUGH SEVERAL SMALL PUDDLES FROM RUN OFF SO NO MORE THAN TWO-THREE INCHES OF WATER. WITH A LOT OF RAIN AND SPLASHING FROM OTHER VEHICLES. MY TRUCK SPUTTERS AND DIES, NO DEEP WATER, NO OFF-ROADING. I WAS TOLD TODAY THAT THE TRUCK IS WATERLOCKED AND IT ISNT COVERED UNDER WARRANTY. I AM ASTOUNDED AS THIS WAS REGULAR DRIVING, HERE IS MY FACTORY LIFTED UP TRUCK WITH TONS OF CLEARANCE BROKE DOWN IN THE MIDDLE OF THE STREET AND LITTLE CARS PASSING ME BY DRIVING THE SAME ROAD I DID. THIS IS OBVIOUSLY A DESIGN FLAW OR SOMETHING AS I DON'T UNDERSTAND IF THIS TRUCK IS SO FRAGILE HOW COULD I EVER TAKE IT TO A BOAT RAMP. I BOUGHT A TRUCK TO USE AS A TRUCK.",
        "vin": "1GCPYCEH6LZ"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/03/2020",
        "dateOfIncident": "04/03/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320117,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE HOOD OF TRUCK IS A CHROME \"6.2L\" EMBLEM. ON SUNNY DAYS AND DRIVING WEST THE SUN REFLECTS VERY BRIGHTLY OFF OF THE EMBLEM AND INTO THE DRIVERS EYES. EVEN WITH SUNGLASSES THE REFLECTION IS VERY BRIGHT AND PENETRATING.",
        "vin": "3GCUYEEL3LG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/27/2020",
        "dateOfIncident": "03/26/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319408,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BACKUP CAMERA BRIGHTNESS IS SO EXCESSIVE IT CREATES A HAZARD BACKING AT NIGHT NOT BEING ABLE TO SEE OUT PASSENGER SIDE MIRROR, NO BRIGHTNESS CONTROL FOR NIGHTTIME",
        "vin": "3GCPYFED0LG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/26/2020",
        "dateOfIncident": "03/06/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319323,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY PURCHASED VEHICLE WITH 1035 ODOMETER MILES. ON 3/6/20, BRAKES FAILED WHILE DRIVING ON A CITY STREET-PEDAL WENT SOFT TO THE FLOOR. WHEN VEHICLE WAS RESTARTED, A C/S CHECK ENGINE LIGHT WAS ILLUMINATED. DROVE DIRECTLY TO CHEVROLET DEALERSHIP FOR SERVICE. DID NOT RECEIVE NOTICE OF RECALL PRIOR TO THE BRAKE FAILURE. REPAIRING DEALERSHIP INDICATED THAT REPAIR WAS PERFORMED UNDER CHEVROLET'S CUSTOMER SATISFACTION PROGRAM. RECEIVED POSTCARD NOTIFICATION OF RECALL FROM PURCHASE DEALERSHIP ON 3/25/20.",
        "vin": "3GCUYDED7LG"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/22/2020",
        "dateOfIncident": "03/21/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318941,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "IT HAPPENED AFTER DRIVING ON THE INTERSTATE, WE PULLED INTO A GAS STATION AND WHEN WE GOT BACK ON THE ROAD I FOUND THE LIST OF WARNINGS AND I LOST MOST ALL BRAKING AND POWER STEERING AND HAD A DASH FULL OF LIGHTS TELLING ME ALL SORTS OF WARNINGS. I PULLED OVER ON THE INTERSTATE ON-RAMP AND TURNED IT OFF AND BACK ON AND THE PROBLEM CONTINUED.  'SERVICE PARKING BRAKE'   'TRACTION CONTROL OFF'   'ENGINE POWER IS REDUCED'   'BRAKE SYSTEM FAILURE\"   'SERVICE ESC'   'SERVICE TRAILER BRAKE SYSTEM'   'STEERING ASSIST IS REDUCED DRIVE WITH CARE'   \"SPEED LIMITED TO 43 MPH\"",
        "vin": "3GCUYHEL5LG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/22/2020",
        "dateOfIncident": "02/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310710,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED VEHICLE 2/20/20 LEFT BROKEN VEHICLE AT DEALER SAME DAY. DROVE APPROX 40 MILES NO ISSUES. THEN CHECK ENGINE LIGHT AND SERVICE BRAKE ASSIST MESSAGE APPEARED IN DRIVERS MESSAGE WINDOW, GOING APPROX 50MPH. RETURNED TO DEALER THEY RESET FAULT AND CLAIMED FAULT OR ISSUES WAS CAUSED BY SOFTWARE LOADING. REPORTED TRUCK AS GOOD. DEPARTED AND DROVE 2.5 MILES PARKED AT STORE THEN BACKED OUT OF PARKING SPOT AND FAULT AND SAME MESSAGE APPEARED AGAIN WHILE BACKING AT 2 MPH. RETURNED TO DEALER THEY HAVE TRUCK IN THEIR POSSESSION. GAVE ME NEW TRUCK TO DRIVE HOME. AFTER RETURNING HOME SEARCHED FOR ISSUE AND FOUND THIS HAS BEEN A 3 MODEL YEAR ISSUE. CHEVROLET NEEDS TO BE HELD RESPONSIBLE AND NOT BE ALLOWING TO SELL PRODUCTS WITH THE BRAKING SAFETY DEFECTS.",
        "vin": "1GCPYFEL2LZ"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/20/2020",
        "dateOfIncident": "02/18/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310447,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "PUT TRUCK INTO PARK AND SHUT OFF, STARTED TO GET OUT BUT TRUCK WAS STARTING TO ROLL, TRIED TO STOP IT, PUSHED ON BRAKES, NO EFFECT, KEPT ROLLING AND GAINED MOMENTUM TILL IT HIT OUR CABIN AND STOPPED. LENGTH WAS 200FT APPX OF ROLL. MESSAGE CENTER SAID \" PRESS BRAKE TO START \" WHICH I WAS DOING AS IT GAINED SPEED. ALSO DURING ROLL THERE WAS A RATCHETING SOUND ALL THE WAY DURING THE 200FT ROLL WHICH IN DESCRIBING IT TO DEALER I WAS TOLD PARKING PAWL MAY NOT HAVE ENGAGED PROPERLY CAUSING THAT SOUND. I WAS ABLE TO START VEHICLE AFTER IT HIT CABIN SO I COULD ROLL IT BACK AWAY FROM CABIN. STARTED TRUCK AFTER ACCIDENT,  NO WARNING LIGHTS ON, BRAKES WORKED.  IN RURAL AZ, ON OUR PROPERTY WHEN THIS HAPPENED.   TAKING TO DEALER TOMORROW.",
        "vin": "3GCUYGET2LG"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/18/2020",
        "dateOfIncident": "02/12/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309941,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING SERVICE ESC MESSAGE AND SYSTEM BRAKE FAILURE MESSAGE ILLUMINATED ON CENTER CLUSTER DISPLAY, ATTEMPTED TO APPLY THE THE BRAKES AND PEDAL WENT TO THE FLOOR ALMOST ROLLED INTO A BUSY TO LANE ROAD IN THE CITY. RECEIVED AN ONSTAR MESSAGE IMMEDIATELY AS WELL, PUT TRUCK INTO PARK AND SHUT IT OFF AND REMOVED THE KEY AND OPENED THE DRIVER DOOR, THEN RESTARTED TRUCK PREVIOUS MESSAGES WERE GONE BUT CHECK ENGINE LIGHT WAS ON. TWO DAYS LATER AT THE DEALERSHIP THE CHECK ENGINE LIGHT WAS OFF.",
        "vin": "3GCPYCEF7LG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/16/2020",
        "dateOfIncident": "01/24/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309493,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "LIGHTS ON INSTRUMENTS PANEL ON AND OFF,, GAS GAUGE NOT WORKING. MILES LEFT  GOES UP AND DOWN WHEN TRUCK IS SITTING.",
        "vin": "1GCRWCED8LZ"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/12/2020",
        "dateOfIncident": "02/12/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308877,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE ROAD, GAVE IT GAS TO GO AROUND A VEHICLE AND IT FELT LIKE THE VEHICLE SHUT DOWN.  ESC CAUTION, CHECK ENGINE LIGHT, AND BRAKE WARNING/CAUTION ALL ILLUMINATED.  VEHICLE BEGAN TO SLOW DOWN DRASTICALLY AND IF I HADN'T GOTTEN OFF THE ROAD QUICKLY I WOULD HAVE BEEN HIT.  IF I HAD BEEN TURNING INTO TRAFFIC FROM A STOP AND THAT HAPPENED I WOULD HAVE BEEN HIT.  PULLED THE VEHICLE OVER, TURNED IT COMPLETELY OFF, REMOVED THE KEY, RESTARTED THE VEHICLE AND EVERYTHING WENT AWAY EXCEPT THE CHECK ENGINE LIGHT.  HEADED TO THE DEALERSHIP AND AGAIN I GAVE IT SOME GAS AND IT DID IT AGAIN.  PULLED OVER, TURNED OFF/ON AND SAME RESULTS, EVERYTHING CLEARED BUT CHECK ENGINE LIGHT.  IF THIS WERE TO HAPPEN ON THE INTERSTATE THIS COULD CAUSE A MAJOR INCIDENT.    I WAS ON A CITY STREET ON BOTH OCCASIONS.  I HAD TO NURSE THE GAS PEDAL RETURNING TO THE DEALERSHIP WHICH WAS ABOUT 7 MILES FROM THE INITIAL INCIDENT.  THE VEHICLE IS A 2020 CHEVY SILVERADO 1500 WITH THE 2.7L TURBO ENGINE.",
        "vin": "3GCPYBEK5LG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/10/2020",
        "dateOfIncident": "02/10/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308342,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE SYSTEM FAILURE LIGHT, STEERING ASSIST REDUCED DRIVE NO FASTER THAN 62 MPH SERVICE TRAILER BRAKE, SERVICE ESC. BRAKES WENT TO THE FLOOR AND DID NOT WANT TO STOP.",
        "vin": "3GCPYFED6LG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/08/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307866,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKUP CAMERA FUZZY MORE AT NIGHT GM SAYS ITS THE THE LOW COST CAMERA BUT ITS A SAFETY ISSUE ITS TERRIBLE.",
        "vin": "3GCUYDED0LG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/06/2020",
        "dateOfIncident": "02/06/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307608,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER PARKING FOR ABOUT 20 MINUTES, STARTED THE TRUCK AND THE ABS BRAKE LIGHT CAME ON. A WARNING ON THE SCREEN SAID SOMETHING TO THE AFFECT...BRAKE ABOVE 62 MILES FAILURE. ENGINE LIGHT CAME ON. I STARTED DRIVING AND NOTICED NO BRAKE PRESSURE. PRESSED BRAKE HARD, ALL THE WAY, THEN TRUCK STARTED TO SLOW DOWN. LUCKILY THERE WAS NOTHING IN FRONT OF ME OR I WOULD HAVE HIT IT. I CHECKED FOR BREAK FLUID LEAK UNDER THE TRUCK, NO LEAKS. I OPENED THE HOOD, NO LEAKS NOTED. I TURNED OFF THE TRUCK. WAITED A MINUTE AND STARTED IT AGAIN. SAME THING...NO BREAKS. BREAK WARNING LIGHTS CAME ON AGAIN. I FINALLY CALLED A TOW TRUCK FOR REPAIR.",
        "vin": "3GCPWDED6LG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/05/2020",
        "dateOfIncident": "02/04/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307341,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE INTERSTATE WHEN TRAFFIC BEGAN TO BUILD UP. AS I TRIED TO SLOW DOWN I NOTICED AN EXTENDED DELAY IN STOPPING. NO WARNING LIGHTS CAME ON AT THIS POINT AND I CONTINUED TO DRIVE. I THEN EXITED THE INTERSTATE AND STOPPED AT A LOCAL GROCERY STORE. I STARTED MY VEHICLE BACK UP AND BEGAN DRIVING TO SCHOOL. I WAS DRIVING AROUND 40 MPH AND IT WAS THEN THAT MY VEHICLE ALARM WENT OFF AND SCREEN ADVISED THAT MY BRAKES HAD FAILED. I COULD NOT STOP MY VEHICLE AND HAD NO BRAKES. I THEN PUSHED THE PEDAL ALL THE WAY TO THE FLOOR BOARD. MY TRUCK SLOWED ENOUGH FOR ME TO GET IT INTO MY SCHOOL'S PARKING LOT. I THEN ENGAGED THE EMERGENCY PARKING BREAK AND NOTIFIED ROADSIDE ASSISTANCE.",
        "vin": "1GCUYEED3LZ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/22/2020",
        "dateOfIncident": "01/19/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301177,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 SILVERADO 1500 DURAMAX 3.0  1200 MILES AND CHECK ENGINE LIGHT WITH CODES. I WAS 300 MILES FROM HOME SO GLAD IT MADE IT.  TAKE TO DEALER AND THEY TELL ME I CANT DRIVE IT BECAUSE OF A FAILED MASTER CYLINDER ISSUE. PART IS ON UNKNOWN BACKORDER.",
        "vin": "3GCUYEET0LG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/06/2020",
        "dateOfIncident": "12/31/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297440,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER HAVING FOG LIGHTS PROGRAMED AT THE DEALER, LOST BRAKE ASSIST ON THE WAY HOME AT LAST LEFT TURN AND TRUCK TOOK LONGER TO STOP BEFORE THE TURN THEN NORMAL ON A CITY STREET SPEED ABOUT 45MPH, CHECK ENGINE LIGHT CAME ON CHECKED CODES AT HOME FOUND 4, P25A2 BRAKE SYSTEM CONTROL MODULE REQUESTED MIL ILLUMINATION U0101 LOST COMM WITH TCM, U0100 LOST COMM WITH ECM/PCM AND U0146 LOST COMM WITH GATEWAY A. TOOK TO GM DEALER AND WAS TOLD NO PROBLEMS FOUND AND  CODES WERE CLEARED.",
        "vin": "1GCRWBEH9LZ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/26/2019",
        "dateOfIncident": "12/17/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291367,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 CHEVROLET SILVERADO 1500. WHILE THE CONTACT'S WIFE WAS TRAVELING THROUGH AN INTERSECTION AT AN UNKNOWN RATE OF SPEED, THE VEHICLE DID NOT RESPOND WHEN THE BRAKE PEDAL WAS DEPRESSED. ALSO, THE BRAKE WARNING INDICATOR ILLUMINATED. THE CONTACT TOOK THE VEHICLE TO AN INDEPENDENT MECHANIC AND WAS INFORMED NOT TO DRIVE THE VEHICLE BECAUSE THE BRAKES WERE DEFECTIVE. THE CONTACT'S WIFE ATTEMPTED TO DRIVE THE VEHICLE TO A LOCAL DEALER, BUT THE BRAKES FAILED AGAIN. THE VEHICLE WAS TOWED TO HERB CHAMBERS CHEVROLET OF DANVERS (90 ANDOVER ST, MA-114, DANVERS, MA 01923) WHERE THE VEHICLE WAS INSPECTED AND THE CONTACT WAS PROVIDED A LOANER VEHICLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND DID NOT ASSIST. THE VEHICLE WAS REPAIRED, BUT THE CONTACT DID NOT FEEL COMFORTABLE DRIVING THE VEHICLE. THE FAILURE MILEAGE WAS 738.",
        "vin": "1GCUYEED4LZ"
    }
]