[
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "11/27/2021",
        "dateOfIncident": "11/23/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11441817,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I reached between the driver seat and center console to retrieve my keys. When I pulled my hand back up something on the seat sliced my hand open and I needed 5 stitches. After looking closely at both the front seats (driver and passenger) there is a very sharp piece between the seat and console on both seats. Chevrolet corporate was contacted and they said to take it to a dealer so it doesn’t happen again. My vehicle is scheduled to be inspected by a dealer on 12/08/21.   1. Sharp piece on seat and yes it’s available for inspection  2. Hand was cut when reaching between seat and center console resulting in 5 stitches.  3. Chevy corporate said thanks for letting them know and advised taking it to a dealer so it “doesn’t happen again.” The local dealer scheduled me for an inspection but did not say whether or not this is something they’ve heard before.  4. The vehicle will be inspected by a dealer on 12/08/21 (the soonest they had available).  5. No warnings/messages prior to incident",
        "vin": "1GNERHKW2LJ"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/25/2021",
        "dateOfIncident": "10/23/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438013,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "UNKNOWN We were on the highway when we noticed the engine light come on, then the fuel gage went all the way to empty then back up again. We were going about 65-70 mph. I am taking my vehicle in today to get fixed",
        "vin": "1GNEVKKW0LJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/18/2021",
        "dateOfIncident": "10/18/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437260,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "All 4 doors do not lock or unlock, keyfob only works to open liftgate.",
        "vin": "1gnergkw9lj"
    },
    {
        "components": "Carry Handle, Shell, Base,Other/I am not sure",
        "crash": false,
        "dateComplaintFiled": "09/30/2021",
        "dateOfIncident": "09/28/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435062,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2020",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Graco Children's Products, Inc.",
                "productMake": "GRACO",
                "productModel": "EXTEND2FIT",
                "productYear": "9999",
                "type": "Child Seat"
            }
        ],
        "summary": "The styrofoam impact pad broke apart and fell off. This is the impact styrofoam for the head",
        "vin": "1GNEVGKW9LJ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/02/2021",
        "dateOfIncident": "08/02/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427404,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 CHEVROLET TRAVERSE. CONSUMER WRITES IN REGARDS TO DEFECTIVE BRAKE PEDAL.   THE CONSUMER STATED 3 TIMES SINCE THE PURCHASE OF THE VEHICLE, THE CONSUMER'S FOOT SLIPPED UNDER THE BRAKE WHEN ATTEMPTING TO REVERSE.",
        "vin": "1GNERGKW2LJ"
    },
    {
        "components": "AIR BAGS,FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "07/27/2021",
        "dateOfIncident": "07/06/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11426703,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle turned in front of our traverse we where traveling approximately 30mph struck other car broadside and no air bag deployment?  But odor of airbag in our Vehicle was present. But there no deployment visible? Body shop states no issues with airbag system. But they are replacing airbags in repair of our vehicle. \"The airbag systems are faulty and unsafe\"",
        "vin": "1gnevkkw6lj"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/11/2021",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416201,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT SLOW SPEED AFTER RELEASING THE EMERGENCY BRAKE THERE IS A SQUEAK COMING FROM THE REAR OF THE VEHICLE. IT FEELS LIKE THE BRAKE STAYS A BIT ENGAGE",
        "vin": "1GNEVGKWXLJ"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/09/2021",
        "dateOfIncident": "03/28/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407202,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRES SHIMMERING/BOUNCING GOING AT HIGHWAY SPEEDS.",
        "vin": "1GNERGKW5LJ"
    },
    {
        "components": "STEERING,SEAT BELTS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/15/2021",
        "dateOfIncident": "05/28/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402990,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS STARTED AROUND MAY 2020... I WAS AT ABOUT 2K MILES IN. I WAS TOLD IT WAS DUE TO WEATHER. AND THAT THEY HAD OTHER CHEVY WITH SAME ISSUE- \"SO IT'S NORMAL\". I BOUGHT THE 2020 CHEVY TRAVERSE BRAND NEW RIGHT OFF LOT. AFTER WE PACKED UP AND VISITED FAMILY I NOTICED IT HAD SOUNDS. THE SOUNDS WERE LIKE WHINING NOISES JUST LOUD AND SERIOUSLY OBNOXIOUS. IT ONLY HAPPENED WE WERE TURNING VEHICLE AT FIRST. SO WE GET HOME AND IT STARTED BEING LOUDER. I THEN NOTICED AS I WAS DRIVING AND AFTER I SLOWED DOWN TO LIKE 20 HEADING FOR A STOP SIGN THE CAR SUDDENLY HAS THIS BURST OF ENERGY AND SPEEDS UP TO LIKE 33 CAUSING ME TO HIT BREAKS. I TOLD MY HUSBAND AND HE WAS LIKE I DON'T KNOW MAYBE IT IS EXPUNGING GAS. AFTER I SLOW DOWN? ISN'T THAT DANGEROUS. I IGNORED IT BUT IT CONTINUES EVER SO OFTEN AND THIS IS ON REGULAR STREETS -SPEED LIMIT IS 35. THEN THE WHINING NOISE FROM WHEEL HAD ME TERRIFIED. SO WE WENT TO DEALER. THAT WAS COMICAL. DUDE WAS LIKE \"IT'S A CHARACTERISTICS OF THE CAR\". I'M LIKE WHAT? WHY WOULD THEY MAKE A CAR WITH AN ANNOYING SOUND - ITS DISTRACTING. I DON'T WANT TO DIE BECAUSE OF MY WHEEL. I READ ONLINE OTHER PEOPLE HAD PROBLEMS SO WE WENT TO ANOTHER DEALER AND ANOTHER. THE GUY AT LAST DEALER WAS LIKE THIS IS NOT NORMAL. THEY CREATED CARFAX REPORT AND SWITCHED PART OUT. I COULD GO ON. SO  THAT LOUD NOISE NEVER WENT AWAY- AT FIRST IT WAS LOW AND NOW LOUDER. I CALLED CHEVY AGAIN AND THEY ARE LIKE A DEALER HAS TO ACCESS SITUATION AND CALL US. THIS IS NOT SAFE. ALSO THE OTHER PROBLEMS ARE SEATBELT LOCKS. THE MIDDLE SEAT DESIGN IS TERRIBLE. MY DAUGHTER WAS SITTING THERE WHEN IT WENT BACK IN BETWEEN SEAT AND LOCKED IT WOULDN'T LET UP NO MATTER WHAT. HAD TO TAKE SEAT APART TO FIX SEAT BELT. MY SEAT IN FRONT LOCKS AND ITS RELENTLESS. SO UNCOMFORTABLE AND IT CHOKES ME BECAUSE I'M SHORT. TERRIBLE DESIGN BECAUSE IT CAN'T ADJUST LIKE THE GM VERSION. I HAVE VIDEO PROOF/RECEIPTS.",
        "vin": "1GNERGKW1LJ"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/06/2021",
        "dateOfIncident": "02/04/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399508,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE & MANY MANY MORE ARE EFFECTED WITH THE DAYTIME DRIVING LIGHTS THAT COME ON WHEN VEHICLE IS PUT IN GEAR. GREAT IDEA, BUT NO TAILLIGHTS EVER COME ON. I HAVE ALMOST RUN INTO MULTIPLE VEHICLES IN FOGGY CONDITIONS. IT ALSO HAS A NEGATIVE PURPOSE IN SNOW & RAIN. CAN'T BELIEVE THIS HAS NOT BEEN BROUGHT TO YOUR ATTENTION BEFORE THIS.",
        "vin": "1GNEVGKW3LJ"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": true,
        "dateComplaintFiled": "03/02/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11398735,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "GOT IN A 50 MPH ACCIDENT FRONT PASSENGER. NONE OF THE AIRBAGS DEPLOYED. THIS IS A BRAND NEW CAR WITH ONLY 6200 MILES. HAS AIRBAGS EVERYWHERE. THE HIGHWAY PATROL AND MYSELF CANNOT BELIEVE THIS.",
        "vin": "1GNERGKW4LJ"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/11/2021",
        "dateOfIncident": "02/10/2021",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395738,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 CHEVROLET TRAVERSE. THE CONTACT STATED HER HUSBAND WAS DRIVING AT 50 MPH AND WHEN VEHICLES A HEAD OF HIM STARTED TO SLAM ON THEIR BRAKES, THE CONTACTS HUSBAND THEN DEPRESSED ON THE BRAKE PEDAL BUT THE STEERING WHEEL AND THE BRAKES ON THE VEHICLE LOCKED WHICH CAUSED THE VEHICLE TO SLID CRASHING INTO THE REAR END OF A UTILITY TRUCK IN FRONT OF HIM. THE VEHICLE THEN CAUGHT ON FIRE. THE AIR BAG DID DEPLOY. NO WARNING LIGHT ILLUMINATED ON THE VEHICLE. THE FIRE WAS EXTINGUISHED BY THE UTILITY TRUCK DRIVER ON THE SCENE. THERE WERE NO INJURIES REPORTED. NO MEDICAL TREATMENT WAS NEEDED AT THE SCENE. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO A IMPOUND WHERE THEN THE INSURANCE COMPANY HAD THE VEHICLE TOWED WHERE THEY PLAN TO INSPECT THE VEHICLE. THE LOCAL DEALER NOR THE MANUFACTURER WERE NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 7,000.",
        "vin": "1GNERGKW6LJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "01/28/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390497,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SURROUND VISION SYSTEM  NOT WORKING. IT WAS OCCASIONALLY, NOW IT DOES NOT WORK AT ALL. WE ONLY GET A DARK SCREEN WITH A RED HAZARD TRIANGLE.  IT STARTED THE DAY WE BOUGHT THE CAR AND THE DEALER CLAIMS THEY HAVE ANOTHER CAR LIKE MINE AHEAD OF ME WITH THE SAME PROBLEM. SINCE THE LAST WEEK OF DECEMBER THEY HAVE CLAIMED THAT GM DOES NOT HAVE A FIX FOR THIS ISSUE. I MADE A COMPLAINT WITH MY CHEVROLET CUSTOMER SERVICE CASE # 9-6485705057, BUT I DON'T GET ANY ANSWERS FROM THEM EITHER.   I AM NOT SURE IF THIS SYSTEM IS TIED INTO THE ADAPTIVE BRAKING/CRUSE, BUT I HAVE YET TO HAVE THE VEHICLE TAKE ACTION IN THAT REGARD. IN CHECKING THAT OUT. I GOT WAY CLOSER THAN I FELT COMFORTABLE WITH, I KEEP WAITING FOR THE CAR TO REACT TO THE CLOSING DISTANCE BUT IT NEVER DID. I BACKED IT OFF MYSELF. I WAS WELL WITHIN TWO CAR LENGTHS OF THE VEHICLE AHEAD (55 MPH) AND CLOSING IN AT ABOUT 3 OR 4 MPH. IF YOU HAVE TO BE CLOSER THAN THAT FOR IT TO ACTIVATE THEN I WILL NOT BE USING IT.   I HAVE BEEN DEALING WITH THIS DEALERSHIP FOR SEVERAL YEARS, AND HAVE PURCHASED 3 AUTOMOBILES FROM THEM. THEY HAVE PERFORMED THE REGULAR SERVICE AND WARRANTY WORK ON ALL OF THEM WITH NO PROBLEMS AT ALL. FOR THEM TO HAVE AN ISSUE FIXING IT IS NOT TYPICAL OF THE SERVICE I HAVE RECEIVED FROM THEM IN THE PAST. SO, WHEN THEY TELL ME GM DOES NOT KNOW HOW TO FIX THE ISSUE. I HAVE TO BELIEVE THEM UP TO A POINT.   WITH THE SMALL WINDOWS IN THE BACK OF THIS VEHICLE. VISIBILITY IS EXTREMELY LIMITED, AND IT IS A SAFETY ISSUE.   IF THEY CAN'T KEEP THE BASIC SURROUND VISION SYSTEM WORKING. HOW ARE THEY GOING TO MAINTAIN AUTONOMOUS VEHICLES TO A LEVEL THAT PROTECTS ALL INVOLVED?",
        "vin": "1GNERHKW6LJ"
    },
    {
        "components": "SEAT BELTS,SEATS",
        "crash": false,
        "dateComplaintFiled": "01/08/2021",
        "dateOfIncident": "01/02/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387112,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SEAT BELT AND SEAT LOCKS ON THE RECLINER HANDLE...THE SEAT BELT WON'T RELEASE AND THE CHAIR WILL NOT MOVE FORWARD OR BACK",
        "vin": "1GNEVGKW6LJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/23/2020",
        "dateOfIncident": "12/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384744,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN SHIFTING FROM DRIVE TO REVERSE, OR PARK TO REVERSE, THE TRANSMISSION WILL NOT ENGAGE RIGHT AWAY. THE VEHICLE WILL ROLL FORWARD OR BACKWARDS UNTIL THE TRANSMISSION ENGAGES INTO REVERSE. THIS WILL HAPPEN WHEN THE VEHICLE IS IN MOTION AT VERY LOW SPEEDS (1-2 MPH) AND ALSO WHILE STATIONARY.",
        "vin": "1GNERFKWXLJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/17/2020",
        "dateOfIncident": "10/16/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383881,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 CHEVROLET TRAVERSE. THE CONTACT STATED THAT THE START/STOP FEATURE FAILED WHILE THE VEHICLE WAS IN OPERATION. THE CONTACT STATED THAT AFTER COMING TO A COMPLETE STOP, THE ENGINE STALLED. NO WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS TAKEN TO AUTONATION CHEVROLET GREENACRES SERVICE CENTER (5757 LAKE WORTH RD SUITE A, GREENACRES, FL 33463) AND GRIECO CHEVROLET OF DELRAY BEACH (2605 S FEDERAL HWY, DELRAY BEACH, FL 33483) AND WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED A CASE NUMBER. THE FAILURE MILEAGE WAS APPROXIMATELY 1,100.",
        "vin": "1GNERFKW5LJ"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/07/2020",
        "dateOfIncident": "12/03/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378281,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY PURCHASED CAR. ON THURSDAY DECEMBER 3,2020. WAS DRIVING CAR BACK HOME ON A BUSY STREET,  CAR STARTING STALLING. WOULD NOT GO PAST 20 MPH, ENGINE WAS REVVING. NEXT MORNING TO GO TO WORK CAR WOULD NOT GO ON REVERSE. HAD TO GET CAR TOWED TO THE DEALER AND THEY ARE TELLING ME THAT IT IS A TRANSMISSION PROBLEM. THAT THE TRANSMISSION NEEDS TO BE REPLACED. DEVON AT RICK HENDRICK IN DULUTH, GA HAS BEEN NOTHING BUT RUDE SINCE PURCHASE OF VEHICLE NOW I DO NOT FEEL SAFE DRIVING THIS VEHICLE AND I HAVE 4 YOUNG CHILDREN AGES 10, 8, AND 5. IF SOMEONE WOULD OF HIT ME FROM BEHIND WE COULD OF BEEN INJURED. I BOUGHT A NEW VEHICLE FOR THE PIECE OF MIND OF NOT HAVING ANY ISSUES WITH THE VEHICLE AND NOW THIS. I AM VERY UPSET.",
        "vin": "1GNERFKWXLJ"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/22/2020",
        "dateOfIncident": "10/21/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365725,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN WEATHER IS SLIGHTLY HUMID  / WET AND AROUND 50 TO 65 DEGREES, THE FRONT WINDOWS CONSTANTLY FOG UP TO THE POINT THAT BOTH DEFROSTERS AND WIPERS ARE INEFFICIENT. THIS CREATES A SAFETY AND VISIBILITY ISSUE ESPECIALLY AT NIGHT. NO AMOUNT OR SPEED OF DEFROSTER ADDRESSES THE ISSUE. THIS HAS BEEN OBSERVED ON MY VEHICLE AS WELL AS MANY OTHERS, CREATING A SAFETY AND OPERABILITY ISSUE. THE ISSUE IS ON THE EXTERIOR OF THE WINDOW, POSSIBLY FROM A FILM OR VENTILATION ISSUES ON THE INTERIOR. NO AMOUNT OF HOT OR COLD TEMPERATURE ADDRESSES THE ISSUE OTHER THAN A WIPER RUNNIGN CONSTANTLY, EVEN WHEN IT IS NOT RAINING OR WET OUTSIDE.",
        "vin": "1GNEVKKW9LJ"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/18/2020",
        "dateOfIncident": "04/04/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365038,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRES:BRIDGESTONE ALANZA 255/65 R18 111T MTS. AT SPEEDS @60-75 MPH ON RIDGED CEMET HIGHWAYS THIS VEHICLE NEEDS CONSTANT (SLIGHT) OVER STEERING. ALL OTHER ROAD THERE IS NO PROBLEM. WITH A SIDE WIND IT'S REALLY PRONOUNCED. THE WRITE UP PERSONAL AT THE DEALER HAD HEARD OF THIS ISSUE BUT COULD NET FIND ANY WRITTEN INFO ANYWHERE. THE SALESMAN HAD ALSO HEARD OF THE PROBLEM ON BOTH THE TRAVERSE AND EQUINOX. KIND OF SURPRISES ME WHEN I HIT A RIDGED SECTION AT HIGH SPEED. MY QUESTION IS WILL THIS FAIR ON A SNOWY MICHIGAN HIGHWAY.",
        "vin": "1GNERGKWXLJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/25/2020",
        "dateOfIncident": "09/24/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361199,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE BROKEN DOWN AND BEEN TOWED 4 TIMES NOW.  COME TO STOP ON ROAD- AUTO-ENGINE SHUT OFF ENGAGES- CAR DIES CAN NOT RESTART.  FUSE BLOWS-- FIRST OCCASION WAS TOLD BAD FUSE- REPLACED, NEXT OCCURRENCE SAME FUSE BLOWS- WAS TOLD FAULTY STARTER DRAWING TOO MUCH POWER AND BLOWING FUSE UPON RESTART- STARTER REPLACED WAS TOLD THAT WILL FIX PROBLEM.  NEXT OCCURRENCE- CAR WOULD NOT START FROM PARKED POSITION- WAS TOLD WHOEVER REPLACED STARTER ( BUZZ CHEW CHECY- SOUTHAMPTON NY) DID NOT BOLT DOWN STARTER- LOOSE CONNECTIONS-- WAS TOLD PROBLEM FIXED. LAST OCCURENCE SAME AS FIRST 2- CAR STOPPED IN TRAFFIC- AUTO SHUT OFF ENGAGES- DOES NOT START /CAR DIES.  UNFORTUNATELY 2 OF THESE BREAKDOWNS WERE ON HIGHWAYS DURING RUSH HOUR-- WITH YOUR KIDS IN CAR. LAST OCCASION ALMOST REAR ENDED ON MULTIPLE OCCASIONS AS NIGHTTIME, STUCK IN MIDDLE LANE ON MAJOR TURNPIKE.... 10 YR OLD WILL NOT GET BACK IN CAR- HAS FEAR OF GOD.  WAS TOLD BY CHEVY BUZZ CHEW IN SOUTHAMPTON, NESSENGER CHEVY 112 PROBLEM WAS FIXED. DO NOT WANT TO ENDANGER MY FAMILY ANYMORE.",
        "vin": "1GNEVHKW7LJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/18/2020",
        "dateOfIncident": "11/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350030,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR CAMERA STOPPED WORKING AIDE SENORS STOPPED WORKING.  AFTER SEVERAL MONTHS OF TRYING TO FIX THIS THEY FINALLY MIGHT HAVE THIS ON THE RECALL LIST FOR SOME CABLE KIT, WHICH THEY DID NOT TOTALLY PUT ON MINE BECUASE DUE TO COVID THEY ARE BACKED UP ON MANUFACTURING, I DO NOT RELY ON BACK UP CAMERA BUT IT IS NICE TO DOUBLE CHECK.HAVE HAD IT IN 4 DIFFERENT TIME TO BE FIXED  ALSO RAIDE CONTINUE TO HAVE PROBLEMS.  BEEN REPLACED 3 TIMES.",
        "vin": "1GNEVKKW6LJ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/20/2020",
        "dateOfIncident": "07/17/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340360,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AT LOW SPEED THROUGH PARKING LOT. FELT A SNAP UNDER BRAKE PEDAL. IMMEDIATELY KNEW SOMETHING WAS WRONG. COASTED AT LOW SPEEDS TO OPEN AREA AS BRAKE PEDAL WAS NOT WORKING. EXITED NOTED BRAKE FLUID EVERYWHERE AND WHAT APPEARS TO BE A BRAKE LINE HANGING UNDER CAR. CAR TOWED. CURRENTLY AT DEALER. HAVE PICTURE. UNABLE TO UPLOAD.",
        "vin": "1GNEVKKW5LJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/29/2020",
        "dateOfIncident": "06/18/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331453,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 CHEVROLET TRAVERSE. THE CONTACT STATED THAT WHILE DRIVING 20 MPH, THE STEERING WHEEL BECAME FIRM, WITH THE ABS WARNING LIGHT ILLUMINATED. THE CONTACT PULLED OVER AND CONTACTED HER HUSBAND AND INFORMED HIM OF THE FAILURE. THE VEHICLE WAS LATER DRIVEN TO THE RESIDENCE. THE CONTACT STATED THAT ON JUNE 25, 2020 WHILE HER HUSBAND WAS DRIVING 75 MPH, THE FAILURE RECURRED WITHOUT WARNING. THE VEHICLE WAS DRIVEN BY HER HUSBAND TO FREMONT CHEVROLET LOCATED AT 5850 CUSHING PKWY, FREMONT, CA 94538, (510) 445-8700, WHERE HE WAS INFORMED THAT AN UNKNOWN SENSOR NEEDED TO UPDATED. THE VEHICLE WAS REPAIRED HOWEVER, THE FAILURE PERSISTED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 300.",
        "vin": "1GNEVNKW8LJ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/11/2020",
        "dateOfIncident": "05/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324133,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*   THE CONTACT LEASED A 2020 CHEVROLET TRAVERSE. THE CONTACT STATED THAT THE VEHICLE WAS A MODIFIED VEHICLE WITH HAND CONTROLS INSTALLED. THE VEHICLE PASSED TESTING WHICH WAS APPROVED BY MANUFACTURER. WHILE DRIVING 6-7 MPH MERGING INTO TRAFFIC WITH THE ACCELERATOR PEDAL DEPRESSED, THE VEHICLE STALLED WITHOUT WARNING. THE CONTACT WAS INFORMED BY AN INDEPENDENT MECHANIC TO DISENGAGE THE START/STOP FEATURE. THE VEHICLE WAS DIAGNOSED AND THE CONTACT WAS INFORMED THAT THERE WAS NO OPTION TO DISENGAGE THE START/STOP FEATURE. THE VEHICLE WAS TAKEN TO VICTORY LAYNE CHEVROLET (3980 FOWLER ST FORT MYERS FL 33901-2604, (239) 936-1541) WHERE IT WAS CONFIRMED THAT THERE WAS NO OPTION TO DISENGAGE THE START/STOP FEATURE. THE VEHICLE WAS NOT REPAIRED.  THE MANUFACTURER WAS CONTACTED BUT NO FURTHER ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS 6,500.",
        "vin": "1GNERKKW3LJ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/20/2020",
        "dateOfIncident": "01/16/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300403,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE FAILURE ON A 2 DAY OLD CHEVY TRAVERSE  SEQUENCE OF EVENTS . . .   1.I PURCHASED A CHEVROLET TRAVERSE FROM LAWRENCE CHEVROLET ON TUESDAY, JANUARY 14, 2020 AND TOOK DELIVERY AT ABOUT 5:00PM.  2.WHILE MY WIFE WAS DRIVING ON THURSDAY, JANUARY 16, 2020, WE EXPERIENCED A LOW SPEED BRAKE FAILURE.  THIS OCCURRED WHILE ON THE WAY TO DULLES AIRPORT AT ABOUT 6:00PM.  THE BRAKES WERE SLOWLY APPLIED AND THEY DID NOT RESPOND.  THE BRAKES WERE THEN PRESSED HARD AND THEY DID NOT RESPOND.  I (MIKE) REACHED OVER TO TRY SHIFTING THE CAR INTO PARK BUT WAS UNSUCCESSFUL AND THE CAR DRIFTED AT A VERY LOW SPEED, 'A WALKING SPEED,' AND INTO THE BACK OF A TRACTOR TRAILER.  WE HAD VERY AMPLE SPACE TO STOP HOWEVER THE BRAKES SIMPLY DID NOT RESPOND.  MINIMAL DAMAGE OCCURRED TO THE VEHICLE'S FRONT.  I IMMEDIATELY CHECKED TO SEE IF SOMETHING WAS IN THE WAY OF THE BRAKES PEDAL (A FLOOR MAT OR OTHER OBSTRUCTION) AND THERE WAS NO OBSTRUCTION.  I COULD SEE, AND I AM CERTAIN, THAT HEATHER HAD HER FOOT ON THE BRAKE PEDAL.    3.GLENDA (ONSTAR/GM) ESTABLISHED CASE NUMBER 9-5760767809 AND SET UP A TOW TO OURISMAN CHEVROLET OF ROCKVILLE, MD.    4.I WAS GREETED BY ROBERTO (SERVICE MANAGER?) AND HELPED BY BOTH ROBERTO AND ALLEN KRUM (ASSISTANT SERVICE MANAGER).  THEY ALSO TOOK DOWN A DESCRIPTION OF THE INCIDENT AND THEY GAVE ME A RENTAL CAR.  OF NOTE, THEY SAID THAT SOMEONE OUTSIDE OF THE DEALERSHIP (A GM REP?) WOULD BE COMING TO LOOK OVER THE CAR.",
        "vin": "1GNEVGKW7L0"
    }
]