[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/17/2022",
        "dateOfIncident": "02/15/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452351,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Auxiliary battery exploded while vehicle was in operation. Explosion caused damage to front driver side headlight, hood insulation, windshield washer reservoir, terminal covers and battery. See attached images. Later learned of GM service bulletin (19-NA-099) regarding overheating of relay causing melted terminals on auxiliary battery",
        "vin": "1GNSKDECXLR"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/05/2021",
        "dateOfIncident": "08/20/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439528,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "In August 2021 I got a system light for a Saftey Restraint System, aka airbag issue. This system was going on and off sometimes as little as 5 seconds apart and then sometimes would go off for a bit then back on. I live on an Island and there is no dealer here I had to buy somewhere else. There is a mechanic here that does work on vehicles and per the dealership, I bought the car from I was told if the mechanic there can do a software update which is what he thought the problem was, then I should do that. I took this advice and did it. When we drove off the light was off and fixed for about 30 minutes, then the light and safety restrain error came back on. This time remaining on. I took it back to the mechanic and got two error codes. I have since tried to contact GM and been dealing with them for 3 weeks with no assurances if I pay to get my car to a dealship to fix I would get my money back for their error. I also came across and article about investigations into 750k 2020 & 2021 GM models including 2020 Chevy Tahoe for airbags not working. As a consumer, I should have the right to be able to be reimbursed for costs accruded to me to get my vehicle where I'm forced to get it fixed.",
        "vin": "1GNSKAKC9LR"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/09/2021",
        "dateOfIncident": "10/09/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436172,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Stopped at a traffic light my power steering warning light on the dash came on. After that I had no power steering, and the vehicle is very difficult to steer. I drove back to my location turn the vehicle off and who won out about an hour later started and the power steering was working.  Upon looking the issue up online I found that other models of my Tahoe have had a recall but no particular model has not.",
        "vin": "1GNSKAKC8LR"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/04/2021",
        "dateOfIncident": "09/15/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11435384,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owned a 2020 Chevrolet Tahoe. The contact stated that while driving approximately 45 mph, a 2016 Hyundai Sonata crashed into the front end and pushed the vehicle into other vehicles a Dodge Caravan and a 2021 Ford Expedition. The driver sustained a neck fracture and medical attention was provided. A police report was filed. There was no reported fire. The air bags failed to deploy. The vehicle was towed to a tow lot. The vehicle was towed to an independent mechanic where informed the air bag bracket was bent or broken. The local dealer was not contacted. The vehicle was not diagnosed or repaired. The manufacturer was not notified. The approximate failure mileage was 16,000. The vehicle was deemed a total loss.",
        "vin": "1GNSKBKC8LR"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/29/2021",
        "dateOfIncident": "03/29/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405374,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 CHEVROLET TAHOE. THE CONTACT STATED THAT THE SECOND-ROW PASSENGER'S SIDE SEAT COVER MADE A LOUD CRACKING NOISE. THE CONTACT STATED THAT THE FAILURE WAS PREVIOUSLY REPAIRED HOWEVER, THE FAILURE RECURRED. NO WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER DEWAYNE BLACKMON CHEVROLET (1410 SOUTH GLOSTER ST, TUPELO, MS 38801, (662)842-3611) TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE SEAT COVER WAS HOLLOW. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE BUT PROVIDED NO ASSISTANCE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 16,927.",
        "vin": "1GNSCCKJ1LR"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/17/2020",
        "dateOfIncident": "09/11/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355646,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "STRONG SMELL TO FUMES WHEN TURNING ON AC OR VENT SYSTEM.",
        "vin": "1GNSKBKC7LR"
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/13/2020",
        "dateOfIncident": "07/11/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 6,
        "odiNumber": 11339175,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT STATED THEY RENTED A 2020 CHEVROLET TAHOE. THE CONTACT STATED THAT WHILE COMING TO A STOP TO MAKE A U-TURN THE STEERING WHEEL SUDDENLY LOCKED. THE VEHICLE CONTINUED TO ACCELERATE FORWARD CRASHING INTO A WALL ON A DRIVEWAY OF A HOME NEARBY.  THE VEHICLE'S AIR BAGS DID NOT DEPLOY. THE VEHICLE WAS TOWED AND HAD NOT BEEN DEEMED TOTALED AS OF YET. A POLICE REPORT WAS FILED. THE CONTACT RECEIVED INJURIES TO THE HEAD AND KNEES. THE CONTACT STATED THERE WERE 5 PASSENGERS IN THE VEHICLE, NOT INCLUDING THE CONTACT, THERE WAS A PASSENGER IN THE FRONT AND FOUR IN THE REAR. THE CONTACT STATED THE PASSENGER IN THE FRONT HAD HEAD, MOUTH, AND WRIST INJURIES. THE PASSENGERS IN THE REAR RECEIVED INJURIES TO THEIR HEAD, FOOT, RIBS, LEGS, FACE. MEDICAL ATTENTION WAS NOT NEEDED. THE CONTACT HAD NOT CONTACTED THE DEALER. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 8,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/17/2020",
        "dateOfIncident": "06/17/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329434,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY NEW 2020 TAHOE HAS AUTO/POWER PEDAL HEIGHT ADJUSTMENT. IT ALLOWS BOTH PEDALS IN UNISON TO BE LOWERED OR RAISED FOR COMFORT AND DEXTERITY OF USE. THE HEIGHT DISTANCE BETWEEN THE BRAKE AND GAS PEDAL IS EXTREME.  THERE IS A INHERENT DANGER OF HITTING THE SIDE OF THE BRAKE PEDAL PRIOR TO GETTING ONES SHOE ONTO THE BRAKE PEDAL. WOMEN WEARING SANDALS OR OPEN FACE FOOTWEAR CAN POSSIBLY SNAG THEIR FOOTWEAR TO THE SIDE OF THE PEDAL PLATFORM. ANY HEAVY WORKING TYPE SHOE IS ALSO PRONE TO HITTING THE SIDE OF THE PEDAL FIRST. MY WIFE AND I BOTH NOTICED THIS DURING OUR SEPARATE TEST DRIVES. IN EACH CASE, THE TIMING OF ACTUALLY ENGAGING THE BRAKE PEDAL ENDANGERS THE DRIVERS ABILITY TO SLOW OR STOP HIS VEHICLE. ACCIDENTS WILL OCCUR. I ASKED THE SALESMAN IF THE PEDALS COULD BE SEPARATELY ADJUSTED, TO WHICH HE STATED IT WASN'T POSSIBLE.THE INABILITY TO ADJUST EITHER PEDALS HEIGHT INDEPENDENTLY FOR EACH DRIVERS DEXTERITY OF ENGAGEMENT IS IMPORTANT. WOULD BOTH AUTOMATIC POWERED SIDE VIEW MIRRORS BE EFFECTIVE IF THEY WERE SET TO BE ADJUSTED IN UNISON ONLY ? I'M NOT SURE WHEN AUTOMAKERS MADE THE DECISION TO NEGATE THE ABILITY TO ADJUST THE DISTANCE OF HEIGHT INDEPENDENTLY OF AT LEAST ONE OF THE PEDALS. THIS IS OUR FIRST VEHICLE PURCHASE SINCE OUR LAST IN 1985. IT APPEARS TO ME, THAT IT HAS BEEN AN UNAPPARENT OR UNNOTICED POSSIBLE REASON FOR ACCIDENTS. PLEASE LOOK INTO THIS MATTER. YOU MIGHT FIND MY OBSERVATION TO BE VERY LIKELY.  *TR",
        "vin": "1GNSKCKJ4LR"
    }
]