[
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/28/2021",
        "dateOfIncident": "04/18/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11414337,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT RENTED A 2020 DODGE GRAND CARAVAN. THE CONTACT STATED THAT WHILE ANOTHER PERSON WAS DRIVING THE VEHICLE AT 45 MPH, HE ATTEMPTED TO PASS ANOTHER VEHICLE BUT COLLIDED WITH ANOTHER VEHICLE IN FRONT OF HIM. THE CONTACT STATED THAT THE AIR BAGS DID NOT DEPLOY UPON IMPACT. BOTH THE DRIVER AND CONTACT WERE TRANSPORTED TO THE HOSPITAL VIA AN AMBULANCE. THE CONTACT WAS TREATED FOR A BROKEN NOSE AND A MAJOR BRUISE TO HER LEFT THIGH. THE DRIVER WAS TREATED FOR THREE BROKEN RIBS ON HIS RIGHT SIDE, BRUISES TO THE LEFT SIDE OF HIS HEAD, AND A BROKEN LEFT ARM. A POLICE REPORT WAS FILED AT THE SCENE. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHERE THE WHEREABOUTS OF THE VEHICLE REMAINED UNKNOWN. THE RENTAL COMPANY STATED THAT A CLAIM HAD BEEN FILED WITH THE MANUFACTURER. THE FAILURE MILEAGE WAS APPROXIMATELY 19,000.",
        "vin": "2C4RDGEG6LR"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/14/2020",
        "dateOfIncident": "05/08/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324523,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT STATED HE RENTED A 2020 DODGE CARAVAN. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 45 MPH, A DEER RAN IN FRONT OF THE VEHICLE CAUSING THE CONTACT TO CRASH INTO THE DEER. THE AIR BAGS FAILED TO DEPLOY. THERE WERE NO INJURIES.  A POLICE REPORT WAS FILED. THE VEHICLE WAS NOT TOWED OR TAKEN TO THE DEALER FOR DIAGNOSIS. THE VEHICLE WAS RETURNED TO AVIS CAR RENTAL (6405 US 49, HATTIESBURG, MS 39401 PHONE: (601) 264-2488). THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE.  THE APPROXIMATE FAILURE MILEAGE WAS 2,800. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    }
]