[
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/20/2022",
        "dateOfIncident": "01/20/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448293,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Bought vehicle new in 2020, has 41K miles.  Tonight, I noticed when arriving home that the entire center light on the lift gate is not functioning.  I also do not have tag lights and my rear camera is non-functioning.  At night, the back of the vehicle is not lit very well without that center light plus the tag is not illuminated.  I appears this is a common issue with the Durango.  I feel is poses a serious risk due to the rear lighting not functioning.",
        "vin": "1C4SDJCT3LC"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/18/2021",
        "dateOfIncident": "11/13/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440881,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 DODGE DURANGO. The contact stated that while driving approximately 55 mph with the cruise control on but not engaged. The contact stated they attempting to accelerate the vehicle however the vehicle had a delayed response. As they passed the vehicle they felt the engine shift underneath their feet. The contact stated that when they removed their pressure off the accelerator pedal they felt the vehicle accelerator activate on its own accord. The vehicle felt as though it activated the cruise control as if it was driving on its own causing the contact to attempt to apply the brakes however the vehicle failed to stop. The contact floored the brakes however they failed. The contact had to avoid other traffic. The contact stated that during this time they often came within the 3 feet parameter for the Collision Warning to activate however it failed to do so each time it should have.  They put their foot on the accelerator where a warning light that stated service regarding speed warning light. The contact lifted the accelerator backwards with their foot to release some of the pressure and pressed the brake at the same time for the vehicle to eventually relieve its own control where the contact was able to control the vehicle. The contact stated that it wasn't till about three minutes later they were able to pull over and come to a stop. The contact had taken the vehicle to the dealer who were unable to locate the service history. The vehicle had not been diagnosed and or repaired. The contact spoke with the manufacturer and a case was opened. The approximate failure mileage was 26,7500.",
        "vin": "1c4sdjct8lc"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/05/2021",
        "dateOfIncident": "11/05/2021",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439479,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Dodge Durango. The contact stated that he auto-started the vehicle while it was in the driveway. The contact stated as he came outside, the vehicle was on fire. The contact was able to extinguish the fire with the assistance of the fire department. There were no injuries sustained. A police report was filed. The dealer and the manufacturer were not notified of the failure. The vehicle was totaled. The approximate failure mileage was 11,200.",
        "vin": "1C4RDJDG9LC"
    },
    {
        "components": "EXTERIOR LIGHTING,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/01/2021",
        "dateOfIncident": "08/26/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11431314,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The rear tail lights have a sharp edge that is beak shaped and if you brush up against it on accident it slices into your skin or clothes. I was loading groceries and my arm skimmed over it and sliced a whole piece of skin off. I have researched the incident to see if others have had the same experience looking for a recall or solution after it happened to me and my husband multiple times most recently myself a big cut and I see forums with other people sharing same story.",
        "vin": "1C4RDHDG0LC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/14/2021",
        "dateOfIncident": "06/12/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11424824,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "There is a very sharp side on the back rear taillight that connects with the lift gate. This razor sharp edge has cut myself, husband, and almost my son. The only thing that saved him from getting cut was the sleeve on his shirt. I have reported this issue to Chrysler. An investigation is in process. The man came out to take pictures he also agreed this was a safety issue. Both my husband and I have been left with permanent scars.",
        "vin": "1C4RDHDGXLC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/17/2021",
        "dateOfIncident": "04/26/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417423,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Water intrusion into the rear tail lights.",
        "vin": "1C4SDJCT7LC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/26/2020",
        "dateOfIncident": "09/22/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361267,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING A BRAND NEW (170 MILES) VEHICLE AT 35 MPH ON A BUSY CITY STREET THE ELECTRIC POWER STEERING SUDDENLY STOPPED WORKING.  A MESSAGE \"POWER STEERING UNAVAILABLE\" POPPED UP AND THE CAR WAS VERY DIFFICULT TO STEER.  I HAD THE CAR TOWED TO THE DEALER WHO SAID IT MAY HAVE BEEN CAUSED BY A GLITCH IN THE COMPUTER.    THIS IS A VERY DANGEROUS SITUATION BECAUSE WITHOUT THE ELECTRIC BOOST IT'S VERY HARD TO STEER THE CAR.  IF THIS HAD HAPPENED IN A TURN OR WITH A DRIVER THAT WASN'T STRONG THERE WOULD LIKELY BE AN ACCIDENT.  THERE ALSO DIDN'T SEEM TO BE A CLEAR EXPLANATION OF WHAT CAUSED THE ELECTRIC STEERING RACK TO FAIL IN SUCH A NEW VEHICLE.",
        "vin": "1C4SDJCT7LC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/01/2020",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322997,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS REFUSED MY RECALL BEING FIX BECAUSE I HAD NY PLATES SAYING DUE TO THE VIRUS. I FEEL DISCRIMINATED AGAINST. THIS IS THE SAME AS CALLING A BLACK PERSON THE N WORD. REEDMAN TOLL DODGE SERVICE DEPT IN LANGHORNE, PA.  HER NAME IS [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1C4RDJDGXLC"
    }
]