[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/28/2022",
        "dateOfIncident": "03/28/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458617,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "All four brake rotors show premature signs of corrosion, rears worse than fronts, needed to have rotors replaced after 24 months.",
        "vin": "1FMCU9BZ8LU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/23/2022",
        "dateOfIncident": "03/16/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458002,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Left Front Door will not open all the way. Only opens 1/4, and window only goes down half way.",
        "vin": "1fmcu9g6xlu"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/16/2022",
        "dateOfIncident": "06/10/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456970,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "In the early summer of 2021, I started to hear a snapping noise in the driver’s door.  I thought it might be the hinge, but it appeared to be coming from the middle of the door.  It got continually worse. When I put the window down it would come back up and catch my arm and then go back down.  Eventually I was only opening the door a short distance so it would not snap.  It made it very difficult to get in and out.  So, for over 3 months I squeezed in and out of the car. I am concerned about the other 3 doors.  In early September I contacted the dealer and was to take it on September 7th.  But the door became worse suddenly and I could barely get out and at one point I was stuck in the car.  I called the dealer immediately and asked to bring it to them that day.  After some hesitation and my explaining if I was trapped in the car during an accident, they would be hearing from me.  She said to bring it over immediately. The service manager, after inspecting the door, came out and asked me if I had been in an accident!  I suggested he look at the car and check it thoroughly.  It was obvious I had not been in an accident.  He stated they had never seen anything like that before.  They were taking pictures and I stated I wanted my own pictures. When I went into the shop and viewed the door, I was upset to find that all the welds on the bracket that holds the door check had failed.  The bracket was down inside the door panel.  Because it was catching it was making the snapping sound.  When the window hit it, it would automatically go back up.  They told me it would be necessary to contact Ford for more information and it would be a week or so before I heard anything.  At 8:08am the following day, not one week, they called back and said they needed to order a new door, have it painted and replaced. That is the last I heard about the door.  I have been in touch with Ford Corporate and discovered this is not the first time this has happened.  I do have a case# with Ford.",
        "vin": "1FMCU9J90LU"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/13/2022",
        "dateOfIncident": "03/12/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456472,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 Ford Escape Titanium Hybrid - Battery does not start. Occurrence: twice at 15K and 21K. Total mileage on vehicle: 21K.   Turning the ignition key of the Escape Hybrid, the electric motor is supposed to be activated. The electric motor, in turn, starts the gasoline engine. At this point, there is total failure.",
        "vin": "1FMCU0DZ4LU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/10/2022",
        "dateOfIncident": "02/10/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455999,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "This is a Bluetooth issue. When you’re talking on the phone, after period of time you begin to sound like a robot. You have to take your phone off of Bluetooth and put it back on Bluetooth taking your eyes off the road. Many times it’s while you’re on the highway. My husband works for a company who purchased 600 cars for their last project and everyone he knows has the same issue. It’s definitely widespread. The Ford company says you have to have a radio person to deal with it and they don’t have a radio person on staff at some locations and others they’re only there for certain days of the week. this is a dangerous situation.",
        "vin": "1FMCU0BZ1LU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/28/2022",
        "dateOfIncident": "02/27/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454456,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Heard a popping sound and when opened the door it will not close.  The tack welding broke off the door causing it not to close.  Not under warranty.",
        "vin": "1FMCU0F67LU"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/10/2022",
        "dateOfIncident": "01/12/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451453,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "DOOR WELDS BROKEN AT DOOR Check ARM MOUNTING POINT. NEEDS REPLACE DOOR.",
        "vin": "1FMCU0G63LU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/09/2022",
        "dateOfIncident": "07/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451256,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Ford Escape. The contact stated that upon the depression of the brake pedal, an abnormal grinding noise would intermittently emit from the vehicle without warning. The contact also stated that the vehicle would intermittently hesitate upon depression of the accelerator pedal also with no warning. The contact had taken the vehicle to the dealer for repairs on two separate occasions; however, the failure persisted. The manufacturer was also notified of the failure but offered no assistance. The vehicle was not repaired. The failure mileage was approximately 2,800.",
        "vin": "1fmcu0g61lu"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/02/2022",
        "dateOfIncident": "01/17/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450061,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "My driver side front door started making this popping noise when I opened or closed the door and then within a week the black arm bracket/spot weld broke off the door. There is no damage to the door to cause this issue. It just happened randomly and the vehicle is under two years old. This shouldn’t be happening. I don’t feel safe driving this vehicle as I cannot even open it all the way for fear it will fall off or further damage whatever is going on inside the door. It’s affecting my window as well. It doesn’t roll down due to this hinge being broken. I do not know if it has affected any other safety features on the door.",
        "vin": "1FMCU9G65LU"
    },
    {
        "components": "VISIBILITY/WIPER,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/30/2022",
        "dateOfIncident": "01/30/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449461,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Front windshield failed sporadically under mild thermal shock. Outside temperature was in the range of 10°F and inside cabin had been warming up for about 30 minutes. Heat was not set to defroster. While stopped at an intersection, the windshield suddenly cracked across about 70% bottom edge emanating from a wiper contact point.  Vehicle is available for inspection upon request. Has not been reproduced. I’ve received anecdotes that this exact same break type and location has occurred under very similar circumstances in other Ford Escapes.",
        "vin": "1FMCU9G61LU"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/27/2022",
        "dateOfIncident": "01/25/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449123,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "BRIDGESTONE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I came in for a TPSC sensor recall and discovered that both of my rear tires were BALD and my front tires were worn. My brand new car has 23000 miles. I only have had this car for 2 years. Tire size P 225 / 55 R 19",
        "vin": "1FMCU0DZ9LU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/25/2022",
        "dateOfIncident": "12/15/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448745,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The vehicle started, but the dashboard was black and the wheels were locked.  The radio, heat, etc. were working.  I could put it into drive and reverse, but the wheels would not move.  The salesman I bought the car from drove out and loosened, then tightened the battery cables.  He said that it would re-boot the computer.  Either that worked OR the 20 minute wait time that I've been reading about worked.  Before this problem occurred, there were a few times that I got a message on my middle screen, (Navigation, etc) saying \"System Off To Save Battery...Please turn ignition off and start engine\" The dealership could not find a problem other than a low voltage issue with the battery. The service advisor told me they had the battery on a testing device for a \"really long time\" and the low voltage issue never resolved.  The service advisor also told me that I need to drive the car more and to watch for error lights in the cluster.   About a month later,  after running some errands , I turned the car off and a mild thud noise came from the engine area.  I knew the vehicle did not shut down properly.  When I came out from one of my errands and started my vehicle,  a  message came up on the middle screen, (n Navigation, etc.)   It read \" System Off To Save Battery....Please turn ignition off and start engine\"   There is also a burning smell when I drive the car now, this is new.  From what I've read on this site there is no doubt in my mind that this particular make and model of the Ford Escape has some serious and dangerous issues.  Please look into this.   I DO NOT feel safe driving this vehicle.",
        "vin": "1FMCU9H98LU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/12/2022",
        "dateOfIncident": "11/17/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447172,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 FORD ESCAPE. CONSUMER WRITES IN REGARDS TO DEFECTIVE BRAKES.  THE CONSUMER STATED WHILE DEPRESSING THE BREAK IN PARKING LOT, THE VEHICLE FAILED TO COME TO A STOP.  THE VEHICLE STRUCK A POLE AND A CAR BEFORE STOPPING.  THE VEHICLE WAS TOWED TO A DEALER WHERE THEY COULD NOT DUPLICATE THE FAILURE.",
        "vin": "99999999999"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/08/2022",
        "dateOfIncident": "01/04/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446697,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I experienced hearing a sloshing noise in my trunk, so when I open the trunk and inspected the battery compartment, it was completely flooded with water. The negative terminal is submerged in water and the positive wires are submerged in water. I tried to scoop out the water and got most all of it out, the next day it was full again!",
        "vin": "1fmcu0bz7lu"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/26/2021",
        "dateOfIncident": "12/25/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444989,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving down the road the car kicked off an error that said vehicle network communication error.  We lost all lights, all controls, and started loosing power to the engine.  The car died when we stopped it.  It would not allow us to shut the head lights off so we did this manually.   The car doesn’t respond in any way for anything",
        "vin": "1fmcu9j97lu"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "12/09/2021",
        "dateOfIncident": "12/09/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443223,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Blind spot light goes off while driving with no car next to me",
        "vin": "1FMCU0H68LU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/09/2021",
        "dateOfIncident": "12/03/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11443283,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I was involved in a collision with a pick-up truck in Gallup, NM on 12/3/21.  We hit the truck mid-section.  Front of my Escape was pretty much destroyed.  Our airbags did NOT deploy. Mine and my husbands safety was at risk due to the failure of the airbags to deploy in the crash. Vehicle is at the Ford Dealer in Gallup, NM waiting for State Farm to determine the next steps. I had no prior warnings or indications that the airbags were not functional.",
        "vin": "1fmcu0h63lu"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/06/2021",
        "dateOfIncident": "11/22/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442788,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Ford Escape. The contact stated while reversing there was an abnormal noise detected. The contact stated that the brakes were sticking. The brake warning light was illuminated. The contact called the local dealer and an appointment was scheduled however, the vehicle was not diagnosed or repaired. The manufacturer was not contacted. The approximate failure mileage was 4,000.",
        "vin": "1FMCU9H60LU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/28/2021",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441843,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Ruido en la parte frontal cuando manejo en cuidad, se llevó al dealer y no pueden precisar cual es el problema, solo me mencionaron que no tienen nada que ver con algo suelto ni nada que vaya a afectar la seguridad. No pidieron dejar la unidad para evaluación pero me dejan sin carro por varias semanas porque tienen demasiados vehículos en turno. No acepte porque no puedo quedarme sin vehículo por tantos días y tampoco me ofrecieron otro vehículo por el tiempo que tome la evaluación y reparar el problema.  El plástico que cubre la bolsa de aire de la parte de atrás pasajero detrás del conductor se está saliendo. No se cuanto tiempo lleva así pero no se ve bien y no se si tenga algún efecto en la seguridad de la bolsa de aire.",
        "vin": "1FMCU0EZ4LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/24/2021",
        "dateOfIncident": "11/23/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441589,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Ford Escape. The contact stated that upon entering a drive-thru line at a slow speed, the home screen went blank as the \"network configuration error\" warning message illuminated on the instrument panel. The contact then stated that the vehicle then shut off and could not be restarted after multiple attempts. The contact was unable to place the vehicle into neutral and had the vehicle towed to a dealer where it remained in their possession. The manufacturer was not notified of the failure. The vehicle was not repaired. The failure mileage was approximately 17,000.",
        "vin": "1fmcu9g69lu"
    },
    {
        "components": "PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "11/19/2021",
        "dateOfIncident": "09/12/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441032,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Parking brake came on by itself when parking on a dolly",
        "vin": "1fmcu0f68lu"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/14/2021",
        "dateOfIncident": "08/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440415,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The weld inside the driver door broke.",
        "vin": "1FMCU0BZ8LU"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/12/2021",
        "dateOfIncident": "05/15/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440235,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "One week after I bought this vehicle brand new, the curtain airbag cover on the driver's side and the passenger side started coming separated from the headliner creating a gap where my airbag can be seen. I took it to the dealership and was told there was going to be a recall but I never got one in the mail. Now I am told by the dealership there is not a recall and I have passed my warranty of 36000 miles and would have to pay to have it repaired. My concern is in case of an accident the airbag won't deploy as it's supposed to. This seems to be a safety issue and shouldn't be limited by a warranty.",
        "vin": "1FMCU0BZ5LU"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "11/02/2021",
        "dateOfIncident": "11/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439083,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Blind spot monitor going off with no car next to me",
        "vin": "1FMCU0H68LU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/23/2021",
        "dateOfIncident": "10/23/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437924,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Began driving from a parked position slowly down a one way residential street, Stop Safely Now alert came on and the vehicle stopped in the middle of the street and would not restart. Was unable to shift to neutral to move from the blocked roadway, and had to have another motorist jump the 12v battery to get the ignition button to operate. Took the vehicle to auto zone to have battery tested and it showed starter and battery were fine. This is a significant safety issue as I have to drive the vehicle 240 miles home tomorrow via interstate highways and I'm terrified the problem will persist before I can get it home and to my local dealership.",
        "vin": "1FMCU9BZ0LU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/21/2021",
        "dateOfIncident": "07/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437602,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The driver's side door hinge/arm broke and now swings wide open.  I'm worried that the door will fly open while driving and don't think this should be happening on a 1 year old vehicle.",
        "vin": "1FMCU9J90LU"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "10/07/2021",
        "dateOfIncident": "09/30/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435961,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Light turns on when there is no car next to me. Took it in to Ford. They ran diagnostic but where not able to find an issue and returned the car. It is still turning on when there is no car next to me",
        "vin": "1FMCU0H68LU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/07/2021",
        "dateOfIncident": "09/30/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435963,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Shaking when driving under 40 mph from when I got the car. They have not been able to fix. Causes a distraction",
        "vin": "1FMCU0H68LU"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/05/2021",
        "dateOfIncident": "08/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435614,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Ford Escape. The contact stated that while reversing and turning the steering wheel, the vehicle would make grinding noises. Additionally, the front driver’s side door latch had detached, and there was an electrical failure. The vehicle was taken to the dealer and diagnosed that the failure was related to the vehicle being involved in a rear-end collision, where the liftgate was damaged and replaced by an auto body shop. The dealer informed the contact that the frame was bent from the collision and the warranty was voided so they could not assist in repairing the door latch. The dealer did perform an alignment. The vehicle was repaired. The manufacturer was made aware of the failure and sent the contact a gift card but did not provide any assistance. Paid Drained and Flush rear end assembly and Refill. The failure mileage was approximately 18,000.",
        "vin": "1fmcu9h96lu"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/27/2021",
        "dateOfIncident": "09/27/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11434552,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The liftgate has a mind of its own.  It closes without warning and crashes on my head!  I can't load anything without holding one hand over my head to catch the door as it closes unexpectedly on my head. Even a shadow causes the liftgate to close - if a child or an animal walks by.      If you turn off the automatic liftgate feature you manually have to lift the gate and close it.  It is very heavy to lift and close and not practical.  It is way too sensitive and needs to be addressed before someone is seriously hurt.",
        "vin": "1fmcu9j98lu"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/12/2021",
        "dateOfIncident": "09/11/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432634,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "My car, at the time was a moving vehicle at a NYC parkway intersection. malfunctioned. Dashboard, navigation radio went black. Navigation panel shows vehicle network communications error. car stopped moving.gear can shift. hazard light or hatch can turn one. Once dealer restarted the car, system generated notification listed powertrain to restraint control and four wheel drive failures. But phone still kept connecting to car on Bluetooth. This caused me to have to keep dialing back to 911, AAA, Ford roadside and dealer service because call receiver kept thinking the call was not connecting So they would disconnect the call. hill assist and pre-collision failure reporter in 3/21. Sync failure was reported to sync support and ignored. I was told CRM was down and call back later. Apple product and level 3 had update its software to address it. It is one thing an old car stalls. We have police, roadside and Good Samaritan to help a single woman to pull off the toad. It is abominable that safety features malfunction. It is even more horrid when the paid Ford roadside assist’s response at two calls was “call911” when I asked them to walk me through recovery protocol. When I called my dealer service (queens Ford 7 miles away from incident location), I was told to look for backup  key slot, when I could not locate it at the described location, I asked for manual page number, I was told to call roadside or sales department to express my dissatisfaction) I found the manual page. The location identified does not provide a place to insert key. It took almost two hours before Ford contacted me about tow.  If NHTSA does not look into this there is no justice. My 2020 escape was purchased in sept 2020 with extended warranty.  It has only 9000 mi one it. Dealer offered a loaner. But kept me waiting because “it was too busy”. I refused to sign loaner gsreemtn, they threaten to report car stolen. Auto generated report still says car is healthy",
        "vin": "1FMCU9BZ7LU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/08/2021",
        "dateOfIncident": "08/03/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432216,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "On quite a few occasions, while braking down hill, it felt like I lost all brakes, despite pedal feel remaining steady.  It literally felt like sliding on ice.  Most recently, I recently experienced it on a hill where regenerative brakes would normally decelerate vehicle.  It felt like the brakes gave out in the middle of the hill.  Thankfully had no one in front of me so I was able to pump brakes and barely got vehicle to stop safely.  Then waited a few minutes - the brakes resumed normal operation.  Spoke with the dealer and they advised no knowledge of any such issue, and suggested I drop the car off so they could try to replicate the issue.  Not eager to have my wife drive the car, as this could lead to a serious accident.  Can clearly see from blogs and FB page on this vehicle that others have experienced the same - really thought I was alone on this.",
        "vin": "1FMCU9BZ8LU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/06/2021",
        "dateOfIncident": "06/15/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431884,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Groaning noise from engine compartment when accelerating",
        "vin": "1fmcu0f63lu"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/05/2021",
        "dateOfIncident": "06/15/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431818,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Wrench light came on less than 1 week after purchase. Car was bogging down terribly.  Took it to shop they said it was no big deal.  Told me to drive it until they could get appointment.  Next day it completely shut off on hwy. Air bag malfunction as well.",
        "vin": "1FMCU9G60LU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/04/2021",
        "dateOfIncident": "08/27/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431761,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "After driving for 45 min on freeway,exit off and approaching a light to turn , went to accelerated and car wouldn’t go.  It took a few seconds then it jumped and spontaneously accelerated.",
        "vin": "1FMCU0G61LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/02/2021",
        "dateOfIncident": "08/27/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431443,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "When using the ac water drains down whirring harness down to floor near gas petal",
        "vin": "1FMCU0BZ0LU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/01/2021",
        "dateOfIncident": "08/30/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431431,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Despite it being turned on, the Check rear seats for occupants alert stopped working. I no longer get that warning when car is turned off. The problem has not yet been reported to a dealer.",
        "vin": "1FMCU9J93LU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/24/2021",
        "dateOfIncident": "03/15/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430301,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Ford Escape. The contact stated while at a stop light, the vehicle inadvertently shifted into reverse independently. There were no warning lights illuminated. The contact also stated that the driver’s seat would go down and go forward while driving. The contact stated she could not readjust the seat after several attempts. The vehicle was taken to the dealer who diagnosed that no issues were found. The contact stated that the failure had been reoccurring while driving. The vehicle was taken to the dealer several times and the dealer test drove the vehicle but could not determine the cause of the failure. The manufacturer was not made aware of the failure. The vehicle was not repaired. The approximate failure mileage was 2,000.",
        "vin": "1FMCU9G61LU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/19/2021",
        "dateOfIncident": "07/09/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429755,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "On Dec. 27, 2019, I purchased a new 2020 Ford Escape from Walnut Creek Ford in California.  1.Within days I noticed that the car would, without warning, begin to shake violently when going down steep hills. I brought the car back to the dealer. but they couldn’t diagnose any problem. After the 4th return trip to the dealer, one of the technicians found a Ford repair bulletin that referenced the shaking issue. He fixed the car.  2.The 2nd problem was on July 9, 2021 about 1pm. I was traveling at 55mph on a freeway when the dashboard screens went totally black. There was no map, no speedometer, nothing at all on the screens. The directional signals wouldn’t work. The air conditioner went off with the temperature at 102 degrees.  As I pulled into a parking lot, I realized the windows were all locked. I tried to turn off the engine with no results. The gear shift knob was frozen.  My car has now been in the shop at Walnut Creek Ford for 41 days.",
        "vin": "1FMCU0DZXLU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/19/2021",
        "dateOfIncident": "04/07/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429813,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I was at a red light behind 4 cars, when as I look into the rearview mirror when I saw a white van coming at me at cruising speed.   As I turned the steering wheel to the left, purposely trying to avoid the vehicle in front of me, the white van slammed into me and caused me to hit my head on the steering wheel and the window.  I had my seat belt on, but I was hit so hard that the car frame was bent and I was hurt.  I was informed that the reason not one of my airbags went off in the front of my car was, I was hit in the rear.  If I would have let my car hit the car in front of me, I would have been protected by the airbags in the front.  This is a serious issue and this complaint is to request the NTSB look into requiring all vehicles to have sensors throught out the car to keep drivers and passangers should remain as steady",
        "vin": "1FMCU9H92LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/18/2021",
        "dateOfIncident": "08/18/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429608,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The Stop Safety Now light came on.  Car stopped in a traffic lane. I attempted restart without success.  I could also not get the transmission out of park while waiting for tow truck. I was then unable to restart the engine while the visual displays continued working.  After about 20 minutes everything powered down and I was then able to restart.  Very glad no traffic hit me.",
        "vin": "1FMCU0DZ4LU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/16/2021",
        "dateOfIncident": "07/29/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429336,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "In three occasions the automatic transmission has stopped working, operating under normal city driving conditions. Turning the car off and on again, it has worked properly. The car has less than 4000 miles. I took it to the Ford repair shop and there is a defect in the hybrid transmission, and it will take 4-6 weeks to be solved. Unbelievable such problems in a vehicle with such a few number of miles. Where is the quality control...",
        "vin": "1FMCU9DZXLU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/05/2021",
        "dateOfIncident": "07/19/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427957,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "After a few days of driving on rainy days, one day at mornging, my car stopped working and I couldn't start it anymore.   Various alerts about handbrake, brakes, “stopping the vehicle” and more were appearing. I called for assistance, and Ford send me a Truck crane.  They couldn't put the unit in neutral so they could move it to the lift (first problem).  When I took it to the Ford agency they checked it and after a week they accused me of putting my car in a big puddle. They told me that the hybrid battery connectors were wet. Why???  When he showed them to me, I realized that these orange connectors are positioned at the bottom of the vehicle, just 9 inches from the ground!  I explained that I had not entered any deep puddle, but this water was due to normal driving on rainy days, which splashes in a normal way from the tires and the vehicles on the sides. I said, my car should be able to drive on rain, as the rain is something natural and normal. My car is in diagnostic in the Ford agency.  They don’t want to pay warranty because they said rain is a natural phenomenon.  This means that with puddle of water as small as 3 inches, water can get into these connectors, get wet, damage the hybrid battery, the unit and possibly cause an accident. If one day You encountered a slight 9-inch flood, it would be a sure breakdown!    Ford should review why they put these connectors on the bottom of the unit, without protection against water, without a hermetic seal and with the risk of breaking down the system and the car completely.  Sorry, I am from Mexico, but this car is sell and produced in USA and I consider important to check this big mistake in security and in the design of the unity.",
        "vin": "1FMCU0BZ1LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/30/2021",
        "dateOfIncident": "07/28/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427172,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "After 2020 Ford Escape Titanium Hybrid did not start, it was towed to a Ford dealer. They diagnosed battery failure and put in a new one. When we drove away from the dealer, the car was disabled within one mile. They now say it wasn't the battery, it was the battery converter which I understand to be the equivalent to the alternator in non-hybrids. The vehicle is under new car warranty. My wife was fortunate she was in the right lane and could pull onto the shoulder with minimal steering control. Some alerts on Ford Plus app: \"Powertrain Malfunction/Reduced Power.\" Also \"Charge System Fault.\" And \"Malfunction Indicator Lamp -- Regulatory.\"",
        "vin": "1fmcu0dz3lu"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/28/2021",
        "dateOfIncident": "06/18/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426910,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Interior lights are not working. Took the car to the dealership under the manufacturer warranty and they are unable to solve the problem. The dealership replaced the body control module and this did not fix the problem. Service tech stated they need to contact Ford Engineering to resolve the problem.",
        "vin": "1FMCU0G68LU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/26/2021",
        "dateOfIncident": "07/25/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426551,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Yesterday, July 25, 2021, I had a really unnerving experience driving my 2020 Ford Escape Hybrid.  As I was about a half mile into my drive, a “Stop Safely Now” warning popped up, and the car slowed to about 15 MPH.  I pulled over on the side of the road and the vehicle simply stopped.  I couldn’t start it, and the engine and battery lights were red.  The start button was flashing green.  I sat there, with traffic passing by, unable to start the car or turn it off, as it appeared it was in accessory mode.  I called Astoria Ford and talked to Greg, but it was Sunday, so no service available.  I was fixing to have it towed and was prepared to wait an hour for the tow truck.  After 20 minutes, a message popped up that said the car was going into a “System off to save battery mode…”.  I was finally able to shut it off.  A couple minutes later, I was able to restart the car, and drove immediately to the Astoria Ford dealership.  The potential danger to this vehicle getting rear-ended seems great, and is a known issue with Ford now.  Since I’ve owned the vehicle (a few months now), the car, when driving slowly down a hill and coming to a stop, will lurch and shudder, which leads me to believe that there could be some electrical and/or power train problems.  It seems that there definitely should be a recall before something serious happens to those of us who own this vehicle.",
        "vin": "1FMCU0BZ3LU"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/19/2021",
        "dateOfIncident": "05/15/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425560,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Ford Escape. The contact stated while driving at 65-70 MPH, water started leaking from the air conditioner onto the brake and accelerator pedals and his foot. The vehicle was taken to the dealer who cleaned the air conditioner drain line however, the failure persisted. The contact stated the vehicle was taken back to the same dealer several times and the drain line was cleaned however, the failure reoccurred while driving. The contact stated his foot was wet from water leaking onto it, and it slipped off the brake pedal almost causing the vehicle to crash. The vehicle was taken back to the dealer and the drain line was replaced as a Ford service hotline recognition of the problem however, the failure persisted. The manufacturer was made aware of the failure and a case was opened. The approximate failure mileage 2,000.",
        "vin": "1FMCU0H6XLU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/10/2021",
        "dateOfIncident": "07/09/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424224,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "When at a stop light upon acceleration the car is very sluggish. I have noticed if I turn the air off there seems to be slightly more power. I feel the safety in this comes when a vehicle is moving excessively slow that it causes a potential threat to being involved in an accident.",
        "vin": "1FMCU9H63LU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/07/2021",
        "dateOfIncident": "09/07/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11423760,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Ford Escape. The contact stated that the hands-free rear tailgate had on several occasions erroneously opened and closed without the close button being pressed or the open sensors being activated. The contact indicated that while retrieving groceries from the vehicle with the tailgate door raised the door suddenly began to close and hit the contact in the head causing a minor laceration. No medical treatment was required. The vehicle was taken to the local dealer who was unable to duplicate the failure and no service was performed.  The manufacturer was made aware of the failures but no assistance was offered and referred the contact to NHTSA. The failure mileage was 1,000.",
        "vin": "1FMCU9J9XLU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/22/2021",
        "dateOfIncident": "06/20/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421933,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Car randomly stopped and the stop safely now message appeared. The car would not turn off. The dash was still illuminated. I held the car start button for several seconds and the car finally turned off and I was able to reset it. The transmission light and battery light came on. I have not had any issues sense.",
        "vin": "1FMCU9BZ0LU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/07/2021",
        "dateOfIncident": "05/05/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419963,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Titanium or SEL editions have a 10 speaker B&O stereo with a 6x9 ‘subwoofer’ located in the right rear cargo area.  The speaker hums/vibrates/shakes loudly through all volume levels - it is a KNOWN issue with Ford that the screws securing the speaker in to its mount are cheap and often come loose, casing loud vibrations.  Tightening them back up is time consuming and only a temporary fix",
        "vin": "1FMCU9J90LU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/03/2021",
        "dateOfIncident": "05/30/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11419448,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The rear liftgate, while open (and while I was loading/unloading items), will randomly close on its own. It does signal it is about to through very low volume beeps but it has done this some 20 times randomly in the last week. Several days ago it closed on my head, taking off a slice of skin on my scalp, knocking me down face forward onto/into the rear bumper, injuring my face/upper lip as well.  This is a known/documented issue on many vehicles via many Ford Escape forms, which suggest having the key fob in your pocket or on your person is the culprit and sends the car into a frenzy.",
        "vin": "1FMCU9J90LU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/03/2021",
        "dateOfIncident": "06/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419520,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 FORD Escape. The contact stated while using the liftgate, the liftgate failed to remain open. The liftgate inadvertently closed while loading and unloading the vehicle. The vehicle was taken to be diagnosed but, was not repaired repaired. The dealer was unable to duplicate the failure. The manufacturer was contacted and notified of the failure and informed the contact that the VIN was not under recall. The failure mileage was approximately 3,000.",
        "vin": "1FMCU9J94LU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/20/2021",
        "dateOfIncident": "05/15/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417938,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Ford Escape. The contact stated that the bracket that connects the driver’s side door to the body of the vehicle had fractured causing the driver’s side door to not close properly. The contact stated no warning light was illuminated. The vehicle was taken to the local dealer where it was diagnosed with needing the door bracket to be replaced. The vehicle was not repaired. The manufacturer was informed of failure and informed the contact that the VIN was not under recall. The failure mileage was approximately 16,655.",
        "vin": "1FMCU9J96LU"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "05/12/2021",
        "dateOfIncident": "05/08/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416359,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT SEATS IN THIS CAR HAVE BEEN REPAIRED ONCE BY THE FRONT DEALER. IT DID NOT WORK AND THREE CALLS TO ESCALATE TO FORD HEADQUARTERS HAVE NEVER BEEN RETURNED. THE SEAT IS SO UNCOMFORTABLE ( FEELS LIKE RIDING ON A BUCKBOARD) THAT AFTER A COUPLE HOUR TRIP, IT PINCHED A NERVE IN MY HIP AND MY SLOW RESPONSE TO APPLYING THE BRAKE ALMOST CAUSED AN ACCIDENT. THE EMERGENCY BRAKING SYSTEM TOOK OVER AND STOPPED MY CAR. I NOW HAVE SCIATICA BECAUSE OF THIS SEAT AND AM BEING TREATED FOR IT. IT HAS BEEN INTO THE DEALER AT LEAST FOUR TIMES AND EVEN THE SERVICE MANAGER TRIED THE SEAT AND AGREED THAT THERE IS A PROBLEM. HE HAS BEEN HELPFUL, BUT FORD IS BLOCKING ANY SOLUTION.",
        "vin": "1FMCU0DZXLU"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/11/2021",
        "dateOfIncident": "04/10/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416047,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "LIFT GATE RANDOMLY CLOSED HIT ME IN THE HEAD WHEN I AS IN THE BACK OF THE CAR.THELIFT GATE RANDOMLY OPENED WHEN I WALKED BEHIND THE CAR.",
        "vin": "1FMCU0DZ3LU"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/28/2021",
        "dateOfIncident": "04/28/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414262,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SEATS HAVE METAL PROTRUDING FROM THE REAR PORTION WHERE YOUR TAILBONE WOULD REST. IT'S NOT JUST UNCOMFORTABLE, IT BECOMES PAINFUL THE LONGER YOU DRIVE. I WAS TOLD THE SEAT HEATERS WERE IMPROPERLY INSTALLED IN THE BEGINNING OF THE MANUFACTURE PROCESS FOR 2020 FORD ESCAPES. IF THEY KNOW THEY INSTALLED THEM INCORRECTLY, WHY WON'T THEY FIX THEIR MISTAKE?",
        "vin": "1FMCU9J94LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/20/2021",
        "dateOfIncident": "04/18/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413069,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 FORD ESCAPE. THE CONTACT STATED THAT WHILE ATTEMPTING TO START THE VEHICLE, THE VEHICLE HESITATED BEFORE STARTING. THE CHECK ENGINE WARNING LIGHT ILLUMINATED. THERE WAS AN UNKNOWN SENSOR WARNING LIGHT SHOWING A MALFUNCTION HAD OCCURRED. THE CONTACT TOWED THE VEHICLE TO AUTONATION FORD VALENCIA (23920 CREEKSIDE RD, VALENCIA, CA 91355, (661) 382-4700) AND WAS INFORMED THAT THE ELECTRICAL WIRING WAS SOY BASED WHICH ATTRACTED RODENTS AND THAT THE WIRES HAD BEEN CHEWED THROUGH. THE CONTACT WAS INFORMED THAT THE WIRING NEEDED TO BE REPLACED. THE VEHICLE HAD NOT YET BEEN REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "1FMCU0G61LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/16/2021",
        "dateOfIncident": "03/31/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408430,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HANDS FREE LIFT GATE SOMETIME WORKS AND THEN OTHER TIMES IT WILL NOT. THE OTHER DAY AT THE CAR WASH THE TAILGATE WOULD RELEASE WHEN I WOULD WALK BEHIND THE VEHICLE WHILE WASHING IT. ALSO, THE LAST TIME I FILLED VEHICLE WITH GAS AND CLEANED THE REAR GLASS WITH WATER THE TAILGATE WOULD AUTOMATICALLY RELEASE",
        "vin": "1FMCU9J96LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/09/2021",
        "dateOfIncident": "05/20/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407250,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE ENTERED DEEP SLEEP MODE WITH LESS THAN 300 MILES AFTER VEHICLE HAD NOT BEEN STARTED FOR 2-3 DAYS. VEHICLE HAD TO BE TOWED TO DEALERSHIP FOR FULL 12V BATTERY RE-CHARGE.",
        "vin": "1FMCU9G69LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/06/2021",
        "dateOfIncident": "04/06/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406720,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR TRUNK FAILS TO OPEN UPON FIRST STARTUP OF CAR",
        "vin": "1FMCU9J91LU"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "04/06/2021",
        "dateOfIncident": "04/06/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406721,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR JERKS OFF TO THE SIDE OF THERE IS A TURN LANE, ALMOST PULLED STEERING WHEEL OUT OF MY HANDS. DOES THIS EVERY TIME I GO BY A TURN LANE AT ANY SPEED",
        "vin": "1FMCU9J91LU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "03/25/2021",
        "dateOfIncident": "03/12/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11404849,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2020 FORD ESCAPE. THE CONTACT STATED WHILE DRIVING 1-2MPH WHEN THE CONTACT DEPRESSED THE BRAKE PEDAL, THE VEHICLE DID NOT RESPOND AND CONTINUED TO MOVE FORWARD UNTIL VEHICLE CAME INTO CONTACT WITH STRUCTURE. THE CONTACT STATED ALL AIR BAGS DEPLOYED WITH THE EXCEPTION OF THE PASSENGER SIDE CURTAIN AIR BAG. 2 PERSONS WERE INJURED, AND WERE TAKEN TO RECEIVE MEDICAL TREATMENT. THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TOWED TO A TOW YARD WHERE IT WAS DIAGNOSED WITH BEING DESTROYED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT INFORMED OF FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 1,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/24/2021",
        "dateOfIncident": "02/11/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404655,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ON MY WAY HOME WHEN MY CAR NOTIFIED ME THAT MY TIRE PRESSURE HAD DROPPED TOO LOW. WITHIN 10 MINUTES IT WAS COMPLETELY OUT OF AIR. I WAS DRIVING IN TOWN AND DIDN'T DO ANYTHING THAT COULD HAVE CAUSED A PUNCTURE THIS BAD. I BELIEVE MY TIRE HAD THE SAME ISSUE DESCRIBED IN THE RECALL FOR THE CONTINENTAL TIRES ON OTHER ESCAPES. I'M TRYING TO AVOID HAVING THIS ISSUE AGAIN WITH ANY OF THE OTHER TIRES. THE MECHANIC SAID IT WAS A TEAR IN THE SIDE WALL AND WAS UNSURE WHAT WOULD HAVE CAUSED IT.",
        "vin": "1FMCU9BZ0LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/10/2021",
        "dateOfIncident": "03/10/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400230,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "DISPLAY IS OVERHEATING AND INOPERABLE",
        "vin": "1FMCU9H97LU"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "03/07/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399661,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BLIND SPOT WARNING SYSTEM WILL ACTIVATE WHEN THERE ARE NO CARS AROUND THE CAR. HAPPENS REGULARLY WHEN GOING STRAIGHT AT CONSISTENT SPEED, ACCELERATING, DRIVING AROUND A BEND; ANY AND ALL SITUATIONS. FALSE POSITIVES OCCUR DURING RAIN, DRY WEATHER, ALL LIGHTING CONDITIONS (NIGHT, EARLY MORNING, NOON, LATE AFTERNOON)",
        "vin": "1FMCU0DZ7LU"
    },
    {
        "components": "ELECTRICAL SYSTEM,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "03/06/2021",
        "dateOfIncident": "03/03/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399549,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE BLIND SPOT WARNING IDICATOR IN MIRROR COME ON  WHEN NO OTHER VEHICLE IS PRESENT. AT OTHER TIMES, INDICATOR DOES NOT COME ON AT ALL, EVEN IF A VEHICLE IS PRESENT IN THE BLIND SPOT. THIS IS A SAFETY ISSUE. INDICATOR CANNOT BE TRUSTED. MANY OWNERS REPORT THIS SAME PROBLEM ON FORUMS. FORD HAS NO SOLUTION.",
        "vin": "1FMCU0DZXLU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/14/2021",
        "dateOfIncident": "02/14/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396166,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AND ALL OF A SUDDEN MY 2020 FORD ESCAPE SE SPORT HYBRID FLASHED 'STOP SAFELY NOW' AND MY CAR ESSENTIALLY DIED ON ME. FORTUNATELY, I ONLY APPROACHING A GATE AT ABOUT 20MPH TO EXIT A PARKING LOT SO I WASN'T GOING FAST. HOWEVER, I COULD T RESTART THE CAR OR MOVE IT FOR A FEW MINUTES. AS SUCH, I HAD TO LEAVE THE CAR IN THE MIDDLE OF THE LANE UNTIL IT WOULD FINALLY START. IT HAS ONLY 6400 MILES ON IT. THIS HAS NOT HAPPENED BEFORE, BUT FROM READING OTHER FORUMS IT SEEMS TO BE SOMEWHAT PREVALENT.",
        "vin": "1FMCU0BZXLU"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "02/10/2021",
        "dateOfIncident": "02/06/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395529,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER'S SEAT IS EXTREMELY UNCOMFORTABLE. THERE IS A LUMP OR BULGE IN THE BACK PART OF THE BOTTOM CUSHION THAT HITS YOUR TAILBONE.",
        "vin": "1FMCU9J96LU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/01/2021",
        "dateOfIncident": "11/20/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11390957,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TAILGATE LOWERS WITHOUT DRIVER ACTION.  WHILE UNLOADING REAR AREA TAILGATE LOWERED ON HEAD",
        "vin": "1FMCU0DZ6LU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/22/2021",
        "dateOfIncident": "01/22/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389456,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR PRE-COLLISION LIGHT KEEPS COMING ON FOR NO REASON.  NORTHGATE FORD WON'T DEACTIVATE IT FOR ME.  IT GOES OFF RANDOMLY AND IT'S A MAJOR SAFETY ISSUE SINCE I COULD WRECK MY ESCAPE.  THE WHOLE DASHBOARD LIGHTS UP IN AN ORANGE COLOR AND IT DINGS REPEATEDLY.",
        "vin": "1FMCU0G68LU"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/19/2021",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11388835,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SPRINGS OR BAR AT THE BACK OF THE BOTTOM SEAT OF THE DRIVERS SEAT IS POKING UP AND I HAVE TO ADJUST CONSTANTLY WHILE DRIVING AS IT HURTS. VERY UNSAFE TO HAVE TO CONSTANTLY CHANGE POSITIONS TO TRY AND NOT HURT. A PICTURE WILL NOT SHOW WHAT  IS HAPPENING WHEN THE SEAT IS SAT ON.",
        "vin": "1FNCU0G63LU"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/14/2021",
        "dateOfIncident": "01/11/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388209,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "PANORAMIC VISTA ROOF PANEL IMPROPERLY ALIGNED FROM FACTORY WHICH ALLOWED RAIN WATER TO FLOW TO INTERIOR AND DAMAGE HEADLINER / WET ELECTRONICS OF VEHICLE DUE TO FRONT EDGE OF THE SLIDING GLASS PANEL NOT FULLY CONTACTING THE MARGIN SEAL.",
        "vin": "1FMCU9BZ4LU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/13/2021",
        "dateOfIncident": "11/20/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387821,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I I WAS DRIVING DOWN ROAD  SPEED LIMIT 55. , NO OTHER CARS IN SIGHT, AND MY PANORAMIC SUNROOF JUST SHATTERED .",
        "vin": "1FMCU0H69LU"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "01/08/2021",
        "dateOfIncident": "09/02/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387225,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEP 02, 2020 I WAS SOLD A-2020 FORD  ESCAPE BY BOLIVAR FORD ,BOLIVAR, TN 38008.I WAS NOT TOLD BY THE SALESMAN THAT THE CAR HAD A OPEN SAFETY RECALL AND SHOULD NOT HAVE BEEN SOLD TO ME UNTIL THE RECALL WAS FIX. WHEN I TEST DROVE THE CAR I NOTICE THE CAMERA WOULD WORK SOME TIME AND OTHER TIME IT WOULD NOT. I HAVE RECEIVED A RECALL LETTER FROM FORD BUT THEY SAID THAT THE PARTS WERE NOT AVAILABLE TO FIX THE CAMERA .IT IS VERY UNSAFE WHEN BACKING UP WHEN THE BACKUP CAMERA IS NOT WORKING.",
        "vin": "1FMCU0H60LU"
    },
    {
        "components": "AIR BAGS,STRUCTURE,WHEELS",
        "crash": true,
        "dateComplaintFiled": "01/07/2021",
        "dateOfIncident": "12/26/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 4,
        "odiNumber": 11386920,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "12/26/2020 HEAD-ON COLLISION, MOST IMPACT TO PASSENGER FRONT SIDE - PASSENGER SIDE AIRBAGS DID NOT DEPLOY, DRIVERS SIDE AIRBAGS DID DEPLOYED - INJURIES SUSTAINED BY PASSENGER AND DRIVER. ACCIDENT OCCURRED ON CITY STREET (50 MPH ZONE).*DT*DT*DT*DT*DT",
        "vin": "1FMCU9H69LU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/05/2021",
        "dateOfIncident": "01/04/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386629,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE HAS BEEN IN THE SHOP (NORTHGATE FORD) SO MANY TIMES AND THEY SAID THAT THERE'S NOTHING WRONG.  THE SERVICE MANAGER WENT OUT WITH US AND SAW IT WASN'T WORKING PROPERLY.  MY CAR ISN'T SAFE TO DRIVE AS THE LANE KEEPING SYSTEM TRIED TAKING ME OFF THE ROAD SO MANY TIMES. THE DEALERSHIP WANTS ME TO TRADE MY CAR IN AND I SAID ABSOLUTELY NOT.  I DON'T WANT ANYONE KILLED BECAUSE OF THE PROBLEMS WITH THIS VEHICLE.",
        "vin": "1FMCU0G68LU"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "01/01/2021",
        "dateOfIncident": "12/29/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385973,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE CRUISE IS ENGAGED WHEN DRIVING DOWN THE HIGHWAY, IT WILL RANDOMLY GET \"CANCELLED\" AND THEN WILL REENGAGE RANDOMLY. THIS OCCURRED 4 TIMES IN A 5 MINUTE PERIOD EVEN WHEN THERE IS NO TRAFFIC AROUND.",
        "vin": "1FMCU9J94LU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/29/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385413,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR JERKS WHEN CHANGING GEARS.",
        "vin": "1FMCU0H68LU"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/20/2020",
        "dateOfIncident": "12/19/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384262,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY ESCAPE CROSS TRAFFIC ALERT SYSTEM ONLY WORKS HALF THE TIME AND YESTERDAY IT DIDN'T WORK AT ALL.  IT'S BEEN AT NORTHGATE FORD SO MANY TIMES FOR THIS PROBLEM BUT IT'S STILL NOT FIXED.",
        "vin": "1FMCU0G68LU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/18/2020",
        "dateOfIncident": "12/18/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384105,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY PRE-COLLISION LIGHT KEEPS COMING ON RANDOMLY.  MY DASHBOARD LIGHTS UP AND CHIMES FOR NO REASON.  NORTHGATE FORD SAID MY ESCAPE IS WORKING FINE.",
        "vin": "1FMCU0G68LU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/16/2020",
        "dateOfIncident": "12/04/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383605,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I'M DRIVING ON THE EXPRESSWAY, I'M GETTING A RED LIGHT THAT A PICTURE SHOWS UP WITH ALL OF MY DOORS OPEN.  I HAVE TAKEN MY VEHICLE TO NORTGATE FORD IN CINCINNATI BUT IT DIDN'T HAPPEN TO THEM.  MY ESCAPE IS UNDER FULL WARRANTY AND THEY WON'T FIX IT.  IT HAPPENS ALL THE TIME WITH EVEN MY HUSBAND DRIVING MY ESCAPE.  THE DEALERSHIP WANTS ME TO TAKE A PICTURE OF IT BUT THAT'S IMPOSSIBLE TO DO WHEN I'M DRIVING.",
        "vin": "1FMCU0G68LU"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/16/2020",
        "dateOfIncident": "12/04/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383611,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED A 2020 FORD ESCAPE ON 10-31-2020. ON 11-23-20-11-24-20 I GOT MESSAGES ABOUT THE TRANSMISSION AND MY WIFE COULDN'T PUT THE CAR IN REVERSE AFTER GOING TO THE STORE. TOOK THE CAR TO THE DEALER THEY DIDN'T EVEN CHECK THE TRANSMISSION ONLY THE ENGINE AND COMPUTER SYSTEM. ENDED UP BACK IN THERE THE SAME DAY 5 TIMES BECAUSE THE ANTI CRASH AND BRAKE SYSTEMS WASN'T WORKING. THE SERVICE TECH THEN DROVE IT AROUND THE CORNER 5 DIFFERENT TIMES TO GET THE COMPUTER SYSTEM TO KICK IN. EIGHT DAYS LATER 12-4-20 I GET STUCK IN MY FRIENDS DRIVEWAY. THE CAR WOULDN'T GO IN REVERSE. FINALLY IT DID AFTER 20 MINUTES. I TAKE THE CAR BACK AND IT NEEDS A NEW TRANSMISSION. THE COMPUTER SYSTEM AND POWER TRAIN, CRASH ASSISTANCE, ANTI COLLISION SYSTEM WASN'T WORKING EITHER. THEY HAD JUST RECEIVED THE VEHICLE ON 10-27-20. THE CAR WAS PICKED OUT FOR ME BY THE SALES REP AND IT WASN'T FROM OFF THE LOT IT WAS IN THE BACK. I TRULY BELIEVE THEY KNEW THE WHOLE CAR WAS BAD. THEY'VE HAD MY CAR SINCE THE 12-4-20 AND I'M STILL RESPONSIBLE FOR IT AND THE LOANER CAR. THE SALES MANAGER AND GENERAL MANAGER TOLD ME I'LL HAVE TO SUE THEM USING THE LEMON LAW OF ANYTHING ELSE GOES WRONG. IT WILL AND THEY KNOW IT. I HAVE SEVERAL REPORTS THAT THE TRANSMISSIONS ON THE 2020 ESCAPE IS ONE OF THE MAIN ISSUES. I ALSO HAVE ALL THE REPORTS SENT TO MY PHONE FROM FORD PASS. I ALSO HAVE A VEHICLE HISTORY REPORT THAT THE BRAKES, POWER TRAIN SYSTEM, AND RESTRAINTS AND DRIVER ASSISTANCE NEEDS REPAIRED ALSO. THIS OCCURRED IN JACKSONVILLE, FLORIDA. ALL THESE ISSUES MAKE THIS VEHICLE UNSAFE FOR ANYONE.",
        "vin": "1FMCU0F6XLU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/15/2020",
        "dateOfIncident": "12/15/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11382699,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 FORD ESCAPE CONSUMER WRITES IN REGARDS TO VIBRATIONS AND A LOUD NOISE WHILE DRIVING. *LD *JS *JS    THE CONSUMER STATED THE DEALER SET THE VEHICLE TO SPORT MODE (SSM 49151) BUT, THE VIBRATION PERSISTED. THE CONSUMER STATED THE DEALER ADVISED THE VEHICLE WAS OPERATING AS DESIGNED. *JS",
        "vin": "1FMCU0H69LU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/29/2020",
        "dateOfIncident": "11/28/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376932,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER PULLING OUT OF A PARKING LOT AND ONTO THE STREET, THE FORD  ESCAPE LOST DRIVE POWER AND COULD NOT REACH LEGAL SPEED.  STOPPED AND PUT ON FLASHERS.  THE INSTRUMENT PANEL SHOWED A \"STOP SLOWLY NOW\" MESSAGE PLUS SEVERAL MALFUNCTION LIGHTS WERE ON.  COULD NOT PUT THE CAR IN PARK OR NEUTRAL AND COULD NOT RESTART THE DRIVETRAIN.  LATER EVEN THE INSTRUMENT PANEL WENT BLANK.  ABOUT 1 HR LATER, WAS ABLE TO RESTART THE CAR AND PULL OFF THE STREET AND WAITED FOR A TOW TRUCK TO TAKE THE CAR TO THE DEALER.  DEALER HAS NOT LOOKED AT THE CAR YET, BUT THIS IS APPARENTLY RELATED TO FORD'S CUSTOMER SATISFACTION PROGRAM 20B14.",
        "vin": "1FMCU0BZ2LU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/20/2020",
        "dateOfIncident": "11/05/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375595,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 FORD ESCAPE. THE CONTACT STATED WHILE DRIVING 65 MPH, THERE WAS AN ABNORMAL CLUNKING SOUND COMING FROM UNDERNEATH THE VEHICLE. THE CONTACT STATED THAT THE RPM FELL AND THE VEHICLE INDEPENDENTLY DECELERATED. THE CONTACT DEPRESSED THE ACCELERATOR PEDAL AND THE SPEED INCREASED ABRUPTLY HOWEVER, THE FAILURE RECURRED. THE CONTACT STATED THAT THE VEHICLE WAS PARKED FOR SEVERAL HOURS AND WHEN RESTARTED, THE VEHICLE OPERATED AS DESIGNED. THE VEHICLE WAS TAKEN TO HERITAGE FORD (2100 SISK RD, MODESTO, CA 95350; (844) 362-2226) HOWEVER, THE MECHANIC WAS UNABLE TO DUPLICATE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND A CASE WAS FILED. THE APPROXIMATE FAILURE MILEAGE WAS 2,703.",
        "vin": "1FMCU9H94LU"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/13/2020",
        "dateOfIncident": "11/13/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374409,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "CLICKING NOISE ON OUT SIDE OF CAR GOING 50 MPH",
        "vin": "1FMCU9G6XLU"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/10/2020",
        "dateOfIncident": "09/05/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373989,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT RENTED A 2020 FORD ESCAPE FROM HERTZ RENTAL CAR. THE CONTACT STATED WHILE TAKING OFF FROM A TRAFFIC LIGHT, THE VEHICLE HESITATED WITHOUT WARNING. THE CONTACT STATED THE TURN SIGNAL INDICATORS WERE INOPERABLE. ADDITIONALLY, THE REAR BACK OVER PREVENTION CAMERA WAS OFF CENTERED. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. A DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS NOT INFORMED OF FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "1FMCU9H60LU"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "11/09/2020",
        "dateOfIncident": "09/28/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373893,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LANE KEEPING SYSTEM MADE ME BEER TO THE LEFT THREE DIFFERENT TIMES WHEN THERE WAS NO LANE NEXT TO ME.  ONE OF THOSE TIMES IT TRIED TAKING ME IN A WALL.  WHEN THIS HAPPENED ALL THREE TIMES, THE STEERING WAS HARD TO CONTROL.  MY CAR WAS IN MOTION.  IT HAPPENED TWICE ON A COUNTY COUNTRY ROAD AND ON THE EXPRESSWAY GOING INSIDE A TUNNEL.",
        "vin": "1FMCU0G68LU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/03/2020",
        "dateOfIncident": "10/31/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372906,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING ON STRRET WHEN CAR STARTED DECELERATING FOR NO REASON. I PUSHED ON GAS PEDAL BUT CAR SLOWED TO A STOP IN MIDDLE OF TRAFFIC. EVERYTHING RUNNING BUT GAS PEDAL NOT RESPONDING. HAD TO TURN CAR ON/OFF FOR SEVERAL MINUTES BEFORE CAR WOULD ACCELERATE AGAIN.",
        "vin": "1FMCU9BZXLU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/29/2020",
        "dateOfIncident": "04/21/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11367087,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR VIEW CAMERA DOES NOT WORK HALF THE TIME.",
        "vin": "1FMCU9G67LU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/28/2020",
        "dateOfIncident": "10/09/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366778,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RUBBER /PLASTIC AROUND THE WINDSCREEN HAS RELEASE FROM THE GLASS.",
        "vin": "1FMCU9H69LU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/28/2020",
        "dateOfIncident": "10/04/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366951,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO, MY NAME IS [XXX]. I RECENTLY PURCHASED A NEW VEHICLE, A 2020 FORD ESCAPE SEL, AND I HAVE BEEN TELLING MY CAR DEALERSHIPS ABOUT MY BACKUP CAMERA HOW IT JUST GOES ENTIRELY BLACK, AND IT SAID THAT THE CAMERA IS UNABLE TO WORK. I HAVE EXPRESSED MY CAR DEALERSHIPS ABOUT IT. THEY KEEP SAYING THAT WE DON'T HAVE THE PART YET, AND I AM EXHAUSTED FROM TELLING THEM, AND I ALWAYS USE MY BACKUP CAMERA TO PARK MY CAR BACK, AND I NEED YOU GUYS TO DO SOMETHING ABOUT IT. I JUST PURCHASE A NEW VEHICLE.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1FMCU9H67LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/27/2020",
        "dateOfIncident": "10/26/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366588,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST BOUGHT THE CAR 2 WEEKS AGO AND HAVE BARELY BEEN DRIVING IT. 10/26 7AM BACK UP CAMERA WORKED FINE AND AT 630 PM WHILE BACKING UP-- IT NOW HAS UNVIEWABLE LINES THROUGH THE WHOLE SCREEN.  IT LOOKS LIKE MY SCREEN IS CORRUPT OR THE BACK UP CAMERA IS BAD.",
        "vin": "1FMCU9J9XLU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/26/2020",
        "dateOfIncident": "10/25/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366475,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING FOR LYFT IN FLAGSTAFF ARIZONA A PASSENGER OPEN UP THE RIGHT REAR DOOR A   GUST OF WIND PUSHING THE DOOR FURTHER OPEN THEN IT SHOULD HAVE CAUSING THE DOOR TO BEND",
        "vin": "1FMCU0BZ5LU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/24/2020",
        "dateOfIncident": "09/22/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366172,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SHOWED ERROR OF 'STOP SAFELY NOW' AND THE GAS ENGINE TURNED OFF AND WOULD NOT TURN BACK ON. THIS IS A AWD HYBRID ESCAPE, WAS STRANDED ON SIDE OF ROAD FOR 15+ MINUTES. AFTER TURNING OFF AND ON MULTIPLE TIMES THE CAR FINALLY WAS ABLE TO SHIFT INTO DRIVE FROM PARK, GAS ENGINE DID THEN TURN ON.    DEALER HAS NO CLUE WHAT HAPPEN, DID A 'MASTER RESET' AND SAID IT'S FIXED. THIS IS AN UNSAFE VEHICLE.",
        "vin": "1FMCU9BZ0LU"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/23/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365881,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE LIGHT IN MY 2020 FORD ESCAPE KEEPS COMING ON.  I TOOK IT TO ADAMSON, NOW STIVERSON DEALERSHIP, A PART WAS INSTALLED ON THE SECOND VISIT.  TWO DAYS LATER, THE ENGINE LIGHT CAME ON AGAIN.  I WAITED ONE WEEK UNTIL I COULD GET AN APPOINTMENT TO RETURN TO THE DEALERSHIP ON OCTOBER 22, 2020.  AFTER WAITING ALL DAY, I CALLED THE DEALERSHIP AND WAS TOLD THEY HAD NOT HAD A CHANCE LOOK AT THE VEHICLE. I RETURNED TO THE DEALERSHIP ON OCTOBER 23, 2020 TO HAVE THE DEALERSHIP DETERMINE THE PROBLEM. THE CAR HAS HARD TRANSITIONS IN ACCELERATIONS AT TIMES AND THE ENGINE LIGHT IS ON SIGNALING A PROBLEM THAT HAS NOT BEEN REPAIRED.  I HAVE A WARRANTY ON MY CAR.  I AM PAYING MY NOTES AND WARRANTY BUT THE ISSUE WITH MY \"NEW\" CAR IS NOT RESOLVED.",
        "vin": "1FMCU0G68LU"
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/14/2020",
        "dateOfIncident": "10/13/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364301,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TOP OF DASH BOARD IN ITS ENTIRETY BUT SPECIFICALLY THE TRIM PIECE AROUND THE HEADS-UP DISPLAY ON SPECIFIC TRIM/MODES CREATES A REFLECTION UPON THE WINDSHIELD, PARTICULARLY DIRECTLY IN THE DRIVERS MAIN SIGHT LINE, WITH SUCH LOW OPACITY IT MAKES DRIVING VISIBILITY DIFFICULT. ADDITIONALLY THE TRIM PIECE IS SMOOTH PLASTIC, WHEREAS THE DASH ITSELF IS TEXTURED. THIS OCCURS PRIMARILY DURING THE DAY DURING ANY LIGHTING CONDITION OUTSIDE AND IS INCREASED WITH DIRECT SUNSHINE UPON THE VEHICLE.",
        "vin": "1FMCU9DZ9LU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/02/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362345,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "SAFETY RECALL ANNOUNCED ON 2020 FORD ESCAPE. SELECTIVE,  MY INSURANCE COMPANY, AND MANRY-RAWLS LLC, MY AGENCY SENT ME AN EMAIL.",
        "vin": "1FMCU0G61LU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/23/2020",
        "dateOfIncident": "09/03/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360652,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "SWITCH THAT OPERATES SIDE REAR VIEW MIRRORS IS BROKEN",
        "vin": "1FMCU0G63LU"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/02/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352774,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH FRONT HEAD LIGHT (SEALED) ASSEMBLIES HAVE SOME SORT OF FILM DELAMINATING INSIDE EACH ASSEMBLY.",
        "vin": "1FMCU0G62LU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/28/2020",
        "dateOfIncident": "08/28/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351755,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAND NEW 2020 FORD ESCAPE HYBRID CAR INTERMITTENTLY STOPS AND CEASES. SEEMS SOMETHING WRONG WITH ELECTRICAL SYSTEM. THIS HAPPENED WHILE DRIVING 10 MPH DOWN RESIDENTIAL STREET.  CAR IS INACCESSIBLE AND CANT EVEN GET INTO NEUTRAL. TRIED DISENGAGING ELECTRICAL BATTERY. HAD TO LET SIT FOR 15+ MINS AND CAR SEEMS TO REBOOT ITSELF.  THEN YOU CAN START AND PUT INTO DRIVE/REVERSE ETC BUT ACCELERATION DOES NOT WORK AND ONLY IDLES. THIS IS 2ND TIME HAPPENING. FIRST TIME, WE LET IT SIT FOR 30 MORE MINS AND SEEMS IT ELECTRICALLY REBOOTED ITSELF AND CAR WORKED.  WAS ABLE TO DRIVE TO DEALERSHIP. THEY HAD IT 1 WEEK AND SAID ITS FINE NO COMPUTER ISSUES.  [XXX].  (8/19/20).  NOW, 8/28/2020 THIS HAPPENED AGAIN. THIS VEHICLE IS NOT SAFE AND WILL BE LOOKING FOR A REPLACEMENT VEHICLE. WE HAD A 2012 ESCAPE THAT DUE TO A MANUFACTURING DEFECT CAUGHT ON FIRE ON HIGHWAY IN 2014.  FORD IS NOT PUTTING OUT SAFE PRODUCTS AND NEED TO BE INVESTIGATED FOR THESE FAULTS AS THESE ARE SERIOUS ENDANGERMENT TO THEIR CUSTOMERS LIVES.  PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "1FMCU9BZ5LU"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/25/2020",
        "dateOfIncident": "07/31/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351091,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SHIFTS VERY HARD WHEN NORMALLY DRIVING AND WHEN AUTO START AND STOP FEATURE FUNCTIONS. THE TRANSMISSION DOES NOT KNOW WHAT GEAR IT WANTS TO STAY IN, OFTEN TIMES JERKING VERY HARD, WHICH MOVES THE ENTIRE CAR AT A COMPLETE STOP OR TOSSES THE DRIVER IN THEIR SEAT WHEN MOVING AND SHIFTING. THE VEHICLE ALSO STALLED SEVERAL TIMES, LOOSING THROTTLE AND FUNCTION, ALMOST CAUSING ME TO GET T-BONED BY 2 SEPARATE CARS IN TRAFFIC. OVERALL, THE VEHICLE HAS ISSUES WITH TRANSMISSION SHIFTS, ENGINE REALIZABILITY, AND GENERAL SAFETY FEATURES AS A WHOLE. SOMEONE CAN AND WILL GET SERIOUSLY INJURED IF THIS IS NOT INVESTIGATED AND ADDRESSED. VEHICLE HAS BEEN TAKEN INTO THE DEALER WHO CAN'T FIX THE ISSUE, DESPITE IT HAPPENING SEVERAL TIMES, AND HAS INSISTED THE CUSTOMER DRIVE THE MALFUNCTIONING VEHICLE. FORD MOTOR COMPANY WAS NOTIFIED ABOUT THE COMPLAINT AND IS PROCESSING A BUY BACK ON MY PERSONAL VEHICLE. I JUST DON'T WANT OTHERS TO GET HURT.",
        "vin": "1FMCU9G61LU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/18/2020",
        "dateOfIncident": "06/18/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350126,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE ROLLS BACKWARDS ON INCLINE WHILE IN DRIVE. AFTER COMING TO A COMPLETE STOP THEN REMOVING FOOT TO PUT ON GAS THE VEHICLE ROLLS BACK AS IF IT WERE IN NEUTRAL. WE ALMOST ROLLED BACK INTO A LADY THAT WAS PUSHING A STROLLER. FORD SAYS THEY HAVE NO REPAIR FOR THIS PROBLEM. I CAN PROVIDE VIDEO.",
        "vin": "1FMCU0DZ6LU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/17/2020",
        "dateOfIncident": "07/07/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349817,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE FREEWAY, VEHICLES LANE KEEP ASSIST DETECTED THAT I WAS OUT OF MY LANE AND STEERED ME ONTO THE SHOULDER. I WAS CRUISING IN THE FAR RIGHT LANE AT ABOUT 75MPH WHEN THE LANE KEEP SWERVED ME ABRUPTLY ONTO THE SHOULDER AND I HAD TO RECOVER AGAINST THE SYSTEM.",
        "vin": "1FMCU9G6XLU"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/17/2020",
        "dateOfIncident": "08/07/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349816,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "UNDER UNKNOWN CIRCUMSTANCES WHEN ATTEMPTING TO ACCELERATE THE CAR EXPERIENCES SIGNIFICANT LAG WHICH PUTS ME AT RISK OF COLLISION. I ATTEMPTED TO ASSOCIATE IT WITH THE AIR CONDITIONING BUT IT DOES NOT SEEM TO BE ASSOCIATED WITH ANY SYSTEM. VEHICLE SEEMS TO LOST HALF THE POWER AND I AM UNABLE TO SAFELY MOVE INTO TRAFFIC.",
        "vin": "1FMCU9G6XLU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/17/2020",
        "dateOfIncident": "08/17/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349813,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN SHIFTING FROM PARK TO REVERSE, REAR CAMERA DISPLAYS A DARK SCREEN WITH WAVES LIKE A BROKEN TV SCREEN. THIS HAPPENS AT LEAST ONCE A WEEK AND IS NOT CORRECTED BY SHIFTING BACK AND FORTH FROM PARK TO REVERSE. OCCURS WHEN STATIONARY SHIFTING TO REVERSE.",
        "vin": "1FMCU9G6XLU"
    },
    {
        "components": "WHEELS,SERVICE BRAKES,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/09/2020",
        "dateOfIncident": "08/03/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11344126,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR CAMERA GOES BLACK WITH SQUIGGLY LINES WHEN PUTTING CAR IN REVERSE.  THE CAR HAS LESS THAN 2000 MILES. THE DEALERSHIP STATES FORD IS AWARE OF THE ISSUE AND THERE IS A HUGE BACK ORDER ON GETTING A REPLACEMENT.  NOW I HAVE A WHIRLING SOUND WHEN SPEED IS BETWEEN 25 MPH - 39 MPH.  ONCE YOU LET UP ON ACCELERATION IT STOPS OR ONCE THE SPEED HAS GONE BEYOND 39 MPH.  WHILE DRIVING ON GROVES HIGHWAYS YOU CAN FEEL BACKEND OF THE CAR MOVING AROUND.  I HAD THIS ISSUE WITH A FUSION AND HAD TO REPLACE THE TIRES WITH A DIFFERENT BRAND DUE TO NO CONTROL OF THE VEHICLE IN THE WINTER.  MY 2017 ESCAPE DOES NOT DO THIS.  ALSO, THE DRIVERS SIDE TRIM DOES NOT FIT SNUG, AND HAS TO BE REPLACED AND THE DEALERSHIP SAID FORD IS AWARE OF THIS ISSUE AS WELL.  LASTLY, THE BRAKES MAKE A LOUD SQUEALING NOICE WITH A HEAVY MORNING DEW OR WHEN RAINING.",
        "vin": "1FMCU9H60LU"
    },
    {
        "components": "SEATS,UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/01/2020",
        "dateOfIncident": "07/03/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342696,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR VIEW/BACKUP CAMERA HAS NOT WORKED SINCE THE DAY WE DROVE IT HOME.  IT WILL WORK INTERMITTENTLY BUT MOST OF THE TIME IT SHOWS WAVY LINES ACROSS THE SCREEN.  OCCASIONALLY AFTER SHIFTING FROM REVERSE TO DRIVE, THE CAMERA WILL START WORKING BUT THE REAR VIEW PICTURE WILL REMAIN ON THE SCREEN EVEN WHILE IN DRIVE!  THERE IS ALSO A STRANGE HUMP IN THE DASH ON THE PASSENGER SIDE AS  IF SOMETHING IS PUSHING UP FROM UNDERNEATH.  THE DEALER WAS CONTACTED THE DAY AFTER PURCHASE AND WE WERE TOLD TO BRING THE VEHICLE BACK FOR INSPECTION.  NOW WE ARE TOLD THAT PARTS ARE NOT AVAILABLE AND THEY DON'T KNOW WHEN THEY WILL BE.  FORD HAS BEEN CONTACTED AND WE ARE GETTING NO HELP FROM THEM EITHER.  WE HAVE A BRAND NEW, EXPENSIVE, DEFECTIVE, AND POTENTIALLY DANGEROUS VEHICLE.  IT ALSO HAS THE STRANGE LUMP IN THE DRIVER'S SEAT THAT OTHERS HAVE MENTIONED.",
        "vin": "1FMCU9J94LU"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL,FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "07/31/2020",
        "dateOfIncident": "07/10/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11342512,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 FORD ESCAPE. THE CONTACT STATED THAT WHILE STOPPED AND PRESSING THE BRAKE PEDAL, THE VEHICLE SUDDENLY EXPERIENCED UNINTENDED ACCELERATION AND CRASHED INTO A CONCRETE PILLAR. DURING THE CRASH FRONT END WAS SEVERELY DAMAGED BUT THE AIRBAG DID NOT DEPLOY. ALSO THE COLLISION ASSISTANCE SAFETY FEATURE DID NOT ACTIVATE TO AVOID THE CRASH. DURING THE INCIDENT THE DRIVER SUSTAINED AN INJURED CHEST WHICH DID NOT REQUIRE MEDICAL TREATMENT. NO POLICE REPORT WAS TAKEN. THE VEHICLE WAS NOT TOWED. THE LOCAL DEALER ROYAL OAK FORD LOCATED AT 27550 WOODWARD AVE, ROYAL OAK, MI 48067. AND THE MANUFACTURER WERE NOTIFIED OF THE FAILURE. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE FAILURE MILEAGE WAS 2,000.",
        "vin": "1FMCU9H62LU"
    },
    {
        "components": "STEERING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/30/2020",
        "dateOfIncident": "07/03/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342347,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE 1.5L ENGINE WHEN YOU ARE ACCELERATING IN THE NORMAL DRIVING MODE YOU EXPERIENCE A VIBRATION IN THE STEERING WHEEL SIMILAR TO A FLAT TIRE. THE 2.0L ENGINE WITH THE SAME TRANSMISSION DOES NOT EXPERIENCE THE SAME PROBLEM.",
        "vin": "1FMCU0H64LU"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/26/2020",
        "dateOfIncident": "07/14/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341486,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR SAFETY CAMERA DOES NOT WORK GET WAVY LINES SIMILAR TO A BAD TV PICTURE.PROBLEM  IS BY SOME REPORTS DUE TO HOT WEATHER (+ 70 FARENHEIGHT) THIS IS BS I HAVE HAD 3 OTHER VEHICLES SAME LOCATION SAME WEATHER NO PROBLEMS. RUNING AC DOES NOT SOLVE PROBLEM.WENT TO DEALER TECH FOUND LOOSE CONNECTION.BUT PROBLEM  CONTINUES THIS IS A DEFINITE SAFETY FAILURE THAT IS NOT FIXED BY FORD.PROBLEM OCCURS WHEN MOVED TO REVERSE FROM PARK .HASOCCURED EVERY DAY SINCE DELIVERY",
        "vin": "1FMCU9H98LU"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/22/2020",
        "dateOfIncident": "06/22/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341020,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I PUT THE VEHICLE IN 'PARK' ON A FLAT SURFACE, THE E-BRAKE TURNS ON AUTOMATICALLY, BUT WHEN I PARK ON A SLIGHT INCLINE, THIS DOES NOT HAPPEN. ADDITIONALLY, WHEN STOPPED AT LIGHTS, I NOTICED THAT THE VEHICLE WAS NO LONGER TURNING THE ENGINE OFF WHEN AT A COMPLETE STOP. WHEN I GOT HOME, I WENT THROUGH SOME OF THE SCREENS AND IT TOLD ME THAT THE AUTO START/STOP WAS DISABLED DUE TO BEING ON A SLOPE (BUT I WAS ON A FLAT SURFACE). ADDITIONALLY, THE WINDSHIELD WIPER FLUID IS NOT COMING OUT OF THE LINES, BUT THE PUMP IS WORKING BECAUSE I CAN HEAR IT, POSSIBLE CLOGGED LINES. LASTLY, INFOTAINMENT SYSTEM IS NOT WORKING CONSISTENTLY WITH APPLE CARPLAY ' SOMETIMES IT WORKS, SOMETIMES IT DOESN'T, USUALLY RANDOM.",
        "vin": "1FMCU0G6XLU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/19/2020",
        "dateOfIncident": "07/02/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340254,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BACK-UP CAMERA ERRATIC, BLIND-SPOT INDICATOR ON PASSENGER SIDE MIRROR ERRATIC, LIFT-GATE OPENS SOMETIMES JUST BY WALKING BEHIND VEHICLE OR WILL COME DOWN ON ITS OWN WHEN OPEN.  ONCE, THE SYNC 3 SCREEN WAS EXTREMELY HOT TO THE TOUCH AND THE CONTROLS WERE FROZEN.  THIS HAPPENED AFTER START-UP AND THE SCREEN TOOK A LONG TIME TO BOOT UP.  OUR LOCAL FORD SERVICE DEPARTMENT IS AWARE OF THESE PROBLEMS (AND ACTUALLY SAW THE BACK-UP CAMERA GO SPASTIC).  APPARENTLY, FORD IS AWARE OF THE CAMERA PROBLEM, BUT THE REPLACEMENT CAMERAS GIVE THE SAME PROBLEM.",
        "vin": "1FMCU9J95LU"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/15/2020",
        "dateOfIncident": "07/15/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339508,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRICAL IN THIS CAR HAS BEEN NOTHING BUT TROUBLE. I BOUGHT THE CAR WITH 2000 MILES ON IT AND I'VE HAD IT ABOUT A MONTH AND I'VE HAD 4 ISSUES WITH IT. THE FIRST ISSUES THE CRUISE CONTROL EPULD NOT WORK. I BROUGHT IT IN AND THEY FIXED IT. MY BOTTOM CUP HOLDER BROKE TWICE NOW AND IT'S LIKE THE BOTTOM OF IT FELL OUT. TODAY I GET IN MY CAR TO GO TO WORK AND THE SPEAKERS ON THE FRONT DRIVERS SIDE OF THE CAR ARE NOT WORKING. IS THIS TYPICAL OF THIS KIND OF CAR OR IS IT JUST MY LUCK? I'VE HAD MORE ISSUES WITH THIS CAR THAN I HAVE EVER HAD WITH ANY OTHER CAR I HAVE BOUGHT IN A SHORT AMOUNT OF TIME.",
        "vin": "1FMCU9H90LU"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/06/2020",
        "dateOfIncident": "07/04/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337783,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING 25 MILES PER HOUR ON RESIDENT STREET WHEN TIRE BLEW OUT.",
        "vin": "1FMCU0H66LU"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/02/2020",
        "dateOfIncident": "06/28/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337274,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2020 FORD ESCAPE'S AUTOMATIC TRANSMISSION MAKES ODD WHIRRING SOUNDS AND SHIFTS HARD OFTEN WHILE DRIVING. AUTOMATIC TRANSMISSION STILL HAS A HARD TIME SHIFTING SMOOTHLY EVEN WHEN THE VEHICLES BEEN WARMED UP AND DRIVEN FOR AT LEAST 10 MINUTES. THE REAR VIEW CAMERA HAS A MIND OF ITS OWN AND DOESN'T ALWAYS WORK. EVEN WHEN IT IS WORKING THE FEED IS USUALLY TERRIBLE QUALITY. WHEN IT DOESN'T WORK YOU CAN'T SEE ANYTHING OUT OF THE REAR VIEW CAMERA, THE IMAGE QUALITY TURNS GREYISH AND IMAGES LAG.",
        "vin": "1FMCU0G64LU"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/29/2020",
        "dateOfIncident": "06/29/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331444,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN HIGHWAY AT APPROXIMATELY 45MPH A WARNING APPEARED \"STOP SAFELY NOW\" WITH A HAZARD SIGN.  THE VEHICLE SUDDENLY AND UNEXPECTEDLY LOST POWER AND SLOWED TO APPX 5MPH.  WAS UNABLE TO REGAIN SPEED AND ACCELERATOR DID NOT RESPOND.  APPROXIMATELY 30 SECONDS LATER AN ONCOMING AMBULANCE APPEARED OVER THE HILL IN THE OPPOSITE LANE AND PROCEEDED PAST. POWER STILL WAS NOT RESTORED.  CONTINUED SHORT DISTANCE UNTIL ABLE TO SAFELY PULL OVER TO SIDE OF ROAD.  UNABLE TO SHUT OFF VEHICLE. ARRANGED FOR VEHICLE TO BE TOWED TO DEALER FRIENDLY FORD POUGHKEEPSIE NY.  VEHICLE HAD RECENTLY BEEN SERVICED DUE TO COMPLAINT THAT BACKUP CAMERA INTERMITTENTLY FAILED AND BECAUSE THERE HAD BEEN A SERVICE NOTICE INDICATING A SERVICE UPDATE WAS NEEDED AS VEHICLE COULD SUDDENLY LOSE POWER.  VEHICLE WAS SERVICED.",
        "vin": "1FMCU9DZ5LU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/25/2020",
        "dateOfIncident": "06/24/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330866,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS <500 MILES ON IT.  HEADLINER DROPPING BELOW DOOR TRIM ON BOTH FRONT DRIVER AND PASSENGER SIDE.  *TR",
        "vin": "1FMCU0DZ7LU"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/25/2020",
        "dateOfIncident": "05/22/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330875,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE PURCHASED 5/12/20.  ON 5/22/20, AT ODO 84 MILES, ON STARTUP, VEHICLE DISPLAYED  POWERTRAIN FAULT - ILLUMINATES WHEN A POWERTRAIN OR AWD FAULT HAS BEEN DETECTED. CONTACT YOUR AUTHORIZED DEALER AS SOON AS POSSIBLE.  VEHICLE FLAT BED TOWED TO SUNSTATE FORD WEST COLONIAL DR ORLANDO FL (PURCHASE DEALERSHIP).      SERVICE TEAM HAD VEHICLE 5 DAYS. CLEARED CODES U0131, U0100, U0140, U0155, U0198, U0253, U0257, P0919, U0212, U023A, U0103, U0111, U0121, U013F, U0159, U0232, U0233, U0293, U0401, U0415, U0420, U0424, U0531, U0101, U0418, U0429, U0146.    4 MILE TEST DRIVE. 20 MILE DRIVE    RETURNED VEHICLE WITH NO CAUSE OR CORRECTION. ONLY EXPLAINED POWERTRAIN FAILURE COULD NOT BE REPLICATED.    SINCE RETURN, REAR AUTOMATIC LIFTGATE INTERMITTENT FAILURE, BACK UP CAMERA FAILURE, HEADLINER DROP AT FRONT PASSENGER AND DRIVER DOOR SEAL.  *TR",
        "vin": "1FMCU0DZ7LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/16/2020",
        "dateOfIncident": "06/15/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329235,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKUP SAFETY CAMERA AND WARNING SYSTEM FAILS OUTSIDE TEMP IS ABOVE 70 DEGREES AND AIR CONDITIONING HAS NOT BEEN RUNNING LONG ENOUGH TO COOL THE VEHICLE INTERIOR. WHEN VEHICLE IS PARKED OUTSIDE IN THE SUMMER THE BACKUP CAMERA WILL NOT WORK UNTIL THE AIR CONDITIONING RUNS FOR ABOUT 10 MINUTES.  *TR",
        "vin": "1FMCU9H91LU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/24/2020",
        "dateOfIncident": "04/23/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322117,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A NOTOFICATION FOR A \"FIELD SERVICE ACTION\" 20B14 FOR A POWETRAIN CONTROL MODULE UPDATE ON MY 2020 FORD ESCAPE HYBRID DUE TO \"STOP SAFELY NOW\" AND CHECK ENGINE LIGHT AND DTC'S P0340 AND P0340  I TOOK IT IN TO THE DEALERSHIP ON 23 APRIL 2020 FOR THE UPDATE, I WAS THEN INFORMED MY MY SERVICE ADVISOR THAT THIS UPDATE IS NOW ON INDEFINITE HOLD DUE TO THE UPDAYE CAUSING ADDITIONAL FAULT CODES ON THE ELECTRONIC POWER STERRING AND OTHER SYSTEMS.  HE ALSO PROVIDED ME WITH A LETTER FROM DAVID J. JOHNSON DIRECTOR SERVICE ENGINEERING OPERATIONS TAHT WAS SENT TO ALL FORD AND LINCOLN DEALERS PLACING \"NEW VEHICLE DEMONSTRATION/DELVERY HOLD ON ALL IN STOCK VEHICLES UNTIL THE FIELD SERVICE ACTION CAN BE PERFORMED.  I WILL ATTACH THIS LETTER TO MY COMPLAINT.  MY QUESTION/CONCERN IS, THAT IF FORD DEEMS THESE VEHICLES UNSAFE TO DRIVE FOR DEMONSTRATIONS DRIVES AND DELIVERY, WHY DOES FORD CONSIDER THEM SAFE ENOUGH FOR MYSELF AND MY FAMILY TO DRIVE ON A DAILY BASIS?",
        "vin": "1FMCU9DZ5LU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/20/2020",
        "dateOfIncident": "04/19/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321583,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TODAY, 4/19/2020, TWO OF MY CO-EMPLOYEES NOTICED THAT MY 2020 FORD ESCAPE WAS MAKING A TICKING SOUND.  I DIDN'T HEAR THE TICKING SOUND UNTIL I WAS WAITING IN LINE AT ARBY'S DRIVE-THROUGH AT ABOUT 6:30 PM ARIZONA TIME..  THE TICKING IS COMING FROM MY ENGINE AREA UNDER THE HOOD.  THE LOW OIL LEVEL INDICATOR LIGHT DOES NOT COME ON AND THERE IS NO VISIBLE SIGNS OF AN OIL LEAK ON THE PAVEMENT WHERE MY ESCAPE  IS PARKED.  COULD BE BAD SPARK PLUGS OR CAMSHAFT.  THE ESCAPE HAS BEEN FINANCED WITH ALASKA CREDIT UNION AND I HAVE NOT MADE THE FIRST PAYMENT YET.  $1,000 HAS BEEN PUT DOWN, $500 INITIALLY AND $500 ON A PROMISSORY NOTE.",
        "vin": "1FMCU0F62LU"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/19/2020",
        "dateOfIncident": "12/30/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321562,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTHING HAS HAPPENED YET...BUT A FEW VERY CLOSE CALLS....THE EQUIPMENT THAT THE REAR VIEW MIRROR IS ATTACHED TO IS HUGE AND THE MIRROR IS SUCH THAT IS BLOCKS A MAJOR PART OF THE VIEW TO THE RIGHT...ESP WHEN I AM ON A CURVY ROAD...IT LITERALLY BLOCKS ANYTHING IN THAT AREA...ANYONE ON A SIDEWALK ETC ETC....WHEN I NEED TO LOOK TO THE RIGHT I HAVE TO BEND DOWN OR LEAN OVER...I AM GOING TO HIT OR KILL SOMEONE....I HAVE TRIED CALLING FORD....BUT HAVE BEEN TOLD THEY HAVE NO SAFETY DEPT...I AM SPOKEN TO PEOPLE IN EVERY COUNTRY WHO DO NOT KNOW HOW TO GET ME TO THE RIGHT DEPT...I HAVE LEFT MY PHONE NUMBER ETC...I ALSO ASKED IF THE MIRROR CAN BE SWAPPED OUT FOR A SMALLER ONE....I HAVE HAD TO RESORT TO PUTTING THE MIRROR UP AND DOWN...VS THE WAY IT IS SOLD.....ALSO, THIS CAR WAS MAD WITH NO COVER FOR THE CARGO AREA....I HAVE TALKED TO MANY PEOPLE ABOUT THIS..APPARENTLY THEY ARE WAITING FOR QUOTES FROM MANUFACTURERS....I OFTEN PUT MY CAR ON TRANSPORTERS...I MOVE ARTWORK AND ANTIQUES...I WOULD NEVER HAVE BOUGHT A CAR WITH NO CARGO COVER.....I AM OFTEN IN S FL...CARS ARE BROKEN INTO OFTEN...YET, AT THE CAR SHOW THERE WAS ON ON DISPLAY...TRICKING THE PUBLIC....THEY ARE HIDING FROM THESE ISSUES...PLEASE HELP ME GET ANSWERS...HAVE LEASED A FORD OVER 8 YEARS...NEVER AGAIN...AND I WANT PEOPLE TO KNOW THESE ISSUES SO THEY CAN RETHINK THE PURCHASE...SAFETY SHOULD COME FIRST.......I AM NOT INCLUDING PICS NOW...JUST SIT IN ANY 2020 ESCAPE.....",
        "vin": "1FMCU0G68LU"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/20/2020",
        "dateOfIncident": "01/07/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318431,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 FORD ESCAPE. CONSUMER WRITES IN REGARDS TO DEFECTIVE HEAD UP DISPLAY, DIGITAL SPEEDOMETER, FRONT VIEW CAMERA MISREPRESENTATION. *LD    CONSUMER STATES THAT THE HEAD UP DISPLAY IN VEHICLE ONLY DISPLAYS SPEED IN KM/H. CONSUMER SAYS THAT THIS PRESENTS A POTENTIAL SAFETY HAZARD BECAUSE SPEED LIMITS IN THE US ARE DISPLAYED IN MPH. CONSUMER STATES THAT THE DIGITAL SPEEDOMETER DISPLAYS SPEED IN KM/H IN BIG NUMBERS AND MPH IN TINY NUMBERS. IN ADDITION, CONSUMER STATES THAT VEHICLE WAS SUPPOSED TO COME EQUIPPED WITH A FRONT VIEW CAMERA, BUT THAT IT WAS MISSING. CONSUMER HAS CONTACTED DEALERSHIP AND MANUFACTURER, BUT DID NOT RECEIVE A RESPONSE. *DL",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/16/2020",
        "dateOfIncident": "03/15/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318338,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MULTIPLE TIMES VEHICLE HAS SAID STOP SAFELY NOW WHILE DRIVING AND LIMITED ME TO ENOUGH POWER TO MAINTAIN 15MPH AT THE MOST. THIS HAS HAPPENED AT HIGHER SPEEDS AND HAS REQUIRED PULLING TO THE SHOULDER.",
        "vin": "1FMCU9DZ2LU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/09/2020",
        "dateOfIncident": "03/05/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316960,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BACKUP CAMERA HAS BEEN CHECKED AND \"REPAIRED\" TWICE.  THE MONITOR WITHIN THE LAST FIVE DAYS HAS RAN A GAMETE OF PROBLEMS RANGING IN NOT DISPLAYING AN IMAGE TO THE IMAGE BEING DISTORTED WITH A SERIES OF LINES THAT MOVE VERTICALLY UP AND DOWN.  THIS HAPPENS IN BOTH THE STATIONARY AND MOVING POSITIONS  THE PASSENGER SIDE'S WARNING SYSTEM DOES LIGHT UP, BUT THERE IS NO RINGING SOUND MADE TO LET THE DRIVER KNOW THAT A VEHICLE IS IN THE DRIVER'S BLIND SPOT.  THIS HAPPENS IN THE MOVING CONDITION.",
        "vin": "1FMCU0F62LU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/04/2020",
        "dateOfIncident": "02/13/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316185,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "UNEXPECTED \"STOP SAFELY NOW\" WARNING APPEARED ON INSTRUMENT CLUSTER WHILE TRAVELING ON THE INTERSTATE. ENGINE LOST POWER AND WAS ON BATTERY-ONLY (HYBRID VEHICLE).  PULLED OVER, AND ENGINE SHUT OFF COMPLETELY. UNABLE TO RE-START ENGINE IMMEDIATELY AFTER. DEALERSHIP STATED \"ENGINE/DRIVETRAIN FAULT\" BUT FOUND NOTHING. THAT WAS ON FEBRUARY 14TH A 1,875 MILES ON THE ODOMETER, AND THE WARNING/LOSS OF POWER HAPPENED AGAIN ON MARCH 2, 2020 WITH 2,003 MILES ON THE ODOMETER.    ALSO NOTE: THERE ARE ADDITIONAL 2020 FORD ESCAPE HYBRID OWNERS REPORTING THIS ISSUE ON FORDESCAPE.ORG UNDER THE \"STOP SAFETY NOW\" FORUM TOPIC.",
        "vin": "1FMCU9DZ2LU"
    },
    {
        "components": "STRUCTURE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/14/2020",
        "dateOfIncident": "01/24/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309242,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT LEASED A 2020 FORD ESCAPE. THE CONTACT STATED THAT THE HEADLAMP COVERS WERE FOGGY ON THE INSIDE HOWEVER, THE HEADLAMPS PROVIDED ADEQUATE ILLUMINATION. THE BULBS WERE LOCATED ABOVE THE HEADLAMP COVERS. THE VEHICLE WAS TAKEN TO STEVEN'S JERSEY CITY FORD 740 NJ-440, JERSEY CITY NEW JERSEY 07304 PHONE NUMBER (201)432-7272 TO BE INSPECTED. THE DEALER INSPECTED THE HEADLAMPS AND INFORMED THE CONTACT THAT THERE WAS NO FAILURES WITH THE HEADLAMP COVERS. THE CONTACT ALSO FOUND THAT WATER PENETRATED THE PASSENGER SIDE REAR DOOR, AND DRIVER'S SIDE REAR PASSENGERS DOOR. THE DEALER REALIGNED THE REAR PASSENGER DOOR AND DRIVER'S SIDE AND REAR PASSENGER DOOR. THE DEALER REATTACHED THE DOORS METAL MOLDING. MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILAGE WAS 100,000.",
        "vin": "1FMCU9H63LU"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/24/2020",
        "dateOfIncident": "01/23/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301659,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MOST STATES REQUIRE TRAILERS OF 3,000LB GVWR, AND SOME STATES ONLY 1,500LB, TO HAVE AN INDEPENDENT BRAKING SYSTEM ON AT LEAST ONE AXLE OF THE TRAILER. FORD SELLS VEHICLES WITH FACTORY TOW PACKAGES RATED AT 3,500LB, BUT DOES NOT SUPPLY EVEN AN OPTIONAL ELECTRIC BRAKE CONTROLLER. FURTHER, THEY DON'T SUPPLY A \"PLUG 'N' PLAY\" HARNESS FOR AN AFTERMARKET CONTROLLER AS DO MANY MANUFACTURERS. THIS SITUATION HAS PREVAILED FROM AT LEAST 2013 ONWARD. WHEN WE PURCHASED OUR 2020 ESCAPE SEL WITH FACTORY TOWING, WE FULLY EXPECTED THAT THIS SHORTCOMING WOULD HAVE BEEN RESOLVED. IT HAS NOT. AND THAT IT HAS EXISTED FOR TWO GENERATIONS OF THE ESCAPE SPANNING EIGHT MODEL YEARS LEADS ME TO CONCLUDE FORD IS WILLFULLY IGNORING THE LAWS OF MANY STATES, AND POTENTIALLY ENDANGERING THE DRIVERS OF THESE CARS AND OTHER DRIVERS SHARING THE ROADWAYS.",
        "vin": "1FMCU9H921L"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/21/2020",
        "dateOfIncident": "12/02/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300811,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE DAY ONE OF OWNERSHIP, IT HAS A VIBRATION IN THE STEERING WHEN APPROACHING 25MPH THEN THE VIBRATION CONTINUES ALL THE WAY TO 75MPH. ALSO AT APPROX. 25MPH AN LOW HUMMING SOUND STARTS. THE HUMMING SOUND GETS LOADER AS SPEED INCREASES ALONG WITH THE ROAD NOISE. THE HUMMING AND VIBRATION STOP AS SOON AS YOU TAKE YOUR FOOT OFF THE ACCELERATOR. BUT RESUMES AGAIN AS SOON AS THE ACCELERATOR IS PRESSED. THIS VIBRATION FEELS AS IF A WHEEL IS LOOSE OR COMING OFF OR THE THE ENGINE AND TRANSMISSION ARE GOING TO FAIL CAUSING A SERIOUS PROBLEM. THIS BY NO MEANS IS NORMAL. BOTH DEALERSHIPS PERSONNEL THAT DROVE THE VEHICAL SAID ITS NOT NORMAL.",
        "vin": "1FMCU0H67LU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/14/2020",
        "dateOfIncident": "01/06/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299378,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STEADILY DRIVING AT 40 MPH ON A TWO-LANE HIGHWAY, I SUDDENLY LOST ENGINE POWER AND SIMULTANEOUSLY RECEIVED A WARNING MESSAGE ON THE DRIVER'S DISPLAY TO STOP VEHICLE SAFELY NOW.  I WAS ABLE TO DRIVE TO WHERE ROAD HAD A SHOULDER, BUT THE CAR'S SPEED WAS LIMITED TO MAYBE 10 MPH EVEN WITH THE ACCELERATOR PRESSED.  (THE CAR IS A HYBRID, BUT HAD ONLY VERY LIMITED PROPULSIVE POWER IN WHAT SEEMED TO BE AN ELECTRIC MODE.) THE GAS ENGINE DID NOT KICK IN EVEN WHEN THE ACCELERATOR WAS PRESSED.  AFTER UNSUCCESSFULLY TRYING TO TROUBLESHOOT THE PROBLEM USING THE OWNER'S MANUAL, I PRESSED THE START/STOP BUTTON TO TURN OFF THE CAR, THEN PRESSED IT AGAIN TO RESTART.  THE GAS ENGINE STARTED, I REGAINED THE ABILITY TO ACCELERATE, AND THE CAR APPEARED TO FUNCTION NORMALLY.  SUBSEQUENTLY, THE CAR WAS TOWED TO TWO DEALERSHIPS TO DIAGNOSE THE PROBLEM.  THE MANUFACTURER HAS BEEN CONTACTED AND THE PROBLEM HAS BEEN \"ESCALATED\" AS EFFORTS CONTINUE TO FURTHER DIAGNOSE AND THEN CORRECT THE PROBLEM.  AT THE TIME OF THE INCIDENT, THE CAR'S HEATER WAS ON, AS WERE THE DAYTIME RUNNING LIGHTS.  THE RADIO WAS PROBABLY ON.  THE NAVIGATION SCREEN WAS DISPLAYED BUT WE WERE NOT USING THE GPS TO NAVIGATE.  MY CELL PHONE WAS NOT ON, BUT IT WAS LYING ON THE CONSOLE. (I BELIEVE THERE IS A LARGE CELL PHONE TOWER WITHIN SEVERAL HUNDRED YARDS OF WHERE THE INCIDENT OCCURRED.)  THE CAR HAD LESS THAN 500 MILES ON IT.  ONE OF THE DEALERSHIPS RECEIVED A DIAGNOSTIC CODE P1AOC WHEN TESTING THE CAR.  I WAS TOLD THIS MEANS THAT A \"SYSTEM OVERLOAD\" WAS DETECTED.  IN RESPONSE TO THE CODE, I WAS TOLD THAT THE SYSTEM WAS \"RESET\" AND THEN CHECKED FOR UPDATES.  I AM AWAITING FURTHER NEWS FROM THE SECOND DEALERSHIP.",
        "vin": "1FMCU9DZ5LU"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "11/30/2019",
        "dateOfIncident": "11/25/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11283051,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVERS SEAT (BOTTOM CUSHION) HAS A PIECE OF METAL OR HEAVY WIRING, ABOUT 2 INCHES LONG, AT THE BACK OF THE SEAT, WHERE YOUR TAILBONE IS. THE WIRE IS EASY TO FIND (IT RUNS BACK TO FRONT) UNDER THE SEAT MATERIAL. IT IS VERY UNCOMFORTABLE WHEN DRIVING. I TOOK IT BACK TO THE FORD DEALER I LEASED IT FROM AND THEY CHECKED OTHER 2020 ESCAPES AND THEY WERE THE SAME. THE SERVICE DEPARTMENT SAID THERE ISN'T ANYTHING THEY CAN DO UNTIL THERE IS A RECALL. I CALLED FORD CUSTOMER SERVICE AND HE SAID HE WOULD NOTE THE PROBLEM. I DREAD SITTING IN THE SEAT BUT I LOVE THE CAR.",
        "vin": "1FMCU0G69LU"
    }
]