[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/01/2022",
        "dateOfIncident": "02/27/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454671,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Ford Transit Connect. The contact stated that while driving at an undisclosed speed, the air bag warning light illuminated. The vehicle was not diagnosed nor repaired by an independent mechanic or dealer. The manufacturer was not made aware of the failure. The failure mileage was approximately 12,000.",
        "vin": "nm0ge9e24l1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/14/2022",
        "dateOfIncident": "02/10/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451925,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Transmission failed with only 17,000 miles (mostly highway) on the car. The car did not move forward from a parked location. It only moved in reverse. It had to be towed to the nearest dealership and when they examined it, it did not move in reverse either. Even though it is under warranty, the dealers are taking a long time to repair the car.",
        "vin": "NM0GE9F20L1"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/24/2020",
        "dateOfIncident": "12/10/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384813,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TWO DIFFERENT OCCASIONS THE DASH INDICATOR STATED AS FOLLOWS: \"PRE-COLLISION ASSIST NOT AVAILABLE\".  WHEN THIS ERROR MESSAGE APPEARS, THE CAR DOES NOT ACCELERATE PROPERLY.  THE TRANSMISSION SEEMS TO FLUCTUATE BETWEEN GEARS, AND THE CAR WILL NOT ACCELERATE, AND THE VEHICLE SEEMS AS IF THE PRE-COLLISION ALERT IS ENGAGING OR ATTEMPTING TO ENGAGE, BUT DOES NOT HOWEVER, STOP THE VEHICLE, RATHER, THE VEHICLE HESITATINGLY OR HALTINGLY WILL NOT ACCELERATE PROPERLY UPON PRESSING THE ACCELERATOR PEDAL. ON BOTH OCCASIONS , I IMMEDIATELY STOPPED THE VEHICLE IN A SAFE LOCATION, TURNED THE VEHICLE OFF, AND TURNED THE VEHICLE BACK ON AGAIN. IT SEEMS AS IF THE COMPUTER MODULE IS RESET UPON TURNING THE VEHICLE OFF AND THEN ON AGAIN. UPON TURNING THE VEHICLE ON AGAIN, IN BOTH INSTANCES, THE PROBLEM DISAPPEARED. HOWEVER, THE MOST RECENT INSTANCE OF THIS PROBLEM, UPON TURNING THE VEHICLE BACK ON, THE ERROR MESSAGE DISAPPEARED, AND THE ACCELERATION OF THE VEHICLE RETURNED TO NORMAL, BUT THE YELLOW ENGINE LIGHT REMAINED ON, UNTIL RESTARTING THE VEHICLE THE NEXT DAY.",
        "vin": "NM0LS6E24L1"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/02/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342857,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SATURDAY AUGUST 1, 2020, ME AND MY WIFE DROVE A CAR AFTER WORK AROUND 6:30PM. THIS FORD TRANSIT CONNECT HAS BEEN DRIVING A MONTH SINCE WE BOUGHT IT. WHEN WE TOOK ON THE ROAD WITH AROUND 30MILES SPEED 10MINUTES AFTER WE LEFT, SUDDENLY A WARNING MESSAGE CAME UP SAID THAT \"PRE-COLLISION ASSIST NOT AVAILABLE\". AS WE SAW THE MESSAGE WE HAD NEVER SEEN BEFORE, WE SLIGHTLY REDUCED A SPEED BELOW 25MILES AND KEPT DRIVING. WE SLOWLY PUSH AN ACCELERATOR TO SPEED UP AGAIN, HOWEVER SUDDENLY WE HEARD CLUNK SOUND, AND THE CAR SHOOK BACK AND FORTH. RPM INDICATOR MOVE ABNORMALLY. WE TRIED TO FIND A RIGHT PLACE FOR PULLING OFF A CAR, HOWEVER WE COULDN'T FIND IT IMMEDIATELY. AROUND 3 MILES DROVE, WE PULL OFF A CAR AND TURNED ENGINE OFF. AFTER A WHILE, TURN IT ON AGAIN.  A WARNING MESSAGE IS STILL ON. A CAR STILL SHOOK BACK AND FORTH WHILE WE DROVE AND RETURN TO HOME.",
        "vin": "NM0LS7E26L1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "06/10/2020",
        "dateOfIncident": "05/20/2020",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328097,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE OPERATOR WAS TRAVELING TOO FAST WHEN MERGING, 65 MPH, THEN LOST CONTROL AND STRUCK A SAFETY BARRIER.  A FEW MINUTES AFTER THE CRASH, A FIRE STARTED FROM THE FRONT OF THE VEHICLE.  SEE ATTACHMENT.  *TR*DT",
        "vin": "NM0GE9E26L1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/10/2020",
        "dateOfIncident": "03/03/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317230,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE WITH THE TRANSMISSION WITH ONLY 8000 MILES",
        "vin": "NM0LS7F21L1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/25/2019",
        "dateOfIncident": "10/17/2019",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270948,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER THE DRIVER I STOPPED AT A STOP LIGHT AFTER GETTING OFF THE FREEWAY, HE THE ACCELERATOR PEDAL AND THERE WAS BARELY ANY POWER. THE VEHICLE HAD TROUBLE ACCELERATING AND WAS PUTTING. THE DRIVER PULLED OVER AND CHECKED THE TEMPERATURE GAUGE, WHICH WAS FINE, AND THERE WERE NO BLINKING LIGHTS INDICATING ANY MALFUNCTION.  THE DRIVER THEN PROCEEDED BUT THE VEHICLE WAS STILL PUTTING.  AFTER PASSING THE NEXT INTERSECTION, THE DRIVER SMELLED AN ODD FUME. THEY PULLED OVER AND SAW SMOKE COMING OUT FROM UNDER THE HOOD.  AS THEY PARKED THE VEHICLE, THE SMOKE TURNED BLACK. THE DRIVER THEN HURRIEDLY GOT OUT OF THE VEHICLE.  THE VEHICLE WAS NOW ON FIRE AND THE DRIVER BELIEVES THEY SAW SOMETHING WAS LEAKING FROM THE VEHICLE.  A BYSTANDER CALLED 911 AND FAIRLY QUICKLY, THE FIRE DEPARTMENT PUT OUT THE FIRE.",
        "vin": "NM0GE9E21L1"
    }
]