[
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/28/2021",
        "dateOfIncident": "08/02/2021",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434734,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "GEORGETOWN",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Forest River Georgetown Motorhome built on a 2020 Ford F-53 chassis. The contact received notification of NHTSA campaign number: 21V202000 (Suspension, Power Train) however, the part to do the recall repair was not yet available. The contact called the local dealer who stated the parts were not available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was notified of the issue however, no additional assistance was provided. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "1F66F5DNXL0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/16/2021",
        "dateOfIncident": "05/16/2021",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416799,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "GEORGETOWN",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SWAY BAR ON MY RV SITTING ON THE FORD F53 CHASSIS BOLTS CAME OUT 3 OF THE 4 AND TORE THE BRAKE LINE IN HALF (POSSIBLY ONLY THE ABS LINE). THIS VEHICLE HAS LESS THAN 4,000 MILES AND I HAVE HAD TO FIX A LOT OF THEIR QUALITY CONTROL ISSUES. THIS COULD HAVE KILLED SOMEONE THOUGH. CONSUMER HAS ATTACHED ADDITIONAL PHOTOS WITH SWAY BAR IS MISSING BOLTS ON EACH SIDE OF MOUNTING BRACKETS, WHICH CAUSED THE SWAY BAR TO PINCH IN HALF OF ABS LINE.",
        "vin": "1F66F5DN6L0"
    }
]