[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/03/2022",
        "dateOfIncident": "01/30/2022",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450170,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "R-POD",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The glass in the front window spontaneously combusts",
        "vin": "4X4TRPV13LB"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/30/2021",
        "dateOfIncident": "04/27/2021",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414584,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "R-POD",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT WINDOW OF CAMPER SHATTERED FOR NO REASON SITTING IN MY DRIVEWAY.  FOREST RIVER HAS BEEN UNRESPONSIVE ABOUT REPAIRING THIS.  IF WE HAD BEEN IN THE CAMPER SLEEPING, THE SHATTERED GLASS WOULD HAVE WENT ALL OVER US, POSSIBLY INTO EYES AND MOUTH.  CAMPER WAS PARKED ON LEVEL GROUND WITH STABILIZERS DEPLOYED.  HAVE READ ABOUT OTHER INSTANCES OF THIS HAPPENING.  WINDOW FRAME LOOKS TO HAVE SEVERAL SCREW HEADS THAT ARE OVERTIGHTENED, FRAME APPEARS TO BE WARPED WHICH MAY HAVE PUT GLASS IN A BIND.",
        "vin": "4X4TRPT16LB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/19/2021",
        "dateOfIncident": "01/19/2021",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388937,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "R-POD",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE DRIVING EAST ON HIGHWAY 50 ABOUT 65 MPH.WE LOOKED IN THE SIDE MIRRORS AND SAW THE FRONT WINDOW OF THE RPOD SHATTERED. WHEN WE NOTICED THE WINDOW WE WERE ABOUT 90 MILES WEST OF ELY NEVADA. WE HAD STOPPED ABOUT 30-45 MINUTES PRIOR FOR LUNCH AND EVERYTHING WAS GOOD.   VERY LIMITED TRAFFIC ON THE ROAD. THE WINDOW WAS COMPLETELY SHATTERED AND GLAD WAS ALL OVER INSIDE OF THE POD ON THE BED.",
        "vin": "5ZT2RPHC3LV"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/15/2020",
        "dateOfIncident": "09/15/2020",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354675,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "R-POD",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FOREST RIVER R-POD. CONSUMER WRITES IN REGARDS TO SEWER PIPE FAILURE ON TRAILER. *LD    THE CONSUMER STATED THE SEWER PIPE COULD FAIL WHILE DRIVING CAUSING RAW SEWAGE TO BE RELEASED ON THE HIGHWAY. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. *JS*DT*TR",
        "vin": "5ZT2RPHC1LV"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/28/2020",
        "dateOfIncident": "07/15/2020",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341754,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "R-POD",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WE BOUGHT 2020 R-POD 172 OFF ROAD PACKAGE TRAVEL TRAILER IN DEC OF 2019 TO BE TAKEN TO PRIMITIVE CAMPGROUNDS. THIS IS WHAT HAPPENED TO IT WHEN WE TOOK IT ON A 25 MILE COUNTY ROAD IN MONTANA. IT WAS TOWED AT A AVERAGE SPEED OF 10 TO 20 MILES AN HOUR ON THE TRIP TO THE CAMPGROUND:  THE REFRIGERATOR BROKE LOOSE FROM THE 4 SCREWS HOLDING IT AND SLIDE BACK, LUCKILY THE PROPANE LINE DIDN'T BREAK OFF, ALSO THE REFRIGERATOR HAD BEEN IN FOR WARRANTY WORK IN JANUARY 2020 BECAUSE THE REFRIGERATOR WAS MOUNTED IN FROM THE FACTORY.   THE EXIT DOOR GOT STUCK AND WE HAD TO CRAWL OUT THE EMERGENCY EXIT WINDOW.  THE CIRCUIT BREAKER PANEL FELL OUT OF THE WALL.   THE MICROWAVE BROKE LOOSE FROM THE 4 TINY SCREWS HOLDING IT IN PLACE.   THE SINK WAS JUST SCREWED UP TO THE BOTTOM OF THE COUNTER TOP WITH THREE WOOD SCREWS WHICH BROKE THE COUNTER AND FELL DOWN.   THE THREE WINDOW VALANCES BROKE LOOSE AND WERE HANGING DOWN.   THE ELECTRIC BRAKE WIRES ON THE RIGHTHAND HUB FELL OUT OF THE SPLICES.  THE TOP CABINET ABOVE THE SINK WOULD HAVE FELL DOWN BUT I HAD BUILT A SHELF UNDER IT BEFORE WE LEFT ON OUR EXCURSION.   EVERYTHING THAT BROKE OR FELL OFF ON THIS TRIP COULD HAVE BEEN ELIMINATED IF FOREST RIVER WOULD HAVE JUST TOOK A LITTLE TIME TO EVALUATE THEIR MANUFACTURING PROCESS, BUT I GUESS THEY ARE MORE INTERESTED IN GETTING THEM OUT TO THE DEALER TO SELL THEN PRODUCING A QUALITY PRODUCT.",
        "vin": "5ZT2RPFC2LV"
    }
]