[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/23/2022",
        "dateOfIncident": "03/23/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458045,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 GMC Sierra 1500. The contact stated that while driving at an undisclosed speed, the vehicle shuddered. The vehicle was taken to the dealer however, the mechanic could not duplicate the failure. The vehicle was then taken to Gilland Chevrolet GMC (3071 N US Hwy 231, Ozark, AL 36360) where the contact was informed that the vehicle already had new transmission fluid filled in the transmission. The vehicle was not repaired. The manufacturer was not made aware of the failure. The failure mileage was approximately 42,000.",
        "vin": "3gtp8ced7lg"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/08/2022",
        "dateOfIncident": "02/26/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455697,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 GMC Sierra 1500. The contact stated that while driving in the snow, the tire pressure and power steering warning lights illuminated. The vehicle was not diagnosed or repaired. The vehicle was taken to a dealer where it was confirmed that there were no recall or warranties that would cover the repairs for the warning lights. The failure mileage was 140,000.",
        "vin": "3GTP9EEL4LG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/08/2022",
        "dateOfIncident": "02/08/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451041,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Steering locked up after normal use at lunch. After sitting, traction control light then on and wheel would not turn after work.  Did a computer reboot and steering released. Results still pending, she is not home yet.",
        "vin": "3GTU9CED3LG"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/02/2022",
        "dateOfIncident": "05/03/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450056,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I receive at random times the warning in the DIC (driver information center) on the dash of my car together with an air bag warning light.  I have had this happen sometimes frequently and sometimes not for a thousand miles.  I have taken it in at least 8 times, some parts were replaced in seat belt, but it continues to show up.  The problem is it now doesn't leave a code but my local dealer said if it ever came up when I could get it to them to bring it in and leave it running.  that happened and I brought it in the ran a computer check and got a code.  I had to leave for Florida 2 days later, so they said bring it in to a dealer in Florida, give them the code, which I did, they checked it but said they will not replace parts without an active computer code.  Problem started around 11K miles; I have 32K miles, and dealer wont replace parts unless they know they are bad.",
        "vin": "1GTU9FET3LZ"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/31/2022",
        "dateOfIncident": "01/30/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449530,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "A vehicle with 45,000 Miles had ball joint shear from the upper control arm of front left suspension resulting in wheel separation from the ball joint. Similar situations happening with similar 2020 GMC Sierra's (Note: NHTSA Recall Notice, No. 21V718). Could have resulted in a vehicular crash if speed had been increased prior to separation.",
        "vin": "3GTU9FEL4LG"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/31/2022",
        "dateOfIncident": "01/01/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449659,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I have a lifters problem that the dealership takes more that three weeks to fixed without a loaner car, then i have electrical problems where the truck doesn't start at all without any warning and that's it's dangerous, never now where its going happen",
        "vin": "3gtu9fel6lg"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/06/2021",
        "dateOfIncident": "12/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442892,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 GMC Sierra 1500. The contact stated that shortly after refueling while driving under 15 MPH, the check engine and service emissions warning light illuminated. The contact stated that an unknown reset was performed related to TSB: 10173675 (Engine). The vehicle was not yet fully repaired. The manufacturer was made aware of the failure. The approximate failure mileage was 46,000.",
        "vin": "1GTU9FET9LZ"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/21/2021",
        "dateOfIncident": "11/21/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441231,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "At 8,000 miles I started hearing a clunking noise in my truck when I hit a small bump or back up out of drive way. Brought in and GMC stated it was normal and no issues at walser buick gmc of Roseville. Brought I back again because it was getting worse and could hear it every time I slowed down and accelerated. Then stated they need to order spacer bushings at walser of Bloomington. Then went back for 3rd time and installed them at Bloomington.After 600miles noise was back and is  getting worse again. I called Walser of Bloomington again and said I need to drive it for 1000 miles to break in spacers. So now we have 11,000 miles on truck with same noise again and its going back again because needs to get fixed. GMC is just asking for something to happen. Also when this first happened at 8,482miles I was on 35w and the rear end started wobbling and gave me a small death wobble but I slowed down to control it. That’s when I brought it in and it could of hurt or killed somone.",
        "vin": "3gtu9dedxlg"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/16/2021",
        "dateOfIncident": "11/17/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440605,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Brakes have been squealing since 4000 mile mark. Dealer states it’s normal.",
        "vin": "3GTU9FET8LG"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/27/2021",
        "dateOfIncident": "10/27/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438339,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "WRANGLER AT/S",
                "productYear": "9999",
                "size": "LT275/65R20",
                "type": "Tire"
            }
        ],
        "summary": "The contact owns a 2020 GMC Sierra 1500 equipped with Goodyear Tires, Tire line: Wrangler AT/S, Tire Size: LT275/65/R20, DOT Number: PJOTJB1V. The contact stated while driving 65 MPH, there was a slight wobble and then an impact was felt when the rear passenger’s side tire tread separated and damaged the rear fender and bumper. The contact pulled over and had assistance replacing the rear passenger’s side tire with the spare tire. The dealer was made aware of the failure and was in possession of the failed tire. The manufacturer was not made aware of the failure. The failure mileage was unknown.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "09/30/2021",
        "dateOfIncident": "09/24/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435051,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Own a 2020 GMC Sierra AT4 with 13K miles and I owned the truck for 1 year. All of a sudden my vehicle started receiving multiple warning messages.  Electronic Stability Control, Antilock Braking System, ECM, reduced Engine Power, etc.  I see there was a recall for 2019 GMC Sierra's for the same issues. Why isn't 2020 GMC Sierra's not also part of that recall ?  It is ridiculous that a brand new truck has these types of serious issues affecting so many vehicles. Why is GMC allowed to continue to sell later model trucks after the 2019 recall with the exact same ESC and Anti-lock Braking system problems ?",
        "vin": "3GTP9EEL4LG"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/27/2021",
        "dateOfIncident": "09/18/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434588,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Two times while on the freeway the service parking brake and engine lights came on and starting braking. Could not drive over 20 mile an hour.  Both times taking to dealer the lights where not on and they could not find anything wrong.  I even have video of it happening.",
        "vin": "1gtr8aek4lz"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/26/2021",
        "dateOfIncident": "04/21/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434431,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The leaf springs appear to have failed.  The vehicle is available for inspection.  If the leaf spring brakes, control of the vehicle could quickly become an issue.  On 9/24/21 I brought my truck into the local GMC dealer for inspection.  The service technician indicated the leaf springs show “possible overloading” and recommended air bags to level the truck.  The heaviest load for this truck has been a 4,000 lb. fiberglass fishing boat.  At this time, no one else has inspected the truck.  The truck, when empty, sits lower in the rear than in the front. If a small trailer is attached, it becomes even worse.  Oncoming cars flash their headlights thinking mine are on high beam, which they are not.",
        "vin": "3gtu9del9lg"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/12/2021",
        "dateOfIncident": "08/02/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432679,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I purchased the 2020 Sierra 1500 because the label on the truck frame states that it can tow 9300lbs. Subsequently, in April 2021, I purchased a 34' Travel Trailer with a max capacity of 8995lbs.  In August, I received a notice from GMC that they overstated the towing capacity by 500lbs.  The new towing capacity is 8800lbs. GMC's response to my request for a refund was that they were not going to help me. Their solution is that I can be provided a new sticker by the dealer upon request.  This does not resolve my issue, nor the issue of other Sierra owners who purchased this vehicle because of its stated towing capacity.  In doing research, it appears that in model year 2014, GMC faced a class action lawsuit for misrepresenting their capabilities.  I believe that this malpractice is a safety concern for me and many others.   Attached is the towing label on the frame and the letter from GM.",
        "vin": "1gtu9fel3lz"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/06/2021",
        "dateOfIncident": "09/04/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431842,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Bought 9-4-2020. On 9-4-2021 went start vehicle and no electrical power, battery dead. Will not hold charge to start. Brand new purchased at Morgan GMC in Shreveport Louisiana",
        "vin": "3GTP9EED6LG"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/03/2021",
        "dateOfIncident": "07/28/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431592,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving my 2020 GMC Sierra AT4 at about 15mph on a 2 way city street slowing for a traffic light when my vehicle started to shake violently...at first thinking it was a flat, but the shaking was much different.  As I was slowing in anticipation of the light, now at about 5mph, my truck suddenly dropped and stopped.  This would have been catastrophic at freeway speeds!  I immediately thought maybe someone had tried to steal the wheel overnight as I knew now it was not simply a flat, but knew I had wheels locks and thought that unlikely....this was while I was exiting my now parked truck.  I knew the problem was on the front passenger side, and was shocked as I rounded the vehicle from the front only to find the entire front wheel assembly folded flat under my truck.  The entire brake assembly was still intact, but the front drive shaft was pulled out, as well as the upper and lower ball joints.  The brake hose became severed in this incident.",
        "vin": "1GTP9EED6LZ"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "08/31/2021",
        "dateOfIncident": "12/14/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431270,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Issue 1: Front left sensor(s), after a rain, car wash and now after an oil change, continuously vibrates the drivers seat and the red light warning stays lite indicating that an obstacle is located near the left front of the truck.  This has happened on several occasions and after a time both indicator stop.    Issue 2: When traveling on a freeway, twice now, the cruise control suddenly disengaged or decreased mileage, as if it had detected a vehicle in front of us.  There was no vehicle within a quarter mile of us front or back, nor any vehicles on the side.  No debris in the road either.  Usually when the adaptive cruise is set and detects something in front the icons on the dash turn orange and starts to flash.  That didn't happen, rather the cruise icon changed to blue in color and the truck slowed.  This I would consider a safety risk.    Both instances (December 2020 and April 2021) have been reported to a dealership and noted in a file. When the customer care person attempted to get malfunction codes, nothing appeared to be wrong with the vehicle.",
        "vin": "1GTU9FELXLZ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/12/2021",
        "dateOfIncident": "10/05/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428904,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Repeated issues with exhaust and emissions components.",
        "vin": "3GTU9EETXLG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/07/2021",
        "dateOfIncident": "05/21/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428150,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Found improperly installed rear seals. The truck leaked oil and had to be towed to gmc dealership in Monahans Texas to be repaired. 1 month later the truck leaked oil again.",
        "vin": "3gtu9cetxlg"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/19/2021",
        "dateOfIncident": "07/17/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425566,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Rear main oil seal failure causing truck to lose all oil, leaking all over truck, trail leading to drive and garage; possibility of engine seizing up while driving causing an accident, confirmed by dealer, covered by warrenty, is a known issue, no warning lights, messages, or other symptoms of problem, NHSTA has issued a bulletin for this problem",
        "vin": "3GTU9FET2LG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/14/2021",
        "dateOfIncident": "06/12/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420863,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Service ESC, Service Power Steering, antilock brakes disabled all flashed on information center of vehicle.   Service engine light, antilock brake light, ESC, low battery all illuminated.  Vehicle would not start - try to start it would go through all issues on information center.   This is the same ESC issue described for 2019 Silverado and GMC Sierras.",
        "vin": "3Gtu9bed0lg"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/24/2021",
        "dateOfIncident": "05/22/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418260,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The display for the backup camera and infotainment system became blank.  Other owners have the same complaint.  This is a serious safety issue because I was backing up when it went blank.",
        "vin": "3gtp8bek7lg"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/23/2021",
        "dateOfIncident": "05/22/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418238,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "On Saturday, May 22, 2021, My wife was returning from fairgrounds in Waxahachie, TX. She remote-started the car, and the vehicle started. As it started to rain and was getting muddy, and the grounds are in a grass field (No large rocks, hills or debris to climb as it's cleared land), she shifted the vehicle into 4wd high incase the field was slick. She started to drive and received several warning lights, \"Service ESC, Service traction control, brake light warning and check engine light\". The vehicle also had a noticeable wobble to the wheel and felt off balance, jerky, and had speed limited. My wife turned the vehicle off and back on and some of the lights went off, and the vehicle did not lurch or wobble anymore. The vehicle had a tire changed at the dealer the day prior, so I am unsure if that tire change is related or not. Now the vehicle shows an alert \"check engine, service emissions system\". I am having the vehicle towed to the dealership tomorrow for diagnostics. All lights except the check engine light have since turned off since powering off the vehicle.",
        "vin": "3gtu9felxlg"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/17/2021",
        "dateOfIncident": "05/14/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417531,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Airbags failed to deploy after striking a street light pole head-on.  The impact hit just right of dead center of the grille and shoved the front end back approximately 2 feet into the engine. There were no dash lights or warning lamps illuminated before the collision. I have notified GM and received a case number. I also have filed an insurance claim and the vehicle has been inspected by a reputable body shop and has been deemed a total loss. A police report was also filed. The vehicle is scheduled to be picked up by the insurance company on 5/18/21.",
        "vin": "1GTU9FEL4LZ"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/01/2021",
        "dateOfIncident": "04/30/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414681,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "IT WAS FINE AND WE DROVE TO OUR NEIGHBOR, PARKED ABOUT 15 MINS. WHEN WE STARTED THE TRUCK TO TURN BACK, THE STEERING WAS SUPER HEAVY, WITH 2 MESSAGES POP UP ON THE DASHBOARD: SERVICES ESC, AND SERVICE POWER STEERING DRIVE WITH CARE. TRIED SEVERAL TIMES TO RE-START THE TRUCK, IT'S KEEP THE SAME.  IN OUR NEIBORHOOD, PARROT TULIP VIEW, PFLUGERVILLE, TX 78660.  RAINING ALL NIGHT, NOT SURE IF IT'S RELATED TO THE WEATHER.",
        "vin": "3GTU9DED3LG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/27/2021",
        "dateOfIncident": "03/16/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414107,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 GMC SIERRA 1500. THE CONTACT STATED THAT UPON EXITING THE VEHICLE, HE NOTICED THAT THE VEHICLE WAS LEAKING AN UNKNOWN FLUID. THERE WAS NO WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO SIMPSON BUICK GMC OF BUENA PARK (6600 AUTO CENTER DR, BUENA PARK, CA 90621) WHERE IT WAS DIAGNOSED WITH THE TORQUE CONVERTER NEEDING TO BE REPLACED. THE VEHICLE WAS REPAIRED HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS NOT INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 11,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/22/2021",
        "dateOfIncident": "04/02/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413341,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAS MADE \"PANIC STOPS\" AT HIGHWAY SPEEDS 5 TIMES WHEN USING ADAPTIVE CRUISE CONTROL WITH NO INPUT FROM DRIVER OR SURROUNDING ENVIRONMENT I.E.. CLEAR ROAD, NO TRAFFIC, SUN OR NO SUN.",
        "vin": "3GTP9EEL6LG"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/18/2021",
        "dateOfIncident": "03/16/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403691,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TRUCK TUESDAY MARCH 16TH HAD ME UPDATE SOFTWARE AS SOON AS I GOT TO WORK, AFTER IT WAS DONE I GOT OUT OF MY TRUCK AND IT WOULD NOT LOCK WITH PUSH BUTTON OR FOB. WHEN I GOT INTO MY TRUCK TO GO HOME 10HRS LATER IT MADE A BUNCH OF CLICKING NOISES AND AFTER A MINUTE IT SHOWED UPDATE COMPLETE ON SCREEN THEN STARTED. THE VERY NEXT DAY I DROVE BACK TO WORK WHICH IS 22 MILES. WHEN I TOOK MY TRUCK TO LUNCH THREE BLOCKS AWAY I HAD ESC SERVICE LIGHT AND SERVICE PARKING BRAKE ACCOMPANIED BY CHECK ENGINE LIGHT. I CALLED LOCAL DEALERSHIP TO GET IT LOOKED AT AND THEY SAID FRIDAY WAS AS EARLY AS I COULD GET IT IN.  I LEFT WORK EARLY AT 1:30 AND TRIED TO DRIVE IT AND IT WAS SQUALENE LIKE A BAD POWER STEERING PUMP AND SHAKING AS I DROVE. I WENT AHEAD AND TOOK IT THE DEALER.",
        "vin": "1GTR9BED8LZ"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/10/2021",
        "dateOfIncident": "03/09/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400111,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 GMC SIERRA SLT VIN:[XXX] 15,700 MILES.  BRAKING SYSTEM FAILURE AT ABOUT 45MPH ON HIGHWAY 78 IN LOGANVILLE, GA APPROACHING AN INTERSECTION WITH RED LIGHT, VEHICLE SEEMED TO LOOSE ALL POWER BRAKING. I STOOD WITH ALL I COULD ON THE PEDAL, AND TURNED TO AVOID REAR ENDING STOPPED VEHICLES, RUNNING INTO MIDDLE OF THE INTERSECTION BEFORE IT STOPPED; NO ACCIDENT !  DEALER IS REPLACING MASTER CYLINDER AND BOOSTER BRAKING SYSTEM, ALONG WITH COMPUTER SYSTEM UPGRADE.    MY CONCERN IS THE DEALERSHIP AND NHTSA IS AWARE OF THIS ISSUE, YET NO CEASE AND DESIST DRIVING DIRECTIVE HAS BEEN ISSUED !    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "1GTU9DED5LZ"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/25/2021",
        "dateOfIncident": "02/25/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397930,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN STATIONARY AND PREPARING TO START VEHICLE INTERMITTENTLY  SEE \"SERVICE STEERING COLUMN LOCK\" MESSAGE APPEARS AND DISAPPEAR ONCE VEHICLE IS STARTED. THIS WAS PREVIOUSLY SUPPOSED TO BE ADDRESSED WITH SERVICE BULLETIN 20-NA-21 HOWEVER BEING TOLD BY SERVICE DEPARTMENT THAT VEHICLE HAS ALL CURRENT UPDATES APPLIED A YEAR AGO, INCLUDING THE ONE THAT SHOULD OF ADDRESSED THE ISSUE. TOLD THAT THE VEHICLE HISTORY SHOWS RECORDS OF PAST \"LOSS OF COMMUNICATION TO DIC\" BUT AS THEY CAN'T IMMEDIATELY REPRODUCE NO ACTION WAS TAKEN.",
        "vin": "1GTU9FEL3LZ"
    },
    {
        "components": "EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/24/2021",
        "dateOfIncident": "02/24/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397727,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "DANGEROUS VISIBILITY HAZARD WHEN BACKING UP VEHICLE AT NIGHT.  INFOTAINMENT SCREEN SWITCHES TO \"FULL BRIGHTNESS\" WHEN BACKUP CAMERA IS ACTIVATED, RESULTING IN BLINDING LIGHT TO DRIVER. DRIVER CAN NOT BACKUP SAFELY WITHOUT PHYSICALLY COVERING THE SCREEN TO REGAIN VISIBILITY. SCREEN BRIGHTNESS REFLECTS OFF ALL 4 WINDOWS, WINDSHIELD AND BACK GLASS. SIDE MIRRORS ARE UNUSABLE IN THIS CONDITION.    THERE WAS A FIX FOR THIS ISSUE ON PREVIOUS GM MODELS, (PRIOR TO 2018), HOWEVER NO FIX FOR 2019 - PRESENT",
        "vin": "3GTU8CED3LG"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/19/2021",
        "dateOfIncident": "08/30/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396914,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "BRIDGESTONE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 GMC SIERRA 1500 EQUIPPED WITH BRIDGESTONE TIRES, TIRE LINE: ALENZA A/S 02, TIRES SIZE: 275/50/R22, DOT NUMBER: UNKNOWN. THE CONTACT STATED THAT THE TIRES FAILED TO HOLD THE TIRE PRESSURE. THE VEHICLE WAS TAKEN TO SCENIC CHEVROLET BUICK GMC CADILLAC (2300 ROCKFORD ST, MT AIRY, NC 27030) WHERE THE VEHICLE WAS PURCHASED. THE TECHNICIAN ADDED NITROGEN GAS INTO THE TIRES HOWEVER, THE FAILURE PERSISTED. THE CONTACT STATED THAT A LETTER WAS SENT TO THE MANUFACTURER HOWEVER, THERE WAS NO RESPONSE. THE FAILURE MILEAGE WAS 2,976.  *JS *JS",
        "vin": "1GTU9FEL7LZ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/19/2021",
        "dateOfIncident": "03/09/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397032,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 GMC SIERRA 1500. THE CONTACT STATED WHILE DRIVING, THE SIDE VIEW MIRROR'S BLIND SPOT ALERTS ON BOTH SIDES ENGAGED WITH NO VEHICLE NEARBY. THE VEHICLE WAS TAKEN TO TURNER BUICK GMC (612 E MAIN ST, NEW HOLLAND, PA 17557) WHERE THE CONTACT WAS INFORMED THAT THE SENSORS WERE DIRTY. THE CONTACT THEN WASHED THE VEHICLE HOWEVER, THE FAILURE RECURRED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER HAD NOT BEEN INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 400. THE VIN WAS NOT AVAILABLE. *BF",
        "vin": "3GTU9DELXLG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/17/2021",
        "dateOfIncident": "02/16/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396687,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING WILL COMPLETELY LOCK UP, THIS IS THE 2ND OCCURRENCE.  IT WAS AT THE DEALER 1143 MILES AGO AND CODES WERE CLEARED, PROBLEM REOCCURRED.  I WAS ABLE TO START THE VEHICLE, PUT IN DRIVE/REVERSE NEUTRAL ETC WITHOUT ISSUES, HOWEVER THE STEERING WAS COMPLETELY LOCKED UP AND WOULD NOT ALLOW STEERING/CONTROL OF THE VEHICLE.   THE VEHICLE WAS PARKED IN DRIVEWAY, COLD OUTSIDE BOTH TIMES.  I HAVE VIDEO EVIDENCE.  THE FIRST OCCURRENCE 12/26/2020 AT 9591 MILES, 2ND OCCURRENCE 2/16/2021 AT 10733 MILES (1142 MILES LATER)",
        "vin": "3GTU9DET8LG"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/15/2021",
        "dateOfIncident": "02/15/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396371,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A STATE HIGHWAY, I HEARD A \"POP\" SOUND,  I SAW NOTHING CONTACT THE VEHICLE, BUT I THEN NOTICED THE WINDSHIELD WAS CRACKED.  THE WINDSHIELD CRACKED FOR NO APPARENT REASON..",
        "vin": "1GTU9DED0LZ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/02/2021",
        "dateOfIncident": "01/29/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394363,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "AT ABOUT 3500 MILES LIFTERS ON TWO CYLINDERS COLASPED.  TOOK TO DEALER THAT DEALER HAD THREE WEEKS BUT FIXED IT.  1500 MILES LATER AT 5036 MILES IT HAPPENED AGAIN ON A DIFFERENT CYLINDER.  NUMBER 8.  THE FIRST TIME IT WAS 3 AND 5.  THE FIRST TIME THE DEALER REPLACED ALL 8 CYLINDERS.  SO CYLINDER NUMBER 8 WAS NEW AS WELL.  GMC HAS SAID THERE IS NOTHING ELSE THAT CAN BE DONE TO FIX THE ISSUE.  THE SECOND DEALER SERVICE MANAGER STATES THAT HE WOULD NOT TRUST IT EITHER TO GO ANY LONG DISTANCE .  ALSO STATED THAT THEY HAVE PUT 3 SETS IN TO ONE VEHICLE  BEFORE.  AS AN ASE MASTER CERTIFIED TECHNICIAN I FIND THIS DISTURBING.   I ALSO WAS A GMC,PONTIAC, OLDSMOBILE MASTER TECHNICIAN. THIS IS UNEXCEPTABLE FOR GM TO THINK THIS IS OK TO TAKE PEOPLE'S HARD EARN MONEY AND NOT FIX THERE ISSUES OR MAKE IT RIGHT.   I OWNED  A 2014,2016,2018 SILVERADO'S THAT HAD NO ISSUES WHAT SO EVER.  TO MAKE THINGS WORST GMC ROAD SIDE ASSISTANCE FORGOT ABOUT THE TRUCK BROKE DOWN IN 7 DEGREE WEATHER WITH 35 MILE AN HOUR WINDS. FOR OVER 24 HOURS AND SEVERAL CALLS BACK TO FINALLY GET A SUPERVISOR TO SPEAK TO.  TWO DEALERS SAY THAT IT IS UNACCEPTABLE EXCEPT THE CURRENT DEALER THAT IS DEALING DIRECTLY WITH GMC.  ANYONE CAN DO A SEARCH ON GM TRUCK LIFTERS COLLAPSING AND YOU IMMEDIATELY OVERWHELMED WITH INFO.   IT IS ALSO DISTURBING THAT A DEALERSHIP SERVICE  MANAGER SAYS WE COULD PUT A NEW ENGINE IN AND THE SAME THING COULD HAPPEN.  THAT TO ME IS POOR QUALITY CONTROL AND POOR CUSTOMER SERVICE.  I HAVE ALWAYS BEEN A GM ENTHUSIASTS  BUT THIS WILL BE MY LAST ONE.  HORRIBLE CUSTOMER SERVICE AND DO NOT BUILD A GOOD PRODUCT OR STAND BEHIND IT.  GM SHOULD BE ASHAMED OF THERE FALL FROM GRACE. THIS ALL HAPPENED  JUST DRIVING ONCE TO WORK AND ONCE HAULING A ATV ON A TRAILER.",
        "vin": "3GTU9BED9LG"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/01/2021",
        "dateOfIncident": "01/31/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390959,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WIPERS FROZE TO WINDSHIELD WHILE DRIVING WITH DEFROSTER ON MAX.  DESIGN OF THE WINDSHIELD AND DASH MEANS WIPERS SIT LOWER THAN WHERE THE DASH AND WINDSHIELD MEET, AND NO WARM AIR FROM THE DEFROSTER CAN GET TO THE WINDSHIELD WHERE THE WIPERS SIT.  THERE IS NO IN WINDOW DEFROSTER (LIKE REAR WINDOW) WHICH CAN HELP.  MAJOR SAFETY ISSUE IN SNOW/ICE CONDITIONS.",
        "vin": "3GTP9EED1LG"
    },
    {
        "components": "ENGINE,LANE DEPARTURE,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "01/14/2021",
        "dateOfIncident": "01/02/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388120,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHIN 3 MONTHS (<4000 MILES) FROM PURCHASE VEHICLE BEGAN SPUTTERING WITH HESITATION, AND TICKING NOISE FROM ENGINE WHILE IN MOTION FOLLOWED BY MULTIPLE ALERTS POSTING ON DRIVER DISPLAY.  VEHICLE DISPLAYS LOSS OF POWER, AND STRUGGLES TO KEEP UP WITH TRAFFIC.  CHECK ENGINE LIGHT FLASHING FOLLOWED BY CONSTANTLY STAYING ON, SERVICE ESC SYSTEM ACTIVATED, SERVICE PARKING BRAKE, AND STEERING ASSIST REDUCED DRIVE WITH CAUTION LIGHTS ALL ACTIVATED DURING THIS EPISODE.  DEALER WORKED ON VEHICLE ENGINE ( AND COMPLETED ON OR AROUND 1/08/2021), AND REPLACED LIFTERS, AND OIL CONTROL VALVE.  ON 01/13/2021 NOTICED THAT VEHICLES LANE KEEP ASSIST IS NOW WORKING SPORADICALLY, WILL NOT ACTIVATE CONSISTENTLY WHEN VEHICLE VEERS OFF THE PROPERLY MARKED LANES ON HIGH-WAY/ROADS, AND INCONSISTENTLY ALERTS DRIVER WHILE IN MOTION.  THE LANE KEEP ASSIST IS SUPPOSE TO CORRECT STEERING, BUT THIS DOES NOT HAPPEN CONSISTENTLY.  THE COLLISION ALERT SYSTEM DOES NOT ACTIVATE OR WORK CORRECTLY.  NOTICED WHILE DRIVING THAT VEHICLES IN FRONT ARE NOT DETECTED CORRECTLY, AND INFORMS THE DRIVER THEY ARE WITHIN SAFE DISTANCE (GREEN THIS SUDDENLY CHANGES TO YELLOW).  IN ADDITION WHEN VEHICLES IN FRONT APPLY BRAKE, THE COLLISION ALERT SYSTEM DOES NOT ALERT AS IT IS SUPPOSED TO, IT STAYS IN GREEN EVEN AT EXTREMELY CLOSE RANGE.  SAFETY MECHANISMS DON'T APPEAR TO WORK CORRECTLY, AND DETECTS ITEMS THAT ARE NOT PRESENT.  NOTICED THAT VEHICLE DETECTS LANES EVEN ON UNMARKED ROADS, AND THE FRONT PEDESTRIAN ALERT SYSTEM ACTIVATES SPORADICALLY EVEN IF NO PEDESTRIANS ARE IN FRONT OF VEHICLE WHILE DRIVING.  CONCERNED ABOUT SAFETY FEATURES LEADING TO HAZARDOUS DRIVING CONDITIONS.",
        "vin": "3GTU9DED6LG"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/13/2021",
        "dateOfIncident": "12/14/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387889,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ON DECEMBER 14, 2020 MY SIERRA WITH 2339 MILES DISPLAYED, AT STARTUP, THE POWER STEERING WAS OUT, TO DRIVE WITH CARE. ALSO DISPLAYED SERVICE ESC AND TRACTION CONTROL FAILURES. I DROVE WITH MUCH DIFFICULTY, WITHOUT POWER STEERING, TEN MILES TO THE NEAREST GMC DEALERSHIP, LAFONTAINE IN HIGHLAND, MI. I PICKED UP THE VEHICLE ON DECEMBER 29, 2020 WITH AN ADDITIONAL 60 MILES. THE SERVICE PERSONNEL SAID THEY WERE UNABLE TO DUPLICATE THE PROBLEM, THEREFORE NO REPAIRS WERE MADE. LAFONTAINE HAD CONTACTED GENERAL MOTORS TECH CENTER WHO OFFERED NO SOLUTIONS OTHER THAN CHECKING THE BATTERY AND WIRING HARNESS CONNECTIONS. THE PROBLEM HAS NOT REAPPEARED IN THE FIFTEEN DAYS SINCE I PICKED UP MY VEHICLE.",
        "vin": "1GTR9BEK5LZ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/08/2021",
        "dateOfIncident": "01/06/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387170,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "[XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1GTU9DED9LZ"
    },
    {
        "components": "ENGINE,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "01/02/2021",
        "dateOfIncident": "12/23/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386106,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE FAILED AT 5100 MILES AND IS CURRENTLY BEING REPAIRED BY THE DEALERSHIP. I REQUESTED A NEW CAR REPLACEMENT.",
        "vin": "3GTU9DED7LG"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/30/2020",
        "dateOfIncident": "12/30/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385700,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS IDLING AND PARKED. WARNING CODE SHOWED UP ON DASHBOARD ESC, ELECTRONIC STABILITY CONTROL, REDUCED ENGINE POWER. VEHICLE THEN DISPLAYED TRANSMISSION DISRUPTION, WARNING LIGHT DISPLAYED AS WELL. I WAS ABLE TO DRIVE IT TO THE DEALERSHIP BUT THE PERFORMANCE OF THE VEHICLE WAS LIMITED BY THE REDUCED ENGINE POWER. TRANSMISSION WAS HESITATING AND CLUNKY DURING GEAR CHANGES.  MY SIERRA HAS 5,000 MILES ON IT AND THE TRANSMISSION WAS ALREADY REPLACED AT 2,000 MILES. GMC HAS A SERIOUS PROBLEM WITH THIS MAKE AND MODEL. UNSURE WHAT THE RESOLUTION WILL BE, BUT I AM NO LONGER CONFIDENT IN THE PRODUCT GMC IS SELLING.",
        "vin": "3GTU9BED1LG"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/29/2020",
        "dateOfIncident": "12/19/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11385428,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 GMC SIERRA 1500. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 35 MPH THE DRIVER LOST CONTROL OF THE VEHICLE AND DROVE OFF THE ROAD AND DOWN AN EMBANKMENT BEFORE CRASHING TO THE GROUND. DURING THE CRASH THE VEHICLE SUSTAINED SEVERE DAMAGE TO THE FRONT END BUT THE  AIR BAGS DID NOT DEPLOY. THE DRIVER SUSTAINED HEAD AND SHOULDER INJURIES WHICH REQUIRED MEDICAL TREATMENT. THE VEHICLE WAS TOWED AWAY. NO POLICE REPORT WAS TAKEN. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE LOCAL DEALER MAYSE EARNHARDT AUTO GROUP LOCATED AT 2032 S ELLIOTT AVE, AURORA, MO WAS NOTIFIED OF THE FAILURE. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 10,000.",
        "vin": "3GTU9BED3LG"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/20/2020",
        "dateOfIncident": "12/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384265,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TWO SEPARATE OCCASIONS, THE TRUCK HAS BEEN DEAD WHEN ATTEMPTING TO CRANK.  THERE WERE NO LIGHTS OR DEVICES LEFT ON AFTER THE PREVIOUS TIME THE TRUCK HAD BEEN USED.  SOMETHING IS DRAWING POWER FROM THE BATTERY CAUSING IT TO BE DEAD.  AFTER RECHARGING THE BATTERY, THE CHECK ENGINE CODES READ THAT THERE IS A PROBLEM WITH 'BRAKE LIGHT ILLUMINATION.'  HELP IN DETERMINING WHA  T IS CAUSING THE BATTERY TO DIE ON SUCH A NEW VEHICLE WOULD GREATLY APPRECIATED!  I'M UNCERTAIN AT THIS TIME AS TO WHETHER OR NOT THE BRAKE LIGHT ILLUMINATION IS CAUSING A SAFETY HAZARD.",
        "vin": "3GTU9DED9LG"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/10/2020",
        "dateOfIncident": "12/10/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11382957,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER HAVING ALL SORTS OF WARNINGS OVER TIME LIKE \"SERVICE ESC,\" \"SERVICE PARKING BRAKE,\" AND MORE, I NOW SEE \"BRAKE SYSTEM FAILURE: 62 MPH TOP SPEED\" FLASH ACROSS MY DASH. I AM READING AND HEARING THAT THIS IS A VERY DANGEROUS PROBLEM. NEW TRUCK. BRAND NEW. HAD IT LESS THAN A YEAR. BRAKE MESSAGE ALWAYS ON START UP.",
        "vin": "1GTU9CED9LZ"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/04/2020",
        "dateOfIncident": "10/14/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377941,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS NO WAY TO PERMANENTLY DISABLE THE AUTO START STOP ON THE VEHICLE. SEVERAL OTHERS HAVE COMPLAINED ABOUT THIS, NO RESPONSE FROM GM. THERE NEEDS TO BE A FIRMWARE UPGRADE TO THE ECM TO ALLOW THE OWNER MAKE THE DECISION ON IF THAT IS ENABLED OR DISABLED. ON MINE, I HAVE TO PUSH A BUTTON EACH TIME I START THE ENGINE TO DISABLE THAT. SOME GM VEHICLES DON'T HAVE THAT OPTION.",
        "vin": "1GTU9CED3LZ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/20/2020",
        "dateOfIncident": "10/25/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375643,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 GMC SIERRA 1500. THE CONTACT STATED THAT THE VEHICLE PUSH START BUTTON AND KEY FOB FAILED TO START THE VEHICLE ON FIRST ATTEMPT. THE CONTACT STATED THAT THE VEHICLE STARTED AFTER SEVERALS ATTEMPTED. THE CONTACT STATED THE FAILURE OCCURRED INTERMITTENTLY.  THE CHECK ENGINE WARNING LIGHT ILLUMINATED. THE CONTACT STATED THAT ON HIS WAY TO MCKENZIE BUICK-GMC DEALER, 6500 CAROLINE ST, MILTON, FL 32570, THE CHECK ENGINE WARNING LIGHT WAS NOT ILLUMINATED, THE VEHICLE WAS DIAGNOSED AND THE CONTACT WAS INFORMED THAT A FAILURE CODE WAS NOT FOUND. THE VEHICLE WAS NOT REPAIRED. HOWEVER, THE CONTACT CALLED BACK THE SAME DEALER AND INFORMED THEM THAT THE FAILURE RECURRED. THE VEHICLE WAS NOT YET TAKEN BACK TO THE DEALER. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 86.",
        "vin": "3GTU9CED3LG"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/06/2020",
        "dateOfIncident": "11/05/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373466,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "KEEP GETTING \"SERVICE SAFETY RESTRAINT SYSTEM \" ALERTS. VEHICLE ONLY HAS 550 MILES. ALERTS ARE INTERMITENT WHEN DRIVING.  CONTACTED THE DEALER AND WAS ADVISED THAT UNLESS IT REMAINS ON THEY COULD NOT TRACE THE ISSUE.",
        "vin": "3GTU9DED4LG"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/30/2020",
        "dateOfIncident": "09/30/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362024,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BACK UP CAMERA IS AWFUL AT NIGHT. THIS IS A SAFETY ISSUE BECAUSE YOU CANNOT SEE ANYTHING WHEN BACKING UP. MY TRUCK HAS 323 MILES ON IT AND I WENT TO DEALERSHIP THEY SAID I WOULD HAVE TO LIVE WITH IT. THAT IS NOT ACCEPTABLE TO HAVE A SAFETY FEATURE THAT IS FAULTY.",
        "vin": "3GTP8CED3LG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/27/2020",
        "dateOfIncident": "08/29/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361352,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE EQUIPPED WITH L87 6.2L.  AT 197 MILES ENGINE SUDDENLY CEASED OPERATING AND WOULD NOT RESTART.  THIS OCCURRED WHILE STOPPED ON PRIVATE ROAD.  VEHICLE HAD TO BE TOWED TO DEALERSHIP WHERE THEY FOUND P0300 AND DIAGNOSED BROKEN #4 CYLINDER EXHAUST VALVE SPRING.",
        "vin": "1GTP9EELXLZ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/23/2020",
        "dateOfIncident": "09/17/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360821,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION KICKS WHEN COMING TO A COMPLETE STOP.",
        "vin": "1GTP8DETXLZ"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/23/2020",
        "dateOfIncident": "09/21/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360829,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERYTHING WAS FINE FOR ABOUT 6 MONTHS AFTER HAVING PURCHASED VEHICLE AS NEW. THEN I GOT WARNING LIGHTS ASKING ME TO BOTH SERVICE THE PARKING BREAK AND SERVICE ESC WITH A WARNING THAT DRIVING WOULD BE COMPROMISED JUST OVER 60MPH. I NOTIFIED DEALER WHO SAYS THEY FIXED THE GLITCH BUT IT HAPPENED AGAIN. THE LAST TIME, MOST RECENTLY, I TRIED TO START THE TRUCK THE NEXT DAY AND ALL THE WARNING LIGHTS CAME ON. THIS WAS FOLLOWED BY A COMPLETE SHUT DOWN. NO ENGINE, NO LIGHTS - NOT EVEN LOCK/UNLOCK WITH KEY FOB. IT HAD TO BE TOWED. THIS IS A 2020 VEHICLE AND SEEMS LIKE IT WILL STRAND ME SOME PLACE AT THE VERY LEAST. AWFUL, EXPENSIVE, AND PERHAPS DEADLY DYNAMICS HERE. GMC, GET YOUR ACT TOGETHER. YOU OWE US IMMEDIATELY. PROVIDE THE FIX IMMEDIATELY OR GIVE ME MONEY BACK WITH NO CONTEST.",
        "vin": "1GTU9CED9LZ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/17/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355680,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "DISPLAY IS DANGEROUSLY TOO BRIGHT WHEN BACKING UP   CANNOT SEE TO BACK UP VEHICLE SAFELY",
        "vin": "3GTN9AEF7LG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/14/2020",
        "dateOfIncident": "09/14/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354972,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE DOES NOT START AND FLASHING VARIOUS CODES SERVICE JUST ABOUT EVERYTHING ON THE VEHICLE",
        "vin": "3GTU9DET5LG"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES,ENGINE",
        "crash": true,
        "dateComplaintFiled": "09/04/2020",
        "dateOfIncident": "05/22/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353198,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2020 GMC SIERRAS BRAKES FAILED ON MAY 22ND  AND ECM AND NOW THE ENGINE AND TRANSMISSION ARE EXPERIENCING ISSUES BASED ON THE ONSTAR REPORT.",
        "vin": "1GTR8CEK8LZ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/04/2020",
        "dateOfIncident": "03/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353254,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE NIGHT TIME BACKUP CAMERA IS REALLY BRIGHT AND BLURRY AND IT MAKES IT HARD TO SEE WHEN BACKING AT NIGHT",
        "vin": "3GTU9CED5LG"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/29/2020",
        "dateOfIncident": "08/29/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352041,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "PARKED TRUCK FOR ONE HOUR, ENGINE OFF. CAME BACK AND UPON STARTUP, RECEIVED MULTIPLE ERRORS THAT POWER STEERING AND ESC REQUIRED DEALER ATTENTION. BRAKE PEDAL WOULD DEPRESS TO FLOOR. GMC SIERRA 1500 ELEVATION TRIM",
        "vin": "3GTU9CED8LG"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/28/2020",
        "dateOfIncident": "08/24/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351746,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRONIC ABS BRAKE FAILURE WITH 73 MILES ON ODOMETER WHILE STOPPED AT RED LIGHT ALARM CHIMES SOUNDED AND POWER BRAKES WERE LOST. WARNING LIGHTS ON DASH ABS BRAKE FAILURE MULTIPLE ENGINE WARNING LIGHTS CAME ON.  DEALER SERVICE WAS PUZZLED NEEDED TO CONTACT GM TECHNICAL SUPPORT. FINAL OUTCOME THEY ARE REPLACING THE ELECTRONIC BRAKE MODULE.",
        "vin": "3GTU9AEFXLG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/12/2020",
        "dateOfIncident": "08/11/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348853,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 GMC SIERRA 1500. THE CONTACT STATED THAT THE VEHICLE WAS AT A STAND STILL IN A HOSPITAL PARKING LOT, WHEN THE STEERING WHEEL CEASED. THE CONTACT STATED THAT THE POWER STEERING ASSIST WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS NOT DRIVABLE. THE VEHICLE WAS TOWED TO LOCAL DEALER PHILLIPS BUICK GMC LOCATED AT 2160 US-441 #27, FRUITLAND PARK, FL 34731, (352) 728-1212, HOWEVER THE MECHANIC WAS UNABLE TO DUPLICATE THE FAILURE. THE VEHICLE HAD NOT BEEN REPAIRED AS OF YET. THE MANUFACTURER HAD NOT BEEN INFORMED OF FAILURE. THE FAILURE MILEAGE WAS 1,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/12/2020",
        "dateOfIncident": "08/12/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348905,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 550 MILES HAD TO TOW TO DEALER. THEY SAID NEEDED TO REPROGRAM TRANSMISSION. NOW AT 4000 MILES, WENT TO START AND VEHICLE WILL NOT DO ANYTHING. NO POWER. IT IS BEING TOWED TO DEALER AGAIN. PRETTY MUCH BOUGHT A LEMON AS IT LOOKS NOW.",
        "vin": "3GTP9EEL3LG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/30/2020",
        "dateOfIncident": "07/18/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342372,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY WAS DEAD IN THE GARAGE.   CALLED ROAD SIDE ASSISTANCE WHO JUMP-STARTED CAR.  CAR WOULD NOT GO INTO GEAR.  WE ROLLED IT OUT INTO DRIVEWAY WHERE IT SAT FOR 24 HOURS.  WHEN IT WAS LOADED FOR TRAVEL TO DEALERSHIP, IT CRANKED AND WAS DRIVEN UP ON WRECKER TRAILER LIKE IT HAD NO APPARENT PROBLEMS.  WAS CARRIED TO DEALERSHIP WHERE THEY RECHARGED AND CHECKED THE BATTERY AND RESET 14 DIFFERENT CODES WHICH WERE LOST WITH THE LOW VOLTAGE.",
        "vin": "3GTU9DED8LG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/19/2020",
        "dateOfIncident": "07/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340264,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAND NEW TRUCK PURCHASED IN MAY 2020. VEHICLE WOULD NOT START ON 7/2/2020 AND A NEW BATTERY WAS PLACED IN THE VEHICLE. THE TRUCK WOULD NOT START AGAIN ON 7/17/2020 UNKNOWN REASONS...",
        "vin": "3GTU9FED8LG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/15/2020",
        "dateOfIncident": "07/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339633,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER VEHICLE SITS IDLE FOR A WHILE, THE VEHICLE MAKES A HIGH PITCH WHISTLING SOUND ON STARTUP THAT LAST FOR APPROXIMATELY MINUTE OF DRIVING.",
        "vin": "1GTR8CEK3LZ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/14/2020",
        "dateOfIncident": "06/10/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339260,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 GMC SIERRA STEERING ISSUES. LOSS OF COMMUNICATION BETWEEN MODULES. RESULTS IN LOCKED STEERING OR NO POWER STEERING ASSIST. HAPPENS RANDOMLY AT VEHICLE START UP. BEEN TO THE DEALER FOUR TIMES SO FAR. THE FIRST TWO WAS INFORMED THERE'S NOTHING WRONG WITH IT. REPAIRS ATTEMPTED, UPDATE SOFTWARE, ENGINE HARNESS REPAIR, AND STEERING MODULE REPLACEMENT.",
        "vin": "3GTU9AEFXLG"
    },
    {
        "components": "EQUIPMENT,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/24/2020",
        "dateOfIncident": "06/19/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330494,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "NAVIGATION STATES TO TURN RIGHT WHEN IT SHOULD BE LEFT OR VICE VERSA. THIS WAS A PROBLEM  ON THE 2016-2017 MODELS ALSO.  *TR",
        "vin": "3GTU9FET4LG"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/17/2020",
        "dateOfIncident": "05/21/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11329324,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 GMC SIERRA. THE CONTACT STATED THAT WHILE DRIVING AT 25 MPH, THE SYSTEM BRAKE FAILURE WARNING MESSAGE ILLUMINATED ON THE INSTRUMENT PANEL. ONCE THE WARNING LIGHT ILLUMINATED, THE CONTACT EXPERIENCED COMPLETE BRAKE AND STEERING FAILURE. THE CONTACT WAS ABLE TO STEER THE VEHICLE INTO A CURB TO SLOW DOWN THE VEHICLE AND AVOID A POSSIBLE COLLISION WITH ANOTHER VEHICLE. THE CONTACT STATED THAT HE HAD SUFFERED PAIN TO HIS LEFT SHOULDER BLADE AND LEFT KNEE; HOWEVER, HE DID NOT SEEK MEDICAL ATTENTION DUE TO COVID-19. AFTER EXPERIENCING THE FAILURE, THE CONTACT HAD THE VEHICLE TOWED TO DESERT SUN MOTORS, INC. (2600 N WHITE SANDS BLVD, ALAMOGORDO, NM 88310) WHERE THEY CLEARED THE SYSTEM'S COMPUTER AND INFORMED THE CONTACT THAT THEY FOUND NO DEFECTS WITH THE VEHICLE. UPON RETURN OF THE VEHICLE, HE EXPERIENCED ANOTHER BRAKE FAILURE AS THE CHECK ENGINE LIGHT ILLUMINATED WHILE DRIVING AT 55 MPH. DUE TO THE FAILURE, THE CONTACT WAS FORCED TO RUN A RED LIGHT AND DRIVE UP AN INCLINE IN ORDER TO BRING THE VEHICLE TO A COMPLETE STOP. THE VEHICLE WAS THEN TOWED SHAMALEY BUICK GMC (955 CROCKETT ST, EL PASO, TX 79922) WHERE IT REMAINED IN THEIR POSSESSION. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND A FIELD INSPECTOR WAS SENT TO INSPECT THE VEHICLE. THE CONTACT STATED THAT KNOW BRAKE FAILURE CODES WERE DETECTED. THE CONTACT STATED AFTER THE THIRD FAILURE THE VEHICLE WAS TOWED TO SHAMALEY GMC WHERE IT WAS AWAITING DIAGNOSIS.  THE VEHICLE HAD YET TO BE REPAIRED. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "1GTR8CEK8LZ"
    },
    {
        "components": "SUSPENSION,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/14/2020",
        "dateOfIncident": "06/12/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328737,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "HIGHWAY DRIVING ENGINE LIGHT STARTED FLASHING, RECEIVED CODES ON SERVICE ESC AND SERVICE PARKING BRAKE. TRUCK SEEMED TO LOOSE POWER TRANSMISSION STARTED SHIFTING VERY HARD, CRUSE DISENGAGED,LANE KEEP ASSIST STOPPED WORKING , BRAKES AND STEERING SEEMED TO ACT DIFFERENT . WHEN IGNITION WAS TURNED OFF LOUD NOISES FROM UNDER TRUCK SOUNDED LIKE BRAKES RELEASING WITH LOUD CLUNKING NOISE.",
        "vin": "3GTU9DED3LG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/27/2020",
        "dateOfIncident": "05/26/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326110,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "RUPTURED OIL COOLER LINE. DRAINING THE ENGINE OF OIL AND CAUSING LOCK-UP.  *TR",
        "vin": "3GTU9FEL7LG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/26/2020",
        "dateOfIncident": "04/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326057,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "CAN NOT SEE ANYTHING BACKING UP IN THE DARK BECAUSE OF BACKUP CAMERA. THE PICTURE ON THE SCREEN IS GRAINY AND WASHED OUT SO ALL YOU SEE ARE BLOBS OF NOTHING.  *TR",
        "vin": "3GTU9CED6LG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/10/2020",
        "dateOfIncident": "02/03/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324017,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE LIKE KEEPS COMING ON. CODE READING THE KNOCK SENSOR NEEDS TO BE REPAIR. SENSOR HAS BEEN REPLACE TWICE IN THE PAST THREE MONTHS.  *TR",
        "vin": "1GTP8CED9LZ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/30/2020",
        "dateOfIncident": "04/29/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322885,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "REVIEW CAMERA IS EXTREMELY BRIGHT WHEN BACKING. IT'S SO BRIGHT THAT A GLARE IS THROWN ONTO REAR WINDOW MAKING IT NEXT TO IMPOSSIBLE TO SEE OUT REAR WINDOW OR USE SIDE VIEW MIRRORS. I OFTEN REVERT TO TO OPEN DRIVERS DOOR AND LOOKING BACKWARDS THAT WAY. SOMEONE IS GOING TO GET RUN OVER AS YOU CANNOT SEE WHERE YOU ARE BACKING. VERY DANGEROUS!",
        "vin": "3GTU9BET2LG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "03/04/2020",
        "dateOfIncident": "03/03/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315961,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ABS SYSTEM  FAILED WHILE DRIVING DOWN THE ROAD CAUSING THE BRAKES TO LOCK UP AND CAUSED THE TRUCK TO SPIN OUT OF CONTROL NEARLY CRASHING INTO ANOTHER VEHICLE AND JUMPING OVER THE CENTER DIVIDE  INTO ONCOMING TRAFFIC.",
        "vin": "3GTU9DEL4LG"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/23/2020",
        "dateOfIncident": "02/22/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310853,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS GOING ABOUT 15 MILES PER HOUR WHEN SUDDENLY ALL THESE ERROR CODES STARTED POPPING UP, FIRST \"ESC MALFUNCTION\" THEN TRAILER BRAKE MALFUNCTION,STABILITRAK, STEERING ASSIST REDUCED, BRAKE SYSTEM FAIL, LIGHS JUST POP UP I DO FEEL LIKE THE TRUCK LOOSES SOME POWER FEELS MORE SLUGGISH, I TOOK IT TO DEALERSHIP, THEY RECALIBRATED THE BREAK SYSTEM AND STUFF, IT FIXED THE ISSUE TEMPORARILY, BUT THE LIGHTS KEEP COMING BACK, SOMETIMES I TURN THE TRUCK ON IN THE MORNING AND LIGHTS ARE GONE, THEN LATER ON I GET ALL THE ERROR CODES AGAIN WHILE DRIVING IT. IT STARTED 4 DAYS AFTER I PURCHASED THE TRUCK AND HAPPENS DAILY SINCE.",
        "vin": "3GTU9CED4LG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/19/2020",
        "dateOfIncident": "02/19/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310256,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 GMC 6.2 L V8 1500 4W SIERRA DENALI.   BOUGHT YESTERDAY NEW FROM DEALERSHIP.  TODAY, NOT EVEN 120 MILES AND  BRAKES MALFUNCTIONED.    I STARTED TRUCK WITH GMC APP.  GOT IN CAR WITH MY FAMILY AND AS I PULLED OUT OF PARKING STALL PUSHING ON BRAKES MET EXTREME RESISTANCE AND SLUGGISHLY CAME TO A STOP.   I PUT TRUCK IN PARK. SHUT  OFF AND TURNED BACK ON.   BRAKES STILL NOT FUNCTIONING.   'BRAKES' 'ABS' AND ICONS FOR TRACTION CONTROL AND CHECK ENGINE LIGHTS WERE ON.   AGAIN ATTEMPTED TO DRIVE.  DRIVING 20 MPH  WOULD TAKE GREATER THAN 50 YARDS TO STOP, WITH ME, 220# ATHLETIC MALE APPLYING FULL FORCE.     WARNING MESSAGE ALSO APPEARED 'BRAKE SYSTEM FAILURE MAX SPEED 62 MPH'.  NO IDEA WHERE 62 WAS FORMULATED.  ALSO SOME MESSAGE ABOUT TRAILER BRAKES CAME ON TOO.   NO TRAILER WAS ATTACHED. I SHUT TRUCK OFF.  30 MINUTES LATER STARTED, CHECK ENGINE LIGHT WAS ONLY LIGHT ON. BRAKES WORKED NORMAL.   WAS ABLE TO CAUTIOUSLY GET 3 MILES HOME.   THIS IS A POTENTIALLY FATAL FLAW.  AGAIN THIS TRUCK IS STRAIGHT OFF THE DEALERS LOT.  ONSTAR SENT EMAIL STATING 'ISSUE WITH ANTILOCK BRAKING SYSTEM, TAKE TO DEALERSHIP WITHIN 7 DAYS '.   SO BRAKE FAILURE IS A MAJOR ISSUE.  BUT ALSO A KNOWN BRAKE ISSUE AND THE COMPUTERS SAY STAY BELOW 62 MPH AND GET SERVICED WITHIN 7 DAYS ARE JUST AS WORRISOME.   A BRAKING ISSUE SHOULD INSTRUCT DON'T DRIVE AND HAVE TOWED   THANKS",
        "vin": "1GTU9FEL0LZ"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/17/2020",
        "dateOfIncident": "02/17/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309738,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "SMELL OF SMOKE STRONG IN THE CAB AND OUTSIDE HOOD OF TRUCK. ALSO HAVE SEEN SMOKE COMING FROM HOOD OF TRUCK. SMELLS LIKE BURNING ELECTRICAL OR PLASTIC",
        "vin": "3GTU9FET6LG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/14/2020",
        "dateOfIncident": "02/13/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309169,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS PARKED. ENTERED VEHICLE AND TURNED ON VEHICLE USING INTERIOR START BUTTON. VEHICLE WAS PUT IN REVERSE AND WAS BAKING WHEN ALL BREAK PRESSURE DISAPPEARED AND VEHICLE WAS ROLLING BACKWARD AND CAME TO A STOP BEFORE STRIKING ANOTHER VEHICLE AND CHILD. VEHICLE WAS PLACED IN PARK AND ESC FAILURE, TRAILER BRAKE FAILURE, TRACTION CONTROL FAILURE, POWER STEERING FAILURE AND DO NOT DRIVE ABOVE 62 MHP ALARMED ON THE DASH. VEHICLE WAS SHUT OFF AND ON 3 TIMES AND RESET FINALLY REGAINED SOME BREAK PRESSURE BUT CHECK ENGINE LIGHT CAME N. VEHICLE WAS TOWED TO TRENT GMC, NEW BERN  NC FOR SERVICE. SERVICE TOLD US IT HAD A RECALL. I WAS UNABLE TO LOCATE A RECALL FOR THIS ISSUE. THIS COULD HAVE ENDED VERY BAD. I AM NOT ASSURED THAT THE PROBLEM IS FIXED.",
        "vin": "3GTU9DED3LG"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/10/2020",
        "dateOfIncident": "02/10/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308116,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAND NEW TRUCK. STUCK AT THE GYM IN THE MIDDLE OF THE NIGHT TRUCK WONT START. THE INTERIOR LIGHTS, HEAD LIGHTS, AND RADIO WONT SHUT OFF. VEHICLE WONT START. I'M ASSUMING THE BATTERY WAS DRAINED BECAUSE INTERIOR LIGHTS, EXTERIOR LIGHTS, RADIO, WONT SHUT OFF. HAS TO BE SOME KIND OF ELECTRICAL MALFUNCTION. WAITING ON GM ROADSIDE.",
        "vin": "3GTP9EEL0LG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/05/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307331,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUCK RANDOMLY GETS STUCK IN PARK. CANNOT PUT IT INTO DRIVE, NEUTRAL OR REVERSE. THE CAR HAS BEEN AT THE DEALERSHIP SINCE JANUARY 27, 2020. GMC WONT SEND THEM THE PART, THE DEALSHIP BELIEVES IT MUST BE A PROBLEM WITH THE PART AND THEY ARE TRYING TO FIX OR REDESIGN THE PART BEFORE ITS SENT OUT. ALSO I WAS TOLD BY MY DEALERSHIP ANOTHER 2020 AT4 CAME IN WITH THE SAME PROBLEM. IT WAS TOWED TO THEM.",
        "vin": "3GTP9EEL4LG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/24/2020",
        "dateOfIncident": "01/24/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301704,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 GMC SIERRA 1500. THE CONTACT STATED THAT WHILE DRIVING AT 52 MPH, THE BRAKE PEDAL WAS DEPRESSED BUT WAS VERY FIRM. THE PARK BRAKE WAS ACTIVATED BUT FAILED TO EFFECTIVELY STOP THE VEHICLE. THE VEHICLE WAS COASTED TO A PARKING LOT AND WAS PUT IN PARK. THE BRAKE SYSTEM FAILURE LIGHT, THE ABS AND SEVERAL OTHER WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS TOWED TO THE BAKER BUICK GMC OF CHARLESTON DEALER, LOCATED AT 1621 SAVANNAH HWY, CHARLESTON, SC 29407) WHERE THE VEHICLE WAS KEPT FOR A DIAGNOSTIC TEST. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THE FAILURE WAS A KNOWN ISSUE AND REFERRED THE CONTACT TO THE DEALER. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 7,020.  THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/21/2020",
        "dateOfIncident": "01/21/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300894,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BACKUP CAMERA IS ENTIRELY TOO BRIGHT AT NIGHT.  IT IS NEARLY IMPOSSIBLE TO SEE THE MIRRORS DUE TO THE BRIGHTNESS",
        "vin": "1GTU9BED3LZ"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/15/2019",
        "dateOfIncident": "10/07/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289110,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MAKING RIGHT TURNS IN THE DARK THE HEADLIGHTS DO NOT CAST LIGHT TO THE RIGHT SO YOU CAN SEE WHERE YOU ARE TURNING. THIS IS ESPECIALLY A PROBLEM IN THE RURAL WITHOUT STREETLIGHTS IT IS TOTALLY BLACK FROM THE DRIVERS SEAT LOOKING OVER THE RIGHT SIDE OF THE HOOD OR OUT THE RIGHT WINDOW.",
        "vin": "1GT49WEY3LF"
    }
]