[
    {
        "components": "SERVICE BRAKES, AIR,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/17/2021",
        "dateOfIncident": "07/09/2021",
        "fire": false,
        "manufacturer": "Daimler Trucks North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444204,
        "products": [
            {
                "manufacturer": "Daimler Trucks North America, LLC",
                "productMake": "FREIGHTLINER",
                "productModel": "CASCADIA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "SHOW ABS NOT WORKING SERVICE REQUIRED ABS DETECTED INTERNAL PROBLEM,AND MAY NEED REPROGRAMMING OR REPLASEMENT STABILLY CONTROLS NOT WORKING SERVICE REQUIRED  Error CODE 520247  31  ERROR CODE 1810",
        "vin": "3AKJHLDR2LS"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "10/07/2021",
        "dateOfIncident": "07/07/2021",
        "fire": false,
        "manufacturer": "Daimler Trucks North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435928,
        "products": [
            {
                "manufacturer": "Daimler Trucks North America, LLC",
                "productMake": "FREIGHTLINER",
                "productModel": "CASCADIA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact state that the Detroit Assurance Safety System radar failed.  When the contact drove a Freightliner Cascadia at 65 to 68mph south on the New York state freeway howling two 48-foot trailers. The contact stated that the Detroit Assurance Safety System detected an object and locked the brake and steering pushed the tractor and trailers abruptly swing to the right causing the trailers Tai to whiplash. The contact was able to keep the unit from crashing into the guard rail and tipping over. The contact was able to press the camera button and the red light went off. The contact doesn’t remember the Freight liner Cascadia year truck he was driving the truck was put out of service. The contact also wanted to state that the Detroit Assurance Safety System radar failure occurred twice.",
        "vin": "1FUJHLDR5LL"
    },
    {
        "components": "EQUIPMENT,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "04/14/2021",
        "dateOfIncident": "04/14/2021",
        "fire": false,
        "manufacturer": "Daimler Trucks North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408007,
        "products": [
            {
                "manufacturer": "Daimler Trucks North America, LLC",
                "productMake": "FREIGHTLINER",
                "productModel": "CASCADIA",
                "productYear": "2020",
                "type": "Vehicle"
            },
            {
                "manufacturer": "WABCO USA LLC",
                "productMake": "MERITOR WABCO",
                "productModel": "MERITOR WABCO",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I DRIVE A 2020 FREIGHTLINER CASCADIA EQUIPPED WITH THE MERITOR WABCO ON GUARD COLLISION MITIGATION SYSTEM. THIS SYSTEM ROUTINELY SIGNALS AN IMPENDING COLLISION AND APPLIES THE BRAKES, SOMETIMES IN A VERY AGGRESSIVE WAY, FOR NO REASON WHATSOEVER. IT HAPPENS AT LEAST ONCE EVERY SINGLE DAY. THE SYSTEM TAKES COMPLETE CONTROL OF THE VEHICLE BRAKING SYSTEM AND THERE IS NO WAY FOR THE DRIVER TO STOP THE HARD APPLICATION OF THE BRAKES. I HAVE COMPLAINED TO MY LOCAL DEALERSHIP ABOUT THIS PROBLEM AND HAVE BEEN TOLD THAT ALL ON GUARD CMS SYSTEMS DO THIS OCCASIONALLY. I BELIEVE THIS SYSTEM IS UNSAFE AND MERITOR WABCO SHOULD BE COMPELLED TO FIX THIS ISSUE.",
        "vin": "3AKJGLDR9LD"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/26/2021",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Daimler Trucks North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398098,
        "products": [
            {
                "manufacturer": "Daimler Trucks North America, LLC",
                "productMake": "FREIGHTLINER",
                "productModel": "CASCADIA",
                "productYear": "2020",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 FREIGHTLINER CASCADIA EQUIPPED WITH BRIDGESTONE R284 TIRES, TIRE LINE: ECOPIA, TIRE SIZE: 295/75/R22.5, DOT NUMBER: 2572652. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 75 MPH, THE FRONT PASSENGER'S SIDE TIRE EXPERIENCED A BLOWOUT CAUSING THE DRIVER TO NEARLY LOOSE CONTROL OF THE VEHICLE. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE MANUFACTURER AND THE LOCAL DEALER VELOCITY TRUCK CENTERS LOCATED AT 13800 VALLEY BLVD, FONTANA, CA 92335, (800)673-0500 WERE NOTIFIED OF THE FAILURE, BUT NO ASSISTANCE WAS OFFERED. THE FAILURE MILEAGE WAS 60,000. VIN WAS UNAVAILABLE.*DT*DT",
        "vin": "3AKJHHDR0LS"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/20/2020",
        "dateOfIncident": "06/20/2020",
        "fire": false,
        "manufacturer": "Daimler Trucks North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329834,
        "products": [
            {
                "manufacturer": "Daimler Trucks North America, LLC",
                "productMake": "FREIGHTLINER",
                "productModel": "CASCADIA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MY TRUCK DRIVING ON THE HIGH WAY WITH 70 MILES PER HOUR. THE CLUTCH FAN KICK IN - CRUISE CONTROL AUTOMATICALLY CANCEL - GEAR IN AND OUT. RPM ROSE UP AND DOWN FAST FROM IDLE TO THE CURRENT SPEED. IT BROUGHT TO DEALER TWICE BUT THEY SAID MY TRUCK IS RUNNING FINE. THERE IS NO LIGHT COME ON. 1ST TIME TOOK TO DEALER AT 54000 MILE, 2ND AT 63000. NOW IT IS 70,000 MILES.  *TR",
        "vin": "3AKJHHDR5LS"
    },
    {
        "components": "UNKNOWN OR OTHER,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "05/27/2020",
        "dateOfIncident": "05/25/2020",
        "fire": false,
        "manufacturer": "Daimler Trucks North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326113,
        "products": [
            {
                "manufacturer": "Daimler Trucks North America, LLC",
                "productMake": "FREIGHTLINER",
                "productModel": "CASCADIA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC EMERGENCY BRAKING SYSTEM ACTIVATING WHEN IT SHOULD NOT BE. COMPANY SAYS TRUCK IS NOT SHOWING A BRAKING EVENT ON THEIR END EITHER THIS HAS HAPPENED ATOTAL OF 3 TIMES. THE TRUCKS LANE GUIDANCE SENSOR IS GOING OFF EVEN WHEN THERE'S NO LINE TO GUIDE IT AND THE TRACTION SENSOR COMES ON EVEN WHEN IT DOESN'T BREAK TRACTION.  *TR",
        "vin": "3AKJHPDV9LS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/04/2020",
        "dateOfIncident": "05/28/2019",
        "fire": false,
        "manufacturer": "Daimler Trucks North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323299,
        "products": [
            {
                "manufacturer": "Daimler Trucks North America, LLC",
                "productMake": "FREIGHTLINER",
                "productModel": "CASCADIA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE HAD SEVERAL FREIGHTLINERS FROM COLUMBIAS TO CASCADIAS, THEY ALL HAVE HAD ONE THING IN COMMON. THEY ALL LEAK WATER UNDER RAINY CONDITIONS. THE WINDSHIELD, THE DRIVER'S DOOR AS WELL AS THE DOOR ON THE SIDE OF THE AD SLEEPER. DOESN'T MATTER IF IN MOTION OR SETTING STILL IT LEAKS WATER. SAD PART IS I HAVE A 2020.  THIS TRUCK WAS ALSO PURCHASED WITH AN ADVANCE WARNING SYSTEM THAT WILL SELF APPY THE BRAKES TO SLOW THE TRUCK DOWN.  I HAVE HAD SEVERAL INSTANCE OF GOING OVER A BRIDGE WHERE THE TRUCK WILL MOMENTARILY BRAKE FOR NO APPARENT REASON. NOTHING IN FRONT OF ME OR TO THE SIDE.  THIS HAPPENS FOR A SPLIT SECOND BUT IS FUSTRATING.  THE OTHER, AND MORE IMPORTANT ISSUE HAPPENED ABOUT 4 MONTHS AGO WHILE TRAVELING DOWN THE HIGHWAY AT 65 MPH.  A VEHICLE WAS IN FRONT OF ME WHEN THE DRIVER STARTED SLOWING DOWN AND USED HIS TURN SIGNAL WHEN BEGINING TO EXT THE HIGHWAY.  I HEARD SEVERAL BEEPS ON THE DASH, THERE WAS AN AUDIBLE SOUND AND THE TRUCK WENT INTO A FULL EMERGENCY BRAKING CONDITION WHIHC INCLUDED THE TRAILER TOO. THE TRAILR STARTED TO FISHTAIL AND SKIDMARKS FROM THE  TIRES.  I TRIED TAPPING THE BRAKES SEVERAL TIMES BUT NOTHING CHANGED.  THE TRUCK SLOWED TO 20MPH AND BRAKES RELEASED.  THE TRUCK BEHIND ME PASSED ME ON SIDE WITH THE DRIVER GIVING ME THE BIRD. I HAD NO CONTROLL OVER WHAT HAPPENED!",
        "vin": "3AKJHHDR0LS"
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/10/2020",
        "dateOfIncident": "09/20/2019",
        "fire": false,
        "manufacturer": "Daimler Trucks North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309211,
        "products": [
            {
                "manufacturer": "Daimler Trucks North America, LLC",
                "productMake": "FREIGHTLINER",
                "productModel": "CASCADIA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD SEVERAL ISSUES ON MY NEW 2020 CASCADIA.  THE POWER STEERING BOX HAD AN EXTERNAL LEAK WHICH RESULTED IN A STEERING WHINE. THE DEALER REPLACED THE STEERING BOX WITH ONLY 24,000 MILES ON THE TRUCK. I ALSO HAD A ROAD CALL INVOLVING  A CHECK ENGINE AND STOP ENGINE LIGHT WHICH RESULTED IN A REPLACEMENT OF A CONTROL UNIT  AND TEMPERATURE SENSOR.  I AM STILL TRYING TO GET REIMBURSED FOR THIS REPAIR SINCE THE TRUCK IS STILL UNDER WARRANTY.  THERE HAS ALSO BEEN A DEF ISSUE CAUSING A LOSS OF POWER",
        "vin": "3AKJHHDR8LS"
    },
    {
        "components": "VEHICLE SPEED CONTROL,COMMUNICATION",
        "crash": false,
        "dateComplaintFiled": "04/04/2019",
        "dateOfIncident": "03/25/2019",
        "fire": false,
        "manufacturer": "Daimler Trucks North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193866,
        "products": [
            {
                "manufacturer": "Daimler Trucks North America, LLC",
                "productMake": "FREIGHTLINER",
                "productModel": "CASCADIA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 FREIGHTLINER CASCADIA. WHILE DRIVING WITH THE CRUISE CONTROL ENGAGED, THE VEHICLE UNINTENTIONALLY ACCELERATED. ALSO, THE CRASH WARNING ICON ILLUMINATED ALTHOUGH THERE WAS NO OBJECT IN FRONT OF THE VEHICLE. THE VEHICLE WAS TAKEN TO PENSKE TRUCK RENTAL (1405 GLENDALE AVE, SPARKS, NV 89431, (775) 359-6226) TO BE DIAGNOSED, BUT THE CAUSE OF THE FAILURES COULD NOT BE DETERMINED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURES. THE FAILURE MILEAGE WAS 4,766. CONTACT ALSO ALLEGED LOSS OF POWER STEERING ASSIST WHEN TURNING LEFT AT A LOWER SPEED THAT REQUIRED ADDITIONAL STEERING EFFORT.",
        "vin": "3AKJHPDV9LS"
    }
]