[
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/22/2022",
        "dateOfIncident": "03/18/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457775,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTO STOP enabled while stopped at a stop sign on an uphill incline, there is enough of a delay on restart that it lurches and jerks upon restart, cant be good for transmission and passengers. very much a nusiance.",
        "vin": "1GKKNXLS3LZ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/03/2022",
        "dateOfIncident": "01/03/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445956,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving, the power steering went out and a service power steering message appeared. I turned off the vehicle and waited a few minutes and when the car was turned on it went away and the power steering came back.",
        "vin": "1gkknkla1lz"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/08/2021",
        "dateOfIncident": "11/04/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439733,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I noticed for months it was downshifting hard but transmission department was backed up I scheduled in September for an appointment October 26 and that morning I received a call to reschedule because they were still behind and had another appointment for November 10th. The morning of the incident 1st it did not want to start it would only turn over. When it started the check engine light was on (I called service he asked if I could drive it and told me to bring it in). Within 10 miles of driving, the car started to slow down. When I pressed the gas the RPMs would go up but the car would not accelerate. I was on the interstate so I started to coast to the side. When I got to the other side of the rumble tracks the fuel gauge warning came on saying no fuel (even though I had half a tank which was verified through the service department) and the car came to an abrupt stop. Had I not gotten over when I did the car would have stopped on the highway. I tried to turn it on to move it farther off the road and it would not. It started to just turned over like it did when I originally tried that morning (all over the occurrences happened while I was on the phone with Adrienne who i contacted through the gm help line).",
        "vin": "1GKKNMLS2LZ"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "09/29/2021",
        "dateOfIncident": "10/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434839,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The vehicle was purchased brand new from Serra GMC in Washington Michigan in April 2020.  It has been back to the dealer 5 times for the same issue, with another 4 times that it was not taken into dealer! Reoccurring issue involves the instrument cluster, All gages and visual indicators go to zero (speed, tach, fuel, temp, etc...) as well as getting a notification that the traction control is disabled, the ABS is disabled, cruise is disabled, and other electronic aid.  This happens at highway speeds and to loose all function is a safety concern, it is not repeatable and happens randomly but it is the same issue.  The dealer claims to fix the issue but it always comes back.   GM has told me to accept the issue as its not detectable however this is unacceptable as it puts my family at risk.  I have videos of the instrument cluster going to zero but its to big to attached - I can provide it if you contact me or tell me how to share it",
        "vin": "1gkknkla5lz"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/29/2021",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434897,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 GMC Acadia. The contact stated that while driving at various speeds, the brake was applied independently. The contact mentioned that the brake was operating when there was nothing in front of the vehicle. The vehicle was taken to a dealer where the cause of the failure was undetermined.  The failure recurred several times. The vehicle was not repaired. in addition, the accelerator pedal was depressed, and the vehicle started slowing inadvertently. The contact stated that the vehicle was locked and needed to be in the park to operate however, once the accelerator pedal was depressed the failure recurred. The vehicle was towed to an independent mechanic. The mechanic experienced the failure with the vehicle. The vehicle was towed to the dealer however, a diagnostic test was not performed. The manufacturer was notified of the failure and provided a case number. The approximate failure mileage was 16,000. The VIN was not provided.",
        "vin": ""
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": true,
        "dateComplaintFiled": "08/11/2021",
        "dateOfIncident": "08/07/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11428646,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 GMC Acadia. The contact stated that she was rear-ended by another vehicle at a high rate of speed while attempting to make a left turn. As a result, the front passenger seat fractured. The air bags failed to deploy upon impact; the contact hit her head and was knocked unconscious during the incident. The contact was taken to the hospital by ambulance and was treated for a hematoma on her forehead above her right eye. Her husband, who was driving the vehicle, was later treated for muscle pain in his back. A police report was filed at the scene. The vehicle was towed from the scene to an independent mechanic where it remained in their possession. The dealer nor the manufacturer had to be notified of the failure. The contact stated that the vehicle sustained significant damage; however, it had yet to be examined or deemed a loss. The vehicle had yet to be repaired. The failure mileage was approximately 10,000.",
        "vin": "1gkknkla1lz"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/18/2021",
        "dateOfIncident": "07/18/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425365,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The backup and surround view cameras repeatedly fail. I took it in once and they replaced the head unit. The problem reappeared within days after this repair. The design of this truck makes visibility without the cameras difficult at best and dangerous at worst.",
        "vin": "1GKKNXLS6LZ"
    },
    {
        "components": "AIR BAGS,STRUCTURE,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "06/07/2021",
        "dateOfIncident": "06/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419981,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The ACADIA 2020 while in slow motion approaching my private condominium parking spot, accelerated autonomously and then slammed into the cement wall. Airbags deployed, no warning of collision, seriously damaged both car and cement wall. No bodily injuries. I researched the possible cause coded P2138 which involves the drive by wire sensors which connect the throttle pedal and the CPU that controls the mechanical throttle gas system. That might be the cause of the autonomous acceleration like explained about the P2138 sensors issues.",
        "vin": "1GKKNPLS9LZ"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/05/2021",
        "dateOfIncident": "03/26/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406466,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING AT HIGHWAY SPEED AND HAD A CATASTROPHIC LOSS OF AIR SUDDENLY AND WENT FROM 40PSI TO 0 PSI IN ABOUT 15 SECONDS. OCCURRED ON PASSENGER SIDE REAR. UPON INSPECTION OF TIRE NOTHING WAS FOUND IN EVIDENCE TO HAVE CAUSED THIS FAILURE. TWO DIFFERENT AGENCY'S EXAMINED TIRE AND SAID IT WAS IRREPARABLE.  IN DOING SOME RESEARCH ON THIS FOUND THAT THIS BRAND OF TIRES - CONTINENTAL CROSS XL SPORT CROSS CONTACT MODEL HAS BEEN INVOLVED WITH A RECALL FOR OVER CURED TIRES CAUSING SUDDEN LOSS OF AIR. BOTH THE DEALER AND GM STATED THAT OUR TIRES ARE NOT INCLUDED IN THIS RECALL. WE WERE DRIVING ON THE PARKWAY AND HAD NOT HIT ANYTHING OR RAN OVER ANYTHING TO CAUSE THIS. WE FEEL THAT THESE TIRES SHOULD BE ALSO PART OF RECALL. WE ARE REPLACING THE OTHER THREE TIRES ON THE VEHICLE AS WE DO NOT FEEL SAFE DRIVING WITH THOSE TIRES.",
        "vin": "1GKKNULS1LZ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/24/2021",
        "dateOfIncident": "03/24/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404611,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL GAUGE READS AT 3/4 OR 1/2 TANK AFTER REFILLING FUEL.",
        "vin": "1GKKNKLA4LZ"
    },
    {
        "components": "ELECTRICAL SYSTEM,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/15/2020",
        "dateOfIncident": "11/10/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383475,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAND NEW VEHICLE.  PURCHASED ON 10/30/2020. FRONT COLLISION KEEPS FLASHING A RED LIGHT IN THE TOP OF DASH THAT SHOWS UP IN WINDSHIELD.  THIS HAPPENS WITH NO OTHER VEHICLES ON THE ROAD AT RANDOM TIMES.  WHEN THE VEHICLE NEEDS TO STOP OR WARN YOU IT WILL NOT.  IT WILL JUST LET YOU HIT A PEDESTRIAN OR ANOTHER CAR.  WE NOTICED THAT THE SAME THING IS HAPPENING WITH THE REAR SAFETY CROSS TRAFFIC.",
        "vin": "1GKKNLLS8LZ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/02/2020",
        "dateOfIncident": "09/07/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375533,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 GMC ACADIA. CONSUMER WRITES IN REGARDS TO LOSS OF POWER AT LOW SPEEDS AND JERKING WITH BRAKE LIGHT ILLUMINATED. *LD *JS",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/07/2020",
        "dateOfIncident": "08/06/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343838,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN MOTION- BLIND SPOT SENSORS TURN ON WHEN THEY SHOULD NOT AND VICE VERSA. TRACTION CONTROL HAS FAILED MULTIPLE TIMES WHILE DRIVING. PREDICTIVE BRAKING HAS ACTIVATED IMPROPERLY MULTIPLE TIMES WHILE DRIVING. CAMERAS WENT OUT AND THEN BATTERY COMPLETELY DIED. WAS TOLD FIXING BATTERY WOULD FIX VEHICLE. THIS HAS PROVEN TO BE UNTRUE. VEHICLE IS CURRENTLY IN FOR SERVICE FOR THIRD TIME.  REMAINS UNDER WARRANTY, AS I HAVE HAD IT THREE MONTHS. MOST RECENT DATE HAS BEEN USED BUT I'VE HAD PROBLEMS SINCE LITERALLY THE FIRST FULL DAY I HAVE HAD IT.",
        "vin": "1GKKNPLSXLZ"
    },
    {
        "components": "SEAT BELTS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/15/2020",
        "dateOfIncident": "07/07/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339516,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "SQUEAKING NOISE FROM THE FRONT END DRIVER SIDE JUST APPEARED WHILE DRIVING.   DRIVER SEATBELT WILL NOT LATCH ON THE FIRST COUPLE OF TRIES.",
        "vin": "1GKKNKLS3LZ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/14/2020",
        "dateOfIncident": "05/11/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324506,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE VEHICLE IS ALREADY IN MOTION, IT AUTOMATICALLY SHIFTS OUT OF DRIVE AND I AM LEFT IN THE MIDDLE OF THE ROAD UNABLE TO ACCELERATE FOR A FEW SECONDS UNTIL THE VEHICLE AUTOMATICALLY SHIFTS BACK TO DRIVE. THIS HAPPENS AFTER PULLING OUT OF MY GRAVEL DRIVEWAY WHICH IS A SLIGHT INCLINE, AND ONTO A HIGHWAY. THE CAUSE IS UNKNOWN.  *TR",
        "vin": "1GKKNMLSXLZ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/03/2020",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315892,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 GMC ACADIA. THE CONTACT STATED THAT WHILE DRIVING AT 15 MPH, WITHOUT WARNING THE PARKING BRAKE ENGAGED INDEPENDENTLY. THE CONTACT MANUALLY RELEASED THE PARKING BRAKE AND THE VEHICLE OPERATED AS INTENDED. DEALER RUSTY WALLACE KIA LOCATED AT (300 KING AVE, MORRISTOWN, TN 37814, (800) 458-0302) WAS CONTACTED AND INFORMED OF THE FAILURE. AN APPOINTMENT WAS SCHEDULED TO HAVE THE VEHICLE DIAGNOSED WHICH WAS STILL PENDING. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE, BUT NO FURTHER ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS APPROXIMATELY 6,276.",
        "vin": "1GKKNXLS0LZ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/28/2020",
        "dateOfIncident": "01/28/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302521,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ALONG NO ISSUES, CAR SAYS 60 MILES TO EMPTY NO FUEL WARNING LIGHT OR ANYTHING, WHEN CAR JUST SUDDENLY LOSES POWER, WAS ABLE TO GET TO SIDE OF ROAD. TOLD ME TO RESTART ENGINE, AND IT WOULDNT FIRE BACK UP. PUT A GALLON OF GAS IN AND IT FIRED BACK UP. OWNED CAR FOR ALMOST 3 WEEKS CANT BELIEVE THERE WAS NO INDICATION FUEL WAS APPARENTLY THAT LOW. 60 MILES TO EMPTY SHOULD HAVE BEEN ABLE TO FINISH THE 2 MILES I HAD ON MY DRIVE TO WORK AND TO GET GAS.",
        "vin": "1GKKNLLS4LZ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/07/2020",
        "dateOfIncident": "12/18/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297709,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED NEW 2020 GMC ACADIA DENALI IN DEC 2019. VEHICLE WAS EQUIPPED WITH SEVERAL DEALER ACCESSORIES INCLUDE ROOF RAIL CROSS-BEAMS. THESE WERE NOT IN STOCK AT TIME OF PURCHASE AND RETURNED AFTER 1 WEEK TO INSTALL. AFTER PICKING UP THE VEHICLE ON MY DRIVE HOME, I HEARD A WHISTLING/HUMMING NOISE COMING FROM THE EXTERIOR AT ABOUT 30 MPH. AS I ENTERED THE HIGHWAY AND TRAVELING AT 65 MPH, THE NOISE WAS DEAFENING AND THE VEHICLE DID NOT HANDLE VERY WELL, VIBRATION IN THE STEERING. I IMMEDIATELY RETURNED TO THE DEALER AND DETERMINED THE NOISE WAS FROM THE ROOF RAIL CROSS-BEAMS. SERVICE TEAM THAT THERE COULD BE SOME NOISE BUT IT WOULD NOT AFFECT THE VEHICLE HANDLING. I HAD THEM REMOVED AND THE DRIVE HOME HAD NO ISSUES. BUYER BEWARE IF YOU ARE ONLY GETTING THE CROSS-BEAMS AS AN ADDED ACCESSORY AND WILL NOT UTILIZE TO CARRY ANY ITEMS, IE; KAYAK, BIKES, ETC.",
        "vin": "1GKKNXLS1LZ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/26/2019",
        "dateOfIncident": "09/07/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282399,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO DAYS AFTER PURCHASING A NEW 2020 GMC ACADIA I GET AN ERROR ON THE DISPLAY \"SD CARD REMOVED\" ALONG WITH VARIOUS OTHER ERROR MESSAGES.  DEALER TALKS TO GMC TECH LINE AND THEY ADVISE TO REPLACE RADIO.  RADIO WAS REPLACED AND ERRORS BEGAN SAME DAY I PICKED IT UP.  DEALER IS REPLACING RADIO AGAIN, BUT UNSURE IF THIS WILL FIX THE ISSUE.  THE VEHICLE DOES NOT WORK AS INTENDED AS WHEN YOU PRESS THE NAV BUTTON VARIOUS ERROR MESSAGES POP UP AND NAVIGATION DOES NOT WORK.",
        "vin": "1GKKNXLS3LZ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/26/2019",
        "dateOfIncident": "09/04/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282398,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY PURCHASED A 2020 ACADIA DENALI.  WHEN PARKING AT ANY INCLINE THE PARKING BRAKE AUTOMATICALLY TURNS ON.  DEALER IS NOT SURE WHY, BUT NO WHERE IN THE MANUAL DOES IT STATE THIS IS NORMAL.  TO DISENGAGE BRAKE VEHICLE HAS TO BE PUT IN GEAR WITH FOOT ON BRAKE TO TURN OFF. THE PARKING BRAKE SHOULD TURN OFF WHEN VEHICLE IS IN PARK WITH FOOT ON BRAKE BUT IT DOES NOT.  DEALER IS UNSURE OF ISSUE AND HAS AN OPEN CASE WITH GMC TO INVESTIGATE.",
        "vin": "1GKKNXLS3LZ"
    }
]