[
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/05/2022",
        "dateOfIncident": "01/05/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446376,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "When rolling to stop signs or red lights, the vehicle occasionally fails to downshift properly and will attempt to continue pushing the vehicle when trying to stop. On multiple occasions, the vehicle acts as if it cannot be stopped due to the transmission failing to downshift. One must aggressively apply the brakes to get the vehicle to come to a stop. Unable to have the vehicle checked out at a local dealer, due to being backed up for weeks when trying to have it looked at. No visual indication/warning is given when this happens. There is a current class action lawsuit for models up to 2019, but this needs to be extended to 2020 models as well, as multiple online forums discuss this issue being prevalent in newer models of the 8-speed transmission.",
        "vin": "1gtg5cen6l1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/07/2021",
        "dateOfIncident": "12/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387073,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE OWNER OF A 2020 CANYON SLE THAT WAS PURCHASED IN JUNE OF 2020.  THE VEHICLE HAS ABOUT 20,000 MILE ON IT CURRENTLY.  I HAVE BEEN EXPERIENCING A \"LAG\" ON ACCELERATION AFTER COMING TO A STOP.  THIS FEELS LIKE THE TRANSMISSION ISN'T DOWN SHIFTING ALL THE WAY.  AT TIME WHEN ACCELERATING FROM A STOP THE TRUCK WILL ACT AS IT IS IN A HIGH GEAR THEN SUDDENLY SLAM INTO A FIRST GEAR.  I HAVE TAKE MY TRUCK TO JESSUP GMC IN PALM SPRINGS AND THEY SAY THE TECH CAN NOT REPRODUCE THE PROBLEM.  THIS SOUNDS LIKE THE SAME ISSUE THE 2015-1019 MODELS HAVE IN REFERENCE TO BULLETIN: 18-NA-355 DATED AUGUST 2019",
        "vin": "1GTG5CEN5L1"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/03/2020",
        "dateOfIncident": "09/29/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362569,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M THE OWNER OF A NEWLY BOUGHT (6/5/2020 PURCHASED DATE) 2020 GMC CANYON. I TOOK MY TRUCK INTO THE DEALERSHIP AND COMPLAINED THAT I HAVE EXPERIENCED TRANSMISSION ISSUES WHEN DOWNSHIFTING OR ACCELERATING. MY MOST COMMON ISSUE IS 'SHUDDERING' WHEN THE TRUCK ACCELERATES AND SUDDEN 'JERKING' WHEN DOWNSHIFTING GEARS WHEN DRIVING UP AN INCLINE OR EVEN COMING TO A COMPLETE STOP. THE DEALERSHIP SAID THEY HAVEN'T HAD ANY PROBLEMS WITH THE 2020 CANYONS AND UNLESS IT READS A 'CODE' THERE'S NOTHING THEY CAN DO. GM SAID TELL THE CUSTOMER TO DRIVE IT AND WE WILL CALL IF WE GET ANY FURTHER INFORMATION. THIS IS A SERIOUS PROBLEM. I WAS DRIVING THE VEHICLE AND BECAUSE OF THE SUDDEN JERKING AND TRANSMISSION & OR  ENGINE ISSUES WITH THE VEHICLE THE RPMS REVED UP TO OVER 4500 RPMS AND I WAS STUCK OUT IN THE MIDDLE OF A LANE AND COULD NOT GO ANYWHERE. I HAD CARS AVOIDING ME SO THAT WAY THEY WOULD NOT HIT ME HEAD ON OR ON THE SIDE OF MY TRUCK. THIS IS A SERIOUS AND FATAL ACCIDENT WAITING TO HAPPEN AND THE ISSUE IS GM KNOWS ABOUT IT BECAUSE IT HAPPENED WITH THEIR 2015- 2019 COLORADO AND CANNON SERIES. DESPITE MANY COMPLAINTS AND NUMEROUS LAWSUITS ABOUT THESE SERIOUS ISSUES, THERE ARE CURRENTLY NO ONGOING INVESTIGATIONS REGARDING TRANSMISSION AND ENGINE DEFECTS FOR THESE VEHICLES WITHIN GM FOR THE 2020 CANON. I HAVE PAID ALMOST $50,000 FOR A VEHICLE THAT SHOULD HAVE A LEMON LAW PUT ON IT BECAUSE GM KNOWS THEY ARE PRODUCING BAD TRANSMISSION/ENGINES AND NOT DOING ANYTHING ABOUT IT. I ASKED GM CORPORATE AND THE LOCAL DEALERSHIP WHAT AM I SUPPOSED TO DO WHEN I'M IN ANOTHER SITUATION WHERE THE VEHICLE DOES NOT WANT TO GET IN GEAR AND IS SHAKING AND SHUTTERING AND JERKING AND REVVING UP THE RPMS AND THE NEXT TIME. I SAID I PROBABLY WOULDN'T BE SO LUCKY AS TO HAVING PEOPLE AVOID ME AND THEN ME AND MY DAUGHTER WIND UP IN A HEAD ON COLLISION AND WE DON'T MAKE IT OUT ALIVE.",
        "vin": "1GTG6DEH0L1"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "08/21/2020",
        "dateOfIncident": "07/13/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350607,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 GMC CANYON. THE CONTACT STATED THAT THE FORWARD COLLISION AVOIDANCE SYSTEM FAILED TO ACTIVATE. THE CONTACT STATED THAT THE FEATURE FAILED TO PROVIDE ANY WARNING THAT ANOTHER VEHICLE WAS STOP IN FRONT OF THE VEHICLE OR SLOWING DOWN. THE VEHICLE WAS TAKEN TO GATES GMC BUICK NISSAN (143 BOSTON POST RD, NORTH WINDHAM, CT 06256, WHERE A ROAD TESTING WAS PERFORMED. THE TECHNICIAN DUPLICATED THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED A CASE NUMBER. THE FAILURE MILEAGE WAS APPROXIMATELY 2,000.",
        "vin": "1GTG6EEN5L1"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/26/2020",
        "dateOfIncident": "05/21/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326064,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 GMC CANYON WITH 774 MILES SUFFERED AN ELECTRICAL FAILURE RESULTING IN THE VEHICLE LOSING ALL POWER WHILE TRAVELING AT ABOUT 25 MPH. THE BATTERY CABLE CONNECTION CAUSED MELTING OF ADJACENT COMPONENTS. AS IT WAS HAPPENING, THE DASHBOARD SHOWED A \"BATTERY SAVER ACTIVE\" MESSAGE FOLLOWED BY A \"SERVICE BATTERY CHARGING SYSTEM.\" THE VEHICLE HAD TO BE TOWED TO A NEARBY DEALER. THE PROBLEM APPEARS SIMILAR TO RECALL N192273510 FOR THE GMC SIERRA.*DT*JB  *TR",
        "vin": "1GTG5CEN6L1"
    }
]