[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/11/2020",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374172,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "IMAGINE",
                "productYear": "2020",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Lionshead Specialty Tire & Wheel LLC",
                "productMake": "LIONSHEAD",
                "productModel": "RADIAL ST",
                "productYear": "9999",
                "size": "225/75R15",
                "type": "Tire"
            }
        ],
        "summary": "OUR PASSENGER SIDE REAR TRAILER TIRE BLEW OUT ON OUR 2020 IMAGINE 2800BH. THIS WAS A LIONSHEAD WESTLAKE THAT CAME ON THE TRAILER AND HAD ABOUT 4K MILES ON IT. PRESSURE WAS 80 PSI WHEN WE LEFT OUR SITE AND 88 PSI WHEN IT BLEW ACCORDING TO THE TPMS SYSTEM. OUR SPEED AT THE TIME OF THE FAILURE WAS 60MPH. I'M NOT SURE WHAT CAUSED THE TIRE TO FAIL BUT IT WENT OUT WITH A BANG AND THE TREAD SEPARATED FROM THE TIRE. THE TPMS NEVER INDICATED LOSS OF AIR OR OTHER ISSUE. I PULLED OVER IMMEDIATELY AFTER I HEARD THE BANG BUT THE DAMAGE WAS ALREADY DONE. I WENT OUT AND REPLACED ALL 4 TIRES WITH GOODYEAR ENDURANCE TIRES. IN DOING SO THE TECH AT THE SHOP FOUND ANOTHER TIRE THAT HAD BEGUN TO HAVE TREAD SEPARATION AS WELL.",
        "vin": "573TE3228L6"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/07/2019",
        "dateOfIncident": "06/30/2019",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229851,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "IMAGINE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING BACK FROM A FAMILY TRIP IN NEBRASKA ON 6/30/19. I NOTICED THAT THE TRAILER WAS PUSHING THE TOW VEHICLE TO THE RIGHT WHILE BREAKING HARDER THAN NORMAL. THIS HAPPENED MULTIPLE TIMES DURING OUR 4.5 HOUR TRIP HOME AND UPON ARRIVING AT OUR HOUSE IN LONE TREE, CO. I DISCOVERED THAT THE LEAF SPRINGS ON THE PASSENGER SIDE OF THE TRAILER HAD FLATTENED OUT. THE TRAILER IS 2 MONTHS OLD AND THE WEIGHT WAS MINIMAL AS NONE OF THE HOLDING TANKS WERE FILLED AND HALF OF THE CABINETS WERE EMPTY AS WELL AS EMPTY FRIDGE. I CONTACTED THE MANUFACTURER AND THEY AUTHORIZED REPLACEMENT OF SPRINGS. MY CONCERNS IS THAT THE MANUFACTURER IS USING SUB STANDARD PRODUCTS AND THIS CAN LEAD TO A TRAGIC ACCIDENT AT SOME POINT. I ALSO BELONG TO A FB GROUP OF IMAGINE OWNERS THAT HAS 12,500 MEMBERS AND THE TOPIC OF FLATTENED LEAF SPRINGS IS A DAILY OCCURRENCE. SOMEONE SHOULD BE LOOKING IN TO THIS BEFORE A TRAGIC ACCIDENT OCCURS THAT COULD OF BEEN EASILY AVOIDABLE BY MANUFACTURER USING BETTER QUALITY PRODUCTS AND OR HIGHER PRODUCT AS WELL.",
        "vin": "573TE2923L6"
    }
]