[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/05/2021",
        "dateOfIncident": "04/02/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406453,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2020",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CROSSCONTACT LX SPORT",
                "productYear": "9999",
                "size": "245/50 R 20 102H",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT'S WIFE OWNS A 2020 GMC YUKON EQUIPPED WITH CONTINENTAL TIRES, TIRE LINE: CROSSCONTACT LX SPORT, TIRE SIZE 245/50/R20. THE CONTACT STATED WHILE DRIVING 65 MPH, THE DRIVER'S SIDE FRONT TIRE EXPERIENCED A BLOWOUT. THE VEHICLE WAS TOWED TO DAVID BALES BUICK GMC (1327 JACKSBORO PIKE, LAFOLLETTE, TN 37766, 423) 562-8431) WHERE THE VEHICLE WAS STILL AWAITING A DIAGNOSTIC TEST. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 14,900.",
        "vin": "1GKS2DKC5LR"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "01/05/2021",
        "dateOfIncident": "10/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386660,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 GMC YUKON. THE CONTACT STATED WHILE REVERSING, THE BACK OVER PREVENTION CAMERA WAS OBSTRUCTED AND THE CONTACT WAS UNABLE TO SEE A PROPER IMAGE WHILE THE VEHICLE WAS IN REVERSE. THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER SHELTON BUICK GMC, INC. (855 S. ROCHESTER RD, ROCHESTER HILLS, MI 48307, (248) 266-2156) TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE CAMERA FUNCTIONED AS DESIGNED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 6,000.",
        "vin": "1GKS2AKC1LR"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/22/2020",
        "dateOfIncident": "06/21/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330175,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RENTED 2020 TAHOE WAS STATIONARY. A PASSENGER SITTING IN THE LEFT THIRD ROW SEAT BECAME STUCK IN THE SEAT BELT.  SHE WAS UNABLE TO OPEN THE SEATBELT CLASP AS IT GOT STUCK AND FAILED TO UNLATCH.  THE MORE THE PASSENGER STRUGGLED TO UNLATCH THE SEATBELT, THE  PROGRESSIVELY TIGHTER IT BECAME.  PASSENGER COULD NOT DISENGAGE THE SEATBELT CLASP BY PRESSING THE TINY RED BUTTON.  THREE OTHER PASSENGERS TRIED TO RELEASE THE SEATBELT AND COULD NOT.  PASSENGER WAS TRAPPED WITH TIGHT SEAT BELT HOLDING HER IN.  OTHER PASSENGERS CALLED EMERGENCY PERSONNEL WHO ALSO COULD NOT RELEASE THE EVER TIGHTENING SEAT BELT.  PASSENGER WAS RELEASED WHEN THE RANGER CUT THE SEAT BELT WITH A SEATBELT CUTTING EMERGENCY TOOL.  IT WAS A VERY SCARY AND DANGEROUS EXPERIENCE.   LATER, SOME OF OUR GUESTS FIGURED OUT THAT YOU HAVE TO PRESS THE TINY RED BUTTON ON THE LEFT LATCH WITH A PIECE OF THE RIGHT BUCKLE.  A PASSENGER SHOULD BE ABLE TO RELEASE THE SEATBELT BY DEPRESSING THE RED BUTTON.  A PASSENGER CANNOT EVEN REACH THE BUTTON FROM THE SEATED POSITION AS THE BUTTON IS TINY AND CANNOT ACCOMMODATE AN ADULT FINGER TO DEPRESS IT. THIS IS THE WORST EXAMPLE OF ENGINEERING I HAVE EVER EXPERIENCED. I AM FRANKLY AMAZED THAT THIS DESIGN PASSED ANY SAFETY TESTS.  PLEASE ADDRESS THE ISSUE BEFORE SOMEONE IS HURT OR KILLED BY BEING TRAPPED IN THE VEHICLE AND UNABLE TO ESCAPE.  *TR",
        "vin": "1GKS2BKC7LR"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/05/2020",
        "dateOfIncident": "12/31/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307294,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "LINE KEEP ASSIST NOT WORKING PROPERLY. ASSISTANCE SYSTEMS FOR PARKING OR BACKING NOT   WOKING PROPERLY. LANE CHANGE ALERT NOT WORKING PROPERLY",
        "vin": "1GKS1BKC7LR"
    }
]