[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/26/2022",
        "dateOfIncident": "03/26/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458449,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "First tire rotation the inside of both front tires have been worn down. Got tires rotated and alignment done. Second tire rotation and new tires have the same inside wear on them.",
        "vin": "Shhfk8g74lu"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/26/2022",
        "dateOfIncident": "03/26/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458452,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Clutch went out at 25k miles - never stalled this car. Have several manual transmission Hondas no problems except this one. Lost engine power and had to pull over on the highway. manufacturer error causing pre mature burnt clutch. This should not be happening. Honda will not take responsibility",
        "vin": "2HGFC3A54LH"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/02/2022",
        "dateOfIncident": "01/08/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454873,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The automated emergency braking system activated bringing me to a sudden and complete stop. I was traveling at a lower speed (<20mph) with sufficient space both in front and behind my vehicle which prevented this incident from becoming an accident. This occurred at night. The braking system automatically engaged as I was releasing my foot from the gas pedal to coast.  Should this happen at higher speeds or with traffic closer behind me, an accident could have happened. The system has not been inspected as of now and has not been reproduced or occurred a second time.   There have not been any warning lights, messages, or other issues with the car since I bought it brand new.",
        "vin": "SHHFK7G45LU"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/25/2022",
        "dateOfIncident": "07/17/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454071,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "On multiple occasions, the collision mitigation braking system has had false-positive detections.  There is one section of road where this occurs extremely frequently (maybe 20% of the time I drive through). On this section of road, it will not activate the brakes, it only beeps and displays \"BRAKE\" on the instrument cluster, but is extremely disconcerting and distracting.  On another occasion on a different road, there was clear road ahead of me when the collision mitigation braking system had a false detection, and did activate the brakes and was incredibly close to causing a collision with a car driving behind me. On this same stretch of road, Ive had this occur two other times (out of hundreds I've driven on it), but no one was behind me and would not have caused an accident.  In both of these spots, the road is fairly straight and the speed limit is 40 MPH.  This hasn't been inspected by a dealer.  This hasn't been inspected by Honda, the police, or insurance.  There were no prior warnings to this issue occurring.",
        "vin": "SHHFK7H85LU"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/25/2022",
        "dateOfIncident": "03/02/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454167,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Honda Civic equipped with a manual transmission. The contact stated while driving 60 MPH, the vehicle started losing motive power and was also shaking. Additionally, the clutch pedal was going to the floorboard. There were no warning lights illuminated. The contact was able to pull off to the side of the road. The contact was able to restart the vehicle; however, the vehicle failed to move while depressing the clutch pedal. The contact smelled a burning odor coming from the clutch. The vehicle was towed to the dealer where it was diagnosed that the manual clutch had burned out and needed to be replaced. The vehicle was taken to a second dealer - Moss Bros. Honda (27990 Eucalyptus Ave, Moreno Valley, CA 92555) where it was diagnosed that the clutch pedal needed to be replaced. The vehicle was then taken to a transmission specialist who took the transmission apart and provided the same diagnostic. The contact stated that the clutch pedal was replaced; however, the failure persisted and the transmission continuously independently jumped out of gear while driving. The vehicle was taken back to the transmission specialist where it was diagnosed that the transmission had failed and needed to be replaced. The vehicle was then taken back to the first dealer where it was diagnosed that the transmission needed to be replaced. The vehicle was repaired; however, the vehicle stalled while driving. The vehicle was towed to the first dealer but was not diagnosed or repaired. The contact also referenced NHTSA Campaign Number: 21V215000 (Fuel System, Gasoline). The manufacturer was notified of the failure but did not provide any assistance. The failure mileage was approximately 4,950.",
        "vin": "2HGFC1E50LH"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/24/2022",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453861,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The automatic braking system for my car went off in the middle lane of a 3 lane highway. luckily there was no cars driving around me so i was not hit. It sensed something and dropped my speed from 55 to 20 in a couple seconds throwing me forward. If not for my seatbelt and my arms my face could have hit the steering wheel. This happened multiple times.",
        "vin": "shhfk7h67lu"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/22/2022",
        "dateOfIncident": "02/19/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453522,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Warning light appeared on dashboard for obstructed radar sensor. Sensor was not obstructed. This was followed by additional warning lights that safety systems were malfunctioning, ACC, collision warning, automatic emergency braking systems are offline. Reported to local dealer.",
        "vin": "shhfk7g45lu"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/17/2022",
        "dateOfIncident": "02/10/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452366,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I hit a cow going 55mph on a state highway, and my airbags did not deploy.",
        "vin": "19xfc2f80le"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/17/2022",
        "dateOfIncident": "02/16/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452467,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving and the passenger air exploded.",
        "vin": "2hgfc2f67lh"
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/13/2022",
        "dateOfIncident": "02/12/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451743,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving down the road and all of a sudden I heard a large explosion and pulled back the moonroof visor a little and could see the glass was all spiderwebbed and closed it again, I was about 3 miles from home and had my 80+ mother in the car so I got home before looking at the damage and found a huge blow out of my Moonroof glass. Not sure if it was a stone or something that hit it or if it just blew out spontaneously, was a frightening situation.",
        "vin": "SHHFK7H69LU"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "02/07/2022",
        "dateOfIncident": "01/28/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11450791,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owned a 2020 Honda Civic. The contact's son was driving the vehicle at 30 mph and while making a right turn, the vehicle failed to turn to cause the driver to crash into a city bus head-on. The air bags on the driver's side and the passenger side did deploy but did not fully inflate. The contact's son and passenger were not taken to the hospital or received medical treatment. The contact's son later went to seek medical attention and was found to have suffered a concussion. The passenger in the front seat hit his head on the windshield and also did seek medical attention. The police were on the scene and filed a report. The vehicle was declared a total loss by the contact's insurance company. The vehicle was towed to an impound lot. The manufacturer had been informed of the failure. The failure mileage was approximately 10,000.",
        "vin": "19XFC1F7XLE"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/27/2022",
        "dateOfIncident": "01/26/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449142,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Honda Civic. The contact stated while driving approximately 65 MPH, the clutch became unresponsive which resulted in the vehicle losing motive power. The contact stated that there was no warning light illuminated. The contact pulled over and the vehicle was towed to the local dealer to be diagnosed. The contact was informed that the clutch needed to be replaced. The vehicle was not repaired. The manufacturer was informed of the failure but offered no assistance. The failure mileage was approximately 16,275.",
        "vin": "2HGFC1E51LH"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/25/2022",
        "dateOfIncident": "08/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448762,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Honda Civic. The contact stated the information center was slow to respond.  While driving at night, the screen went into daytime usage.  While utilizing the turn signal, the screen options were not available. The contact stated that the shocks and struts became inoperable. The vehicle was taken to the local dealer who diagnosed that the shocks needed to be replaced. The contact mentioned the mechanic broke the suspension while attempting to perform the repairs. The vehicle was repaired however, the contact continued to experience a failure. The manufacturer was notified however, no further assistance was provided. The approximate failure mileage was 9,000. The VIN was not available.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/16/2022",
        "dateOfIncident": "10/08/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447688,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "In early October 2021, my inforainment display screen stooped working. As a consequence, my rear view, and right side view cameras no longer show on the display screen. This has become a safety issue for me because I cannot see if other vehicles are in the right lane when I am planning to change to the right lane, or planning to make a right turn. Also, I can no longer rely on my rear view camera when I am trying to back out of a parking spot, or my driveway.  I took my car back to the dealer, and they told me that this HAS NOT been reported by other 2020 Honda Civic owners. They also told me that they need to order the part to repair it, but that it will take 2-6 weeks for the part to arrive. It has now been over 12 weeks and the part has not arrived. During the past 12 weeks, there were a few times where other drivers had to blow their horns at me as I tried to pass into the right lane. I have also had a few close encounters with pedestrians while I was backing out of a parking lot in shopping centers. Have any other 2020 Honda Civic owners reported problems with their infotainment display screens not working?  Thank you",
        "vin": "SHHFK7H63LU"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": true,
        "dateComplaintFiled": "12/23/2021",
        "dateOfIncident": "12/22/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11444790,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Stopped at a red light, I was rear ended by a car going 30-35 mph and pushed into the car in front of me. The driver seat was in a reclining position after impact, I was sitting up when hit and wound up laying almost to the back seat after impact but the airbag never deployed causing my stomach to hit the steering wheel.",
        "vin": "2hgfc2f62lh"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/13/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443597,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Honda Civic. The contact stated while driving at various speeds, the Forward Collision-Avoidance Automatic Emergency Braking erroneously activated causing the vehicle to abruptly stop. The contact indicated that the failure had occurred on eight separate occasions while driving between 5 and 65 MPH. The vehicle was taken to the local dealer however, the mechanic was unable to duplicate the failure. The vehicle was not repaired. The manufacturer was notified of the failure. The failure mileage was 7,000.",
        "vin": "19XFC1F77LE"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/07/2021",
        "dateOfIncident": "12/07/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442968,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Honda Civic. The contact stated that while driving at 60 MPH, the vehicle ahead of him attempted to make a right turn. Although his vehicle was at a safe distance from the vehicle ahead, the Forward Collision-Avoidance feature independently engaged, and the warning light illuminated on the instrument panel. The contact stated that the feature did not recognize that the vehicle was making a turn and that the abrupt stoppage could have caused a rear-end collision with the vehicle behind him. The dealer nor the manufacturer had yet to be notified of the failure. The vehicle had yet to be repaired. The failure mileage was approximately 12,300.",
        "vin": "2hgfc2f68lh"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/24/2021",
        "dateOfIncident": "09/08/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441572,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Honda Civic. The contact stated that while the vehicle was in park in the driveway idling and unattended with the emergency brake engaged, the vehicle rolled down the driveway and crashed into a tree.  There were no reported injuries, no police report, fire or air bag deployment. The vehicle was towed to an independent repair shop. The local dealer was not contacted. The vehicle was not diagnosed or repaired. The manufacturer was notified however no further assistance was provided. The failure mileage was unknown.",
        "vin": "SHHFK7G4XLU"
    },
    {
        "components": "TIRES",
        "crash": true,
        "dateComplaintFiled": "11/12/2021",
        "dateOfIncident": "10/30/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440209,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTI PRO CONTACT",
                "productYear": "9999",
                "size": "P235/45R17",
                "type": "Tire"
            }
        ],
        "summary": "The contact owned a 2020 Honda Civic equipped with Continental tires, Tire line:  Conti Pro Contact, Tire size: 235/40/R18, and DOT number: af2rwd3w. The contact stated while driving at 75 MPH,  the rear passenger side tire blew out suddenly which the vehicle started to drift to the right of the road and go over and crash into a medium near oncoming traffic. The contact was able to place a spare tire on the vehicle for the contact to continue to drive to their residence. The contact took the vehicle to an auto body shop that inspected the vehicle and declared the vehicle a total loss. The contact was concerned that the failure that occurred with the vehicle was a defect on the tire that had blown out. The tires were the original equipment on the vehicle The manufacturer was made aware of the failure. The failure mileage was 11,045.",
        "vin": "shhfk7g45lu"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/24/2021",
        "dateOfIncident": "09/15/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434154,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "EAGLE SPORT",
                "productYear": "9999",
                "size": "245/40/R18",
                "type": "Tire"
            }
        ],
        "summary": "Drivers rear side tire had a blow involving the tread flying off exactly at the seam it is attached to the tire.  This couldn't caused an accident or death to myself or other drivers on the road.  These tires were purchased on the vehicle brand new in Sept 19 2020.  The accident happened September 15 2021.  The vehicle is brand new as well.  The other Goodyear eagle sport tires on the vehicle had bubbles which would lead to another blowout.  The car has under 25k miles.  The car has had oil changes, etc per car doc agreement.  There is something wrong with the integrity of the rubber of the tire or they are retreading and  selling retreaded tires as new.  My son decided with the knowledge of the tire mechanic, to replace all Goodyear tires due to the safety hazard they could create.  He had to replace 3 tires.",
        "vin": "2HGFC2F85LH"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "09/10/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432484,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Honda Civic. The contact stated while driving at various speeds, the lane departure assist steered the vehicle into traffic or over the lines randomly due to a possible object being in the roadway. The beeping sound, visual detection, and lane departure message were displayed. The local dealer was not contacted. The vehicle was not diagnosed or repaired. The manufacturer was not notified of the failure. The failure mileage was 120. The VIN was not available.",
        "vin": ""
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "08/05/2021",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11427919,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Breaking mitigation or control system was defective, seat belt didn't work properly and involuntary breaking led to incident in which face hit the steering wheel, leading to injury. The problems were evaluated by the dealership but they denied there were problems, and there were not other parties that evaluated the car.  There were some warning lights that came on several weeks in advance of the involuntary breaking.",
        "vin": "2HGFC2F6XLH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/24/2021",
        "dateOfIncident": "07/21/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426313,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "My steering wheel was not aligned after multiple services. I also heard a weird sound coming from the left of the car. Moreover, I feel like the car is not even and pulling to the left. Therefore, I bought this car for about a year and I need to do alignment 3 times. It is strange because the new car cannot so many problems unless the car is lemon.",
        "vin": "19XFC1F35LE"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/16/2021",
        "dateOfIncident": "10/20/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425145,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Honda Civic. The contact stated while driving 40 mph, he heard an abnormal buzzing and grinding sound coming from underneath the vehicle. There were no warning lights illuminated. The vehicle was taken to the dealer who informed the contact that they could not duplicate the failure. The contact stated that the failure reoccurred while driving. The vehicle was taken back to the same dealer several times, but the dealer was not able to duplicate the failure. The vehicle was then taken to Curry Honda Chicopee (767 Memorial Dr, Chicopee, MA 01020) who informed the contact that they could not duplicate the failure. The vehicle was taken to an independent mechanic who test drove the vehicle and diagnosed that the abnormal sound was coming from the transmission at the main shaft bearing. The manufacturer was made aware of the failure and a case was opened. The vehicle was not repaired. The approximate failure mileage was 8,000.",
        "vin": "2HGFC1E50LH"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/12/2021",
        "dateOfIncident": "07/04/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424508,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving at roughly 6mph in a parking lot when my passenger side airbag randomly deployed. Resulted in shattered windshield, damage to dash, seat belts not working properly. Vehicle was not and has not been in any accident. No damage to the vehicle.",
        "vin": "2HGFC4B63LH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/05/2021",
        "dateOfIncident": "06/29/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423469,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "We purchased our 2020 Honda Civic Si on Jan 16, 2021 with 20 miles on the car. On June 29, 2021 while driving the car it failed to shift into 2nd/3rd. It stopped shifting altogether and we pulled off to see if stopping and starting may fix the issue. Apparently the clutch had blown out as the car wouldn’t even start. We had it towed up to Honda Dealership we purchased it from. They claim that the clutch “exploded” and wouldn’t cover it under warranty even though we have a power train warranty (and even an extended warranty). A clutch should not “explode” after less than 6,000 miles on a car. We drove in normal driving conditions. Online we see this issue repeated around.",
        "vin": "2HGFC1E58LH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/02/2021",
        "dateOfIncident": "05/08/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423251,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Twice within a one week period, some type of animal, most likely a rodent, ate through my power steering harness rendering all safety features on the car inoperable. The car was undriveable as the steering wheel could not be turned. The dealership advised that the wiring for this vehicle is made of soy which is a food source for animals. Honda is aware of this issue and now stocks rodent tape to use over the wires. Honda should not be building automobiles with soy based wiring. No other vehicle sin my lot were affected--just mine because it was a Honda. I have the harnesses from the dealership showing where they were chewed on. The dealership is aware of other customers with this same problem. It is most definitely a safety hazard. Wires that were not completely chewed through could fail while the car is operating causing injury and/or fatality. This issue has existed for several years with Honda and they have not changed their manufacturing. Class action lawsuits were necessary. These vehicles should be recalled for replacement of a power steering harness that is not made of soy. My complaint to Honda was given a case number, but I have not been provided any status even after calling for same.",
        "vin": "SHHFK7H9XLU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/21/2021",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421669,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact leased a 2020 HONDA CIVIC. The contact stated that while driving at various speeds, the instrument panel would intermittently display images over the speedometer which would obstruct his ability to see his current rate of speed. The contact had brought the vehicle to the dealer where they informed him to document the failure and tried multiple repairs; however, the failure persisted after each repair. The manufacturer was also notified of the failure and offered no assistance. The vehicle had yet to be repaired. The failure mileage was approximately 200.",
        "vin": "19xfc1f75le"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/09/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420369,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving on the freeway was downshifting from 6th gear to 5th gear and the shifter locked up snd i could not shift into any gears except neutral. At a high speed i had to coast to the shoulder of the freeway. Luckily i was near an exit. Once i was stopped i tried to turn off and turn the car back on but i still was unable to shift the car into any gear",
        "vin": "2HGFC1E51LH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/02/2021",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419289,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The clutch in my 2020 Honda Civic si started slipping at 8k miles. Please look into defects related to clutch/flywheel/CMC/transmission",
        "vin": "2HGfc1e50lh"
    },
    {
        "components": "PARKING BRAKE",
        "crash": true,
        "dateComplaintFiled": "06/02/2021",
        "dateOfIncident": "05/13/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419406,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Honda Civic. The contact stated while stationary, the vehicle rolled backwards and hit a wall. The contact stated that the vehicle was equipped with a manual transmission. Upon investigation, the contact associated the failure with the parking brakes. The vehicle was towed and diagnosed but not yet repaired. The manufacturer was informed of the failure but offered no assistance. The failure mileage was approximately 9,000.",
        "vin": "2HGFC1E56LH"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/01/2021",
        "dateOfIncident": "02/16/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419223,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Honda Civic. The contact stated while inspecting and changing the oil, he noticed an excessive gasoline smell within the oil. The vehicle was taken to the dealer where it was diagnosed, the dealer stated gas in the oil is normal and to bring the car back after driving around a thousand miles. The mechanic changed the oil. The vehicle was not repaired. The failure recurred. The vehicle was taken to the dealer to be diagnosed. The technician informed the contact that he would need to speak with the manufacturer for a further option for the repair. The manufacturer was contacted by the technician and was informed that the VIN was not under recall and that the vehicle was performing as designed. The contact stated that the vehicle had experienced the oil dilution failure. The contact referenced NHTSA Campaign Number: 21V215000 (Fuel System, Gasoline) as a possible solution to the failure however, the vin was not included. The manufacturer was notified of the failure and provided a case number 12258099 for the Vin [XXXXXX]. The mechanic confirmed oil level to be slightly elevated 12-14MM above full mark, tech contacted tech line re#4404999. Manufacturer stated within normal operating standards. The vehicle was not repaired. The failure mileage was approximate 11,000.  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).”",
        "vin": " SHHFK7H86L"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/14/2021",
        "dateOfIncident": "05/02/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416576,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONTACT OWNS A 2020 HONDA CIVIC. THE CONTACT STATED WHILE DRIVING AT AN UNDISCLOSED SPEED, THE MANUAL CLUTCH FAILED TO ALLOW THE VEHICLE TO SHIFT ABOVE 2ND GEAR WHILE ENTERING THE HIGHWAY. THE CONTACT REVVED THE ENGINE HOWEVER, THE VEHICLE FAILED TO ACCELERATE. THE VEHICLE WAS TAKEN TO THOUSAND OAKS HONDA (3925 AUTO MALL DR, THOUSAND OAKS, CA 91362, (805) 601-7301) TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE FLYWHEEL INSIDE THE CLUTCH WAS DAMAGED HOWEVER, THE PART FOR THE REPAIR WAS NOT AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND OPENED A CAUSE. THE CONTACT WAS INFORMED THAT THE FAILURE WAS CAUSED BY ABUSING THE CLUTCH. NO FURTHER ASSISTANCE WAS PROVIDED. THE APPROXIMATE FAILURE MILEAGE WAS 8,400.",
        "vin": "2HGFC1E52LH"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/10/2021",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415954,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR PASSENGER SEAT AIRBAG DOES NOT WORK WHEN I SIT IN THE SEAT. OUR  HONDA DEALER HAS SAID THERE COMPUTER DOES NOT SEE A PROBLEM WE DETERMINED THAT I MAY NOT MEET THE WEIGHT ALLOWANCE AS I WEIGH ABOUT 88-90 LBS. WE HAVE COMPLAINED TO THE AMERICAN HONDA MOTOR COMPANY AND WERE TOLD THEY WOULD GET BACK TO US BUT THAT WAS NEARLY A MONTH AGO.. ALL OTHER PEOPLE WHO HAVE SAT IN THE PASSENGER SEAT DID NOT EXPERIENCE THIS PROBLEM AND WE HAVE NOT RECEIVED CLEAR INFORMATION AS TO WHAT THE WEIGHT ALLOWANCE IS FOR THIS CAR. WHEN I SIT IN THE SEAT, THE AIRBAG LIGHT STAYS ON. I AM EXTREMELY CONCERNED ABOUT HONDA'S APPARENT INDIFFERENCE AS WELL AS THE LACK OF SAFETY I FEEL WHEN SITTING IN THAT SEAT. PLEASE LET ME KN OW IF YOU CAN FOLLOW UP ON THIS CONCERN FOR ME. THANK YOU.",
        "vin": "19XFC1F30LE"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/28/2021",
        "dateOfIncident": "01/20/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414355,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2020 HONDA CIVIC. THE CONTACT STATED WHILE DRIVING 60 MPH, SEVERAL UNKNOWN SAFETY FEATURES WOULD ACTIVATE AND DEACTIVATE INADVERTENTLY. THE CONTACT STATED SEVERAL UNKNOWN WARNING LIGHTS WERE ILLUMINATED. THE VEHICLE WAS TAKEN TO TONKIN GRESHAM HONDA (24999 SE STARK ST, TROUTDALE, OR 97060, (503) 667-7077) HOWEVER, THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE CONTACT WAS STILL AWAITING A RESPONSE. THE FAILURE MILEAGE WAS APPROXIMATELY 3,696.",
        "vin": "19XFC2F60LE"
    },
    {
        "components": "POWER TRAIN,VISIBILITY/WIPER,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "04/26/2021",
        "dateOfIncident": "04/04/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413922,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS 2020 HONDA CIVIC SI HAS BEEN NOTHING BUT TROUBLE.  FROM THE START I HAD THE WINDSHIELD CRACK ON ME FROM WHAT HONDA SAID WAS A TINY CHIP.  I WENT IN TO WORK WITH MY WINDSHIELD SEEMINGLY FINE ONLY TO COME OUT TO A SPIDER WEB SPLIT ALL THE WAY ACROSS THE WINDSHIELD.  HONDA WOULD NOT COVER CITING IT TO BE JUST AN 'ACCIDENT' AND I WOULD HAVE TO GET IT FIXED.  THE WINDSHIELD ABSOLUTELY HAD TO BE REPLACED WITH FACTORY OEM GLASS DUE TO SAFETY FEATURES WHICH WAS ON BACK ORDER SO I WAS FORCED TO DRIVE AROUND WITH A BROKEN WINDSHIELD FOR CLOSE TO 2 MONTHS.  COMPANY THAT INSTALLED GLASS SAID THIS IS BECOMING MORE 'NORMAL' SO TO SAY AS THE GLASS THEY ARE USING IS PAPER THIN IN HIS WORDS.  ON TOP OF THAT FROM DAY ONE OF OWNING THE CAR IT HAS THE 'SAFETY' FEATURE OF LANE KEEP ASSIST AND THIS FEATURE WILL LITERALLY PICK UP HEAVY SHADOWS ON THE ROAD FROM POWER LINES AND TRY TO CORRECT YOU AS IF YOU ARE DRIVING OUT OF A LANE!  COUNTLESS TIMES I HAVE HAD TO HURRY AND OVER RIDE THE ASSISTANCE JUST TO KEEP IT FROM MAKING ME RUN OFF THE ROAD!  HONDA SEVERELY NEEDS TO LOOK INTO THIS ON TOP OF THEIR UNSAFE THIN WINDSHIELDS WHICH CRACK FROM THE TINIEST OF PEBBLES HITTING THEM.  ALSO,  I JUST HAD TO REPLACE THE CLUTCH AND COMPONENTS IN THIS VEHICLE AFTER JUST 20K MILES AND LESS THAN A YEAR OF OWNING THE VEHICLE.  HONDA OFFERED NOTHING BUT A ONE TIME GOOD WILL ASSIST IN PAYING FOR PARTIAL LABOR AND PARTS.  THIS STARTED HAPPENING AFTER A NORMAL DRIVE TO WORK ONE DAY WHILE GOING UP A HILL THE CLUTCH STARTED SLIPPING.  MADE AN APPOINTMENT AND TOOK THE CAR IN AND WAS TOLD TO PUT ANOTHER 100 MILES ON THE CAR AND BRING BACK TO THEM ALTHOUGH THEY SAID THEY FOUND A TRANSMISSION LEAK AND NEEDED TO FIND THE SOURCE .  THIS WAS CERTAINLY VERY UNSAFE AS WHILE DOING THOSE 100 MILES THE CLUTCH COMPLETELY BURNT OUT AND I WAS LEFT STRANDED ON THE SIDE OF THE HIGHWAY AND I WAS PUT IN A DANGEROUS SITUATION.",
        "vin": "2HGFC3A59LH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/23/2021",
        "dateOfIncident": "04/22/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413484,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "HAS NOT BEEN TAKEN IN YET. HOWEVER THIS IS THE SECOND TIME I EXPERIENCED THIS... DRIVING HOME FROM WORK AT 7AM IN NYS, DOWN SHIFTED FROM 6TH TO 2ND GEARS IN REVERSE SEQUENTIAL ORDER TO USE ENGINE BRAKING. NOTICED AS I WAS GETTING OFF THE EXIT RAMP OF THE HIGHWAY, THAT MY CAR WOULD SHOOT UP TO 6K RPM TO BARELY GO 20 MPH... THIS CLUTCH IS A HUGE PROBLEM FOR ALL CIVIC SI THEY PUT THEM IN. THREE YEARS AGO HAD THE SAME ISSUE WITH MY 2017 CIVIC SI. WAS TOLD THAT IT WAS A WEAR ITEM AND WOULD NOT BE COVERED UNDER WARRANTY...",
        "vin": "2HGFC3A52LH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/05/2021",
        "dateOfIncident": "03/29/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406477,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TIRE START HAVE A BUBBLE AND I JUST DRIVE 18800 BUT NOBODY IN BOTH COMPANY HONDA AND FIRESTONE WANT TO WARRANTY FOR ME. I JUST BOUGHT NEW ONE TO REPLACE IT BECAUSE MY SAFETY. TOO MANY PROBLEMS WITH THE CAR RECENTLY.",
        "vin": "19XFC1F35LE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/12/2021",
        "dateOfIncident": "03/02/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402659,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MULTIPLE ROCK CHIPS CAUSING LARGE STARBURSTS AND CRATERS. LOTS OF OTHER SMALLER NICKS. I HAVE ONLY HAD THE VEHICLE JUST OVER 4 MONTHS. QUALITY AND INTEGRITY OF THE WINDSHIELD IS TERRIBLE. YES I LIVE IN HOUSTON AND YES I UNDERSTAND ROCKS AND THINGS WILL CHIP WINDSHIELDS BUT I HAVE HAD TWO OTHER HONDAS FOR THE LAST 6 YEARS AND NEVER HAD THIS ISSUE. I'M HAVING TO LOOK AT GETTING THE WINDSHIELD REPLACED DUE TO TWO MOST RECENT ONES HAVE BEEN IN THE DRIVER SIGHTLINE.",
        "vin": "2HGFC2F87LH"
    },
    {
        "components": "WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/10/2021",
        "dateOfIncident": "03/08/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400263,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THIS CAR ABOUT 6 MONTHS AGO. THIS IS NEW HONDA CIVIC 2020 AND IT HAVE 17000 MILES ON THAT NOW. I JUST HAD A FOUR WHEEL ALIGNMENT FOR THIS CAR. HOW COME THE NEW NEED WHEEL ALIGNMENT WHEN IT JUST ABOUT 17,000 MILES. I FEEL UNSAFE IF MY CAR WILL NEED WHEEL ALIGNMENT AGAIN.",
        "vin": "19XFC1F35LE"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/04/2021",
        "dateOfIncident": "02/24/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399120,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 24 FEB 2021, WHILE DRIVING DOWN A STATE ROAD AT ABOUT 50 MPH, MY MOONROOF SUDDENLY EXPLODED OUTWARD.  THE MOONROOF WAS CLOSED AT THE TIME OF THE EXPLOSION.  I HAD NOT PASSED UNDER ANY OVERPASS (DROPPED OBJECT), NOR WAS I PASSING OR HAD I BEEN PASSED BY ANOTHER VEHICLE (THROWN DEBRIS).  THE VEHICLE IN FRONT OF ME WAS OVER 200 YARDS AWAY.  WHEN THE MOONROOF UNEXPLAINABLY EXPLODED, MOONROOF GLASS WAS THROWN ACROSS MY ROOF AND TRUNK, SCRATCHING THE PAINT.    THE REPAIR BILL FROM MY LOCAL DEALERSHIP FOR JUST THE MOONROOF REPAIR WAS $976.66.      I FEEL THERE CAN BE NO OTHER EXPLANATION TO THE EXPLODED MOONROOF OTHER THAN SOME TYPE OF DEFECT WITH THE CAR.  THE GLASS EXPLODED OUTWARD, AND THE ENTIRE GLASS WAS SHATTERED.  IT WAS NOT A \"ROCK CHIP\" OR OTHER TYPE OF DAMAGE SINCE NOTHING ELSE WAS IN THE AREA.",
        "vin": "19XFC1F30LE"
    },
    {
        "components": "AIR BAGS,WHEELS,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "01/24/2021",
        "dateOfIncident": "05/12/2020",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11389634,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN A WRECK MAY 2020. I SWERVED TO MISS A DEER AND HIT A CONCRETE COLVERT, THE VEHICLE LAUNCHED AND MY AIRBAGS DIDN'T GO OFF. VEHICLE CAUGHT FIRE, MY MOTOR, TRANSMISSION, AND TIRES CAME OFF. I SUFFERED FROM SPINAL INJURY AND NERVE DAMAGE.",
        "vin": "SHHFK7H63LU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/16/2021",
        "dateOfIncident": "01/16/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388484,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR ELECTRONIC PARKING BRAKE FAILED WHILE IN PARK. THE VEHICLE HAD THE PARKING BRAKE ENGAGED, AND THE VEHICLE ROLLED DOWN A HILL INTO TREES, DAMAGING THE REAR BUMPER AND HATCH. THIS PARKING BRAKE ISSUE WAS ALSO DOCUMENTED ON EARLIER CIVIC MODELS FROM THIS GENERATION.",
        "vin": "SHHFK7G43LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/09/2020",
        "dateOfIncident": "12/05/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11382756,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE BLEW FROM UNKNOWN REASON IN SEPTEMBER 2020.  CAR PURCHASED IN JUNE 2020.  REPLACED TIRE IN SEPTEMBER FROM BROOKS HUFF.  TPM LIGHT IS NOW COMING ON AFTER A SCHEDULED ROTATION/OIL CHANGE.  BROOKS HUFF CHECKED PRESSURE OF ALL 4 TIRES AND LIGHT WAS RESET WITH CALIBRATION.  LIGHT CAME BACK ON SAME DAY.  TOOK TO HONDA DEALER ON 12/5 IN YORK PA AND WAS ADVISED TPM LIGHT WAS COMING ON DUE TIRE REPLACEMENT IN SEPTEMBER FROM A TIRE MANUFACTURED IN USA NOT FRANCE LIKE OTHER 3 TIRES.  DEALER IS SAYING BROOKS HUFF SHOULD HAVE KNOWN TO GET ANOTHER TIRE MADE IN FRANCE AND BROOKS HUFF IS SAYING THEY NEVER HEARD OF THAT.  SUCK WITH LIGHT COMING ON BECAUSE ONLY 10K MI ON CAR AND CAN'T AFFORD ANOTHER NEW TIRE AFTER 3 MO.",
        "vin": "SHHFK7H68LU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/17/2020",
        "dateOfIncident": "10/17/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364871,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING ALONG A FREEWAY ON A CLEAR DAY, IN FREE FLOWING TRAFFIC, THE ROAD DEPARTURE MITIGATION SYSTEM ENGAGED APPLYING THE BRAKES UNNECESSARILY, LIKELY DUE TO OLD LANE MARKINGS.    MY DASHCAM RECORDING SHOWS THE VEHICLE WAS IN NOT IN ANYWAY AT RISK OF DEPARTING THE LANE, OR THE ROAD AND THE SYSTEM ACTIVATING PUT MYSELF, AND OTHER DRIVERS AT RISK.",
        "vin": "SHHFK7H80LU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/12/2020",
        "dateOfIncident": "10/10/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364011,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD JUST PARKED MY VEHICLE ON A CITY STREET,  TURN THE VEHICLE OFF. I APPLIED THE ELECTRICAL EMERGENCY BRAKE. THEN MY PHONE RANG AND I TALKED ON MY PHONE FOR ABOUT FIVE MINUTES. I THEN GOT OUT OF MY VEHICLE  GRABBED MY BAG FROM THE TRUNK AND STARTED WALKING TOWARDS MY FRIENDS HOUSE. WHEN MY VEHICLES AUTOMATIC DOOR LOCKWAS AUTOMATED MY CAR STARTED TO ROLL FORWARD, IT STRUCK A VAN.",
        "vin": "SHHFK7G42LU"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/03/2020",
        "dateOfIncident": "09/28/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362495,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "HONDA DEALER AND HONDA USA TELL ME THAT MY WIFE (95LBS) IS NOT HEAVY ENOUGH TO ACTIVATE THE PASSENGER AIR BAG AND MAKE THE DASH INDICATOR GO OUT. THE OWNERS MANUAL SAYS (PG47) THAT THE WEIGHT TO ACTIVATE THE AIR BAG IS 65LBS. IS THIS A HONDA PROBLEM ?",
        "vin": "2HGFC2F62LH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/19/2020",
        "dateOfIncident": "09/19/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11359991,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN USING THE COLLISION MITIGATION SYSTEM IT WILL FALSELY DETECTS SHADOWS FROM BRIDGES OR TREES AS OBJECTS/VEHICLES IN THE ROAD AND SLAMS ON THE BREAKS. ADDITIONAL THE LANE DEPARTURE WILL TRY TO VEER OFF THE ROAD AT EVERY EXIT IF I AM IN THE RIGHT HAND LANE. BOTH THINGS HAPPEN WHILE DRIVING ON CITY STREETS AND THE FREEWAY. THIS HAS MULTIPLE TIMES TO THE POINT WHERE WE HAVE TURNED OFF THE COLLISION MITIGATION AND LANE DEPARTURE. THE LAST TIME IT HAPPENED WAS TODAY, 9/19/2020",
        "vin": "19XFC2F81LE"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/03/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353030,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "AS SOON AS I DROVE OFF THE LOT WITH MY BRAND NEW 2020 HONDA CIVIC LX WITH ONLY 13 MILES ON IT I IMMEDIATELY HEARD A THUD COMING FROM THE LEFT SIDE OF THE PASSENGER FRONT TIRE AS TIME WENT ON I STARTED HEARING CLICKING NOISES WHEN I WOULD TURN I TOOK THE VEHICLE IN FOR AN OIL CHANGE AND MENTIONED THE SOUNDA COMING FROM THE FRONT END AND THE DEARLY STATED THEY COULD NOT REPLICATE THE NOISE. I CONTINUED TO DRIVE THE VEHICLE AND THE SOUND HAVE BECOME MORE AND MORE FREQUENTLY NOTICEABLE I RETURNED IT TO THE DEALERSHIP AND WAS TOLD I NEED A NEW AXEL. NOW I AM TOLD I HAVE TO DRIVE IT FOR ANOTHER 10-15 DAYS LIKE THIS DUE TO A NATIONAL BACK ORDER I AM CONCERNED FOR MY SAFTY. THIS IS A BRAND NEW CAR THAT I AM INVESTING IN AND SHOULD NOT HAVE TO WORRY ABOUT ANY OF THESE SAFTY ISSUES WHILE I AM ON THE ROAD TO WORK.",
        "vin": "2HGFC2F67LH"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "09/02/2020",
        "dateOfIncident": "08/29/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11352742,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE TRAVELING EAST ON HWY 63 GOING HOME.  THE LANE DEPARTURE ASSIST CAME ON BUT WE WERE NOT OUT OF LANE.  WE KEPT TRAVELING A LITTLE FURTHER AND THE STEERING WAS STIFF.  WE WERE TRAVELING ABOUT 53 MPH AND THE CAR ALL OF A SUDDEN JERKED VERY SHARP TO THE RIGHT AND WE WENT OFF THE ROAD HITTING PARKED TRUCK AND FLIPPED IT.  THE WHEELS JUST TURNED THE RIGHT AND WOULD NOT LET US TURN THE WHEEL",
        "vin": "19XFC2F66LE"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/31/2020",
        "dateOfIncident": "08/30/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352385,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 HONDA CIVIC. THE CONTACT STATED THAT WHILE DRIVING 35 MPH, THE VEHICLE FAILED TO SHIFT FROM SECOND GEAR INTO THIRD GEAR. THE CONTACT STATED THE VEHICLE BEGAN TO DECELERATE AND WAS SHIFTED TO NEUTRAL UNTIL HE WAS ABLE TO PARK ON THE SIDE OF THE ROAD. THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS NOT DRIVABLE. THE VEHICLE WAS TOWED TO HONDA OF ANNAPOLIS LOCATED AT 1736 WEST ST, ANNAPOLIS, MD 21401, (443) 569-3477, AND WAS INFORMED THE VEHICLE HAD EXPERIENCED CLUTCH AND TRANSMISSION ISSUES. THE VEHICLE HAD NOT BEEN REPAIRED AS OF YET. THE MANUFACTURER WAS INFORMED OF FAILURE. THE FAILURE MILEAGE WAS 4,500.",
        "vin": "2HGFC1E56LH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/20/2020",
        "dateOfIncident": "08/18/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350366,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY CAR FROM BENICIA,CALIFORNIA TO SACRAMENTO AND 20 MINS AWAY FROM MY DESTINATION MY CAR WARNING LIGHTS ALL TURNED ON AND I WENT FROM GOING 70 TO ONLY BEING ABLE TO GO NO MORE THAN 15. GOT IT TOWED TO HONDA AND FOUND OUT MY HIGH PRESSURE FUEL PUMP WAS BAD. LOOK IT UP AND SEEN THAT MANY MORE CARS LIKE MINES HAD THE SAME PROBLEM",
        "vin": "SHHFK7H46LU"
    },
    {
        "components": "VISIBILITY,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/18/2020",
        "dateOfIncident": "06/18/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329664,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "(SUN) MOON ROOF SPONTANEOUSLY EXPLODED WITHOUT CONTACT FROM A FOREIGN OBJECT WHILE TRAVELING AT HIGHWAY SPEED. ADDITIONAL DAMAGE CAUSED TO ROOF & TRUNK EXTERIOR PAINT. NO POLICE OR ACCIDENT REPORT WAS FILED. CONTACTED DEALERSHIP FOR WARRANTY CLAIM AND THEY DIRECTED ME TO MY AUTO INSURANCE PROVIDER.  *TR",
        "vin": "2HGFC1E51LH"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/20/2020",
        "dateOfIncident": "01/11/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300526,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WAS BROKEN INTO WHILE PARKED IN A PUBLIC PARKING LOT. THE 2020 CIVIC HAS A FEATURE WHERE ALL WINDOWS ROLL DOWN IF YOU PUT THE KEY INTO THE DRIVER'S DOOR LOCK AND TURN IT TO THE RIGHT. ACCORDING TO HONDA OF OAKLAND SERVICE CENTER, SOMEONE USED A SCREWDRIVER TO ACTIVATE THIS FEATURE, WHICH IN TURN ROLLED THE WINDOWS DOWN AND THEY WERE ABLE TO ACCESS THE TRUNK LATCH NEAR THE DRIVER'S SEAT AND STEAL ITEMS FROM MY TRUNK. THEY WERE THEN ABLE TO ROLL THE WINDOWS BACK UP USING THE SAME FEATURE (TURNING TO THE LEFT) AND I WAS NOT AWARE THAT THERE WAS A BREAK IN UNTIL LATE THE NEXT DAY WHEN I WENT TO RETRIEVE ITEMS FROM THE TRUNK.     A RELATED FEATURE IS THAT THE KEY FOB ALLOWS YOU TO ROLL DOWN ALL WINDOWS SIMULTANEOUSLY BY HOLDING DOWN THE UNLOCK BUTTON. THIS FEATURE IS VERY SENSITIVE AND CAN BE ACTIVATED IN A POCKET OR PURSE. I TESTED OUT THE RANGE OF THE FEATURE AND WAS ABLE TO ROLL MY WINDOWS DOWN REMOTELY FROM OVER 200 FEET AWAY WHILE INSIDE A BUILDING WHEN MY CAR WAS PARKED OUTSIDE ACROSS THE STREET. I TWICE CAME BACK TO MY CAR WITH THE WINDOWS ROLLED DOWN DUE TO THIS FEATURE WITHOUT MY KNOWLEDGE.     THESE REMOTE WINDOW FEATURES POSE A SERIOUS SAFETY THREAT FOR CONSUMERS IN URBAN AREAS, ESPECIALLY SINCE THE DOOR FEATURE CAN EVIDENTLY BE ACTIVATED WITH JUST A SCREWDRIVER, AND THE KEY CAN BE ACTIVATED FROM HUNDREDS OF FEET AWAY. NOT ONLY CAN PEOPLE BREAK INTO MY CAR WITHOUT ANY EQUIPMENT, BUT IT IS NOT EVIDENT FROM THE OUTSET THAT A BREAK-IN OCCURRED BECAUSE THE FEATURE ALSO ALLOWS YOU TO ROLL ALL THE WINDOWS BACK UP REMOTELY. THIS MAKES THE MODEL AN EASY TARGET FOR FUTURE THEFT, AND I HAVE ALREADY HAD TO FILE A CLAIM WITH MY INSURANCE TO REPAIR THE MECHANICAL DAMAGE TO THE LOCK/DOOR RESULTING FROM THIS BREAK IN.",
        "vin": "19XFC2F69LE"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/09/2020",
        "dateOfIncident": "01/09/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298079,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CRASH MITIGATION ACTIVATED TWICE IN TWO DIFFERENT SITUATIONS ALMOST CAUSING ME TO GET REAR ENDED TWICE.  THE FIRST TIME WAS WHEN I WAS GOING THROUGH A ROUNDABOUT, THE CAR IN FRONT OF ME WAS A NORMAL CAR LENGTH AHEAD AS WE BOTH ENTERED THE CIRCLE.  THE CAR IN FRONT TURNED LEFT AND I WAS GOING STRAIGHT THROUGH.  AT THIS TIME THE CAR WAS OUT OF MY WAY AND IN THE TURN AND SUDDENLY MY CAR SLAMMED ON THE BRAKES ALMOST TO A COMPLETE STOP.  THE CAR BEHIND ME ALSO STOPPED ABRUPTLY AND NEARLY REAR ENDED ME.  MY LEFT HAND WAS RESTING ON THE WHEEL AND THE SUDDEN STOPPAGE MADE MY FINGERS CRUNCH UP INTO THE STEERING WHEEL FEELING LIKE A \"JAMMED\" FINGER.  THE SECOND TIME THE CRASH MITIGATION ACTIVATED WAS AT 0550 IN THE MORNING ON THE WAY TO WORK.  I WAS ENTERING A 4-WAY WITH NO VEHICLES IN FRONT OF ME.  I WAS APPROACHING THE INTERSECTION AT AROUND 25 MPH AND MIDWAY THROUGH THE INTERSECTION THE CAR SLAMMED ON IT'S BRAKES ALMOST TO A CLEAR STOP.  I DOWN SHIFTED AND WHEN IT RELEASED I PRESSED THE GAS AND ABOUT 2 SECONDS LATER IT ACTIVATED AGAIN.  THE VEHICLE BEHIND ME LAID ON HIS HORN IN ANGER THE ENTIRE TIME AS HE ALMOST HIT ME TWICE IN THAT EVENT.  THE 4-WAY I WAS APPROACHING HAD NO VEHICLES GOING THROUGH, HOWEVER THE RIGHT SIDE ENTRY HAD A VEHICLE STOPPED AT THE LIGHT AND THAT PARTICULAR SIDE IS ELEVATED AS IT COMES DOWN A SLIGHT HILL.  BOTH OF THESE EVENTS WERE TERRIFYING AND NOW I AM AFRAID THAT THIS VEHICLE WILL DO IT AGAIN AT ANY TIME WHEN I AM IN AWARE.  I FEEL THIS VEHICLE IN IT'S CURRENT STATE IS UNSAFE AND MY CONFIDENCE IN IT IS VERY LOW.  I DRIVE ABOUT 100 MILES EVERY DAY FOR WORK AND AM NERVOUS ABOUT THE CRASH MITIGATION SYSTEM CAUSING ME TO GET REAR ENDED.  I AM 43 YEARS OLD AND HAVE NEVER BEEN IN AN ACCIDENT AND NOW I'M FEELING IT IS NOT IF, BUT WHEN.  VERY UNSATISFIED WITH THIS PURCHASE NOW AND FEEL OTHERS MUST BE HAVING SAME ISSUES.",
        "vin": "2HGFC3A55LH"
    },
    {
        "components": "ELECTRICAL SYSTEM,WHEELS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/09/2020",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298098,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "OVER 4 WEEKS AGO, 2 WEEKS AFTER LEASING THE 2020 CAR, THE DASHBOARD STARTED TO DISPLAY NUMEROUS ERROR MESSAGES. THE CAR WAS EVALUATED AT THE DEALER, HONDA OF FREEHOLD, NJ, AND I WAS TOLD THAT A CERTAIN MODULE FAILED. SOON THEREAFTER A TIRE WARNING LIGHT ALSO STARTED TO DISPLAY AND ONCE AGAIN THE DEALER TOLD US NOT TO BE CONCERNED AS IT IS LIKELY AS A RESULT OF THE SAME MODULE. NOT TAKING THEIR WORD FOR IT, I BROUGHT THE CAR TO A COSTCO REPAIR SHOP AND A LARGE NAIL WAS DISCOVERED IN THE TIRE.     I'VE BEEN IN TOUCH WITH THE DEALER AND HAVE ALSO CALLED MANY TIMES TO THE CORPORATE OFFICES. THE SAME ANSWER WAS GIVEN ' THE PART IS ON BACK ORDER AND 'WE WILL CALL YOU WHEN WE GET IT'. NO ADDITIONAL INFORMATION OR SUGGESTION WAS GIVEN TO US.    IN THE MEANTIME, OVER 4 WEEKS LATER, ALTHOUGH THE CAR IS DRIVABLE NONE OF THE SAFETY FEATURES ARE OPERATIONAL AND I AM NOT SURE WHAT WARNING LIGHTS TO TRUST OR IGNORE.",
        "vin": "SHHFK7H80LU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/12/2019",
        "dateOfIncident": "11/29/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288738,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 HONDA CIVIC. WHILE DRIVING APPROXIMATELY 35 MPH AND ATTEMPTING TO ACCELERATE, THE VEHICLE SURGED FORWARD. THE CONTACT STATED THAT THE FAILURE OCCURRED TWICE. THE VEHICLE WAS TAKEN TO ATLANTIC HONDA (1375 SUNRISE HWY, BAY SHORE, NY 11706) WHERE IT WAS DETERMINED THAT THE FAILURE OCCURRED BECAUSE THE CONTACT DID NOT KNOW HOW TO DRIVE A STICKSHIFT VEHICLE. THE DEALER REPAIRED THE VEHICLE BY REPLACING THE CLUTCH PRESSURE PLATE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 2,500.",
        "vin": "2HGFC1E56LH"
    }
]