[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/05/2020",
        "dateOfIncident": "07/17/2019",
        "fire": false,
        "manufacturer": "Hino Motors Sales U.S.A., Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343440,
        "products": [
            {
                "manufacturer": "Hino Motors Sales U.S.A., Inc.",
                "productMake": "HINO",
                "productModel": "195",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 HINO 195. THE CONTACT STATED THAT WHILE DRIVING AT UNDISCLOSED SPEEDS, THE STEERING WHEEL PULLED TO THE RIGHT AND LEFT ON SEVERAL OCCASIONS. THE CONTACT ALSO STATED THAT THE STEERING WHEEL WAS NOT CENTERED. THE FAILURE RECURRED THREE TIMES ON THREE SEPARATE OCCASIONS. THE VEHICLE WAS TAKEN TO RUSH TRUCK CENTERS (8464 MIRAMAR RD, SAN DIEGO, CA 92126), AND WAS DIAGNOSED HOWEVER, THE MECHANIC WAS UNABLE TO DETERMINE THE CAUSE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 2,449.*DT*JB",
        "vin": "JHHHDM2H7LK"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/31/2020",
        "dateOfIncident": "02/05/2020",
        "fire": false,
        "manufacturer": "Hino Motors Sales U.S.A., Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319839,
        "products": [
            {
                "manufacturer": "Hino Motors Sales U.S.A., Inc.",
                "productMake": "HINO",
                "productModel": "195",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 HINO 195 BOX TRUCK WITH MORGAN 18' FRP BOX AND PALFINGER ILQ-22 ALUMINUM LIFT GATE.  BRAND NEW VEHICLE.  TRUCK SWAYS AT FREEWAY SPEEDS.  SWAY HAPPENS WHEN TRUCK IS UNLOADED AND WHEN TRUCK IS FULLY LOADED.    DEALER ACKNOWLEDGES THE SWAY BUT DOWNPLAYS THE SAFETY CONCERN & REPORTS THAT IT IS A CHARACTERISTIC OF THIS MODEL THAT CANNOT BE REPAIRED.    BOX DESIGN & LIFTGATE WAS ENGINEERED BY MORGAN TO FALL WELL WITHIN HINO SPECIFICATIONS.  ANECDOTALLY, TALKING TO OTHER MECHANICS, WE ARE FINDING THAT THIS IS AN ISSUE WITH THE HINO 195 LINE OF TRUCKS.  HINO & DEALER TAKE THE POSITION THAT IT IS A 'NORMAL' CONDITION.  BUT AS A OWNER OF MANY COMMERCIAL TRUCKS OF THIS TYPE FOR MORE THAN 25 YEARS, WE KNOW THAT THIS IS NOT A NORMAL CONDITION.  LIKELY THAT THE SPECIFIC BOX CONFIGURATION, WHILE IT IS WITHIN ENGINEERING SPECS, IS AGGRAVATING A PROPENSITY OF THE HINO 195 TO BE UNSTABLE AT FREEWAY SPEEDS.  WE FEEL THAT THIS IS LIKELY AN ISSUE WITH THIS ENTIRE LINE OF HINO 195 VEHICLES AND URGE THE NHTSA TO OPEN AN INVESTIGATION.    ## VIN PASSED ## 2020 HINO 195 ##",
        "vin": "JHHSDM2H2LK"
    }
]