[
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/10/2022",
        "dateOfIncident": "03/10/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456246,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I have had 2 occasions when I experienced inadvertent spontaneous braking. Both times there was no vehicle in front of me. Both times the car stopped completely while driving in the city between 25 to 35mph. Fortunately there was no vehicle behind me either time and I did not sustain any injuries.",
        "vin": "19XZE4F50LE"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/01/2022",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454646,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Honda Insight. The contact stated that while driving at various speeds, the brake engaged erroneously. The contact stated that the failure was intermittent. The contact stated that there was no object or vehicle nearby during the failure. The vehicle was driven to the dealer to be diagnosed; however, the vehicle remained at the dealer unrepaired. The manufacturer was not notified of the failure. The contact stated that he has not contacted the manufacturer. The failure mileage was 33,000.",
        "vin": "19XZE4F90LE"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/28/2022",
        "dateOfIncident": "02/16/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454585,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "In 3 instances the emergency braking system has activated when the car was being driven on the freeway and the lane was curving with no obstacles in front of the car in the lane but a semi truck in the next lane over in one instance and cars in the next lane over in the other instances.",
        "vin": "19XZE4F53LE"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/25/2022",
        "dateOfIncident": "10/23/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453970,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Two instances of braking system activating at highway speeds. In one instance, it was broad daylight, there was some traffic but nothing in my lane for a good distance, highway speed (approximately 65 mph) short sharp braking maneuver that dropped the speed approximately 10mph. I assumed there was some reflected light off of a sign that messed with the sensors, but the second instance was at midnight, same highway, same speed, no one else on the road.  In these instances, with light traffic, there was no danger to my safety but if this happens again under heavier traffic, it could conceivably cause someone to rear end the vehicle.   I have not been able to reproduce the problem.  There might’ve been a flash on the dashboard warning the system was activated, but I couldn’t say for sure.  Vehicle is available for inspection.",
        "vin": "19XZE4F51LE"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/22/2021",
        "dateOfIncident": "11/15/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441308,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact stated 2020 Honda Insight. The contact stated while driving approximately 4-5 MPH through a drive-thru, the cruise control set button was tapped and the speed increased to 25 mph without warning. The local dealer was not contacted. The vehicle was not diagnosed or repaired. The manufacturer was not notified. The failure mileage was approximately 2,800. The VIN was not available.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/05/2021",
        "dateOfIncident": "02/26/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399273,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE INTERSTATE WHERE SPEED LIMIT IS 70 MILES PER HOUR, I LOOKED IN MY REAR VIEW MIRROR AND SAW SMOKE COMING OUT OF THE BACK OF MY CAR. I THEN SAW WARNINGS FLASHING FROM MY DASH BOARD SAYING: AC MALFUNCTION, LKAS MALFUNCTION,AND THEN ANOTHER WARNING FLASHED SAYING - LOW OIL FLUID, STOP CAR DO NOT DRIVE. I COASTED CAR TO THE SIDE OF THE INTERSTATE AND GOT OUT OF VEHICLE AND CALLED TOWING SERVICE.",
        "vin": "19XZE4F59LE"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/03/2021",
        "dateOfIncident": "09/14/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398985,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "DAMAGE TO THE POWER STEERING LINKAGE CABLE AND OXYGEN SENSOR CAUSED ALL ADAS SYSTEMS TO BE OFFLINE INCLUDING POWER STEERING. IF THIS UNIT WERE TO BE DAMAGED JUST ENOUGH AND FAIL WHILE DRIVING THIS WILL LIKELY RESULT IN A CRASH/COLLISION AS THE CAR BECOMES COMPLETELY UNDRIVABLE. LUCKILY SO FAR, THIS HAS HAPPENED WHEN THE VEHICLE WAS PARKED AND DID NOT CAUSE ANY INJURY. I FEEL THE VEHICLE IS UNSAFE UNTIL THEY FIX THIS ISSUE. IT HAS HAPPENED 3 TIMES NOW AND NOTHING SEEMS TO BE BEING DONE ABOUT THIS ISSUE AS OF YET FROM HONDA. THIS WAS BROUGHT FORWARD TO HONDA'S ATTENTION WITH NO AFFIRMATION THAT THIS IS A PROBLEM. IT FIRST HAPPENED IN SEPTEMBER LAST YEAR AND HAS HAPPENED TWO ADDITIONAL TIMES SINCE.",
        "vin": "19XZE4F51LE"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "03/02/2021",
        "dateOfIncident": "02/27/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398680,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 HONDA INSIGHT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V771000 (ELECTRICAL SYSTEM, BACK OVER PREVENTION, VISIBILITY/WIPER, VISIBILITY, EXTERIOR LIGHTING). THE CONTACT STATED WHILE APPROACHING THE VEHICLE ON 3/1/2021, SHE NOTICED SOMEONE SLEEPING INSIDE THE VEHICLE. THE CONTACT STATED WHILE CALLING THE POLICE DEPARTMENT, THE PERSON GOT AWAY. A POLICE REPORT WAS FILED. THE CONTACT STATED HER ANTI-THEFT ALERT FAILED. THE CONTACT ASSOCIATED THE FAILURE WITH THE RECALL CAMPAIGN. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER VACAVILLE HONDA (751 ORANGE DR, VACAVILLE, CA 95687, (707) 449-5900) TO DIAGNOSED. THE RESULTS WERE STILL PENDING. THE MANUFACTURER HAD NOT BEEN INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS 3,126. Consumer was notified transmission needed to be replaced, vehicle is currently not a year old.",
        "vin": "19XZE4F57LE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/30/2020",
        "dateOfIncident": "12/28/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385705,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN PUTTING THE CAR IN REVERSE, THE CAR IS MAKING VERY LOUD 'DONG DONG DONG' NOISE. THIS ISSUE ALSO OCCURS WHEN THE CAR IS IN IDLE (STOP FOR THE TRAFFIC LIGHT). I AM NOT SURE IF THE NOISE IS FROM THE HYBRID SYSTEM, BUT THE NOISE MAKE ONE'S EARS VERY UNCOMFORTABLE.",
        "vin": "19XZE4F59LE"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/15/2020",
        "dateOfIncident": "09/07/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383531,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "~TL-THE CONTACT OWNS A 2020 HONDA INSIGHT. THE CONTACT STATED THAT WHEN ACCELERATE TO GO UP  A SMALL HILL, THE VEHICLE FAILED TO ACCELERATED. THE CONTACT STATED THAT THE VEHICLE STAY STOCK AT 40 MPH, THE CONTACT ALSO STATED THAT THE SPEEDOMETER BOUNCING UP AND DOWN 42-20 MPH, THE CONTACT STATED THAT THE VEHICLE TAKE 15 MINUTES TO GO UP ONE SPEEDOMETER. THE CONTACT CALLED HONDA OF HACKETTSTOWN, 48 US-46, HACKETTSTOWN, NJ 07840, AND INFORMED THEM OF THE FAILURE, THE DEALER INFORMED THE CONTACT TO SCHEDULE AN APPOINTMENT. THE CONTACT STATED ON ANOTHER OCCASION, THE CONTACT STATED WHILE PULLING OUT THE ROAD, A   FLICKER NOISE OCCURRED, THE VEHICLE STALLED. THE CONTACT STATED THAT SHE PUSHED THE START BUTTON TWO OR THREE TIMES TO ENGAGED THE ENGINE. THE VEHICLE WAS ABLE TO DRIVE. IN ADDITION, THE CONTACT ALSO STATED THAT THERE WAS FAILURE WITH THE RADAR SENSOR, IT BUILD UP  WITH SNOW CAUSING THE VEHICLE STALLED. THE VEHICLE WAS TAKEN TO MADISON HONDA, 280 MAIN ST, MADISON, NJ 07940, WHERE A TEST DRIVE WAS COMPLETED WITH THE CONTACT, AND WITH HER FOOT ON THE ACCELERATOR PEDAL THE VEHICLE FAILED TO ACCELERATE. THE CONTACT WAS INFORMED BY THE DEALER THAT THE VEHICLE BATTERY HAD TO BE ABOVE 50 DEGREE TO GET ENOUGH POWER WHEN THE WEATHER DROP.  THE VEHICLE WAS NOT REPAIRED. THE FAILURE RECURRED. THE CONTACT CALL BACK THE SAME DEALER AND WAS INFORMED THAT A CASE MANAGER WOULD CALL HER BACK. THE FAILURE RECURRED AND THE CONTACT MENTION SHE ALMOST GET HIT BY ANOTHER VEHICLE. THE VEHICLE WAS TAKEN BACK TO THE DEALER AND WAS INFORMED THAT THE SECOND ENGINE NEEDED TO BE CONNECTED TO THE FIRST ENGINE. THE DEALER WAS UNABLE TO FIND A FAILURE CODE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED A CASE NUMBER. THE FAILURE MILEAGE WAS APPROXIMATE UNKNOWN. AW*DT  CONSUMER STATED SHE DOES NOT DRIVE THE CAR ANYMORE.*JB",
        "vin": "19XZE4F90LE"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/11/2020",
        "dateOfIncident": "12/05/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383112,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VERY OCCASIONALLY THE CAR COLLISION AVOIDANCE SYSTEMS KICKS IN ERRATICALLY. THE CAR BRAKES AUTOMATICALLY TO REDUCE SPEED SUBSTANTIALLY. THIS CAN BE VERY DANGEROUS BECAUSE SOMEONE MIGHT HIT FROM THE BACK.    THIS HAS HAPPENED TO ME ON CITY STREETS AS WELL AS THE HIGHWAY. I THINK IT MIGHT BE DUE TO THE COLLISON SENSOR MISSCLASSIFYING SIGNBOARDS OR OVERHEAD BRIDGES AS HUMANS OR CARS",
        "vin": "19XZE4F52LE"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "11/16/2020",
        "dateOfIncident": "11/16/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374922,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ALONE ON ROAD DOING 30 MPH THE CAR SLAMMED ON THE BRAKES AND SLOWED TO ABOUT 20 MPH WHILE FLASHING \"BRAKE\" IN INSTRUMENT CLUSTER.  NO OTHER CARS ON THIS ROAD AT THE TIME.  THERE WERE SHADOWS ACROSS THE ROAD FROM SUN AND TREES.  SINCE I ALWAYS DRIVE THE SPEED LIMIT, IF THERE IS SOMEONE FOLLOWING ME, THEY ARE USUALLY RIGHT ON MY TAIL.  I DON'T WANT TO BE SHOT FOR \"BRAKE CHECKING\" SOME REDNECK IN A PICKUP WHEN IT ISN'T EVEN ME DOING THE BRAKING.  NHTSA ISN'T DOING IT'S JOB BY ALLOWING THIS ISSUE TO CONTINUE.",
        "vin": "19XZE4F90LE"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/27/2020",
        "dateOfIncident": "09/24/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361385,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ACC ON, TRAVELING 75MPH ON IH-10 E; CAR TWO LENGTHS IN FRONT OF ME, IN RH LANE, PULLS OFF ONTO EXIT RAMP, MY CAR SLAMS ON THE BRAKES AND BRINGS MY CAR DOWN TO 45MPH, IF THERE HAD BEEN SOMEONE BEHIND ME THERE WOULD HAVE BEEN AN ACCIDENT.  SAME HI-WAY, CAR 1/2 CAR LENGTH IN FRONT ON MY LEFT.  WE GO AROUND A SLOPING CURVE TO THE RIGHT, MY CAR AGAIN SLAMS ON THE BRAKES, AND I HAD TO JUMP ON MY GAS PEDDLE, AS THERE WAS A CAR BEHIND ME THIS TIME.  COMPLAINED TO MY SERVICE MANAGER AND WAS TOLD THIS WAS NORMAL!  NOPE, NOTHING NORMAL ABOUT THIS SITUATION!  ACCIDENT WAITING TO HAPPEN.  THEIR SOLUTION, DON'T USE CRUISE CONTROL!",
        "vin": "19XZE4F58LE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/27/2020",
        "dateOfIncident": "07/09/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351704,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT AFTER A DAY OF PURCHASED AND DRIVING BACK HOME. WE DID HEAR WINDY NOISE WAS COMING OUT FROM THE FRONT OF THE VEHICLE BY THE DRIVER SIDE AND TOOK IT BACK TO THE DEALERSHIP AND THEY HAVE HELPED FIX IT FOR NOW.",
        "vin": "19XZE4F58LE"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/19/2020",
        "dateOfIncident": "07/10/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340291,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A 2020 HONDA INSIGHT IN MARCH 2020.  I HAVE 8,000 MILES ON IT AND JUST THE THREE WEEKS AGO I STARTED HAVING TRANSMISSION PROBLEMS.  THE DASHBOARD ILLUMINATED SAYING TRANSMISSION PROBLEM, SEE DEALERSHIP.  IT'S BRAND NEW.  I TOOK IT TO THE LODI HONDA AND THE CODES WERE A STUCK SELONIED.  THEY SAID THERE WAS NO DAMAGE.  OK, IT DID IT A SECOND TIME AND I AM READY TO GIVE IT BACK.  PLEASE HELP ME.  SCARED OF GETTING STRANDED ON THE ROAD.  I WAS DRIVING ON THE HIGHWAY.",
        "vin": "19XZE4F90LE"
    }
]