[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/08/2021",
        "dateOfIncident": "06/28/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423899,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2012 Hyundai Accent. The contact stated while driving approximately 55-60 mph, the hood was released without warning and cracked the front windshield. The local dealer was not contacted. The vehicle was not diagnosed nor repaired. The manufacturer was notified of the failure. The failure mileage was approximately 42,000.",
        "vin": "3KPC24A61LE"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/06/2021",
        "dateOfIncident": "06/29/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423521,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I owned a 2017 Elantra and now I own a 2020 Accent. Both cars had the same on and off problem. When I am at an intersection and have to step on the gas to get thru the intersection quickly, when I step on the gas nothing happens. I have to pump the gas several times to get going. In the old days we called this vapor lock. This has happened numerous times but last week it almost got me killed. A car was coming from the lane to my right and I stepped on the gas and got about half way thru the intersection and the car just stopped and I was almost hit broad side.  I called the service manager at my local Hyundai dealership in Freehold, NJ and ask if other people have had the same problem. He said yes but their is nothing they can do about it. It is something built into the Hyundai cars. This is unacceptable. There has to be something that can be done. When I took my 2017 Elantra into the dealership, the service manager said to leave the car, but if it does do it when they take it out for a test drive, there is nothing they can do.",
        "vin": "3KPC24A64LE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "07/03/2021",
        "dateOfIncident": "05/27/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11423368,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "As I went to take a turn the vehicles electric power steering went out causing loss of control of the vehicle. The electric power steering is faulty and others should know about this major safety defect. Again What Exactly Happened was as I was turning the steering wheel became extremely difficult to turn then all of a sudden it turned extremely easy, \"more than normal\" and caused loss of control of the vehicle resulting in a head on collision that injured me and left me with fractured ribs and Sternum.",
        "vin": "3kpc24a69le"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/24/2020",
        "dateOfIncident": "09/09/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11366144,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY GRANDDAUGHTER WAS DRIVING ON A FREEWAY NEAR DALLAS TX. AS SHE SLOWED FOR AN UPCOMING CONSTRUCTION ZONE SHE WAS REAR-ENDED BY BY ANOTHER VEHICLE. PROPELLING HER INTO THE GUARD RAIL AND FURTHER TO THE RIGHT ENDING UP IN THE RIGHT LANE OF THE FREEWAY. THE VEHICLE WAS A TOTAL LOSS WITH FRONT AND REAR DAMAGE AND THE AIRBAG FAILED TO DEPLOY. NOBODY AT THE LOCAL DEALERSHIP WHERE THE CAR WAS PURCHASED IN MAY 2020 WILL DISCUSS THE ISSUE NOR AM I ABLE TO CONTACT ANY BREATHING PERSON AT HYUNDAI CORPORATE TO DISCUSS THIS ISSUE.",
        "vin": "3KPC24A64LE"
    }
]