[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/28/2022",
        "dateOfIncident": "03/23/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458660,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Hyundai Elantra. The contact stated while driving approximately 40 MPH and approaching a traffic light, the brake pedal was depressed and there was a grinding sound coming from the brakes. The failure had been experienced on several occasions. There were no warning lights illuminated. The contact was able to safely drive the vehicle to residence. The vehicle was taken to the local dealer for diagnostic testing; however, the vehicle was not repaired. The manufacturer was notified of the failure. The approximate failure mileage was 26,000.",
        "vin": "5NPD84LF6LH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/25/2022",
        "dateOfIncident": "03/25/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458295,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 HYUNDAI ELANTRA. CONSUMER WRITES IN REGARDS TO TRANSMISSION FAILURE.   THE CONSUMER STATED THE VEHICLE FAILED AT 2,200 MILES. THE CONSUMER ALO STATED, WITH THE CRUISE CONTROL ENGAGED, THE RPMS RISE ABOUT 500 RPMS WHILE MAINTAINING A STEADY SPEED. THE MANUFACTURER WAS NOTIFIED BUT, DID NOT OFFER ANY ASSISTANCE.",
        "vin": "99999999999"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/08/2022",
        "dateOfIncident": "02/18/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455773,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "What component or system failed or malfunctioned, and is it available for inspection upon request?  The engine malfunctioned, then failed. The vehicle is available for inspection upon request.  How was your safety or the safety of others put at risk? I decelerated from 65 mph to exit a freeway. At the end of an offramp, I slowed to a stop sign where the vehicle malfunctioned. It jerked, violently, forward as I attempted to accelerate endangering pedestrians crossing the intersection at the stop sign, other drivers on the offramp, and myself.    Has the problem been reproduced or confirmed by a dealer or independent service center? To date, 3/8/2022, the Hyundai dealership has not performed any diagnostic testing or repairs on the vehicle since receipt of the vehicle on 2/18/2022. Hyundai Motor America has also refused to acknowledge that NHTSA Campaign Number 21V301000 (4/28/2021) is associated to the vehicle. To date, I have made three (3), separate, follow-up attempts to communicate with an assigned case manager. The assigned case manager was unresponsive. After that, I made three (3), separate, case manager escalated supervisor requests. The case manager supervisor was unresponsive. My most recent request has been an initial Hyundai management team request (3/7/2022) …I am waiting for a response but am not hopeful that anyone will respond.    Has the vehicle or component been inspected by the manufacturer, police, insurance representatives or others? The vehicle remains at a Hyundai dealership. I received a text message that read, “the technician has had the vehicle, it has been starting and driving normally.”  In my opinion, the vehicle is unsafe to drive. I cannot, in good conscience, operate the vehicle until it is safe to drive.    Were there any warning lamps, messages or other symptoms of the problem prior to the failure, and when did they first appear? A check engine light presented just before engine failure. The engine did not start after it failed.  Remedy for the mechanical concerns is not yet available.\" The dealership remains silent on the cause of the Malfunction Indicator Light and Hyundai Motor America is now suggesting consumer take the car to another dealership for a second opinion.",
        "vin": "KMHD04LB0LU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/02/2022",
        "dateOfIncident": "02/02/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450013,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Noise coming from steering wheel column when turning wheel, especially at low speeds. After research, seems it is an issue that is common for these cars. If the electric steering fails during driving it can seriously injure the driver & passengers, it will cause wrecks to happen. My steering is starting to make the same noise people explain it creates before it goes out.",
        "vin": "5NPD74LF0LH"
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "01/31/2022",
        "dateOfIncident": "12/27/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11449589,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Hyundai Elantra. The contact stated while driving approximately 20 – 25 MPH uphill and going around a corner, the contact heard a snap and the traction control immediately activated. The contact then lost control of the vehicle. There was no warning light illuminated. The contact was unsure if the she had encountered a patch of ice on the roadway. The contact stated that she turned the steering wheel to the left to avoid hitting a sign pole with the driver’s side of the vehicle; however, the passenger’s side front bumper and wheel well area crashed into a telephone pole. She then heard a snap in her left arm right before she lost consciousness. The contact stated that the air bags had not deploy and she was thankful that they had not deployed. The contact stated that she was not immediately aware that she had fractured the bone in her left arm. The contact regained consciousness and drove the vehicle to her residence. The contact received no medical assistance at the crash scene but sought medical attention from the hospital the following day. A police report was not filed. The vehicle was then taken to an auto body shop to be inspected. The contact was informed that the lower control arm ball joint was damaged and needed to be replaced. The vehicle was repaired. The manufacturer was made aware of the failure. The failure mileage was approximately 45,000.",
        "vin": "5npd84lf8lh"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/23/2022",
        "dateOfIncident": "01/16/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448554,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The power train system:P001 intake camshaft position timing - over advanced bank 1.  My car was in good working condition no lights were on in my car up until January 16, 2022, I went to get gas on a regular morning routine before going to work when I turned my car back on after getting gas and I began to pull into traffic and my car stalled and the engine oil pressure light and battery charge warning light came on. My safety could have turned out bad but grace of God my car allowed me to turn it back on and go to the closest location to me and that was auto zone. I got the car towed from there to a hyundai dealer (Preston Hyundai in hurlock, md) is where the car is currently being looked at.",
        "vin": "5NPD84LF9LH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/28/2021",
        "dateOfIncident": "10/25/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445317,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Checked VIN for open recall and that number doesn't come up. My engine had to be replaced under factory warranty. The issue was the exact same as a current recall. I am concerned that Hyundai is not expanding the recall in an effort to downplay the issue. 2020 Elantra, 2.0 liter engine, stalling while driving. The tech found the piston rings were bad. I hope this will help others and Hyundai will be held accountable.",
        "vin": "5npd84lf7lh"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/14/2021",
        "dateOfIncident": "12/14/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443732,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Hello, I have a 2020 Hyundai Elantra  [XXX] Vin.  The car has a major problem with the steering and suspension at speeds over 45 mph.  I am talking with [XXX] at this time after dialing [XXX] at Hyundai cust care  (case #[XXX]).  She told me she is on the West Side location.  I asked where is that and she stated she is unable to let me know where.  The car does not hold the road and the suspension and steering is not working well at speeds of 45mph or faster.  This is a very dangerous situation and this year and model of Hyundai should be examined before someone loses control because of a defect made at Hyundai.  [XXX] stated she does not have a recall for this problem and I am at a complete loss for what to do.  She stated an appointment is not easily made until Dec 31st because of staffing issues.  I looked online and also found other comments with this same exact issue so I know it is a major problem that needs to be addressed.  Please let me know what I should do before a tragic accident happens with this and other 2020 Elantra vehicles.  Thank you in advance.  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "5NPD84LF6LH"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/29/2021",
        "dateOfIncident": "11/11/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442038,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "My vehicle was stolen, due to known design flaws of Hyundai/Kia.",
        "vin": "5NPD84LFXLH"
    },
    {
        "components": "ENGINE",
        "crash": true,
        "dateComplaintFiled": "11/18/2021",
        "dateOfIncident": "10/30/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440913,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "At least 5 or 6 times, I have experienced sudden uncommanded acceleration with my 2020 Hyundai Elantra.  One time my car hit a tree.  These have been terrifying incidents. It usually happens when I am slowing down or braking.",
        "vin": "5npd84lf5lh"
    },
    {
        "components": "LANE DEPARTURE,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "11/17/2021",
        "dateOfIncident": "11/08/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440768,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "My car does not have forward collision warning or lane departure warning. But sometimes it will randomly pop up and the screen and cause my breaks to abruptly stop and almost crash.This has happened atleast 8 times and the car was bought brand new in 2020",
        "vin": "5NPD74LF7LH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/08/2021",
        "dateOfIncident": "07/01/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439680,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Hyundai Elantra. The contact received notification of NHTSA Campaign Number: 21V301000 (Engine) however, the part to do the recall repair was not available. The contact stated that while driving at an undisclosed speed, the vehicle was rattling, hesitated to accelerate, and lost motive power. The oil warning light was illuminated. The vehicle was taken to the dealer and the dealer performed an oil consumption test and informed the contact to bring the vehicle back after 1,000 miles. The vehicle was taken back to the dealer, but the dealer diagnosed that there was no failure with the vehicle. The vehicle was not repaired and remained at the dealer. The manufacturer was not made aware of the failure. The failure mileage was approximately 3,000. Parts distribution disconnect.",
        "vin": "kmhd84lf8lu"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/02/2021",
        "dateOfIncident": "06/30/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439041,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "On June 30 2021 I was parking in front of a store in Oceanside Ca as I was pulling into the Parking space the engine started to race and the car would not stop I hit a Planter first and the wall of an hobby Nobby store I contact Hyundai American and reported and I asked them to check out the black box I received a letter back brim Hyundai American I they stated the would not (we have no reason to believe there USA product defect in the vehicle. It is a new vehicle with low mileage and there are no known issues with this model ‘s braking )  You can call me at[XXX] My Name is  [XXX]  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "5NPD84LF5LH"
    },
    {
        "components": "STEERING,WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/24/2021",
        "dateOfIncident": "09/23/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434285,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I was in the inside left turn lane turning left and as I was turning my steering wheel my car was not turning, it was continuing to go straight. I hit my brakes so I wouldn’t crash into the car turning next to me and then my wheels finally turned as I was braking so it caused me to burn the tires and swerve. I’m not sure if any lights came on as I was trying not to crash into the vehicle next to me. I have an appointment for the dealership to look at it.",
        "vin": "5NPD74LF0LH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/23/2021",
        "dateOfIncident": "09/23/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434014,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 HYUNDAI ELANTRA. CONSUMER WRITES IN REGARDS TO PISTON RING OIL SAFETY RECALL.   THE CONSUMER  STATED THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME COMPLETING THE RECALL REPAIR.",
        "vin": "KMHD84LF6LU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/21/2021",
        "dateOfIncident": "01/05/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433847,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Hyundai Elantra. The contact stated while driving 50 MPH, the vehicle inadvertently stalled. There were no warning lights illuminated. The contact was able to veer to the side of the road. The contact stated he was able to restart the vehicle after several attempts however, the vehicle was making abnormal sounds when he depressed the accelerator pedal. The check engine warning light illuminated. The contact drove to his residence. The vehicle was taken to the dealer for diagnostic testing however, the dealer did not inform the contact of the result. The contact stated that the failure had been reoccurring while driving. The check engine warning light was illuminated. The contact stated he became aware of NHTSA Campaign Number: 21V301000 (Engine) however, the dealer informed the contact that the part for the recall repair was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was not notified of the failure. The vehicle was not repaired. The approximate failure mileage was 48,000. Parts distribution disconnect",
        "vin": "KMHD84LF8LU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/15/2021",
        "dateOfIncident": "06/01/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433134,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "For several months, my leased vehicle will suddenly stall while driving or not start at all. This often leads to me suddenly stopping the vehicle in traffic. I am 5.5 months pregnant and cannot continue to operate this vehicle in this condition, as it is a risk to both my safety and the safety of my child. I have communicated my concerns about this several times to the dealership, with the only resolution offered to me being to pay to lease a new vehicle. The check engine light has continuously been lit, despite service appointments. I have only been advised that there is “no solution yet”.",
        "vin": "KMHD74LF9LU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/14/2021",
        "dateOfIncident": "09/14/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432948,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Hyundai Elantra. The contact stated upon taking the vehicle to the dealer for an oil change, she was informed that the vehicle was included in NHTSA Campaign Number: 21V301000 (Engine). However, the dealer also informed the contact that the parts for the recall repair were not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was notified of the issue and a case was open. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "KMHD84LF1LU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/13/2021",
        "dateOfIncident": "08/28/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432837,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "This is regarding recall number: 203 nhtsa:21v-301  My vehicle failed this recall inspection and has been with the hyundai dealer(Hyundai South Bay Torrance) for the past 2.5 weeks and I still have not heard anything regarding the remedy. The recall letter says that the engine would be replaced but the hyudai dealer said that the hyundai corporate office has not replied to them and it could take months to fix this. This is irrational as they have kept my vehicle and there is no guideline on when i will get it back.",
        "vin": "kmhd84lf8lu"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "09/10/2021",
        "dateOfIncident": "07/02/2021",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11432397,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Car stalled  while driving on highway… causing the car to crash. The air bags deployed and me out! The car burst into flames and I was rescued by another motorist",
        "vin": "KMHD84LF4LU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/08/2021",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432175,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Hyundai Elantra. The contact received notification of NHTSA Campaign Number: 21V301000 (Engine) however, the part to do the recall repair was unavailable. The local dealer was contacted, and it was confirmed that the part was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "KMHD74LFXLU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/30/2021",
        "dateOfIncident": "06/25/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431047,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Hyundai Elantra. The contact received notification of NHTSA Campaign Number: 21V301000 (Engine) however, the part to do the recall repair was not available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The contact stated that prior to receiving the recall notification, the contact had heard abnormal banging noises while starting the vehicle. The vehicle was taken to the dealer, but the dealer could not replicate the failure. The vehicle was not repaired. The dealer was later made aware of the recall but informed the contact that parts were not yet available. The manufacturer was not made aware of the failure. The failure mileage was approximately 5,000. Parts distribution disconnect.",
        "vin": "kmhd74lf4lu"
    },
    {
        "components": "SEATS,UNKNOWN OR OTHER,ENGINE",
        "crash": true,
        "dateComplaintFiled": "08/27/2021",
        "dateOfIncident": "07/02/2021",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11430751,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Car emitted carbon monoxide into car cabin, causing driver to lose consciousness and crash on highway and burst into flames",
        "vin": "KMHD84LF4LU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/27/2021",
        "dateOfIncident": "08/23/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430694,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Purchased used from Carvana. Steering pulls to right and left, unexpectedly and sporadically. Noticeable by both drivers, independently. Also, noticeable from passenger seat and not by driver alone. Suspected LOWER BALL JOINT issue which could result in sudden loss of control, crash, and death. IF this work was done, perhaps defective \"repair\"? Carvana advised this is a death trap (my words). Have been trying to return vehicle since MONDAY 8/23. Driving to the 'vending machine' to hand back over THEIR vehicle, uninvited yet announced, on 8/27 a.m. in Las Vegas. This issue occurs at low, medium, and highway speeds without any apparent cause, except perhaps dips and uneven road surfaces. Perhaps the mismatched set of front/back tires?",
        "vin": "5NPD84LF8LH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "08/16/2021",
        "dateOfIncident": "08/10/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11429334,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I rented a 2020 Hyundai Elantra from Pittsburgh PA to Rockville MD. It was raining. Because the steering wheel was sensitive compared to other cars I had driven, I turned on the car's Lane Keeping Assistance, which tightened the steering wheel a bit and made an alarm sound and steered back by itself when the car got close to a lane line. I drove under the speed limit and exercised all caution necessary on a raining day. On highway 70 East close to Hagerstown MD, I noticed the car deviate towards the left on a curve. Lane Keeping Assist did not alarm. To prevent it from hitting the left divider, I tried to steer back to the right but the steering wheel was locked up. I pressed the brake pedal, but the car did not slow down. The car suddenly slid to the far right, left the highway pavement, rolled over on the lawn. All of the front and side airbags on the driver’s seat and co-driver’s seat popped out. Smoke was everywhere. I got bruises on my knees and legs, and cuts in left hand and arm. The mileage was 43316 according to the rental company after the incident. I purchased the damage waiver so the rental company did not charge me or provide a report. Consumer stated she would like to withdrawal the complaint.",
        "vin": "5NPD84LFXLH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/08/2021",
        "dateOfIncident": "08/08/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428276,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Ours and other vehicles were broken into with intent to steal in our neighborhood last night.  Side passenger window smashed and steering column torn apart.  Due to poor design of our vehicle, we are a flag to theft.  We are now out an important vehicle for family and home, along with money to repair and stress.",
        "vin": "5NPD84LF4LH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/06/2021",
        "dateOfIncident": "03/16/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428025,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Hyundai Elantra. The contact received a recall notification for NHTSA Campaign number: 21V301000 (Engine). The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was not notified of the issue. The part was not available for the repair. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "KMHD84LF7LU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/03/2021",
        "dateOfIncident": "06/15/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427562,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Hyundai Elantra. The contact stated while turning off the vehicle, the vehicle made an abnormal sound. The contact received notification of NHTSA Campaign Number: 21V301000 (Engine) however, the part to the recall repair was not yet available. The contact took the vehicle to the local dealer and it was confirmed that the part was not available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The failure mileage was approximately 400. Parts distribution disconnect. Consumer stated happens randomly while driving as well.",
        "vin": "KMHD84LF7LU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/31/2021",
        "dateOfIncident": "07/30/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427256,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SUDDENLY FAILED AFTER ON 40,000 MILES- STILL UNDER WARRANTY",
        "vin": "5NPD84LF9LH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/28/2021",
        "dateOfIncident": "07/28/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426799,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Hyundai Elantra. The contact received a recall notification for NHTSA Campaign Number: 21V301000 (Engine) however, the part to do the recall repair was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was notified of the issue. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "KMHD74LF5LU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/19/2021",
        "dateOfIncident": "03/02/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425457,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Hyundai Elantra. The contact stated that there was an abnormal clicking sound coming from the vehicle at start-up. There was no warning light illuminated. The contact had taken the vehicle to a dealer and was informed that the oil level was low. The mechanic replaced the lifters and rocker arms. The vehicle was returned and soon after the failure persisted. The contact then received notification of NHTSA Campaign Number: 21V301000 (Engine) however, the part for the recall repair was not yet available. The contact received a call from the dealer about the repair and the contact was informed that the original defective parts were placed in the vehicle. The manufacturer was not notified of the failure. The contact stated that the manufacturer had exceeded a reasonable amount of time for the repair. The vehicle was not repaired. The failure mileage was approximately 13,000. Parts distribution disconnect.",
        "vin": "kmhd84lf2lu"
    },
    {
        "components": "TIRES,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/13/2021",
        "dateOfIncident": "07/09/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424610,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Hyundai Elantra. The contact stated while driving the vehicle at an undisclosed speed, the tire pressure and check engine warning lights illuminated. The contact took the vehicle to an independent mechanic who checked the tire pressure and the engine oil levels. The contact was informed that the levels were at the correct levels however, the TPMS warning light remained illuminated. The local dealer diagnosed the vehicle with a defective sensor. The dealer performed am electronic control module software update to attempt to fix the failure however, the failure persisted. The vehicle was not repaired.  The manufacturer was made aware of the failure. The failure mileage was unknown.",
        "vin": "kmhd74lf4lu"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,LANE DEPARTURE",
        "crash": true,
        "dateComplaintFiled": "06/30/2021",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422894,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Hyundai Elantra. The contact stated while driving at various speeds, the vehicle erroneously switched from smart mode to sport mode causing the vehicle to independently accelerated. Additionally, the lane departure system would erroneously activate. The contact also stated that while driving at an undisclosed speed, the vehicle pulled to the right. The contact also stated that the exhaust pipe was rusted. The cause of the failures was not yet determined. The local dealer and manufacturer were notified of the failure. The approximate failure mileage was 400. Consumer stated vehicle needs to brought in again, passenger seatbelt alarm goes off without anyone being in the vehicle. AC was leaking water and sensors keep changing automatically. In addition tire has been replaced after 3500 miles. Manufacture has been contacted several times and refused to buy the car back. Consumer has filed the complaint with the BBB.",
        "vin": "KMHD84LF8LU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/29/2021",
        "dateOfIncident": "06/28/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422736,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "There is a recall on my 2020 Hyundai Elantra that I was notified about on June 28th 2021. I called the dealership where I purchased my car and was told that since there is no remedy for the piston oil ring that there was nothing they could do until a remedy becomes available. My car has been hesitating when accelerating and that is one of the signs of my car affected by the piston oil ring. I was told that if I continue to drive the car I am taking a risk of damaging it further. According to the NHTSA website It says the remedy is to have the whole engine replaced and they are not going to fix the recall until a remedy becomes available on their end.",
        "vin": "KMHD74LF9LU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/28/2021",
        "dateOfIncident": "06/28/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422691,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Hyundai has failed to remedy the engine manufacturing defect for the past few years. Hyundai has not been able to remedy the engine defect in the 2.0 nu mpi engine in a timely manner. The Hyundai dealership, Tipton Hyundai sold me a dangerous, unsafe car with an engine manufacturing defect. The correct remedy for the engine 2.0 nu mpi defect is a buyback program issued by Hyundai.",
        "vin": "Kmhd84lf3lu"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/24/2021",
        "dateOfIncident": "05/07/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422221,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Ewr Volpe Acme Inc.",
                "productMake": "TBD",
                "productModel": "TBD",
                "productYear": "9999",
                "type": "Vehicle"
            }
        ],
        "summary": "No warning lamps. Incident reported to tire manufacturer; no liability acknowledged. While parking at very low speed, sidewall contacted smooth metal curb at a slight angle and blew out. IMO, tire should have withstood the typical parking process and not destroyed the sidewall and burst under the conditions.",
        "vin": "5NPD84LF4LH"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/22/2021",
        "dateOfIncident": "05/02/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11421895,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "On May 2, 2021 I was involved in a hit and run accident.  An individual in a pickup ran a red light and t-boned my car on the driver side.  No air bags deployed.  I was taken to the hospital with a severe concussion.",
        "vin": "KMHD84LF4LU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/20/2021",
        "dateOfIncident": "06/20/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421564,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Everytime when I driving around 20 minutes The transmission start failed on the first gear...every time when I stop at the traffic light and then go forward car loose the power in the first gear even sport mode or smart mode or normal mode he do that.... that's to dangerous cause if I have to crossing a way that only have a stop sign might can get an accident.",
        "vin": "5NPD84LF4LH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/17/2021",
        "dateOfIncident": "05/12/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421288,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "My car has 27,000 miles on it and is using oil. The oil turns black. This has been going on for a while. It has a ticking sound. It did have a bad loud when I took it to Hyundai. Hyundai is trying to blame me for the engine problem but a NEW car should not use oil and the oil turn black! Not sure of date. Been having problems with car for six mo. I see a recall for this problem. Thank u",
        "vin": "KMHD84LF8LU"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "06/14/2021",
        "dateOfIncident": "06/12/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420844,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The forward accident avoidance system repeatedly cuts off the gas and prevents the car from moving even when there is nothing that could be considered a hazard in front of the car. It leaves me stranded half way through a turn in an intersection or the entrance to a parking lot. The gas pedal is disabled until the computer decides that it is safe. The service manager at the dealer says there is nothing they can do as the system is extremely sensitive and they get a lot of complaints about it. To be left in the middle of an intersection as the light changes and cross traffic starts or to to be stopped halfway through a turn onto a road with approaching traffic is not safe.",
        "vin": "5NPD74LF3LH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/18/2021",
        "dateOfIncident": "05/13/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417675,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle engine seizes and will not start. Happens multiple times. Towed vehicle to dealership and they state there is no recall for this problem however; NHTSA has a recall number of: 21V301000. Really getting the runaround. Same problem happened on 2013 Sonata we owned that caught fire, in which Hyundai paid lien and offered discount pricing to buy 2020 Elantra. Is this a trend?",
        "vin": "5npd84lf3lh"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/05/2021",
        "dateOfIncident": "02/28/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415259,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 HYUNDAI ELANTRA. THE CONTACT STATED THAT WHILE DRIVING AT AN UNDISCLOSED SPEED, THE ENGINE MALFUNCTIONED CAUSING THE VEHICLE TO STALL. THE VEHICLE WAS TOWED TO REGIONAL HYUNDAI LOCATED AT 2380 W KENOSHA ST, BROKEN ARROW, OK 74012, TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE ENGINE WAS FAULTY AND NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN TOOL CONFIRMED THAT THE VIN WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 21V301000 (ENGINE). THE VEHICLE WAS NOT YET REPAIRED. THE FAILURE MILEAGE WAS 44,000.",
        "vin": "KMHD84LF8LU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/29/2021",
        "dateOfIncident": "04/17/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414532,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERNAL TRANSMISSION FAILURE",
        "vin": "5NPD84LF8LH"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "04/20/2021",
        "dateOfIncident": "04/20/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413015,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN CRUISE CONTROL IS ACTIVATED, THE ENGINE RPM AUTOMATICALLY INCREASES BY ABOUT 700 RPM. AT 75 MPH, THE ENGINE RPM IS 2300. WHEN CONTROL IS ACTIVATED, ENGINE RPM INCREASES TO 3000 RPM AND REMAINS THERE. THIS DECREASES GAS MILESGE AND INCREASES WEAR ON ENGINE.",
        "vin": "5NPD84LF3LH"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/14/2021",
        "dateOfIncident": "02/02/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408131,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2020 HYUNDAI ELANTRA. THE CONTACT STATED THAT THE VEHICLE WOULD INTERMITTENTLY STALL UPON PLACING THE GEAR SHIFTER INTO REVERSE WITHOUT WARNING. THE CONTACT HAD TAKEN THE VEHICLE TO HYUNDAI OF JEFFERSON CITY (3215 MISSOURI BLVD, JEFFERSON CITY, MO 65109) WHERE THE RANGE SENSOR WAS REPLACED. THE CONTACT STATED THAT HE SOLD THE VEHICLE THE DAY AFTER THE SENSOR WAS REPLACED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 2,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/12/2021",
        "dateOfIncident": "04/02/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407789,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING VEHICLE AT 20 MILES PER HOUR ONE BLOCK FROM RESIDENCE ON A CITY STREET AND MADE A NOTICEABLE KNOCKING SOUND IN THE ENGINE.  VEHICLE WENT INTO LIMP MODE.  DRIVE HOME AND HAD VEHICLE TOWED TO DEALER.  DEALER STATED METAL IN THE OIL PAN AND SAID INTERNAL ENGINE FAILURE.  WAITING ON FURTHER FROM HYUNDAI.",
        "vin": "KMHD84LF9LU"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/03/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406211,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE NORMAL BEAM BRIGHTNESS FOR THE FRONT HEADLAMPS IS ABOUT 50% OF WHAT IT SHOULD BE. IT IS NOT SAFE TO DRIVE THE CAR AT NIGHT ON THE LOW-BEAM SETTING. WITH THE HIGH BEAM SETTING, VISIBILITY IS ABOUT AS IT SHOULD BE FOR THE NORMAL SETTING.",
        "vin": "5NPD84LF9LH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/02/2021",
        "dateOfIncident": "04/01/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406056,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE HIGHWAY, MY VEHICLE EXPERIENCED A CVT TRANSMISSION FAILURE. THE VEHICLES TACHOMETER STARTED OSCILLATING SLIGHTLY, JUMPING UP AND DOWN. THE NEXT SYMPTOMS WAS THE CAR AT TIMES FELT LIKE IT HAD A BUCKING/JERKING SENSATION. THE TACHOMETER SUDDENLY JUMPED UP TO AROUND 5000 RPM. THE CAR IMMEDIATELY LOST POWER WHILE TRAVELING ON THE HIGHWAY, DANGEROUSLY ALMOST CAUSING AN ACCIDENT WITH THE CAR BEHIND ME ALMOST HITTING/REAR ENDING ME FROM BEHIND WITH THIS SUDDEN UNEXPECTED LOSS OF POWER AND SPEED. THE CAR SLOWED DOWN AND I FOUND I COULD NOW NOT DRIVE ANY FASTER THAN ABOUT 20 MILES/HR. AS I PUSHED DOWN ON THE GAS PEDAL, THE TACHOMETER JUST INCREASED IN RPM, WITH NO TRANSFER OF POWER TO THE DRIVE   WHEELS. THE CAR WAS PURCHASED BRAND NEW IN NOVEMBER 2020 AND IT NOW HAS 3700 MILES ON IT. I HAVE A VIDEO OF THE EVENT HAPPENING AS I STARTED VIDEOING WHEN THE CAR DID NOT FEEL RIGHT.",
        "vin": "5NPD84LF9LH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/23/2021",
        "dateOfIncident": "03/20/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404566,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE HIGHWAY MY RPM STARTED JUMPING WHILE I WAS KEEPING A CONSTANT SPEED. A FEW MOMENTS LATER MY RPM JUMPED AND I WAS ALMOST RED LINING. I SLOWED DOWN TO 35 MPH AND GOT OFF THE HIGHWAY AND THE CAR WOULDNT GO PASS 30 WITHOUT REVING INCREDIBLY HIGH. I TOOK IT IN TO THE DEALERSHIP AND THEY TOLD ME THEY HAD TO REPLACE MY TRANSMISSION. MY MILEAGE WAS AT 4500.",
        "vin": "5NPD84LF2LH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/18/2021",
        "dateOfIncident": "02/20/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403639,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 HYUNDAI ELANTRA. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE ENGINE STARTED MAKING A KNOCKING SOUND. THE CONTACT STATED THAT THE FAILURE WENT ON FOR A WEEK. ON ANOTHER OCCASION WHILE DRIVING APPROXIMATELY 65 MPH, THE VEHICLE STARTED LOSING MOTIVE POWER. THE CONTACT COASTED TO THE SIDE OF THE ROADWAY, TURNED OFF AND RESTARTED THE VEHICLE AND THE VEHICLE REGAINED NORMAL DRIVABILITY. THE VEHICLE WAS TAKEN TO RICK CASE HYUNDAI (3550 WESTON RD, DAVIE, FL 33331, (954)994-2397) WHO STATED THAT THE THERE WAS AN ENGINE FAILURE AND THAT THE ENGINE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 5,000.*DT",
        "vin": "KMHD84LF3LU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/17/2021",
        "dateOfIncident": "01/06/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403489,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 HYUNDAI ELANTRA. THE CONTACT STATED THAT WHILE DRIVING 30 MPH, THE CONTACT HEARD A KNOCKING SOUND COMING FROM THE VEHICLE BEFORE THE VEHICLE STALLED. THE PUSHED THE VEHICLE OFF THE ROADWAY. THERE WERE UNKNOWN WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS TOWED TO SAN LEANDRO HYUNDAI (1066 MARINA BLVD, SAN LEANDRO, CA 94577) WHERE THE MECHANIC TOPPED OFF THE ENGINE OIL. THE VEHICLE STARTED OPERATING NORMALLY HOWEVER, THE FAILURE RECURRED. THE VEHICLE WAS DIAGNOSED BY THE SAME DEALER AND THE CONTACT WAS INFORMED THAT THE ENGINE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 8,200.*DT",
        "vin": "KMHD74LF3LU"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/28/2021",
        "dateOfIncident": "02/27/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398257,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON HIGHWAY CAR LOST POWER DROPPING DOWN TO 10-20  MILES PER HOUR.  APPEARS CAR STUCK IN LOW GEAR AND WON'T GO FORWARD OVER 10MPH WITH RPM REVINNING",
        "vin": "5NPD84LF1LH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/16/2021",
        "dateOfIncident": "02/12/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396396,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON HIGHWAY AT FULL SPEED, THE CAR SHIFTED INTO 1ST GEAR ON ITS OWN. TRAFFIC WAS HEAVY, BUT FAST, CREATING A DANGEROUS SITUATION. I WAS ABLE TO GET THE CAR OVER.  IT WAS TAKEN TO SERVICE AND THE DEALER FOUND THAT THE WHOLE TRANSMISSION NEEDED TO BE REPLACED.",
        "vin": "5NPD84LF7LH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/14/2021",
        "dateOfIncident": "12/16/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388100,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON HIGHWAY AT FULL SPEED, THE CAR SHIFTED INTO 1ST GEAR ON ITS OWN.  TRAFFIC WAS HEAVY, BUT FAST, CREATING A DANGEROUS SITUATION.  I WAS ABLE TO GET THE CAR OVER.  AFTER TURNING THE CAR OFF AND THEN BACK ON, A LIGHT CAME ON SAYING THERE WAS A TRANSMISSION CONTROL BOARD ISSUE, AND THAT THE CAR SHOULD BE SERVICED SOON.  IT WAS TAKEN TO SERVICE AND THE DEALER FOUND THAT THE WHOLE TRANSMISSION NEEDED TO BE REPLACED.",
        "vin": "5NPD84LF3LH"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/14/2020",
        "dateOfIncident": "10/14/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383433,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT'S BOYFRIEND OWNS A 2020 HYUNDAI ELANTRA. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE FORWARD COLLISION AVOIDANCE SYSTEM ACTIVATED INDEPENDENTLY. THE CONTACT ALSO STATED THAT THE FORWARD COLLISION AVOIDANCE WARNING LIGHT WAS DISPLAYED ON THE INSTRUMENT PANEL. THE CONTACT HAD INITIALLY TAKEN THE VEHICLE TO MITCHELL HYUNDAI (1600 E. PARK AVE, ENTERPRISE, AL 36330) WHERE THE SERVICE TECH STATED THAT THE DEALER TAG MAY HAVE CAUSED THE ISSUE. THE CONTACT DISPUTED THE CLAIM. THE FAILURE RECURRED TWICE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 1,700.*DT",
        "vin": "5NPD84LFXLH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/11/2020",
        "dateOfIncident": "12/08/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383008,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 HYUNDAI ELANTRA. THE CONTACT STATED THAT WHILE DRIVING 65 MPH, THERE WAS AN ABNORMAL SOUND COMING FROM THE VEHICLE. THE CONTACT STATED THAT THE VEHICLE LOSS MOTIVE POWER UPON ACCELERATION. THE CONTACT VEERED TO THE SHOULDER OF THE ROADWAY, TURNED OFF AND RESTARTED THE VEHICLE WHICH RESUMED NORMAL OPERATION. THE VEHICLE WAS TAKEN TO LEHIGH VALLEY HYUNDAI (675 STATE AVENUE, EMMAUS, PA 18049, (610) 967-6500) WHERE IT WAS DIAGNOSED AND IT WAS DETERMINED THAT THE TRANSMISSION FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED THE CONTACT WITH A CASE NUMBER. THE FAILURE MILEAGE WAS APPROXIMATELY 2,440. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "12/11/2020",
        "dateOfIncident": "08/17/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 2,
        "numberOfInjuries": 1,
        "odiNumber": 11383011,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "AT APPROXIMATELY 16,000 ' 17,000 MILES THE CAR STARTED HAVING TECHNICAL AND ELECTRICAL ISSUES. THERE SEEMED TO BE AN ISSUE WITH THE REGULAR HEADLIGHTS AND HIGH BEAM SETTING. ON THE PASSENGER SIDE OF THE CAR, THE GLOVE BOX LIGHT, THE OVERHEAD READING LIGHT, AND THE CHARGING PORT FOR CAR ADAPTERS ALL STOPPED WORKING. SHORTLY AFTER THOSE THINGS WENT OUT IN THE VEHICLE, WE WERE IN AN ACCIDENT. WE WERE DRIVING FROM MISSOURI TO CALIFORNIA AND WHILE DRIVING ON A 2 LANE HIGHWAY THROUGH KANSAS, THE CAR UNEXPLAINABLY JOLTED TO THE LEFT INTO THE OPPOSITE DIRECTION LANE OF TRAVEL. I WAS GOING AROUND 65 MPH WHEN THIS HAPPENED. IT SEEMED THE CAR THEN ACCELERATED ON ITS OWN WITH THE RPMS GOING TO THE RED. THE STEERING WHEEL LOCKED UP AFTER THE CAR HAD JERKED OVER. THE STEERING WHEEL WOULDN'T BUDGE. ANOTHER VEHICLE WAS COMING RIGHT AT US. I WAS TRYING TO GET THE CAR TO GO ANY DIRECTION BUT THE STEERING WHEEL WAS LOCKED. SO WE HAD A HEAD ON COLLISION. THE 2 OTHER OCCUPANTS IN THE CAR DID NOT MAKE IT, I WAS THE ONLY SURVIVOR. THESE CARS HAVE ELECTRIC STEERING. THE CAR WAS HAVING ELECTRICAL ISSUES, I DID NOT KNOW ABOUT THE TYPE OF STEERING IT HAD. I AM WONDERING IF ANYONE ELSE HAS HAD ANY OF THE SAME EXPERIENCES/PROBLEMS?*DT*DT*JB*DT*JB*JB*JB",
        "vin": "5NPD84LF4LH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/07/2020",
        "dateOfIncident": "11/10/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378272,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "11/10/2020 AS I WAS DRIVING I NOTICED A BURNING SMELL COMING FROM THE OUTSIDE OF THE CAR I HAD MY WINDOWS DOWN I PULLED OVER IN A GROCERY STORE PARKING LOT BECAUSE I THOUGHT THE SMELL WAS COMING FROM SOMEONE ELSE CAR ONLY TO FIND OUT IT WAS MINE I ONLY HAD THE CAR FOR A LITTLE OVER 6 MONTHS THE CAR HAD 2552 MILES ON IT I REPORTED TO HYUNDAI CUSTOMER SERVICE ONLY TO BE DISAPPOINTED AND GIVEN THE RUNA ROUND. I HAVE A CASE NUMBER AS WELL #17456723 I SPOKE WITH 2 MANAGERS AND I WAS BEING TOLD OH THIS MANAGER HANDLES THIS AND THEN WHEN I SPOKE WITH THAT MANGER I WAS TOLD I HAD TO SPEAK TO ANOTHER MANAGER, SO I HAD THE CAR TOWED TO A DEALERSHIP TO ONLY BE TOLD THAT THEY COULDN'T DETERMINE WHERE THE SMELL WAS COMING FROM AND DON'T WORRY ABOUT THE SMELL ON THE OUTSIDE OF THE CAR BUT THEY HAD PERFORMED A RECALL ON THE VEHICLE WHERE I WASN'T EVEN INFORMED ABOUT THE RECALL FROM HYUNDAI EVEN WHEN I WENT ON THE RECALL WEBSITE THERE WAS NO OPEN RECALLS LISTED FOR MY VEHICLE SO I GOT FRUSTRATED AND HAD THEM REPOSSESS THE VEHICLE BECAUSE I REFUSED TO RISK MY LIFE BY CONTINUING TO DRIVE THE VEHICLE WITH THE OVERHEATING ISSUE I ALSO NOTICED THAT THE THERMOSTAT WOULD RISE REALLY QUICK AND THE CAR WOULDN'T EVEN BE RUNNING THAT LONG AND IT EVEN TOOK THEM A WEEK TO COME GET THE VEHICLE NOW I'M BEING TOLD THAT THE CAR WILL BE AUCTIONED OFF AND WHAT EVER THEY DON'T GET FOR THE VEHICLE I WILL BE RESPONSIBLE IN WHICH I DON'T BELIEVE IS FAIR AFTER COMPLAINING THAT THE DEALERSHIP TOLD ME THAT THE ORIGINAL DEALERSHIP WHERE I PURCHASED THE VEHICLE PROBABLY SPRAYED SOMETHING ON THE ENGINE TO KEEP IT FROM RUSTING I WAS UPSET BECAUSE I NEVER TOOK IT BACK TO THE ORIGINAL DEALERSHIP OF PURCHASE I EXPLAINED THIS TO THE MANAGER AS WELL I WAS TOLD TO TAKE THE CAR SOME WHERE ELSE I COULDN'T I HAVE MEDICAL ISSUES I AM DEALING WITH AND THAT WOULD HAVE BEEN TO MUCH FOR ME.",
        "vin": "5NPD84LF1LH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/28/2020",
        "dateOfIncident": "11/27/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376850,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST BOUGHT/ FINANCED MY NEW 2020 HYUNDAI ELENTRA ON 11/15/2020 AND RECENTLY IN PAST COUPLE OF DAYS I HAVE EXPERIENCED TROUBLE WITH THE GAS/ THROTTLE/ POWER OF DRIVING MY NEW CAR. THE RPM IN MY VIDEO JUMPS UP & DOWN WITH NO POWER REALLY PUSHING TO DRIVE. I ALMOST GOT INTO 1 BAD ACCIDENT WITH A SEMI-TRUCK. ALSO THE TIRE PRESSURE SENSOR WAS LOW READING PSI OF 29 AND I NEVER RECEIVED A WARNING LIGHT UNTIL WAY LATER FOR PSI READING 32. EVEN THOUGH I AIRED MY TIRES TO THE CORRECT PSI MY WARNING LIGHTS ARE STILL ON.",
        "vin": "5NPD84LF1LH"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/18/2020",
        "dateOfIncident": "10/30/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375322,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "IT WAS NOTICED ON MY NEXEN TIRE THAT A BUBBLE HAD OCCURRED ON THE EXTERIOR/SIDE OF THE TIRE. WHEN I BROUGHT MY CAR TO THE HYUNDAI DEALERSHIP TO LOOK AT IT, THEY TOLD ME THAT THE BUBBLE OCCURS WHEN GOING OVER A BUMP IN THE ROAD, AND THE CABLES ON THE INSIDE OF THE TIRE PUSH OUT TO CREATE THE BUBBLE IN THE TIRE. IT IS A SAFETY HAZARD WHILE DRIVING, AND A BLOWOUT COULD POSSIBLY OCCUR. THE TECHNICIAN AT THE DEALERSHIP MENTIONED THAT THEY SEE MULTIPLE CARS EACH MONTH WITH THESE BUBBLES ON THE NEXEN TIRES. NEXEN IS THE TIRE COMPANY THAT HYUNDAI USES FOR THEIR NEW VEHICLES. WHEN I CALLED NEXEN ABOUT THE ISSUE, THEY TOLD ME TO FILE A CLAIM, WHICH HAS BEEN APPROVED AND COMPENSATION WILL BE PROVIDED FOR TIRE REPLACEMENT. THEY DIDN'T INDICATE IF THIS WAS A COMMON OCCURRENCE OR NOT, BUT WHEN IN CONVERSATION WITH A REPRESENTATIVE, IT APPEARED THAT THEY WERE FAMILIAR WITH THE ISSUE AND WERE QUICK TO RESPOND ABOUT FILING A CLAIM.",
        "vin": "KMHD84LF4LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/12/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374238,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I BELIEVE SOMEONE ELSE HAS LINKED INTO MY CAR USING AN APP, AND HAS ACCESS TO OPEN IT AND ALSO TAKE CONTROL OF THE BRAKES, ETC...",
        "vin": "5NPD74LF5LH"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/23/2020",
        "dateOfIncident": "10/23/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365872,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "CONDITIONS: WHILE DRIVING ON A FLAT ROAD SURFACE/TERRAIN, MAINTAINING A CONSISTENT SPEED, AND CONSISTENT PEDAL APPLICATION. IF YOU SET CRUISE CONTROL, THE RPMS WILL JUMP BY 500 OR MORE. THE JUMP IN ENGINE SPEED IS MAINTAINED, NOT TEMPORARY. THE SUSTAINED INCREASE IN ENGINE SPEED WILL REDUCE FUEL ECONOMY AND INCREASE MECHANICAL WEAR ON THE VEHICLE. THIS ISSUE HAS BEEN PRESENT SINCE THE VEHICLE WAS PURCHASED BRAND NEW. I DO HAVE A VIDEO BUT THE 5 MB FILE SIZE LIMIT PREVENTS ME FROM UPLOADING.",
        "vin": "5NPD84LF8LH"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/10/2020",
        "dateOfIncident": "10/03/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363680,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I BAUGHT THIS CAR SEPT 1ST 2020, ON OCTOBER 3RD 2020 WHILE DRIVING THE CAR PN MY WAY TO WORK ON THE HYWAY THE TRANSMITION SLIPED AND STOPPED SHIFTING AND WOULDNT SHIFT OUT OF 2ND GEAR AMD CHECK ENGINE LIGHT CAME ON I WAS QUICK TO PUT THE HAZARD ON AVOIDING COLLISION FROM BEHIND I TOOK IT INTO THE DEALERSHIP. WHERE THEY TOLD ME IT WOULD NEED A FULL TRANSMITION REPLACEMENT DUE TO MANUFACTURE DEFECT. THEY ARE CURRENTLY WITH GDPR THE TRANSMITION TO COME SO I'LL HAVE THIS LONER CAR FOR THE NEXT 2-6 WEEKS.",
        "vin": "5NPD84LF9LH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/07/2020",
        "dateOfIncident": "10/06/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363233,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPLETE TRANSMISSION FAILURE UNDER 2,800 MILES ON THE CAR. HELD 5TH GEAR ONLY AND LIMPED TO VICTORVILLE HYUNDAI WITH CHECK ENGINE LIGHT. EXTREME LOSS OF POWER, DANGEROUS DRIVING CONDITIONS WITH SUDDEN LOSS OF GEARS AND POWER. IN MOTION, HIGHWAY DRIVING AT 60 MPH.",
        "vin": "5NPD84LF9LH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/25/2020",
        "dateOfIncident": "06/04/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361116,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 4,2020,  MY 2020 HYUNDAI ELANTRA'S TRANSMISSION FAILED. THIS CAR HAD ONLY 8,000 MILES ON IT. I WAS ON HIGHWAYS, CITY STREETS, AND THE CAR WOULD STALL AT LIGHTS AND NOT ACCELERATE. THE DRIVERS BEHIND ME DID NOT KNOW THAT WHEN THE LIGHT CHANGED, MY CAR MAY OR MAY NOT MOVE. THE TRANSMISSION COMPLETELY FAILED THAT DAY, AND HYUNDAI IS NOT TAKING RESPONSIBILITY FOR THE DANGER THEY PUT ME IN. I WAS NOT SAFE IN THAT VEHICLE. THE TRANSMISSION WAS REPLACED, BUT I STILL COULD HAVE DIED OR BEEN SEVERELY INJURED THAT DAY. HYUNDAI SUSSMAN IN WILLOW GROVE HAS ALL THE DETAILS. WHEN I ARRIVED TO THE DEALER THAT DAY, AFTER STALLING REPEATEDLY ON THE ROAD, THEY COULD NOT EVEN START THE VEHICLE. I CALLED TWO HYUNDAI DEALERS ASKING FOR HELP. ONE TOLD ME IT WAS SAFE TO DRIVE AND THE OTHER DEALER WOULD NOT ANSWER THEIR PHONE.",
        "vin": "KMHD84LF7LU"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/18/2020",
        "dateOfIncident": "09/14/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11359809,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS ON LOW BEAM HAVE A BLACK LINE ACROSS AND ONLY ABOUT 25 YARD VISIBILITY, ON HIGH BEAM THEY ARE A VERY DULL YELLOW AND THE VISIBILITY OUT IS ABOUT 50 TO 75 YARDS. THE LEVEL OF LIGHT IS SO LOW THAT YOU CANNOT SEE ANYTHING IN THE ROADWAY. THESE LIGHTS ARE VERY DANGEROUS. I HAVE CALLED THE DEALERSHIP PARTS AND SERVICE AND THEY TOLD ME THAT I COULD TRY CHANGING THE FACTORY BULB.",
        "vin": "5NPD84LF1LH"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "08/28/2020",
        "dateOfIncident": "08/20/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11351834,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THURSDAY AUGUST 20 I HAD ACCIDENT AND THE FAC FAILED TO WORK AND NOW I HAVE INJURIES, THIS ACCIDENT WASNT MY FAULT. THE MAN  WAS IN THE LEFT LANE THEN HE DECIDED TO CHANGE HIS MIND AND CAME ALL THE WAY TO THE RIGHT SIDE AND HE WAS IN FRONT AND SENSORS ON MY CAR SHOULD HAVE ALERTED ME AND DIDNT. THANKS",
        "vin": "5NPD84LF0LH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/05/2020",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343545,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "AT AROUND 4,000 THE MILES THE VEHICLE BECAME INCREASINGLY DIFFICULT TO STEER WITH THE STEERING WHEEL REMAINING VERY STIFF AT ALL SPEEDS.  I DO NOT FEEL CONFIDENT IN THE HANDLING OR SAFE MANEUVERING OF THIS VEHICLE.  SOUGHT HELP AT DEALERSHIP THROUGH WARRANTY BUT THEY WERE UNABLE TO DIAGNOSE THE ISSUE.  I AM CONTINUING TO PURSE HELP ON THIS MATTER.",
        "vin": "KMHD84LF8LU"
    },
    {
        "components": "STEERING,WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/21/2020",
        "dateOfIncident": "03/20/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321866,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAD MANY SMALL PROBLEMS TO BEGIN WITH. THE STEERING WHEEL NEVER SAT STRAIGHT AND THERE WERE MANY LIGHTS FOR LOW TIRE PRESSURE EVEN THOUGH THE PRESSURE WAS FINE.   THE TRANSMISSION ALSO BROKE 3 MONTHS AFTER PURCHASING. I NOTICED THE CAR STARTED TO SHAKE AND HANDLE BECAME VERY HARD TO CONTROL. SUDDENLY THE RPM WENT ALL THE WAY 8 ON THE HIGHWAY. THE CAR STARTED TO SHAKE VIOLENTLY AND I HAD TO PULL OVER TO THE SIDE OF THE INTERSTATE. THIS WAS A NEAR MISS ACCIDENT. IF I HAD DRIVEN A LITTLE FURTHER WHERE THERE WAS A MERGE IN THE HIGHWAY, I WOULD HAVE DEFINITELY LOST MY LIFE. WHEN I CALLED HYUNDAI CUSTOMER SUPPORT, THEY ALSO INFORMED ME THAT OTHER HYUNDAI ELANTRA'S WERE ALSO EXPERIENCING TRANSMISSION PROBLEMS AND THEY PREDICTED A RECALL IN THE NEAR FUTURE.",
        "vin": "5NPD84LF8LH"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/27/2020",
        "dateOfIncident": "03/23/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319425,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED TO HEAR A GRIDDING NOISE THAT WAS PROGRESSIVELY BECOMING LOUDER WHEN TURNING LEFT OR RIGHT WHILE DRIVING, FAST OR SLOW, HIGHWAY OR STREET, DOES NOT MATTER. I TOOK THE CAR IN AND THE DEALERSHIP HAD IT FOR A WEEK WHILE REPLACING THE STEERING ASSEMBLY COLUMN (NOT 100% SURE ON EXACT NAMES OF PARTS REPLACED). I GET THE CAR BACK AND THE STEERING PROBLEMS ARE WORSE. NOW THE STEERING WHEEL IS MOVING AROUND WHILE DRIVING. THAT LEVER THAT ALLOWS YOU TO ADJUST THE STEERING WHEEL DOES NOT WORK. I CALL HYUNDAI AND AM TOLD THEY ARE BOOKED AND CAN NOT GET MY CAR IN FOR ALMOST A WEEK. IT GETS TO THE POINT THAT DRIVING IS ALMOST IMPOSSIBLE SO I DECIDE TO TAKE THE CAR IN A FEW DAYS EARLY. AS I'M DRIVING ON THE HIGHWAY GOING ABOUT 70MPH THE STEERING WHEEL DROPS AND IS FLOPPING AROUND AND ALL POWER TO THE CAR GOES OFF MAKING STEERING EVEN WORSE THAN WHAT I THOUGHT WAS THE WORST IT CAN GET. NOW THE CAR IS IN THE SHOP FOR THE SECOND TIME FOR STEERING PROBLEMS AND NOW AN ELECTRICAL PROBLEM.",
        "vin": "KMHD84LF3LU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/24/2020",
        "dateOfIncident": "03/21/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319176,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST THE CAR WAS IN THE SHOP FOR A WEEK HAVING THE STEERING FIXED. A WEEK LATER AND STEERING IS BROKEN AGAIN. STEERING WHEEL DOES NOT STAY IN PLACE. MAKES IT FOR A FUN DRIVE ON THE FREEWAY. I HOPE I GET INTO AN ACCIDENT BECAUSE OF THIS BECAUSE THEN HYUNDAI MIGHT LISTEN TO MY CONCERNS.",
        "vin": "KMHD84LF3LU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/18/2020",
        "dateOfIncident": "03/12/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318549,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 HYUNDAI ELENTRA <5,000 MILES CITY/URBAN DRIVING WHEN ATTEMPTING TO ACCELERATE FROM STOP; TRANSMISSION QUIT WORKING WOULD NOT SHIFT OUT OF FIRST GEAR. THE CAR WOULD NOT GO ABOVE 10-20 MPH ALMOST CAUSING AN ACCIDENT BY THE NEXT DRIVER ACCELERATING INTO THE BACK OF THE CAR.    DEALERSHIP WANTS TO REPLACE TRANSMISSION WITH A RE-MANUFACTURED UNIT. I HAVE IT SINCE AFTER THANKSGIVING 2019",
        "vin": "5NPD74LF8LH"
    },
    {
        "components": "STEERING,AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "03/14/2020",
        "dateOfIncident": "11/29/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317971,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR SOLD TO ME WITH OUT IT BEING DISCLOSED THAT IT WAS CRASHED NOW MY LKA WILL KILL YOU IF USED AND THE FENDER IS OBVIOUSLY REPAINTED MY STEERING IS WEIRD AND IT WAS SUPPOSED TO BE NEW PURCHASED AT 6 MILES CRASH REPORTED AT 0 REPAIR COMPLETED 2/10 MY PURCHASE 2/11",
        "vin": "5NPD84LF7LH"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/28/2020",
        "dateOfIncident": "12/20/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11312174,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 60 MPH ON A HIGHWAY I ENGAGED THE CRUISE CONTROL.  TO MY SURPRISE THE ENGINE SPEED INCREASED BY 500-700 RPM.  THIS SEEMS TO ME TO BE A DEFECT IN THE WAY THE INTELLIGENT VARIABLE TRANSMISSION (IVT) SHOULD OPERATE OR ANY TRANSMISSION SHOULD OPERATE.  THE RESULT IS THAT GAS MILEAGE WILL DECREASE AND ENGINE WEAR INCREASE AS A RESULT OF HIGHER RPM THAN NECESSARY.  I BELIEVE THIS IS A DEFECT AND SHOULD RESULT IN A RECALL BY HYUNDAI TO CHANGE THE OPERATION OF THE TRANSMISSION.  THERE ARE MANY COMPLAINTS ABOUT THIS ISSUE FROM OWNERS.  I HAVE CONTACTED MY DEALER AND THEY, IN TURN, CONTACTED HYUNDAI.  I HAVE ALSO CONTACT HYUNDAI CUSTOMER CARE.  AS OF THIS WRITING I HAVE NOT RECEIVED ANY INDICATION FROM HYUNDAI THAT THIS CONDITION EXISTS AND THAT IT IS A PROBLEM.  I'M HOPING YOU CAN REQUIRE A RECALL TO ADDRESS THE ISSUE.",
        "vin": "5NPD84LF7LH"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "02/26/2020",
        "dateOfIncident": "02/20/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311552,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS SOLD TO ME NEW I TOOK IT IN FOR AN INSPECTION IN THE FIRST WEEK OF OWNERSHIP AND THE TECH SLIPPED ME A NOTICE OF A ACCIDENT AND REPAIR COMPLETED AT 0-5 MILES OF ITS LIFE I PURCHASED AT ONLY 6 MILES THEY KEEP TELLING ME I'M LYING.  INCIDENT DATE 9/1/19 REPAIR DATE 2/10/20 COMPLETED REPAIR 2/11/20 DATE I PURCHASED 2/12/20 I TOOK IT IN BECAUSE LKA KEEP MOVING THE WHEEL RIGHT LEFT OVER N OVER, OVER CORRECTING ITSELF I BELIEVE. VERY SCARY WHEN ON THE FREEWAY IN TRAFFIC IN DOWNTOWN LOS ANGELES.  I DO NOT KNOW ANYTHING DETAIL OF THIS REPAIR OR INCIDENT I WAS ONLY GIVEN THIS PAPER AFTER PURCHASE THEY DIDN'T DISCLOSE IT BEFORE PURCHASE.  WHEN I LOOK UP THE VIN IT NEVER COMES UP WITH MY CARS MODEL EITHER",
        "vin": "5NPD84LF7LH"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "02/26/2020",
        "dateOfIncident": "02/24/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311663,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE CAR AT THE SPEED RANGE OF 40-70 MPH THE STEERING WHEEL UNDERGOES ABRUPT STIFFNESS CHANGE FROM STIFF TO VERY SOFT CAUSING SUDDEN JOLT OF THE VEHICLE RIGHT OR LEFT DEPENDING ON THE ROAD CONDITION. THIS HAPPENS ALL THE TIME AT THIS SPEED RANGE. LOST CONTROL RESULTING IN ALMOST CRASHING INTO A DIVIDE BARRIER. DRIVING REQUIRES MAINTAINING THE STEERING WHEEL IN STRONG GRIP AT ALL TIME AND A LOT OF EXPERIENCE TO AVOID LOSS OF CONTROL.",
        "vin": "5NPD74LF3LH"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/23/2020",
        "dateOfIncident": "02/20/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310831,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2/20/2020 - I WAS DRIVING MY NEW 2020 ELANTRA (LESS THAN 5,000 MILES ON IT) AND I NOTICED THE CAR WAS NOT ACCELERATING SMOOTHLY. THE RPM NEEDLE WAS REVVING ABNORMALLY WHENEVER I TRIED TO ACCELERATE. WHEN I PRESSED THE GAS FROM A DEAD STOP THE CAR WOULD SHUTTER BEFORE ACCELERATING. ON MY WAY HOME FROM WORK THE SAME DAY I WAS HAVING THE SAME ISSUES BUT AS I MERGED (TURNING) ONTO A HIGHWAY THE CAR SUDDENLY STOPPED ACCELERATING ALL TOGETHER AND I WAS NOT ABLE TO GO MORE THAN 10-20 MPH. SINCE IT WAS AT A MERGE THERE WAS ALMOST A COLLISION, BUT I WAS ABLE TO PULL OVER BEFORE ANYTHING HAPPENED. 2/21/2020- THE NEXT DAY WHILE I WAS AT WORK MY HUSBAND TRIED TO DRIVE MY CAR TO THE DEALER. HE EXPERIENCED THE SAME ISSUES AND WHEN HE GOT TO THE DEALERSHIP HE WAS UNABLE TO TURN THE CAR INTO THE SERVICE STATION BECAUSE THE CAR WOULD NOT ACCELERATE. SERVICE WORKERS HAD TO PUSH THE CAR INTO THE BAY TO BE LOOKED AT. THE EMPLOYEE TOLD US THIS WAS ABOUT THE 15TH 2020 ELANTRA THEY HAVE SEEN WITH THE SAME TRANSMISSION ISSUE. NO EMERGENCY LIGHTS CAME ON IN THE CAR DURING EITHER INCIDENTS. SINCE NO LIGHTS CAME ON DURING THE INCIDENT, I WAS VERY HESITANT TO DRIVE THE CAR AGAIN.",
        "vin": "5NPD84LF5LH"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/19/2020",
        "dateOfIncident": "01/22/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11310064,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "A CAR DARTED INTO MY LANE AT 90 DEGREES. MY RENTAL CAR RIGHT CORNER ENDED UP AGAINST THE OTHER CAR'S LEFT FENDER.   THE DRIVER AIRBAG DID NOT DEPLOY BUT DID START TO INFLATE.  A LOT OF DARK GRAY SMOKE ISSUED FROM THE STEERING COLUMN FOR A LONG TIME AFTER THE BAG STARTED TO DEPLOY.  THE BAG COVER APPEARED TO EXTEND ABOUT 6\" FROM THE STEERING WHEEL AND THE SIDES LOOKED PLEATED, LIKE AN ACCORDION BELLOWS.  ALSO SOMETHING HAPPENED UNDER THE DASH AROUND THE PEDALS.  I SAW A RECTANGULAR LIGHT COLORED AREA 4-9' TALL AND 10-20\" WIDE AS IF A PANEL HAD BLOWN OFF A LOWER AIRBAG BUT NO INFLATION OCCURRED THERE AT ALL.   JAN. 22, 2020 ON BON AIR RD, KENTFIELD.  NOT SURE IF I WAS ABLE TO BRAKE.  PASSENGER SIDE AIRBAG DID NOT DEPLOY EVEN THOUGH THERE WAS A PASSENGER IN THE FRONT SEAT.  RENTAL COMPANY ASKED THAT THE CAR BE TOWED TO A BODY SHOP.",
        "vin": "5NPD84LF8LH"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/05/2020",
        "dateOfIncident": "02/05/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301990,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 HYUNDAI ELANTRA. CONSUMER WRITES IN REGARDS TO CRUISE CONTROL PROBLEM. *LD    THE CONSUMER STATED ENGAGING THE CRUISE CONTROL CAN CAUSE HIGHER RPMS TO MAINTAIN THE SET SPEED. THIS CAN CAUSE EXTRA WEAR ON THE MOTOR AND DECREASED GAS MILEAGE. THE CAUSE OF THE FAILURE MAY BE DUE TO THE NEW VARIABLE SPEED TRANSMISSION.*JS",
        "vin": ""
    },
    {
        "components": "STRUCTURE,VEHICLE SPEED CONTROL,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "02/03/2020",
        "dateOfIncident": "02/03/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300931,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 HYUNDAI ELANTRA. CONSUMER WRITES IN REGARDS TO UNINTENDED ACCELERATION. *LD    THE CONSUMER STATED THE CRUISE CONTROL WAS ACTIVATED. WHILE DRIVING UP A HILL, THE VEHICLE SPED UP PAST THE SET SPEED. THE DEALER AND MANUFACTURER WERE NOTIFIED AND STATED THE VEHICLE WAS OPERATED AS DESIGNED. WHILE DRIVING, THE STEERING SUDDENLY JERKED TO THE LEFT ABOUT 1.5 INCHES. THE DEALER TURNED THE SENSITIVITY LEVEL ON THE LANE ASSIST. ALSO, THE VEHICLE DOES NOT A METAL SCREEN OVER THE AIR INTAKE FOR THE HEATER. THIS COULD ALLOW RODENTS TO ENTER INTO THE CAB. *JS",
        "vin": ""
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/26/2020",
        "dateOfIncident": "01/06/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301897,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELDS SAFETY DEFECT ' HYUNDAI ELANTRA 2020   GREETINGS,   I AM WRITING TO INFORM YOU OF MY PURCHASE OF A DEFECTIVE BRAND-NEW HYUNDAI ELANTRA LESS THAN THREE WEEKS AGO ON JANUARY 06, 2020, FROM BOB BAKER HYUNDAI IN CARLSBAD, CALIFORNIA. WHILE TEST DRIVING THE CAR, I NOTICED A HAZINESS TO THE WINDSHIELD WHEN DRIVING DIRECTLY INTO THE SUN. I WAS TOLD BY A HYUNDAI SALESMAN, [XXX] THAT THIS HAZINESS MIGHT BE DIRT AND THAT THE DEALERSHIP WOULD WASH THE CAR BEFORE I TOOK IT HOME THUS TAKING CARE OF THE PROBLEM. LATER, AFTER A CAREFUL EXAMINATION, I OBSERVED THAT THE WINDSHIELD HAD A SPECKLE DEFECT CAUSING MASSIVE SCATTERING AND HAZINESS OF MY FIELD OF VISION WHEN DRIVING DIRECTLY INTO THE SUN, A FREQUENT DRIVING CONDITION HERE IN SOUTHERN CALIFORNIA. I ALSO OBSERVED THAT THIS DEFECT EXISTS IN ALL SIX CAR WINDOWS (FRONT WINDSHIELD, FOUR SIDE WINDOWS AND BACK WINDSHIELD). THIS DEFECT IS PARTICULARLY NOTICEABLE SINCE I COMMUTE EARLY MORNINGS AND EVENINGS, TIMES WHEN THE SUN IS LOW AND DIRECTLY IN MY FIELD OF VISION.   I WANT TO EMPHASIZE THAT THIS MANUFACTURING DEFECT IMPAIRS THE DRIVABILITY OF THE CAR AND IS A CONSIDERABLE RISK TO MY PERSONAL SAFETY. IT IS HARD FOR ME TO DETERMINE IF THIS DEFECT MIGHT NOT ALSO BE CAUSING A MECHANICAL DEGRADATION OF THE WINDSHIELD'S STRENGTH.   ON JANUARY 24, 2020, I TOOK THE VEHICLE BACK TO THE DEALERSHIP AND MET WITH [XXX], THE SALES MANAGER. DURING THIS MEETING THE HYUNDAI REPRESENTATIVE EASILY DETECTED AND CONFIRMED THE WINDOWS' DEFECT. THIS REPRESENTATIVE ALSO TOLD ME THAT THE DEALERSHIP WAS AWARE OF THIS DEFECT AND THAT OTHER CUSTOMERS HAD REPORTED THIS ISSUE   I ALSO LEARNED THAT I AM NOT THE ONLY CUSTOMER THAT HAS HAD THIS COMPLAINT AND THAT THE VEHICLE WAS KNOWINGLY SOLD TO ME IN THIS CONDITION. I'M ATTACHING FIVE (5) IMAGES THAT DEMONSTRATE THIS DEFECT.  BEST REGARDS,  [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "5NPD74LF3LH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/01/2020",
        "dateOfIncident": "12/31/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11292460,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS  BRAND NEW CAR THAT I PURCHASED 35 DAYS AGO THAT NOW HAS 1295 MILES ON IT. I ENTERED THE STREET FROM A PARKING LOT, THERE WAS HEAVY TRAFFIC AT THE TIME SO I DID NEED TO EXCELLERATE RAPIDLY WHEN I PULLED OUT. UNFORTUNATELY ONCE I WAS IN THE ROAD THE CAR HAD NO POWER AND WOULD NOT PICK UP SPEED. THE ENGINE RPM WAS INCREASING BUT THE CAR WAS NOT PICKING UP SPEED. CARS WERE ON MY BUMPER BLASTING THEIR HORNS AND I CAN'T BLAME THEM, I'M LUCKY I DIDN'T CAUSE AN ACCIDENT. I TRIED TO MANUALLY SHIFT THE CAR TO SEE IF IT HELPS BUT IT WOULD NOT CHANGE GEARS AND I WAS SLOWING PICKING UP SPEED. I HAD TO CALL HYUNDAI ROADSIDE ASSISTANCE TO COME TOW THE CAR.",
        "vin": "5NPD74LF2LH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/16/2019",
        "dateOfIncident": "12/15/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289328,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT DROVE A 2020 HYUNDAI ELANTRA LOANER VEHICLE. WHILE THE CONTACT'S SON WAS DRIVING, THE VEHICLE REVVED TO APPROXIMATELY 80 MPH AND THEN SUDDENLY STALLED. THE DRIVER STATED THAT THE CHECK ENGINE INDICATOR ILLUMINATED. THE CONTACT'S SON COASTED THE VEHICLE OFF THE ROAD AND STARTED THE VEHICLE, BUT IT DID NOT RESPOND. AFTER APPROXIMATELY TWO MORE ATTEMPTS, THE VEHICLE REGAINED POWER. THE CONTACT CALLED BURDICK HYUNDAI (LOCATED AT 7820 HOGAN DRIVE S, CICERO, NY 13039, 315-452-7000). THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 1,000. THE VIN WAS UNKNOWN.  *LN  *TR",
        "vin": "5NPD74LF6LH"
    },
    {
        "components": "STEERING,WHEELS,ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "12/03/2019",
        "dateOfIncident": "11/21/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11286542,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I PULLED OUT OF MY DRIVE WAY AT ABOUT 5 MPH AND BEGAN INCREASING SPEED (10-15 MPH), I FELT LIKE MY FRONT TIRES MAY HAVE NEEDED AIR.  I CHECKED MY DASH AND CONFIRMED THAT ALL THE SENSORS FOR TIRE PRESSURE WERE ON AND WORKING AND THE AIR PRESSURE SEEMED TO BE FINE.  I BEGAN TO INCREASE SPEED AND BY THIS TIME WAS TRAVELING EAST BOUND AT APROX. 55 MPH  ON THE HWY, WHEN THE FRONT LEFT TIRE SUDDENLY FELT LOOSE. I WASN'T SURE IF IT WAS MY TIRE OR THE ROAD ITSELF BUT BEFORE I COULD EVEN SWITCH LANES MY TIRE SEEMED TO JERK ME OVER TO THE LEFT SIDE OF THE ROAD.  MY BACK TIRE FELL OFF THE LEDGE OF THE HWY AND CAUSED ME TO PULL THE WHEEL TO TRY TO CORRECT THE IMBALANCE BUT I DIDN'T HAVE ENOUGH TIME BEFORE THE STEERING WHEEL WAS WANDERING OFF TOWARD THE LEFT CAUSING ME TO SMASH HEAD ON INTO A TREE INTO THE CENTER DIVIDER.",
        "vin": "5NPD84LF0LH"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/30/2019",
        "dateOfIncident": "10/28/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277049,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 70 MPH ON OHIO TURNPIKE THE TRANSMISSION SLIPPED OUT OF GEAR AND WOULD NOT ALLOW THE CAR TO SHIFT INTO ANY GEARS. AFTER PULLING OVER AND RESTARTING THE CAR THE FASTEST IT WOULD GO WAS 10 MPH .",
        "vin": "5NPD84LF7LH"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "09/25/2019",
        "dateOfIncident": "09/22/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257932,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 HYUNDAI ELANTRA. WHILE DRIVING 60 MPH, THE FORWARD COLLISION AVOIDANCE SYSTEM FAILED TO WARN OF AN ICE BUCKET IN THE ROADWAY. WHILE ATTEMPTING TO AVOID THE ICE BUCKET, THE CONTACT STRUCK THE ICE BUCKET WITH THE PASSENGER SIDE BUMPER. THE CONTACT STATED THAT THERE WAS PHYSICAL DAMAGE TO THE BUMPER. A POLICE REPORT WAS FILED AND THERE WERE NO INJURIES. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR THE BODY REPAIRS. THE VEHICLE WAS TAKEN TO ATLANTIC HYUNDAI (193 SUNRISE HWY NORTH SERVICE RD, WEST ISLIP, NY 11795, (631) 587-0700) WHERE IT WAS DIAGNOSED THAT THE FORWARD COLLISION AVOIDANCE SYSTEM FUNCTIONED AS INTENDED. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 500. THE VIN WAS NOT AVAILABLE.  *TR*JB *DT *DL",
        "vin": ""
    }
]