[
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/31/2022",
        "dateOfIncident": "03/30/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459122,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving down the freeway, the sunroof of my vehicle exploded. This was not caused by a foreign object, there was nothing on or near my car at the time of the incident, and upon pulling off of the roadway I was able to confirm that no foreign object had entered the vehicle. It was an explosion sound accompanied by glass falling into the vehicle, a large hole in the sunroof, and the glass on the edge of the hole appearing in an upward direction as though the force of the explosion came from inside the vehicle. The vehicle was being operated in a normal manner at the time of the incident, there was nothing to indicate any potential issue with the vehicle. The hazards associated with this incident include the potential for loss of vehicle control following the loud and unexpected explosion and the potential for injury from falling glass. The vehicle was taken directly to the Hyundai dealership where it was purchased, where service staff confirmed the upward appearance of the glass and stated that the repairs would be covered by the vehicle warranty.",
        "vin": "5nms5caaxlh"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "03/23/2022",
        "dateOfIncident": "03/16/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458051,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "We are experiencing exactly what is listed in HYUNDAI TSB #21-BE-005H:  intermittent abnormal camera image display conditions on the instrument cluster when the turn left signal is turned on or the radio screen when transmission is in reverse.",
        "vin": "5NMS5CAA6LH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/10/2022",
        "dateOfIncident": "03/10/2022",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455990,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "This car just caught on fire in my fathers driveway at midnight last night...doesnt appear to be from engine compartment",
        "vin": "5nms5cad8lh"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/13/2022",
        "dateOfIncident": "02/13/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451751,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVERS DOOR IS NOT PROPERLY ALIGNED. WHEN YOU DRIVE IT ON THE ROAD YOU CAN HEAR A HISSING SOUND OF THE AIR PENETRATING IN THE CABIN. THE DOOR APPEARS NOT TO BE  CLOSED PROPERLY, THERE IS A GAP. IF YOU LOOK AT THE ALGINMENT OF THE PASSANGERS DOOR, THE DOOR IS PROPERLY ALIGNED WITH THE REST OF THE BODY OF THE SANTA FE, BUT THAT IS NOT THE CASE WITH THE DRIVERS DOOR. I AM PLANNING CONTACTING HYUNDAI DIRECTLY, BECAUSE IF THEY MAINTAIN QUALITY CONTROLS, THIS CAR DID NOT PASSED THAT TEST. DURING 2021I DID NOT DRIVE THE CAR  ON THE ROAD, BUT LATELY I TOOK 4 TRIPS TO SC, AND ON THE ROAD THE HIZZING SOUND IS NOTICIBLE.",
        "vin": "5NMS53AA3LH"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/11/2022",
        "dateOfIncident": "02/11/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451475,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The tires has a big noise like, it sounds like bum bum bum bum bum, and I bought this car brand new, I went To the dealer and they said there is not warranty for tires, that’s not good, because the noise still there.",
        "vin": "5NMS23AD7LH"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "01/26/2022",
        "dateOfIncident": "01/26/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449004,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Blind Spot System randomly fails to detect vehicle on right side, I have videos of failure. Dealer unable to find problem cause, contacted Hyundai customer service, waiting for response.",
        "vin": "5NMS5CAD7LH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/06/2021",
        "dateOfIncident": "10/05/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435774,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "This is the 2nd 2020 Santa Fe that this has occurred on as well as a 2019 Santa Fe that we formally owned within the last 2 years. The windshield does not take rock hits well. On all three vehicles a rock strike on the windshield not only left a large star impact, but the crack from the impact reaches all the way to the roof pillar. The crack is long. I believe the windshield glass is substandard and needs to be looked into closer as being a possible safety risk. Replacing the windshield and camera recalibration is expensive.",
        "vin": "5NMS33AD7LH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/06/2021",
        "dateOfIncident": "06/01/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435776,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "This is the 1st of two 2020 Santa Fe's that this has occurred on as well as a 2019 Santa Fe that we formally owned within the last 2 years. The windshield does not take rock hits well. On all three vehicles a rock strike on the windshield not only left a large star impact, but the crack from the impact reaches all the way to the roof pillar. The crack is long. I believe the windshield glass is substandard and needs to be looked into closer as being a possible safety risk. Replacing the windshield and camera recalibration is expensive.",
        "vin": "5nms33ad7lh"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/10/2021",
        "dateOfIncident": "08/24/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432467,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving on the highway, the front pane of the panoramic sunroof spontaneously shattered. No contact from a foreign object was observed or heard prior to the breakage. The roof was closed, thus our family avoided any glass showering down into our cabin, but this would have been catastrophic had it happened with the roof open. This problem has happened to prior year models of the Santa Fe. Hyundai dealership has agreed to repair the broken sunroof at no cost, however, does not admit fault with the manufacture of the glass.",
        "vin": "5NMS5CAA4LH"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/10/2021",
        "dateOfIncident": "07/30/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432499,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Kumho Tire Co., Inc.",
                "productMake": "KUMHO",
                "productModel": "CRUGEN KL33",
                "productYear": "9999",
                "size": "235/60R18",
                "type": "Tire"
            }
        ],
        "summary": "Failed tire in question: Tire failed immediately when apparent road hazard occurred on a major freeway.  Exited freeway and located a area where  I was able to pull over.  After changing said tire (Kumho 235.60/R18) I attempted to inspect tire and found the steel belt failed (punctured).  Upon further investigation I observed that the steel belt has covered with less than as less than a 1/6th inch of rubber thereby exposing the belt for a potential failure.  At this point the mileage said tire was 7700.  As of yet the tire warranty has not been confirmed.  This tire was delivered on a new 2020Hyundai Santa Fe limited.",
        "vin": "5nms53ad1lh"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/08/2021",
        "dateOfIncident": "08/07/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432191,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Hyundai Santa Fe. The contact stated while driving 70 MPH, the contact heard a loud explosion. The contact felt the wind coming from the sunroof. The contact pulled over to the side of the road and saw that the glass sunroof had exploded and shattered. The contact stated that no object had struck the sunroof to cause it to explode. The contact was able to continue driving to her destination. The contact took the vehicle to a local dealer to have the vehicle inspected however, the vehicle was not diagnosed or repaired. The manufacturer was made aware of the failure. The failure mileage was approximately 15,000.",
        "vin": "5nms5cad3lh"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/21/2021",
        "dateOfIncident": "07/18/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425754,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The air conditioner quits working after a few minutes if the temperature is over 80 degrees. This has happened multiple times, at least 6 times. I took the car into Hyundai dealer and they said they could fine nothing wrong with it. As soon as we got it back from the dealer it happened again. Heat stroke was our only safety concern.  No warning light has ever come on to report this breakdown.",
        "vin": "5NMS53AAXLH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/04/2021",
        "dateOfIncident": "05/20/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419697,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The Rear Occupancy alarm, a Safety Feature, goes off commanded usually at night with the vehicle locked and unoccupied.  Dealer is unable to find a fix and has no way to prevent further occurrences.  They recommend disabling the system, removing this system from the safety features of this vehicle.",
        "vin": "5NMS53AD9LH"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/23/2021",
        "dateOfIncident": "05/20/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418228,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Hankook Tire & Technology Co., Ltd.",
                "productMake": "HANKOOK",
                "productModel": "DYNAPRO HP2",
                "productYear": "9999",
                "size": "235/65/R17",
                "type": "Tire"
            }
        ],
        "summary": "The driver rear tire may be leaking air and the pressure monitoring system shows the pressure is 27-28.  The car was brought brand new from Hyundai of Torrance, CA on 20 Jan 2020 and as of this date, 23 May 2021, the mileage is 2,007 miles.  I have taken the car into the dealership twice about the tire (second time was on 20 May 2021) and they keep saying they don't fix tires and it may have a slow leak.  I find this unacceptable and I feel like I'm being taken advantage of (I'm a senior citizen).  I plan on driving to another state and I want to ensure the safety of myself and passengers.   Just now, I checked the pressure monitoring system and the light is not on.  At this point, I don't know if it's tire issue or the electronic system issue.  Unfortunately, I don't have any documentation, but perhaps the Hyundai dealership have something on their service database/computer.",
        "vin": "5NMS33AD9LH"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/12/2021",
        "dateOfIncident": "03/21/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416261,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "NEW 2020 SANTAFE TOOK DELIVERY ON JANUARY 4TH, 2021, WITH LESS THAN 5000 MILES ON MARCH 21ST THE VEHICLE REFUSE TO START AFTER IT WAS STARTED AND SHUT OFF WHILE WE WERE SITTING IN A PARKING LOT. WHILE ATTEMPTING TO START IT GETTING FORWARD COLLUSION WARNING BUT THE ENGINE WOULD NOT CRANK. TOWED TO THE LOCAL DEALER WAS TOLD THEY CANNOT DIAGNOSE THE CAR BECAUSE THEY COULD NOT READ THE ONBOARD COMPUTER, UNABLE TO SAY WHAT'S WRONG. THE CAR WAS TOWED BACK TO THE DEALER WHERE PURCHASE AND WAS TOLD IT WAS A BLOWN FUSE MAYBE LIGHTING STRIKE AND OTHER THEORIES WHAT'S WRONG. THE DEALER WOULD REPLACE THE FUSE AND COMPUTER AFTER 52 DAYS THE CARE IS STILL AT THE DEALER WAITING ON PARTS. TOTAL ELECTRICAL FAILURE WITH NO RECOURSE AT THE MOMENT, HYUNDAI MOTOR OF AMERICA CONSUMER AFFAIRS WANTS US TO SIGN A SETTLEMENT AGREEMENT TO REFUND OUR EXPENSES AND HAVE NOT FIXED OR REPLACED THE CAR. THE MANUFACTURE IS TOTALLY DRAGGING THEIR FEET AND DENYING THE CAR SUFFER A TOTAL ELECTRICAL FAILURE, WHILE THE BATTERY WAS STILL IN WORKING CONDITION ACCORDING TO AAA.",
        "vin": "5NMS53AD5LH"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/05/2021",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11415353,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN A MAJOR CAR ACCIDENT AND THE CAR THAT HIT ME WAS TRAVELING ABOUT 60 MPH HIT ME IN THE REAR AND THE AIR BAG NEVER DEPLOYED, THIS IS VERY CONCERNING AND SHOULD BE LOOKED AT. I WAS STOPPED AT A RED LIGHT WHEN I GOT HIT.",
        "vin": "5NMS3CAD2LH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/19/2021",
        "dateOfIncident": "06/24/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403919,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE ARE THREE ISSUES:  1.) IN SPORT MODE, THE TRANSMISSION WILL SOMETIMES GET STUCK/HUNG IN GEAR (MAYBE GEAR 3 OR GEAR4) AND WILL NOT SHIFT INTO THE NEXT GEAR, EVEN WHEN INCREASING SPEED.   2.) ALSO IN SPORT MODE, AFTER DRIVING FOR ABOUT 10 OR 15 MINUTES THE TRANSMISSION WILL OFTEN SLIP INTO GEAR 5, AFTER REVVING HIGH AND CAN BE HEARD REVVING, BUT IT IS NOT REFLECTED ON THE TACHOMETER, AND THEN WHEN THE GEAR CATCHES IT IS A VIOLET JERK FORWARD.  3.) LASTLY, IN ANY MORE, BUT MOST PRONOUNCED IN \"SMART MODE\" AFTER TAKING OUT FROM A COMPLETE STOP, AND ESPECIALLY AFTER THE ENGINE GOES INTO AUTO SHUT OFF MODE, THE TRANSMISSION WILL STUTTER AT ABOUT 3 - 5 MPH AND FEELS AS IF POWER HAS BEEN LOST FOR  A FEW SECONDS. THIS IS  MOST TERRIFYING WHEN MAKING A LEFT TURN INTO TRAFFIC, AS YOU NEVER KNOW IF IT WILL HAPPEN OR NOT.",
        "vin": "5NMS33AD7LH"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/13/2021",
        "dateOfIncident": "03/11/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402818,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Hankook Tire & Technology Co., Ltd.",
                "productMake": "HANKOOK",
                "productModel": "DYNAPRO HP2",
                "productYear": "9999",
                "size": "235/65/R17",
                "type": "Tire"
            }
        ],
        "summary": "WAS DRIVING DOWN THE ROAD ABOUT 40 MPH, SLOWED DOWN TO ABOUT 10 TO 15 MPH TO MAKE A RIGHT HAND TURN WHEN THE RIGHT REAR TIRE ON MY 2020 HYUNDAI SANTA FE VIN: [XXX], EXPLODED RIPPING SEVERAL INCHES INTO THE SIDEWALL. HAD NO KNOWLEDGE OF HITTING ANYTHING ANY TIME PRIOR TO THE TIRE EXPLODING AND NOTHING IN THE ROADWAY TO CAUSE SAID DAMAGE AT THE SIGHT OF THE EXPLOSION. TEMPERATURE AT THE TIME OF THE EXPLOSION WAS ABOUT 55 DEGREES, NOT TO COLD OR TO HOT. HAD ONLY DRIVEN ABOUT 3 OR 4 MILES ON THE TIRE PRIOR TO EXPLOSION, SO HEAT WAS MOST LIKELY NOT PART OF THE PROBLEM. TIRES WERE MADE BY HANKOOK TIRES, DYNAPRO HP2, SIZE 235/65/R17 104H, DOT 15M8R RT HO 2719, WITH ABOUT 29,000 MILES ON THE TIRES, VERY LITTLE WEAR AT ALL THE TIRE, WITH AIR PRESSURE MAINTAINED AT ALL TIMES TO ABOUT 35 TO 36 PSI WHICH WAS CHECKED ALMOST DAILY. OF ALL OF MY YEARS OF DRIVING HAVE HAD FLAT TIRES, BUT NEVER HAVE I HAD A TIRE JUST EXPLODE AS IN THIS INSTANCE WITH THIS TIRE. FEEL LIKE THIS SHOULD HAVE BEEN REPORTED IN CASE OTHERS MAY HAVE EXPERIENCED ANY SIMILAR ISSUES WITH THESE TIRES. HANKOOK, DYNAPRO HP2, 235/65R17 104H, DOT 15M8R RT HO 2719.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "5NMS33AD5LH"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/08/2021",
        "dateOfIncident": "02/02/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399665,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2020 HYUNDAI SANTA FE FOWARD COLLISION AVOIDANCE ASSISTANCE SYSTEM IS NOT FUNCTIONING CORRECTLY. WE HAVE CONTACTED HYUNDAI ON MULTIPLE OCCASIONS WITHOUT RESPONSE. THE SYSTEM IS BRAKING IN THE MIDDLE OF THE ROAD WITHOUT AND CAUSE. NO CARS ARE IN ANY PROXIMITY AND THE CAR BRAKES IN THE MIDDLE OF THE ROAD. THIS HAS OCCURRED TWICE WITHOUT WARNING IN THE LAST SEVERAL MONTHS. DEALERSHIP HAS NO ANSWER WHEN WE TOOK THE CAR IN. HYUNDAI CONSUMER LINE DOES NOT RETURN CALLS. IT IS AN EXTREME DANGER WITH OUR SON DRIVING CAR. REAR END COLLISON WILL HAPPPEN IF THIS CONTINUES.",
        "vin": "5NMS3CAD5LH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/15/2021",
        "dateOfIncident": "02/14/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396388,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN STOPPED AT A TRAFFIC LIGHT AND THE AUTO ENGINE TURN OFF KICKS IN AS EXPECTED WITH MY FOOT ON THE BRAKE PEDAL. HOWEVER, THE BEHAVIOR IS VERY ERRATIC WHEN I RELEASE MY FOOT FROM THE BRAKE. SOMETIMES THE VEHICLE JUMPS AGGRESSIVELY WITHOUT ME APPLYING ANY ACCELERATION AND SOMETIMES THE ENGINE JUST STARTS AND THE VEHICLE DOES NOT MOVE UNTIL I APPLY SOME ACCELERATION. I ALMOST REAR ENDED THE CARS INFRONT OF ME FEW TIMES. I GOT WAY TOO SKEPTICAL AND BEGAN TURNING OFF THE AUTO TURN OFF FEATURE WHEN I GET INTO MY CAR.",
        "vin": "5NMS5CAA5LH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/06/2021",
        "dateOfIncident": "02/04/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395020,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 9/25/20 I FILED A VEHICLE COMPLAINT BASED ON THE FACT THAT THE HORN ON MY 2020 SANTA FE HAD TWICE WORKING, REQUIRING THE DEALER TO REPLACE PARTS.  (TRACKING NUMBER 11371071.) THE HORN HAS AGAIN STOPPED WORKING AND IS BACK IN THE DEALER'S REPAIR SHOP.  THE CAR CURRENTLY HAS APPROXIMATATELY 5600 MILES ON IT AND WAS PURCHASED IN 7/20.",
        "vin": "5NMS33AD1LH"
    },
    {
        "components": "STEERING,SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/04/2021",
        "dateOfIncident": "01/04/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394630,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TO MANY PROBLEMS TO LIST.",
        "vin": "5NMS5CAA1LH"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/14/2021",
        "dateOfIncident": "12/29/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388136,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT WINDSHIELD HAS DEVELOPED NUMEROUS PIN-HEAD SIZE STAR SHAPED CRACKS THAT MOSTLY CAN BE SEEN WHEN CAR IS POINTED TOWARD THE SUN. THIS HAPPENED ALL OF A SUDDEN. I TRIED TO PHOTO BUT I CAN NOT GET A GOOD PICTURE. THIS DID NOT HAPPEN WHILE DRIVING.",
        "vin": "5NMS33AD5LH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/12/2021",
        "dateOfIncident": "07/09/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387645,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "LEASED A 2020 SANTA FE ON APRIL 24, 2020 AND ON JULY 9, 2020 IT STALLED AND ALL THE LIGHTS ON MY DASHBOARD LIT UP LIKE A CHRISTMAS TREE AND AFTER 20 MINS. WAS ABLE TO START IT. THE DEALER SAID NOTHING WRONG. IN AUGUST 2020 THE CAR WOULDN'T START, AFTER A ROAD SIDE ASSISTANCE JUMP THE DEALER SAID I'M NOT STARTING IT ENOUGH. IN OCTOBER SAME THING HAPPENED I GOT A NEW BATTERY FROM THE DEALER. IN DECEMBER THE SAME THING HAPPENED I GOT ANOTHER NEW BATTERY. THEY REFUSE TO ADMIT SOMETHING IS DRAWING POWER FROM THE BATTERY IN THE OFF POSITION. INSTEAD THEY SAY I'M NOT STARTING THE CAR ENOUGH. I START THE CAR 2 TO 3 A WEEK.",
        "vin": "5NMS3CAD5LH"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/09/2020",
        "dateOfIncident": "12/04/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378654,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 HYUNDAI SANTA FE. THE CONTACT STATED THAT WHILE THE VEHICLE WAS BEING TRANSPORTED, THE CONTACT LEARNED THAT THE GAS CAP HAD DETACHED FROM THE VEHICLE. THE CONTACT TOOK THE VEHICLE TO O'BRIEN HYUNDAI OF FORT MYERS (2850 COLONIAL BLVD, FORT MYERS, FL 33966; (239) 277-1222) WHERE THE GAS CAP WAS REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND OPENED A CASE. THE APPROXIMATE FAILURE MILEAGE WAS 4,862.",
        "vin": "5NMS3CADXLH"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "11/12/2020",
        "dateOfIncident": "10/27/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374306,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "HYUNDAI 2020 SANTA FE LIMITED BLIND SPOT COLLISION-AVOIDANCE ASSIST (BCA) SYSTEM    WHEN SET IN ACTIVE MODE AND UNDER THESE CONDITIONS ITS ACTIVATION IS EXTREMELY DANGEROUS:    IN THREE (3) OR MORE LANES OF TRAFFIC.  IN NEITHER OF THE OUTER LANES.   PASSING A TRUCK IN THE LANE ON THE IMMEDIATE RIGHT.  VEHICLE(S) IN THE LANE ON THE IMMEDIATE LEFT.  VEHICLE(S) IN THE LANE ON THE IMMEDIATE RIGHT.  AT SPEEDS OF 50 ' 70+ MPH.    WHEN THE SANTA FE APPROACHES THE FRONT END OF THE TRUCK, THE BOW WAVE OF AIR FROM THE TRUCK PUSHES THE SANTA FE TOWARDS THE LEFT LANE LINE ACTIVATING THE BCA, WHICH VIOLENTLY JERKS THE SANTA FE TO THE RIGHT.    WHEN THIS OCCURS AND THE SANTA FE IS MOVED VIOLENTLY TOWARD THE RIGHT LINE LANE, THE BSA DETECTS THE TRUCK (OR OTHER VEHICLES) IN THE RIGHT HAND LANE, AND VIOLENTLY JERKS THE SANTA FE TOWARD THE LEFT HAND LANE.    UPON DOING SO THE SANTA FE BSA AGAIN DETECTS VEHICLES IN THE LEFT HAND LANE AND AGAIN IMMEDIATELY JERKS THE SANTA FE TOWARD THE RIGHT HAND LANE.    THIS ACTION CONTINUALLY OCCURS UNTIL THE DRIVER FORCIBLY REGAINS CONTROL OF THE STEERING WHEEL, AND/OR DEPRESSES THE BRAKE.    THIS REPEATED VIOLENT JERKING THE SANTA FE BACK AND FORTH ACROSS THE LANE IT'S IN HAS VERY NEARLY CAUSED AN ACCIDENT IN AT LEAST TWO (2) OCCASIONS (OCT 27 & 28, 2020) UNTIL WE FOUND THAT THE BCA COULD BE DEACTIVATED AND SET TO WARNING ONLY.    THIS VIOLENT ACTION OF THE BCA SHOULD BE REMOVED FROM THE SANTA FE VEHICLE TO PREVENT ACCIDENTS.",
        "vin": "5NMS53AD3LH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/25/2020",
        "dateOfIncident": "09/03/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361071,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH LESS THAN 1000 MILES ON THE CAR, THE HORN STOPPED WORKING INTERMITTENTLY.  (THE MAJORITY OF THE TIME IT DIDN'T.)  THE DEALER KEPT THE CAR FOR A WEEK.  THE DETERMINATION WAS THAT THE \"DRIVER AIR BAG  CLOCKSPRING HAS INTERNAL MALFUNCTION\".  THE PAPERWORK SHOWS THAT IT WAS REPLACED.  YESTERDAY, APPROXIMATELY THREE WEEKS AFTER THE REPAIR, THE HORN FAILED TO WORK AGAIN WHILE DRIVING ON THE HIGHWAY.  (BASED ON PAST EXPERIENCE, SPEED DOESN'T SEEM TO BE A FACTOR.)",
        "vin": "5NMS33AD1LH"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/11/2020",
        "dateOfIncident": "09/07/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354500,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HUSBAND AND I PURCHASED THIS CAR BRAND NEW, WITH ONLY 252 MILES ON IT.  ON THE THIRD DAY OF OWNING IT WE WERE DRIVING AND WITHIN 5 MILES THE CAR BEGAN ALARMING WITH THE CENTER DRIVER CONSOLE INDICATING THE ENGINE WAS OVERHEATED.  THE TEMPERATURE GAUGE WAS IN THE RED ZONE. AFTER A FEW SECONDS IT DROPPED SLIGHTLY AND FLUCTUATED IN THE UPPER 2/3S OF THE HIGH TEMPERATURE REGION.  WE DROVE TO THE DEALERSHIP, WHICH WAS WITHIN 10 MILES.  ONCE WE WERE WITHIN HALF A MILE THE CAR ENGINE BEGAN RATTLING EVERY-TIME I TRIED TO ACCELERATE AND THE TEMPERATURE GAUGE AT THIS POINT REMAINED IN THE REDLINE.  IN ADDITION, DURING ALL OF THIS WE TURNED THE HEAT ON TO PULL SOME HEAT FROM THE ENGINE BUT ONLY COLD AIR WOULD BLOW. WE WERE WITHIN THE 3 DAY GRACE PERIOD OF NO QUESTIONS ASKED RETURN POLICY SO WE DECIDED TO RETURN THE CALL AS IT WAS BRAND NEW AND HAD SUCH A SERIOUS MALFUNCTION.  WE HAVE NOT HEARD BACK FROM THE DEALERSHIP AS TO WHY THE CAR MALFUNCTIONED.",
        "vin": "5NMS53AA9LH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "09/10/2020",
        "dateOfIncident": "09/09/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354175,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I PULLED INTO THE DRIVEWAY AND PUT ON THE BRAKES WHEN THE VEHICLE ACCELERATED AND RAN INTO THE GARAGE AND THE FRAME.  THERE ARE TIRE MARKS ON THE CEMENT SHOWING THE BRAKES WERE APPLIED. I'VE HAD PROBLEMS WITH THE ACCELERATE CUTTING OUT WHILE ON THE FREEWAY ON RAMP.",
        "vin": "5NMS33AD9LH"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/27/2020",
        "dateOfIncident": "08/27/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351707,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE HAS BEEN STICKING LAST COUPLE OF WEEKS SO THAT I HAD TO PUMP BRAKE TO RELEASE TO START. THIS MORNING I WENT OUT TO THE DRIVEWAY AND COULD NOT GET INTO CAR WITH EITHER REMOTE OR BY USING BLUE LINK ON MY PHONE. I USED THE MANUAL KEY BUT COULD NOT RELEASE ANY OTHER DOORS OR LIFT GATE. NO LIGHTS, HAZARDS, RADIO NO NOTHING. I HAVE HAD A FEW DEAD BATTERIES AND NEVER HAD A CAR THAT DEAD OVERNIGHT.    I DROVE HOME FROM WORK PREVIOUS NIGHT  AND I WAS OUTSIDE AFTER DARK NEXT TO MY CAR, NO LIGHTS LEFT ON.   I CALLED ROADSIDE ASSISTANCE, FIRST GUY SAID HE THOUGHT THERE WAS A SHORT, PARKING BRAKE WOULD NOT RELEASE AND CAR STILL DID NOT START. A DIFFERENT TOW TRUCK HAD TO COME WITH DOLLIES AND IT WAS TOWED TO THE DEALER. DEALER SAID IT WAS A DEAD BATTERY AT 4918 MILES!   THANKFULLY I WAS AT HOME AND THE HEAT INDEX WAS NOT AT 105 DEGREES YET FOR THE DAY.",
        "vin": "5NMS53AD0LH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/03/2020",
        "dateOfIncident": "07/03/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337361,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "DATE:  FRIDAY, 3 JULY 2020.  MY CAR WOULD NOT UNLOCK WITH THE KEY FOB. THOUGHT THE KEY FOB WAS DEAD AND GRABBED THE SPARE TO TRY AGAIN. NO LUCK WITH THAT ONE EITHER. TRIED USING THE BLUE LINK APP TO UNLOCK. UNSUCCESSFUL AGAIN. UNLOCKED MY CAR WITH THE KEY FROM THE FOB AND GOT IN. NONE OF THE INTERIOR LIGHTS CAME ON (I KEEP THIS FEATURE ON). THAT SHOULD HAVE BEEN MY FIRST CLUE. TRIED STARTING THE VEHICLE LIKE THE OWNER'S MANUAL SUGGESTS IF THE KEY FOB BATTERY IS WEAK. DIDN'T WORK. I TRIED TO TEST DIFFERENT FUNCTIONS THAT WOULD NORMALLY WORK IF A VEHICLE IS OFF (I.E. THE LOCK/UNLOCK BUTTONS AND HAZARD LIGHTS). NOTHING WORKED. I HAD TO CALL FOR A TOW TO MY DEALERSHIP, WHICH HAS TO WAIT UNTIL AFTER THE HOLIDAY WEEKEND (4TH OF JULY).  I WILL NOT FIND OUT THE PROBLEM UNTIL AFTER. I DID NOT LEAVE ANY LIGHTS ON OR ANY DOORS OPEN. I JUST USED MY CAR THE DAY BEFORE THIS AND THERE WAS NO INDICATION OF ANYTHING WRONG WITH THE VEHICLE. NO LIGHTS ON THE DASH CAME ON TO ALERT ME OF ANYTHING AND MY CAR IS ACTING DEAD. MORE DEAD THAN YOUR REGULAR NEEDING A JUMP START DEAD. THE ONLY THING I HAVE NOT TRIED IS JUMP STARTING IN FEAR OF INVALIDATING THE WARRANTY IN SOME WAY.  THANKFUL MY CAR IS JUST IN MY DRIVEWAY AND I'M NOT STRANDED WITH MY KID SOMEWHERE.",
        "vin": "5NMS33ADXLH"
    },
    {
        "components": "VISIBILITY,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/19/2020",
        "dateOfIncident": "05/30/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329766,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF EXPLODED WHILE TRAVELING ON THE HIGHWAY.  *TR",
        "vin": "5NMS53AD2LH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/27/2020",
        "dateOfIncident": "05/10/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326236,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL MAKES NOISE DURING BACK UP, FROM STOP TO MOTION (LOW SPEED) MAKING TURNS.  SOMETIMES HAPPENED DURING LOW SPEED DRIVING AS WELL.  THE FREQUENCY IS GETTING MORE AND MORE, VERY ANNOYING AND LITTLE BIT SCARY. WORRY STEERING WHEEL WILL BREAKDOWN.  *TR",
        "vin": "5NMS53AD5LH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/16/2020",
        "dateOfIncident": "03/07/2020",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318304,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2020 HYUNDAI SANTA FE. THE CONTACT STATED THAT WHILE DRIVING AT 65 MPH THE POWER STEERING SUDDENLY FAILED CAUSING THE STEERING WHEEL TO BECOME VERY DIFFICULT TO TURN. THE CONTACT STATED WHILE STOPPING THE VEHICLE IT SUDDENLY STALLED. THE CONTACT STATED VARIOUS WARNING ALERTS ILLUMINATED. THE VEHICLE WAS TOWED TO THE LOCAL DEALER PUGI HYUNDAI (1866 OGDEN AVE. DOWNERS GROVE, IL.) WHO DIAGNOSED THAT THE BATTERY WAS FAULTY. THE BATTERY WAS RECHARGED BUT THE FAILURE REOCCURRED. THE VEHICLE WAS TAKEN BACK TO THE DEALER WHERE THE ALTERNATOR AND BATTERY WAS REPLACED. LATER, AFTER DRIVING AND PARKING THE VEHICLE, IT CAUGHT ON FIRE. THE FIRE DEPARTMENT WAS CALLED TO THE SCENE AND EXTINGUISHED THE FIRE. A FIRE DEPARTMENT REPORT WAS TAKEN AS THEY BELIEVE THE FIRE WAS STARTED IN THE ENGINE COMPARTMENT. A FIRE DEPARTMENT REPORT WAS FILED. THE VEHICLE WAS DESTROYED AND TOWED AWAY.  THE CAUSE OF THE FAILURE WAS NOT DETERMINED BY THE DEALER OR AN INDEPENDENT MECHANIC. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND A CASE WAS OPENED. THE FAILURE MILEAGE WAS 80.",
        "vin": "5NMS33AD5LH"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/04/2020",
        "dateOfIncident": "01/24/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307050,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS SITING IN PARK, RUNNING WITH THE DRIVER'S DOOR OPEN IN MY TOWN HOUSE PARKING LOT. I GET OUT OF MY CAR TO OPEN THE PASSENGER'S BACK DOOR AS WELL AS MY TRUNK FOR HER. I THEN GET BACK INTO THE DRIVER'S SEAT. I AM WAITING ON MY FRIEND TO LOAD HER ITEMS INTO MY NEW SANTA FE FOR AN OUT OF TOWN RETREAT. SHE FINISHES LOADING ITEMS AND PROCEEDS TO GET INTO THE PASSENGER SIDE FRONT SEAT. AS SHE IS GETTING INTO THE CAR, \"SHE SAYS SHE NEEDS TO GO TO THE BATHROOM\". I TELL HER LET'S GO NOW BEFORE WE GET STARTED ON OUR TRIP. WE WERE SUPPOSE TO BE MEETING ABOUT 10 COLLEGE STUDENTS. SO I GET OUT OF MY CAR SINCE I HAVE THE HOUSE KEYS. MY CAR IS STILL IN PARK AND RUNNING. I DO LEAVE MY DRIVER'S DOOR OPEN ABOUT A 20-25 DEGREE ANGLE. MY FRIEND WALKS AROUND THE BACK OF THE CAR. AS WE ARE WALKING TOWARD MY TOWNHOUSE, I TURN AROUND BECAUSE I HEAR A NOISE. I IMMEDIATELY SEE MY CAR NOT ROLLING BUT BACKING UP ON A SMALL INCLINE UPWARD ACROSS MY PARKING LOT. IT SEEMS TO HAVE PICKED UP SPEED AND THEN HITS THE BACK OF A PARKED CAR IN THE PARKING LOT. MY CAR HITS THE PARKED GRAY CAMRY WITH SO MUCH MOMENTUM THAT IT BUTTERFLIES MY DRIVER'S DOOR COMPLETELY OPEN AND THE CAR NEVER SLOWS DOWN. THE CAR CONTINUES MOVING WHILE THE INSIDE OF MY DRIVER'S DOOR SCRUBS THE PARKED CAMRY.  AFTER MY CAR MOVES PAST THE CAMRY IT IS STILL MOVING AT AN ACCELERATED RATE. I AM YELLING AND RUNNING TO MY CAR WITH MY KEYFOB TRYING TO PUSH BUTTONS TO GET IT TO STOP. MY FRIEND IS RUNNING AND CHASING MY CAR. SHE IS ABLE TO GET TO MY CAR AND JUMP IN WHERE SHE PUSHES ON THE BRAKES VERY HARD TO MAKE THE CAR STOP. IF SHE HAD NOT BEEN ABLE TO DO THAT MY CAR WOULD HAVE HIT A PARKED BLACK TRUCK OR WOULD HAVE JUMPED THE SIDEWALK AND RAN INTO A TOWNHOUSE BEFORE IT STOPPED. ONCE MY FRIEND GOT THE CAR TO STOP. SHE LOOKED DOWN AND IT WAS STILL IN PARK AND WAS NOT MAKING THE DINGING NOISE IT USUALLY DOES WHEN IT IS IN REVERSE.",
        "vin": "5NMS53AD0LH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/11/2020",
        "dateOfIncident": "10/25/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298608,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FCA (FORWARD COLLISION AVOIDANCE) SYSTEM DOES NO WORK AS IT SHOULD. IT DOES NOT SEE VEHICLES OR PEDESTRIANS DIRECTLY IN FRONT WHILE NOT IN CRUISE CONTROL.  THE ONLY TIME THE SYSTEM ALARMS IS WHEN FOLLOWING A VEHICLE, WHICH IS IN THE SAME LANE ON CITY STREETS, AND THEN THE TARGET VEHICLE TURNS RIGHT AND CREATES NO HAZARD.  THE FCA DOES NOT WORK ACCORDING TO WHAT IS MENTIONED IN THE OWNERS MANUAL, NOR DOES IT OPERATE LIKE IT IS SHOWN IN A YOUTUBE VIDEO SPONSORED BY HYUNDAI.",
        "vin": "5NMS53AD0LH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/03/2020",
        "dateOfIncident": "01/03/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11296985,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE ONLY HAD THE 2020 SANTAFE 2.0T FOR A FEW WEEKS - 1,000 MILES. IT IS GOING TO THE SHOP (SELLING DEALER). THE TURBO LAG HAS ALMOST GOT ME T-BONED TWICE WHEN PULLING OUT INTO TRAFFIC. THIS IS CLEARLY A SAFETY ISSUE.  IT DID NOT SEEM THIS WAY ON THE TEST DRIVE. THE OVERALL POWER HAS GONE DOWN THE PAST FEW WEEKS. TRYING TO PASS SOMEONE - HAH, MAKE SURE YOU HAVE PLENTY OF ROOM, BECAUSE THAT TURBO LAG WILL  BITE YOU IN THE BUTT WHEN YOU PULL OUT AND SUDDENLY YOU ARE STUCK IN THE ONCOMING LANE WAITING FOR THE ENGINE TO KICK IN.   AFTER AN INSPECTION BY THE DEALER - THEY SAID \" NOTHING IS WRONG, IT IS PERFORMING EXACTLY AS DESIGNED AND WITH SPECS\".  REALLY SCARY WHEN THE DEALER SERVICE WRITER TELLS YOU - \"IT IS PERFORMING AS DESIGNED\".   I TAKE THAT TO MEAN THEY ARE FULLY AWARE OF THIS SAFETY DESIGN FLAW/DEFECT.    THE DEALER THEN SAID - JUST DRIVE IT IN THE \"SPORT\" MODE AND IT WILL NOT BE AS BAD. THAT IS LUDICROUS. THE DEFAULT MODE IS \"COMFORT\" AND THAT IS WHERE THE BEST RIDE AND PERFORMANCE, MILEAGE, ETC. IS TO BE ACHIEVED.    I TOOK A TEST DRIVE WITH THE DEALER'S MECHANIC. HE ADVISED THAT HE GETS THIS COMPLAINT EVERY SINGLE DAY. IT IS A SAFETY DESIGN DEFECT INHERENT IN THE ENGINE.  HE CHECKED FOR ANY ERROR CODES OR SOFTWARE UPDATES - NONE ARE PRESENT OR AVAILABLE.  THE MECHANIC VERBALLY CONFIRMED THAT THE \"ENGINE LAG\" IS CLEARLY THERE.  HOWEVER, WHEN THE SERVICE WRITER COMPLETED THE TICKET, HE WROTE THAT THE MECHANIC SAID HE COULD NOT DUPLICATE THE PROBLEM.  THAT IS AN ABSOLUTE UN-TRUTH.    IN MY OPINION - THIS IS A VERY CLEAR SAFETY ISSUE WHEN TRYING TO MERGE INTO TRAFFIC OR PASS ANOTHER VEHICLE.",
        "vin": "5NMS53AA7LH"
    }
]