[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/08/2022",
        "dateOfIncident": "11/30/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450977,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "- Shifter system malfunction - Unable to use the shift buttons - Received system error on dashboard that read, \"Shifter malfunction! Service immediately.\" Visited two dealership, who saw a photo of the system error message. Vehicle was inspected by the dealership; however, no support could be given due to the dealership not having a code for the issue.  - Dealership was made aware of the issue back in November 2021; however, first available appointment with technician was not until January 2022.",
        "vin": "5NPEH4J21LH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/29/2021",
        "dateOfIncident": "06/01/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445451,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Steering wheel makes whining/scrubbing noise when turning. Steering a vehicle is a critical component of safety and being able to avoid dangerous situations. The problem has been reported, inspected, and confirmed by a dealer. The component has not been inspected by the manufacturer, police, or independent service center. There were no warning messages, lamps, or other symptoms of the problem prior to failure. The problem first appeared when the vehicle was under 15,000 miles. The dealership advised that the worm shaft assembly needs to be replaced.",
        "vin": "5NPEJ4J24LH"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/10/2021",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443327,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact leased a 2020 Hyundai Sonata. The contact state that the radar in the vehicle interacted with the radar in Ford vehicles. While parking in a parking spot there was a beeping sound detected.  While at a stoplight with a vehicle in front to the side, the radar engaged when a Ford vehicle drove up.  The contact stated while turning nearby another Ford vehicle the radar engaged and the driver applied the brakes.  The Forward Collision-Avoidance warning light was illuminated. The contact called the local dealer, but the vehicle was not taken to be diagnosed or repaired. The manufacturer was not contacted. The failure mileage was approximately 6.",
        "vin": "5npeh4j20lh"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/21/2021",
        "dateOfIncident": "12/11/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441229,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "On Nov. 2020 my husband and I purchased a new 2020 Hyundai Sonata with 2mls.off the showroom floor at Daytona Hyundai dealership, Daytona Beach,Fl. We moved to Ga.One day in December, I opened the driver side back door to put groceries in the backseat and I noticed water on the door frame at the bottom ,I thought maybe I might have left the window part of the way down and rain came in. a few weeks after that I went into town I was going to put groceries again in the driver side back door and  water sitting  on the bottom of the frame inside the door . The window was up .So this went on every time it rained. I drove my car to Rome GA at Heritage auto group they sell Hyundai’s And also service them. [XXX] in service department he’s the manager I told him about the door where I was finding water at every time that it would rain. So he told me to bring it back when I was able to leave it.  For the next couple months I had a medical emergency with our son that lives in Florida when he lost eyesight. With the specialist diagnosis he had uveitis in both eyes. The first trip was in April 2021 and I 95 southbound in Florida maybe past Saint Augustine we were driving 60 miles an hour the traffic was very heavy and all three lanes, I was in the center. It was within seconds that I seen something rubber in front of me in my lane ,it could not be avoided or I would have caused a accident with other vehicles. I ran over it on the right side front bumper so my son and I decided to drive it on down to Daytona Hyundai in Daytona where we purchased it at. The manager in the service department there inspected my car all the way around and told me the damages to the right front bumper and the plastic air dam he also said that I could leave it there but they didn’t  have a loaner for me & they couldn’t give me a timeframe I told him I had to get back to Georgia take care of my husband. He said that I could have it repaired up there. He did finish cutting off the plastic air-dam .  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "5NPEF4JA2LH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/08/2021",
        "dateOfIncident": "11/01/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439738,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Hyundai Sonata. The contact stated while parking the vehicle and pressing the power button, the vehicle continued running. The contact was able to turn off the vehicle by repeatedly pressing the power button. The contact stated no warning light was illuminated. The vehicle was not taken to a local dealer. The manufacturer was not informed of the failure. The failure mileage was approximately 12,000.",
        "vin": "KMHL54JJ3LA"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/25/2021",
        "dateOfIncident": "07/15/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438069,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Hyundai Sonata. The contact stated that while depressing the brake pedal, the front of the vehicle was wobbling. The vehicle was taken to a dealer where it was diagnosed that the rotors needed to be resurfaced. The vehicle was not repaired. The manufacturer was notified of the failure. The approximate failure mileage was 11,000.",
        "vin": "5npef4ja6lh"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/07/2021",
        "dateOfIncident": "08/18/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435942,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving on the Interstate at 65mph the car suddenly goes down to 5mph. Unwanted deceleration! At the same time the dash warning lights come on. Check engine and ABS. This happened 3 times now. 2 times on the Interstate in heavy traffic and once  going 35mph on a back road. Miraculously  we were able to pull over without any cars slamming into us. This unwanted deceleration happened on July 28, August 18 and Sept 13.  Each time after pulling to a safe area we turned the engine off, waited a few minutes and turned it back on. Then resumed normal driving speed. Brought it to the dealer after each time. This shut down started after the car was only 4 months old  with 2,983 miles on it.First time they said they couldn't find anything wrong and reset the computer, said if it happens again they will look into it more. The second time they replaced a Body Assy-Throttle and Gasket. The 3rd time they replaced the front wiring assembly control. I have all the repair paper work. We were driving playing Russian roulette wondering when it will happen again. With cars speeding around us we were lucky no one was close on our tail.  This is an extremely dangerous situation.  Each time it was beautiful sunny weather, two times heading to the beach, 3rd time heading to NH after 2 hrs of driving and one hour stopped, resumed driving for 20 min when it happened. No common denominator. I hope that this is not happening to others. I have reported this issue to Hyundai Motors America and they have offered me $500 and 60 days to release them from any liability or claim. Since I just got my car back finally Sept 20th, I certainly can't say my concerns have been resolved.",
        "vin": "5NPEH4J28LH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/26/2021",
        "dateOfIncident": "07/26/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426486,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "1.TRANSMISSION DOES NOT FUNCTION PROPERLY AT ALL TIMES. IT SLIPS FROM TIME TO TIME UPON ACCELERATION, (RIGHT AFTER DECELERATION), INCREASING THE ODDS OF A COLLISION WHEN ATTEMPTING TO AVOID OTHER VEHICLES ON A COLLISION COURSE WITH MINE. 2.NOISE FROM STEERING COLUMN 3. THREE TRIPS TO DEALER HAVE BROUGHT NO RESOLUTION",
        "vin": "5NPEL4JA4LH"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "07/19/2021",
        "dateOfIncident": "07/06/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425567,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The driver seat belt pops out sometimes for reasons unknown.  The speakers suddenly stop working at random times so I got lost while listening for navigation directions safely paying attention to the road instead of watching the screen for upcoming turns. And the biggest one, a few times I almost crashed into oncoming cars and guard rails because if the road has a dip the sonata decides to jerk hard to the side and overcorrect itself when lane assist is on. When the road is level it just beeps annoyingly loudly when it can't see the lines or you accidentally cross over it, but does not actively assist even tho active lane assist is on. This is a major safety issue!!!!!",
        "vin": "5NPEH4J20LH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/19/2021",
        "dateOfIncident": "07/19/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425568,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The automatic shut off. When the car is locked I can run it for a total of 20 minutes with auto start, when it's unlocked I can run it for a total of 60 minutes. Sometimes because of my job I need to auto start it and run it for longer to either warm up or cool down and it is unsafe to leave it unlocked. There should be an option for me to turn off the time limit and not have it reset every time I restart the car!  When I'm shopping and I need to leave my dog inside for instance and it's 91 degrees outside, I should be able to lock my car and let it run for as long as I need to be in the store without worry it will shut off with him inside and suffocate him in the heat. This is another HUGE safety issue!",
        "vin": "5NPEH4J20LH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/20/2021",
        "dateOfIncident": "06/20/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421543,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The transmission since we got the vehicle has had random hard shifts. The software updates seemed to have alleviate some of the occurrences. How ever when it does happen now. The whole car shakes while at idle and shifts extremely hard. Almost like braking hard. The problem has not been reproduced at a dealership yet, taking it in ASAP for inspection. Noting relating to the power train has been replaced. Just a software update a while back. No warning lights came on the screen when it happened. My wife was going about 20 miles per hour when she tried to accelerate. It was hesitant than shifted hard, lurching forward than accelerated. When she came to a stop at the next light it was shaking the whole car.",
        "vin": "5NPEH4J29LH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/09/2021",
        "dateOfIncident": "05/31/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420310,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The Contact owns a 2020 Hyundai Sonata. The contact stated while driving 60 mph, the vehicle abruptly decelerated to 30 mph. The contact also stated that previously the windshield wipers failed and the driver’s side window failed to roll all the way up. The vehicle was towed to the dealer to be diagnosed. The mechanic was unable to retrieve a diagnostic trouble code. The contact stated that the dealer could repair the driver’s side window and windshield wipers. The manufacturer was contacted and informed of the failure. The failure mileage was 16,000.",
        "vin": "5npel4ja7lh"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/09/2021",
        "dateOfIncident": "06/06/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420362,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving, car started making a weird sound followed by a warning light on dashboard with dinging sound to correlate... car became difficult to gas, vehicle motion was lagging where I just knew I had to pull over Bc this car was going to literally stop began to slowly (Bc that’s all car would allow) to proceed forward and I was forced to come to a haunt as I pulled onto side of highway. I then could no longer move it. Turned car off for minute then returned to try to start again, car would not accelerate at all nor turn on fully.. I was forced to wait hour to get a tow... took to shop, no problem such was found , car started & ran again ... this is 3 days later the car again continued the same exact pattern & I was unable to drive any further and forced to once again to get tow. This has to be something of bearings with engine, this car mode is not on list but IT certainly is an issue that I believe is related & should be rectified by Hyundai.",
        "vin": "59pe34af0fh"
    },
    {
        "components": "STEERING,WHEELS",
        "crash": true,
        "dateComplaintFiled": "05/07/2021",
        "dateOfIncident": "03/31/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11415571,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON DRY ROAD, IN MIDDLE LANE OF THREE LANES GOING 65 MPH. SUDDENLY,  RIGHT REAR TIRE \"POOFED\" BUT I KEPT CONTROL, STARTED TO LOOK RIGHT TO GET OFF ROAD.  TOOK FOOT OFF GAS, DID NOT PUT ON BRAKE.  SUDDENLY, LEFT REAR \"POOFED\" AND THEN AN EXTREMELY LOUD-METAL ON METAL- SOUND OCCURRED BACK LEFT AND MY CAR JACK KNIFED INTO THE PASSING , FAST LANE. A DUMP TRUCK TRAVELING IN THAT LANE STRUCK ME, FRONT END AND MY DOOR.  THE TRUCK HIT ME AND I ROLLED INTO THE GRASSY MEDIUM, ROLLING OVER SEVERAL TIMES.  THE SAFETY DEVICES WORKED FABULOUSLY AND MY ONLY INJURIES WERE FROM THE SEAT BELTS WHICH SAVED MY LIFE.  I AM LUCKY TO BE ALIVE AND I HOPE THIS DOESN'T HAPPEN TO SOMEONE ELSE.  I WAS IN ICU FOR 5 DAYS AND HOSPITAL FOR A TOTAL OF 9 DAYS, I AM WILL BE RECOVERING AT HOME FOR MONTHS.   I WOULD LIKE IT INVESTIGATED THAT EITHER A MECHANICAL ISSUE OR TIRE ISSUE CAUSED THE ACCIDENT.  I ONLY HAD 2300 MILES ON THE CAR.*DT*JB",
        "vin": "KMHL24JJXLA"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/28/2021",
        "dateOfIncident": "08/04/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414356,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE'S FUEL GAUGE (TYPE C)  DOES NOT ACCURATELY ADJUST FOR CHANGES IN THE AMOUNT OF GAS IN A TIMELY MANNER. IT NORMALLY TAKES 2-3 DAYS FOR THE GAUGE TO MOVE TO FULL TANK EVEN THOUGH IT IS FULL. SAME PROBLEM FROM 1/4 TO 1/2 TANK, ETC. FOR EXAMPLE, I NOTICED THE PANEL SAID I HAD 11 MILES TO EMPTY ON FRIDAY. THE GAS GAUGE SHOWED OTHERWISE. I WASN'T NEAR MY USUAL FILL STATION, SO I PUT 5 GALLONS OF  GAS IN THE CAR. IT IS NOW WEDNESDAY (5 DAYS LATER). THE GAS GAUGE MOVED SLIGHTLY YESTERDAY TO ALMOST 1/4 TANK, BUT THE FUEL TANK WARNING WENT FROM 11 TO 0 MILES LEFT TO EMPTY (SEE ATTACHMENT). I DROVE ON THE HIGHWAY EACH DAY AND IN THE CITY. I PURCHASED THIS CAR JULY 2020 WITH A FULL TANK. THIS PROBLEM BECAME EVIDENT IN AUG 2020. AFTER REFILLING THE TANK, THE READER SHOWED 111 MILES TO EMPTY. I INFORMED HYUNDAI AGENT OF THE ISSUE, WHO HAD NO IDEA WHY THIS WAS HAPPENING. THE GUAGE AND FUEL TANK READER FINALLY ADJUSTED AFTER ABOUT 3 DAYS. I HAD 449 MILES ON THE CAR AT THAT TIME. I NOW HAVE OVER 4,000 WITH SAME PROBLEM. APPARENTLY, SOMETHING IS FAULTY, BUT I DON'T KNOW WHAT. AUTO DEALER IS BAFFLED. THIS ISSUE COULD RESULT IN A REAL FUEL SHORTAGE WHILE TRAVELING WITH NO GAS STATION NEARBY.",
        "vin": "5NPEH4J23LH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/11/2021",
        "dateOfIncident": "11/17/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407502,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ON NOV. 17 WHILE DRIVING APP. 65 MPH ON THE HIGHWAY THE CAR SUDDENLY SHUT ITSELF OFF. ALL OF THE DASHBOARD LIGHTS LIT UP & THE CAR WOULD NOT RESTART. AFTER 10 MIN. OF TRYING TO RESTART THE CAR, THE CAR STARTED AGAIN, & ALL THE LIGHTS ON THE CAR DISAPPEARED. THE FOLLOWING DAY, WHILE WAITING IN THE TURNING LANE AT A RED LIGHT, THE CAR SPUTTERED & TURNED OFF. ALL THE LIGHTS ON THE DASHBOARD LIT UP & THE CAR WOULDN'T START I HAD THE CAR TOWED ON NOV 18 202 TO A HYUNDAI DEALERSHIP. THE DEALERSHIP REPORTED THAT THERE WAS AN INTERNAL SHORT WITH THE ABS MODULE & THE HYDRAULIC MODULE ASSEMBLY WAS REPLACED.   ON, NOV 24, I WAS DRIVING THE CAR & THE CAR STALLED ALL THE WARNING LIGHTS WENT BACK ON. I HAD THE CAR TOWED THE DEALERSHIP WHERE IT STAYED UNTIL DECEMBER 11 THE DEALERSHIP STATED THAT THEY COULD NOT FIND ANYTHING WRONG WITH THE CAR. I PICKED UP THE CAR ON DEC 11 & THE CAR APPEARED TO BE WORKING NORMALLY. HOWEVER, ON DEC19, WHILE STOPPED AT A RED LIGHT, THE CAR BEGAN TO SHAKE BACK & FORTH AT IDLE & THE RPMS STARTED TO GO UP DESPITE MY FOOT BEING ON THE BRAKES. THE CAR BEHIND ME SAW WHAT WAS HAPPENING & HELPED ME PULL OVER TO THE SIDE OF THE ROAD. I HAD THE CAR TOWED TO THE DEALERSHIP YET AGAIN. THE DEALERSHIP STATED THAT THEY WERE ABLE TO DUPLICATE THE ISSUE ON DEC 23, 2020. HOWEVER, NO FIX WAS DONE TO THE CAR. THE DEALERSHIP CLAIMED THAT THE CAR WAS IN A 'RELEARN' PROCESS & IT WOULD NEED MORE TIME FOR THE CAR TO 'RELEARN' HOW TO DRIVE AGAIN.   EVERYTHING SEEMED OKAY AFTER THE DEC 23 INCIDENT UNTIL FEB 8 2021 WHEN I TRIED TO STOP WHILE IN TRAFFIC & THE BRAKES WOULD NOT WORK AT ALL. I NARROWLY AVOIDED GETTING INTO A MAJOR ACCIDENT & ONCE AGAIN BROUGHT THE CAR TO THE DEALERSHIP. THE DEALERSHIP FOUND THAT THE MASTER CYLINDER ASSEMBLY WAS INTERNALLY DEFECTIVE & WAS NOT HOLDING PRESSURE AND AS A RESULT THE BRAKES WERE NOT WORKING. THE VEHICLE WAS RETURNED TO ME ON FEB 11 2021.",
        "vin": "5NPEH4J25LH"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/31/2021",
        "dateOfIncident": "03/20/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405813,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 HYUNDAI SONATA. THE CONTACT STATED WHILE DRIVING 35 MPH AND ENTERING THE HIGHWAY, THE VEHICLE WOULD NOT SHIFT INTO GEAR AND THE VEHICLE WAS SPUTTERING. THE CONTACT STATED THAT THE VEHICLE WOULD NOT EXCEED 45 MPH. THE CONTACT PULLED ONTO THE SHOULDER OF THE HIGHWAY AND SHUT-OFF THE VEHICLE. NO WARNING LIGHT WAS ILLUMINATED. THE CONTACTED RESTARTED THE VEHICLE HOWEVER, THE FAILURE PERSISTED. THE CONTACT PULLED OFF THE HIGHWAY AND HAD TO RESTART THE VEHICLE SEVERAL TIMES. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER - WEBB HYUNDAI MERRILLVILLE (1000 81ST AVE MERRILLVILLE IN 46410, (219) 249-4961) WHERE THE DIAGNOSIS WAS NOT DETERMINED FOR THE ENGINE HOWEVER, THE CONTACT WAS INFORMED THAT THE HEATING SYSTEM WAS FAULTY AND THE INSTRUMENT PANEL FAILED TO PROVIDE AN ACCURATE WARNING LIGHT FOR THE FAILURES. THE VEHICLE HAD NOT BEEN REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE BUT, DID NOT PROVIDE ANY FURTHER ASSISTANCE. THE FAILURE MILEAGE WAS 14,698.",
        "vin": "5NPEH4J23LH"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/03/2021",
        "dateOfIncident": "02/03/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394499,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE'S DRIVER SIDE WINDOW IS NOT SEATED PROPERLY AND HAS EXCESSIVE WIND NOISE WHEN DRIVING. DEALERSHIP CONFIRMS THIS ISSUE ACROSS MULTIPLE MODELS IN THE 2020 AND 2021 HYUNDAI SONATA.",
        "vin": "5NPEF4JA4LH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/04/2021",
        "dateOfIncident": "06/30/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386446,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "OCCASIONALLY THERE IS A SERIOUS DELAY WHEN TRYING TO ACCELERATE. CAR TENDS TO JERK/BUCK WHEN ACCELERATING, USUALLY IN THE LOWER GEARS. I HAVE NO IDEA IF THIS IS A TRANSMISSION ISSUE OR A FUEL INJECTION ISSUE, BUT MY DEALERSHIP HAS NOT BEEN ABLE TO DETECT AN ISSUE AND KEEPS TELLING ME EVERYTHING IS NORMAL WHEN IT CLEARLY ISN'T. THE CAR ALSO HAS HARSH DOWNSHIFTS ESPECIALLY GOING FROM 2ND TO 1ST GEAR.",
        "vin": "5NPEG4JA4LH"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/18/2020",
        "dateOfIncident": "10/15/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384792,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 HYUNDAI SONATA. CONSUMER WRITES IN REGARDS TO LACK OF NORMAL BLUETOOTH FUNCTIONALITY MAKING VEHICLE UNSAFE. *LD *JS",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/27/2020",
        "dateOfIncident": "11/26/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376745,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "AS THE VEHICLE WAS AT A COMPLETE STOP AND WAITING FOR A CHANCE TO GET IN TRAFFIC, THE CAR HESTIATED AND WOULD NOT RESPOND TO THE DEPRESS OF THE GAS PEDAL, FOR A SECOND OR TWO... VERY STRANGE INDEED!....IS IT A TRANSMISSION ISSUE OR SOMETHING ELSE....THE TRANSMISSION SHIFTS STRANGE FROM THE COMPLETE STOP POSITION...THIS HAPPENES MORE THAN ONCE! AND ONE INSTANCE IT ACTUALLY JERKED ( BUCKED) SOMEHOW...CONCERNED ABOUT THIS...",
        "vin": "5NPEF4JA2LH"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "11/04/2020",
        "dateOfIncident": "10/28/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373076,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "GASES FROM THE DASHBOARD HEATING CAUSE A FILM TO FORM BETWEEN THE WINDSHIELD AND THE CAMERA. BECAUSE OF THIS, IN HEAVY DIRECT SUNLIGHT,  LANE KEEP ASSIST TOGGLES ON AND OFF WITHOUT WARNING CAUSING UNINTENDED LANE DEPARTURES WITH OUT WARNING. ALSO, WHEN USING SMART CRUISE CONTROL, THE VEHICLE SLOWS TO A STOP BUT MAY CONTINUE MOVING SLOWLY EVEN AFTER DISPLAYING THE PRESS GAS TO CONTINUE SCREEN. THE AUTO HOLD LIGHT DOES NOT ILLUMINATE.",
        "vin": "5NPEL4JAXLH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/24/2020",
        "dateOfIncident": "10/07/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366206,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN STEERING THERE IS A LOUD NOISE  WHEN TURNING IN EITHER DIRECTION  BE IT LEFT OR RIGHT, SOMETHING IS  RUBBING IN THE STIRRING COLUMN,  WITH THE STIRRING HAVING FOR TO  MUCH PLAY ALL MOST TURNING  COMPLETELY A FULL CIRCLE   I HAVE SENT IN THIS  COMPLAINT  ONCE BEFORE, BUT GAVE THE  INCORRECT VIN NUMBER FOR MY CAR  SOMETHING IS RUBBING, AND IT'S A LOUD SOUND.  THE SOUND IS THERE IF WHEN  THE  CAR IS IN MOTION, OR  STANDING STILL, IF YOU TURN   THE STIRRING WHEEL",
        "vin": "5NPEF4JA4LH"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/23/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365863,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ON AUGUST 14TH,2020, I PURCHASED A VEHICLE FROM THE SHOWROOM FLOOR FROM CRAIN HYUNDAI OF CONWAY, ARKANSAS. THE CAR WAS AESTHETICALLY PLEASING AND ONLY HAD 46 MILES ON THE SPEEDOMETER. AT THE TIME OF THE PURCHASE I WAS NOT AWARE OF THE TERM \"MODIFICATION\" NOR THE RAMIFICATION ASSOCIATED WITH HAVING A VEHICLE MODIFIED. I ASSUMED THE DEALERSHIP WERE RESPONSIBLE FOR PROVIDING ME WITH A SAFE AND EFFICIENT VEHICLE. THE CAR HAD ADDED EQUIPMENT: CRAIN CARE PKG: $1,397.00 - WHEEL LOCKS: $89.00 - WINDOW TINT: $189.00 - BLACK OUT PACKAGE: $4,295.00, WHICH I LATER LEARNED THE AMERICAN RACING RIM #AR934 FASTLANE, DOES NOT FIT A 2020 HYUNDAI SONATA, THEY ARE 20 INCH RIMS AND HAD EXTENSA HP 225/35R20 90W TIRES AND THE RECOMMENDED TIRE IS 235/45R18. WITHIN A MONTH AFTER THE NEW CAR PURCHASE IT RAIN AND THE CAR LOST TRACTION AND BEGAN TO SLIP AND SLIDE. I PROPOSE IMPLEMENTING LAWS TO GOVERN DEALERSHIP MODIFICATION OF VEHICLES AND HOLD SAID DEALERSHIP RESPONSIBLE FOR INFORMING THE CONSUMER OF THE NEGATIVE RAMIFICATIONS INVOLVED WITH KNOWINGLY PURCHASING A VEHICLE FOR AESTHETIC DESIRES. AFTER LEARNING OF MY MISTAKE THE HYUNDAI CORPORATION WOULD NOT NEGOTIATE A REASONABLE AGREEMENT WITH ME, AND CLOSED THE COMPLAINT LEAVING ME WITH AN UNSAFE VEHICLE THAT WAS ALTERED BY A THIRD PARTY COMPANY WITHIN THE DEALERSHIP, NAME: MOTOR SPORTS AUTHORITY. THE DEALERSHIP WOULD NOT RELEASE FROM THAT CONTRACT AND THE WORKMANSHIP OF THE BLACK OUT PACKAGE IS UNRAVELLING AND I DISCOVERED THE MODIFICATION HAS DECREASE THE VALUE OF THE CAR, WHEN I THOUGHT IT WOULD INCREASE IN VALUE. I ALSO LEARN THE ADDED EQUIPMENT STATED ABOVE WAS NOT INCLUDED ON THE VEHICLE PURCHASE INVOICE WHICH EFFECTS POSSIBLE REPAIRS AND/OR REPLACEMENT CONCERNING AUTOMOBILE INSURANCE COVERAGE. DEALERSHIP  SHOULD BE HELD ACCOUNTABLE AND RESPONSIBLE FOR INFORMING CUSTOMERS OF MODIFICATION AND BE HELD LEGALLY BINDING FOR THE VEHICLE SAFETY",
        "vin": "5NPEH4J26LH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/21/2020",
        "dateOfIncident": "10/07/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365536,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MAKING TURNS THERE IS   A VERY NOTICEABLE SOUND   WHEN TURNING BOTH LEFT AND   RIGHT, WITH FOR TO MUCH   PLAY IN THE STEERING WHILE  TO THE POINT THAT IT   ALL MOST GOES COMPLETELY AROUND.  ..WHILE IN NORMAL DRIVE MODE  IT SOUNDS SOUNDS SOMEWHAT   LIKE A WASH CYCLE/",
        "vin": "5NPEF41A4LH"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/12/2020",
        "dateOfIncident": "10/11/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363980,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MESSAGE ON INSTRUMENT PANEL STATED'COLLISION AVOIDANCE SYSTEM WAS DISABLED AND RADAR WAS BLOCKED.THE ELECTRIC POWER STEERING ALSO BEGAN TO FUNCTION ERRATICALLY AND A STEERING WHEEL SYMBOL APPEARED AND KEPT CHANGING COLOR FROM GREEN TO WHITE.THIS HAPPENED AFTER DRIVING APPROXIMATELY 400 MILES FROM THE DEALER IN NJ TO CHARLOTTE NC.MILEAGE IS 975.",
        "vin": "5NPEF4JA2LH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "10/09/2020",
        "dateOfIncident": "09/09/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11363560,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "PUSHED THE PARK BUTTON, SHOWED P ON THE DASH INDICATOR, DOORS THEN UNLOCKED. WHEN EXITED VEHICLE IT BEGAN ROLLING BACKWARD, PARK HAD NOT ENGAGED SLIGHT HILL ONLY. THIS HAS HAPPENED REPEATEDLY. PUSHED BUTTON TO PLACE THE CAR INTO REVERSE AND THE VEHICLE WOULD NOT ENGAGE OR GO ANYWHERE.",
        "vin": "5NPEJ4J2XLH"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/28/2020",
        "dateOfIncident": "09/26/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361578,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FOLLOWING A FIRMWARE UPDATE TO THE OBC FOR A RECALL, THE VEHICLE TRANSMISSION NOW HAS A SEVERE DELAY RESPONDING TO DRIVER INPUT.  THE TRANSMISSION IN THIS VEHICLE HAS ELECTRONIC SHIFT WITH PUSHBUTTONS.  PREVIOUS TO THE FIRMWARE UPDATE, THE TRANSMISSION WOULD RESPOND INSTANTLY TO DRIVER INPUT FROM THESE BUTTONS.  FOLLOWING THE FIRMWARE UPDATE, THE TRANSMISSION TAKES TWO SECONDS TO RESPOND.  THIS DELAYED ACTION PROHIBITS DRIVER EMERGENCY SHIFTING, CREATING SEVERE RISK OF AN ACCIDENT.  IN MY VEHICLE, I RECENTLY WAS ALMOST INVOLVED IN A TRAFFIC ACCIDENT WHEN THE DELAYED RESPONSE FROM THE TRANSMISSION CAUSED MY VEHICLE TO REVERSE INTO THE OPPOSING LANE OF TRAFFIC AS ACCELERATION WAS ATTEMPTED THINKING THE VEHICLE HAD SHIFTED INTO DRIVE.  UPON ENTERING THE ACTIVE OPPOSITE LANE OF TRAFFIC, EMERGENCY ACCIDENT AVOIDANCE WAS PROHIBITED BY THE DELAYED RESPONSE OF THE VEHICLE SHIFTING INTO 'DRIVE' IN ORDER TO MOVE THE VEHICLE FROM THE OPPOSITE LANE OF TRAFFIC. PREVIOUS TO THIS INSTANCE, THERE HAVE BEEN DELAYS IN VEHICLE SHIFTING WHICH HAVE NEARLY CAUSED AN ACCIDENT WHEN THE DRIVER ATTEMPTS TO PLACE THE VEHICLE IN 'PARK', BUT THE DELAY CAUSES THE VEHICLE TO MOVE FORWARD AS THE DRIVER REMOVES THEIR FOOT FROM THE BRAKE, AND THE CAR MOVES FORWARD TOWARD STATIONARY OBJECTS AND PEOPLE.  THIS HAS BEEN REPORTED TO HYUNDAI AND THEY HAVE NOT RESPONDED YET.  FURTHERMORE, OTHER OBVIOUS FIRMWARE ISSUES IN THE VEHICLE HAVE BEEN IDENTIFIED, ONE IN A DIFFERENT SAFETY SYSTEM.",
        "vin": "5NPEH4J26LH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/24/2020",
        "dateOfIncident": "09/24/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360966,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE BLOCK BECAME INFESTED WITH RATS/MICE OVERNIGHT. I BELIEVE THIS WAS THE RESULT OF SOY-BASED COMPONENTS USED BY HYUNDAI. NO OTHER CARS ON MY BLOCK HAD THIS PROBLEM (I WAS ABLE TO SURVEY THE VEHICLE OWNERS BECAUSE WE ALL WERE THERE WAITING FOR STREET CLEANING TO OCCUR.) IT SEEMS OBVIOUS THAT THE RATS/MICE WERE ATTRACTED BY THE MATERIALS USED BY HYUNDAI AND ANECDOTAL REPORTS SUGGEST THIS IS A CHRONIC PROBLEM AMONG MANY CAR MANUFACTURERS, BUT ESPECIALLY ONES THAT USE SOY BASED COMPONENTS SUCH AS HYUNDAI, LAND ROVER, AND HONDA.",
        "vin": "5NPEH4J20LH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/23/2020",
        "dateOfIncident": "03/13/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360642,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR STALLED AND STUTTERED BETWEEN 1000 AND 1500 MILES IN TRAFFIC AND COULDN'T GET IT INTO GEAR ONCE STARTED. IT WAS THE FUEL RAIL SENSOR. NOW AT 6000 MILES DID SAME THING. IF SITS FOR BIT WORKS AGAIN. IT ALSO RESET ITSELF AND I LOST ALL PREPROGRAMMED INFORMATION. THE GAS DOOR ALSO OPENS AT TIMES WHEN UNLOCK DRIVER DOOR. THE DEALERSHIP HAD IT THE FIRST TIME FOR OVER 30 DAYS AND HAD TO CONTACT ENGINEERS TO FIX IT.",
        "vin": "5NPEH4J29LH"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/18/2020",
        "dateOfIncident": "09/10/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11359814,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2020 HYUNDAI SONATA. I PURCHASED THE CAR ON JANUARY THIS YEAR THE MILES IN THE CAR IS 700 MILES. A MONTH AFTER THE CAR STAR GIVING ME PROBLEM WITH BREAK. SOMEHOW THE CAR APPLIES THE EMERGENCY BREAK BY ITSELF AND DOESN'T WANT TO MOVE. WHEN I DRIVE THE CAR SUDDENLY STOP BY ITSELF AND GIVING ME MESSAGE LIKE: TO MOVE THE CAR PUT YOUR SEAT BELT, LOCK ALL THE DOOR EVEN WHEN I HAVE MY SEATBELT AND DOORS ARE LOCK THE CAR DO THAT WHEN EVER THE LESS I EXPECTED. I TOOK THE CAR THREE TIME FOR REPAIR AND UPDATE AND THE CAR GIVE ME THE SAME PROBLEM. THE DEALER GAVE ME A LOANER ANOTHER 2020 SONATA AND HAVE THE SAME PROBLEM. THIS IS A VERY DANGEROUS ISSUES BECAUSE IF IS RAINY OR SNOWING. THE DEALER DOESN'T FIND ANYTHING WRONG WITH THE CAR WHEN THEY DRIVE THE CAR. I TOLD THEM THAT HAPPEN WHEN THE LEES EXPECTED",
        "vin": "5NPEH4J29LH"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/04/2020",
        "dateOfIncident": "09/03/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353115,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I NEVER GOT WHAT I WANTED FROM HYUNDAI.  I WAS TOLD THAT YOU CANNOT USE A CUSHION AND HAVE A PASSENGER AIRBAG.. I WENT UP TO CEO, STILL SAME ANSWER. I TRIED.",
        "vin": "5NPEL4JA2LH"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/02/2020",
        "dateOfIncident": "09/02/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352696,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS STILL A PROBLEM WHICH IS UNSOLVED.  I WAS TOLD TO GO TO A BODY TO RAISE THE SEAT.  THE BODY SHOP REFUSED SAYING IT WOULD SHIFT RESPONSIBILITY TO THEM INSTEAD OF HYUNDAI.NOT HAVING MUCH LUCK AS OF YET.",
        "vin": "5NPEL4JA2LH"
    },
    {
        "components": "ELECTRICAL SYSTEM,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "08/31/2020",
        "dateOfIncident": "03/09/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352301,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 HYUNDAI SONATA. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE PASSENGER'S SIDE BLIND SPOT DETECTION SYSTEM FAILED TO ACTIVATE. THE CONTACT ALSO STATED THAT THE FORWARD COLLISION WARNING LIGHT INTERMITTENTLY ACTIVATED WHILE STOPPED AT A RED LIGHT. THE CONTACT STATED THE REAR BRAKE ASSIST ACTIVATED INTERMITTENTLY ON SEVERAL OCCASIONS. THE VEHICLE WAS TAKEN TO NASSIEF HYUNDAI LOCATED AT  1059 OH-46 NORTH, JEFFERSON, OH 44047, AND PRESTON HYUNDAI OF SHARON LOCATED AT 1251 E STATE ST, SHARON, PA 16146, WHERE THE MECHANICS WERE UNABLE TO DUPLICATE FAILURE. THE VEHICLE HAD NOT BEEN DIAGNOSED NOR REPAIRED AS OF YET. THE MANUFACTURER HAD NOT BEEN INFORMED OF FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 623. *BF  *TR",
        "vin": "5NPEH4J20LH"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/29/2020",
        "dateOfIncident": "08/28/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351932,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HYUNDAI CORPORATE OFFICE SENT BE BACK TO HE DEALER.  AS BEFORE, IF THE PASSENGER USE A CUSHION, YOU LOSE THE AIRBAG.  I WAS TOLD THAT YOU WILL STILL HAVE SEAT BELT PROTECTION.  THIS MAKE ON SENSE TO IF YOU ARE SHORT YOU GET SHORT CHANGED.",
        "vin": "5NPEL4JA2LH"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/27/2020",
        "dateOfIncident": "08/03/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351500,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER AIR BAG DOES NOT WORK IF PASSENGER USES A CUSHON OR A HEAVY COAT.  DEALER SAID THEY CAN NOT CHANGE THIS I WAS TOLD TO CONTACK HYUNDAI. I DID SO NO HELP YET.  I BELEAVE THIS A PROBLEM WITH MADEAL AND IT SISTER KIA.  A RECALL MAY BE NECESSARY TO GET THIS MATTER TAKEN CARE OF.",
        "vin": "5NPEL4JA2LH"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/27/2020",
        "dateOfIncident": "08/27/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351683,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY PASSENGER AIR BAG WILL NOT WORK WITH A CUSHION.. I TRIED IT WITH NO CUSHION BUT WITH A LONG WINTER COAT AND THE IS NO AIR BAG.  HYUNDAI SENT BE BACK TO THE DEALER WHO WAS NOT. ABLE TO SOLVE PROBLEM.. I WILL FILE ANOTHER ONE IF THE SAFETY CAN NOT BE RESOLVEDIF YOU ARE SHORT NO AIR BAG IF YOU NEED A CUSHION",
        "vin": "5NPEL4JA2LH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/12/2020",
        "dateOfIncident": "08/05/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348898,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WHILE I'M DRIVING SOMETIMES THE CAR IS UNSTABLE ALSO WHEN I TURN ON THE CAR AND I PREPARE TO PUT IT ON DRIVE THE CAR APPLY THE EMERGENCY BRAKES BY ITSELF. THE EMERGENCY BRAKE LIGHT IS ON AND THERE IS NO WAY TO REMOVE IT, I HAVE TO TURN THE CAR ON AND OFF CONTINUALLY UNTIL FINALLY THE CAR REMOVES THE BRAKES. I WAS DRIVING ON THE HIGHWAY AND ON THE STREET AND WHILE I WAS DOING SO THE CAR PUT ON THE BRAKES BY ITSELF. ONE TO TWO MONTHS AGO I TOOK THE CAR TO THE DEALER AND I TOLD THEM ABOUT IT BUT THEY SAID THAT THE CARE NEEDS 2 UPDATES, APPARENTLY THE CAR HAS TWO RECALLS. 6 HOURS LATER AFTER THE UPDATE THE CARE WASN'T WORKING PROPERLY AND THEY KEPT THE CAR FOR 3 TO 4 DAYS, I GOT A LONER BY THEN. LAST WEEK WEDNESDAY 08/05/2020 I TOOK THE CAR AGAIN TO REPORT THE PROBLEM AND I WAS TOLD THE CARE WOULD BE READY IN 5 HOURS BUT AFTER 5 HOURS IT WASN'T. SINCE I DIDN'T FEEL SAFE IN THE CAR I TOLD THEM TO KEEP THE CAR AND GIVE ME A LOANER BECAUSE THE CAR IS GOING TO TAKE ONE WEEK TO FIX BECAUSE THEY HAVE TO ORDER PARTS, THEY WANT TO KEEP THE CAR BUT THEY DIDN'T WANT TO GIVE ME A LOANER. I CONTACT HYUNDAI CORPORATE TO REPORT THIS INCIDENT BECAUSE IT IS TWICE ALREADY, AND I WAS TOLD THAT SOMEONE WOULD BE IN CONTACT WITH ME IN THE NEXT 48 HOURS. I MISSED THE CALL AND I HAVE BEEN TRYING TO CALL TO GET IN CONTACT WITH THEM AGAIN TO FIX THE PROBLEM BUT EVERY TIME I CALL THEY COME WITH ANOTHER EXCUSE. THE CASE MANAGER IN CHARGE OF THE CASE IS GARRISON AND THE CASE NUMBER 17216875.",
        "vin": "5NPEH4J29LH"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/13/2020",
        "dateOfIncident": "07/13/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338985,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE ABRUPTLY STOPPED IN A TRAFFIC SIGNAL WITHOUT GIVING ANY INDICATIONS WHAT SO EVER.  WHEN TRIED TO RESTART IT STALLED PRETTY BADLY CAUSING EXCESSIVE VIBRATIONS. THIS HAD JUST 1900 MILES ON IT. VEHICLE DIDN'T HAVE ANY MIL OR ANY VISIBLE INFORMATION ABOUT THE ISSUE. IT CREATED A HUGE TRAFFIC PILE UP DUE TO THE PEAK HOUR IN WHICH THIS PROBLEM STARTED. FEW DAYS AGO THERE WAS ISSUE WITH STARTING BUT IT RESOLVED AFTER COUPLE OF MINUTES, THIS TIME THE VEHICLE HAD TO BE TOWED TO THE DEALERSHIP AND I LOST MY DAYS WORK AND PAY. BIGGEST CONCERN IS HOW ABRUPTLY IT STOPPED IN A BUSY STREET.",
        "vin": "5NPEJ4J27LH"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/08/2020",
        "dateOfIncident": "07/07/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338293,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE ROUGH IDLED & EVENTUALLY SHUDDERED TO A STOP. THIS HAPPENED FOUR TIMES WHILE IN GEAR AND IDLING AT APPX 1000-1500 MILES. BETWEEN 1500-2000 MILES, VEHICLE SHUT DOWN WHILE DRIVING APPX 60MPH ON A COUNTY ROAD. AT APPX 2700 MILES, MPGS DRASTICALLY IMPACTED WHEN VEHICLE SUDDENLY STOPPED SHIFTING GEARS PROPERLY WHILE IN MOTION AT APPX 70MPH ON THE HIGHWAY. CHECK ENGINE LIGHT APPEARED WITH MESSAGE REGARDING ECS ISSUES. VEHICLE STILL DRIVES, IT JUST SEEMS TO STRUGGLE WITH EFFICIENCY AND SHIFTING CORRECTLY.",
        "vin": "5NPEJ4J28LH"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/27/2020",
        "dateOfIncident": "04/21/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326116,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR DOORS RETAIN WATER EVERY TIME IT RAINS. WHEN YOU OPEN THE REAR DOORS WATER DRAINS OUT OF THE CAR. BROUGHT CAR TO HYUNDAI DEALERSHIP WHO VERIFIED THE PROBLEM AND CONFIRMED THE PROBLEM WITH OTHER NEW CARS ON THEIR LOT, ON APRIL 21, 2020. DEALERSHIP CONTACTED HYUNDAI CORPORATE FOR GUIDANCE AND THERE HAS BEEN NO RESPONSE TO DATE.  *TR",
        "vin": "5NPEJ4J29LH"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/09/2020",
        "dateOfIncident": "05/07/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323971,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I LOOKED UP UNDER THE HOOD, IT START RUSTING IN FRAME IN DRIVER SIDE. I CHECKED OTHER 2020 SONATA FROM DEALERSHIP AND THOSE CAR ARE EVEN WORST. THOSE CAR RUSTING DRIVER AND PASSENGER SIDE TOO.  *TR",
        "vin": "5NPEH4J29LH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/30/2020",
        "dateOfIncident": "02/14/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322889,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IT RAINS WATER GETS INSIDE THE DOORS WHILE PARKED. ESPECIALLY THE BACK DOORS. IF IT RAINS HARD A CUP FULL OF WATER WILL COME OUT THE DOOR UPON OPENING. I'VE BEEN TOLD IT'S A DESIGN FLAW. I'VE HAD IT LOOKED AT TWICE AND IT'S STILL NOT FIXED. CUSTOMER SERVICE CAN'T HAVE SOMEONE COME OUT AND LOOK AND IT BECAUSE OF THE VIRUS, SO THERE'S NOTHING THAT THEY CAN DO.",
        "vin": "5WPEF4JA3LH"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "03/23/2020",
        "dateOfIncident": "02/27/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319015,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 HYUNDAI SONATA. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE DOORS OPENED INDEPENDENTLY WITHOUT THE UNLOCK BUTTON BEING DEPRESSED. THE VEHICLE WAS TAKEN TO WALLACE HYUNDAI LOCATED AT (3801 SE FEDERAL HWY A, STUART, FL 34997) HOWEVER, THE MECHANIC WAS UNABLE TO DETERMINE THE CAUSE OF FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 600.",
        "vin": "5NPEH4J27LH"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/24/2020",
        "dateOfIncident": "02/22/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311001,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING LONG-DISTANCE ON A HIGHWAY AT APPROX 55-60 MPH. THE WHOLE TRIP THROUGH THE ARIZONA DESERT WAS MARKED BY PERIODIC RAIN, AT TIMES VERY HEAVY. IN THE VERY HEAVY BURSTS OF RAIN, THE WINDSHIELD WIPERS DID A TERRIBLE JOB. I HAVE NEVER BEEN SHOCKED BY POORLY PERFORMING WINDSHIELD WIPERS. MY COMPANION EVEN COMMENTED ON HOW UNSAFE IT IS. THE PROBLEM MAY BE TWO-FOLD: (1) IT SEEMS LIKE THE WIPERS NEEDED ONE MORE SPEED SETTINGS, A FASTER ONE. (2) THE FACTORY BLADES MAY NOT BE EFFECTIVE. THIS IS A 2 MONTH OLD CAR. IT ALSO SEEMED TO BE A PROBLEM ANYTIME I HAD TO TURN THE WIPERS ON THEIR HIGHEST SETTING EVEN LATER ON URBAN FREEWAYS - I NEEDED A HIGHER ONE. I PLAN TO REPLACE THE BLADES AND HOPE THAT HELPS. I'VE NEVER BEEN DRIVING AND FEARED I WAS IN DANGER BECAUSE OF THE WIPERS. I DON'T HAVE ANY DOCUMENTATION. NOTHING IS VISIBLY BROKEN.",
        "vin": "5NPEJ4J22LH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/06/2020",
        "dateOfIncident": "01/07/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307531,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 HYUNDAI SONATA. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 55 MPH, THE VEHICLE SHIFTED INTO SAFE MODE AND LOST MOTIVE POWER. THE VEHICLE WAS TAKEN TO ST. CHARLES AUTOMOTIVE LOCATED AT 5601 VETERANS MEMORIAL PKWY, ST PETERS, MO 63376, (636)441-4481 BUT WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT CONTACTED OR INFORMED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 1,500.",
        "vin": "5NPEJ4125LH"
    }
]