[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/04/2021",
        "dateOfIncident": "08/15/2021",
        "fire": false,
        "manufacturer": "Intech Trailers, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439334,
        "products": [
            {
                "manufacturer": "Intech Trailers, Inc.",
                "productMake": "INTECH",
                "productModel": "CUSTOM TRAILER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Intech Soul Horizon trailer. The contact stated that the tires showed uneven wear on the inside tires while replacing the tires on the trailer. The contact stated that the uneven wear of the tires came from a bent axle. The contact stated that the former owner of the trailer informed him that the axle had been previously repaired three times. The vehicle was not diagnosed or repaired. The manufacturer was made aware of the failure. The failure mileage was approximately 10,000.",
        "vin": "7h0ts1318kn"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/29/2021",
        "dateOfIncident": "02/22/2021",
        "fire": false,
        "manufacturer": "Intech Trailers, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418978,
        "products": [
            {
                "manufacturer": "Intech Trailers, Inc.",
                "productMake": "INTECH",
                "productModel": "CUSTOM TRAILER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I have a 2020 InTech travel trailer.  Twice, my doors have opened on the freeway, both the double back doors and the side door.  The doors were double locked (two locks on each door, one, in theory, sort of a deadbolt.)  The second time I had a strap on the inside to try to prevent them from opening.  I am one of at least 25 people who have had this occur with the InTech travel trailers.  I have names of each of them.  Many of us have called InTech about it.  Initially, they denied knowing it was happening.  Then, they said they knew of a single instance, that was user error.  They have paid a number of people for lost cargo due to this, they KNOW that there is a problem.  Now, owners are fabricating things to block the doors from the outside, to keep them from opening.  This, of course, removes egress if the doors are blocked from the outside.  Most of us discovered this occurring after someone on the freeway flagged us down.  InTech refuses to honor any repair (mine is in year one of three of the warranty) and keeps telling owners that they don't know anything about it.  Others have had pop out kitchens come open underway and into traffic.  Someone is going to be struck by airborne debris and killed. The consumer provided photos of trailer.",
        "vin": "7H0TR0912LN"
    }
]