[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/10/2022",
        "dateOfIncident": "01/30/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451454,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Two massive safety/security flaws led to theft: break-in through rear window didn’t trigger alarm AND lack of immobilization system. They KNOW this is a problem.",
        "vin": "3KPF24AD0LE"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/12/2022",
        "dateOfIncident": "07/10/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447141,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The back windows won't go up or down they jam. You try to roll the passenger windows up or down & they won't do anything. Sometimes you have to turn on & off the car a few times open & closing the driver side door so the windows will work. Also the break lights Sometimes have a late response when you hit the breaks the lights don't respond has a delayed response",
        "vin": "3KPF24ADXLE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/30/2021",
        "dateOfIncident": "05/04/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442163,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "my 2020 kia forte was stolen May 4,2021- car locked and anti theft system activated at that time. Then on October 22,2021 there was an attempted theft on my car again. This time there was also a steering wheel club on car as well as the anti theft system that comes with car.",
        "vin": "3KPF24AD7LE"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/13/2021",
        "dateOfIncident": "09/04/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436639,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "My expectant granddaughter was driving the vehicle on a trip. The transmission started intermittently slipping en route. She stopped and when she returned to the vehicle she discovered it would no longer go forward or backwards. It is still under warranty. The vehicle is still in Colorado. This happened Sept 4, 2021. It is now 10/13. I have contacted Kia multiple times speaking with different people. I escalated the call and was told someone named Melissa was my escalations person. I have never spoken to her. I have requested a buy back of the vehicle due to possibility of reoccurrence. My granddaughter was stranded for a week. The car is at a dealership, Ft Collins Kia. We have had to pay for hotel, car rental, and a flight out of pocket. I requested reimbursement. They have not responded. I filled out the information for the buy back, but I do not have all of the paperwork. It is in the car in Colorado. We live in South Texas. No way to get access to it. This is wrong on so many levels. We are at a loss as to what to do. If the transmission had quit while she was moving the results could have been disasterous. Kia says the part is sitting on a dock somewhere waiting to be picked up. Is there an expected timeline? We had to replace the vehicle due to the cost of car rentals.",
        "vin": "3KPF24AD6LE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/25/2021",
        "dateOfIncident": "05/07/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430545,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "When there is a YouTube tutorial on how to steal a Kia or Hyundai, it is time to stop the abuse, pain and suffering of the consumer!",
        "vin": "3KPF24AD6LE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/03/2021",
        "dateOfIncident": "07/02/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423329,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The break system fail while the vehicle motion, the brake pedal just go all the way down and can stop the car until release and try again, I follow the step owner's manual for a visual inspection for any leaking fluid on the floor, no brake pads sound alarm, no check engine light or any other warning light, the Car has inspected by Authorized Dealership technicians to perform service/repair on June 04 2020, they diagnostic say air pockets in the brake system, but the car continues with the same issue. I put my family on risk on a car accident I don't think the car is safe",
        "vin": "3KPF24AD7LE"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "05/11/2021",
        "dateOfIncident": "05/10/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416048,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER LEAKING INTO TRUNK CAUSING MALFUNCTION TO SECURITY ALARM SYSTEM AUTO TRUNK RELEASE AND TRUNK LID OPEN SYMBOL TRUNK MALFUNCTION WARNIG SYMBOLS AND ALARM STAYED ON COULD NOT HERE ANY SAFTEY ALARMS WATER IN TRUNK DAMAGED SENSOR  COULD NOT LOCK OR UNLOCK TRUNK REMOTLY  COULD NOT HERE ALARM ON BLIND SPOT WARNING  COULD NOT READ ANY READINGS LIKE SPEED, TIRE PRESSURER  COULD NOT HERE SEAT BELT LOCK CHIME",
        "vin": "3KPF34AD1LE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/16/2021",
        "dateOfIncident": "07/31/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403194,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN FUELING AFTER PUMP AUTO SHUT OFF GAS WILL SPILL OUT, CAUSING A GASS SPILL. DEALERSHIP HAS STATED THERE IS NO FIX.    REAR DRIVER SIDE WINDOW WILL NOT LOWER WITH SWITCH. DEALERSHIP IS WELL AWARE BUT STATES THERE ARE NO FIXES.    ALSO COOLANT LIGHT CAME ON OVER THE DASH AND THE COOLANT WAS LOW WITH LESS THAN 9K MILES.    CAR IS LESS THAN 1 YEAR OLD AND HAS LESS THAN 10K MILES.",
        "vin": "3KPF54ADXLE"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "03/10/2021",
        "dateOfIncident": "04/10/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400072,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE 2020 KIA FORTE LAST APRIL 2020. THE TRUNK LATCH WOULD NOT OPEN TRUNK, REPORTED, SERVICED IT STILL PRESENTED TIGHT LEVERAGE FUNCTION DURING STABLE PARK POSITION. THE COMPUTER SCRAMBLED THE 1ST OR 2ND WEEK OF OWNING IT DURING MY EARLY MORNING HIGHWAY TRAVEL THE COMPUTER SCRAMBLED MORE THAN ONCE. I CONTACTED KIA- THIER RESPONSE WAS NOT HELPFUL TO THE NEW CAR MALFUNCTION. IT HAPPENED MORE THAN ONCE. THE LANE DEPARTURE DID NOT WORK AT DIFERENT PERIODS IN TIME; WITHIN THE YEAR I REPORTED TO KIA. THE WINDSHIELD CRACKED DURING FIRST FROST. KIA CLAIMED ROCK CHIP. I HAD JUST SERVICED CABIN FILTER AREA, KIA RELENTLESSLY ASSUMED ROCK CHIP, I BELIEVE DEFECTED GLASS. THE FIRST FROST IT CRACKED 2ND FROST WITHIN 2WEEK TIME OR LESS SPLIT CRACK ACROSS WINDSHIELD. THE GAS AND MILAGE WERE NOT STABLLY OPERATING WAS OUT OF SYNC DURING HIGHWAY TRAVELS. I NOW FOR THE LAST WEEK NOTICED A NOISE IN MY CAR ENGINE WHEN IN PARK TURNING IT OFF. I AM UNHAPPY WITH MY PURCHASE AND THE KIA DEALERSHIP I PURCHASED IT FROM. I HAVE PICTURES OF REPORTED DASH COMPUTER MALFUNCTIONS, AND AN UNWILLING DEALERSHIP TO ASSIST WITH MY VEHICLE. I AM CONCERNED WITH MY SAFETY, MY PASSENGERS SAFETY, AND SAFETY IN MY FUTURE DRIVE.  I PUT DATE OF APRIL 20, 2020 BECAUSE IT WAS ROUGHLY WHEN MALFUNCTIONS BEGAN TO OCCURE. THE TRUNK LATCH IMMEDIATELY 4/10/2020 OR AT PURCHASE DATE UPON ARRIVING HOME.",
        "vin": "3KPF24AD1LE"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "02/22/2021",
        "dateOfIncident": "12/14/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11397278,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 KIA FORTE. THE CONTACT STATED THAT WHILE ATTEMPTING TO GET OUT OF THE GARAGE, THE CONTACT PLACED THE VEHICLE IN PARK AND REMOVED THEMSELVES TO THE VEHICLE IN ORDER TO OPEN THEIR GARAGE DOOR WHEN THE VEHICLE BEGAN TO REVERSE HITTING THE CONTACT AND THE GARAGE DOOR. THE CONTACT RECEIVED INJURIES TO THEIR LEFT SHOULDER, FACE, ELBOW, LEFT KNEE, RIGHT LEG, AND RIGHT FOOT. MEDICAL ATTENTION WAS NOT NEEDED. A POLICE REPORT WAS NOT FILED. THE VEHICLE HAD NOT BEEN TOWED. THE CONTACT WAS ABLE TO GET INTO THE VEHICLE AND TURN ON THE VEHICLE. THE CONTACT TOOK THE VEHICLE TO THE DEALER (MERCHANT LOGO SPITZER KIA CLEVELAND SERVICE CENTER   3414 BROOKPARK RD, CLEVELAND, OH 44134; (216) 259-7080) WHO WERE UNABLE TO DUPLICATE THE FAILURE AND REFERRED THEM TO SPEAK TO THE MANUFACTURER. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND OPENED A CASE REGARDING THE MATTER. THE APPROXIMATE FAILURE MILEAGE WAS 2,553. *DT*DT*JB*DT CONSUMER CASE NUMBER [XXX].  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).”",
        "vin": "3KPF24AD6LE"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/16/2020",
        "dateOfIncident": "11/06/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374917,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN BACKING UP THE STEERING, KEY, AND WHEEL ALL LOCK. I WAS BACKING UP SO I WAS ALREADY GOING VERY SLOW. WHEN PRESSING ON THE BRAKE THE CAR SLOWS DOWN BUT STILL MOVES VERY SLOW UNTIL IT CANT MOVE ANYMORE. I TRY TO JIGGLE OUT THE KEY AND PUT THE CAR IN LOCK BUT I JUST JIGGLE EVERYTHING UNTIL SOMETHING UNLOCKS. IT HAS HAPPENED 3 TIMES SINCE I GOT THE CAR IN MARCH 2020.",
        "vin": "3KPF24AD7LE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/14/2020",
        "dateOfIncident": "11/14/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374644,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN FUELING GAS, ONCE THE PUMP CLICKS AND STOPS PRODUCING FUEL AS THE CAR IS FULL, GAS GUSHES OUT OF THE TANK AND ONTO THE SIDE OF THE CAR FROM THE OPENING.  THE VEHICLE WAS STATIONARY, TURNED OFF. THIS DOES NOT HAPPEN EVERY TIME, BUT I WOULD SAY ABOUT 2 OUT OF 5 TIMES FUELING. IT DOES THIS AT ALL DIFFERENT GAS STATIONS, THERE IS NO SPECIFIC PUMP THAT IT DOES IT AT.",
        "vin": "3KPF44AC2LE"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/05/2020",
        "dateOfIncident": "08/14/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353364,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 18 YEAR OLD DAUGHTER WAS THE DRIVER. THE CAR WAS PARKED ON A RESIDENTIAL STREET, FACING THE DIRECTION SHE WANTED TO GO. THE STREET WENT DOWNHILL IN FRONT OF HER. SHE STARTED THE CAR. WHEN SHE BEGAN TO DRIVE, THE STEERING FELT VERY STIFF, SHE COULD BARELY STEER. SHE STARTED DRIVING ANYWAY. THEN THE BRAKES DID NOT WORK. IN FACT, SHE SAID THAT PRESSING THE BRAKE SEEMED TO MAKE THE CAR GO FASTER (OR THIS COULD HAVE JUST BEEN THE EFFECT OF THE HILL). SO SHE ACCELERATED DOWN A SUBSTANTIAL HILL WITH NO BRAKING POWER. AT THE BOTTOM OF THE STREET (APPROX. 1/4 MILE) IS A T-INTERSECTION. SHE CROSSED THE STREET, THE CAR WENT UP ONTO THE CURB OPPOSITE, PROCEEDED THROUGH SOME BUSHES, KNOCKED DOWN A FENCE AS IT WENT BETWEEN A TREE AND A BRICK WALL, RAN INTO A BIRD BATH, AND THEN CAME TO A STOP IN SOMEONE'S YARD. FORTUNATELY THE CAR STOPPED BEFORE IT GOT TO THE HOUSE ITSELF.   DAMAGE INCLUDED: BOTH BUMPERS, BOTH DRIVER-SIDE TIRES/WHEELS/HUBCAPS, AND EXTENSIVE DAMAGE UNDERNEATH INCLUDING TRANSMISSION.DRIVER AND PASSENGER WERE (AMAZINGLY) NOT INJURED.",
        "vin": "3KPF24AD7LE"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/04/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353191,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEPTEMBER 1ST, 2020, I WAS AT A STOP AND NEEDED TO GO NORTHBOUND ON A BUSY INTERSECTION. I SAW THE OPPORTUNITY TO GO SO I STEPPED ON THE GAS BUT MY VEHICLE WOULD  BARELY ACCELERATE WHICH PUT ME IN HARMS WAY OF ONCOMING TRAFFIC. FOR A MOMENT THERE I THOUGHT I WAS GOING TO GET T-BONED. THIS ISSUE NEEDS TO GET RESOLVED AS SOON AS POSSIBLE!",
        "vin": "3KPF24AD3LE"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/18/2020",
        "dateOfIncident": "03/13/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11318580,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TURNING LEFT THROUGH A GREEN LIGHT ONTO A CITY ROAD WHEN A CAR COMING FROM THE LEFT SIDE RAN A RED LIGHT GOING 50 MILES AN HOUR IN A 35 MILES AN HOUR ROAD, CRASHING INTO THE SIDE OF MY CAR. IT HIT THE FRONT DRIVERS SIDE TIRE AND DOOR, BUT WAS HIT SO HARD THAT MY CAR MOVED FORWARD ABOUT 8 - 10 FEET. MY CAR IS SUPPOSE TO HAVE SENSOR DIRECTLY WHERE THE OTHER PERSON CAR HIT MINE BUT NONE OF THE AIR BAGS WENT OFF. EVEN THOUGH THIS CAR IS SUPPOSE TO HAVE SIDE AIRBAGS FOR THOSE TYPES OF COLLISIONS.",
        "vin": "3KPF44AC0LE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/06/2020",
        "dateOfIncident": "03/03/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316571,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE VEHICLE IS IN MOTION ON A CITY STREET, SEVERAL WARNING LIGHTS POPPED UP ON THE DASHBOARD:  ELECTRONIC PWR STEERING, ELECTRONIC STABILITY INDICATOR, TPMS TIRE PRESSURE, MALFUNCTION INDICATOR LAMP, AUTONOMUS EMERGENCY BRAKE, ADAPTIVE FRONT LIGHTING , AND LOW TIRE PRESSURE WARNING LIGHTS.  AT THE SAME TIME THAT ALL THOSE LIGHTS TURNED ON (WHILE IN MOTION) THE ODOMETER AND SPEEDOMETER NEEDLE STOPPED REGISTERING SPEED AND DROPPED TO ZERO ON BOTH GAUGES ALONG WITH THE TEMPERATURE GAUGE AS WELL.  I PROCEEDED TO PUT THE HAZARD LIGHTS ON AND PULL OVER SAFELY.  ONCE STATIONARY I PLACED THE CAR IN PARK, THEN THE GEAR SHIFT LOCKED UP AND WOULD NOT UNLOCK.  AFTER ABOUT 20 MINUTES OF BEING STATIONARY ON THE SIDE OF THE ROAD, I WAS ABLE TO ENGAGE THE GEAR SHIFT, PLACE IT IN DRIVE AND PROCEED DOWN THE ROAD.  WHILE THE VEHICLE WAS IN MOTION THE WARNING LIGHTS PROCEEDED TO STAY ON AND THE SPEEDOMETER/ODOMETER WERE NOT REGISTERING SPEED THROUGHOUT THE REMAINDER OF MY TRIP.",
        "vin": "3KPF24AD9LE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/22/2019",
        "dateOfIncident": "09/20/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257242,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "OPENING TRUNK MAY CAUSE DAMAGE TO REAR WINDOW AS THE TRUNK SWINGS TOO FAST WHEN ITS OPENING. THE TRUNK MAY DETACH AND STRIKE THE REAR WINDSHIELD. VEHICLE WAS STATIONARY.",
        "vin": "3KPF24ADXLE"
    }
]