[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/25/2022",
        "dateOfIncident": "01/22/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448844,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2020",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Kumho Tire Co., Inc.",
                "productMake": "KUMHO",
                "productModel": "HO7",
                "productYear": "9999",
                "size": "235/60R18",
                "type": "Tire"
            }
        ],
        "summary": "my new kumo ho7 235-60-r18, tire fell apart on road trip from fl. to wi. had service done in Clarksville tenn. kia dealership on july 12th 2021. tire had to be replaced. odometer read 5,711     now another tire failed replaced jan. 22nd odometer read 11,765",
        "vin": "kndmb5c18l6"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/22/2021",
        "dateOfIncident": "08/20/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430054,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving down the interstate at 70mph and the vehicle suddenly began to brake and the forward collision warning light illuminated along with the check engine light. The car stopped on the interstate and this happened at 1:15 am and it was in a rural area and it was pitch black outside. Luckily no one plowed into the back of the car. Was able to restart the car and was barely able to get it to the side of the road before it shut down again. 6 miles to the nearest exit attempted to get the car off the highway. After several attempts and turning off every electric accessory and sensor was able to get the car to the exit. KIA toed the car to the nearest dealership the next day. They discovered that the wiring harness was chewed up in several places and caused numerous shorts circuits and malfunction codes. I own several vehicles that are parked in the same area and this is the only one that has chewed up the wiring. My daughter and 2 of the grandchildren were in the car when this happened and they could have been killed if someone had plowed into the back of them at 70+ mph. This is a 2020 Kia Sedona and I'm being told that this is not covered under warranty. There is something wrong here seeing how this only happened to this car and not my other cars nor my boat. The car is in the shop and will not be ready for a week or two and this happened more than 350 miles from my house. I have lost the use of this car and Kia refused a rental because they said it was not a warranty issue. I know Kia is having this same issue with many of their vehicles. Does it take people to die for this to be addressed? I hope not. My family could have easily been killed because of this. Luck is probably the only thing that prevented a tragedy here. The car has not been repaired yet so I don't have any documents to upload yet.",
        "vin": "KNDMC5C15L6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/17/2021",
        "dateOfIncident": "08/14/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429457,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "What component or system failed or malfunctioned, and is it available for inspection upon request?  It looks like the ECU communication to my key fob failed and the engine was shutdown while I was driving the car on the highway.  Then the anti-theft system called Immobilizer kicked in and prevented me to start the car again.  It looks like the memory of my key fob id was erased or something as my car seemed to complain that the fob was not present when it in fact it was right next to me in the center console.   How was your safety or the safety of others put at risk?  I was driving with my three young kids and wife and we and to shoulder the car in the highway.  I was forced to shoulder the car because the engine shutdown in the middle of driving.   This was highly unexpected behavior and my immediate thought was to pull to the side of the highway and take a look a the issue in a safer spot but parking at the side of a highway while other cars are driving past at 75MPH is not the safest idea.   Has the problem been reproduced or confirmed by a dealer or independent service center?  The car was towed to a nearby KIA dealership and they have yet to take a look at it.  It has been four days since the incident.   Has the vehicle or component been inspected by the manufacturer, police, insurance representatives or others?  I filed a complaint with KIA on Sunday and called today, they said they are escalating the issue but we have not heard any changes.   Were there any warning lamps, messages or other symptoms of the problem prior to the failure, and when did they first appear?  There were no warnings prior to the incident, the dashboard lights turned off and an indicator light showed the immobilizer mode was on.",
        "vin": "kndmc5c14l6"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "09/07/2020",
        "dateOfIncident": "02/29/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353557,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "NINE TIMES OUT OF TEN THE THIRD ROW SEAT DOESN'T LATCH PROPERLY.  USUALLY ONE SIDE WILL LATCH SECURELY AND THE OTHER WON'T.  THEN IT GETS STUCK.  SUPER DANGEROUS AND NEEDS TO BE RECALLED ASAP.  VEHICLE HAS 3600 MILES ON IT NOW AND HAS BEEN HAPPENING SINCE WE PURCHASED IT NEW.",
        "vin": "KNDMB5C13L6"
    }
]