[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/12/2021",
        "dateOfIncident": "07/20/2020",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424513,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "FUZION",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Originally, the rear axle on our trailer failed last year in July of 2020. We had an axle that was cambered in and that resulted in abnormal wear on our rear tires. Because of the abnormal wear, we had a blowout of our left tire on the rear axle while traveling on Interstate 84 in Oregon.   After eight months, the dealer, Camping World/Keystone, replaced the axle. Upon receiving the trailer back in April from the dealer,  we noticed it was leaning to the right about three inches. Since we were unaware of the real issue, we went on our trip.  We have had to level the trailer with leveling blocks at our campsite each time on the right side. We haven't had to do that in the past.   Our safety and the safety of others were put at risk because the leaf spring could have broken, pulled the rear axle back, and steered us in an unexpected direction. This could result in us going into other vehicles on the road.   Today, we had it inspected by two companies: The Spring Works as well as Bob Scott RV respectively in Grand Junction, Colorado. They both confirmed that we had a bad leaf spring on the right rear axle. Additionally, Bryan Dubose, at The Spring Works stated that the left rear leaf spring has been compromised because of the other faulty one.  There were no warning signs other than the trailer leaning to the right when viewed from the rear. The symptom of the trailer leaning to the right first appeared when Camping World had replaced the defective rear axle and returned it to us in April of 2021.",
        "vin": "4YDT26R21KD"
    }
]