[
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/22/2021",
        "dateOfIncident": "04/30/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444732,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "EL VEHICULO TIENE PROBLEMAS DE ENCENDIDO, DESPUES DE ESTAR EN REPOSO DOS DIAS NO ENCIENDE SE TIENE QUE PASAR CORRIENTE, INCLUSIVE EN MANEJOS CORTOS AL VOLVER A ENCENDER EL VEHICULO PRESENTA EL MISMO PROBLEMA, ESTE ES UN PROBLEMA EN LA MAYORIA DE ESTE TIPO DE VEHICULOS, MISMOS QUE SON ENCONTRADOS MUCHOS COMENTARIOS EN INTERNET, EL VEHICULO ESTA EN LA CDMX MEXICO.",
        "vin": "JM1BPCML7L1"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/18/2021",
        "dateOfIncident": "07/15/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444236,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving the vehicle decided to suddenly brake ....... thinking it was dangerous ..... lucky no one was behind me ..... that was really scarry and could have caused an accident for no reason.",
        "vin": "3MZBPAEM0LM"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "09/09/2021",
        "dateOfIncident": "08/29/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432358,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I was on the Queensboro Bridge headed from Queens, NY into Manhattan on the afternoon of August 29.  Weather was partly cloudy and dry conditions.  Traffic was bumper to bumper and moving anywhere from 0mph to maybe 5mph.  I was in the middle of the bridge driving approximately 5mph and my 2020 Mazda 3 beeped (collision warning) and applied brakes.  I was almost rear ended and my two passengers were jolted forward.  I maintained a safe following distance the entire time.  I believe a van on my left triggered my car’s actions as it passed.  I was in no danger of getting into an accident although I was quite shaken up since this is the first time my car applied its brakes.  I have an appointment to bring my car in and would like the automatic braking system disabled.  Previously, the car from time to time has alerted of a collision always under 40mph and a previous inspection of my vehicle (after I reported collision warning activation) revealed  everything was working properly.",
        "vin": "3mzbpacl2lm"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/09/2021",
        "dateOfIncident": "09/15/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432381,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Mazda Mazda3. The contact stated while driving 35 MPH, the ABS warning light illuminated, and the brakes locked up and caused the vehicle to stall. The contact was able to restart the vehicle however, the failure persisted. The contact had taken the vehicle to a local dealer to be diagnosed however, the dealer was not able to duplicate the failure. The vehicle was not repaired. The manufacturer was made aware of the failure. The failure mileage was approximately 2,000.",
        "vin": "JM1BPBMM7L1"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "08/23/2021",
        "dateOfIncident": "08/04/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430207,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The Mazda Radar Cruise Control (MRCC) system performs poorly (it does not hold a set speed well up and down hill; compared to our 2006 Mazda3), but the safety concern is the forceful, sudden, and not-always-predictable braking the vehicle does even if there is not another vehicle in front of us. It brakes, sometimes, for a vehicle in the right lane (we, in the left), and continues to brake unless we override the system. No problem--except if there may be someone following too closely, it could cause a collision. It seems to be related to the MRCC, as no \"Brake!\" warning accompanies the unwanted brake application. I've contacted Mazda numerous times; they recommended taking it to the dealer. I have--they can find nothing wrong. All of this seems related to a MRCC update (SSP C5) that was done to smooth the MRCC's operation. It did fix the sudden deceleration and acceleration when following other vehicles, but now is worse in other aspects. I may be wrong, but it all seems to be a software issue, so it's not surprising that the dealer can find \"no concerns\". As to the date of this incident, it happens nearly every time we take the car on a highway or interstate.",
        "vin": "3MZBPBDM2LM"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "06/16/2021",
        "dateOfIncident": "06/08/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421125,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The front radar sensor failed and doesn’t work anymore rendering the FCW and ACC useless. There is a TSB out about water damage getting into the sensor. There are 2 warning lights on. They first appeared when I turned on my car one day.",
        "vin": "JM1BPANM5L1"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "05/31/2021",
        "dateOfIncident": "05/30/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419118,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving 35MPH on a side street in “sport” mode. Car system beeped, car auto stopped, red circle with explanation mark and the word Break appeared on my center console. My drive shift popped out of Drive. No object was in front of my car, nothing ran out in front of it. Fortunately, there weren’t any other cars behind me or an accident would have followed.",
        "vin": "3MZBPACL8LM"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "05/05/2021",
        "dateOfIncident": "03/25/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415327,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR IS ONLY A FEW MONTHS OLD, WITH ONLY 1600 MILES. WHILE DRIVING AT APPROX 30 OR 40 MPH THE SMART BRAKE SYSTEM (SBS)  FALSELY DETECTS RANDOMLY AN OBSTACLE WHILE DRIVING, ACTIVATING THE AUTOMATIC EMERGENCY WARNING LIGHT AND ALARM. THE MAZDA DEALER WAS UNABLE TO DUPLICATE OR REPAIR THE PROBLEM ALTHOUGH THIS HAS BEEN REPORTED NUMEROUS TIMES AND WAS PART OF AN EARLIER RECALL.   I.E.MAZDA RECALL NUMBER 4219L",
        "vin": "3MZBPACLXLM"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/13/2021",
        "dateOfIncident": "03/13/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402806,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY VEHICLE STRAIGHT AHEAD ON A TWO-WAY CITY STREET WITH NO OTHER VEHICLES IN FRONT OR ON MY SIDES. I WAS TRAVELING AT A SPEED OF 40 MPH. THE TWO-WAY STREET IS SEPARATED BY A CONCRETE DIVIDER AND TROLLY TRACKS. A \"BRAKE!\" ALERT APPEARED ON THE DISPLAY SCREEN FOLLOWED BY BEEPS. SUDDENLY THE BRAKES WERE ENGAGED BRINGING THE VEHICLE TO A COMPLETE STOP CAUSING THE VEHICLE BEHIND TO COME TO A SCREECHING HALT. IN A FEW SECONDS I WAS ABLE TO DRIVE OFF.",
        "vin": "3MZBPAEM7LM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/06/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399487,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE IS LESS THEN A YEAR OLD AND HAS LESS THAN 10000 MILES ON IT. THE PAINT IS CHIPPING EXTREMELY EASILY. WITHIN THE FIRST MONTH I HAD 3 CHIPS IN THE PAINT ALL THE WAY DOWN TO BARE METAL ON THE DOORS. I BOUGHT A PAINT TOUCH UP PEN FROM MAZDA AND FILLED THEN IN. NOW, A FEW MONTHS LATER I FILLED IN 17, YES 17 MORE ON MY HOOD. I DIDNT EVEN COUNT THE CHIPS IN THE PAINT ON MY BUMPER. THIS IS ABSURD, MY OTHER VEHILCE THAT IS 17 YEARS ON AND HAS OVER 150K MIELS HAS 2 HOOD CHIPS!! AND IT'S DRIVEN THE SAME AMOUNT.",
        "vin": "JM1BPACL9L1"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/08/2021",
        "dateOfIncident": "11/25/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387164,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER COMING INTO CABIN FROM DRIVER DOOR WINDOW. BROUGHT IT TO MAZDA SERVICE CENTER THREE TIMES AND THEY CANNOT FIGURE OUT WHERE WATER IS COMING FROM. WATER POOLS IN THE DOOR WHEN IT RAINS AND SEEPS INTO THE CABIN.",
        "vin": "3MZBPADL7LM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/29/2020",
        "dateOfIncident": "09/24/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361790,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY NEW 2020 MAZDA 3 PREMIUM WITH 1,177 MILES SUDDENLY TOOK COMPLETE CONTROL OF STEERING MY CAR. DRIVING 65-70 MPH ON A 3 LANE STRAIGHT HIGHWAY ON A CLEAR DAY, WITH LIGHT TRAFFIC, I MOVED ONE LANE TO MY LEFT, AND THE CAR TOOK OVER THE STEERING, PULLING MY CAR OUT OF THE LEFT LANE NEARLY MISSING THE CENTER CEMENT DIVIDER, THEN DARTING BACK ACROSS MY LANE AND HALFWAY INTO THE LANE TO MY RIGHT,THEN DASHING BACK TO THE CEMENT MEDIAN.  I AM UNAWARE OF  HOW MANY TIMES  THE BACK AND FORTH OCCURRED, I TRIED TO SLOW THE CAR DOWN TO NO AVAIL. THE CAR WAS MOVING FAST, AND THE PATTERN THE CAR MOVED IN WAS VERY PRECISE, AS IF THE CAR KNEW NOT TO HIT THE MEDIAN AND GO FURTHER INTO THE LANE TO MY RIGHT. FINALLY THE CAR STOPPED STEERING ITSELF, AND I WAS ABLE TO EXIT THE HIGHWAY. MY CAR WAS NOT DAMAGED. I HIT MY HEAD TWICE ON THE DRIVES SIDE DOOR. I DID NOT REQUIRE MEDICAL ASSISTANCE.",
        "vin": "JM1BPBNM3L1"
    }
]