[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/22/2022",
        "dateOfIncident": "03/22/2022",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457856,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The passenger rear plastic wheel trim fell off with no incident/ damage",
        "vin": "Jm3tcady4l0"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "09/17/2021",
        "dateOfIncident": "09/12/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433381,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "On 10/12/2021 we were driving on and urban street when the vehicle infront of us signaled and initiated a right hand turn. At that point were we traveling approximately 20 mph, and we were driving with active cruise disengaged. When we were around 150 feet behind the vehicle taking a right when our CX-9 falsely engaged the emergency braking. Our car with our whole family in it locked up the brakes and stopped in 80 feet short of the car taking a right. The vehicle behind us only managed to stop 10 feet short of hitting us in the rear. It is in the 4 people in our vehicles opinion that this operation was both terrifying and dangerous to use and those following.",
        "vin": "Jm3tcbcy4l0"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/10/2021",
        "dateOfIncident": "07/27/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428575,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The 2020 Mazda completely shut off following an exit from an expressway, turn under a bridge and slow down for a red light. The Mazda electrically shut off and coasted to a braked stop in the center lane of a 3 lane road. The entire electrical system went dead, no exterior lights, signals, instrument panel or radio. There was no warning, everything electrical just shut off. In a moving traffic situation the car could not maneuver or restart without being placed in PARK.   (There is a history of Mazda CX 9's having a similar problem which sent the driver to the local dealership.)  The car was restarted by shifting into Park and pressing the start button, all functions appeared normal as the driver moved it to a parking lot to review the situation. The driver was unable to re-create the complete shut down and finished the trip. The driver took the Mazda to the dealer following the  incident and was asked to leave the Mazda for observation. The driver was notified by the dealership that the problem was being  elevated to the national team for diagnosis.  10 days later the local dealer called the driver and said that they; nor the Mazda engineers in California; could reproduce the system shutting off or find any error codes. They wanted to return the car to the driver with no need for a repair.  The driver spoke to the National Mazda help line and the representative was aware of the situation. The representative reiterated that engineers had been unable to find the source for the incident in the computer logs so they could not provide a remedy. The representative offered the driver the choose of a purchase buy back and a discount on the purchase of a new car.",
        "vin": "JM3TCBEYXL0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/01/2021",
        "dateOfIncident": "01/15/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11391114,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL CAP LIGHT ON IN DEC 2020. OUR CAR MILEAGE ~14,000 MILES . WE BOUGHT BRAND NEW CX9 2020 IN AUGUST.  DEALER INSPECTED IT AND FOUND NOTHING WRONG. DEALER REPROGRAMMED IT. A MONTH LATER JAN 1,2021, FUEL CAP LIGHT IS ON ON AGAIN. WE IGNORED IT THINKING IT IS ANOTHER PROGRAM ISSUE. CAR STARTED TO JERK AND VIBRATE AT STOP SIGN. WE BROUGHT TO DEALER THE NEXT DAY. DEALER SAID CHARCOAL BOX IS LEAKING. I THOUGHT CHARCOAL BOX SHOULD LAST A LIFE TIME. THEY SAID IT IS NOT UNDER WARRANTY: $680 LATER, THE JERKING/VIBRATING ISSUE  IS FIXED.  HOPEFULLY THAT IS IT SINCE WE ONLY HAVE THE CAR FOR 5 MONTHS",
        "vin": "JM3TCBDY1L0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/04/2020",
        "dateOfIncident": "01/30/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307114,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE MAZDA CX-9 UNCOMMANDED ENGINE ACCELERATION REPORTED HEREIN DID NOT RESULT IN ANY DAMAGE PRIMARILY BECAUSE IT COMMENCED SEVERAL SECONDS AFTER I BEGAN LIGHT BRAKING WHILE APPROACHING A RED TRAFFIC LIGHT.  MY IMMEDIATE RESPONSE WAS TO INCREASE BRAKE PRESSURE; THERE WAS NO NEED FOR ME TO MOVE MY LEG OTHER THAN PRESSING HARDER WITH MY FOOT.  MY FOOT HAD BEEN OFF THE ACCELERATOR FOR MANY SECONDS WHILE ALLOWING THE CAR TO SLOWLY DECELERATE WHILE COASTING TOWARD TRAFFIC STOPPED AT A RED LIGHT. WITHIN TWO SECONDS OF COMMENCEMENT OF UNCOMMANDED ENGINE ACCELERATION AND WITH THE CAR FULLY STOPPED, I SHIFTED THE TRANSMISSION INTO NEUTRAL.  THE ENGINE IMMEDIATELY GENERATED THE NOISE OF VERY HIGH RPM.  ALTHOUGH THE DASHBOARD INCLUDES A TACHOMETER, I DID NOT IMMEDIATELY THINK TO LOOK AT IT; INSTEAD, I TURNED THE IGNITION OFF.  A FEW SECONDS LATER, I SHIFTED THE TRANSMISSION INTO PARK AND RESTARTED THE CAR WHICH OPERATED NORMALLY THEREAFTER.  MY FOOT DID NOT MOVE OFF THE BRAKE PEDAL DURING ANY OF THE PRECEDING SEQUENCE.  ONLY THE NHTSA AND POSSIBLY THE MANUFACTURER WOULD KNOW IF THIS IS A ONE IN A BILLION-HOURS OR A MORE COMMON OCCURRENCE.  I AM WILLING TO ANSWER ANY QUESTIONS THE NHTSA OR THE MANUFACTURER MIGHT HAVE.  I GRADUATED FROM MIT, WORKED OVER 29 YEARS FOR THE LEADING USA COMMERCIAL AIRCRAFT MANUFACTURER AND AM CURRENTLY RETIRED.",
        "vin": "JM3TCBDY5L0"
    }
]