[
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "10/20/2021",
        "dateOfIncident": "10/19/2021",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437428,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Forward collision warning light comes on with no car in front of me and car starts braking. I did see that Mitsubishi was recalling these cars with this particular problem but I have not received a recall notice.",
        "vin": "JA4J24A58LZ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "08/24/2021",
        "dateOfIncident": "08/18/2021",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11430374,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I was at a 24 hr storage unit. It was dim & I needed to unload from the rear hatch door so I backed to the open storage unit door in its upright position as high as I could get it &  stopped at a safe distance from the doorway so the car door would not catch the storage unit door.  I put the vehicle in PARK to have some lighting  & double checked before I got out- gear shift securely in PARK. I opened the car's rear door & started unloading without overly disturbing the vehicle or causing any unnecessary movement. I had just turned my back to the car door to put down some boxes in the unit. As I turned back to the car to retrieve another item, I noticed movement. There was a rapid simultaneous series of events: I felt the rear hatch hit my nose, I heard a crash with shattering glass & I tried to jump clear. It was over in minutes . I was inside the storage unit and had to squeeze out to try to free the storage unit door. The door had fallen and gotten wedged between the rear frame of the car & behind the back wiper. I gently freed the door after much diigent effort. Once freed, the car proceeded to move forward on its own before I could access it to shut off the engine, & it eventually crashed into the opposite storage unit. I accessed the vehicle at that time & reversed away from the buildings so the car was equidistant from both buildings & facing an area where it would do minimal harm if it moved again, though I did cut off the engine. Verified vehicle was in PARK. The car had damage to the whole rear area, & damage to the driver's side bumper. Front wheels had been turned right so the car's trajectory was a wide right arc. i tried calling the rental facility manager but there was no after hours number & no answer, so I called city police who promptly arrived within minutes; one vehicle immediately drove up & I quickly punched in my gate access code for easier entry. This vehicle was followed by another white pickup who punched a code on the keypad & let himself",
        "vin": "JA4AD2A38LZ"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/18/2021",
        "dateOfIncident": "04/17/2021",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408641,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF GLASS SHATTERED",
        "vin": "JA4AD3A37LZ"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/31/2021",
        "dateOfIncident": "03/30/2021",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405790,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON THE FREEWAY AT 70MPH, THE CAR SUDDENLY STARTED FLASHING WARNINGS OF \"EV SYSTEM REQUIRED STOP SAFELY\", \"RBS SERVICE REQUIRED!\", AND THE SERVICE ENGINE SOON LIGHT CAME ON. ALSO, I WASN'T ABLE TO ACCELERATE OVER 20MPH. I QUICKLY EXITED THE FREEWAY AND TURNED OFF THE CAR. WHEN I RESTARTED IT, THE CAR SEEMED TO OPERATE NORMALLY AS FAR AS THE ACCELERATION, BUT THE SERVICE ENGINE LIGHT SOON LIGHT REMAINED AND THE \"BRAKE!\" FORWARD COLLISION MITIGATION SYSTEM STARTED TO RANDOMLY KICK IN.    INTERESTINGLY, IN THE WEEK LEADING UP TO THE SYSTEM SHUTTING DOWN THE FORWARD COLLISION MITIGATION SYSTEM HAD RANDOMLY KICKED IN A FEW TIMES, BUT I ASSUMED THERE WAS SOMETHING LOW IN THE ROAD I WASN'T SEEING. I'VE ALSO EXPERIENCED ISSUES WITH THE AUDIO SYSTEM AND REAR CAMERA IN THE WEEK LEADING UP TO THIS INCIDENT; THE REAR CAMERA TWICE NEVER APPEARED WHEN IN REVERSE AND THE AUDIO SOURCE WOULD ERRATICALLY SWITCH FROM XM RADIO TO APPLE CAR PLAY ON ITS OWN.    THE VEHICLE HAD JUST UNDER 1,700 MILES ON IT WHEN THIS HAPPENED.",
        "vin": "JA4J24A56LZ"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/01/2021",
        "dateOfIncident": "01/06/2021",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11391077,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 MITSUBISHI OUTLANDER. THE CONTACT STATED WHILE ANOTHER DRIVER WAS DRIVING AT APPROXIMATELY 25-30 MPH, THE DRIVER EXPERIENCED A MEDICAL EMERGENCY AND CRASHED INTO A TREE.  THE AIR BAGS FAILED TO DEPLOY. THE OCCUPANT IN THE PASSENGER'S SEAT SUSTAINED A HEAD INJURIES AND MEDICAL ATTENTION WAS PROVIDED. THE FIRE AND POLICE DEPARTMENT WERE AT THE SCENE. THERE WAS NO REPORT OF A FIRE. THE VEHICLE WAS TOWED TO AN INDEPENDENT LOT. THE LOCAL DEALER WAS NOT CONTACTED.  THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE  MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 6. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/26/2021",
        "dateOfIncident": "01/22/2021",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390090,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS 4 MONTHS OLD WITH 5500 MILES ON IT. DRIVING AT 70MPH WITH CRUISE CONTROL ON, CAR STARTED TO KNOCK AND BUCK.  I REDUCED SPEED.  THE SERVICE TRANSMISSION LIGHT CAME ON AND THE D FOR GEAR SELECTION STARTED TO BLINK.  I PULLED OVER AND SHUT THE CAR OFF.  I RESTARTED AND THE LIGHT WENT OFF.  I DROVE HOME AT A REDUCED SPEED. I TOOK IT BACK TO THE DEALER AND THEY SAID I NEED A NEW TRANSMISSION.  5500 MILES!",
        "vin": "JA4AZ3A31LZ"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "06/13/2020",
        "dateOfIncident": "03/09/2020",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 4,
        "odiNumber": 11328690,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 MITSUBISHI OUTLANDER WAS STRUCK IN THE REAR END AND SLAMMED AGAINST A SOLID FOUNDATION IN THE FRONT THAT CAUSE THE DASHBOARD TO BREAK AND ALL THE SEATS TO BREAK FROM THE FLOOR OF THE CAR. THE AIRBAGS DID NOT DEPLOY AND SEVERE INJURIES RESULTED. THE VEHICLE WAS STATIONARY ON THE HIGHWAY IN ROUTE TO TURN WHEN STRUCK.  *TR",
        "vin": "JA4AD3A37LZ"
    }
]