[
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/24/2021",
        "dateOfIncident": "09/23/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434284,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MAXIMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Nissan Maxima. The contact stated the collision sensor system on the vehicle was malfunctioning, causing the vehicle to brake on its own while reversing in parallel parking. The contact stated the vehicle would always make buzzing sounds while parking. The contact stated while he was reversing out of a parking space on a hill, the vehicle inadvertently stopped, causing him to hit the vehicle in front of him. The dealer and the manufacturer were not notified of the failure. The vehicle was not diagnosed nor repaired. The approximate failure mileage was 25,000.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES,BACK OVER PREVENTION,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "08/04/2021",
        "dateOfIncident": "08/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427755,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MAXIMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving 2020 Nissan Maxima Sv the emergency park brake light up and rear brake light up and traction control light up on dash and it act like it looses power and when you go to settings on sonar it big green light in front of car And check engine light came on",
        "vin": "1n4aa6cv9lc"
    },
    {
        "components": "PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "07/24/2021",
        "dateOfIncident": "05/28/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426312,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MAXIMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "My emergency brake comes on any time I drive after a heavy rain.. it starts to illuminate vaguely,then eventually the brake light will come on and then eventually it’ll start indicating to pull over. The first time I was in rush hour traffic on a busy highway. Was able to push down on the brake and release long enough to come off an exit before it came back on. Had to let the car sit for over 20 minutes. The second time we had heavy rain I got in the car the following day after 15 mins of driving the brake light started to illuminate and I could not get it to go off I had to pull over several time eventually sitting on the side of the ride for 20 mins again for it to go off. I could smell a burning smell when I exited the vehicle",
        "vin": "1n4aa6ev8lc"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/22/2021",
        "dateOfIncident": "06/10/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421900,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MAXIMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Nissan Maxima. The contact stated that while driving at 50 - 55 mph, the vehicle lost motive power, and the Automatic Emergency Braking (AEB) System, Slip indicator, and Rear Automatic Braking warning lights were illuminated. The vehicle was taken to the dealer but the dealer could not replicate the failure. The vehicle was not repaired and remained at the dealer. The manufacturer was made aware of the failure and informed the contact that they would not authorize the dealer to perform the repair and could not replace or repurchase the vehicle. The failure mileage was 8,296.",
        "vin": "1N4AA6DV4LC"
    },
    {
        "components": "STRUCTURE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/14/2020",
        "dateOfIncident": "11/30/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383454,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MAXIMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD CRACKS RANDOMLY WITH NO POINT OF IMPACT. FRAYS OUTWARD. SEEMS TO BE STRESS FRACTURE FROM THE FRAME. HAPPENED MULTIPLE TIMES WITH 2020 NISSANS",
        "vin": "1N4AA6EVXLC"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/26/2020",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351414,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MAXIMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 NISSAN MAXIMA. THE CONTACT STATED THAT WHILE DRIVING AT 55 MPH, WHEN THE INSTRUMENT PANEL BEGAN FLASHING RED AND THE VEHICLE FORCEFULLY BRAKED INDEPENDENTLY. THERE WERE NO VEHICLES NEARBY AND A CRASH WAS AVOIDED. THE CONTACT STATED HE WAS ABLE TO DRIVE TO HIS DESTINATION. THE FAILURE OCCURRED ON THREE DIFFERENT OCCASIONS. THE VEHICLE WAS TAKEN TO A LOCAL DEALER (SOUTH SHORE NISSAN LOCATED AT 200 SUNRISE HWY, AMITYVILLE, NY 11701, (516) 269-8338) AND WERE UNABLE TO DUPLICATE THE FAILURE. THE MANUFACTURER HAD BEEN INFORMED OF FAILURE. THE FAILURE MILEAGE WAS 3,200.",
        "vin": "1N4AA6FVXLC"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "02/04/2020",
        "dateOfIncident": "02/04/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302001,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MAXIMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 NISSAN MAXIMA SR. CONSUMER WRITES IN REGARDS GAS CAP DOOR LOCK FUNCTION. *LD    THE CONSUMER WAS CONCERNED THAT THE BACK UP CAMERA WOULD NEED A SYSTEM UPGRADE DO TO POOR VISIBILITY. *JS",
        "vin": "1N4AA6EVXLC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/03/2020",
        "dateOfIncident": "12/20/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11296820,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MAXIMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "NISSAN IN THE 2020 MAXIMA MODELS REMOVED THE LOCKING FEATURE OF THE GAS CAP DOOR. THIS IS A SAFETY CONCERN FOR POSSIBLE VANDALISM TO THE VEHICLE A PERSONAL SAFETY CONCERN BECAUSE IS A KEYED LOCKING CAP IS INSTALLED THE INDIVIDUAL HAS TO FUMBLE THROUGH UNLOCKING THE CAP IN ORDER TO FILL THE TANK. NEITHER THE SALES PERSON OR SERVICE DEPARTMENT PERSONNEL KNEW THIS FEATURE HAD BEEN REMOVED IN THE 2020 MODEL. IT'S AVAILABLE IN THE 2019 MAXIMA MODELS. THE REMOVAL OF THIS FEATURE, EVEN THOUGH ITS STANDARD ON MOST VEHICLES SOLD IN NORTH AMERICA SHOULD HAVE BEEN DISCLOSED BEFORE THE VEHICLE WAS PURCHASED. FURTHER, THE FACT THAT NEITHER THE SALES PERSON AT THE DEALER, SERVICE DEPARTMENT PERSONNEL OR MANAGEMENT AT THE DEALER KNEW ABOUT THIS, SHOWS THAT NISSAN PURPOSELY WITHHELD THIS INFORMATION FROM THE CONSUMERS. HAD I KNOWN THIS FEATURE WAS NO LONGER AVAILABLE, EVEN THOUGH IT'S STILL AVAILABLE IN LESS EXPENSIVE MODELS IN THE NISSAN BRAND, I MAY HAVE OPTED TO PURCHASE A DIFFERENT VEHICLE.   NISSAN MARKETS IT PRODUCTS AS BEING OVERLY SAFE, HOW DOES THE REMOVAL OF THIS KEY FEATURE MAKE THE NISSAN AS SAFE AS NISSAN MARKET THEIR PRODUCTS?   THE REMOVAL OF THIS FEATURE MAKES THE SAFETY OF THE VEHICLE AND THE PERSON FUELING THE VEHICLE QUESTIONABLE!  *JS",
        "vin": "1N4AA6EV5LC"
    }
]