[
    {
        "components": "ELECTRICAL SYSTEM,BACK OVER PREVENTION,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/20/2022",
        "dateOfIncident": "03/20/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457534,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Everytime I turn my car on, there’s a chance that some lights will turn on my dash for absolutely no reason..the car could be parked and getting warmed up and the traction control light,parking collision warning, and front collision light all turn on simultaneously. I have included a photo to get a Better picture! only way for me to get rid of them is by turning my car off for 5 minutes then turning it back on again. It been a real inconvenience. Not to mention when those lights turn on it means I can’t Parallel park anywhere because my rear parking assist prevents me from backing up, because it “thinks” something is in the way…ugh!  Not only that but everytime I play music my Nissan Connect shuts of in the middle of my drive then resets and starts playing music again. If you guys have any answers for me please let me know I bought this car in August of 2021",
        "vin": "3N1CN8DV0LL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/11/2022",
        "dateOfIncident": "02/14/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11456328,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS DRIVING HER 2020 NISSAN VERSA SR BACK FROM A DOCTORS APPOINTMENT AT 3:30 PM ON 14 FEB 2022 TRAVELING ABOUT 25 MPH THRU RESIDENTIAL AREA WHEN BOTH SIDE AIR BAGS EXPLODED AND TOTALLY ENCAPSULATING HER SO SHE COULD NOT BREATH NOR MOVE TO STEER THE VEHICLE AND IT WAS ALL SHE COULD DO TO APPLY THE BRAKES. A FIRE TRUCK WS RIGHT BEHIND SO SO WERE ABLE TO RENDER ASSISTANCE AND CUT HER OUT OF THE AIR BAGS SO SHE COULD BREATH. THE AIR BAG IMPACT SEVERELY HURT AND CAUSED BRUSES AND HEARING LOSS AND SHOCK. THERE WAS NO IMPACT NOR DOOR CLOSURES NOR ANYTHING ELSE OTHER THAN A MALFUNCTION WHICH CAUSED THIS. THIS CAR HAS LESS THAN 15,000 MILES. THE. CARS TROUBLE CODE SHOWED A ROLL-OVER CAUSE THE AIR BAGS TO DEPLOY; HOWEVER, AGAIN THERE WAS NO IMPACT NOR ROLL-OVER NOR ANY DAMAGE TO THIS VEHICLE WHICH COULD CAUSE AIR BAGS TO ACTIVATE. PLEASE UNDERSTAND THE AIR BAGS WERE ACTIVATED BY WHAT APPEARS TO BE A COMPLETELY RANDOM ELECTRICAL MALFUNCTION. i SUSPECT THE CAUE MIGHT BE SOMESORT OF SENSITIVITY TO ELECTROMAGNECTIC RADIATION SUCH AS THE NEW 5G CELL PHONES OR HIGH POWERED RADIOS SO.... IN THE PAST... Nissan determined the wrong combination of metals was used in the side airbag sensor connector harness, causing oxidation on the pins of the airbag control unit harness connection. The oxidation on the connector pins can cause a short loss of communication from the satellite sensor to the airbag control unit.The Nissan Versa curtain and seat-mounted side airbag system will enter a backup mode when signal loss occurs and this backup mode allows the curtain and seat-mountain side airbags to deploy as intended in a crash. However, the backup mode that kicks in from signal loss changes the requirements that must be met for the airbags to deploy, so simply slamming the doors can activate the airbags. Typically the force needed to activate the airbags can only come from someone slamming a door from the outside, but real hazards exist if occupant is inside the car when airbags deploy.",
        "vin": "3N1CN8FV0LL"
    },
    {
        "components": "BACK OVER PREVENTION,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/25/2022",
        "dateOfIncident": "02/25/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454168,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Recently, my Nissan has started having many problems with several of the collision/emergency sensors on the vehicle. It will happen randomly, in any sort of weather, and the sensor warnings will stay on for different amounts of time during each incident. Having the sensors randomly go off while driving is incredibly distracting, not to mention completely unsafe and useless. Along with the sensor issues, the AEB will spontaneously stop my vehicle and not allow me to brake it hot the gas. This is notable mainly when reversing. Just this morning I was completely unable to back out of my driveway because the AEB system kept automatically braking and preventing me from being out (though there was absolutely nothing moving or in the way.)",
        "vin": "3N1CN8EV7LL"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "12/14/2021",
        "dateOfIncident": "12/14/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11443774,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "After I crossed a bridge between 55 and 60 mph the aeb gave a collision warning and almost immediately applied full braking power. This caused a 3 car collision that resulted in moderate injuries. Before the incident there were no recalls or other repairs needed on the car. After the incident the car was inspected for potential issues by a team of lawyers the insurance company and the repair shop and no non crash damage related issues were found. Since the vehicle was repaired the problem has occurred on 3 separate occasions during normal daily use.",
        "vin": "3n1cn8bv5ll"
    },
    {
        "components": "POWER TRAIN,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "10/24/2021",
        "dateOfIncident": "10/23/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437969,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Cvt transmission shutter hesitating and failing in places that could cause an accident several times the car has come to a stop with the emergency assistance system and errors out often",
        "vin": "3n1cn8fv8ll"
    },
    {
        "components": "UNKNOWN OR OTHER,BACK OVER PREVENTION,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "10/13/2021",
        "dateOfIncident": "10/05/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436593,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "This issue has been going on for 6 months. On three different occasions I have taken my car to Fred Hass Nissan due to the sensor lights coming on as if someone is going to hit me from the back and side of my car. It is still not fixed and they tell me it is safe to drive but I feel unsafe.  You can be driving down the road whether it be sunshine or raining and no cars are around you and all of a sudden these sensor lights come on and my car slows down as if trying to avoid a collision.  I have purchased 4 vehicles over the past several years from this same dealership and this one has given me trouble.  I had to beg for them to give me a rental car so they could check my car out Monday and then they called me Tuesday late afternoon to come get my car because they couldn't fix it and it's under engineering review to figure out how to resolve this issue.  This is the 2nd time they have given me this excuse.  I called Nissan Corporate 800 number and complained and this man from Consumer Affairs who was very rude kept telling me there was nothing they could do and they weren't going to buy back my car and that I would just have to take it back to the Dealership and they would have to figure it out on how to fix the issue and that a letter would be going out to them and that I would need to contact them on if they received the letter or not. I have photos and videos of the sensor light issues and have given them to Fred Haas Nissan to review and again nothing has been done.  I am back in this car still having the issue and Nissan doesn't want to keep the car and give me a rental until they can come up with a solution to fix the issue.  I am afraid that if it is not corrected there is going to be an accident that could have been prevented.",
        "vin": "3N1CN8DV2LL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/03/2021",
        "dateOfIncident": "09/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431569,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Natural wind and/or velocity from surrounding moving vehicles, and/or speeds above 55mph forces random uncontrollable car movement, at times forcing the car to cross lane markers. I do not feel safe driving on the freeway,  highway, or two way streets.",
        "vin": "3N1CN8EV0LL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/06/2021",
        "dateOfIncident": "07/05/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423520,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Check engine light came on went and got a diagnostics and P2859 and when i looked it up on google Nissan has had recalls in the past on the same thing",
        "vin": "3N1CN8DV8LL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/23/2021",
        "dateOfIncident": "06/23/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422064,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The gas tank is no longer going up to the standard amount of 210 like when I initially bought it last week. It is now at 171 miles maximum with a full tank of gas.",
        "vin": "3N1CN8EV5LL"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "04/18/2021",
        "dateOfIncident": "04/15/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408596,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FLASH ABE LIGHT FOR NO REASON",
        "vin": "3N1CN8DVXLL"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "03/30/2021",
        "dateOfIncident": "03/27/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405503,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "OPENED HOOD JUST TO DO ROUTINE INSPECTION AND MAINTENANCE. CLOSED HOOD AND HOOD LATCH WOULD NOT HOOK AND LOCK HOOD INTO THE CLOSED POSITION.",
        "vin": "3N1CN8EV4LL"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/02/2021",
        "dateOfIncident": "09/17/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398799,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST ISSUE WAS A DEFECTIVE BRAKE SYSTEM. THE PART THAT COMPRESSESS AIR TO MAKE A HYDROLOGIC HAD A HOLE. YOU COULD HEAR WHAT SOUNDED LIKE A BASKETBALL BEING DEFLATED NEAR THE BRAKE PEDAL. THEY FIXED IT THIS WAS AT ABOUT 25K MILES. AND NOW THE PERSISTENT PROBLEM IS THE TRANSMISSION.  IT MAKES MY CAR JERK OR RUN WITH REDUCED POWER, OR SOMETIMES MORE POWER. ITS VERY ANNOYING AND A BURDEN. ALSO THE FUEL OXYGEN INTAKE RATIO HAS TO CONSTANTLY BE RESET BY ME EITHER SWITCHING THE CAR TO NEUTRAL WHILE DRIVING OR BY TURNING THE ENGINE OFF THEN TURNING BACK ON 5 SECONDS LATER, THEN TURNING IT OFF AGAIN. AND TURNING IT BACK ON 30 SECONDS LATER, AND REPEATING THE 30 SECONDS ON AND OFF UNTIL THE ENGINE SOUNDS STABLE.  ALSO THE NISSAN DEALERSHIP TOTALLY TOOK ADVANTAGE OF ME. AND THEY STILL TREAT ME AVERAGE AT BEST WHEN I GET MY LIO CHANGES THERE. AND ALWAYS MAKE COMMENTS ABOUT THE MILEAGE.  I DON'T EVEN COMPLAIN TO THEM ABOUT THE CAR.",
        "vin": "3N1CN8EV0LL"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/18/2021",
        "dateOfIncident": "02/12/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396869,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS STATIONARY, IT WILL NOT START, IT WILL NOT TURN ON. NONE OF MY LIGHTS HAVE BEEN LEFT ON, NOTHING HAS BEEN PLUGGED IN. THE FIRST TIME I HAD IT JUMPED IT STARTED AND TURNED ON. THE BELT WAS MAKING A HIGH PITCHED SQUEALING NOISE. AFTER IT WAS INITIALLY JUMPED AND AFTER IT WAS ON & DROVE AROUND & PUT BACK IN PARK AND TURNED BACK OFF. IT NO LONGER WOULD START. I HAVE TRIED TO HAVE IT JUMPED AGAIN & IT WOULD NOT JUMP. I AM CONCERNED WITH THE ENGINE AND FUEL SYSTEM. WHEN I'VE TRIED TO TURN IT ON AND IT WOULDN'T IT MADE SORT OF LIKE A GARGLING NOISE AFTER I HAD HIT THE START BUTTON AS WELL AS THE GAUGES COMING VERY SLIGHTLY & SHAKING",
        "vin": "3N1CN8DV7LL"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/09/2020",
        "dateOfIncident": "12/05/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378682,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2020 NISSAN VERSA AND I PURCHASED IT IN JULY. AFTER DRIVING IT FOR A MONTH OR SO I BEGAN TO HEAR A SQUEAKING NOISE. I TOOK IT IN THEY SAID IT WAS BRAKE DUST. I KEPT HEARING THE NOISE AND I TOOK IT BACK IN AND THEY SAID IT WAS THE BRAKES. I WENT BACK TO HAVE THEM REPAIRED ONLY TO FIND OUT THAT THEY SAID SOME HARDWARE WAS MISSING FROM MY BRAKES.I HAVE BEEN OUT HERE DRIVING IN THIS CAR WITH FAULTY BRAKES THAT LEFT THE MANUFACTURER AND THAT SHOULD HAVE NEVER BEEN PUT OUT INTO CIRCULATION FOR PURCHASE.  *JS",
        "vin": "3N1CN8EV1LL"
    },
    {
        "components": "STEERING,SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/22/2020",
        "dateOfIncident": "11/21/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375800,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ALREADY HAVING TRANSMISSION PROBLEMS. CAR JERKS AND SLOWS ME DOW AND THE STEERING HAS GOTTEN ALMOST UNMANAGEABLE IN LESS THAN 200 MILES. THE WHEELS ALREADY NEED ALIGNMENT AND I'VE HIT NO CURBS. THIS CAR IS ANOTHER DISASTER FROM NISSAN. THE CVT WAS A TERRIBLE THING THAT HAS HAPPENED TO VEHICLES",
        "vin": "3N1CN8DV6LL"
    },
    {
        "components": "AIR BAGS,FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "11/21/2020",
        "dateOfIncident": "11/13/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11375757,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD AN ACCIDENT WHERE I STRUCK A DEER. THE FLOOR AIRBAG DEPLOYED AND INJURED ME. MY LEG HAS A BAD HEMOTOMA FROM IT.",
        "vin": "3N1CN8FV1LL"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/26/2020",
        "dateOfIncident": "10/26/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366403,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR BRAKES WHILE DRIVING FOWARD",
        "vin": "3N1CN8FV7LL"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/12/2020",
        "dateOfIncident": "10/09/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363848,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL DOESN'T PUMP CORRECTLY AS IT SHOULD. THE FUSE BURNT OUT. THE AUTOMATIC BRAKING RANDOMLY ACTIVATES FOR NO APPARENT REASON WHILE DRIVING. IT ALSO DOESN'T ACTIVATE AT ALL. THE FRONT END OF THE CAR LIFTS UPWARD LIKE A WHEELIE FROM A STOP LIGHT. THERE WAS SMOKING AND BURNING SMELL FROM UNDER THE HOOD.",
        "vin": "3N1CN8BV1LL"
    },
    {
        "components": "SEAT BELTS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/30/2020",
        "dateOfIncident": "07/18/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361965,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 NISSAN VERSA. THE CONTACT STATED THE DRIVER'S SIDE SEAT BELT FAILED TO RELEASE WHEN THE BUTTON WAS DEPRESSED. THERE WAS AN ABNORMAL NOISE DETECTED FROM THE SEAT. THE CONTACT HAD TO MANUALLY RELEASE THE SEAT BELT. ADDITIONALLY, THE HOOD FAILED TO CLOSE AND THERE WAS AN ABNORMAL GAP ON THE PASSENGER'S SIDE. THERE WERE NO WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS TAKEN TO KINGS NISSAN (2758 CONEY ISLAND AVE, BROOKLYN, NY 11235, (718) 934-3300) WHERE THE MECHANIC WAS UNABLE TO DUPLICATE THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS CONTACTED AND REFERRED THE CONTACT TO A DIFFERENT DEALER FOR ASSISTANCE. THE FAILURE MILEAGE WAS  200.",
        "vin": "3N1CN8DV7LL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/29/2020",
        "dateOfIncident": "07/15/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342177,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SCREEN FOR THE RADIO WON'T TURN ON SOMETIMES WHEN THE CAR IS ON. I HAVE TO DRIVE A COUPLE MILES BEFORE IT WORKS LEAVING ME WITHOUT GPS AND RADIO. ITS HAPPENED ABOUT A DOZEN TIMES SINCE OWNERSHIP.",
        "vin": "3N1CN8EV7LL"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/12/2020",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338926,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DAUGHTER WAS DRIVING DOWN I-75 WHEN A SMALL GRAVEL HIT THE BOTTOM PASSENGER SIDE OF HER CAR WINDSHIELD. MADE A SMALL DIVOT THAT QUICKLY SHOT ACROSS HER WINDSHIELD PUTTING HER IN DANGER. SEE PHOTOS.     CAR HAS ROUGHLY 1300 MILES",
        "vin": "3N1CN8DV6LL"
    }
]