[
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/26/2022",
        "dateOfIncident": "01/09/2022",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448947,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I applied the gas pedal & the pedal seemed to stick . The vehicle kept accelerating after I took my foot off that pedal to apply brake . Car would slow when brake applied but immediately accelerated and kept increasing (speed was well over 90 mph & climbing ) when brake was released . This happened 3 times before the “stuck”pedal released.  Another driver (retired mechanic) had driven the car and had similar experience a week prior and mentioned their experience. I didn’t realize how serious the incident could be. I called dealership but first available service appointment (scheduled) is Feb. 23,2022",
        "vin": "WP1BE2AYXLD"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "07/29/2021",
        "dateOfIncident": "08/26/2020",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427025,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The back up cameras and surround view have failed multiple times since August 2020. Back up cameras were made mandatory safety equipment requirements for all new cars manufactured after 2018 due to safety concerns. The federal government mandated the cameras  to prevent “back over” accidents of young children who are not otherwise visible to the driver. There have been multiple attempts to repair the cameras on this vehicle, including replacing all cameras, replacing all wiring harnesses/pigtails, replacing the coax cable for the cameras as well as module/software updates. The vehicle has been at the authorized service center multiple times with it being there 105 out of the past 112 days; the vehicle was \"fixed\" for 4 days before the back up camera failed again. The manufacture has been unable to repair the vehicle to have reliable working cameras. We have spoken with others about the same failure of the back up camera system.",
        "vin": "WP1AB2AY5LD"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/29/2021",
        "dateOfIncident": "04/26/2021",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414419,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY PORSCHE 2020 S HAS BREAKING ISSUES WHEN IN SPORT MODE.  WHEN THE CAR DOWNSHIFTS FROM 3RD TO 2ND GEAR, AND 2ND TO 1ST GEAR, THIS IS A SUDDEN JOLT FORWARD OR \"LURGING\" THAT OCCURS EVERY TIME.  THIS IS A SAFETY RISK IN BUMPER TO BUMPER TRAFFIC AS THE CAR CAN SUDDENLY JUMP FORWARD A FEW FEET MORE THAN INTENDED BY NORMAL BREAKING.  EVEN WHEN DRIVING AND BREAKING EXPLICITLY TO COMPENSATE FOR THIS TRANSMISSION / BREAKING DEFECT, THE LURGING ISSUE CANNOT BE AVOIDED.  THE ONLY WAY TO AVOID THIS ISSUE IS TO (A) BREAK HARD FROM 3RD TO 1ST GEAR (SO FROM A FAIRLY HIGH SPEED DOWN TO 0, WHICH LENDS ADDITIONAL BREAKING SAFETY RISKS IN NON-IDEAL WEATHER CONDITIONS SUCH AS BREAKING DOWNHILL OR ON WET / ICY ROADS), OR (B) TO NOT DRIVE THE CAR IN ONE OF THE TWO DRIVING MODES OFFERED.    THE MANUFACTURER'S SERVICE DEPARTMENT CLAIMS THERE IS NO ISSUE, BUT SOME QUICK GOOGLE SEARCHES SHOW THIS ISSUE IS EXPERIENCED WIDELY AND WELL DOCUMENTED, AND A SOFTWARE FIX HAS BEEN ROLLED OUT OVERSEAS THAT ISN'T AVAILABLE IN NORTH AMERICA",
        "vin": "WP1AB2AY9LD"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/23/2021",
        "dateOfIncident": "02/27/2021",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11404548,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR CAME WITH A FACTORY INSTALLED TOW SYSTEM. I RETURNED IT TO THE DEALER THREE TIMES AND IT DOES NOT WORK PROPERLY. I WAS SHOCKED PLUGGING IN A TESTER TO THE 7 WAY CONNECTOR. THE DEALER SERVICE MANAGER ADVISED ME THAT I WAS NOT SHOCKED AND STATES THAT THE LIGHTS STATING THE 7 WAY CONNECTOR IS NORMAL. THIS IS NOT NORMAL.  WHEN I CONNECT  A DIGITAL BREAK CONTROLLER OR 7 PIN CABLE WITH A TRAILER THE CAR DOESN'T NOT COMMUNICATE WITH THE BREAK CONTROLLER.  THE BREAK CONTROLLER EXPERT STATED THAT SINCE NO DIODE WAS SHOWING WHEN I PLUG THE CAR IN THAT THIS INDICATES THE BRAKES ARE NOT WIRED CORRECTLY. THE DEALERSHIP SAYS SINCE ANOTHER CAR WORKS THE SAME AS MINE THEY DON'T THINK IT IS A ISSUE.  CORPORATE PORSCHE IS UNABLE TO ADVISE ON TECHNICAL SERVICE BULLETINS OR INFORMATION ON A WIRING HARNESS TO ENABLE A WIRED BREAK CONTROLLER.  I TOOK THE CAR OVER TO UHAUL AND DID REMOTE CALLS WITH THE BRAKE CONTROLLER MANUFACTURER. ALL STATE THAT IT IS SOMETHING WITH THE MANNER IT IS WIRED WITH A 'OPEN GROUND'. THIS IS UNSAFE AS I HAVE NO WAY SAFELY BRAKE OR UTILIZE A BRAKE CONTROLLER. SINCE OTHER 2020S BEHAVE THE SAME WAY THIS IS A SYSTEMWIDE ISSUE AND THE MANUFACTURER IS NOT TAKING ACTION SO IT SHOULD BE EVALUATED BY ENGINEERING.",
        "vin": "WP1AA2AY3LD"
    }
]