[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/29/2022",
        "dateOfIncident": "07/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458852,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Ram 1500. The contact stated while driving approximately 20 MPH, the tailgate unlatched independently. The contact stated no warning light was illuminated. The contact stated that he had experienced the failure for a second time, while towing his camper. The contact took the vehicle to an independent mechanic and was referred to the local dealer. The contact took the vehicle to local dealer and was referred to an auto body shop for assistance. The contact took the vehicle to the auto body shop and was informed that the tailgate needed to be repaired. The vehicle was not repaired. The manufacturer had been informed of the failure. The failure mileage was approximately 15,000.",
        "vin": "1C6SRFBT6LN"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/28/2022",
        "dateOfIncident": "03/26/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458714,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving 60 mph down the highway in North Dallas, no vehicles around me in close proximity, went under an overpass, the truck braked severely, no skid but a very abrupt slowing  to 10-15 mph, if anyone was behind us, it would have caused a major wreck. Pulled over and turned off the front collision warning system until I could get it reported. The message it flashed on the dash was unknown object encountered. I have not taken it back to the dealer. No police were called because there was no accident, just very scary.",
        "vin": "1C6RREHMXLN"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "03/22/2022",
        "dateOfIncident": "02/26/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11457858,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Ram 1500 Limited. The contact stated that while driving at 20 MPH, the automatic emergency braking system activated without warning. The wheels seized and the vehicle crashed into a guard rail. No air bags were deployed upon impact. The contact later received medical treatment for injuries sustained to both hands and the right leg. There were four other passengers in the vehicle with unknown injuries. No police report was filed. The vehicle was towed to the dealer, where the manufacturer sent an investigator to inspect the vehicle. The investigator found no fault with the computer system. The vehicle was not repaired and remained at the dealer. The failure mileage was approximately 30,000.",
        "vin": "1c6srfht1ln"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/12/2022",
        "dateOfIncident": "03/08/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456402,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "When vehicle drives in reverse, the rear brakes/ calibers having a loading moaning noise. The maoning noise is louder when the brakes aren't compressed and get a little quieter when they are compressed. It happens when it's cold out and the vehicle has been sitting for awhile. I'm afraid over time I will start causing issues for the rear brakes and make them malfunction.",
        "vin": "1C6SRFJM4LN"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/08/2022",
        "dateOfIncident": "11/29/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455654,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "At a gas pump, the vehicle would not fill up.  Constantly kicking the pump off.  Took to the dealership, replaced the tank december 2021.  Ram has several technical service bulletins on various years of the 1500 having fueling issues.  This started around 27000 miles.  March 7, 2022 started having the same issue. Contacted fca about issue. They said see dealer and they would pass the information along to their people.  Again, truck will be going back for this issue.",
        "vin": "1C6SRFFT8LN"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/23/2022",
        "dateOfIncident": "02/16/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453635,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I have taken my vehicle to Ram dealer letting them know the Forward Collison Warning (i.e. 'BRAKE' to show in display and brake if I don't) is not working.  Both time they said it was working and basically showed me the front sensors setting.  I have tried to test this on the road and almost rear ended three cars: 1) speeding up when car in front is at a traffic light, 2) accelerating to 65 mph coming up on a slower car, 3) coming around a curve on a two lane highway with car coming in opposite direction.  No warnings at all.  My Honda Pilot shows the warnings in each of these cases.  So I went back to the dearler and explained that on the Ram forum, https://www.ramforum.com/threads/anyone-else-with-a-fcw-forward-collision-warning-problem.142051/page-3#post-2623613, other drivers have noticed same thing.  My RAM is a 2020.  I saw where someone with a 2019 has same problem.  Also showed the dealer the youtube video, https://www.youtube.com/watch?v=7SE3irp18ts, so they knew what I was talking about.  They told me they don't have any way to test FC.  I told them I didn't understand how the FCS is not working when the ACC is working perfectly.  This was noted as well in the Ram forum.  This needs to be fix immediately if it was discovered on 2019 vehicles: 1) before someone is badly injured because the FCS doesn't work, and 2) I paid for this safety feature and should have it.",
        "vin": "1C6SRFHT9LN"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/18/2022",
        "dateOfIncident": "02/12/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11452810,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Truck was going at 40 MPH and power steering went out, brakes went out and truck started to accelerate resulting in a serious crash. Vehicle was totaled out but not inspected by Dodge. There was no warning of any problems with truck.",
        "vin": "1c6rrffg1ln"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/15/2022",
        "dateOfIncident": "02/14/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452006,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "My truck randomly stalls.  Sometimes from a stopping position, sometimes at slow speeds.  I have taken it to the dealership and they keep saying they can not replicate the problem and they know nothing about this issue despite the fact if you google it, you will see forums full of people having the same issues and the dealerships giving them the same runaround.  Today, I almost got broadsided because it completely died when I was pulling out.  The other truck had to lock up their brakes and swerve to avoid hitting me in the drivers side which would have caused a major injury to myself.  This truck is not safe to drive, yet the dealership keeps telling me their is nothing they can do and I am forced to continue to drive it.  I know several people have reported this to your agency also, yet their still is no recall.",
        "vin": "1C6SRFJT9LN"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/14/2022",
        "dateOfIncident": "02/14/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451981,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "At a speed of 45mph, my truck completely shut down.  No power on anything.  I was able to pull off the road and come to a stop; power brakes and steering were not operable.  Once stopped, the truck would not start.  \"Push to Start\" indicator on dash did come on, but the brake pedal was stiff and the push to start button did nothing.  Got out of the truck, exterior door lock button was inoperable and both key fobs did nothing.  Had to have the vehicle towed.",
        "vin": "1C6SRFJT2LN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/13/2022",
        "dateOfIncident": "02/11/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451731,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Pushed accelerator after a stop sign, heard a pop and immediately lost power and the check engine light came on. Coasted to a parking lot nearby and parked. Discovered the transmission cooling line disconnected spontaneously causing a catastrophic failure. Transmission fluid exploded all over the engine manifold and underneath the vehicle. Smoking ensues. Extremely dangerous to me as I had to power to the vehicle. If traveling on an interstate going highway speeds likely would have been put a great risk personally and to other drivers. Problem confirmed at the dealership after towing. Thought the connection was not made secure at the factory. Only indication after failure of component.",
        "vin": "1c6srfltxln"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/05/2022",
        "dateOfIncident": "02/04/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450546,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "This incident happened to me yesterday afternoon around 3pm in Syracuse. The rear heated/slider window exploded when driving causing glass to shatter outward from the cabin.  I pressed the breaks when I heard the explosion and was fortunate no one was in front because there was ice on the road.  Shattered glass was propelled outward but no vehicles were behind me, i was doing 50 on a 55, weather conditions were not great: 20 degrees and snowing pretty bad.  I called the a dealership in Syracuse and they said they don't provide warranty to glass and to call the insurance.  The insurance referred me to a shop in Syracuse (Safelite).  The shop took me in and covered the area with a plastic wrap and told me that the glass won't get in unit l 5 days due to glass shortage.  They also said they had a Chevrolet Silverado and a Ford F150 with the same issue during this week. They mentioned that all of them had one thing in common; rear defrost/heated, motorized slider window.  The shop suggest to only use the defrost for a short period of time.  That if the rear defrost stays on a prolong time it could heat the glass to extreme temperatures causing this scenario.  I was never briefed on this procedure nor does my user manual i dictate such thing. Upon checking online I noticed that this has happened a lot, not only the rear window but the sunroof as well (no defrost option).  I worry about glass particles falling into body parts of the passengers or potential debris hitting other cars behind you .  I have an appointment for Wednesday to get the rear window replaced in a Safelite shop in zip code area 20678 and have to pay a deductible of $250.00 for something that I was not negligence.  I think these are manufacturing defects, nothing hit the glass and scared the heck out of me.  I'm lucky I didn't collide with anyone when I slammed the breaks.",
        "vin": "1C6SRFFM7LN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/30/2022",
        "dateOfIncident": "01/30/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449453,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I was trying to back out of my driveway and when I shifted to R my backup camera was black. I tried several times and no luck to get it to work. Googled it and it seems to be a common problem for RAM.",
        "vin": "1C6SRFFT9LN"
    },
    {
        "components": "LANE DEPARTURE,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "01/28/2022",
        "dateOfIncident": "01/28/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449244,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Backup  camera is not working suddenly and proximity sensors neither",
        "vin": "1c6srfft9ln"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/25/2022",
        "dateOfIncident": "01/25/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448900,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Rear window crack-leaks water into the floor and damages the auto receiver.  The vehicle will not start and keys are not operational. Insurance company will not cover and warranties will not cover damages. Insurance company believes is a design safety issue and needs to be looked into since there are ample of complaints on the internet.",
        "vin": "1C6SRFFT3LN"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/10/2022",
        "dateOfIncident": "12/06/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446855,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Driver side sun visor unexpectedly failed causing a visibility safety concern.  The plastic holder for the sun visor broke at the base thus failed to hold the visor in place. The driver sun visor only see normal usage, pulling out and in and sliding back and forth. There were no excessive force and/or coercion. This is simply a bad design.  This is a brand new truck with 13000 miles on the odometer. If this would happened during high way driving, it would have a catastrophic effect.",
        "vin": "1C6RREFG2LN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/29/2021",
        "dateOfIncident": "12/28/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445383,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Eleven times now, the tailgate fails to fully lock when closed. It jams half way between being locked and not being locked. Only remedy I have found is to remove the tailgate partially and reinstall. This model has the Ram boxes.  It appears there needs to be a bushing on the right side to keep the tailgate from shifting out of position.",
        "vin": "1c6srfft8ln"
    },
    {
        "components": "UNKNOWN OR OTHER,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "12/27/2021",
        "dateOfIncident": "12/27/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445094,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Backup camera stopped working, just a black screen shows up.  Also, the side mirrors both hit and rub the driver and passenger windows when folded.",
        "vin": "1c6srfet7ln"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/22/2021",
        "dateOfIncident": "12/22/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444662,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "While I was driving warning lights came up on the dash. Traction control, parking brake warning, red voltage. When I exited the freeway, and used the brakes to slow down , the truck was accelerating at the same time . I let go of all the pedals, and the acceleration continued with no feet on pedals . When I got to work, I put it in park . Took it out of park, and the truck started accelerating again on its own at a fast rate. Put it in park, put it in reverse, and the truck started accelerating fast again, in reverse, until I slammed on the brakes to stop the acceleration and put it into park . This is the second time. First time was few months ago, same issue. Dealer looked at it, couldn’t duplicate it, cleared the codes and said if it happens again they’ll have to call an engineer from Chrysler. Contacted dealer today , said nothing about an engineer and that they can’t look at it until next week.",
        "vin": "1C6SRFFT4LN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/30/2021",
        "dateOfIncident": "11/29/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11442081,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Ram 1500. The contact stated that while driving approximately 35 -40 mph, the wheels were moving back and forth, and the steering wheel was shaking. The parking brake not available message was displayed. The traction control warning indicator light was flashing and the brake warning light was illuminated.  The contact sustained injuries to his left wrist and medical attention was provided. The local dealer was not contacted. The vehicle was not diagnosed or repaired. The contact was concerned about driving the vehicle. The manufacturer was not contacted. The failure mileage was 38,600.",
        "vin": "1C6SRFJT4LN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/27/2021",
        "dateOfIncident": "09/17/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441794,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I am experiencing electrical issues when driving the vehicle. On six different occasions, the truck has shut off entirely (no electrical/mechanical control) and have been stranded on the side of the road. Each time it seems the vehicle has to wait for something to clear or reset and then sporadically everything comes back on. I have taken the truck to the dealership and they have replaced a \"broken hood latch\" and the truck is currently at the dealership waiting on a technician to look at it. There are no specific conditions that I can say that is causing this issue to occur. It's happened while driving my son to school, where the truck shut off while at a stop sign. It also happened while driving down the highway doing about 75mph. Each time the vehicle is in some type of motion (5-75 mph) and just goes \"dead\" and then comes back on after waiting about an hour. Most recently, the vehicle has went dead and come back to life three times over the course of 4hrs (while waiting for a tow truck).",
        "vin": "1C6SRFKT4LN"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "11/19/2021",
        "dateOfIncident": "11/19/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440987,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 DODGE RAM 1500. CONSUMER WRITES IN REGARDS TO ISSUE WITH TAILGATE FUNCTION.   THE CONSUMER STATED THE MANUFACTURER SHOULD ADJUST THE PROGRAMMING TO ALLOW TAILGATE AJAR INDICATING LAMPS TO ADJUST.",
        "vin": "1C6SRFJT2LN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/04/2021",
        "dateOfIncident": "11/04/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439370,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Ram 1500. The contact stated while moving from a complete stop, the vehicle stalled. The contact stated no warning light was illuminated. The vehicle was taken to a local dealer where it was diagnosed with needing the battery replaced. The battery was replaced however, the failure recurred. The manufacturer was informed of the failure but offered no assistance. The failure mileage was approximately 57,000.",
        "vin": "1C6SRFFT6LN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/02/2021",
        "dateOfIncident": "10/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439117,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Ram 1500. The contact stated while coming out of a stop when the vehicle stalled randomly. The contact stated that the check engine and service automatic throttle control module warning lights were illuminated. The vehicle was taken to a local dealer where it was diagnosed with needing the fuel injectors replaced. The vehicle was repaired however, the failure persisted. The manufacturer was informed of the failure. The contact was awaiting a response. The failure mileage was approximately 27,000.",
        "vin": "1C6SRFFM9LN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/31/2021",
        "dateOfIncident": "10/26/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438799,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Potential \"Black Mold\" health exposure due to faulty construction/design/product allowing water to leak into the cab soaking and staining headliner, seats and rugs. The water is absorbed into the insulation and fabrics. Research has confirmed this issue has been reported for more than 15 years. 2020 Ram 1500 Bighorn Quadcab.",
        "vin": "1C6SRFBT9LN"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/21/2021",
        "dateOfIncident": "08/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437605,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "My 2020 Ram 1500 truck's dash lights, instrument panel, and radio screen randomly flash bright then dark, over and over.  It is very distracting and a potential safety hazard especially when driving at night as the flashing changes quickly by going from bright to dark and back and forth.  This lighting or electrical issue is very distracting while driving.  This occurs randomly while driving, while stopped, and while driving at different speeds.  This issue typically occurs on a daily basis, and happens more often on some days than others.  I took the truck into the dealer and they had my truck for a week, but could not determine or fix the problem.  There are no vehicle error codes showing in the computer, and I have shown them several video recordings of the flashing lighting that has occurred.  For as much as this vehicle costs, this should not happen, and when it does they should be able to fix it.",
        "vin": "1C6SRFFT6LN"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/18/2021",
        "dateOfIncident": "10/17/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437114,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Operating the vehicle at 35mph on a standard city street in Tucson, Az - River Rd. The vehicle flashes a system failure warning and then shuts off all power to the truck. This results in the transmission being thrown back into park and the driver having zero control over the vehicle. There are multiple online reports of this being fairly common on 2020/2021 Dodge Rams.   The vehicle is being returned to the dealer, even if it is a minor issue it is a huge safety issue.  I had zero control over the vehicle once the warning flashed. The abrupt loss of power and being thrown into a skid with no control is terrifying. Luckily there was no traffic.  It is being returned and according to the dealership it will be investigated.  Prior to that brief safety warning the truck had operated perfectly fine with no issues all day long with over 200miles logged for the day.",
        "vin": "1C6RREFT9LN"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/04/2021",
        "dateOfIncident": "09/14/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435403,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "On September 14, 2021 I was leaving work, started truck and backed out of parking spot. I had drove off and upon making a left turn the truck went into a stall, screen flashed \"place vehicle in park before starting\" and then immediately came back on, I did not come to full stop or have to hit the \"start\" button. I continued driving and the issue has not happened since. The vehicle had over 1/2 tank of gas (89), temperature was in the 90's (Florida) and has no engine modifications. This was concerning for a new vehicle so I looked further into this and discovered that has been happening quite a bit with this particular version of this truck (eTorque). If the vehicle had fully stalled while pulling into traffic, it could be very dangerous. The most troubling aspect is that no engine code or warning light came on regarding the issue. I'm not sure how a late model vehicle with this amount of technology can almost stall and leave no details of what caused the problem and alert the driver.",
        "vin": "1C6SRFFT6LN"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "09/21/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433790,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Ram 1500. The contact stated that while driving at various speeds, the tailgate would intermittently open without warning. The contact called the manufacturer and was informed that there were no recalls on vehicle. The vehicle had yet to be repaired. The failure mileage was approximately 7,000.",
        "vin": "1c6srfft8ln"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/13/2021",
        "dateOfIncident": "08/02/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432747,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Bought new Ram 1500 BigHorn in March 2020. In August 2021, I noticed on long left curves, my steering would stick at the 10-11 o'clock position and remains in that position coming out of the curve when I tug the steering wheel to the right.  Since it was out of warranty for an alignment, I brought it to a Firestone 2 weeks ago for the alignment.  I noticed the issue again and brought it back to Firestone where they did another alignment. They suggested its a rack and pinion issue. Today, September 13th, I called the only 2 RAM dealers in town and explained my situation and they said it could be weeks for them to get parts. This is my only vehicle and I am driving it from Arizona to North Carolina to relocate for a new job.  I wanted this documented in case something happens on my 2200 mile trip that is caused by the steering. Thanks.",
        "vin": "1c6rrffg5ln"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/12/2021",
        "dateOfIncident": "01/25/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428900,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "This is a very serious and dangerous defect that Chrysler and its dealerships cant find or fox the issue. I leased a 2020 Ram 1500 Laramie 5.7 On july 23 2020 i was very happy with the truck for few months and all of a sudden inwas driving and the vehicle completely stalled just like somone has unplugged every power source and i was able to safely stop and the truck wont start again then after 15 minutes I started to see lights on rhe dash again and the vehicle was able to start. I then called my dealership scheduled a service appointment and on jan 25 2020  they confirmed there was an issue with radio hub frequency and it was fixed i was happy again drove for few months then started to happen again this time i almost crashed did the same thing scheduled an appointment took it there this time they said we cant see the problem theres no codes stored and we cant see whats the issue called Chrysler customer service they were not able to do anything for me had to take the truck and drive it and now it happened again and i was googling the issue seems like it's happening to a lot of customers this is very very dangerous and needs to be looked at thank you",
        "vin": "1c6srfjt7Ln"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/11/2021",
        "dateOfIncident": "08/10/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428690,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Rear windshield surround cracked. Water is entering vehicle. Concerned about excessive moisture in and around airbags.",
        "vin": "1C6SRFFT9LN"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/11/2021",
        "dateOfIncident": "08/10/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428708,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Ram 1500. The contact stated that as he hitched a travel trailer to the rear of the vehicle, the rear springs collapsed, and the vehicle was no longer level due to the lack of support from the lift springs. The vehicle was not diagnosed nor repaired by an independent mechanic or dealer. The contact stated he received a recall notification from the manufacturer informing him that the vehicle was not assembled with the proper lift springs and the dealer would replace all four coil springs with the 1-inch lift spring for the suspension of the vehicle. The vehicle was taken to the dealer for the recall repair and the dealer replaced the lift springs with the same standard coil spring instead of the 1-inch lift spring as instructed by the manufacturer. The dealer was made aware of the issue and informed the contact that they could not assist because they were not allowed to change the sales codes on the vehicle. The manufacturer was made aware of the failure and a case was opened. The contact was still awaiting a call back from the manufacturer. The vehicle was not repaired. The approximate failure mileage was 10,500.",
        "vin": "1C6SRFFT0LN"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "07/26/2021",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426456,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Ram 1500. The contact stated that while reversing the vehicle, the back over prevention camera ceased and the brakes locked up without warning. The vehicle was taken to the local dealer however, the mechanic was unable to duplicate the failure. The contact was informed to deactivate the safety device. The vehicle was not diagnosed nor repaired. The manufacturer was notified of the failure. The approximate failure mileage was 8,200.",
        "vin": "1C6SRFHT9LN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/15/2021",
        "dateOfIncident": "07/14/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424942,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Steering wheel locked up while car was moving.  Was able to replicate.  Seems intermittent though.  Towed to the dealership, wasn't locking then.  Service Representative confirmed they have seen this before and seemed to know exactly what to do.  Scary - life safety issue!",
        "vin": "1C6SRFJT8LN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/11/2021",
        "dateOfIncident": "07/11/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424311,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle engine shuts off unexpectedly while in operation. Can happen in any condition: idling, accelerating, cruising or coasting. If at a slow speed (less than 5mph) vehicle activates emergency breaking then shifts itself into park. Can happen WITH or WITHOUT “Auto Start/Stop” being activated (fuel saver).  When emergency breaking enacted, I’ve almost been rear-ended by trailing car.  This issue has been reported on driver forums.",
        "vin": "1C6SRFHT9LN"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/10/2021",
        "dateOfIncident": "06/07/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424169,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I bought my 2020 Ram on 6/7/2021, driving it home that night the throttle body control sensor and the steering stabilizer sensor failed and came across my dashboard along with a check engine light, the truck started quickly acceleratingon its own, I had zero response from the gas pedal I could only use the brake. The next day it went back to the dealership to be fixed. They replaced the sensor in the gas pedal. I had to wait a few days to get it fixed. On 6/23 this problem happened again, the truck started rapidly accelerating on its own. The dealership towed it from my house to an authorized Ram dealer. I had to wait 2 weeks to get it back. I got it on 7/7. The dealership said that they did computer work to the truck but found no other issues, the sensor in the gas pedal was fine. Driving home from work last night 7/9 the dashboard lit up again and the truck started accelerating on its own for the 3rd time. I am now afraid to drive it.",
        "vin": "1C6SRFET0LN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/10/2021",
        "dateOfIncident": "07/03/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424201,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Sunroof exploded into pieces while driving.  With a shotgun sounds. No outside impact  on the pieces of the sunroof.",
        "vin": "1C6SRFLT5LN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/08/2021",
        "dateOfIncident": "07/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423958,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The tailgate gets stuck closed leaving me unable to open it until I take it to the dealership and they pry it open with a tool from the shop. The tailgate also randomly pops open while driving and carrying items in the bed of the truck. Luckily nothing has fallen out since I also strap it in.",
        "vin": "1c6srfht7ln"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/15/2021",
        "dateOfIncident": "06/03/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420991,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE ON THEN OFF, LIGHTS ALL DASH WARNING LIGHTS ON",
        "vin": "1C6SRFHM1LN"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/10/2021",
        "dateOfIncident": "06/10/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420413,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Worping of the drivers mirror. A bit waving. No recall found.",
        "vin": "3C6JR6DG8LG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/14/2021",
        "dateOfIncident": "05/12/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416529,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN NOTICING MY TRANSMISSION HAS BEEN SLIPPING FROM TIME TO TIME STARTING AROUND 35 TO 40 MPH. IT ONLY HAS 22000 MILES ON IT, AS WELL AS  BOGGING DOWN THE ENGINE WHEN I LET OFF THE GAS WHEN IT DOSE HAPPEN.",
        "vin": "1C6RR7TT2LS"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/27/2021",
        "dateOfIncident": "04/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414161,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 RAM 1500. THE CONTACT STATED THAT WHILE DRIVING AND TURNING THE VEHICLE IN EITHER DIRECTION, THE SPINDLE WOULD HIT THE LOWER CONTROL ARMS ON THE DRIVER'S AND PASSENGER'S SIDE. THE CONTACT STATED THAT BOTH CONTROL ARMS WERE DAMAGED FROM REPEATEDLY COMING INTO CONTACT WITH EACH OTHER. ADDITIONALLY, THE VEHICLE WOULD JERK WITHOUT WARNING WHILE DOWNSHIFTING. THE CONTACT HAD TAKEN THE VEHICLE TO GILL CHRYSLER DODGE JEEP RAM (1100 S. MADERA AVE, MADERA, CA 93637) HOWEVER, THE MECHANIC FOUND NO FAULT WITH THE VEHICLE. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE AND INFORMED THE CONTACT THE ISSUE WAS NORMAL DRIVING OPERATION. THE CONTACT THEN TOOK THE VEHICLE TO RAZZARI CHRYSLER DODGE JEEP RAM (1605 AUTO CENTER DR, MERCED, CA 95340) WHERE HE WAS GIVEN THE SAME INFORMATION AS THE OTHER DEALER ABOUT THE CONTROL ARMS. THE CONTACT STATED THAT A SOFTWARE UPDATE WAS PERFORMED ON THE VEHICLE FOR THE TRANSMISSION HOWEVER, THE FAILURE PERSISTED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 36,000.",
        "vin": "1C6SRFLTXLN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/26/2021",
        "dateOfIncident": "04/25/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414044,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE STALLS AND THE EMERGENCY BREAK ENGAGES WHILE AT A STOP. THE TRUCK (A 2020 RAM 1500 LIMITED, 5.7 HEMI E-TORQUE) HAS ABOUT 700 MILES ON IT AND THIS HAS HAPPENED ABOUT 8 TIMES. THE FIRST 3, 4 TIMES THE DASH MESSAGE SAID SOMETHING ABOUT THE HOOD BEING OPENED (IT WASN'T). THE LAST COUPLE OF TIMES THE DASH MESSAGE SAYS SOMETHING LIKE ...SERVICE NOT AVAILABLE. I HAVEN'T BEEN ABLE TO TAKE A PHOTO BECAUSE THE MESSAGES DISAPPEAR RATHER QUICKLY AND I HAVE TO WORRY ABOUT RE-STARTING THE VEHICLE ASAP BECAUSE I'M STUCK IN TRAFFIC WITH CARS BEHIND ME. THE TRUCK RE-STARTS AS NORMAL AND I'M ON MY WAY. THERE SEEMS TO BE NO RHYME OR REASON WHEN THIS HAPPENS, I COULD GO SEVERAL DAYS AND NOTHING HAPPENS, ALL SEEMS NORMAL, YOU JUST DON'T KNOW WHEN THIS BRAND NEW VEHICLE WILL STALL ON YOU. YESTERDAY IT ACTUALLY HAPPENED TO ME ON THE FREEWAY WHEN COMING TO A STOP. ON THE FREEWAY!, HUGE SAFETY ISSUE. THANK YOU.",
        "vin": "1C6RREHTXLN"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/24/2021",
        "dateOfIncident": "03/24/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413655,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR WINDOW OR 3RD BRAKE LIGHT STARTED ALLOWING WATER INTO MY TRUCK. MY TRUCK HAS BEEN AT GLADSTONE DODGE FOR ALMOST A MONTH NOW AND I STILL DON'T HAVE MY TRUCK BACK.",
        "vin": "1C6SRFJT5LN"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/17/2021",
        "dateOfIncident": "04/14/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408515,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE THIRD BRAKE LIGHT IN THE TRUCK IS LEAKING AND CAUSING WATER TO COME INSIDE THE CAB AND STAIN THE HEADLINER. WATER INSIDE THE CAB COULD CAUSE MOLD TO GROW AND CAUSE SERIOUS HEALTH CONCERNS. IT COULD ALSO CAUSE ELECTRICAL ISSUES. THIS HAS BEEN A GRADUAL ISSUE OVER TIME AND HAS BEEN CONFIRMED LEAKING BY THE DEALERSHIP. THIS NEEDS TO BE A RECALL AS THE WATER LINE IS EVEN AROUND THE REAR AIRBAG AND COULD CAUSE A MALFUNCTION LEADING TO INJURY OR DEATH AS A RESULT OF A CRASH.",
        "vin": "1C6SRFDT5LN"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "04/16/2021",
        "dateOfIncident": "04/15/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408422,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 RAM 1500. THE CONTACT STATED THAT WHILE ATTEMPTING TO ACTIVATE THE COLLISION AVOIDANCE SYSTEM, THE SYSTEM FAILED TO OPERATE AS DESIGNED. THE CONTACT STATED THAT THERE WAS NO WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER CHAMPION CHRYSLER DODGE JEEP RAM, INC. (907 S CLINTON ST, ATHENS, AL 35611, (256) 262-3133) HOWEVER, WAS NOT DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 16,185.",
        "vin": "1C6SRFHTXLN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/23/2021",
        "dateOfIncident": "03/23/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404569,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS PULLING OUT OF THE GAS STATION & THE DASH STARTED TO BLINK. AS SOON AS IT BLINKED THE STEERING BECAME ALMOST IMPOSSIBLE TO STEER. I AM NOT WEAK BY ANY MEANS & I COULD BARELY TURN. IT ALMOST CAUSED ME TO CRASH IF I WASN'T GOING UNDER 10MPH. THIS IS GOING TO KILL SOMEONE DOING HIGHWAY SPEEDS. I WAS PULLING OUT OF THE LOVE'S GAS STATION IN MEAD KANSAS AROUND 6:40PM ON MARCH 23RD 2021.",
        "vin": "1C6SRFDT4LN"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "03/13/2021",
        "dateOfIncident": "07/16/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402784,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED 2020 RAM LIMITED ON JULY 14, 2020.  MSRP WAS $70,355.  ON JULY 16 WAS TRAVELING ON I-15 WHEN ALL TRAFFIC WAS STOPPED IN FRONT OF ME. I WAS TRAVELING OVER 70 MPH.  I APPLIED BRAKES AND NOTHING, DIDN'T EVEN SLOW ME DOWN.  TO AVOID COLLIDING WITH ANY OF THE STOPPED CARS I LEFT THE ROADWAY AND DROVE ONTO THE SHOULDER AND INTO THE BAR DITCH.  TOOK ME APPROX HALF MILE TO GET STOPPED.  STOPPED BY GOING UP AN EXIT.  WHEN I FINALLY STOPPED, I WAS TERRIFIED.  I CHECKED BRAKE PEDAL FOR OBSTRUCTION AND IT WAS CLEAR.  BEING AN AVERAGE COMMON CITIZEN, NO MATTER NEW OR USED VEHICLE, WE EXPECT THE VEHICLE TO STOP WHEN WE PUSH ON THE BRAKE PEDAL.  WHEN IT DOES NOT IT IS TERRIFYING.  VEHICLE HAD APPROX 500 MILES AT THE TIME.  OVER $1700 DAMAGE TO MY NEW TRUCK. FORWARD TO DECEMBER 29, 2020:  WENT TO MY LOCAL POST OFFICE, PULLED INTO PARKING SPACE, AGAIN, NO BRAKES. HOWEVER WAS GOING VERY SLOW (5 MPH OR LESS.  CRASHED STRAIGHT INTO BRICK BUILDING.  ABSOLUTELY NO RESPONSE FROM BRAKES NOR DID THE \"AUTO STOP\" ENGAGE.  OVER $5000 DAMAGE TO TRUCK AND $???? DAMAGE TO BUILDING.  FORWARD TO JAN 1, 2021:  PULLED INTO PARKING LOT, TRIED STOPPING, AGAIN NO BRAKES. AS IT WAS A HOLIDAY AND THE EVENING, NOT MANY CARS IN PARKING LOT.  WAS ABLE TO STOP WITH AID OF PARKING BRAKE.    HAS BEEN TO LOCAL DEALER, I TOLD THEM TO KEEP IT AS LONG AS NEEDED AND DRIVE AS MUCH AS NEEDED.  THEY KEPT IT FOR ONE WEEK, SAID NO CODES ON COMPUTER, DROVE 8 MILES SAID NOTHING WRONG.  HAVE NOT DRIVEN FOR 2 MONTHS (SCARES ME).  AWAITING ANOTHER DEALER (NEXT CLOSEST 250 MILES AWAY) TO PICK IT UP TO CHECK IT OUT SOME MORE. VEHICLE NOW HAS LESS THAN 4000 MILES. ABSOLUTELY NO SUPPORT OR HELP FROM RAM.  BEEN FIGHTING WITH THEM FOR 2 MONTHS.  HAVE GOTTEN NOWHERE!  I'M NOT A ROOKIE, HAVE BOUGHT AND OWNED BETWEEN 75-100 CARS IN MY LIFE.  NEVER A PROBLEM WITH A DEALER OR A MANUFACTURER, UNTIL NOW!!!  SEE ALSO 11397598",
        "vin": "1C6SRFHT1LN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/10/2021",
        "dateOfIncident": "10/05/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400179,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING WARM WEATHER AFTER COMING TO A STOP, THEN ATTEMPTING TO ACCELERATE, THE GAS PEDAL IS COMPLETELY DEAD.  NO AMOUNT OF PRESSURE OR PUMPING OF THE PEDAL HAS ANY AFFECT.  THE VEHICLE MOVES FORWARD AT IDLE BUT NO OTHER ACCELERATION. AFTER 5-10 SECONDS, THE ACCELERATING COMES ON 100%. THIS IS EXTREMELY DANGEROUS AS THE IDLE ALLOWS THE VEHICLE TO MOVE FORWARD INTO TRAFFIC BUT STANDS YOU WITH ONCOMING TRAFFIC BEARING DOWN WITH NO IDEA THAT YOU CANNOT MOVE!",
        "vin": "1C6SRFHM0LN"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "03/03/2021",
        "dateOfIncident": "08/06/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399051,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "HOT SMELL IN CABIN WHEN USING 4X4 MODE  NAVIGATION SYSTEM IS NOT ACCURATE, SHOWS ME ON ROADS I'M NOT. SPEED SIGN RECOGNITION EITHER DOES NOT WORK OR IS VERY INACCURATE. TRAFFIC JAM UPDATES NEVER HAPPEN. LANE KEEPING SYSTEM DISPLAYS MESSAGE TO PLACE HANDS ON WHEEL. THEN TURN OFF. MY HANDS ARE ON THE WHEEL, IT STILL DEACTIVATES ITSELF. VEHICLE HAS SORT 8 WEEKS IN DEALERSHIP, THEY CAN FIX IT",
        "vin": "1C6SRFHT5LN"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/02/2021",
        "dateOfIncident": "10/23/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398645,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO IAM CONTACTING YOU GUYS REGARDING MY 2020 RAM 150@ THE ISSUE FIRST STARTED IN OCTOBER OF LAST YEAR I WAS DRIVING DOWN TO THE BRONX AND WHEN I CAME TO A COMPLETE STOP OIL PRESSURE LOW MIL CAME ON AND LOUD NOISE COMING FROM ENGINE I GOT SCARED AND REPLACED OIL WITH A AFTERMARKET IT DID NOT SOLVE THE PROBLEM AND I IMMEDIATELY CALLED ROADSIDE ASSISTANCE AND HAD TRUCK TOWED TO DEALER ONCE THEY TOOK IT IN THEY FOUND THE OIL FILTER AND IMMEDIATELY BLAMED ME FOR IT AND SAID THAT THE ENGINE SEIZED AND I WOULD NEED 15,000 TO REPLACE I FEEL LIKE THIS IS NOT RIGHT I UNDERSTAND I PLACED MY HANDS ON THE TRUCK BUT THIS WAS AFTER THE ISSUE HAPPENED I DON'T BELIEVE A BRAND NEW TRUCK WITH 7,500 MILES SHOULD BE GOING THRU THIS",
        "vin": "1C6SRFFM0LN"
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/24/2021",
        "dateOfIncident": "02/23/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397752,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER LEAK ON SLIDING REAR WINDOW/BACK OF CAB",
        "vin": "1C6SRFLM4LN"
    },
    {
        "components": "SERVICE BRAKES,BACK OVER PREVENTION,FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "02/23/2021",
        "dateOfIncident": "07/17/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397598,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON I-15 BETWEEN CEDAR CITY, UT AND ST GEORGE, UT.  DRIVING APPROX 75MPH WHEN SUDDENLY TRAFFIC WAS STOPPED IN FRONT OF ME IN BOTH LANES.  APPLIED BRAKES WITH ABSOLUTELY NO RESULTS.  DROVE OFF OF PAVED PORTION OF HIGHWAY TO AVOID HITTING STOPPED CARS.  VEHICLE HAD LESS THAN 500 MILES ON IT AND I HAD OWNED IT FOR 3 DAYS.  FINALLY GOT VEHICLE STOPPED APPROX 3/4 MILE DOWN THE ROAD.  APPROX $1700 DAMAGE TO VEHICLE.  APPROX 5 MONTHS LATER I PULLED INTO U.S POST OFFICE TO PARK.  BRAKES AGAIN FAILED AND I HIT BRICK BUILDING AT APPROX 5MPH OR LESS.  APPROX $5000 DAMAGE TO VEHICLE AND UNCERTAIN OF DOLLAR DAMAGE TO P.O. BUILDING.  THREE DAYS LATER I PULLED INTO MA PARKING LOT, BRAKES FAILED AGAIN.  I WAS ABLE TO AVOID ANY PARKED CARS, MAINLY BECAUSE PARKING LOT WAS ALMOST EMPTY.  I WAS ABLE TO USE EMERGENCY BRAKE TO STOP IT.  THE FOLLOWING MONDAY I TOOK IT TO STEPHEN WADE DEALERSHIP.  THEY HAD IT FOR 5 DAYS, CHECKED FOR CODES, DROVE IT APPROX 8 MILES AND TOLD ME TO COME GET IT.  THEY COULD FIND NOTHING.  FACTORY CUSTOMER CARE TOLD ME TO TAKE IT BACK TO DEALERSHIP.  CALLED FOR APPT AND WAS INFORMED THAT DUE TO SAFETY PROBLEM AND ACCIDENT, THEY WOULD NOT TOUCH IT.  CALLED RAM CUSTOMER CARE BACK, TOLD THEM DEALERSHIP REFUSED TO LOOK AT IT.  CUSTOMER CARE SAID TO TAKE TO ANOTHER DEALERSHIP.  NEXT CLOSEST DEALERSHIP IS OVER 120 MILES AWAY.  THEY SAID DEALERSHIP HAS RIGHT TO REFUSE TO WORK ON IT AND THEN TOLD ME THAT RAM FACTORY TECH GAVE ORDERS NOT TO TOUCH IT.  NOW I HAVE A RAM TRUCK WITH BRAKE PROBLEMS THAT NEITHER LOCAL DEALERSHIP OR FACTORY TECH WILL ACCEPT TO WORK ON.  I HAVE A $70,000 MSRP, 5,400 LB \"PAPER WEIGHT\".  NO HELP FROM FACTORY.  TRUCK DOES NOT HAVE 4,000 MILES AND APPARENTLY THE FACTORY WARRANTY IS WORTHLESS.  SEE ALSO 11402784",
        "vin": "1C6SRFHT1LN"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/22/2021",
        "dateOfIncident": "02/20/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397413,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER SITTING OVERNIGHT, WHEN BACKING OUT OF DRIVEWAY, BRAKES HOWL/GROWL WHEN APPLIED.  HAPPENS ONCE EACH DAY.  MANY COMPLAINTS ON-LINE OF SAME THING HAPPENING TO DODGE RAM 1500 5TH GEN. SEE SERVICE BULLETIN 05-001-19.  I HAVE OWNED THIS VEHICLE FOR ONE MONTH. BOUGHT IT WITH 5600 MILES ON IT. THIS HAS BEEN HAPPENING  DAILY SINCE I BOUGHT IT.",
        "vin": "1C6SRFJT3LN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/20/2021",
        "dateOfIncident": "01/02/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397156,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR WINDOW CRACKED.  LEAKING WATER INTO TRUCK",
        "vin": "1C6SRFJT5LN"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/19/2021",
        "dateOfIncident": "02/14/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397027,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL FILLER LINE ISN'T WORKING PROPERLY.  THE PUMP SHUTS OFF CONTINUOUSLY WHEN TRYING TO FILL THE TANK.  IT ONLY FILLS A COUPLE OF SECONDS THEN SHUTS OFF.  IT CAN TAKE 15 - 20 MINUTES TO FILL A TANK OF GAS.",
        "vin": "1C6RREHT5LN"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/18/2021",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396764,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE EMITS A STRONG VIBRATION IN 1800-2000 RPM AT EVERY GEAR AND SPEED WHEN THE ENGINE IS UNDER LOAD. THE VEHICLE DOES NOT VIBRATE AT THIS RPM RANGE IN PARK OR NEUTRAL. VEHICLE EMITS VIBRATION THROUGH DRIVER STEERING WHEEL, GAS PEDAL, FLOOR, AND SEAT. VIBRATION ALSO FELT IN PASSENGER FLOOR. VIBRATION CAUSES BOOMING, SOUNDS IN THE CABIN THAT ARE UNCOMFORTABLE. VIBRATION IS INCREASED WHEN IN 4WD AUTO VS 2WD AND 4WD HIGH. VIBRATION IS AT IT'S LOUDEST AT CRUISING SPEEDS ON HIGHWAY WHEN IN THE AFFECTED RPM RANGE. FCA IS UNWILLING TO ADDRESS THE VIBRATIONS OF THE VEHICLE AND REFUSES TO DIAGNOSE AND REPAIR. VEHICLE IS DESCRIBED AS \"OPERATING AS DESIGNED\" AND THIS IS A \"CHARACTERISTIC OF THE VEHICLE\" FROM FCA CUSTOMER SERVICE REPRESENTATIVES AND TECHNICIANS/ENGINEERS. VIBRATIONS CAUSING HEADACHES AND NAUSEA DUE TO GENERAL DISCOMFORT OF THE CABIN VIBRATION. ISSUE DID NOT EXIST UPON PURCHASE OF VEHICLE, BUT RATHER DEVELOPED AFTER ROUGHLY 2000 MILES.",
        "vin": "1C6RRFFG4LN"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/17/2021",
        "dateOfIncident": "02/15/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396606,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ATTEMPTING TO STOP THE BRAKE FOR UPCOMING TRAFFIC THE BRAKE PEDAL WHEN TO THE FLOOR. TRIED PUMPING THE BRAKES AND THAT DID NO ACTIVATE THE BRAKING SYSTEM. RESULTING IN REAR ENDED A STOPPED VEHICLE AND PUSHING THAT VEHICLE INTO THE ONE IN FRONT. THERE WAS AMPLE ROOM TO STOP IF THE BRAKING SYSTEM HAD NOT FAILED. THE VEHICLE WAS RECIEVED ON GSA CONTRACT, IT ONLY HAD APPROXIMATELY 3200 MILES ON IT AND HAD NEVER BEEN SERVICED.*DT",
        "vin": "1C6RR7FG4LS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/11/2021",
        "dateOfIncident": "01/15/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395823,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR ISSUES WITH OUR 2020 DODGE RAM STARTED ON FRIDAY, JANUARY 15TH. AFTER ARRIVING HOME, I PARKED THE VEHICLE AND ENTERED MY HOME AROUND 6:45 PM(WITNESSED ON VIDEO); AT 7:45 PM I WENT OUTSIDE TO GET SOMETHING I HAD FORGOTTEN IN THE TRUCK AND NOTICED IT AT THE BOTTOM OF OUR DRIVEWAY (ON RING VIDEO). I  WENT INSIDE TO GET MY HUSBAND WHO CAME OUT AND PULLED IT BACK INTO THE DRIVEWAY AND ENGAGED THE PARKING BRAKE.WE LEFT HOME THE NEXT DAY AND NOTICED THAT THE VEHICLE STARTED TO \"CHUG\" AS WE SLOWED DOWN AND TOOK A LEFT TURN. WE CALLED OUR DEALERSHIP AND WERE URGED TO BRING IN THE TRUCK THAT DAY AS THEY STATED THIS WAS A SAFETY ISSUE. UPON ARRIVING HOME TO UNLOAD EVERYTHING BEFORE HEADING IN, WE PUT THE TRUCK IN PARK. MY HUSBAND AND I EXITED THE VEHICLE (OUR CHILDREN WERE IN THE BACK SEAT) WHEN AT 1:27 PM IT STARTED TO ROLL BACK DOWN OUR DRIVEWAY. AFRAID FOR THE SAFETY OF OUR KIDS, MY HUSBAND QUICKLY JUMPED BACK IN AND APPLIED THE BRAKE MANUALLY. EVEN THOUGH THE TRUCK WAS IN PARK, IF HE TOOK HIS FOOT OFF OF THE BRAKE, IT WOULD CONTINUE TO ROLL. ONTUESDAY, JANUARY 19TH, A SERVICE MAN ASKED FOR MY HUSBAND  TO COME IN AND DISCUSS THE CIRCUMSTANCES OF THE VIDEO WE SENT IN (RING VIDEO)) AND DO A TEST DRIVE WITH A TECHNICIAN. DURING THE TEST DRIVE THE TECHNICIAN DROVE THE TRUCK AND EXPERIENCED NO ISSUES, AT THIS POINT HE ASKED MY HUSBAND TO SWITCH SEATS AND DRIVE INSTEAD. ON LEVEL GROUND, THE TRUCK WAS PUT IN PARK, THE TECH ASKED HIM TO ENGAGE THE PARKING BRAKE AND THEN PUT IT INTO GEAR WITHOUT DISENGAGING THE PARKING BRAKE AND THE TRUCK STARTED TO ROLL FORWARD. ADDITIONALLY, HE HAD HIM DO THE SAME PROCESS IN REVERSE AND HAD THE SAME RESULTS WITH THE TRUCK ROLLING BACKWARDS. AT THIS POINT, THE TECHNICIAN SHARED THE SAFETY CONCERNS FOR OUR FAMILY AND WANTED TO RUN MORE TESTS SINCE THEY WERE ABLE TO DUPLICATE THE SAME ISSUE AS THE VIDEO WE HAD SENT IN ON FLAT GROUND.",
        "vin": "1C6SRFDT2LN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/10/2021",
        "dateOfIncident": "08/20/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395584,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "HIGH LEVELS OF COPPER IN THE OIL. VEH. HAS 20,400 MILES ON IT. THREE CONSECUTIVE OIL CHANGES WITH OIL ANALYSIS PERFORMED.  BEARING FAILURE OCCURRING, OIL PRESSURE HAS DROPPED 4 PSI.WHILE DRIVING FREEWAY SPEEDS.  PSI AS LOW AS 28 AT IDLE....",
        "vin": "1C6SRFJT8LN"
    },
    {
        "components": "STRUCTURE,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/27/2021",
        "dateOfIncident": "01/23/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390255,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STOPPED IN LINE AT A FAST FOOD DRIVE THRU LINE THE BRAKES RELEASED ALLOWING TRUCK TO IDLE INTO CAR AHEAD SLIGHTLY DAMAGING BOTH VEHICLES. NO AMOUNT OF PRESSURE ON THE BRAKE PEDAL HAD ANY AFFECT ON STOPPING. DEALER COULD NOT DUPLICATE PROBLEM AND SCAN SHOWS NO CODES EXCEPT THE FRONT PARK SENSORS MOST LIKELY DAMAGED IN THE CONTACT. RAM STATED IF THEY CAN'T DUPLICATE ISSUE THEY ARE OF NO ASSISTANCE",
        "vin": "1C6SRFHT3LN"
    },
    {
        "components": "SERVICE BRAKES,LANE DEPARTURE,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "01/20/2021",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389018,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 RAM 1500. THE CONTACT STATED THAT WHILE OPERATING THE VEHICLE, SEVERAL OF THE SAFETY FEATURES FAILED INTERMITTENTLY TO FUNCTION AS DESIGNED. THE CONTACT INDICATED THAT WHILE OPERATING THE VEHICLE IN REVERSE, THE BACK-UP CAMERA WAS INOPERABLE. ADDITIONALLY, WHILE DRIVING, THE AUTOMATIC EMERGENCY BRAKING SYSTEM ACTIVATED INADVERTENTLY CAUSING THE VEHICLE TO STOP WITHOUT ANOTHER VEHICLE OR OBJECT BEING NEARBY. THE BLIND SPOT MONITORING SYSTEM WOULD FAILED INTERMITTENTLY. THE CONTACT STATED THAT WHILE REVERSING THE VEHICLE WITH THE DOOR OPENED, THE SAFETY FEATURE WOULD NOT STOP THE VEHICLE AND THE AUTO PARKING FEATURE WOULD NOT PROPERLY PARK THE VEHICLE. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER LENOIR CITY CHRYSLER LOCATED AT 1206 E BROADWAY ST, LENOIR CITY, TN 37772 WHO REPLACED THE INFOTAINMENT CENTER AND UPDATED THE SOFTWARE HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 100.*DT  CONSUMER STATED THIS IS THE SECOND TIME IT HAS RECURRED.*JB",
        "vin": "1C6SRFKT3LN"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/13/2021",
        "dateOfIncident": "01/13/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387913,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS TRUCK IS MARKETING AND SOLD WITH A SPEED WARNING FEATURE - AN AUDITORY ANNOUNCEMENT WHEN THE SPEED LIMIT HAS BEEN EXCEEDED.  THIS FEATURE RELIES ON ACCURATE SPEED LIMIT DATA BEING IN THE CAR'S NAVIGATIONAL SYSTEM.  RAM AND THEIR MAPPING SOFTWARE VENDOR, \"HERE\", KNOW THEIR NAVIGATIONAL SYSTEM HAS MAJOR SPEED LIMIT ERRORS AND HAVE NO PLANS TO ADDRESS.      THERE ARE WAYS THEY COULD ADDRESS THIS ISSUE: MAKE A REASONABLE ATTEMPT TO UPDATE ERRORS (AND ALLOW CUSTOMERS TO SUBMIT THE ERRORS), DEACTIVATE THE SOFTWARE (IT CANNOT BE RELIED UPON), AND/OR INFORM CUSTOMERS THAT THIS SYSTEM CANNOT BE RELIED UPON AS A SAFETY DEVICE.",
        "vin": "1C6SRFFT8LN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/12/2021",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387704,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 RAM 1500. THE CONTACT STATED WHILE HE WAS AT A STAND STILL AT TRAFFIC LIGHT, THE VEHICLE STALLED. THE CONTACT STATED THAT THE AUTO START STOP WARNING LIGHT WAS ILLUMINATED. THE CONTACT STATED HE WAS ABLE RESTART THE VEHICLE TO DRIVE TO HIS DESTINATION. THE CONTACT STATED HE HAD EXPERIENCE THE FAILURE ON 3 SEPARATE OCCASIONS. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER MULLAHEY CHRYSLER DODGE JEEP RAM (2520 GOLDEN HILL RD, PASO ROBLES, CA 93446, (805) 369-2400) WHERE IT WAS DIAGNOSED WITH NEEDING THE STEERING COLUMN MODULE TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 30,000.",
        "vin": "1C6SRFHT1LN"
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/07/2021",
        "dateOfIncident": "10/15/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386916,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "PLASTIC REAR WINDOW SURROUND FRAME CRACK.",
        "vin": "1C6SRFHT3LN"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/07/2021",
        "dateOfIncident": "01/05/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387007,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR FRAME AROUND THE REAR CAB WINDOW CRACKED AND IS LEAKING WATER. THIS IS ON A RAM 1500 THAT IS LESS THAN A YEAR OLD WITH ONLY 5,500 MILES ON IT. THERE HAS NOT BEEN ANY UNUSUAL USE OR DAMAGE THAT WOULD HAVE CAUSED THIS TO HAPPEN. MANY OTHER OWNERS ARE HAVING PROBLEMS WITH THIS EXACT SAME CRACK AND WATER LEAK. REPLACEMENT WINDOWS DON'T SEEM TO FIX THE ISSUE AND CRACK AGAIN.",
        "vin": "1C6SRFHT7LN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/06/2021",
        "dateOfIncident": "01/04/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386749,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, OUT OF THE BLUE MY TRUCK WILL PULL OUT OF CENTER AND SOMETIMES STICKS WHEN TRYING TO PULL IT BACK. DOES THIS MOSTLY IN LEFT TURNS OR ON THE HIGHWAY. IS VERY DANGEROUS AND ALMOST CRASHED ON WET ROAD. TOOK TO DEALER AND THEY COULDN'T FIND PROBLEM. TOOK ME ONLY 5 MINUTES TO FIND NUMEROUS COMPLAINTS ON LINE FOR THE SAME SAFETY ISSUE. SOME SAID THAT THE RACK AND PINION WAS REPLACED BY THE DEALER AND THE PROBLEM WAS FIXED. I NEED TO HAVE THIS FIXED BEFORE SOMEONE GETS KILLED.",
        "vin": "1C6SRFLT1LN"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/04/2021",
        "dateOfIncident": "12/30/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386448,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "A CRACK HAS APPEARED ON THE TOP PLASTIC FRAME OF MY REAR WINDOW AND NOTICED MOISTURE STARTING TO SEEP THROUGH. I NOTICED THE MOISTURE AFTER MY TRUCK BEING PARKED IN MY DRIVEWAY DURING SOME RAIN. TRUCK ONLY HAS 13K MILES ON IT.",
        "vin": "1C6SRFJT9LN"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/02/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386084,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE OWNED MY 2020 RAM 1500 CREW CAB 4X4 FOR 8 MONTHS. THE PLASTIC FRAME THAT SURROUNDS THE REAR WINDOW GLASS HAS CRACKED AND CAUSED THE WINDOW TO LEAK. THIS OCCURS BOTH WHEN THE TRUCK IS IN MOTION OR IS PARKED. THIS IS A COMMON PROBLEM THAT NEEDS TO BE INVESTIGATED BECAUSE WATER CAN SEEP INTO THE REAR AIRBAGS CAUSING THE AIRBAGS TO MALFUNCTION. ALSO WITH A CRACK IN THE REAR GLASS FRAME THE GLASS MAY EXPLODE CAUSING HARM TO THE BACK SEAT PASSENGERS.",
        "vin": "1C6SRFJT2LN"
    },
    {
        "components": "ELECTRICAL SYSTEM,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "12/20/2020",
        "dateOfIncident": "07/15/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384288,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TOO BAD I CAN ONLY MARK 3 AREAS WHEN THERE ARE MANY MORE. FOLLOWING SAFETY SYSTEMS AND DRIVER AID EITHER DON'T WORK OR WORK SPORADICALLY: FORWARD COLLISION, REAR COLLISION, LANE KEEP, AUTO HIGH BEAMS, REAR CROSS TRAFFIC ALERT, RAIN SENSE WIPERS, NAVIGATION, VOICE COMMAND, PARKING GEAR,  FRONT AND REAR CAMERA, MEMORY SEAT EASY ENTRY ( DOESN'T GO BACK TO CORRECT POSITION), HOT SMELL IF USE AWD SETTING. INFOTAINMENT SYSTEM TOTALLY MALFUNCTIONS. TRUCK BEEN IN 7-8 TIMES FOR PROBLEMS, THERE OVER 2 WEEKS ON 2 VISITS, RADIO REPLACED. STILL HAVING ALL PROBLEMS. BEEN GOING ON SINCE NEW, OVER A YEAR AGO. HAS HAD NUMEROUS RAM UPGRADES AT DEALER AND OVER AIR. NEVER KNOW IF SAFETY SYSTEMS ARE GOING TO WORK OR NOT. HAVE LOST ALL TRUST IN THIS VEHICLE. WILL BEING BACKING UP AND BRAKES LOCK UP AS IF REAR SENSORS HAVE DETECTED SOMETHING WHEN THERE IS NOTHING. REAR DETECTORS TURN OFF BY THEMSELF. CAMERAS STAY ON. NAV CURSOR SHOWS ON MAP 6 MILES AWAY FROM ACTUAL LOCATION. BASICALLY ALL ELECTRONICS WORK SPORADICALLY. HAPPENS IN MOTION AND WHILE NOT IN MOTION. ALL GLITCHES BLAMED ON ELECTRONICS IN INFOTAINMENT SYSTEM ACCORDING TO RAM. PUT TRUCK IN PARK AND CONTINUES TO ROLL FORWARD. OPENING DOOR IS SUPPOSED TO ENGAGE EMERGENCY BRAKE. DOES SOMETIMES AND OTHER TIMES DOES NOT. WITH THIS MANY ELECTRICAL PROBLEMS I'D HATE TO BE IN AN ACCIDENT, PROBABLY THE AIR BAGS DON'T WORK. PERIODICALLY GO TO START VEHICLE AND IT'S DEAD. NO CHARGERS ARE PLUGGED IN IT ANYTHING THAT SHOULD DRAIN BATTERY. NOW CARRY A JUMPER BOX AFTER I WAITED OVER 2 HOURS FOR RAM ROADSIDE SERVICE.HAVE ASKED FOR REPAIR ORDERS BUT HAVEN'T BEEN GIVEN THEM. HAVE NOTED EVERY GLITCH WITH RAM CUSTOMER SERVICE VIA EMAIL. CASE IS OPEN. NOTHING GETS DONE.",
        "vin": "1C6SRFKT3LN"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/15/2020",
        "dateOfIncident": "12/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383600,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TAILGATE HAS OPENED WITHOUT MY KNOWLEDGE AND WAS FLAGGED DOWN BY SOMEONE LETTING ME KNOW THE TAILGATE WAS OPEN.  I WAS ABOUT TO LOOSE MY TOOL CHEST. VEHICLE COMES WITH TAILGATE AJAR WARNING LIGHT BUT THIS FEATURE DOES NOT WORK ON THE VEHICLE.  ONLINE BOARDS FOR RAM ALSO STATE SIMILAR EXPERIENCES. WANT TO ENSURE THIS SAFETY ISSUE IS KNOWN AND ADDRESSED.  RAM HAS NOT DONE ANYTHING ABOUT IT",
        "vin": "1C6SRFFT0LN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/14/2020",
        "dateOfIncident": "12/13/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383318,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF EXPLODED! DRIVING ON FREEWAY WE HEARD LOUD BLAST AND THAN THE GLASS WAS GONE! NO OTHER CARS AROUND. NO OVERPASS FOR MILES. GLASS BLEW UP AND GONE LIKE VALCANO. WE HAD TO DRIVE 30 MIN IN THE RAIN HOME. DEALER CURRENTLY SAYS NO WARRANTY?",
        "vin": "1C6SRFJT5LN"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/10/2020",
        "dateOfIncident": "12/08/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11382829,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2020 RAM 1500 LARAMIE WITH ONLY 5K MILES ON THE ODOMETER, I STOPPED BEHIND A SCHOOL BUS. THE TRUCK'S START/STOP FEATURE ACTIVATED AS IT NORMALLY DOES AND THE ENGINE SHUT OFF.  I PRESSED THE DASHBOARD BUTTON TO DE-ACTIVATE THE START/STOP FEATURE FOR THE REMAINDER OF THE TRIP.  WHEN I DID THIS, A LOUD ELECTRICAL SPARK SOUND OCCURRED AND THE TRUCK COMPLETELY DIED IN THE ROADWAY. ALL POWER WAS LOST, I COULD NOT EVEN ACTIVATE THE HAZARD LIGHTS.  THERE WAS A STRONG ODOR OF SOMETHING BURNING IN THE CABIN.  NO SMOKE WAS VISIBLE, THOUGH.  I HAD THE TRUCK TOWED TO MY DEALER TO BE DIAGNOSED AND I AM AWAITING THEIR PHONE CALL WITH THAT INFO.",
        "vin": "1C6SRFJTXLN"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "12/08/2020",
        "dateOfIncident": "11/12/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378425,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS PULLING IN BEHIND A PARK VEHICLE IN ORDER TO PARK MYSELF. I WAS IN A HS PARKING LOT WHERE SOME MUCH MORE SERIOUS COULD HAVE HAPPENED. I WAS MOVING APROX 1-3 MPH AND ABOUT TO STOP AND PARK WHEN THE VEHICLE UNEXPECTEDLY ACCELERATED. I WAS 10-12 FEET BEHIND THE PARKED VEHICLE. THE TRUCK ACCELERATED SO HARD IT PINNED ME BACK TO THE SEAT. I  FRANTICLY TRIED TO STOP THE TRUCK AND AT THE SAME TIME THE ANTI COLLISION KICKED IN AS WELL TO SLOW THE TRUCK. UNFORTUNATELY IT WAS NOT QUICK ENOUGH TO PREVENT FROM HITTING HE CAR IN FRONT. THE LOWER PORTION OF MY BUMPER HIT THE MID RARE OF THE OTHER VEHICLE AS THE TRUCK MUST HAVE BEEN RAISED FROM THE FORCE. I CALLED THE DEALERSHIP THAT NIGHT AND FILED A CLAIM WITH FCA. THEY PULLED THE DATA FROM THE TRUCK AND DID AN ANALYSIS. THEY ARE CLAIM THERE WAS NO MECHANICAL MALFUNCTION AND I ACCELERATE AND BRAKED LATE. THE REPORT SHOWS THAT THE TRUCK ACCELERATED TO 100%!. YOU SIMPLY DO NOT ACCELERATE TO 100% BY ACCIDENT WHICH I THOUGHT WOULD HAVE BEEN AN INDICATED THAT SOMETHING EITHER KICKED IN AND MADE THE TRUCK ACCELERATE OR THE PEDAL JAMMED BUT SOMETHING. I AM ADAMANT THAT I DID NOT ACCIDENTLY ACCELERATE TO 100% BY ACCIDENT. I SPENT THE MONEY ON THIS TRUCK TO HAVE THE PIECE OF MIND THAT ME AND MY FAMILY ARE SAFE. I NO LONGER HAVE THAT COMFORT. I HAVE ATTACHED THE DATA REPORT. I CANNOT ATTACHED THE CORRESPONDENCE FROM FCA AS I CANNOT ATTACH A WORD DOCUMENT",
        "vin": "1C6SRFHT4LN"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/07/2020",
        "dateOfIncident": "12/02/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378376,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WELL DRIVING THE VEHICLE THE RAM BOX LID WILL POP OPEN AT ANY TIME EVEN AFTER SECURING THE BOX LID THE LOCKING MECHANISM WILL POP OPEN AND THE LID WILL COME OPEN WHILE DRIVING DOWN THE ROAD.",
        "vin": "1C6SRFFT5LN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/01/2020",
        "dateOfIncident": "10/28/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377398,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2020 RAM UCONNECT 8.4 SCREEN TURNS OFF RANDOMLY AND REBOOTS AND WILL DO IT MULTIPLE TIMES WITHIN A 10-20 MINUTE TIME SPAN. SOMETIMES 3-4 TIMES BACK TO BACK RAPIDLY. I TOOK IT IN AND THE DEALER SAID THERE WAS AN UPDATE AVAILABLE (EVEN WHEN UCONNECT SAID THERE WASN'T) AND THEY FLASHED IT.  WHICH RESET ALL OF MY SETTINGS. IT DID IT AGAIN THE SAME DAY. WHICH TELLS ME IT HAS NOTHING TO DO WITH AN UPDATE ISSUE. PLEASE FIX. NAVIGATION, MEDIA, PHONE CALLS ARE ALL LINKED INTO THIS ONE SYSTEM WHICH CAN BE DANGEROUS WHEN YOU HAVE TO DIVERT YOUR ATTENTION ELSEWHERE TO DEAL WITH THIS PROBLEM. IT WILL HAPPEN WHEN DRIVING, SITTING STILL, PARKED, DURING REMOTE STARTS, ANYTIME.",
        "vin": "1C6RREDTXLN"
    },
    {
        "components": "VISIBILITY,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/16/2020",
        "dateOfIncident": "11/14/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374815,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 RAM 1500. THE CONTACT STATED THAT WHILE DRIVING WITH THE DRIVER'S AND THE PASSENGER'S SIDE REAR WINDOWS ROLLED DOWN, THE VEHICLE SHOOK VIOLENTLY AS IF THE TIRES WERE OFF THE GROUND. THE CONTACT STATED THAT WITH PASSENGER'S SIDE REAR WINDOWS ROLLED UP, THE SHAKING STOPPED. THE CONTACT PULLED OVER AND INSPECTED THE WHEELS BUT FOUND NO VISUAL FAILURES. THE CONTACT STATED THAT THE FAILURE RECURRED AFTER RESUMING DRIVING. THE CONTACT MENTIONED THAT HIS STEP-DAD HAD THE SAME VEHICLE AND EXPERIENCED SIMILAR FAILURES WITH THE REAR WINDOWS ROLLED DOWN. THE CONTACT STATED THAT THERE WAS AN ERROR IN THE DYNAMIC DESIGN FLOW WITH SIMILAR 2020 RAM 1500'S. NEITHER THE DEALER NOR THE MANUFACTURER WERE NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 14,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/16/2020",
        "dateOfIncident": "11/16/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374868,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF EXPLODED WHILE DRIVING ON AN INTERSTATE.  THERE WERE OTHER CARS AROUND BUT VEHICLE DIRECTLY IN FRONT OF ME WAS NOT CLOSE  THERE WAS NOT ANY SOUND LIKE SOMETHING STRIKING THE VEHICLE.  IT SOUNDED MORE LIKE A SHOTGUN BLAST AND THEN BROKEN GLASS AND WIND NOISE SOUNDS.  THE VEHICLE IS EQUIPPED WITH A PANORAMIC SUN ROOF, BUT ONLY THE SLIDING PORTION IS BUSTED.",
        "vin": "1C6SRFHT6LN"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/11/2020",
        "dateOfIncident": "11/11/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374154,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A SIGNIFICANT DELAY IN THROTTLE RESPONSE ON THE 1500 ECO-DIESEL. THERE ARE NUMEROUS SITUATIONS AND SCENARIOS WHERE YOU PUSH THE THROTTLE DOWN AND THE CAR DELAYS FOR A FEW SECONDS BEFORE THE ENGINE INCREASES POWER. I COULD BE PULLING OUT INTO TRAFFIC SOMETIMES AND SOMETIMES I ACCELERATE NORMAL AND SOMETIMES WHEN I PUSH THE GAS PEDAL THE CAR DELAYS AND I AM STUCK WITHOUT ANY ACCELERATION FOR A FEW SECONDS. YOU COULD ATTEMPT TO SPEED UP TO PASS ON THE HIGHWAY SOMETIMES AND AGAIN SOMETIMES IT DOES ACCELERATE AND SOMETIMES IT DOES NOT ACCELERATE AT ALL.",
        "vin": "1C6SRFHM6LN"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/27/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366748,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HVAC DOES NOT PROPERLY SEAL CAUSING CONSTANT COLD AIR TO FLOW THROUGH THE DEFROSTER. BEING IN FLORIDA, THIS CAUSES THE WINDSHIELD TO CONSTANTLY FOG UP WITH CONDENSATION LIMITING MY FORWARD FIELD OF VIEW. THIS HAPPENS MORE FREQUENTLY AT NIGHT AND IN THE MORNING. IT DOES HAPPEN THROUGHOUT THE DAY AS WELL NO MATTER WHAT THE CONDITIONS ARE OUTSIDE.",
        "vin": "1C6SRFFT6LN"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/22/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365829,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK FAILS TO PROPERLY ACCELERATE CREATING DANGEROUS MOMENTS WHEN ATTEMPTING TO PULL INTO TRAFFIC.PROBLEM SEEMS TO OCCUR MORE FREQUENT IN WARMER WEATHER BUT IS OCCURRING MORE FREQUENTLY AS MILEAGE ACCUMULATES.  THIS ISSUE DID NOT OCCUR IN THE FIRST 3-4000 MILES.  BUT NOW OCCURS QUITE FREQUENTLY.  WHEN IT HAPPENS THE ACCELERATOR IS FULLY DEPRESSED WITH EXTREMELY SLOW ENGINE ACCELERATION.  THE FIRST EXPERIENCE WITH ISSUE A SERVICE ELECTRONIC THROTTLE WARNING DISPLAYED.  THE CEL SET AT THAT TIME CLEARED BY ITSELF.  DEALER HAS BEEN UNABLE TO DETERMINE CAUSE.  THIS PROBLEM SEEMS LIKE IT IS ENGINE & BOOST MANAGEMENT RELATED.",
        "vin": "1C6RREJM3LN"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/22/2020",
        "dateOfIncident": "10/14/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365824,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PEDAL TRAVELS EXCESSIVELY ON FIRST APPLICATION OF BRAKES WITH OVERALL POOR BRAKING PERFORMANCE.  A RAPID SECOND OR THIRD BRAKE APPLICATION BRINGS BRAKE PEDAL UP TO NORMAL LEVEL, 1-2 INCHES HIGHER THAN INITIAL APPLICATION RESULTING IN NORMAL BRAKING PERFORMANCE.  THE ISSUE FEELS LIKE OLD STYLE REAR DRUM BRAKES THAT NEED TO BE ADJUSTED BUT THIS TRUCK HAS MODERN 4-WHEEL DISC BRAKES.  THE PEDAL HEIGHT TO FIRM SOLID PEDAL CAN BE EXPERIENCED PARKED OR IN MOTION.  THE REDUCED BRAKING PERFORMANCE IS A HIGH RISK TO SAFELY DRIVING THE VEHICLE.",
        "vin": "1C6RREJM3LN"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/20/2020",
        "dateOfIncident": "10/17/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365337,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS DROPPED OF AT THE DEALERSHIP FOR REPLACEMENT OF THE REAR WINDSHIELD. DEALERSHIP USED 3RD PARTY FOR WINDSHIELD REPLACEMENT. UPON GETTING THE VEHICLE BACK, IT WAS LATER FOUND THAT THE REAR DRIVER SIDE SEATBELT WAS NOT RE-ATTACHED TO BOLT AND THE MIDDLE SEATBELT WAS IMPROPERLY ATTACHED. MY DAUGHTER WAS IN THE REAR SEAT ON THE DRIVERS SIDE WHILE THE VEHICLE WAS IN MOTION AND THE SEAT BELT JUST RETRACTED PULLING THE CONNECTIONS WITH IT WHILE DRIVING ON CITY STREETS",
        "vin": "1C6SRFBT4LN"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/12/2020",
        "dateOfIncident": "09/02/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363861,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE A/C WILL ALWAYS BLOW COLD AIR ON THE WINDSHIELD REGARDLESS OF MODE. THIS CAUSES THE WINDSHIELD TO FOG ON THE EXTERIOR SIDE LEADING TO POOR VISIBILITY.",
        "vin": "1C6SRFJT0LN"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/27/2020",
        "dateOfIncident": "09/27/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361366,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TURNED INTO DRIVEWAY TO PARK TRUCK AND BRAKES DID NOT WORK THE VEHICLE WOULD NOT STOP IT HIT MY GARAGE AND THE ONLY WAY TO GET IT TO STOP IS WHEN I THREW IT INTO REVERSE SO IT WOULDN'T KEEP GOING. THE AUTOMATIC BRAKES THAT KICK IN WHEN TOO CLOSE TO SOMETHING ALSO DID NOT WORK OR KICK IN.",
        "vin": "1C6SRFFT6LN"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/21/2020",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360152,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 RAM 1500. THE CONTACT STATED THE VEHICLE FAILED TO START INTERMITTENTLY. THE CONTACT STATED THAT SEVERAL DAYS LATER, THE VEHICLE STARTED AS DESIGNED. THE CONTACT TOOK THE VEHICLE TO BAY CHRYSLER DODGE JEEP RAM (636 15TH ST, PANAMA CITY, FL 32401, (850) 785-1591) WHO WERE UNABLE TO IDENTIFY THE CAUSE OF THE FAILURE. THE FAILURE PERSISTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND A CASE WAS FILED. THE APPROXIMATE FAILURE MILEAGE WAS 8,000.",
        "vin": "1C6SRFLT8LN"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/21/2020",
        "dateOfIncident": "09/19/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360334,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BACKING UP AN  INCLINED DRIVEWAY ONTO A BUSY ROAD THE REAR BRAKING ASSIST ACTIVATED WITHOUT CAUSE, SHUTTING OFF THE ENGINE, LEAVING ME EXPOSED TO ONCOMING TRAFFIC.  WE WERE ABLE TO RESTART AND PULL BACK INTO THE DRIVEWAY SO THERE WAS NOT AN ACCIDENT BUT IT WAS A VERY DANGEROUS SITUATION.",
        "vin": "1C6SRFFT4LN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/19/2020",
        "dateOfIncident": "09/19/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11359981,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ISSUE OCCURS BOTH STATIONARY AND IN MOTION. THE 12\" INFOTAINMENT SYSTEM DOES NOT PLAY ANY SOUND OR ALLOW THE VOLUME TO BE ADJUSTED. THE SIRIUSXM FEATURE SHOWS A PERPETUAL LOADING SCREEN BUT NEVER ACTUALLY LOADS THE APP OR PLAY MUSIC. THE ISSUE IS EXTREMELY DISTRACTING AND TEMPTS DRIVERS TO TRY AND FIDDLE WITH IT WHILE DRIVING WHICH CAN LEAD TO DISTRACTED DRIVING. THE ISSUE ALSO PREVENTS BLUETOOTH HANDS-FREE CALLING FROM BEING USED TEMPTING DRIVERS TO TEXT OR PERFORM A NON-HANDS FREE CALL WHILE DRIVING.",
        "vin": "1C6SRFLT7LN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/16/2020",
        "dateOfIncident": "09/05/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355414,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FREQUENTLY, WHEN SLOWING OR COASTING SUCH AS WHEN MAKING A TURN OR COASTING PRIOR TO A STOP - WHEN IT IS NECESSARY TO RESUME ACCELERATION THEIR OCCURS A DELAY OF 2-3 SECONDS WHERE THE DRIVE TRAIN DOESN'T KNOW HOW TO RESPOND. WHEN IT FINALLY DOES IT  GOES INTO GEAR ABRUPTLY FOLLOWED BY THE LATE RESPONSE TO REQUEST FOR POWER FROM THE PEDAL INPUT. IN PARTICULAR THIS PRESENTED A SAFETY ISSUE WHEN I WAS IN A CENTER TURN LANE GETTING READY FOR A LEFT TURN OFF A TWO LANE HWY. WHEN THERE WAS A SUFFICIENT GAP TO MAKE THE TURN THE DELAY CAUSED A FEW HEART PALPITATIONS WHEN THE VEHICLE WOULD NOT RESPOND. I WAS TOWING AN ATV TRAILER AT THE TIME AND WANTED TO SPEED MY ENTRY TO THE SIDE ROAD I WAS TURNING ONTO.     THIS FAULT HAS OCCURRED MANY TIMES NOW AND IS PRETTY REGULAR. AS AN ENGINEER I BELIEVE THIS TO BE A SOFTWARE ISSUE. NO UPDATES ARE CURRENTLY AVAILABLE.",
        "vin": "1C6SRFFM4LN"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/01/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352426,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS CONSISTENT THROTTLE INPUT RESPONSE LAG. WHEN APPLYING THROTTLE FROM A STANDSTILL THERE IS A 1 TO 1.5 SECOND LAG BEFORE THE ENGINE REVS. THE SAME LAG OCCURS WHEN BUT CAN LAST UP TO 3 SECONDS WHEN ATTEMPTING TO INCREASE ACCELERATION FROM ANY GIVEN ROLLING SPEED. THIS IS INCREDIBLY DANGEROUS AS IT MAKES THE SIMPLE AND FREQUENT CHALLENGE OF CROSSING AN INTERSECTION AND/OR OVERCOMING SLOWER TRAFFIC IMPOSSIBLY DIFFICULT TO ACCOMPLISH SAFELY AND WITHOUT DRAMA/STRESS.     DELAYS IN RESPONSE CAUSE THE DRIVERS TO SECOND GUESS THEIR DECISIONS AND ACTIONS. THE RESULT WILL EITHER BE TO LIFT OFF OF THE THROTTLE (AT WHICH POINT THE VEHICLE MAY DECIDE TO ACCELERATE PARTIALLY) OR TO TAKE THEIR EYES OFF OF THE ROAD/TRAFFIC AND CHECK THE INSTRUMENT PANEL (AT WHICH POINT THE VEHICLE MAY THEN DECIDE TO ACCELERATE). IF THERE IS ONCOMING TRAFFIC, PEDESTRIANS OR OTHER OBSTACLES, THIS CAN RESULT IN A MAJOR ACCIDENT, INJURY AND/OR DEATH.",
        "vin": "1C6SRFHT7LN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/31/2020",
        "dateOfIncident": "08/17/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352241,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD CRACKED. 12' CRACK DUE TO STONE FROM HIGHWAY. . RAM DEALERS CANNOT CALIBRATE SENSORS ON WINDSHIELD BECAUSE RAM HAS MADE SOFTWARE AND HARDWARE TOO EXPENSIVE FOR PURCHASE. RAMFIAT STILL HAS NOT RELEASED 2020 SOFTWRE UPDATE TO 3RD PARTY VENDORS. I CALLED RAM SUPPORT AND THEY ADVISED NO ASSISTANCE CAN BE OFFERED 'AT THIS TIME'. I HAVE A NEW TRUCK I CAN'T SAFELY DRIVE.",
        "vin": "1C6SRFKT0LN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/31/2020",
        "dateOfIncident": "08/30/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352330,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RIGHT TURNING SIGNAL INDICATOR WILL RANDOMLY OPERATE WITHOUT BEING MANIPULATED. THE SIGNAL CAN NOT BE TURNED OFF EASILY. SOMETIMES TURNING THE CONTROL TO THE LEFT SIGNAL POSITION WILL TURN OFF THE INDICATOR. SOMETIMES RANDOMLY MANIPULATING THE CONTROL THROUGH ITS MECHANICAL LIMITS WILL TURN OFF THE INDICATOR. THERE IS NO LOGIC OR OBVIOUS VEHICLE CONDITION THAT CAUSES THIS RANDOM OPERATION. I THINK IT'S AN ISSUE WITH INTERFERENCE WITH OTHER VEHICLE WIFI SYSTEMS IN CLOSE PROXIMITY INTERFERING WITH MY VEHICLE BUS CONTROL SYSTEMS. THIS IS A SPORADIC ISSUE AND ONLY HAPPENS WHILE THE VEHICLE IS IN MOTION ON THE ROAD IN TRAFFIC.",
        "vin": "1C6SRFFM9LN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/18/2020",
        "dateOfIncident": "07/15/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350091,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "SOS DOES NOT WORK AND DEALERSHIP AND FCA STATE THIS IS NOT A SAFETY  ISSUE. THE POINT OF THE SOS IS TO ALLERT AUTHORITIES OF AN ACCIDENT.  ALSO I AM UNABLE TO USE THE APP AS INTENDED.  DEALER STATED THEY ARE WAITING FOR A PATCH TO BE DEVELOPED IN ORDER FOR THIS TO WORK. NO TIME FRAME AND NOT MANY VEHICLES AFFECTED",
        "vin": "1C6SRFLT3LN"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/10/2020",
        "dateOfIncident": "08/06/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348433,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 RAM 1500. THE CONTACT STATED THAT WHILE DRIVING, SHE SAW INDICATOR LIGHTS ON THE INSTRUMENT PANEL WHICH STATED THAT THE AUTO STOP AND START TORQUE SYSTEMS WERE UNAVAILABLE. THE ENGINE AND BATTERY WARNING LIGHTS WERE ILLUMINATED. THE ELECTRICAL SYSTEM FAILED AND TRUCK SHUT-OFF. THE CONTACT PULLED THE VEHICLE OVER TO THE SIDE OF THE ROADWAY. THE CONTACT HAD THE VEHICLE TOWED TO STONE'S CHRYSLER DODGE JEEP RAM (615 S YELLOWSTONE HWY, REXBURG, ID 83440 208-497-5121). THE CONTACT WAS INFORMED THAT THE PART OF THE MOTOR GENERATOR UNIT TO FIX THE VEHICLE WAS ON BACKORDER AND THERE WAS NO ETA ON WHEN THE VEHICLE WOULD BE REPAIRED. THE MANUFACTURER WAS REVIEWING THE CASE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 850.",
        "vin": "1C6SRFRT2LN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/06/2020",
        "dateOfIncident": "10/22/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343745,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I DROVE THE VEHICLE AND THE TAILGATE WAS NOT PROPERLY LATCHED. THE VEHICLE IS EQUIPPED WITH A TAILGATE AJAR WARNING LIGHT, BUT IT IS DISABLED BY THE MANUFACTURER. THE TAILGATE POPPED OPEN WHILE DRIVING AND ITEMS FELL FROM MY TRUCK BED ONTO THE ROAD CREATING A SIGNIFICANT SAFETY HAZARD FOR OTHER DRIVERS. BECAUSE THERE WARNING LIGHT IS PURPOSELY DISABLED, I WAS UNAWARE OF THE HAZARD UNTIL I STOPPED THE TRUCK AT MY DESTINATION. WHEN CONTACTING THE MANUFACTURER, I WAS TOLD THEY WOULD NOT FIX THE WARNING LIGHT. THIS FEATURE IS LISTED ON MY EQUIPMENT LIST FOR THE VEHICLE WHEN PURCHASED BUT PURPOSELY DISABLED BY RAM. IT CREATES A SIGNIFICANT HAZARD FOR DRIVERS BECAUSE UNKNOWING TO THE DRIVER OF THE TRUCK, THE TAILGATE CAN POP OPEN ALLOWING ITEMS TO FALL ON THE ROAD.     WHATS WORSE, IS THAT THE MANUFACTURER EXPLAINED TO ME THAT THEY DISABLED THE WARNING BECAUSE THEY ALSO HAVE AN ISSUE WHERE THE WARNING LIGHT WOULD COME ON BECAUSE THE TAILGATE SHOWS AS UNLATCHED, EVEN THOUGH IT IS LATCHED CORRECTLY. I FIND IT DISTURBING THAT THE MANUFACTURER WOULD DISABLE A SAFETY FEATURE FOR CONVENIENCE.",
        "vin": "1C6SRFLT1LN"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/05/2020",
        "dateOfIncident": "07/19/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343438,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SUNDAY, JULY 19, 2020, PARKED AND TURNED ON THE AC.  START SMELLING SOMETHING BURNING AND WHITE SMOKE STARTED TO COME OUT OF FRONT AND CAB VENTS.  IMMEDIATELY TURNED OFF AND LET TRUCK SIT FOR 30 MINUTES AND DROVE ABOUT TEN MILES AND THE WHITE SMOKE AND SMELL RETURNED.  PULLED OVER ON THE FREEWAY TO CHECK UNDER THE HOOD FOR SMOKE.  NO SMOKE WAS COMING FROM THE ENGINE COMPARTMENT.  SO, WE CALLED DEALERSHIP TO SEE IF THIS WAS NORMAL FOR AN ECODIESEL TRUCK.  THE SMELL AND SMOKE GAVE PASSENGERS INSIDE THE VEHICLE HEADACHES.  WE WERE MADE AWARE THAT THIS WASN'T NORMAL AND NEEDED TO BRING THE TRUCK IN.  THE SMOKED CONTINUED TO TRAVEL THROUGHOUT THE TRUCK VENTS EVEN AFTER IT WAS PARKED AT THE RESIDENT.  JULY 20,2020 CONTACTED ROADSIDE SERVICES AND HAD THE TRUCK TOWED TO THE DEALERSHIP.  THE DEALERSHIP DIAGNOSTIC WAS THE HEATER CORE CAUSED THESE PROBLEMS.  PASSENGERS EXPERIENCED HEADACHE FROM THE SMOKE AND BURNING SMELL.  THIS IS A SAFETY HAZARD ESPECIALLY FOR SOMEONE THAT IS UNABLE TO SMELL, ESPECIALLY IF ALL THE WINDOWS ARE UP.  THE TRUCK HAS LESS THAN 3,500 MILES.  THIS WAS A BRAND NEW 2020 VEHICLE AND IS STILL AT THE DEALERSHIP BEING REPAIRED.",
        "vin": "1C6RREFM1LN"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/02/2020",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342781,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASH LIGHTING AT NIGHT, WHEN HEADLIGHTS COME ON CAUSING A REDUCED BRIGHTNESS TO THE DASH LIGHTS, THE REDUCED BRIGHTNESS MODE IS TOO DIM AT IT'S HIGHEST SETTING FOR NIGHT TIME MODE.  WHILE IT IS POSSIBLE TO MOVE THE BRIGHTNESS DIAL TO DAYTIME MODE, BY MOVING THE DIAL PAST THE NIGHT TIME MODE, THAT IS TOO BRIGHT MAKING VIEWING FOWARD DIFFICULT.  I FEEL THIS CREATES A HAZZARD FOR NIGHT TIME DRIVING IN THIS VEHCILE.",
        "vin": "1C6SRFKT1LN"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "07/27/2020",
        "dateOfIncident": "05/20/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341615,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCIDENT  HAPPEN 5/20/20. WAS APPROACHING A STOPPED VEHICLE WHEN THE BRAKES FAILED. KEPT TRYING TO APPLY BRAKES AND NOTHING HAPPEN. IMPACT AT APPROX 35 MPH.   AFTER IMPACT THE TRUCK STARTED TO ROLL BACKWARDS AND HAD TO PUT IN PARK TO STOP THE TRUCK. TOW TRUCK DRIVE ALSO HAD ISSUES LOADING ON THE ROLL BACK, BRAKES WOULD NOT WORK. WE TOWED TO OUR BODY SHOP FOR REPAIRS. THEN WAS TAKEN TO FAULKNER DEALERSHIP FOR EDR TESTING. NOTHING MECHANICAL WAS EVER DONE WITH THE TRUCK AFTER THE BODY WORK WAS DONE. BOSCH RELEASED THE TRUCK TO THE DEALERSHIP. TRUCK HAS 513 MILES AND LITTLE OVER 200 OF THE MILES ARE WHAT WE DROVE IT. PURCHASED WITH MILES ON IT. FIAT / CHRYSLER DO NOT SEE AN ISSUE WITH THE TRUCK VIA THE REPORT. I HAVE SENT THE REPORT TO A SEPARATE PARTY THAT IS NOT HIRED BY FIAT AND THEY INDICATE TO RESEARCH PAGE 42 OF THE REPORT ON THE MASTER CYLINDER BRAKING SYSTEM. WE DO NOT SEE ANY INDICATION ON ANY CODES THAT WERE RECOVERED PERFORMED BY BOSCH. WE KNOW IN FACT THAT THERE WERE MULTIPLE BRAKE CODES AND FEEL THAT THE INFORMATION IN STILL IN THE \"BLACK BOX\".  AIRBAGS NEVER DEPLOYED AT IMPACT OF 35 MPH FRONTAL IMPACT.*DT*DT*JB*JB",
        "vin": "1C6SRFLT2LN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/23/2020",
        "dateOfIncident": "05/12/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341072,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE OWNED A 2020, RAM 1500 LIMITED EDITION SINCE MARCH 2020.  WHEN DRIVING THE STEERING STICKS IN THE 11:00 POSITION. IF I RELEASE HAND OFF WHEEL AND STEERING REMAINS IN POSITION. I HAVE TO PULL THE WHEEL BACK TO 12:00 POSITION. THIS PROBLEM STARTED OCCURRING ABOUT 2 MONTHS AGO AND HAS PROGRESSIVELY BEEN GETTING WORSE.  I TRAVEL 1500 TO 2000 MILES A MONTH AND AFRAID I MAY OVER CORRECT ESPECIALLY IN HEAVY TRAFFIC. SPOKE WITH DEALERSHIP AND THEY SAID THIS WAS THE 1ST THEY HAVE HEARD OF THIS ISSUE. HAVE NOT FOUND A SOLUTION TO THE PROBLEM. I WILL BE TAKING THE TRUCK BACK TO DEALERSHIP SAT JULY 25, 2020.",
        "vin": "1C6SRFHT0LN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/20/2020",
        "dateOfIncident": "07/11/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340331,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2020 RAM 1500 EXPERIENCED WHILE DRIVING A \"DATA BUS FAILURE\". THIS FAILURE CAUSED THE VEHICLE TO LOOSE POWER STEERING, BRAKES, RAMDOM INSTRUMENTATION DISPLAYS, WIPERS TO COME ON, HEADLIGHTS TO COME ON AND OFF. INTERMITANT LOSS OF TROTTLE CONTROL. HAPPENED 4 SEPARATE TIME. HAD SHOP ON 3 OF THE 4 TIMES INDICATE A BAD BATTERY, ASB MODULES AND PCM MODULE. CURRENTLY THEY ARE TRYING TO IDENTIFY A BAD TRANSMISSION CONTROL MODULE AS THE PROBLEM. TOTAL MILE 530 AND ONLY HAD THE VEHICLE FOR 50 DAYS. HAD TO BE TOWED TWICE TO THE SHOP AND THE OTHER TWO TIME IT HAPPENED WITH IN A MILE OF THE DEALER. IT SPEND ABOUT 20 DAYS IN THE SHOP ALREADY.",
        "vin": "1C6SRFFT9LN"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/07/2020",
        "dateOfIncident": "06/15/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11337818,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS TRAVELING ABOUT 35 MPH ON A STRAIGHT ROAD, WAS HIT A BY A VEHICLE WHO SPED OUT OF A SIDE ROAD. I WAS HIT ON THE DRIVERS SIDE FRONT FENDER BY THE CAR, THEN I CRASHED HEAD ON INTO THE FUEL TANKS OF A SEMI TRUCK. MY TRUCK HIT THE SEMI SO HARD IT THROUGH MY TRUCK BACKWARDS MORE THAN A TRUCK LENGTH. NO AIR BAGS DEPLOYED.",
        "vin": "1C6SRFBT5LN"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/22/2020",
        "dateOfIncident": "06/21/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330143,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TWO SEPARATE OCCASIONS IN THE PAST WEEK, THE THROTTLE PEDAL IN THIS GEN 3 ECODIESEL ENGINE HAS FAILED TO RESPOND UPON PRESSING IT TO MAKE A TURN AFTER DRIVING THE TRUCK FOR A FEW MINUTES.  I WILL DRIVE A FEW MILES, THEN STOP IN A TURNING LANE AWAITING A CHANCE TO COMPLETE THE LEFT HAND TURN ACROSS TRAFFIC, AND WHEN I APPLY PRESSURE TO THE THROTTLE PEDAL NOTHING HAPPENS.  IT'S AS IF THE PEDAL HAS BEEN UNPLUGGED.  AS I CONTINUE TO HOLD PRESSURE ON THE PEDAL, SEVERAL SECONDS WILL GO BY AND THEN IMMEDIATELY THERE WILL BE A HARSH JERK AND THE TRUCK WILL IMMEDIATELY APPLY POWER.  THIS IS A SEPARATE ISSUE FROM THE TERRIBLE LAG IN THROTTLE RESPONSE THAT HAS BEEN PRESENT SINCE THE TRUCK WAS BRAND NEW.  THIS LOSS OF ALL PEDAL RESPONSE ONLY BEGAN TO HAPPEN THIS PAST WEEK, WITH APPROXIMATELY 3,800 MILES ON THE ODOMETER.  *TR",
        "vin": "1C6SRFFM5LN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/21/2020",
        "dateOfIncident": "06/11/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329976,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 RAM 1500; ETORQUE SYSTEM ISSUES SHUTTING TRUCK OFF TWICE NOW. KILLS BATTERY AND THE TRUCK. MY TRUCK HAS 1400 MILES ON IT AND THE PART IS ON NATIONAL BACK ORDER, NO LOANER VEHICLE; UNKNOWN REPAIR TIME. TRUCK FAILED BOTH TIMES WITH TRYING TO REMOTE START THE VEHICLE IT SHUTS RIGHT OFF. THE.N WHEN TRYING PUSH START THE BATTERY LIGHT COMES ON WITH CHECK ENGINE AND BATTERY VOLTAGE LOW ON INFORMATION SYSTEM.",
        "vin": "1C6SRFRT8LN"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/17/2020",
        "dateOfIncident": "05/14/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329421,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS MISSING TAILGATE AJAR WARNING LIGHT.  ACCORDING TO BUILD REPORT ITS LISTED UNDER VIN AND IS IN THE 2020 RAM 1500 MANUAL.  I NOTICED THIS AFTER I PULLED AWAY WITH TAILGATE OPEN.  REALIZED IT SHOULD HAVE A WARNING LIGHT AND BEGAN TO INVESTIGATE.  DEALER SAYS I DON'T HAVE THIS, BUT CUSTOMER SERVICE SAYS I HAVE IT AND PLUS ITS IN THE MANUAL.  *TR  Consumer like to add, he noticed staining to headliner from water leak. This should be a safety recall since it can be effecting the drivability of vehicle and safety of vehicle occupants. Water is possibly penetrating thru roof antenna, rear window and through vehicle third light.  Water started leaking through the air bag area, seat belt tensioners, car speakers and coming in contact with electrical components of vehicle.  Carpet and insulation is wet caused by this leaking.*JB",
        "vin": "1C6SRFJT7LN"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/17/2020",
        "dateOfIncident": "06/12/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329360,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STOPPED AT LIGHT WHEN I BEGAN TO ACCELERATE MAKING A LEFT TURN THE TRANSMISSION WOULDN'T SHIFT OUT OF FIRST GEAR.  THIS IS DANGEROUS SHOULD YOU NEED TO QUICKLY MOVE CAR OUT OF WAY.  CAR WENT UP TO 5000 RPM BEFORE I RELEASE THE GAS AND PROCEEDED TO SIDE OF ROAD.  DEALER COULDN'T DUPLICATE, I ASKED THEM TO FLASH THE COMPUTER AND THEY REFUSED, SAYING ANY UPDATES WOULD BE OVER THE AIR. WHICH IS NOT TRUE.     TRUCK IS SUPPOSED TO BE EQUIPPED WITH TAILGATE AJAR WARNING LIGHT, IT IS IN MANUAL AND ON MY BUILD SHEET.  DEALER TELLS ME THAT ITS NOT.  SO THERE NOT PUTTING IN THE CORRECT EQUIPMENT. THIS IS DANGEROUS SINCE I HAD 2017 RAM THAT TAILGATE OPENED WHILE DRIVING BEFORE RECALL!!  *TR",
        "vin": "1C6SRFJT7LN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/15/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329030,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 RAM 1500. THE CONTACT STATED THAT UPON REVERSING THE VEHICLE AT VARIOUS OCCASIONS, THE VEHICLE ABRUPTLY STOPPED WITHOUT WARNING. NEITHER THE DEALER NOR THE MANUFACTURER WERE NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 700.",
        "vin": "1C6RREBT8LN"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/05/2020",
        "dateOfIncident": "03/10/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327372,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 RAM 1500. THE CONTACT STATED THAT ON SEVERAL OCCASIONS WHILE THE VEHICLE WAS IN DRIVE OR IN REVERSE, THE BRAKES ACTIVATED INDEPENDENTLY WITHOUT WARNING. THE VEHICLE WAS TAKEN TO AN UNKNOWN DEALER AND TO LIA DODGE LOCATED AT 2116 CENTRAL AVE, SCHENECTADY, NY, 518-579-3300, WHERE AN UNKNOWN SOFTWARE WAS UPDATED HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE HOWEVER, PROVIDED NO ADDITIONAL ASSISTANCE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 500.",
        "vin": "1C6SRFBT0LN"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/04/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327281,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING IN THE HIGHWAY AT 65MPH WHILE STEERING POWER SHUT OFF AND WARNING ON DASH CAME ON SAYING POWER STEERING WAS DISENGAGED. I PULLED OFF THE HIGHWAY SHUT VEHICLE OFF CHECKED UNDER HOOD AND NOTHING. GOT BACK ON VEHICLE STARTED IT AND WARNING HAD GONE AWAY AND STEERING WAS OK. DROVE FOR ABOUT 10 MILES AND IT HAPPENED AGAIN. I WAS TOLD TO DRIVE VEHICLE TO DEALER AND THEY SAID IT WAS A PROBLEM WITH THE BATTERY.  VEHICLE WAS IN SHOP FOR A DAY. THEY CALLED AND SAID PROBLEM  WAS FIXED. I LEFT THE DEALER, DRIVE 40 MILES AND IT HAPPENED AGAIN.  TOOK IT BACK.  AND NOW THEY DON'T KNOW WHAT THE PROBLEM IS.  VERY UNSAFE VEHICLE. POWER STEERING GOES OFF RANDOMLY.  IM GLAD I DIDN'T HAVE MY FAMILY WITH ME. TRUCK IS VERY HARD TO CONTROL WITH NO POWER STEERING. I ALSO NOTICED WHILE DRIVING TO THE DEALER THE INSTRUMENT PANEL WOULD GO DIM AND THEN BACK TO NORMAL.  *TR",
        "vin": "1C6RREFT0LN"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/28/2020",
        "dateOfIncident": "05/09/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326376,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS DEFECT HAS THE REAL PROBABILITY OF CAUSING DAMAGE TO BOTH MY VEHICLE AND ANOTHER VEHICLE.  TAKING MY NEW TRUCK THROUGH A CAR WASH, I PUT THE VEHICLE IN NEUTRAL AT THE START OF THE WASH.  THE CAR WASH HAS ROLLERS THAT DRIVE THE REAR DRIVER'S SIDE WHEEL THROUGH THE CAR WASH.  AT THE END, MY VEHICLE DASHBOARD INDICATES THAT I NEED TO DEPRESS THE BRAKE PEDAL AND PUSH THE START/STOP BUTTON ON THE DASH.  AFTER DOING THIS, THE DASHBOARD THEN TELLS ME THAT I NEED TO DEPRESS THE BRAKE PEDAL AND PUT THE VEHICLE INTO DRIVE.  EACH TIME I DEPRESS THE BRAKE PEDAL, THE DRIVER'S REAR TIRE JUMPS OVER THE ROLLER PUSHING THE VEHICLE AND THE DISTANCE BETWEEN MY VEHICLE AND THE VEHICLE BEHIND ME CLOSES.  MY RAM HAS THE LARGE MONITOR SCREEN, AND HAS THE ABILITY TO INSTALL APPS.  WHAT IS NEEDED IS A \"CAR WASH APP\" THAT DISABLES THE REQUIREMENT TO DEPRESS THE BRAKE FOR THESE TWO PROCEDURES AS LONG AS THE VEHICLE WAS 1) ROLLING IN NEUTRAL; 2) HAS NOT TRAVELED MORE THAN X FEET (300); AND 3) HAS NOT TRAVELED FASTER THAN 4 MILES PER HOUR.  *TR",
        "vin": "1C6SRFHM1LN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/22/2020",
        "dateOfIncident": "03/26/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325627,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE CONTINUALLY HAS A DEAD, -DEAD- 0 VOLT BATTERY OVERNIGHT. STARTED ITS 1ST WEEK HOME AND HAS REPEATEDLY HAPPENED HALF A DOZEN TIMES RANDOMLY SINCE. FULLY CHARGING THE BATTERY TAKES ALL DAY. THE BATTERY HAS PROBABLY TAKEN PERMANENT DAMAGE. I HAVE TO CARRY A 1000 AMP JUMP BOX AT ALL TIMES TO HAVE RELIABLE TRANSPORTATION. DRAINING A AGM 85 AHR BATTERY DEAD FLAT IN A FEW HOURS IA A MAJOR PROBLEM AND A POTENTIAL FIRE HAZARD.    THERE IS NO SHORTAGE OF SIMILAR COMPLAINTS ON THE INTERNET    HTTPS://5THGENRAMS.COM/COMMUNITY/THREADS/DEAD-TRUCK-CLASS-ACTION-LAWSUIT.17342/    HTTPS://5THGENRAMS.COM/COMMUNITY/THREADS/HOW-MANY-TIMES-HAVE-YOU-HAD-A-DEAD-BATTERY.17149/  *TR",
        "vin": "1C6SRFKM8LN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/07/2020",
        "dateOfIncident": "05/06/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323797,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT CAME ON AT  AROUND 300 MILES. CODE P3497. BROUGHT IT TO THE DEALER AND WAS TOLD IT NEEDS NEW LIFTERS. TRUCK WAS IN MOTION ON A CITY STREET WHEN LIGHT CAME ON.  *TR",
        "vin": "1C6SRFBT4LN"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/06/2020",
        "dateOfIncident": "05/05/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323550,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "USUALLY, THE GAS NOZZLE AUTOMATICALLY TURNS OFF THE GAS WHEN THE TANK IS FULL. WHILE WAITING FOR THIS TO HAPPEN, HAND ON NOZZLE HOLDING IT OPEN, THE GAS OVERFILLED, GUSHED OUT OF THE FILL TUBE, AND OUT FROM UNDER THE TRUCK. A BIG PUDDLE OF GAS ON THE GROUND. I THOUGHT THE NOZZLE SHUTOFF MALFUNCTIONED.   I WENT TO FILL MY TRUCK AGAIN ON 5/5. I PUT THE NOZZLE INTO THE FILL TUBE AND SQUEEZED THE HANDLE. GAS GUSHED OUT OF THE FILL TUBE RIGHT AWAY, OUT FROM UNDER THE TRUCK AND CREATING ANOTHER LARGE PUDDLE OF GAS ON THE CONCRETE.   I HAD A SIMILAR, NO CAP, FILLING TUBE ON MY 2013 F-150 AND NEVER HAD THIS PROBLEM IN 7 YEARS. SO I CALLED MY DEALER TO REPORT THIS AND SEE IF OTHERS HAVE HAD THE SAME PROBLEM. I WAS TOLD THERE IS A SECOND VALVE IN THE FILL TUBE AND I NEED TO INSERT THE NOZZLE ALL THE WAY INTO THE SPRING. I HAVEN'T HAD A CHANCE TO SEE IF THIS CORRECTS THE PROBLEM. HOWEVER, MANY TIMES WHEN I HAVE TRIED TO FILL VARIOUS VEHICLES THAT I HAVE OWNED, SOMETIMES I HAVE TO PULL THE NOZZLE SLIGHTLY OUT TO KEEP THE AUTOMATIC TURN OFF FROM COMING ON SO I CAN FILL THE TANK. I NEVER TOP OFF, ADD MORE GAS AFTER THE AUTOMATIC SWITCH TURNS THE PUMP OFF.  I THINK THIS IS A POOR DESIGN OR SOMETHING WRONG WITH MY FILL TUBE. I'M SURE OTHERS WILL BE DOING THE SAME THING I DID AND RAW GAS ALL OVER THE GROUND AND VEHICLE ISN'T VERY SAFE.   BOTH TIMES VEHICLE WAS STATIONARY AND ENGINE OFF AT THE FILLING STATION. I WILL TAKE PICTURES IF THIS HAPPENS AGAIN.  *TR",
        "vin": "1C6SRFFT3LN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/17/2020",
        "dateOfIncident": "04/15/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321383,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 RAM 1500 ECODIESEL HAS A SERIOUS TURBO LAG. WHEN YIELDING AND THEN ACCELERATING,  THE ENGINE POWER SEEMS TO JUST DROP OUT,  FALLS FLAT.  BY THIS TIME VEHICLE COASTS INTO APPROACHING LANES AND THEN IT WILL SUDDENLY ACCELERATE WITH A BURST OF POWER.  I FEEL IT IS TURBO LAG BUT MAY ALSO BE THAT THE TRANSMISSION IS NOT DOWN SHIFTING IN TIME IN ADDITION. I'VE HEARD NUMEROUS OTHERS MENTION THIS AND IT'S SOMETHING THAT I HAVE TO WATCH FOR CONSTANTLY BUT CANNOT CATCH IT EVERYTIME. THIS SPECIFICALLY HAPPENS EVERY TIME I GO TO EXIT MY LONG DRIVEWAY ONTO A 4 LANE HWY.  *TR",
        "vin": "1C6SRFKM7LN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/15/2020",
        "dateOfIncident": "04/14/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321168,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THROTTLE RESPONSE OR ACCELERATION LAG AFTER LETTING OFF THE GAS TO CHANGE LANES OR SLOWING FOR CORNERS ETC.  HAS HAPPENED AT END OF EXIT OFF THE INTERSTATE AFTER STOPPING AT STOP SIGN, THEN PROCEEDING TO MAKE A RIGHT TURN INTO THE LANE.  UPON PRESSING GAS TRUCK SEEMS TO \"COAST\" OR WAIT A FEW SECONDS BEFORE REALIZING IT'S GETTING GAS THEN WILL SUDDENLY ACCELERATE.  YOU HAVE TO WAIT AND NOT GIVE IT GAS FOR A FEW SECONDS FOR IT TO CATCH UP.THIS CAUSES A PROBLEM WHEN CHANGING LANES IN TOWN IN TRAFFIC.  APPEARS TO HAPPEN MAINLY AT SLOWER SPEEDS.  SUCH LAG COULD CAUSE YOU TO GET REAR ENDED A LOT CAN HAPPEN IN 3 TO 5 SECONDS.  HAVE HAD VEHICLE TO SHOP, INSPECTED AND NO SIGNS OF ANYTHING WRONG UPON TESTING.  HAS HAPPENED AGAIN, WILL TAKE TO SHOP AGAIN.  THIS HAS HAPPENED 5 OR 6 TIMES NOW IN LESS THAN 30 DAYS OF OWNERSHIP.  TRUCK NOW HAS 1078 MILES ON IT.  *TR",
        "vin": "1C6SRFHM0LN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/06/2020",
        "dateOfIncident": "03/05/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316534,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "3.0L GEN 3 ECODIESEL ENGINE HAS EXCESSIVE LAG AND DELAY IN THROTTLE RESPONSE. WHILE TRAVELING AT STEADY SPEED IN LOWER GEARS 3RD, 4TH, OR 5TH AND THEN DEPRESSING ACCELERATOR PEDAL TO INCREASE SPEED, ENGINE WILL NOT RESPOND UNTIL THREE TO FOUR SECONDS HAVE ELAPSED. THIS CREATES A SIGNIFICANT HAZARD WHEN ATTEMPTING TO MERGE INTO TRAFFIC OR CROSS TRAFFIC DURING A LEFT TURN. PRIOR EXPERIENCE WITH MULTIPLE GASOLINE AND DIESEL TURBO-CHARGED VEHICLES HAS NOT PRESENTED THIS ISSUE TO ME. THE 2020 RAM 1500 ECODIESEL HAS A MAGNITUDE OF TURBO LAG AND UNRESPONSIVE THROTTLE THAT IS QUITE DANGEROUS.",
        "vin": "1C6SRFFM5LN"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/03/2020",
        "dateOfIncident": "02/29/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315754,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER TAKING THE TRUCK THROUGH A CAR WASH AND BRINGING HOME TO VACUUM, I NOTICED WATER IN THE FRONT DRIVER'S SIDE FLOOR. I NOTICED CONDENSATION UNDER THE FLOOR MAT TOO. AFTER PULLING OUT THE KICK PANEL AND ROLLING THE CARPET BACK, THE METAL FLOOR WAS WET AND THE PAD WAS SATURATED. I TOOK IT TO THE DEALER AND IT WAS REPORTED BACK TO ME THAT THERE WERE SEAMS IN THE BODY THAT WERE NOT FILLED.",
        "vin": "1C6SRFJT3LN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/01/2020",
        "dateOfIncident": "02/29/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315415,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TAILGATE KEEPS OPENING",
        "vin": "1C6RREJT8LN"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/30/2020",
        "dateOfIncident": "01/30/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302965,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING OFF A EXIT, AT ABOUT 10-15 MPH WENT UNDER A BRIDGE AND THE FORWARD COLLISION WARNING SYSTEM APPLIED THE BRAKE AND STOPPED THE CAR SHORT(NO OTHER CAR WAS IN FRONT OF ME), ALMOST HAVING THE CAR BEHIND ME HIT ME. ALSO GOING INTO A PARKING GARAGE IT ALSO STOPPED SHORT 2 TIMES DURING ONE VISIT, NO OTHER CARS AROUND.  THIS IS EXTREMELY DANGEROUS !!!",
        "vin": "1C6SRFHT6LN"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "12/30/2019",
        "dateOfIncident": "12/16/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11292056,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE THROTTLE MAXIMIZED WHEN I PRESSED THE BRAKE TO STOP.  AFTER IMPACT WITH ANOTHER VEHICLE THE THROTTLE WENT BACK TO THE IDLE POSITION.  I WAS MERGING IN TRAFFIC ONTO ANOTHER STREET. THE VEHICLE IN FRONT OF ME WAS STOPPED FOR THE MERGER.  *LN    CASE NUMBER XXXXXXXX    ('PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'*JB",
        "vin": "1C6SRFJT6LN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/19/2019",
        "dateOfIncident": "12/19/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290157,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS HAS HAPPENED SEVERAL TIMES. WHEN DRIVING THE RAM, WITH THE GEAR IN DRIVE AND IN 2 WHEEL DRIVE, THE TRANSMISSION WILL NOT SHIFT OUT OF FIRST GEAR. OBVIOUSLY, THIS IS VERY DANGEROUS FOR DRIVING. THIS SEEMS TO BE A RECURRING ISSUE WITH THE DODGE RAM AND SHOULD BE FIXED OR RECALLED. SIMILAR ISSUES WITH THE 2019 DODGE RAM: HTTPS://WWW.CARGURUS.COM/CARS/DISCUSSION-T77803_DS971922",
        "vin": "1C6SRFLT8LN"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/14/2019",
        "dateOfIncident": "12/13/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289055,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAND NEW 2020 RAM 1500 LARAMIE SPORT IS EQUIPPED WITH TILTING DOWN DRIVER/PASSENGER SIDE MIRRORS WHEN IN REVERSE. THE PROBLEM IS WHEN THEY TILT DOWN, THEY TILT DOWN SO FAR THAT IT IS OUT MY VIEW. I UTILIZE THIS FEATURE FOR BACKING INTO MY GARAGE, ON SIDE ON MY BOAT, WHERE SPACE IS VERY LIMITED. I ACTUALLY HAVE INCHES ON BOTH SIDES OF THE TRUCK. AFTER SPENDING BIG MONEY ON MY NEW RAM 1500 2020 LARAMIE SPORT, I EXPECT ALL OF IT'S FEATURES TO PERFORM AS DESCRIBED, AND EXPECTED. AFTER TALKING WITH THE SALESMAN WHO SOLD ME THE TRUCK, HE EXPLAINED THIS IS A KNOWN PROBLEM IN THE RAM COMMUNITY ON THESE NEW 2020 VEHICLES. KNOWING THIS, IT FRUSTRATES ME EVEN MORE THAT I WAS NEVER INFORMED OF THIS INFORMATION PRIOR TO MAKING THE PURCHASE. THIS PROBLEM SHOULD BE FIXED IMMEDIATELY.",
        "vin": "1C6RREJT7LN"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/30/2019",
        "dateOfIncident": "11/13/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11283032,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ON NOVEMBER 13, 2019 AT 6:00PM PST WHILE TRAVELING 70MPH WESTBOUND ON INTERSTATE 90 AT THE SR18 INTERCHANGE THE VEHICLE EXPERIENCED MULTIPLE SERIOUS SAFETY DEFECTS AND MAJOR SYSTEMS FAILURES DUE TO LOSS OF ELECTRICAL POWER. LIGHT CONDITIONS WERE NIGHTTIME, TRAFFIC WAS LIGHT, WEATHER WAS CLEAR. ELECTRONIC FAILURE MESSAGES BEGAN TO APPEAR ON INSTRUMENTATION PANEL APPROXIMATELY 20 MINUTES PRIOR TO THE TOTAL ELECTRICAL FAILURE:  NAVIGATION, STOP/START, CLIMATE CONTROL, UCONNECT, SIRIUS RADIO, ADAPTIVE CRUISE ALL CEASED FUNCTION WITH NO DRIVER ABILITY TO CONTROL THESE SYSTEMS WELL PRIOR TO THE TOTAL SHUTDOWN.  AT TOTAL SHUTDOWN, WITH THE VEHICLE STILL TRAVELING AT 70MPH, THE FOLLOWING ADDITIONAL EVENTS SIMULTANEOUSLY OCCURRED:  1.TOTAL FAILURE AND COMPLETE LOSS OF POWER STEERING,  2.TOTAL FAILURE AND COMPLETE LOSS OF POWER BRAKES,  3.TOTAL FAILURE AND COMPLETE LOSS OF HEADLIGHTS, TURN SIGNALS, AND HAZARD LIGHTS  4.TOTAL FAILURE AND COMPLETE LOSS OF ALL DASHBOARD AND U CONNECT INSTRUMENTATION,  5.TOTAL FAILURE AND COMPLETE LOSS OF ALL STEERING COLUMN AND DASHPANEL CONTROLS  6.TOTAL FAILURE AND COMPLETE LOSS OF ADAPTIVE CRUISE CONTROL,  7.TOTAL FAILURE AND COMPLETE LOSS OF ELECTRONIC LANE ASSIST.  8.TOTAL FAILURE AND COMPLETE LOSS OF ELECTRONIC PARKING BRAKE  THIS ENDED WITH THE VEHICLE BEING SAFELY PULLED TO THE SHOULDER OF THE FREEWAY. WHEN STATIONARY, THE VEHICLE LOST NEARLY ALL POWER; THERE WAS JUST ENOUGH REMAINING POWER TO RANDOMLY ILLUMINATE DISPLAYS AND UCONNECT IN ARBITRARY FLASHES; GIVING THE DASHPANEL THE APPEARANCE OF A NIGHTCLUB. THE VEHICLE WAS THEN TOWED TO THE SELLING DEALER.",
        "vin": "1C6SRFHTXLN"
    }
]