[
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/30/2022",
        "dateOfIncident": "01/30/2022",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449483,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The vehicle seems to randomly die and bog out then all of the lights appear on the dash, I myself had to pay out of pocket for a new battery because autonation subaru arapahoe in colorado decided not to check it like I had asked and after getting my car back the issue was still there which is why I replaced it today. not only this but they sold me a highly modified vehicle without disclosing any of that info to me in the sale process.",
        "vin": "JF1VA1A65L9"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/12/2022",
        "dateOfIncident": "01/12/2022",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447146,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Got in the car to drive to work and the front windshield just cracked on its own with nothing hitting it.",
        "vin": "JF1VA2E6XL9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/17/2021",
        "dateOfIncident": "05/17/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417403,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I have owned the car for ~15 months and driven it for 2500 miles.  The battery has failed four times.  Each time Subaru has replaced the battery under warranty and told me that nothing is wrong and that the car simply needs to be driven more.  I now see that this is a systemic problem for Subarus (e.g. https://www.torquenews.com/1084/subaru-battery-drain-lawsuit-new-claims-now-include-forester-wrx-and-legacy)  A recall is needed to force Subaru to address this problem.",
        "vin": "JF1VA1C60L9"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/16/2021",
        "dateOfIncident": "02/16/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396473,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON APPLYING PARKING BRAKE TO THE MAXIMUM EXTENT POSSIBLE, WHICH IS BEYOND 11 CLICKS AS STATED AS REQUIRED BY SUBARU, AND THE VEHICLE IS ON AN INCLINE GREATER THAN 8 DEGREES, THE VEHICLE WILL NOT REMAIN IN PLACE.  I AM ALSO CONCERNED THAT IF THE BRAKE IS REQUIRED IN AN EMERGENCY SITUATION, IT WILL NOT EFFECTIVELY STOP THE VEHICLE AS THE WHEELS ARE STILL ALLOWED TO TURN MORE FREELY THAN EXPECTED GIVEN ITS INABILITY TO HOLD THE VEHICLE ON A HILL.  I TOOK THE VEHICLE TO SUBARU TWICE EXPRESSING THE COMPLAINT AND WAS SUMMARILY DENIED SERVICE.  THE TECHNICIAN REFUSED TO EVEN INSPECT VEHICLE EVEN AFTER REQUESTING AN INSPECTION.  THE SERVICE TECHNICIAN INFORMED ME THAT YOU MUST APPLY THE PARKING BRAKE TO 11 CLICKS AND PUT THE VEHICLE IN GEAR.  THE FORCE REQUIRED TO PULL THE PARKING BRAKE TO 11 CLICKS IS MORE THAN MANY PEOPLE ARE ABLE TO APPLY IN A SINGLE MOTION AS REQUIRED BY FEDERAL LAW.  IN ADDITION, AIR COMPRESSION IS EXPLICATED STATED IN FEDERAL LAW AS NOT ALLOWED AS A MECHANISM OF FORCE FOR USE IN A PARKING BRAKE SYSTEM.  AIR COMPRESSION IS WHAT IS USED IN THE ENGINE AS A MEANS TO PREVENT THE WHEELS FROM MOVING WHEN IN GEAR.  FURTHER, THE PARKING BRAKE SYSTEM SHALL ACCORDING TO FEDERAL LAW, USE AN ACCUMULATION OF FORCE INDEPENDENT OF OTHER SYSTEMS FOR THE PARKING BRAKE, WHICH IS NOT THE CASE PER THE INSTRUCTION FROM SUBARU.  LASTLY, SUBARU ALSO INSTRUCTED ME TO PUT A WHEEL STOP BEHIND THE WHEEL AS A STANDARD PRACTICE IN THIS COMMON PARKING SCENARIO, WHICH ISN'T POSSIBLE TO DO IF I HAVE TO TAKE MY FOOT OFF THE BRAKE TO GET OUT OF THE CAR TO PLACE THE WHEEL STOP.  AS SOON AS I TAKE MY FOOT OFF THE BRAKE, THE VEHICLE MOVES SO I AM UNABLE TO SAFELY EXIT VEHICLE IN ORDER TO PLACE THE WHEEL STOP.  THIS IS A SERIOUS SAFETY ISSUE BOTH FOR KEEPING A PARKED VEHICLE IN PLACE AND ALSO IN AN EMERGENCY BRAKE SCENARIO.",
        "vin": "JF1VA1B67L9"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/16/2021",
        "dateOfIncident": "01/16/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388491,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "SITTING AT A STOPLIGHT, A LOUD POP OCCURS AND WHEN I LOOK BACK, THERE IS A HOLE IN THE MIDDLE OF THE REAR WINDSHIELD. IT IS APPROXIMATELY 2 INCHES TALL AND AT LEAST 18 INCHES WIDE. IT WAS LIKELY AN IMPLOSION. NO OBJECTS WERE FOUND NEAR, ON, OR IN THE CAR. THE WINDSHIELD CRUMBLED AFTER THAT, AS EACH ACCELERATION DROPPED MORE GLASS INSIDE THE CAR. NOTHING PROMPTED IT, JUST SITTING STATIONARY AT A STOPLIGHT. DEFROSTER WAS NOT ON, TEMPERATURE WAS APPROXIMATELY 45 FAHRENHEIT WITH MINIMAL WIND. HAD BEEN DRIVING FOR 10 MINUTES. MY REAR FACING CAR SEAT, WITH CHILD IN IT, COLLECTED A FAIR AMOUNT OF THE GLASS.",
        "vin": "JF1VA2Y60L9"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/26/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366449,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD CRACKED FOR NO APPARENT REASON. CAR WAS STATIONARY.",
        "vin": "JF1VA2E64L9"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "04/30/2020",
        "dateOfIncident": "04/05/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11322830,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2020 SUBARU WRX. THE CONTACT STATED THAT WHILE HE SON WAS DRIVING AT 40 MPH, HE ATTEMPTED TO DEPRESS THE BRAKE PEDAL HOWEVER, THE VEHICLE FAILED TO STOP, RUNNING A RED LIGHT, THE VEHICLE WAS T-BONED. THE CONTACT STATED THAT THE IMPACT CAUSED THE VEHICLE TO HIT A LIGHT POST, THE AIR BAGS FAILED TO DEPLOY AND THE SEAT BELT FAILED TO LOCK. THE CONTACT STATED FIVE DAYS PRIOR HER SON WAS DRIVING AND THE BRAKE PEDAL FAILED TO ENGAGED WHILE COMING TO A STOP LIGHT. THE DRIVER HAD TO DEPRESS THE BRAKE PEDAL TO THE FLOOR TO STOP THE VEHICLE. THE DRIVER STATED THAT NO WARNING LIGHTS OR MESSAGES WERE DISPLAYED DURING EITHER FAILURE. THE DRIVER SUSTAINED A FRACTURED WRIST. THE POLICE REPORT WAS FILED. THE PARAMEDIC CAME HOWEVER, THE CONTACT WAS TOLD TO CALL THE DOCTOR FOR X-RAYS. THE DRIVER WAS SEEN BY HIS DOCTOR FOR HIS FRACTURED WRIST. THE VEHICLE WAS TOTALED AND WAS TOWED TO A BODY SHOP. THE CONTACT CALLED HERITAGE SUBARU OWNINGS MILLS (9808 REISTERSTOWN ROAD OWINGS MILLS, MD 21117)  AND WAS TOLD TO CALL THE MANUFACTURER. THE CONTACT CALLED THE MANUFACTURER AND FILED A COMPLAINT. THE FAILURE MILEAGE WAS 2,100. *DT*JB",
        "vin": "JF1VA1C63L9"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/30/2019",
        "dateOfIncident": "02/13/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11292092,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE RECENTLY PURCHASED A 2020 SUBARU WRX LIMITED. I HAVE LEARNED BY INSPECTION THAT THE STANDARD OEM TIRE ON THIS VEHICLE IS A DUNLOP SPORT MAX RT. THIS IS A HIGH PERFORMANCE SUMMER TIRE. THIS CLASS OF TIRE IS NOT RECOMMENDED TO BE USED IN VERY COLD WEATHER AND ESPECIALLY ON ICE AND SNOW. I HAVE PREVIOUSLY OWNED SUCH TIRES AND THEY ARE TERRIFYING ON ICE, THAT IS, DANGEROUS. I LIVE IN A AREA OF THE COUNTRY WHERE SNOW AND ICE ARE COMMON. SUBARU DID NOT INFORM ME OF THESE TIRES AND I AM NOW CONFRONTED WITH PURCHASING A NEW SET OF ALL SEASON TIRES SO I CAN SAFELY DRIVE MY CAR. BY THE WAY, I HAVE PREVIOUSLY WORKED IN TIRE ENGINEERING. IS A LESS KNOWLEDGEABLE PERSON EXPECTED TO RECOGNIZE SUCH A DEFICIENCY AND  TAKE THE NECESSARY PRECAUTIONS? NOT DRIVE IN COLD, SNOWY OR ICY CONDITIONS OR PURCHASE NEW TIRES?",
        "vin": "JF1VA1J64L9"
    }
]