[
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/16/2022",
        "dateOfIncident": "02/23/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456925,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Driver seat belts doesn’t buckle properly",
        "vin": "4t1g11ak2lu"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/05/2022",
        "dateOfIncident": "06/15/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450565,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "It's a dangerous thing. The first time it happened to me was on Jun 15, 2021, only the light came on and when I turned off the car the light went off after a month it came on again and turned off by itself, and now it turned on and it doesn't turn off for nothing. and it only says the PRE-COLLISION SYSTEM & CRUISE CONTROL MALFUNCTION alert. I was doing a little research online and I realized that many people have this problem regardless of the vehicle miles and this is dangerous since this happens on local streets or highways regardless of the speed of the vehicle. please investigate. Thank you.",
        "vin": "4T1G11AK1LU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/25/2022",
        "dateOfIncident": "01/01/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448904,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Smells like engine coolant when exiting vehicle",
        "vin": "4T1L11AK5LU"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/27/2021",
        "dateOfIncident": "12/27/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445093,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Dead battery at 21000 miles. Car is less than 2 years old and didn't drive it for 36 hours and the battery completely drained. Even after jump start electronic dash wouldn't function properly.",
        "vin": "4t1e31ak0lu"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/11/2021",
        "dateOfIncident": "07/26/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440147,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The component or system that failed and malfunctioned, is the air conditioning drain hose that leaked water into the bottom of the inside of the car, causing extensive damage to the rugs, padding, soundproof insulation, and damage to the metal frame of the bottom of the car. Corrosion of the electrical system. The safety was at risk due to the sickening mildew swampy odor coming from inside the car from an accumulation of stagnant water. It caused me headaches, sinus infections, and aggravated my asthma. Yes, Toyota dealership and SERV PRO and independent lab. Yes, the vehicle component has been inspected by the Insurance company and dealership and SERV PRO, and independent Lab. Yes, there were warnings and symptoms of the problem which appeared less than a year after the new 2020 Toyota camry was bought.",
        "vin": "4T1L11AK9LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/19/2021",
        "dateOfIncident": "10/17/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437350,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Battery keeps draining with no warning.  Has left me stranded multiple times. I have had the battery checked & it is fine. Nothing was left on in the vehicle.",
        "vin": "4t1g11akxlu"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/18/2021",
        "dateOfIncident": "10/16/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437129,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Toyota Camry. The contact stated that while her vehicle was parked in her driveway, the rear windshield imploded without incident. The contact called the dealer and was offered no immediate assistance. The manufacturer was also notified of the failure. Due to a lack of space at the dealer, the contact had to wait two days before the vehicle was towed to the dealer. The contact believed that the blind spot sensor and the rear defroster had caused the failure. The vehicle had yet to be repaired and remained in the possession of the dealer. The failure mileage was 35,871",
        "vin": "4t1k61ak6lu"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/14/2021",
        "dateOfIncident": "09/15/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436788,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Toyota Camry. The contact stated while pulling out of the driveway, the accelerator pedal was depressed however, the vehicle failed to respond. There were no warning lights illuminated. The contact stated she depressed the accelerator pedal several times until the vehicle responded. The vehicle was not diagnosed nor repaired. The contact stated that the failure recurred while she was stopped at a stoplight. The vehicle was taken to the dealer who test drove the vehicle but could not determine the cause of the failure. The manufacturer was not notified of the failure. The vehicle was not repaired. The approximate failure mileage was 11,000.",
        "vin": "4T1C11AK2LU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/05/2021",
        "dateOfIncident": "10/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435635,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving vehicle, all of a sudden, the vehicle will slow down, lose power, even while using cruise control set to a specific speed. It will hesitate and driver, will feel car, slow and jolt forward.this occurs all the time while driving, especially if vehicle is warmed up.",
        "vin": "4T1C11AK2LU"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/07/2021",
        "dateOfIncident": "01/06/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431906,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "When I press the button to start my 2020 Camry it has difficulty starting. It chugs/lags. It also smells of coolant/antifreeze when this happens. It has done this since the day I leased it. I have taken the vehicle back to the dealership 3 times and each time I’m told that they hooked it up to their computer and can’t find anything wrong and they can’t replicate the problem. I have had several witnesses/passengers inside and outside my vehicle who have heard the starting issue and commented on coolant smell. To date, my vehicle only has 7000 miles on it.",
        "vin": "4t1f11akxlu"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/07/2021",
        "dateOfIncident": "01/12/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431978,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I purchased this vehicle on 01/12/2021 from Toyota of Greenville, SC.   I was initially told that the vehicle was a Certified Pre-Owned Toyota, which means it went through an intensive reconditioning process and passed all certification requirements. As I was signing the papers to purchase the car, I was told that it could not be sold as a Certified vehicle because it has the open manufacturer recall #20TA02.   It has been almost 9 months and I have not received any notice of a pending fix for this potentially deadly recall, summarized below.   SUMMARY: The subject vehicles are equipped with a low-pressure fuel pump which may stop operating. If this were to occur, warning lights and messages may be displayed on the instrument panel, and the engine may run rough. This may result in a vehicle stall, and the vehicle may be unable to be restarted. SAFETY RISK: If a vehicle stall occurs while driving at higher speeds, this could increase the risk of a crash. REMEDY: Any authorized Toyota dealer will replace the low-pressure fuel pump with an improved one FREE OF CHARGE.  I am hesitant to take the vehicle on a long trip or take it on the highway. I do not want to be stranded during my trip or die if the fuel pump shuts off at high speed. I have been purchasing Toyota products since 2000. I am feeling very abused and and neglected buy what I thought was a safe and reliable brand. I will be in the market for another vehicle soon. Now, I am not sure Toyota is the only brand to consider. Please let them know that I am not a happy customer because of this ongoing problem with their Number 1 Selling vehicle.   [XXX]  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "4t1c11ak0lu"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/03/2021",
        "dateOfIncident": "09/03/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431674,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Wiper speed on high is to slow to see in moderate rain. Zero Visibility, make for a very dangerous situation.",
        "vin": "4t1g11ak2lu"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/28/2021",
        "dateOfIncident": "08/28/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430831,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "First time went to get in my vehicle and the car would not even open, not even the trunk. Had been parked over night. The car was deader than a door nail. The Toyota dealer had a tow truck dispatched to me with a charge box. The charge box would not even crank the vehicle. Had to use his tow truck to jump the car took to Toyota they said it needed a software update. Did it seemed fine now fast forward several months later now when it cranks doesn’t want to crank, dies then have to try again finally it crank. Took in today at dealer they tested battery said it’s showing 100% testing so not the battery then they say the update didn’t take back months ago so needs to be updated again . So now I’ve been shuttled home as it will take 2 plus hours. I’ve googled and seen so many complaints that are identical to mine and wondering why my vehicle has no recall when my vehicle has same issues apparently or I’m being lied to by the dealer cause I’ve got a complete lemon. I’ve owned many Toyota’s and never once had issues like this.",
        "vin": "4T1C11AKXLU"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/19/2021",
        "dateOfIncident": "08/16/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429779,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "As I was driving Monday morning August 16 2021, Check engine light and chip failure light showed up. When shifting the vehicle in reverse, but it showed in drive. Took the car to Toyota dealer, and diagnosis reveals \"Vehicle has green death in connections to shift indicator. This problem costing $4,585.25 to fix the problem.",
        "vin": "4T1G11AKXLU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/26/2021",
        "dateOfIncident": "07/15/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426438,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "While opening the trunk from either the key fob or inside button release on the dash, the trunk lid flies open at high speed and hits the rear window of the car. It appears it's either a shock dampener failure or lack of one. I entered the date it occurred as the date I purchased the car.",
        "vin": "4T1G11AK1LU"
    },
    {
        "components": "VISIBILITY,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/07/2021",
        "dateOfIncident": "06/30/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423745,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I have replaced my windshield 4 times in a 16 month period. Every time I replace it something very small like a pebble or a big bug hits it and it cracks extremely easy. Once I was cleaning my windshield and lifted the wiper up about 3\" and then when I was through I just let it go and it cracked the windshield. I have owned several vehicles and I have never seen a windshield so brittle. Out of the 16 months of owning this car I have only driven it with a non cracked windshield for about 30 days.",
        "vin": "4T1G11AK0LU"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/17/2021",
        "dateOfIncident": "05/29/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421273,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving down the road and heard a loud explosion. It sounded like it came from the moonroof. I opened the sunshade and saw that the entire front section of the panaramic moonroof had exploded for no apparent reason.   48°F, overcast, no bridges, no trees, no vehicles in front of me, no flying debris. Car is 6 months old and has 6500 miles on it.  I went to the nearest auto store and bought duct tape to secure the remaining glass and then drove to the nearest Toyota dealer.",
        "vin": "4T1F11BKXLU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/11/2021",
        "dateOfIncident": "05/09/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416078,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE GOING UP A HILL WITH A RIGHT HAND CURVE AT ABOUT 50 MPH I HEARD A LOUD NOISE THAT SOUNDED LIKE TWO PIECES OF METAL COMING TOGETHER.  AT THE TIME I HAD NO IDEA WHAT CAUSED THE NOISE BUT THOUGHT MAYBE I RAN OVER A PIECE OF METAL THAT THE THE WHEEL THREW UP.  I TOOK THE CAR TO THE DEALER AND THEY CHECKED THE UNDER SIDE AND TOLD THERE WAS NO SIGN OF ANY DAMAGE THAT MIGHT HAVE BEEN DONE.  I HAVE ALL WHEEL DRIVE AND THE NOISE WAS SO MECHANICAL I NOW THINK THE DRIVE WHEEL WAS CHANGING AND AND IT HAD AN OUT OF SYNC CONNECTION WHICH RESULTED IN THE LOUD NOISE.   THE VEHICLE WAS IN MOTION, ON A PAVED HIGHWAY, GOING UP A HILL THAT HAD A RIGHT HAND CURVE, I WAS STEERING  THROUGH THE CURVE AT ABOUT 50 MPH.  I DO NOT KNOW THE EXACT CAUSE OF THE LOUD NOISE BUT BELIEVE IT INVOLVED THE ALL WHEEL DRIVE FEATURE.5/9/2021",
        "vin": "4T1C11BK5LU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/26/2021",
        "dateOfIncident": "04/02/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413882,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "COOLANT SMELL COMING FROM ENGINE.",
        "vin": "4T1G11AK9LU"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/24/2021",
        "dateOfIncident": "04/24/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413665,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER 2 DAYS PARKED IN GARAGE WITH LIGHTS OFF AND DOORS CLOSED THE CAR WOULDN'T START. AFTER JUMP STARING THE CAR IN THE SCREEN IN THE DASHBOARD A VIDEO WAS PLAYING STATING THAT AN ELECTRONIC BOARD IS AFFECTING THE ENGINE AND TRANSMISSION. THE CAR HAS JUST 15,500 MILES. IN MARCH 2020 THE SAME HAPPEN. DEALER SAID WAS FIXED. I TALKED TO TOYOTA (JEFFREY) COMPANY AND HE SAID THERE IS NO RECALL OR SOFTWARE UPGRADE.",
        "vin": "4T1E31AK7LU"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/14/2021",
        "dateOfIncident": "04/12/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408027,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 TOYOTA CAMRY. THE CONTACT STATED WHILE THE VEHICLE WAS STATIONARY, THE DRIVER SIDE SEAT BELT WOULD NOT LATCH SECURELY. THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS NOT TAKEN TO A LOCAL DEALER OR INDEPENDENT MECHANIC TO BE DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER HAD NOT BEEN INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 1,000.",
        "vin": "4T1G31AK0LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/07/2021",
        "dateOfIncident": "04/03/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406838,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 TOYOTA CAMRY. THE CONTACT STATED THE BATTERY BECAME INOPERABLE. THE VEHICLE WAS TOWED TO TOYOTA OF NASHUA (10 MARMON DR, NASHUA, NH 03060, (603) 689-1500) TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE VEHICLE WAS NOT DRIVEN ENOUGH WHICH CAUSED THE BATTERY DRAINAGE. THE CONTACT WAS INFORMED TO USE A TRICKLE CHARGER BETWEEN USE OF THE VEHICLE TO KEEP THE BATTERY FULLY CHARGED ALWAYS. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE FAILURE MILEAGE WAS 2,000.",
        "vin": "4T1F11AK7LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/01/2021",
        "dateOfIncident": "03/31/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406046,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR BATTERY WON'T HOLD A CHARGE KEEPS GOING DEAD. DEALER CLAIM THEY CAN'T FIND NOTHING WRONG. CAR SIT PARKED, LIKE SOMETHING IS DRAWN POWER WHILE CAR IS OFF.",
        "vin": "4T1KZ1AK0LU"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/16/2021",
        "dateOfIncident": "03/14/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403255,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TWICE RECENTLY 2020 TOYOTA CAMRY WITH LESS THAN 8,000 MILES ON IT WOULD NOT START AFTER BEING PARKED IN A GARAGE.  IN BOTH CASES, WE CHARGED THE BATTERY AND CAR STARTED RIGHT AWAY.  NO DOORS WERE LEFT OPEN, NO LIGHTS ON, ETC.  WHAT IS CAUSING THE BATTERY TO DRAIN AFTER A DAY OR TWO NOT BEING DRIVEN?  MY OLDER TOYOTA WITH 150,000 IS MORE RELIABLE, SADLY.  HAVE READ ABOUT A BATTERY DRAIN ISSUE WITH THIS CAR, BUT TOYOTA   CUSTOMER SERVICE SAYS MY VIN NUMBER IS NOT PART OF THE RECALL.  SEEMS LIKE I AM NOT THE ONLY ONE WITH THIS PROBLEM.  TAKING TO DEALERSHIP THIS WEEK TO SEE IF PROBLEM CAN BE IDENTIFIED.",
        "vin": "4T1C31AK2LU"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/12/2021",
        "dateOfIncident": "12/28/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402640,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 TOYOTA CAMRY. THE CONTACT STATED THAT THERE WAS FUEL LEAKING FROM THE FUEL CAP. THE CONTACT TOOK THE VEHICLE TO BRADLEY FORD OF LAKE HAVASU CITY (1690 INDUSTRIAL BLVD, LAKE HAVASU CITY, AZ 86403, (928) 855-1191) HOWEVER, THE MECHANIC WAS UNABLE TO LOCATE THE CAUSE OF THE FAILURE. THE CONTACT STATED THE FAILURE PERSISTED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 2,000.",
        "vin": "4T1F31AK5LU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/11/2021",
        "dateOfIncident": "03/10/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400304,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR IS ACTING FUNNY WITH FUEL LEVELS. FUEL LEVELS ARE READING WRONG AND CAR IS EFFECTED BY FUEL PUMP.THERE IS A RECALL FOR ISSUE BUT CAN'T GET A SECOND NOTICE TO RESOLVE ISSUE",
        "vin": "4T1A11AK0LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/07/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399562,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEMS WITH THE DEAD BATTERY ' DRAINING. I BOUGHT THE CAR IN JULY 2020. IT HAS BEEN 2 TIMES I'VE HAD TO CALL ROADSIDE ASSISTANCE BECAUSE MY CAR WAS COMPLETELY DEAD. FIRST TIME, THEY SAID IT WAS BECAUSE THE CAR WAS PARKED AT THE DEALERSHIP WITH NO USE. SECOND TIME, THEY SAID IT WAS BECAUSE MY CAR HAS LOW MILES SINCE I'VE BOUGHT IT. I WANTED TO BUY A NEW CAR TO NOT GO THROUGH \"ISSUES\" AND I SHOULD NOT BE FORCED TO DRIVE MY CAR MORE THAN WHAT I NEED TO, NOR I SHOULD HAVE TO BUY A TRICKLE CHARGER THE TECH SERVICE GUY RECOMMENDED ME TO BUY AND FOLLOW HIS INSTRUCTIONS ON HAVING TO DRIVE AT LEAST 30 MINUTES TWICE A WEEK, WHEN I ALREADY DRIVE IT TO WORK EVERYDAY. NOW I AM AFFRAID TO DRIVE MY CAR, WORRIED THAT IT WON'T WORK AT ANY GIVEN MOMENT. WHAT SHOULD YOU EXPECT WHEN THEY TELL YOU \"I CANNOT GARANTEE THIS WON'T HAPPEND AGAIN IN 6 OR 7 MONTHS\"?. VERY DISAPPOINTED.  I THEN, STARTED DOING RESAERCH ON MY OWN ONLINE AND FOUND OUT THAT THERE ARE A LOT OF PEOPLE EXPERIENCING THE SAME PROBLEM.",
        "vin": "4T1K61AK3LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/03/2021",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398907,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT LEASED A 2020 TOYOTA CAMRY. THE CONTACT STATED THAT THE VEHICLE WOULD NOT START SPORADICALLY AND REQUIRED A JUMP START. THE CONTACT TOOK THE VEHICLE TO BOCH TOYOTA (277 PROVIDENCE HWY, NORWOOD, MA 02062) WHERE IT WAS DIAGNOSED AS A PARASITIC DRAIN IN THE BATTERY FROM THE COMPUTER DEMAND OVERLOAD. THE DEALER INFORMED THE CONTACT THAT THE REMEDY OPTIONS WERE TO DRIVE THE VEHICLE FOR HALF AN HOUR TWICE A WEEK, REPLACE THE BATTERY, OR SIGN A NEW 36 MONTH LEASE FOR A NEW VEHICLE. THE CONTACT STATED SHE COULD NOT SIGN A NEW 36 MONTH LEASE AND SHOULD NOT BE PENALIZED FOR THE MANUFACTURER DEFECT FAILURE OF THE VEHICLE. THE FAILURE RECURRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 1,224.",
        "vin": "4T1L11AK4LU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/02/2021",
        "dateOfIncident": "01/05/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398684,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I LEASED THIS VEHICLE IN JULY 2020 FOR 24  MONTHS,  THE BATTERY IS NOT DEPENDABLE; FREQUENTLY, AT RANDOM TIMES, THE CAR WON'T START.. I HAVE HAD TO CALL FOR ASSISTANCE 6 TIMES.  TOYOTA EXPLAINED THAT THE BATTERY HAS A DEFECT CALLED PARASITIC DRAIN BECAUSE OF OVERLOAD FROM 40 COMPUTERS AND ONLY SOLUTION IS TO DRIVE AT LEAST 1/2 HOUR TWICE A WEEK.  I AM 88 YEARS OLD WITH MACULA DEGENERATION AND CONSIDER THIS AN UNSAFE REQUIREMENT. TOYOTA SUGGESTED BUYING A NEW BATTERY BUT IF, AS STATED BY THE MECHANIC, THE BATTERY IS GETTING CONTINUOUSLY DRAINED BY OVERLOAD, THAT MAKES NO SENSE,  I ASKED IF THEY COULD BLOCK OFF SOME OF THE DRAINAGE (LIKE BLUETOOTH) THEY SAID NOT THIS MODEL.I COMPLAINED THAT I WASN'T INFORMED OF THIS DEFECT BEFORE BUYING AND THEY EXPLAINED IT WAS IN THE MANUEL WHICH I DIDN'T RECEIVE UNTIL I SIGNED  THE AGREEMENT.",
        "vin": "4T1L11AK4LU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/24/2021",
        "dateOfIncident": "02/23/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397660,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "HAPPENED TWICE SITTING IN TRAFFIC WAITING FOR RED LIGHT AND CAR IN NEUTRAL GEAR, CAR STARTED TO FEEL ITS GOING TO STALL WHICH APPEAR FLUCTUATED RPM AND VIBRATION. ALSO, RANDOMLY WHEN START THE ENGINE IT FEELS THE ENGINE HAS A BIT TROUBLE TO IGNITE FROM IT MIGHT BE A COLD START IN THE MORNING OR ANY TIME OF THE DAY.",
        "vin": "4T1K61AK8LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/23/2021",
        "dateOfIncident": "02/17/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397508,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD PARKED MY CAR IN MY APARTMENT PARKING LOT AND HADN'T DRIVEN FOR TWO DAYS DUE TO INCLEMENT WEATHER (SNOW STORM). ON THE THIRD DAY, UPON APPROACHING MY VEHICLE I OBSERVED THE FOLLOWING:  1. THE CAR WOULDN'T UNLOCK THROUGH MY KEY FOB. HAD TO MANUALLY UNLOCK IT.  2. UPON ENTERING AND PRESSING THE START BUTTON, THE MID WAS FLICKERING WITH ERROR MESSAGES SUCH AS (A) KEY FOB NOT DETECTED (B) EPB DISENGAGED.  3. THE BATTERY SEEMED DEAD, NONE OF THE ELECTRICALS AND ELECTRONIC RESPONDED. I UNDERSTOOD THE BATTERY WAS DEAD (STRANGE FOR A NEW CAR BOUGHT 5 MONTHS AGO).   4. I JUMP STARTED SUCCESSFULLY USING MY OLDER CAR WHICH DOESN'T RUN TOO OFTEN, YET COLD STARTS PRETTY GOOD.    NO ACCESSORIES/LIGHTS WERE LEFT ON DURING THE TWO DAYS THE CAR WAS STATIONARY.",
        "vin": "4T1K61AK1LU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/17/2021",
        "dateOfIncident": "01/04/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396605,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER A FEW MONTHS OF PURCHASING THE VEHICLE I HAD A HORRIBLE SMELL IN THE VEHICLE AND AFTER INVESTIGATING THERE WAS WATER POOLING IN THE BACK PASSENGER SEAT UNDER THE WEATHERTEC FLOOR MAT. THERE HAD BEEN A FEW DAYS OF RAIN BEFORE THIS.THIS HAPPENED AGAIN AFTER A FEW WEEKS AND BECAUSE OF THE WEATHER THE WATER UNDER THE MATT IN THE BACK SEAT WAS FROZEN. THERE HAD BEEN SNOW IN MY AREA AT THIS TIME ALSO. THE DEALERSHIP SAYS THAT THEY CAN NOT DUPLICATE IT AND NOW THEY ARE HOLDING ME RESPONSIBLE FOR IT.",
        "vin": "4T1KZ1AK9LU"
    },
    {
        "components": "STEERING,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/15/2021",
        "dateOfIncident": "02/15/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396235,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I CANT LOCATE MY VEHICLE. WAITNING ON SOMEONE TO SEND TITLE",
        "vin": "4T1G11AKXLU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/11/2021",
        "dateOfIncident": "02/11/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395709,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA ADVERTISES AND REPRESENTS THAT THE 2020 CAMRY SE FUEL TANK CAPACITY IS 16 GALLONS, AND BASED ON ITS 28CITY/39HWY MPG RATING, THE CAMRY'S RANGE SHOULD BE 448/624 MILES. HOWEVER, MY CAR ON A FULL TANK REPORTS 385 MILES TO EMPTY. TOYOTA RAN TESTS AND STATED I GET 30MPG. IF THIS IS TRUE MY GAS TANK IS ONLY SUPPORTING ABOUT 13 GALLONS OF GAS. TOYOTA HAS ALREADY IDENTIFIED THIS AS AN ISSUE IN THEIR 2019/2020 HYBRID MODELS.",
        "vin": "4T1G11AK8LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/01/2021",
        "dateOfIncident": "06/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390973,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASE A BRAND NEW 2020 TOYOTA CAMRY MARCH 2020. ON JUNE 15, 2020 MY VEHICLE WAS PARKED IN MY DRIVEWAY AND WOULDN'T START AND HAD TO BE TOWED TO THE DEALERSHIP. THE DOORS WOULD NOT LOCK AND MY DASHBOARD DISPLAYED A MALFUNCTIONING SYSTEM PARKING BRAKE DISABLED. MY CAR REMAIN AT THE DEALERSHIP FOR 4 DAYS. ON JUNE 19 I PICKED UP MY VEHICLE. THE TOYOTA TECHNICIAN STATED THE BATTERY WAS GOOD AFTER PERFORMING A BATTERY TEST USING TOYOTA DCA8000 TEST.  THE  TECHNICIAN  PERFORMED AN UPDATE TELEMATICS MODULE I9I-13 DCM TO LATEST FIRMWARE TO SOFTWARE VERSION HIGH AT LG-N010FFB AND SOFTWARE VERSION LOW AT CBC-98 OR CBC-34  AS APPLICABLE DEALER TECHSTREAM  DIAGNOSTIC TOOL.   OK THIS WAS SUPPOSE TO BE THE FIX TO MY PROBLEM. ON AUG 19 THE SAME ISSUE HAPPENED AGAIN. AGAIN I HAD MY CAR TOWED TO THE SAME DEALERSHIP. AFTER A SERIES OF TEST THEY STATED IT WAS THE BATTERY, SO THEY REPLACED THE BATTERY WITH A NEW BATTERY. I DIDN'T UNDERSTAND HOW IT COULD BE THE BATTERY WHEN THIS IS A BRAND NEW CAR WITH LESS THAN 12,000 MILES ON THE VEHICLE. . ON JAN 25, 2021 MY VEHICLE WAS PARKED IN MY DRIVEWAY AND MY CAR WOULD START. THE RADIO CAME ON , THE LIGHTS WERE WORKING BUT THE CAR WOULDN'T START, THE STEERING WHEEL WOULDN'T MOVE AND THE CAR WOULDN'T GO INTO NEUTRAL. I HAD MY CAR TOWED TO MY DEALERSHIP AGAIN.  TECHNICIAN ADVISE THE NEXT DAY HAD  PERFORM A DCM RESET AND FIRMWARE UPDATE FOR DRAINING BATTERIES TO THE 2020 CAMRY. THIS VEHICLE HAS NOT PERFORM TO THE STANDARDS I EXPECTED SINCE DAY OF PURCHASE MARCH 2020.  STATE OF GEORGIA WILL NOT ALLOW YOU TO SUBMIT A LEMON LAW CLAIM  BECAUSE VEHICLE WAS NOT OUT OF COMMISSION FOR 30 DAYS TOTAL. I AM A VERY UPSET CUSTOMER AND WILL CONTINUE TO FILE COMPLAINTS WITH TOYOTA HEADQUARTERS AND POSSIBLY SEEK ME A A CONSUMER ATTORNEY. AS MUCH AS I AM PAYING FOR MY VEHICLE I SHOULDN'T HAVE TO CONTINUE TO WAIT AROUND FOR TOYOTA TO GET  THIS PROBLEM CORRECT.",
        "vin": "4T1KZ1AK2LU"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "01/22/2021",
        "dateOfIncident": "01/22/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389436,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A NEW TOYOTA CAMRY 2020 SE ON OCTOBER 2020 FROM TOYOTA DOWNTOWN LOS ANGELES LESS THAN 3 MONTHS LATER. I'VE ONLY DRIVEN IT 800MILES. TODAY AS I WAS DRIVING TO WORK I NOTICED THAT I HAD TO PRESS ON THE BREAK HARDER THAN USUAL. ALSO IT LAGS WHEN STARTING UP.",
        "vin": "4T1M11AK4LU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/20/2021",
        "dateOfIncident": "01/18/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388979,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS A RECALL AND DEALER WOULD NOT FIX IT WENT TO TWO DEALER SHIPS NOW AND THEY ARE DENYING THAT MY CAR HAS A RECALL I GUESS I WILL JUST WAIT TILL MY CAR CATCHES FIRE AND THEN AND EXPLODE SO I CAN FILE A LAWSUIT",
        "vin": "4T1C11AK3LU"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/03/2021",
        "dateOfIncident": "01/02/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386310,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY CAMRY IN OCTOBER. WHEN STARTING IT UP IN THE MORNING FOR THE PAST FEW WEEKS THERE WAS A SLIGHT HESITATION. I ATTRIBUTED THE ISSUE TO THE COLD TEMPERATURES AND ALLOWED THE CAR TO WARM UP BEFORE DRIVING. YESTERDAY AFTERNOON MY CAR WOULDN'T START AT ALL. IT MAKES A CLICKING AND RATTLING NOISE SIMILAR TO AN OLD CLUNKER. I WAS PARKED IN THE PARKING LOT OF MY APARTMENT COMPLEX. I CALLED THE BROWN'S TOYOTA DEALERSHIP WHERE I PURCHASED THE VEHICLE AND WAS TOLD TO CONTACT ROADSIDE ASSISTANCE TO HAVE THE CAR TOWED THERE. THEY WERE CLOSING AT 4P AND WOULD NOT BE ABLE TO CHECK OUT THE CAR UNTIL MONDAY. THEY ALSO INFORMED ME THAT I WOULD HAVE TO PAY FOR A LOANER CAR UPFRONT AND BE REIMBURSED IF IT WAS DETERMINED THAT I DIDN'T CAUSE THE CAR NOT TO START. SO RIDICULOUS. I SHOULDN'T HAVE THIS ISSUE WITH A BRAND NEW CAR. FROM THE LOOKS OF IT READING THROUGH THESE OTHER REPORTS THERE'S A SERIOUS ISSUE WITH THE 2020 TOYOTA CAMRY.",
        "vin": "4T1C11AKXLU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/17/2020",
        "dateOfIncident": "11/11/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384001,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY DISCHARGES EVERY 7 TO 10 DAYS ITSELF.  DEALERSHIP CHECKED SAID EVERYTHING OK. BUT CAN'T TELL WHY BATTERY GOES DEAD AL THE TIME.",
        "vin": "4T1C11AK5LU"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/08/2020",
        "dateOfIncident": "12/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378473,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "SMELL OF COOLANT AND ENGINE JERKS AND BRAKES GO DOWN FAR ON BRAND NEW CAR",
        "vin": "4T1G11AK4LU"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/08/2020",
        "dateOfIncident": "12/02/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378475,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE JERKS. BRAKES GO DOWN FAR.  ENGINE SMELLS OF COOLANT.  BRAND NEW CAR",
        "vin": "4T1G11AK4LU"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/08/2020",
        "dateOfIncident": "12/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378476,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE SMELLS OF COOLANT. ENGINE JERKS BRAKES GO DOWN FAR. BRAND NEW CAR",
        "vin": "4T1G11AK4LU"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/02/2020",
        "dateOfIncident": "10/12/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377498,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WOULD NOT START AFTER NOT USING THE VEHICLE FOR 2 DAYS. THE DASHBOARD LIT UP LIKE A CHRISTMAS TREE/FLASHING NOTICE THAT SAID SMART KEY FAB MALFUNCTION. MY CAR WOULD NOT START COMPLETELY DEAD. CALLED ROADSIDE ASSISTANCE THEY TOLD ME TO HOLD THE KEY FAB TO THE START BUTTON AND TRY TO START THE CAR. WHICH DID NOT START. THEY WERE GOING TO SEND A TOW TRUCK TO GIVE ME A JUMP.  MY CAR STARTED FINE WITH THE JUMP. I TOOK MY AR TO WOLF CHASE TOYOTA. THEY TOLD ME THEY WOULD LOOK AT MY CAR WHICH THEY DID NOT AFTER BEGINNING THERE OVER 6 HRS DID NOT OFFER ME A LOANER VEHICLE.  I TOOK MY CAR TO AUTO ZONE HAD THEM CHECK MY BATTERY NO ISSUES FOUND ALSO HAD THE BATTERY IN KEY FAB CHECKED. ABOUT 2 WEEKS LATER THE SAME THING HAPPENED AGAIN. I GOT A JUMP AGAIN EVERYTHING WAS OK. MY CAR IS WITH CHUCK HUTTO TOYOTA NOW THEY ARE TRYING TO SEE WHAT THE PROBLEM IS WITH MY THEY DID PROVIDE ME WITH A LOANER CAR. ALSO CHECKING FOR POWER DECEASE WHEN I TRY TO ACCELERATE .",
        "vin": "4T1K61AK4LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/25/2020",
        "dateOfIncident": "11/25/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376390,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED MY 2020 TOYOTA CAMRY IN OCTOBER 2020. IN NOVEMBER 23, 2020, I LEFT MY CAR IN THE DRIVEWAY. ON NOVEMBER 25, 2020, I ATTEMPTED TO TURN ON MY CAR, BUT ONLY RECEIVED THE FLICKERING OF LIGHTS INSIDE THE CAR. THE CAR WOULD NEVER START. UPON GETTING OUT OF THE CAR, THE CAR BEEPED 6 TIMES. WHEN I WENT BACK TO CHECK THE CAR FOR ANY CHANGES, NOTHING WOULD COME ON AT ALL. WILL BE CALLING DEALERSHIP AND ROAD SHIP ASSISTANCE AFTER THANKSGIVING.",
        "vin": "4T1M11AK7LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/23/2020",
        "dateOfIncident": "11/21/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375874,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY DIED MY NEW 2020 TOYOTA CAMRY HAS 2800 MI'S. TRIPLE A SAID IT WAS A DEFECTIVE BATTERY AND COULDN'T BE REPAIRED.  . A GRAAGE SAID ITS A RAMPANT PROBLEM WITH 2020 TOYOTAS  ON LINE SITES  SITES SAY ITS A DEEP ELECTRICAL PROBLEM.  I  HAD IT TOWED TO DEALER WHO SAID IT WAS THE SOS BUTTON ON CEILING MALFUNCTIONING  THEY SAID THE BATTERY WASN'T DAMAGED.  THERE IS A LOT ON THE WEB SAYING THIS IS A MAJOR ELECTRICAL PROBLEM WITH   2020 TOYOTA'S?  I WILL PICK UP AND KEEP PAPERWORK IN CASE YOU NEED IT..",
        "vin": "4T1C11AK8LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/20/2020",
        "dateOfIncident": "11/20/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375675,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THIS CAR 10/03/2020 WITH 76 MILES ON THE ODOMETER IT WAS MANUFACTURERED 05/20/2020 TODAY IS 11/20/2020 WENT OUT TO START MY CAR IT STARTED CLICKING AND WON'T START HAS LIGHTS FLICKERING RANDOMLY HAD IT TOWED TO TOYOTA IT HAS 1,700 MILES ON IT . HAD DROVE THE CAR THE DAY BEFORE AND IT SEEMED FINE. THE GAS MILEAGE FOR THE FIRST 2 TANKS WAS 48 MPG THE LAST TANK WAS 41 MPG. THE CARS BATTERY DRAINED OVER NIGHT ABOUT 12 HOURS AND NO LIGHTS WERE LEFT ON OR DOORS OPEN.",
        "vin": "4T1C31AK8LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/19/2020",
        "dateOfIncident": "11/02/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375443,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "UNEXPECTEDLY, MY CAR'S 12V BATTERY DISCHARGED COMPLETELY UNDER CONDITIONS OF REGULAR USE AND MODERATE TEMPERATURES, WHILE PARKED IN MY GARAGE OVERNIGHT. CAR IS 11 MONTHS OLD WITH 6327 MILES. IT WAS TOWED TO TOYOTA REPAIR SHOP, WHICH RE-CHARGED THE BATTERY AND INSTALLED DCM RESET AND FIRMWARE UPDATE T-SB-0095-20. THE REPAIR REPRESENTATIVE REFERRED TO POSSIBLE PROBLEM WITH A RECENT AUTO SOFTWARE UPDATE THAT MAY HAVE WORN DOWN BATTERY WITH NUMEROUS INCOMPLETE (UNINITIATED) IGNITION STARTS. THIS SOFTWARE FIX WAS APPLIED FOR THIS SPECIFIC INSTANCE, BUT IS NOT BEING GENERALLY APPLIED TO ALL VEHICLES. THE REPRESENTATIVE SAID THAT THE PROBLEM WAS NOT CAUSED BY ANYTHING I DID, AND INDICATED I MAY WANT TO WATCH FOR TOYOTA CONSUMER NOTICES FOR FURTHER REPAIR. THE TOYOTA TECHNICAL SERVICE BULLETIN, DCM RESET AND FIRMWARE UPDATE T-SB-0095-20 (DATED SEPTEMBER 30, 2020, ACCESSIBLE ONLINE), INDICATES SOME 2020-2021 MODELS MAY EXHIBIT \"DEPLETED 12V VEHICLE BATTERY WHEN IN IG-OFF\".  THE SOFTWARE UPDATE IS NOT BEING APPLIED TO ALL VEHICLES, AND THERE WAS NO ASSURANCE THAT THE PROBLEM IS FIXED AND WILL NOT OCCUR AGAIN. AS A DRIVER, THIS LEAVES ME VULNERABLE TO BEING STRANDED WITHOUT TRANSPORTATION, AND RELIANT ON HELP FROM STRANGERS IF PARKED IN REMOTE RECREATION AREAS WITHOUT CELL PHONE ACCESS; AN UNSAFE SITUATION.",
        "vin": "4T1F31AK1LU"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/17/2020",
        "dateOfIncident": "11/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375003,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WOULD NOT START, 25,000 .  HYBRID MALFUNCTION WARNING, OCS WARMING, PRE-COLLISION WARNING, BRAKE SYSTEM WARNING.  DEALER CLAIMED SOFTWARE UPDATE ISSUE.  HAD TO BE TOWED, LATE TO WORK URGENT CARE/COVID, UBER TO DEALER TO GET LOANER, UPSET.  FRIDAY IT HAPPENED AGAIN AND I HAD SURGERY SCHEDULED.  HYBRID MALFUNCTION WARNING PRE-COLLISION WARNING, DO NOT DRIVE, CALL DEALER,  TOW TRUCK TESTED BATTERY AND IT WAS GOOD.  LIGHTS, BELLS, STEREO WORKED, HELD KEY FOB TO PUSH START NO.  40,000 CAR AND DEALER TODAY SAID, OH, WE PUT IN A NEW BATTERY?  IN A NEW CAR?  AND FOR IT TO NOT START DUE TO SOFTWARE UPDATE???? I GO 100 OUT OF CITY WITH DOGS, NO CELL AND WOULD HAVE BEEN STRANDED IN A BRAND NEW CAR DUE TO NO NOTIFICATION OF HEY THERE ARE PROBLEMS, YOUR CAR WONT START, SOFTWARE UPDATE?  ANYTHING?  SECOND TIME 6 WEEKS LATER, MISSED MY SURGERY APPT!!!!!!!!   TOW IT AGAIN, THEY NOW SAY THAT TOYOTA HAS FIXED ON 2021 AND DEALER HAD LIST OF VEHICLES WITH ISSUES BY VIN.  GREAT.  WHY NOT TELL ME.  ONE MORE LEMON LAW WISCONSIN.  I DON'T EVEN WANT TO GO PICK IT UP.  ITS GOING TO HAPPEN AGAIN.  I THINK IT IS ELECTRICAL, STARTER, HYBRID.  BYW WHY NOT REPLACE HYBRID BATTERY?  BECAUSE THEY ARE TOO EXPENSIVE.  THERE ARE RECALLS FOR 2020 COMPLETE ENGINES.  I WANT IT GONE.  IT WAS PARKED IN MY DRIVEWAY WOULD NOT START AT CRITICAL TIMES.  I DO NOT FEEL SAFE IN IT, BRAKE MALFUNCTION WARNING?  PRE CRASH WARNING, HYBRID?",
        "vin": "4T1F31AK2LU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/12/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374376,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 TOYOTA CAMRY. THE CONTACT STATED THAT WHILE APPROACHING A TRAFFIC LIGHT, THE BRAKE PEDAL WAS DEPRESSED AND AN ABNORMAL SOUND WAS HEARD. THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER STADIUM TOYOTA (5088 N DALE MABRY HWY, TAMPA, FL 33614, (813) 872-4881), TOYOTA OF TAMPA BAY (1101 E FLETCHER AVE, TAMPA, FL 33612, (813) 402-1323) AND WESLEY CHAPEL TOYOTA (5300 EAGLESTON BLVD, WESLEY CHAPEL, FL 33544, (813) 703-1759) HOWEVER, THE MECHANICS WERE UNABLE TO DUPLICATE THE FAILURE. THE FAILURE RECURRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 5,000.",
        "vin": "4T1F11AK8LU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/09/2020",
        "dateOfIncident": "11/08/2020",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373822,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2020 TOYOTA CAMRY. THE CONTACT STATED WHILE DRIVING AT 65 MPH, WHEN ANOTHER DRIVER INFORMED HIM THE VEHICLE HAD SMOKE EXITING UNDER OF THE VEHICLE. THE CONTACT STATED THE CHECK ENGINE WARNING LIGHT ILLUMINATED. THE CONTACT WAS ABLE TO PARK THE VEHICLE ON THE SIDE OF THE ROAD. THE CONTACT STATED HE SAW FIRE UNDER THE VEHICLE AND IT WAS COVERED IN SMOKE RAPIDLY. THE FIRE DEPARTMENT WAS ABLE TO EXTINGUISHED THE FIRE. A FIRE AND POLICE REPORT WERE FILED. THE CONTACT STATED NO ONE WAS INJURED OR SOUGHT MEDICAL ATTENTION. THE VEHICLE WAS NOT DRIVABLE. THE INSURANCE ADJUSTER DEEMED THE VEHICLE WAS LOSS. THE CONTACT CALLED LOCAL DEALER CAVENDER TOYOTA LOCATE AT 5730 NORTHWEST LOOP 410, SAN ANTONIO, TX 78238, (210) 681-6601 AND WAS MADE AWARE OF THE VEHICLE. THE VEHICLE HAD NOT BEEN DIAGNOSED AS OF YET.  THE MANUFACTURER HAD NOT BEEN INFORMED OF FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 12,000.",
        "vin": "4T1K61AK3LU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/30/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372410,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP NEEDS TO BE REPLACE.  THERE HAS BEEN A RECALL ON MY CAR SINCE JANUARY AND TOYOTA TOLD ME THIS YESTERDAY.    FUEL PUMP IS DEFECTIVE AND CAN CAUSE THE CAR TO STALL WHILE IN OPERATION.  TOYOTA STATED THEY CANNOT OFFER A LOANER OR REPLACEMENT VEHICLE AND CANNOT GIVE A ETA FOR THE REPLACEMENT PART AS OF NOW A REPLACEMENT IS NOT AVAILABLE. I AM DRIVING A CAR THAT CAN PUT MYSELF AND OTHER DRIVERS AT RISK OF BEING INJURED OR WORST.",
        "vin": "4T1K61AK9LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/28/2020",
        "dateOfIncident": "10/28/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366859,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "IN THE PAST TWO MONTHS THE BATTERY HAS DIED THREE TIMES.   FIRST ON 9/14/20 WITH 1721 MILES, SECOND ON 9/30/20 WITH 1962 MILES, THIRD TIME ON10/28/20 WITH 2,994 MILES.  EVERY TIME THE ERROR WAS 'SMART KEY MALFUNCTION ',  AND THE CAR HAD TO BE JUMP STARTED AND BROUGHT TO THE DEALER.  TWO TECHNICAL CASES WERE OPENED AND THE DATA CONTROL MODULE SOFTWARE WAS UPDATED TO THE LATEST RELEASE.  THE VEHICLE WAS PARKED ALL THREE TIMES.",
        "vin": "4T1C31AK3LU"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "10/22/2020",
        "dateOfIncident": "10/11/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11365678,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR VEHICLE WAS STRUCK FROM THE DRIVERS SIDE - REAR AT AN ESTIMATED 60MPH SPEED DIFFERENCE. (IT IS THOUGHT WE WERE SLOWED TO APPROX 25MPH, OTHER CAR WAS PROBABLY 80MPH OR MORE). THIS HAPPENED ON I95 IN LUMBERTON NC. THE OTHER VEHICLE WAS IN LEFT LANE, WE WERE IN RIGHT LANE. THE OTHER VEHICLE SWERVED INTO OUR LANE HITTING US \"QUARTERING\" FROM LEFT REAR. FORCE WAS HARD ENOUGH TO DEFORM RIGHT SIDE OF CAR WHICH CAME IN CONTACT WITH NOTHING. AS THE DRIVER, I STRUCK THE INTERIOR WITH ENOUGH FORCE TO CAUSE A \"SEVERE\" CONCUSSION. NO SIDE CURTAINS DEPLOYED, AND I DO NOT BELIEVE THE SEAT BELTS TENSIONED TO RESTRAIN ME IN THE SEAT. MY LEFT SHOULDER, ARM, AND ELBOW WERE ALSO INJURED IN THE ACCIDENT. THE FRONT SEAT PASSENGER  SUFFERED INJURIES TO HER LEFT ARM, AND RECOILED STRIKING THE INSIDE OF THE RIGHT INTERIOR. THIS CAUSED HEAD TRAUMA AS WELL. WE DON'T BELIEVE THE SEAT BELT TENSIONED. PASSENGER IN THE BACK SEAT, RIGHT SIDE ALSO SUFFERED INJURY. NOT AS SEVERE AS FRONT SEAT OCCUPANTS. HE WAS THROW AROUND IN THE VEHICLE, IT IS UNKNOWN IF HIS BELTS TENSIONED. ALL 3 HAD TO BE TRANSPORTED BY AMBULANCE FOR INJURIES SUFFERED. THERE IS A WARNING DISPLAYED IN THE DASH STATING, \"SRS AIRBAG SYSTEM MALFUNTION VISIT YOUR DEALER\"  I BELIEVE HAD SEATBELTS TENSIONED, SIDE CURTAINS DEPLOYED, MY INJURIES WOULD BE MUCH LESS.  THIS ACCIDENT OCCURRED 10/11/2020, WEATHER WAS OVERCAST BUT DRY.  CRASH FORCE WAS SUFFICIENT TO CAUSE BODY WORK DEFORMATION ON RIGHT SIDE OF VEHICLE, WHICH CAME IN CONTACT WITH NO OBJECTS.",
        "vin": "4T1NZ1AK6LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/07/2020",
        "dateOfIncident": "10/06/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363133,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 TOYOTA CAMRY LE DEAD BATTERY PROBLEMS. SINCE I PURCHASED THE CAR ON APRIL 25   2020 I HAVE HAD TO PURCHASE TWO NEW TOYOTA BATTERIES FROM TOYOTA. THE NEW BATTERIES ARE 770 CCA AMPS VS MY ORIINAL BATTERY WHICH WAS ONLY 563 CCAWHICH THEY DO NOT MAKE ANY MORE.YESTERDAY I SPOKE WITH JULIE A CUSTOMER CARE MANANGER FR. OM TOYOTA CUSTOMER CARE AND SHE SAID TOYOTA IS GETTING ALOT OF COMPAINTS ABOUT DEAD BATTERIES FROM CUSTOMERS.WHEN I ASKED HER TO DO SOMETHING ABOUT MY SPENDING OVER 300.OO DOLLARS ON TWO BATTERIES BECAUSE NOWHERE IN THEIR 608 PAGE TOYOTA CAMRY MANUAL DOES IT TELL YOU YOU HAVE TO CLOSE THE WINDOWS AND LOCK THE DOORS OR THE BATTERY WILL GO DEAD. IN FACT MY WIFE HAD ASKED THE SERVICE MANAGER AT PARKS TOYOTA IN DELAND FLORIDA THIS EXACT QUESTION AND HE DAVID CAREY SAIDY OU DO NOT HAVE TO CLOSE WINDOWS OR LOCK  YOUR DOORS.I HAVE GONE TO THE TOYOTA DEALERSHIP 4 TIMES SPENT OVER 300.00 DOLLARS ON 2 NEW BATTERIESAND 250.00 ON THE CORRECT TEST EQUIPMENT TO CONFIRM THE ELECTRICAL PROBLEM OF DEAD BATTERIES WAS FROM THE FACT THAT I PARKED MY CAR IN MY GARAGE WITH THE WINDOWS OPEN AND DOORS UNLOCKED",
        "vin": "4T1C11AK4LU"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/01/2020",
        "dateOfIncident": "09/04/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362324,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHIN 2 WEEKS OF PURCHASING THE CAR I HAD THE FOLLOWING ISSUES:   THE KEYLESS KEY NOT WORKING, ENGINE IMMOBILIZER SYSTEM LIGHT WAS ON, ELECTRIC POWER STEERING SYSTEM WARNING LIGHT WAS ON AND THE CAR BATTERY WAS COMPLETELY DRAINED. CAR WAS STOPPED",
        "vin": "4T1F11AK0LU"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/28/2020",
        "dateOfIncident": "09/27/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361441,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TRY TO START THE CAR BUT WON'T START IT CHECK THE BATTERY BUT NOT BATTERY ISSUE AFTER I THAT TRY START AGAIN STILL CAN'T SOME CRANKY NOISES START THAN CAR SHUTDOWN,BUT EVEN 90 DAY A LOT OF TROUBLE N WEIRD NOISES WHEN PUSH THE BRAKE PADDLES",
        "vin": "4T1K61AK8LU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/22/2020",
        "dateOfIncident": "09/02/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360415,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 TOYOTA CAMRY. THE CONTACT STATED WHILE DRIVING 15 MPH, THE JERKED WITHOUT WARNING. THE CONTACT THEN HEARD A LOUD POPPING SOUND AND SAW WHITE SMOKE COMING FROM THE ENGINE OF THE VEHICLE. THE CONTACT PULLED OVER AND EXITED THE VEHICLE. THE CONTACT LOOKED UNDER THE HOOD AND SAW ANTIFREEZE. THE VEHICLE WAS TOWED TO LIPTON TOYOTA (1700 W. OAKLAND PARK BLVD, FORT LAUDERDALE, FL 33311) WHERE THE CONTACT WAS INFORMED THAT THERE WAS A HOLE IN THE ENGINE BLOCK. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 12,269.",
        "vin": "4T1C11AK1LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/21/2020",
        "dateOfIncident": "09/21/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360133,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TODAY SEPTEMBER 21   AGAIN I FIND MY 2020 TOYOTA  CAMRY BATTERY DEAD  I WOULD JUST LIKE TO INFORM YOU THAT ON 2 WEBSITES OWNERS HAVE COMPLAINED ABOUT THE SAME ISSUE ABOUT 19 OWNERS THE WEBSITES ARE KELLY BLUE BOOK AND TOYOTAOWNERSCLUB.COM THIS ISSUE REALLY NEEDS TO BE ADDRESSED BY TOYOTA CORPORATE",
        "vin": "4T1C11AK4LU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/21/2020",
        "dateOfIncident": "09/02/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360340,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FROM I BOUGHT THIS CAR I'VE NOTICED A HEAVY JERK OR SHIFT WITHIN THE ENGINE / TRANSMISSION  I TOOK THE VEHICLE BACK TO TOYOTA  3 DIFFERENT TIMES COMPLAINING ABOUT THE PROBLEM THEY TOLD ME THAT THEY RESET THE TRANSMISSION  BUT HAD ONLY DOCUMENTED ONE TIME , SO ON THE 2ND OF SEPTEMBER I WAS DOWN IN FTLAUDERDALE FL AT THE TRAFFIC LIGHT OF 31ST & MCNAB THE LIGHT WAS RED THEN TURNED GREEN I DROVE OFF THEN I HEARD A SOUND SAW SO MUCH SMOKE I COULDN'T SEE NOTHING OUTSIDE SO I STOPPED TURNED OFF THE IGNITION SAW THAT THE SIGNS ON THE DASH SAYING THE ENGINE IS DEAD WAITED UNTIL I COULD SAFELY EXITED THE VEHICLE  WENT OUTSIDE SAW A LOT OF ANTIFREEZE ON THE GROUND BUT NO OIL SO I OPENED THE HOOD SAW ANTIFREEZE ALL OVER & A LITTLE OLD SO I CALLED TOYOTA  THEY TOLD ME TO HAVE THE VEHICLE TOWED TO THE NEAREST DEALER  AFTER BEING THERE FOR A FEW HOURS THEY TOLD ME I HAD A HOLE IN THE ENGINE I REPLIED THAT COULDN'T BE POSSIBLE I HAVEN'T DRIVEN OVER ANYTHING  MATT THE SERVICE REP TOLD ME IT COULD BE 3 THINGS ONE BEING MY NEGLIGENCE BY DRIVING THE VEHICLE WITHOUT OIL I SAID THAT CAN'T BE POSSIBLE THE OIL WAS CHANGED AT 10,000 MILES THEN HE SAID IT COULD BE HYDROLOCK MEANING I'VE DRIVEN THROUGH 3-4 FEET OF WATER I REPLIED IMPOSSIBLE LOOK AT MY CAR DO YOU SEE HOW CLEAN IT IS THEN HE SAY IT ALSO COULD BE FACTORY DEFECT BUT THEY WOULD HAVE TO PULL THE ENGINE DOWN  TO SEE & THEY WOULD HAVE RESULTS IN 2 DAY I CONTACT THEM IN 2 DAYS THEY SAID THAT THEY'RE STILL DIAGNOSING THE PROBLEM SO ON MONDAY SEPTEMBER 7 THEY CONTACTED ME SAYING THE VEHICLE IS HYDROLOCK AND IT'S AN INSURANCE CLAIM I SAID IT'S IMPOSSIBLE  HE SAID THAT'S THE ONLY WAY TO GO SO I CONTACT MY INSURANCE THEY WENT & LOOK AT MY CAR & DECIDED THAT IT WASN'T DRIVEN THROUGH WATER I WAS DRIVING WHEN THE PROBLEM HAPPENED I THOUGHT THAT THE VEHICLE WAS GOING TO BLOW UP DUE TO THE AMOUNT OF SMOKE DIDN'T KNOW THAT A NEW CAR BY TOYOTA WO",
        "vin": "4T1C11AK1LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/20/2020",
        "dateOfIncident": "05/05/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360039,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FOUND SERVICE BULLETIN TSB00007-19 GROWING NUMBER OF CUSTOMER CONCERNS ABOUT NEEDING A NEW BATTERY AFTER 1 YEAR.  I BROUGHT MY 2020 TOYOTA CAMRY INTO DAYTONA TOYOTA FOR DIAGNOSIS OF DEAD BATTERY ISSUE-TECHNICIAN TOOK 8 HOURS AND SUGGESTED I MUST HAVE LEFT THE DOOR OR TRUNK OPEN.  TECHNICIAN DID SAY I SHOULD HAVE RECEIVED A NEW BATTERY WHICH IS A NEW DESIGN, PART #00544H6074770.THIS BATTERY IS RATED AT 770CCA VS MY BATTERY WHICH IS RATED AT 560 CCA. THE NEW BATTERY ACTUALLY CHECKS OUT AT 990 CCA!  TECHNICIAN SAID IT IS THE NEWLY DESIGNED BATTERY FOR THE TOYOTA CAMRY AND RAV4 AND WOULD GREATLY REDUCE DEAD BATTERY PROBLEM, HOWEVER TOYOTA WOULD NOT AUTHORIZE A REPLACEMENT.  I HAVE SPENT 2 FULL DAYS CHASING THIS PROBLEM AT 2 DEALERSHIPS AND TOYOTA SAYS IT IS MY FAULT FOR LEAVING A DOOR, HOOD, OR TRUNK OPEN-ABSURD! THIS IS TRULY LOUSY SERVICE ON A BRAND NEW VEHICLE WITH AN UNDERLYING SERIOUS PROBLEM.  FOR THE IMMEDIATE TIME I DISCONNECT THE BATTERY CABLE WHEN NOT GOING TO USE THE CARE FOR 4 OR 5 DAYS. THIS VEHICLE NEEDS A RECALL FOR BATTERY OR UNDERLYING DRAINAGE PROBLEM.   ALSO SEE KELLY BLUE BOOK FOR MANY COMPLAINTS ABOUT THIS.",
        "vin": "4T1C11AK4LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/19/2020",
        "dateOfIncident": "05/25/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11359908,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE SECOND TIME I HAVE THIS COMPLAINT .  AFTER 1 TO 3 DAYS THAT THE CAR IS NOT DRIVEN THE BATTERY GOES DEAD .  THE BATTERY VOLTAGE READS 12.00   I HAVE HAS TO PURCHASE 2 NEW BATTERIES FROM TOYOTA  TOYOTA SAYS THIS IS NORMAL PLEASE HELP THIS TIME   IS THE NHTSA JUST ANOTHER PAWN FOR PRESIDENT TRUMP TO SLILENCE",
        "vin": "4T1C11AK4LU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/19/2020",
        "dateOfIncident": "09/18/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11359920,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE COOLANT SMELL AFTER DRIVING.  DOESNT MATTER HOW LONG I DROVE, 10 MINUTES OR 6 HOURS, SMELL IS THERE.  SMELL IS SRONGER FROM DRIVER SIDE.  DEALERSHIP TOLD ME IT JUST DOES THAT! THAT THEY LET SIT IN THE PARKING LOT RUNNING FOR AN HOUR AND THERE WAS NO LEAK. IT ONLY HAS 10K MILES ON IT.  IT SHOULDN'T REEK OF HOT COOLANT AT ALL! IT HAPPENS EVER TIME I DIVE THE CAR. MOST RECENT 9/18/2020",
        "vin": "4T1G11AK7LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/13/2020",
        "dateOfIncident": "09/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354754,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WENT TO GET IN MY CAR TO LEAVE AND IT HAD NO POWER. CALLED TOYOTA CARE TO GET A JUMP THEY CAME OUT AND GAVE ME A JUMP AND IT STARTED RIGHT UP. DROVE IT AROUND A BIT AND PARKED IT. WENT OUT TO START IT AGAIN 4 HOURS LATER AND THE BATTERY WAS COMPLETELY DEAD AGAIN.",
        "vin": "4T1K61AK5LU"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/03/2020",
        "dateOfIncident": "09/02/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352897,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TOYOTA CAMRY XSE 2020 BATTERY WAS DEAD. I BEEN DRIVING IT FOR ALMOST 6 WEEKS AND I GOT STRANDED TODAY WHEN IT DIDN'T TURNED ON. IT'S BEEN HAPPENING TO MANY 2020 MODELS AND WE NEED ANSWERS AND SOLUTIONS. I DO NOT WANT TO BE LEFT STRANDED AGAIN.",
        "vin": "4T1K61AK5LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/29/2020",
        "dateOfIncident": "08/17/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351946,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "DEAD BATTERY IN AUGUST 2020",
        "vin": "4T1G11AK4LU"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "08/14/2020",
        "dateOfIncident": "02/18/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11349407,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 TOYOTA CAMRY. CONSUMER WRITES IN REGARDS TO UNINTENDED ACCELERATION. *LD    THE CONSUMER STATED WHILE THE VEHICLE WAS IN PARK ON A FLAT SURFACE, THE CONSUMER EXITED THE VEHICLE AND IT BEGAN ROLLING.  THE VEHICLE STRUCK A REFRIGERATOR, WORK BENCH, AND THE CONSUMER. THE CONSUMER WAS TRAPPED UNDER THE VEHICLE FOR 30 MINUTES. THE CONSUMER'S SHOULDER, BACK, AND LEG WERE INJURED. THE INJURIES REQUIRED THE CONSUMER TO SEE AN ORTHOPEDIC DOCTOR. THE DEALER AND MANUFACTURER WERE CONTACTED NEITHER COULD DETERMINE THE FAILURE.  THE CONSUMER STATED AUTOMATED STOP TECHNOLOGY SHOULD HAVE CAUSED THE VEHICLE TO STOP, BUT FAILED.*JS",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/14/2020",
        "dateOfIncident": "01/24/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349343,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "1. CAR DOES NOT ALWAYS ACCELERATE WHEN TRYING TAKE OFF. MAJOR DELAY IN ACCELERATION.  BECAUSE OF THIS I HAVE BEEN ALMOST HIT BY ONCOMING TRAFFIC WHEN CROSSING THE HIGHWAY SEVERAL TIMES. I HAVE TAKEN CAR INTO DEALERSHIP AND WAS TOLD THAT I HAVE TO WAIT FOR AN UPDATE IN CAR COMPUTER SYSTEM.   2. THE CAR STEREO SYSTEM RANDOMLY SHUTS OFF. THE STEREO ALSO RANDOMLY LOSES SOUND. I HAVE TAKEN CAR IN FOR THIS ALSO. I WAS TOLD TO WAIT FOR AN UPDATE.",
        "vin": "4T1C11AK8LU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/12/2020",
        "dateOfIncident": "04/07/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348737,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER DRIVING MY CAR FOR ABOUT 30 MINUTES MAINTAINING A SPEED OF ABOUT 60 TO 65 I KEEP SMELLING COOLANT FROM UNDERNEATH THE HOOD WHEN I GET OUT OF MY CAR. ALSO MY ENGINE SOUNDS A LITTLE ROUGH FROM WHEN I BOUGHT IT. TOOK IT TO THE DEALERSHIP BACK IN APRIL THEY SAID IT WAS NORMAL THAT THE ENGINE WAS BREAKING IN. TAKING MY CAR BACK TO DEALERSHIP TOMORROW LET'S SEE WHAT THEY SAY THIS TIME.",
        "vin": "4T1K61AK8LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/03/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342948,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ATTEMPTING TO START THE CAR FROM SITTING JUST OVERNIGHT, THE DASH WILL FLASH AND CLICK AS IF THE BATTERY IS DEAD. THE CAR WON'T START AND HAS TO BE JUMPED. HOWEVER WHEN YOU HAVE THE CAR CHECKED, IT'S NOT A PROBLEM WITH THE BATTERY. THERE IS SOMETHING DRAINING THE BATTERY OVERNIGHT THAT I HAVEN'T BEEN ABLE TO DIAGNOSE. NOTHING IS PLUGGED IN AND THE LIGHTS ARE ALL TURNED OFF. THE CAR IS SIMPLY DRAINING ITSELF. THERE ARE ONLY 6000 MILES ON THE CLOCK AND NO OTHER OUTSIDE FACTORS THAT I CAN THINK OF COULD BE CONTRIBUTING TO THIS ISSUE.    ALSO RELATED TO THE ELECTRONICS GOING CRAZY, IS THE RCD FEATURE USED WHILE IS REVERSE GEAR. AFTER THE CAR IS JUMPED, THAT FEATURE NEEDS TO BE RESET BY A TECHNICIAN SO THE BACK UP CAMERA SYSTEM WORKS PROPERLY. THIS IS VERY QUICKLY BECOMING MORE THEN AN ANNOYANCE.",
        "vin": "4T1K61AK7LU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/02/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342787,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I ALREADY HAVE A COMPLAINT NUMBER 11342422.  I HAVE STUDIED THE ANTI-LOCK BRAKING SYSTEM FURTHER AND I THINK I HAVE IDENTIFIED 2 PLACES OF SAFETY CONCERN.  IN NORMAL MODE, SINCE I CAN PUSH THE PEDAL ALL THE WAY TO THE FLOOR, MY INTERPRETATION IS THAT THE RESERVOIR CAN ACCEPT ALL OF THE ADDITIONAL FLUID BEING PUMPED. IT ALSO TELLS ME THAT THE FINAL FORCE ON THE BRAKE PADS WILL BE WHATEVER THE RESISTANCE THE SPRING IN THE RESERVOIR HAS. SO I DON'T HAVE FINAL CONTROL OVER THE BRAKING EVEN UNDER NORMAL CONDITIONS.    THE OTHER CONDITION THAT CONCERNS ME IS THE LAST DIAGRAM WHEN THE PUMP IS INTENSIFYING THE BRAKING FORCE. NOW THERE IS ALSO ANOTHER PATH FOR SOME OF THIS PUMPED FLUID TO RETURN TO THE INPUT SIDE OF THE PUMP. IF THE LEAKAGE PATH HAD NO RESISTANCE THEN THE PUMP COULD BE RECIRCULATING ALL OF THE BRAKE FLUID RESULTING IN NO BRAKING. I HOPE THAT THE LEAKAGE PATH HAS ENOUGH RESISTANCE THAT A SUFFICIENT AMOUNT OF BRAKE FLUID IS ENDING UP AT THE BRAKE PADS.    THIS IS SOMETHING THAT IS IMPACTING MY CAR BUT I THINK IT'S A RISK TO ALL CARS WITH ABS. WHAT REALLY BOTHERS ME IS THAT I HAVE TALKED TO SERVICE MANAGERS OF 3 CAR DEALERS AND THEY ALL CLAIM THAT BEING ABLE TO PUSH THE BRAKE PEDAL ALL THE WAY TO THE FLOOR IS NORMAL. I DON'T THINK IT IS NORMAL AND IT ALSO DOESN'T APPLY TO ALL CARS. MY WIFE'S CAR BRAKES DON'T DO THIS.    IT SEEMS AS IF THERE IS AN INDUSTRY WIDE FOCUS TO COVER UP THIS PROBLEM.    I HOPE THAT YOU CAN GET ACCESS TO ABS ENGINEERS TO REALLY UNDERSTAND THIS ISSUE.    THANK YOU.",
        "vin": "4T1L11AK3LU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/30/2020",
        "dateOfIncident": "07/24/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342337,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "NEW VEHICLE, PRISTINE CONDITION. HIGHWAY DRIVING, OPEN SPACE, STRAIGHT LINE. NO TREES, CARS, TRUCKS, OVERPASSES, ETC. IN VICINITY. WEATHER OVERCAST, NO RAIN. WITHOUT WARNING, SUNROOF GLASS EXPLODED OUTWARD. GLASS PIECES DID FALL INSIDE, BUT MOSTLY BLEW OUT AND BACK, GOUGING REAR WINDOW AND CAUSING SIGNIFICANT PAINT DAMAGE ON TRUNK. SIZE OF BLOWOUT HOLE APPROXIMATELY 24\"X13\". TOYOTA SAYS NOT THEIR FAULT, CLEARLY A ROCK HIT IT.",
        "vin": "4T1F31AK9LU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/30/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342422,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I CAN STILL DRIVE THE CAR BUT WHAT I THINK IS DEFECTIVE IS THAT, WITH THE CAR PARKED, I CAN PUSH THE BRAKE PEDAL ALL THE WAY TO THE FLOOR. THERE ARE NO LEAKS OF BRAKE FLUID SO IT MUST BE GOING INTO THE ANTILLOCK BRAKING SYSTEM. THERE MUST BE AN INTERNAL LEAK WITHIN THE ABS AND I'M CONCERNED THAT MIGHT AFFECT IT'S FUNCTIONALITY.",
        "vin": "4T1L11AK3LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/18/2020",
        "dateOfIncident": "07/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340170,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BATTERY OF CAR RUNS AT 12V WHEN IDLE AND POWER NEVER HAS BEEN MORE THEN THAT. EITHER MANUFACTURE INSTALLED A POOR QUALITY BATT. OR DEFECTIVE ONE.  PLEASE CK INTO THIS.   THANKS.    OTHER LSSUE IS NOISE ENGINE COMPARE TO OTHER HYBRIDS.",
        "vin": "4T1G31AK3LU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/06/2020",
        "dateOfIncident": "06/26/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337786,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SUDDENLY ACCELERATES BY ITSELF . I APPLY BRAKES AND IT STILL PROPELS ITSELF.  I LOSE CONTROL OF THE VEHICLE AND FEEL THAT I AM LUCKY THAT I DO NOT HIT A PEDESTRIAN OR ANOTHER CAR BECAUSE THE SUDDEN ACCELERATION EVENTUALLY STOPS. THE CAR IS NEW WITH ONLY 900MILES . I AM SCARED TO DEATH TO DRIVE IT. TOMORROW I AM BRINGING CAR BACK TO THE DEALER FOR ADVICE. THIS SUDDEN ACCELERATION HAS HAPPENED TWICE. OF COURSE THIS OCCURS WHEN I AM DRIVING AT SLOW SPEEDS.",
        "vin": "4T1L11AKXLU"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/15/2020",
        "dateOfIncident": "05/20/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328832,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DAY WAS PARTLY CLOUDY.  THE LOCATION WAS MARYLAND. THE VEHICLE WAS A NEW 2020 TOYOTA CAMRY SE 4DOOR.  WHILE DRIVING WITH MY SUNROOF EXTERIOR FLAT GLASS AND INTERIOR DOOR ASSEMBLY BOTH COMPLETELY CLOSED, MY DAUGHTER AND I SUDDENLY HEARD A BOOM EXPLOSION.  WHILE DRIVING TRYING TO SAFELY EXIT, HUGE BLACK CHUNKS WERE FLYING BEHIND US, THAT WAS LATER IDENTIFIED AS BROKEN SUNROOF GLASS FLYING BEHIND US HITTING THE VEHICLES TRAVELING BEHIND US. WE PULLED OVER AND GOT OUT OF THE CAR. WE DISCOVERED THAT MY VEHICLE'S SUNROOF HAD EXPLODED. INSTEAD OF THE REMAINING BROKEN SUNROOF GLASS EDGES EXHIBITING A CONCAVE DOWNWARD APPEARANCE, THE REMAINING SHATTERED GLASS EXHIBITED A CONVEX OUTWARD APPEARANCE INDICATING AN EXPLOSION HAD OCCURRED. TOOK THE VEHICLE TO A LOCAL MARYLAND TOYOTA DEALER FOR HELP AND WAS TOLD BECAUSE THE VEHICLE WASN'T PURCHASED FROM THEIR DEALERSHIP THEY COULDN'T HELP ME.  HENCE THE OEM GLASS REPLACEMENT COSTS WERE COVERED BY MY AUTO INSURANCE, WITH A $500 DEDUCTIBLE. A FEW DAYS LATER AFTER I RETURNING HOME, THE NEW OEM GLASS AND SUNROOF ASSEMBLY BEGAN TO SCREECH AND CRACKLED AS IF IT WAS COMING APART.  THE TOYOTA DEALERSHIP WHERE I PURCHASED MY VEHICLE RENIGGED ON THEIR PROMISE TO MAKE MY SUNROOF ASSEMBLY NEW AGAIN AT NO COSTS SINCE THE VEHICLE WAS STILL UNDER WARRANTY.  NOW I DEAL WITH A CRACKLING AND SQUEAKING SUNROOF ASSEMBLY THAT MAKES ME FEARFUL OF THE SUNROOF EXPLODING AGAIN. NOTE:  THE PURCHASING DEALERSHIP FAILED TO COMPLY WITH MY AUTO SUNROOF GLASS AND ASSEMBLY THAT WAS STILL UNDER WARRANTY AND REFUND MY AUTO INSURER AND ME AS THEY HAD PROMISED.      HAD DIFFICULTY UPLOADING PHOTOS (5)  *TR",
        "vin": "4T1G11AK2LU"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/03/2020",
        "dateOfIncident": "06/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327067,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 TOYOTA CAMRY. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V064000 (ENGINE AND ENGINE COOLING) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. ED MORSE DELRAY TOYOTA (2800 S FEDERAL HWY, DELRAY BEACH, FL 33483) WAS CONTACTED AND CONFIRMED THE PARTS WERE NOT AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. A LOANER VEHICLE WAS OFFERED HOWEVER, THE CONTACT DECLINED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "4T1F11AK2LU"
    },
    {
        "components": "SUSPENSION,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/23/2020",
        "dateOfIncident": "04/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325658,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2020 CAMRY /TOYOTA IS BUILT SO LOW IT KNOTTED THE CLAPS A LOOSE  FROM UNDER THE FRONT PART OF THE VEHICLE... DUE TO HOW LOW THE VEHICLE WAS BUILT ANY SLIGHT UNEVENNESS IN THE ROAD YOU  CAN HEAR AND FEEL THE FRONT OF THE CAR SCRAPE THE FRONT END OF THE CAR.  *TR",
        "vin": "4T1C11AK5LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/18/2020",
        "dateOfIncident": "04/29/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324940,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "DAYTONA TOYOTA DISCONNECTED MY DCM DATA CONTROL MODULE BECAUSE IT WAS DRAINING THE BATTERY AND CAUSING IT TO GO DEAD. HOWEVER NOW MY AUDIO ENTERTAINMENT SYSTEM EMTINE 3.0 WILL NOT WORK.  *TR",
        "vin": "4T1C11AK4LU"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/28/2020",
        "dateOfIncident": "04/24/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322504,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE INTERSTATE WHEN I HEARD A LOUD GUNSHOT SOUND AND ALL THE SUDDEN GLASS RAINED DOWN ON ME AND INTO MY CAR. MY SUNROOF EXPLODED OUT OF NOWHERE. THIS COULD HAVE CAUSED ME TO WRECK BECAUSE I SHUT MY EYES AND SWERVED. ALSO, THANK GOODNESS MY DAUGHTER WASN'T IN THE BACK SEAT OR SHE COULD HAVE BEEN SERIOUSLY INJURED.",
        "vin": "4T1G11AK6LU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/23/2020",
        "dateOfIncident": "03/23/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319003,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE SERIAL NUMBER D243692 LARGE LETTERS UNDERNEATH NUMBER A25A.  SAFETY RECALL NOTICE NUMBER 20TA04.  DUE TO THE MEDICAL EMERGENCY CORONAVIRUS IN THE UNITED STATES I AM REQUESTING A LIST OF SERIAL NUMBERS FOR THE ENGINE BLOCKS 2020 TOYOTA CAMRY.  THE DEALER I CONTACTED REFUSE TO TELL ME IF MY ENGINE BLOCK NUMBER IS ONE THAT IS AFFECTED BY THIS RECALL, I CALLED TOYOTA AND THEY INFORMED ME THAT THE DEALER COULD ONLY PROVIDE THIS INFORMATION TO ME. I AM REQUESTING THIS INFORMATION UNDER US FREEDOM OF INFORMATION ACT.  THANK YOU,",
        "vin": "4T1F11AKXLU"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/23/2020",
        "dateOfIncident": "03/20/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319053,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING MULTIPLE EPISODES WHETHER THE CAR IS AT A STOP OR IN MOTION THERE IS A DELAY FROM WHEN THE ACCELERATOR IS DEPRESSED TO WHEN THE ENGINE RESPONDS AND REVS LEADING TO MORE POWER AND SPEED.    FOR EXAMPLE WHEN STOPPED AT A LIGHT TRYING TO MAKE A LEFT TURN, I PRESS THE ACCELERATOR DOWN AND THERE IS NO MAJOR CHANGE IN SPEED AND REVS UNTIL SECONDS LATER WHEN THEN ENGINE THEN GOES FROM 1000RPMS TO 3000RPMS. THIS CAN BE DANGEROUS AND ALMOST LED TO AN ACCIDENT AS THERE WAS AN ONCOMING CAR THAT ALMOST HIT ME AS I WAS TRYING TO MAKE THE TURN. ALSO HAPPENED WHEN I WAS TRYING TO ACCELERATE TO MERGE ONTO THE HIGHWAY AND THERE WAS AN ACCELERATION DELAY FOR A SAFE MERGE.",
        "vin": "4T1C11AK1LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/23/2020",
        "dateOfIncident": "03/12/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319059,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR CAN SIT FOR 1 DAY WITHOUT DRIVING OR NOT STARTING IT AND IT WILL NOT START THE NEXT DAY. IT HAS TO BE JUMP STARTED.",
        "vin": "4T1G11AK3LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/19/2020",
        "dateOfIncident": "03/18/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318683,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "RODENTS APPEAR TO BE ATTRACTED TO THE ENGINE COMPARTMENT WHERE THEY ARE EATING CRITICAL WIRING.  THE WIRING IS ASSOCIATED WITH THE FUEL INJECTION SYSTEM.  I HAD THE VEHICLE REPAIRED WITH THE DEALERSHIP, COSTING ME $600.  AFTER RETURNING THE VEHICLE FROM THESE REPAIRS AT THE DEALERSHIP, I PARKED THE VEHICLE AT HOME AND AGAIN RODENTS ENTERED THE ENGINE COMPARTMENT AND CHEWED UP ADDITIONAL WIRING THE VERY NEXT DAY.  THE NEW REPAIRS COST ME AND ADDITIONAL $600.      THE HOME IS LOCATED IN A RURAL AREA UNDER A CARPORT.  I HAVE LIVED IN THIS HOME FOR SEVEN YEARS AND HAVE OTHER CARS PARKED ADJACENT TO THE AUTOMOBILE IN QUESTION.  NO OTHER VEHICLES, HOWEVER, HAVE HAD OR ARE HAVING PROBLEMS WITH RODENTS.    I WILL BE TRADING IN THIS VEHICLE IMMEDIATELY.  I CAN NOT AFFORD THESE COSTLY REPAIR BILLS.",
        "vin": "4T1G11AK6LU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/05/2020",
        "dateOfIncident": "02/28/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316248,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL SMELL ON HARD ACCELERATION.",
        "vin": "4T1K61AK4LU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/15/2020",
        "dateOfIncident": "02/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309381,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SMELLS LIKE COOLANT WHEN EXITING AFTER DRIVING. CAN NOT FIND VISIBLE LEAK, BUT OVERFLOW RESERVOIR IS EMPTY AFTER 3000 MILES",
        "vin": "4T1G11AK4LU"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/30/2020",
        "dateOfIncident": "12/27/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11303041,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "SLOW ACCELERATION DURING 1ST 1 OR 2 GEARS.  ALMOST HAD MULTIPLE ACCIDENTS IN HIGHWAY DUE TO SLOW ACCELERATION WHEN CHANGING LANES. THE VEHICLE DOES NOT IMMEDIATELY RESPOND TO ACCELERATION WHEN ACCELERATOR PEDAL IS USED. THE VEHICLE HAS A COUPLE OF SECONDS DELAY UNTIL IT CHANGING INTO NEXT GEAR. DEALER NON RESPONSIVE.  I BROUGHT IT INTO MY TOYOTA DEALER AND THE SERVICE TECHNICIAN DROVE MY CAR WITH ME IN THE PASSENGER SEAT. I EXPLAINED THAT MY PREVIOUS (3) V6 TOYOTA CAMRY'S DID NOT HAVE ANY PROBLEMS WITH ACCELERATION, HE TOTALLY UNDERSTOOD. THE NEW 8- SPEED TRANSMISSION HAS DIFFERENT SHIFT SETTINGS WHICH EXPLAINS THE ACCELERATION DELAY AND SOMETIMES CAUSES A JERKY MOTION FROM A DEAD STOP, DRIVING IN STOP & GO TRAFFIC OR WHILE ENTERING A HIGHWAY. ACCORDING TO THE TECH, THEY HAVE BEEN PROVIDED WITH NO FIXES FOR THIS PROBLEM AND THAT THE CAR WILL \"LEARN\" MY DRIVING HABITS THE MORE I DRIVE IT.",
        "vin": "4T1K61AK5LU"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/07/2020",
        "dateOfIncident": "11/08/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297722,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUN VISOR ON THE 2020 CAMRY XLE IS NOT DEEP ENOUGH AND DOES NOT PROVIDE PROTECTION FROM BLINDING SUNLIGHT, WHETHER THE VISOR IS DOWN IN FRONT OF ME, OR TO THE SIDE WINDOW - A DANGEROUS SITUATION.  HAVE NEVER HAD THIS PROBLEM BEFORE, AND HAVE BEEN A TOYOTA CUSTOMER FOR OVER 35 YEARS.",
        "vin": "4T1F11AK0LU"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/20/2019",
        "dateOfIncident": "11/07/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289435,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 TOYOTA CAMRY. CONSUMER WRITES IN REGARDS TO PROBLEMS WITH THEIR TIRES. CONSUMER STATED THAT THE FRONT TIRE CAME APART WHILE DRIVING. *LD    *JS",
        "vin": ""
    }
]