[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/05/2021",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "Tiffin Motorhomes, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415275,
        "products": [
            {
                "manufacturer": "Tiffin Motorhomes, Inc.",
                "productMake": "TIFFIN",
                "productModel": "PHAETON",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE EPA CAME OUT WITH REQUIREMENTS IN 2013 THAT ALL DIESEL ENGINES HAVE A POLLUTION MITIGATING DEF (DIESEL EXHAUST FLUID) SYSTEM. APPARENTLY, THE EPA REQUIRED THE INDUSTRY TO MEASURE THE FOLLOWING THREE ITEMS WITH RESPECT TO BLUE DEF.  - LEVEL OF DEF  - TEMPERATURE OF DEF  - QUALITY OF DEF  I HAVE BEEN TOLD THAT THE EPA GRANTED AN EXTENSION OF THE THIRD REQUIREMENT, QUALITY OF DEF, SINCE NO ONE COULD MANUFACTURE THE EQUIPMENT NECESSARY TO DO SO. THIS EXTENSION APPARENTLY LASTED UNTIL 2017.   THESE DEF SENSORS BEING INSTALLED ARE FAILING AT AN ALARMING RATE, MANY WITHIN ONLY A FEW MILES. WHEN DEF SENSORS FAIL THE ENGINE CAN GO INTO DERATE MODE WHICH IS 5 MPH. THIS PROBLEM IS LEAVING MANY LARGE DIESEL ENGINE OWNED VEHICLES STRANDED, FROM MOTORHOMES TO LARGE OVER THE ROAD TRUCKS. CURRENTLY, THE ONLY COMPANY THAT MAKES THE DEF SENSORS IS SHAW DEVELOPMENT. SHAW DEVELOPMENT WILL NOT TAKE CALLS OR EMAILS REQUESTING INFORMATION REGARDING THIS PROBLEM. AGAIN, THE DEF SENSOR REQUIREMENT WAS A REGULATION PASSED BY EPA IN 2013, STATING THE DEF CONCENTRATION (QUALITY) BE MEASURED IN THE DEF TANKS OF VEHICLES. HOWEVER, THE DEF SENSOR MANUFACTURERS CANNOT SEEM TO MANUFACTURE A PART THAT IS RELIABLE AND NOT PUT ENGINE INTO A POTENTIALLY DANGEROUS DERATE MODE. SHAW DEVELOPMENT IS CURRENTLY ON THE SIXTH GENERATION OF THE DEF SENSOR WHICH ARE STILL FAILING ON BRAND NEW 2021 VEHICLES. THAT IS SIX ATTEMPTS TO MAKE A PART THAT CONTINUES TO LEAVE PEOPLE STRANDED.  I HAVE NO ARGUMENT WITH THE NEED FOR THIS SMOG REDUCING MITIGATION EQUIPMENT. WHAT I DO HAVE A PROBLEM WITH, IS THE EPA REQUIREMENT TO MEASURE THE QUALITY OF DEF WHEN NO ONE CAN PRODUCE A RELIABLE PRODUCT TO DO SO, AND THE EFFECT THAT IT IS HAVING ON THE TRANSPORTATION INDUSTRY.  I WOULD LIKE TO ASK THAT YOU REQUEST THE EPA TO SUSPEND THIS REQUIREMENT UNTIL SOMEONE CAN PRODUCE A RELIABLE PRODUCT TO MEASURE THE QUALITY OF DEF.",
        "vin": "5VBPA57A8LA"
    }
]