[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/26/2022",
        "dateOfIncident": "01/26/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448935,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Return for modification",
        "vin": "5TFHY5F15LX"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/25/2022",
        "dateOfIncident": "01/01/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448789,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Toyota Tundra. The contact received notification of NHTSA campaign number 21V688000 (Exterior Lighting, Electric System) however, the part to do the recall repair was unavailable. The local dealer was contacted, and it was confirmed that the part was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. VIN tool confirms parts are not available.",
        "vin": "5TFUY5F11LX"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/20/2021",
        "dateOfIncident": "12/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444424,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Battery dead, truck won’t start and won’t charge battery.",
        "vin": "5TFDY5F12LX"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/03/2021",
        "dateOfIncident": "12/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442579,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I bought a 2020 Tundra in mid year of 2020. By December 2020 I started to notice a strong vibration in the steering and from the front end between the low speeds of 20-30 mph and between 60-70 mph. The hotter the vehicle gets the more vibration occurs. Now my alignment seems off and curves to the left when trying to drive straight. I have taken it in to Alamo Toyota and Red McCombs in San Antonio on many occasions with similar problems but all they are doing is balancing and rotation of tires. I have sent the dealership videos of the vibration but they indicate it’s normal. This certainly does not appear normal and is now more of a safety issue. Not sure what else to do!",
        "vin": "5TFHY5F11LX"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/02/2021",
        "dateOfIncident": "06/08/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398757,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 TOYOTA TUNDRA. THE CONTACT STATED WHILE DRIVING AT 10 MPH, THE FOUR-WHEEL DRIVE WOULD NOT ENGAGE. THE CONTACT STATED WHEN TRYING TO ENGAGE THE FOUR-WHEEL DRIVE, THE VEHICLE WOULD MAKE A LOUD NOISE AND NOT ALLOW THE VEHICLE TO TURN. THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS NOT TAKEN TO A LOCAL DEALER OR INDEPENDENT MECHANIC FOR DIAGNOSIS OR REPAIRS. THE MANUFACTURER HAD NOT BEEN INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 3,000.",
        "vin": "5TFCY5F10LX"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/01/2021",
        "dateOfIncident": "01/10/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398452,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 TOYOTA TUNDRA. THE CONTACT STATED THAT WHILE DRIVING BETWEEN 55 TO 75 MPH, THE STEERING WHEEL AND VEHICLE SEVERELY SHOOK AND VIBRATED. EVENTUALLY THE FAILURE STARTED OCCURRING WHILE DRIVING AT VERY SLOW SPEEDS. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER AUTONATION TOYOTA WESTON LOCATED AT 4050 WESTON RD, DAVIE, FL 33331 WHO REPLACED THE FRONT PASSENGER'S SIDE SHOCK ABSORBER, PERFORMED A FRONT-END ALIGNMENT AND BALANCED THE TIRES HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 600.",
        "vin": "5TFFY5F16LX"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/04/2021",
        "dateOfIncident": "05/24/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394700,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 TOYOTA TUNDRA. THE CONTACT STATED WHILE DRIVING AT LOW SPEEDS, HE STARTED TO HEAR AN ABNORMAL NOISE. THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER TOYOTA OF SANTA MARIA (700 EAST BETTERAVIA RD, SANTA MARIA, CA 93454, (805) 928-3881) WHERE THE MECHANIC WAS UNABLE TO DIAGNOSE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS 8.",
        "vin": "5TFEY5F10LX"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/04/2020",
        "dateOfIncident": "11/02/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372946,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP RUNNING WHILE ENGINE IS OFF AND KEY IS TURNED OFF",
        "vin": "5TFEY5F19LX"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/04/2020",
        "dateOfIncident": "10/07/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373015,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I ACCELERATED FROM A STOP MAKING A RIGHT TURN IN A NORMAL MANNER TO KEEP SAFELY IN FRONT OF ONCOMING TRAFFIC, I HAD NO POWER ALTHOUGH I KEPT PUSHING THE ACCELERATOR.  MULTIPLE LIGHTS FLASHED ON THE DASH. I COASTED TO THE SHOULDER OF THE ROAD.  AFTER I STOPPED, ALL THE LIGHTS ON THE DASH HAD GONE OUT BUT THE ENGINE WAS STILL RUNNING. IT RESPONDED NORMALLY AFTER THAT.  DEALERSHIP SAID A COMMUNICATION CODE SHOWED BUT WAS NOT RELATED TO MY ISSUE. I HAD THREE OTHER \"LOSS OF POWER INCIDENTS\" SINCE ALL AT LOW SPEED, EITHER STARTING FROM A STOP OR ATTEMPTING ACCELERATION AFTER A TURN.  THE YELLOW TRIANGLE FLASHED THOSE TIMES BUT TRAFFIC DID NOT ALLOW ME TO KEEP PUSHING ON ACCELERATOR.  AFTER A SHORT COAST POWER RETURNED. DEALERSHIP REPORTED NO CODE.  EXPERIENCE SIMILAR TO DESCRIPTION OF BEHAVIOR OF VEHICLES IN TOYOTA FUEL PUMP RECALL.  I BELIEVE IT IS THE FUEL PUMP.  DEALERSHIP AND TOYOTA CUSTOMER SERVICE TELL ME I MUST DRIVE IT UNTIL IT \"FAILS\" AND SHOWS A CODE.  SAFETY ISSUE, ACCIDENT WAITING TO HAPPEN.",
        "vin": "5TFAY5F19LX"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/15/2020",
        "dateOfIncident": "12/29/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364600,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WE  PURCHASED A BRAND NEW TUNDRA AND FROM THE MINUTE WE DROVE HOME THERE SEEMED TO BE A BOUNCE OR VIBRATION LIKE RUNNING OVER RUMBLE STRIPS IN THE FRONT END. WE THEN NOTICED THE BED WAS MOUNTED TO THE PASSENGER SIDE BY ABOUT A HALF AN INCH WHICH TO ME TELLS THEY DIDN'T DO A VERY GOOD FINAL CHECK BEFORE IT LEFT THE FACTORY. WE TOOK IT TO THE SHOP AND THEY TRIED FOUR DIFFERENT TIRES AND THE MECHANIC STATED IT ACTUALLY MADE THE VIBRATION WORSE. EACH OF THREE TIMES IT WAS IN THE SHOP THAT THEY TRIED TO RECTIFY THE SITUATION THEY RE ALIGNED THE TRUCK. I WONDERED WHY EACH TIME WITHOUT MUCH DRIVING AND NO OFF ROAD DIVING IT WAS OUT OF ALIGNMENT THREE TIMES WITHIN ONE OR TWO MONTHS. AN INDEPENDENT MECHANIC I HAD A CASUAL CONVERSATION WITH SAID IF THEY DON'T FIND AND FIX THE ACTUAL MECHANICAL PROBLEM SUCH AS A BAD CV JOINT IT WILL GO OUT OF ALIGNMENT AS SOON AS YOU DRIVE OUT OF THE SHOP. THE SAFETY ISSUE THAT MAKES IT VERY SCARY TO DRIVE IS THE TRUCK WANDERS OR FLOATS TO THE RIGHT WHILE DRIVING OR BRAKING AND AT TIMES WHEN BRAKING THE STEERING WHEEL TURNS RIGHT SEVERELY BY ITSELF WHILE THE TRUCK CONTINUES TO TRAVEL STRAIGHT. THE MORE YOU DRIVE AND THE WARMER EVERYTHING GETS THE WORSE IT GETS. IT WILL EVEN DRIFT RIGHT FROM THE WRONG SIDE OF THE ROAD PROVING IT IS NOT DUE TO THE CROWN OF THE ROAD. IT WILL TRAVEL COMPLETELY RIGHT FROM THE FARTHEST POINT LEFT. THE SERVICE MANAGER STATED HE FELT WHAT WE WERE DESCRIBING BUT THAT IT MIGHT BE A CHARACTERISTIC OF THAT TRUCK AND WANTED SPECIALISTS FROM TOYOTA TO COME TO THE SHOP TO TRY TO LOCATE THE EXACT CAUSE RATHER THAN THROWING PARTS AT IT AND NEVER LOCATING THE ACTUAL PROBLEM. TOYOTA HAS NOT OFFERED ANY ASSISTANCE TO HIM OR US AS OF YET. WE CAN NOT DRIVE THIS TRUCK WITHOUT FEELING WE ARE IN DANGER. WE OWNED A 2015 TUNDRA PRIOR THAT HAD NO PROBLEMS AT ALL. UPON RESEARCHING WE ARE NOT THE ONLY PEOPLE EXPERIENCING THESE EXACT ISSUES.",
        "vin": "5TFUY5F19LX"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/25/2020",
        "dateOfIncident": "07/07/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361122,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN WEATHER GETS WARM (100F+), IT WILL OFTEN TAKE A FEW SECONDS TO START THE CAR.  IT CRANKS OVER, BUT WON'T CATCH.  WHEN  WEATHER GETS TO 110F, IT WOULD FAIL TO START AFTER IT HAS BEEN DRIVEN, THEN PARKED.  WAIT 90 MINUTES, AND IT WOULD STARTS AGAIN.    THIS IS A SAFETY ISSUE, BECAUSE WHEN WEATHER IS 110F+, IT IS VERY VERY UNCOMFORTABLE WAITING FOR A TOW TRUCK (THEY ARE USUALLY SUPER BUSY ON A HOT DAY) OR WAIT 90 MINUTES PLUS IN 110F+ WEATHER.  TOYOTA HAS REFUSED TO FIX IT, AS THEY SAY THEY NEED TO WAIT FOR A 110F+ DAY TO DUPLICATE THE ISSUE,",
        "vin": "5TFDY5F1XLX"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/09/2020",
        "dateOfIncident": "08/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354056,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WILL NOT START IN HOT WEATHER (115F+). THIS IS EXTREMELY DANGEROUS. BOTH TIMES I GOT STUCK IN 115-117F WEATHER OUTDOOR. TOYOTA DEALER SAY THEY CAN'T REPLICATE ISSUE AS THERE NEEDS TO BE A 115F+ WEATHER.",
        "vin": "5TFDY5F1XLX"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/27/2020",
        "dateOfIncident": "05/22/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351487,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON FILLING UP WITH FUEL AT VARIOUS FUEL STATIONS, WHEN THE PUMP SHUTS OFF AND IS REMOVED FROM THE FILLER NECK, FUEL BEGINS TO COME BACK OUT THE FILLER NECK AND POUR OUT ONTO THE VEHICLE AND GROUND. VEHICLE ONLY HAS 2000 MILES ON IT AND HAS DONE THIS FROM DAY ONE. THE SPILLS HAVE RANGED FROM A CUP FULL TO HALF A GALLON MAKING A HAZARDOUS AND POTENTIALLY DEADLY SITUATION. ANOTHER DEALER IN NM ADVISED SOME TOYOTA VEHICLES HAVE DONE THIS DUE TO A DEFECTIVE OVERFLOW VALVE IN THE FUEL TANK. MY LOCAL DEALER HAS HAD ME RETURN SEVERAL TIMES EVEN THOUGH I HAVE VIDEO EVIDENCE OF THE DEFECT. TOYOTA USA HAS ALSO NOT BEEN HELPFUL WITH TRYING TO FIX THE PROBLEM.",
        "vin": "5TFDY5F11LX"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/30/2020",
        "dateOfIncident": "07/29/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342298,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A NEW 2020 TOYOTA TUNDRA 4X4 CREWMAX AND IT IS NOT PERFORM TO WHAT A V-8 POWERTRAIN OF 5.7 LT, AND 381 HORSE POWER SHOULD BE.  THE ACCELERATOR ON THIS 2020 TUNDRA IS NOT FUNCTIONING PROPERLY.  IT WILL NOT ACCELERATE WHEN I STEP ON THE GAS PEDAL, WHICH ALMOST STALL BEFORE IT MOVES.  IN ADDICTION, I OWNED A 2007 TUNDRA 4X4 CREWMAX AND THERE WAS NOT A SINGLE ACCELERATION PROBLEM.    THE VIN# FOR MY NEW 2020 TUNDRA CREWMAX IS: [XXX].  I BELIEVE TOYOTA HAS INSTALLED THE ACCELERATOR INCORRECTLY OR THEIR FUEL PUMP IS NOT WORKING PROPERLY ON THIS NEW 2020 TUNDRA MODELS.      REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *CC",
        "vin": "5TFDY5F1XLX"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/17/2020",
        "dateOfIncident": "06/29/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339990,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 TOYOTA TUNDRA. THE CONTACT STATED THAT WHILE DRIVING AT 6 MPH, AN ABNORMAL SOUND WAS HEARD COMING FROM THE VEHICLE.  THE VEHICLE WAS TAKEN TO TOYOTA OF DEKALB (1890 SYCAMORE RD, DEKALB, IL 60115 (815) 748-7300) TO BE DIAGNOSED SAID IT WAS THE ABS ACUATOR. THE MECHANIC WAS UNABLE TO PROVIDE A CAUSE FOR THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED BUT NO FURTHER ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS 800.*DT*JB",
        "vin": "5TFUY5F11LX"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/09/2020",
        "dateOfIncident": "06/25/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338467,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT TURNING INDICATORS ARE TOO DIM FOR DAYTIME USE. I HAVE HAD SEVERAL CLOSE CALLS WITH VEHICLES NOT REALIZING MY INDICATOR WAS ON.",
        "vin": "5TFHY5F18LX"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "07/08/2020",
        "dateOfIncident": "04/29/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338155,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SON WAS DRIVING MY 2020 TOYOTA TUNDRA AND HE WAS TRAVELING APPROXIMATELY 30 MPH AND WAS NOT PAYING ATTENTION AND FOR SOME REASON THE PRE COLLISION SYSTEM DID NOT ENGAGE AND STOP OR EVEN SLOW THE TRUCK DOWN HE SLAMMED INTO ANOTHER TRUCK AND THAT TRUCK WAS PUSHED INTO ANOTHER CAR LUCKILY NO ONE WAS HURT.",
        "vin": "5TFDY5F11LX"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/20/2020",
        "dateOfIncident": "06/20/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329838,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INTEGRATED BRAKE CONTROLLER WORKS INTERMITTENTLY.  RECEIVE TWO ERRORS THAT STATE \"TRAILER WIRING TYPE OR CONNECTION FAULT\" AND \"PRE-COLLISION SYSTEM MALFUNCTION\".  AFTER THE ERROR IS RECEIVED, THE TRAILER BRAKES NO LONGER FUNCTION.  IF THE VEHICLE IS TURNED OFF AND ON AGAIN THE ERRORS GO AWAY AND THE BRAKES WILL FUNCTION AGAIN.  THE PROBLEM SEEMS TO OCCUR MOST OFTEN WHEN USING THE MANUAL SWITCH ON THE CONTROLLER.  BOTH TRUCK AND TRAILER ARE NEW (LESS THAN 6 MONTHS OLD).  *TR",
        "vin": "5TFDY5F18LX"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/08/2020",
        "dateOfIncident": "09/17/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316820,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT 2020 TOYOTA TUNDRA 1794, BLACK. I LOVE THIS TRUCK, BUT IT ANNOY ME WHEN EVERY TIME I START THE VEHICLE AND DRIVE ABOUT 15MILES/HOUR I HEAR AND FEEL A \"CLUNK\" SOUND UNDER THE FRONT DRIVE SIDE, AND FEEL IT ON THE GAS PEDAL. I HEARD THIS SOUND AFTER 5 DAYS SINCE I BOUGHT IT, I CALLED THE DEALER AND SET UP APPOINTMENT. I BROUGHT IT TO DEALER WHERE I BOUGHT IT, THEY CANNOT FIX IT. THAT PROBLEM BOTHERS ME ALL THE TINE. I DON'T KNOW THAT TO DO WITH IT.",
        "vin": "5TFAY5F13LX"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/13/2020",
        "dateOfIncident": "02/11/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11308895,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "A DUMP TRUCK CAME OFF OF THE HIGHWAY AND MADE AN ILLEGAL TURN IN FRONT OF ME. HE CAUSED A FRONTAL IMPACT ON MY VEHICLE AND THE AIR BAGS DID NOT DEPLOY.  I WAS TRAVELING 55 MPH WITH A TRAILER ATTACHED AND SLAMMED ON BRAKES BUT STILL IMPACTED HIM REALLY HARD.  I WAS ON THE FEEDER OR FRONTAGE ROAD.",
        "vin": "5TFEY5F11LX"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/10/2019",
        "dateOfIncident": "11/10/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279292,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT TURN SIGNAL BULBS ARE TOO DIM TO VIEW DURING DAYLIGHT OPERATION. THIS CREATES A VERY SERIOUS, AVOIDABLE ACCIDENT RISK WHILE ONCOMING TRAFFIC CANNOT CLEARLY OBSERVE TURN SIGNAL INDICATORS DURING DAYLIGHT HOURS.",
        "vin": "5TFAY5F10LX"
    }
]