[
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/24/2021",
        "dateOfIncident": "09/20/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434231,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Toyota Prius. The contact stated that while, driving approximately 5 mph, making a right turn, the vehicle suddenly accelerated, jumped the curb, and crashed into the bushes. The brake pedal was applied however, failed to respond. There were no warning lights illuminated. There were no reported injuries, police report or air bag deployment. The vehicle was towed to an independent body shop. The vehicle was towed to the local dealer but the vehicle was not diagnosed or repaired. The manufacturer was notified however no further assistance was provided. The contact was concerned about driving the vehicle. The failure mileage was 15,670.",
        "vin": "JTDKARFU6L3"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/06/2021",
        "dateOfIncident": "08/06/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428132,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2020",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Toyo Tire Holdings of Americas, Inc.",
                "productMake": "TOYO",
                "productModel": "ALL RADIAL TIRE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I was making a left turn into my subdivision after a full stop.  My speed was no more than 5 MPH.  The Toyota dealer informed me that the sidewall had blown and was not repairable.  They had no definitive cause as to why the tire blew.  The tire was retained by the dealer. The tire size is P 195/65R15 and is a Toyo NanoEnergy A41 Tire.  It was original equipment on the Toyota Prius as built in Japan.  I have found that the tire has no manufacturer's warranty. I just returned from a vacation three days ago driving from Hilton Head Island, SC.  Had this happened on the interstate system, the results to me, my wife, or other drivers could have been very different.   To the best of my knowledge, the tire has not been inspected by any party.  I was not given any tire DOT information on the new tire.",
        "vin": "JTDL9RFU9L3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/26/2020",
        "dateOfIncident": "12/14/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385018,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ORIGINAL TIRES FROM DEALERSHIP",
        "vin": "JTDKARFU7L3"
    },
    {
        "components": "POWER TRAIN,STRUCTURE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/02/2020",
        "dateOfIncident": "06/06/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361838,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 TOYOTA PRIUS. CONSUMER WRITES IN REGARDS TO NEEDING TRANSMISSION REPAIR AFTER VEHICLE WAS TOWED. *LD    THE CONSUMER STATED THE AXEL RODS, RIMS NEEDED TO BE REPAIRED/REPLACED, STEERING ISSUES,. REAR WHEEL ISSUES, AND BUMPER REPLACEMENT. *JS",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "08/12/2020",
        "dateOfIncident": "08/10/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11348886,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DAD WAS DRIVING ON THE HIGHWAY. HE SAID THAT HE STEPPED ON THE BRAKES AND THE BRAKES DID NOT WORK. HE GOT INTO AN ACCIDENT IN WHICH THE ALL AIRBAGS WERE DEPLOYED AND THE CAR WAS TOTALED.  THE CAR ONLY HAD 700 MILES.  I BELIEVE THIS WAS THE SECOND TIME THAT MY DAD DROVE THIS CAR ON THE HIGHWAY.      MY MOM, WHO WAS A PASSENGER, SAID THAT THE CAR ACCELERATED VERY QUICKLY.      PRIOR TO PURCHASING THIS CAR, MY DAD HAD DRIVEN A PRIUS (2010 - 2012?), SO HE WAS VERY FAMILIAR WITH THE FEEL OF THE PRIUS.  THE CLAIM # IS [XXX].  ATTACHED PLEASE FIND THE POLICE REPORT AS WELL AS A PICTURE OF THE TOTALED CAR.    PLEASE NOTE THAT I AM FILING THIS COMPLAINT ON BEHALF OF MY PARENTS.*DT  CONSUMER HAS CONTACTED MANUFACTURE.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'*JB",
        "vin": "JTDL9RFU4L3"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/29/2020",
        "dateOfIncident": "05/21/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326556,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "PROXIMITY SENSORS GENERATED AN ALERT THAT  PARKING ASSISTANCE SENSORS NEEDED CLEANING DURING MODERATE RAIN  CLEANING THE SENSORS DID NOT RESOLVE THE ISSUE.  STOPPED AT DEALER TO HAVE IT CHECKED AND WAS ADVISED THAT THE SENSOR DO THAT IN INCLEMENT WEATHER AND I WOULD NEED TO LEARN TO LIVE WITH IT.  IF IT WAS JUST THE PARKING SENSORS IT WOULD NOT BE AS SIGNIFICANT BUT I DID DETERMINE THE  FRONT ACCIDENT ASSISTANCE DID NOT FUNCTION AS IT SHOULD HAVE - AS I APPROACHED A VEHICLE IN FRONT OF ME WITH CRUISE CONTROL THE SPEED REDUCTION THAT WAS SUPPOSED TO OCCUR DID NOT HAPPEN.  HAD I NOT BEEN CHECKING TO SEE WHAT WOULD HAPPEN IF THE PROXIMITY SENSORS WERE MALFUNCTIONING IT COULD HAVE RESULTED IN AN ACCIDENT.  I DID NOT ATTEMPT ANY OTHER ACTIONS WHICH RELY ON PROXIMITY SENSORS TO FUNCTION AS I DID NOT WANT TO CAUSE OR BE INVOLVED IN AN ACCIDENT.  I WAS DRIVING AT THE TIME AND I EXPECT THAT ALTHOUGH THE ALERT SPECIFICALLY MENTIONED PARKING SENSORS, THE FACT THAT THE CAR DID NOT SLOW AS TOYOTA HAS INDICATED IT SHOULD LEADS BE TO BELIEVE THAT ANY AND ALL \"DRIVER ASSISTANCE TECHNOLOGIES\" MAY FAIL WHEN THAT ALERT OCCURS RESULTING IN POTENTIAL ACCIDENTS AND INJURIES  THE VSC OFF INDICATOR WAS FLASHING AT THE TIME.  *TR",
        "vin": "JTDKARFU1L3"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/28/2020",
        "dateOfIncident": "03/27/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319576,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE MULTI INFORMATION DISPLAY THAT SHOWS THE SPEED, FUEL, AND OTHER DRIVING METRICS STOPPED WORKING, I AM NOT ABLE TO SEE HOW FAST I AM GOING, HOW MUCH FUEL IS LEFT, ODOMETER OR OTHER ITEMS THAT IS DISPLAYED THERE.",
        "vin": "JTDKARFU3L3"
    }
]