[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/13/2022",
        "dateOfIncident": "03/13/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456525,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The front portion of the panoramic sunroof/moonroof blew out with a loud boom while my husband and I were driving on interstate 75 south in Florida. The flying glass could have injured us had the shade not been closed or if it had been raining and possibly caused an accident.  I saw that another person had the same experience with a 2018 Toyota Highlander XLE with a panoramic moonroof listed on Toyota Nation on Oct 3, 2019.  It has not yet been inspected.  Insurance company was notified.  No warnings or symptoms of the exploding moonroof occurred prior to the failure.  It just happened today about 1 1/2-2hr ago.About 6pm.",
        "vin": "5TDEBRCH3LS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/28/2022",
        "dateOfIncident": "02/28/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454587,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "When going downhill and applying the brakes slightly. You keep your foot constant on the brake pedal. Braking some. The car would suddenly release the brakes for a second or two at speed about 35-40 mph. Then it catches up the brakes again. This looks really dangerous when you drive. I don't like this at all. It happens regularly to me. Maybe once a week or so. I started noticing it a while ago.",
        "vin": "5TDHBRCH3LS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/10/2022",
        "dateOfIncident": "02/10/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451313,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "On several occasions, using the key fob to remote start the car, once unlocking the car, the car doesn't turn off as it should when unlocked or touching the drivers side door.  Once in vehicle (car still running), car is unresponsive until shifted from Park, then the engine shuts off and car is disabled for 10-15 minutes.  Will not start, unresponsive to touching the push start ignition and dash says \"Not ready to Drive.\"  Brake pedal gets very hard.  Have been unable to video the actions of the remote start in order to get it to a dealership.",
        "vin": "5TDGZRBH6LS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/08/2022",
        "dateOfIncident": "02/09/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450974,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Fuel gauge is inaccurate, leading to potential safety issues. The fuel gauge does not show as full, when the car is refueled, and likewise shows as empty when there is enough fuel to drive hundreds of miles. This has led to situations where the fuel light is on, and car is indicating no remaining miles left, but there is plenty of fuel.   Toyota knows there is a problem. I started a Lemon Law claim with the Washington State Attorney's General office and notified Toyota. They have offered to replace my vehicle, which is currently in process.",
        "vin": "5TDEBRCH1LS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/03/2022",
        "dateOfIncident": "12/08/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450286,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving on the highway at about 65 mph, there were no cars beside me, when there was a loud explosion type noise. I noticed the passenger side mirror had flipped into the window. The cover on the mirror exploded causing damage to the hood and side panel of the vehicle.",
        "vin": "5TDYZRAH3LS"
    },
    {
        "components": "SERVICE BRAKES,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "01/18/2022",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447885,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Toyota Highlander. The contact stated that upon the depression of the brake pedal, the vehicle would intermittently surge forward without warning. The contact stated that he would shift the vehicle into neutral to stop the vehicle from surging. The contact also stated that the blind spot monitor's unavailable warning message would intermittently appear on the instrument panel. The contact had taken the vehicle to Bayside Toyota and Waldorf Toyota and each dealer was unable to duplicate or diagnose the cause of the failure. The manufacturer was not notified of the failure. The vehicle was not repaired. The failure mileage was approximately 21,000.",
        "vin": "5tdbzrbh2ls"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/02/2021",
        "dateOfIncident": "11/22/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442428,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving on a freeway with no cars in front of me and no debris in the air when our panoramic sunroof spontaneously exploded. The glass blew upwards and the remaining glass around the edges were pointed upwards as if the window had suffered an internal to external impact. Fortunately, the fabric was closed and it could have resulted in a severe accident with glass going everywhere.",
        "vin": "5TDFZRBH0LS"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/16/2021",
        "dateOfIncident": "11/12/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440668,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Toyota Highlander. The contact stated while driving approximately 55 MPH, there was a sudden explosion and the passenger’s side mirror casing dislodged from the vehicle causing damage to the passenger’s side window trim and the hood of the vehicle. The cause of the failure was not determined. The local dealer was notified of the failure. The manufacturer was not yet notified of the failure. The failure mileage was 30,000.",
        "vin": "5tdbzrbh1ls"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/15/2021",
        "dateOfIncident": "06/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440447,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Since purchasing this vehicle I began to notice that the fuel gauge is inaccurate. This issue is sporadic. Often after filling the gas tank completely, the gauge will only register as 3/4 full. Like wise, it is inaccurate when the tank gets low, showing that there is 1/4 tank, when in fact it is nearly empty.   The \"remaining miles\" indicator that displays is likewise inaccurate and often the low fuel indicator light comes on when it shouldn't, and doesn't display when it should.   I have had it to the deal 4 times now for repair. Initially they told me nothing was wrong, then indicated that a software update was necessary. When that didn't fix it, I returned the vehicle and they indicated an instrument panel  sensor chip needed to be replaced. I waited a month for that to happen and it didn't fix the issue.   I then opened a trouble incident with Toyota USA and after several weeks received a call back from the dealer indicating this is a known (presumably still developing) issue and has something to do with a faulty gas tank that causes the readings to be inaccurate. The dealer indicated that they know this will require the gas tank to be replaced but that they don't have parts to do this and will contact me at some point in the future.   This is a serious safety issue, as it could lead to the vehicle running out of gas while driving, without any indication that the fuel is low. The only way to have any certainty regarding the fuel level is to do a calculation each time you drive based on the estimated fuel economy and # of miles driven since the last fill up.",
        "vin": "5TDEBRCH1LS"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/14/2021",
        "dateOfIncident": "04/28/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11432992,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "While making a legal left turn on a green arrow, we were struck on the passenger side of our vehicle by a vehicle that did not stop at the red light.",
        "vin": "5TDHZRAH7LS"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "08/27/2021",
        "dateOfIncident": "08/23/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430693,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The driver seat started making a motorized noise 2-3 days after I purchased the vehicle. Over the few months from my oil change the noise got louder and louder as we moved the seat back and forth. When I took my vehicle in for its first oil change I addressed it to the dealership as the seat was now no longer able to move forward or backwards. During their inspection they stated there was a lego which was not possible as I had at the time a 1 & 2 year old who would choke on a lego so there is no way I would allow them to play with legos that small, mega blocks okay because those are huge but legos are too small. Anywho the seat was functionable after the inspection which lasted about a month and then went out again. I then brought it up again at the next oil change which they Checked it out and it worked a bit then went out again. The last time I took my vehicle in for its last oil change I addressed it, they took it apart and left it that way as it is now but were unable to locate the reason why it was defaulted. I however found that a piece was missing from one side of the track under the seat but they couldn't see that it was the reason for the malfunction. I have tried multiple times at least 5 times and speaking with the 2 service managers but to no avail this driver seat still can not be adjusted which means no one can drive my vehicle aside from myself not even in case of an emergency. There are no warning lights or alerts that come up.",
        "vin": "5tdgzrah6ls"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "08/18/2021",
        "dateOfIncident": "08/04/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429580,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Several times pulling out from stop signs I failed to see cars coming from the passenger side. On August 4th 2021 I failed to see a car until it was directly in front of me and I collided with it. Wondering how I could have failed to see it I started doing research on the internet. I discovered others had this same problem also involving an accident. It was brought to my attention the mirrors are large and placed high in regards to the passenger window. I noted others sighted their height as part of the problem. I have a bad back and kept my seat low to ease getting in and out of the vehicle. My vehicle was totaled but the air bags never deployed and no one was injured.",
        "vin": "5TDYARAH1LS"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "07/24/2021",
        "dateOfIncident": "07/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426238,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The lane keeping assist does not work properly on my vehicle.  The lane keeping assist does not keep my car in the center of the lane as intended.  For instance, it very forcefully makes the car drift to the left and right of the lane and frequently pulls it into the other lane.  I have reported this to my local dealership - Sparks Toyota in Myrtle Beach, SC and Toyota Corporate.    Sparks Toyota service has admitted that there are many customer complaints about this issue.  They have stated that there is a software download \"fix\" in the works, but not yet available.  I did not take their word for this and called Toyota Corporate.  The only \"solution\" I have been offered is an offer to show me how to turn the feature off.  This is totally unacceptable as the is an important safety feature that does not work properly and in fact, creates an unsafe situation while driving.  Since my report of the issue, I have been made aware of an owners Facebook forum that other owners state they are having the same issue and seems to be a widespread problem.",
        "vin": "5TDYZRAH3LS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/11/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424273,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I have a 2020 Highlander hybrid.  When I brake my stopping pauses a half second to a second then brakes normally. I am afraid that I can get into an accident due to this happening at the wrong time or if I loan my car to another driver that is not aware of the problem. I took it to the dealer and couldn't reproduce the fault with their computer connected. Though this has been happening about every other day or so. there were no warnings prior, it just happens randomly!  Please go to the attached Toyotanation.com link to see other people having the same issues with their Highlander Hybrids.  https://www.toyotanation.com/threads/2021-highlander-hybrid-platinum-not-braking-properly.1694783/",
        "vin": "5tdfarah0ls"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/28/2021",
        "dateOfIncident": "06/18/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422560,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Horizon Global",
                "productMake": "TEKONSHA",
                "productModel": "PRODIGY ELEC. BRAKE CONTR",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "The contact owns a 2020 Toyota Highlander equipped with a Tekonsha Prodigy RF Electronic Brake Control with Bluetooth kits, part number 902501. The contact purchased the unit to use for towing a trailer. The contact purchased the part at an independent mechanic and had the equipment installed by another independent mechanic. When the contact first attempted to use the brake kit, her and her husband had connected the equipment per the instructions and brake kit showed the letter \"C\" which meant the part was connected. As the contact started driving the vehicle, a NC (not connected) message had appeared on the brake kit. The contact decided to drive the vehicle back to her home and attempted to reconnect the brake system as instructed but the failure persisted. Upon investigation, the contact discovered that the equipment had been placed under NHTSA Campaign Number: 20E033000 (Electrical System). The contact reached out to the independent mechanics, the one who sold the part and the other that installed it, and neither were aware of the recall. The contact also called the manufacturer and had written a letter to obtain the replacement part however, the contact had not heard back from the manufacturer. The vehicle was not repaired. The failure mileage was 0.",
        "vin": "5tdgzrbh1ls"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/24/2021",
        "dateOfIncident": "06/23/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422101,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Toyota Highlander. The contact stated that while his wife was driving 55 mph the sunroof exploded without warning or impact. There were no reported injuries. The vehicle was taken to the local dealer. The vehicle was not diagnosed or repaired. The manufacturer was notified. The failure mileage was 15,600.",
        "vin": "5TDDZRBH2LS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/14/2021",
        "dateOfIncident": "06/14/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420835,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "My Toyota Highlander is a hybrid and there is an ongoing problem with the brakes under certain conditions. When you are slowing the vehicle down, with your foot on the the brakes, there is a point under 10 miles an hour, where the brakes appear to let go and you must quickly exert dramatically more pressure on the brakes to stop the car. Fortunately it has not resulted in an accident because my wife and I are aware of the potential danger. The danger is, this occurs when you are stopping at a stop sign or crosswalk, pulling into a parking space, or around pedestrians, even pulling into our garage. I have own previous Toyota Hybrids and this vehicle behaves very differently. In my opinion the route of the problem may be the regenerative braking. As you step on the brakes the regenerative braking supplies most of the braking power and then at a slower speed the regenerative braking abruptly  dis engages. It seem there should be a way to smooth the erratic behavior of the brakes. I have filed my concerns with the Toyota customer experience center in November of 2020 under my name and file number #2011280027. The car is available anytime to demonstrate the problem, there are no open recalls for this VIN#, and I have been told there are no service bulletins for this problem. The problem has occurred the whole time I have owned the vehicle.",
        "vin": "5tdgarah5ls"
    },
    {
        "components": "STEERING,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "05/18/2021",
        "dateOfIncident": "04/17/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11417587,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "In my 2020 Highlander I approached a stop sign at a \"T\" intersection behind 4 other cars.  After stopping and looking to see road was clear of oncoming traffic, I pulled out and started my left turn.  As I was turning into my lane the car engine turned OFF and the steering wheel was LOCKED in the left position.  There was no power for the brakes, which left me jamming on the brake pedal as hard as I could only slowing the car slightly.  The steering wheel was LOCKED LEFT and I thought I was going to break it trying to force it back. With no ability to move the steering wheel or brake, I braced myself as the Highlander continued turning in the left direction into the other lane.  The result was a head on collision with a Mini Cooper, both cars totaled, and injuring both myself and the other driver.   Highlander was investigated by forensic company in the employ of the insurance company, but they could not find any error in the cars CDR (Crash Data Retrieval) system.",
        "vin": "5TDBZRBH0LS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/04/2021",
        "dateOfIncident": "05/03/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415176,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS WILL NOT FILL UP TO THE ADVERTISED AMOUNT.  DISTANCE TO EMPTY METER IS NOT CALIBRATED CORRECTLY.  OTHERS ON TOYOTA FORUMS EXPERIENCE THE SAME ISSUE.",
        "vin": "5TDHBRCH9LS"
    },
    {
        "components": "STEERING,SERVICE BRAKES,ENGINE",
        "crash": true,
        "dateComplaintFiled": "04/19/2021",
        "dateOfIncident": "04/17/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11412850,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS AT A STOP SIGN IN MY 2020 HIGHLANDER WAITING TO TURN LEFT ONTO A BUSY ROAD.  UPON TURNING LEFT ONTO PA STATE HIGHWAY 999, THE HIGHLANDER ENGINE TURNED OFF AND THE STEERING WHEEL WAS \"LOCKED\" INTO A LEFT POSITION.  THIS CAUSED THE CAR TO CONTINUE TURNING INTO THE OPPOSING LEFT LANE RESULTING IN A HEAD-ON COLLISION WITH AN ON-COMING CAR.  WITH THE ENGINE TURNED OFF THERE WAS NO POWER STEERING, NO BRAKES, AND NO WAY TO UNLOCK THE STEERING WHEEL.  THE COLLISION CAUSED MY CAR TO BOUNCE BACK AND SLOWLY FREE ROLL BACK TO THE STOP SIGN AS THOUGH I NEVER ENTERED THE ROADWAY.",
        "vin": "5TDBZRBH0LS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/31/2021",
        "dateOfIncident": "02/28/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405736,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "EACH TIME I FILL UP THE CAR WITH GAS I AM UNABLE TO FILL THE TANK TO ITS LISTED CAPACITY.  THE VEHICLE HAS A 17 GALLON TANK, BUT WHEN THE VEHICLE IS NEAR EMPTY (1-2 GALLONS REMAINING) I CAN PUMP IN ONLY 12-13 GALLONS OF GAS.  THIS GREATLY IMPACTS THE RANGE OF THE VEHICLE.  THE DATE SHOWN BELOW IS MY MOST RECENT FILL-UP, BUT IT HAS HAPPENED EACH TIME I FILL UP.  I HAVE REPORTED THIS TO MY TOYOTA DEALER.",
        "vin": "5TDHBRCH6LS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/07/2021",
        "dateOfIncident": "03/03/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399660,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE IS SOLD AS HAVING A 17 GALLON FUEL TANK. I'VE DRIVEN THE VEHICLE FOR 5000 PLUS MILES NOW. I HAVE NEVER BEEN ABLE TO GET MORE THAN 13 GALLONS OF FUEL INTO THE TANK. I HAVE WAITED UNTIL THE GAGE SAID THERE WAS ONLY 12 MILE UNTIL EMPTY. STILL COULD ONLY FILL UP WITH ON 13 GALLONS OF FUEL. THE GAGE SAY'S IT'S FULL. I HAVE MADE THE TOYOTA DEALERSHIP AWARE OF THE ISSUE. BUT THEY SAID THERE WAS NOTHING ON THEIR SYSTEM ABOUT A RECALL OR NEEDED REPAIR. IF THE VEHICLE IS ADVERTISED AS HAVING A 17 GALLON TANK I SHOULD BE ABLE TO USE THAT WHALE 17 GALLONS OF FUEL. INSTEAD I CAN ONLY FILL UP TO 13 GALLONS.",
        "vin": "5TDGBRCH7LS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/21/2021",
        "dateOfIncident": "02/19/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397191,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "UNABLE TO COMPLETELY FILL FUEL TANK. WHEN FUEL LIGHT COMES ON AND I GO TO FILL IT, I GET NO MORE THAN 13 GALLONS IN MY TANK. THE FUEL GAUGE ONLY READS 3/4 FULL. NEVER COMPLETELY FULL.",
        "vin": "5TDEBRCH4LS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/13/2021",
        "dateOfIncident": "02/12/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396050,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE DIED WHEN STOPPED AT STOP SIGN. AND THEN RESTARTED WHILE TRANSMISSION IN DRIVE.",
        "vin": "5TDBZRBH1LS"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/10/2021",
        "dateOfIncident": "02/09/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395569,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WILL NOT START WITHOUT A JUMP AFTER 3-5 HOURS. THE BATTERY STAYS CHARGED LESS THAN ONE DAY, BUT TYPICALLY STARTS AGAIN WITHOUT A JUMP IF DRIVEN AGAIN WITHIN A 3-5 HOUR PERIOD. THE VEHICLE STAYS RUNNING ONCE JUMPED. DEALER SERVICE DEPARTMENT INDICATES A SOFTWARE UPDATE MAY BE REQUIRED. THIS HAS HAPPENED SINCE PURCHASE ON JUNE 7, 2020. DATE BELOW IS THE MOST RECENT DATE IT OCCURRED.",
        "vin": "5TDEBRCH1LS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/05/2021",
        "dateOfIncident": "02/05/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394879,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 TOYOTA HIGHLANDER HYBRID AWD.  WHEN FILLING FROM ALMOST EMPTY (PER LOW FUEL WARNING LIGHT AND DISTANCE TO EMPTY READING ALMOST 0), TANK ONLY ACCEPTS ~12.5 GALLONS BEFORE GAS STATION FUEL NOZZLE AUTO CLICKS OFF. THE FUEL GAGE AT THIS POINT INDICATES THAT THE VEHICLE IS ~7/8 FILLED. THE OWNERS MANUAL WARNS ABOUT NOT ATTEMPTING TO FILL AFTER THE FUEL NOZZLE AUTOMATICALLY CLICKS OFF. BEING UNABLE TO FILL TANK MAY LEAD TO OWNERS ATTEMPTING TO OVERFILL TANKS AND COULD RESULT IN INADVERTENTLY SPILLING FUEL WHICH POSES A SAFETY RISK AND AN ENVIRONMENTAL DAMAGE RISK. IT CAN ALSO LEAD TO MORE EMISSIONS. A SIMILAR PROBLEM EXISTS WITH 2019/2020 TOYOTA RAV4 PER NHTSA RECORDS, TOYOTA HAS PROPOSED A FIX FOR THIS VEHICLE BUT HAS STATED THAT NO OTHER MODELS ARE AFFECTED BY THIS ISSUE. THE PROBLEM DESCRIBED ABOVE IS ALMOST IDENTICAL WITH THE EXCEPTION THAT THE VEHICLES HAVE DIFFERENT FUEL TANK CAPACITIES. TOYOTA HAS INDICATED THAT THIS IS \"NORMAL\".",
        "vin": "5TDEBRCH3LS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/26/2021",
        "dateOfIncident": "01/24/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389935,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "SO WHEN I WAS DRIVING AROUND SPEEDS OF 70MPH THE HIGHLANDER STARTS TO WOBBLE AND THE DRIVER MIRROR SHAKING I WENT TO DEALERSHIP AND THEY SAID THAT IT COULD BE A RECALL IN FUTURE AND DIDN'T FIX THE PROBLEM. HAD IT FOR LESS THEN ONE YEAR",
        "vin": "5TDZZRAH3LS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/25/2021",
        "dateOfIncident": "11/12/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389803,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN RE-FUELING THE VEHICLE WITH DTE OF LESS THAN 30 MILES, THE FUEL SHUTS OFF AROUND 12 GAL. 2ND CLICK FOR FUEL STOPPAGE MAY YIELD ANOTHER 0.5 GAL. NOTHING ADDS UP TO 17.1 GAL OF FUEL IN THE TANK. GOING BEYOND THE 1ST CLICK IS BAD FOR THE SYSTEM, YET ONLY FILLS THE CAR UP TO 7/8 FULL ON THE FUEL GAUGE.",
        "vin": "5TDEBRCH1LS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/21/2021",
        "dateOfIncident": "03/28/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389244,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL GAUGE DOES NOT PROPERLY REGISTER FULL HYBRID FUEL TANK (DESIGN) AND/OR DEFECTIVE  FUEL LEVEL SENDING UNIT.    TOYOTA SERVICE REPORT (6032680/1- 25 SEP 2020); TOYOTA SERVICE REPORT (6046594/1- 21 JAN 2021).",
        "vin": "5TDXBRCH9LS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/19/2021",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388861,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 TOYOTA HIGHLANDER HYBRID PLATINUM AWD  CANNOT FILL UP FUEL TANK ALL THE WAY. MAX CAN FILL IT UP WHEN IT SHOWS 0 MILES LEFT OF FUEL IS LESS THAN 13 GALLON AND CAR HAS OVER 17 GALLONS. TOYOTA IS SAYING THEY DON'T KNOW WHAT THE ISSUE IS. NO SOLUTION AT THIS TIME FOR A $50K CAR",
        "vin": "5TDEBRCH6LS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/17/2021",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388566,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL TANK CAPACITY LISTED AS 17.1 GALLONS BUT ONLY TAKE BETWEEN 12-12.5 GALLON WHEN FILLED UP, EVEN WHEN THE RESERVE HAS RAN DOWN WHERE MILE TO EMPTY IS NEAR ZERO.  TOTAL MILES RANGE BETWEEN FILL UPS IS UNDER 500 MILES, FAR LESS THAN THE 616 MILES RANGE CLAIMED BY TOYOTA.",
        "vin": "5TDYARAH7LS"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/13/2021",
        "dateOfIncident": "01/13/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387820,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WENT INTO LIMP MODE   REIEVED CODE P0300   REDUCED ENGINE POWER ON HIGHWAY WHEN ACCELERATING",
        "vin": "5TDDZRBH1LS"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/02/2021",
        "dateOfIncident": "12/31/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386179,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING 50 MILES/ HOUR VEHCLE STARTED LOOSING POWER AND STARTED TO SHAKE. ENGINE LIGHT CAME ON AND TWO DIFFERENT MESSAGES IN DASHBOARD POP OUT. ONE ABOUT HYBRID MALFUNCTION AND THE OTHER OUTPUT POWER REDUCED.",
        "vin": "5TDGBRCH7LS"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/23/2020",
        "dateOfIncident": "12/23/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384736,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WE RECENTLY PURCHASED OUR HIGHLANDER AND IT  HAS A LITTLE OVER 4,000 MILES.  TODAY WHILE DRIVING DOWN THE ROAD AT ABOUT 45 MPH, THE CAR JUST LOST POWER AND THE CHECK ENGINE LIGHT CAME ON.   1. CHECK ENGINE - REDUCED ENGINE POWER  2. SECONDARY COLLISION BRAKE SYSTEM MALFUNCTION    WE HAD TO PARK AND WAIT FOR THE TOYOTA DEALERSHIP TO COME AND TOW IT TO THE SERVICE CENTER. AT THIS POINT I DON'T KNOW WHAT WAS WRONG OR WHY IT JUST CUT OUT WHILE DRIVING. I AM VERY CONCERNED AND CAN ONLY HOPE TOYOTA CAN ADDRESS THIS OR REPLACE THE CAR.",
        "vin": "5TDGZRBH0LS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/13/2020",
        "dateOfIncident": "11/28/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383214,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE DRIVING IN THE FREEWAY AND SUDDENLY WE HEARD LIKE A \"BANG\" SOUND, LIKE AN EXPLOSION. WE LOOKED AROUND US AND WONDERED WHAT IT WAS. THEN WE HEARD THE AIR FROM THE ROOF SEEPING THROUGH AND WE TOOK AN EXIT, IT WAS A SHATTERED SUNROOF.  SINCE THE RAIN IS IN THE FORECAST AND WE WERE GOING ON A CROSS COUNTRY VACATION, WE USED A FLEX TAPE TO PREVENT FOR THE GLASS TO KEEP SHATTERING AND FROM THE RAIN.",
        "vin": "5TDYZRAH6LS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/07/2020",
        "dateOfIncident": "08/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378393,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GAS TANKS HOLDS 17 GALLONS OR ~570 MILES TO EMPTY. THE MOST I CAN FILL IT IS ~14 GALLONS OR ~470 MILES TO EMPTY. IT ALWAYS CLICKS OFF LIKE IT'S FULL. I'VE TRIED GENTLY TOPPING OFF, SLIGHTLY PULLING OUT FUEL MODEL ETC. NOTHING HAS WORKED. THIS HAS HAPPENED SINCE THE VEHICLE WAS NEW AND DRIVEN OFF THE LOT. THIS IS ALL WHILE THE VEHICLE IS PARKED AT A GAS PUMP.",
        "vin": "5TDHBRCH7LS"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "11/17/2020",
        "dateOfIncident": "10/02/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11375094,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 TOYOTA HIGHLANDER. THE CONTACT STATED THAT WHILE THE VEHICLE WAS TURNED OFF AND IN THE PARK POSITION IN ORDER FOR THEIR MOTHER TO UNLOAD THE TRUNK, THE VEHICLE SUDDENLY ROLLED AWAY IN REVERSE. THE VEHICLE ROLLED OVER THEIR MOTHER. ONCE THE INCLINE OF THE STREET WAS MORE OF A PLATO THE VEHICLE COASTED TO A STOP. THEY WERE ABLE TO CATCH UP TO THE VEHICLE AND RETURN THE VEHICLE TO THEIR HOME THE CONTACT STATED THAT THEIR MOTHER RECEIVED INJURIES TO HER FACE, RIGHT ARM, RIGHT HAND, LEFT RIB AREA, LEFT LEG, AND FOOT AREAS. MEDICAL ATTENTION WAS NEEDED. THE CONTACT HAD THE VEHICLE TOWED TO THE DEALER (HIGHLAND TOYOTA LOCATED AT 5500 45TH AVENUE DR, MOLINE, IL 61265; (309) 764-2481 ) WHO DIAGNOSED THAT NO DEFECT OR MALFUNCTION COULD BE DETECTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND SENT AN INVESTIGATOR. THE APPROXIMATE FAILURE MILEAGE WAS 500.",
        "vin": "5TDGZRBHXLS"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "11/16/2020",
        "dateOfIncident": "11/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374846,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BLIND SPOT MONITORING IS NOT WORKING. TOOK IT TO DEALERSHIP THY SAID IT NEEDED RE-CALIBRATION BUT IT STILL DOESN'T SEE SEMI TRUCKS.  MY WIFE ACCIDENTALLY RAN ANOTHER WOMEN OFF ROAD BECAUSE SHE TRUSTED THIS TOYOTA SYSTEM.  SYSTEM IS CURRENTLY STILL WORKING INTERMITTENTLY.",
        "vin": "5TDHZRBHXLS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/15/2020",
        "dateOfIncident": "10/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364594,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2020 TOYOTA HIGHLANDER HYBRID AWD IN MAY 2020. IN JUNE 2020, I NOTICED A DISCREPANCY BETWEEN THE GAS GAUGE ABS THE DISTANCE TO EMPTY INDICATOR. THE GAS GAUGE SAID THERE WAS 3/4 OF A TANK LEFT BUT THE DTE SAID I HAD ONLY 43 MILES. I WENT TO THE GAS STATION TODAY (OCTOBER 2020) TO FILL UP MY VEHICLE AND FILLED IT UNTIL THE GAS SHUT-OFF TRIPPED. I TURNED ON MY CAR AND NOTICED THAT MY GAS GAUGE SAID IT WAS ONLY 7/8TH FULL. THINKING IT TRIPPED TOO SOON I REFILLED IT AGAIN BUT ONLY 0.5 GALLONS WENT INTO TANK BEFORE THE SHUT-OFF TRIPPED AGAIN. WHEN I TURNED ON THE CAR THIS TIME THE GAS GAUGE INDICATED IT WAS FULL. I DOUBT THE GAS GAUGE IS FUNCTIONING PROPERLY.",
        "vin": "5TDBBRCH3LS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/15/2020",
        "dateOfIncident": "09/17/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364598,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN HAVING INTERMITTENT ISSUES WITH THE BRAKES WHEN TURNING ON MY CAR AND GOING IN REVERSE. ON ONE OCCASION, AFTER TURNING ON THE VEHICLE AND PUTTING IT IN REVERSE, THE VEHICLE DID NOT MOVE DESPITE BEING ON LEVEL GROUND. I HAD TO APPLY PRESSURE ON THE ACCELERATOR AND HEARD THE CAR STRAIN A LITTLE BEFORE I HEARD A SOUND COME FROM THE BRAKES AND THE CAR SUDDENLY JERKED BACKWARDS. I DID NOT HAVE MY FOOT ON THE BRAKES AND I DID NOT HAVE THE EMERGENCY BRAKE ON. AFTER THIS THE BAKES APPEARS TO FUNCTION AS USUAL.     ANOTHER TIME, I TURNED ON THE CAR AND WENT IN REVERSE BUT THE CAR DID NOT MOVE. I APPLIED THE ACCELERATOR AND HEARD THE CAR STRAIN A BIT THEN IT JERKED BACK. I APPLIED THE BRAKES BUT THE BRAKES WERE IN RESPONSIVE UNLESS I PUSHED ON THEM WITH SIGNIFICANT FORCE. I CAME TO A STOP AND THEM TOOK MY FOOT OFF THE BRAKE TO RESUME BACKWARD MOTION TO EXIT MY PARKING SPOT. AGAIN I DID NOT MOVE FORWARD AND HAD TO APPLY PRESSURE TO THE ACCELERATOR WHICH CAUSE THE CAR TO INITIALLY STRAIN THEN SUDDENLY JET BACKWARDS. I AGAIN APPLIED PRESSURE ON THE BRAKES WHICH AGAIN WERE INITIALLY UNRESPONSIVE UNTIL I PUT  SIGNIFICANT PRESSURE. THIS CYCLE HAPPENED A TOTAL OF 4-5 CONSECUTIVE TIMES PRIOR TO THE BRAKES RESUMING NORMAL FUNCTION. BRAKES FUNCTIONED NORMALLY BETWEEN THIS INCIDENT AND THE ONE MENTIONED EARLIER IN THIS COMPLAINT.",
        "vin": "5TDBBRCH3LS"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/26/2020",
        "dateOfIncident": "06/18/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341514,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "HIGHLANDER LE 2020 CAR HAS A BIG SAFETY ISSUE.WHEN I TURN OFF ENGINE WITH GEAR CHANGER IN D POSITION THE GEAR GOES IN N NEUTRAL POSITION WHILE STILL IN D POSITION WITHOUT GIVING ANY ALERT NOISE.I PARKED MY CAR IN 3RD FLOOR OF A PUBLIC PARKING WHERE THE FLOOR HAD SLOP, AND TURNED OFF ENGINE IN D POSITION BY MISTAKE AND STARTED READING AN EMAIL IN MY CELLPHONE WITHOUT LOOKING OUTSIDE OF CAR. THE CAR DIDN'T GIVE ANY ALERT NOISE SAYING THAT THE CAR IS TURNED OFF IN D POSITION.MY WIFE AND SON HAD EXITED THE CAR AND WERE WAITING FOR ME TO EXIT WHILE I WAS READING MY EMAIL IN MY CELLPHONE.I HEARD MY WIFE AND SON SCREAMING \" STOP THE CAR\" STOP THE CAR\" WHEN I LOOKED OUTSIDE AND SAW THAT THE CAR WAS ROLLING BACK TOWARDS OTHER PARKED CARS. I STOPED THE CAR AND TURNED ON ENGINE AND MOVED CAR FORWARD AND SHIFTED THE STICK TO P POSITION. I WAS REALLY SUPRISED WHY THIS CAR DIDN'T GIVE ANY ALERT NOISE THAT THE CAR WAS ROLLING BACK WHEN ENGINE WAS TURNED OFF IN D POSITION. THIS ISSUE WAS GOING TO BE A BAD DISASTER FOR ME IF MY WIFE AND SON HADN'T SCREAMED TO LET ME KNOW THAT THE CAR WAS ROLLING BACK ON 3RD FLOOR OF A PUBLIC PARKING.THE ONLY ALERT I NOTICED IN THAT TIME WAS A SMALL POP UP ON DASHBOARD WITHOUT ANY NOISE. I CALLED TOYOTA CORPORATION AND THEY SAID THAT THERE IS NO ANY PROBLEM WITH MY CAR AND THAT THIS CAR DOESN'T HAVE ANY SAFETY PROBLEM.FOR SURE SOONER OR LATER THIS WILL BE A BAD DISASTER FOR SOME CAR OWNERS OF THIS MODEL. I DON'T HAVE PEACE OF MIND WHEN MY WIFE DRIVES THIS CAR WITH MY KIDS INSIDE. PLEASE SOLVE THIS BIG SAFETY ISSUE FOR ME AS TOYOTA CORPORATION DOESN'T ACCEPT THIS ISSUE AS A SAFETY ISSUE. THE TOYOTA DEALER SERVICE MANAGER SAID THAT THIS PROBLEM IS SOFTWARE PROBLEM AND MUST BE REPORTED TO TOYOTA CORPORATION, BUT CORPORATION SAYS THAT THERE IS NOT ANY PROBLEM. EVEN 1980'S OR 1990'S CAR WHEN YOU TURN OFF THE ENGINE IN D POSITION THE CAR GIVES NOISE ALERT.",
        "vin": "5TDZZRAH0LS"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/05/2020",
        "dateOfIncident": "07/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337520,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "OCCUPANCY SENSOR FOR DRIVER SEAT, 2ND ROW BENCH, AND 3RD ROW BENCH MALFUNCTION. VEHICLE DISPLAY SHOWS SEATS ARE OCCUPIED AND SEAT BELTS NOT ENGAGED WHEN SEATS ARE NOT OCCUPIED. ERROR MESSAGE DISPLAYS UNTIL VEHICLE IS IN MOTION.",
        "vin": "5TDZZRAH4LS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/29/2020",
        "dateOfIncident": "06/29/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331499,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS IN MOTION ON A STRAIGHT HIGHWAY ON A HOT TEXAS DAY WITH NO OTHER VEHICLES IN THE VICINITY AND NO DEBRIS ON THE ROAD AND THE MOON/SUN ROOF EXPLODED (SOUNDED LIKE A GUN SHOT IN THE CAR).  THE CAR WAS BRAND NEW AND ONLY HAD 4,000 MILES ON IT.  THE VEHICLE IS CURRENTLY LOCATED AT THE LOCAL TOYOTA DEALER BEING EVALUATED BUT THEY ARE DENYING IT AS A WARRANTY ISSUE. THIS COULD HAVE BEEN LIFE THREATENING SINCE IT WAS A VERY LOUD SOUND AND THANKFULLY WE HAD THE INSIDE COVER CLOSED TO THAT WE WERE PROTECTED FROM THE GLASS.",
        "vin": "5TDGZRAH9LS"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/15/2020",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329026,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS EQUIPPED WITH SEAT BELT SENSORS AND ALERTS FOR ALL SEATS, YET FAILS TO ACCURATELY REPORT WHICH SEATS ARE BUCKLED OR NOT WHEN OCCUPIED. THIS ALERT IS SUPPOSED TO OCCUR WHEN TURNING ON THE VEHICLE AND BEFORE SHIFTING OUT OF PARK. MANY TIMES, WITH JUST THE DRIVER SITTING AND NO PASSENGERS IN THE CAR, IT REPORTS THAT THERE ARE PEOPLE SEATED WITH AN UNBUCKLED SEAT BELT. OTHER TIMES WHEN THERE ARE PEOPLE SEATED AND  UNBUCKLED THE SYSTEM DOES NOT RECOGNIZE IT AND NO ALERT APPEARS. THIS IS A SAFETY FEATURE THAT IS ADVERTISED FOR SALES BUT DOES NOT WORK. ENSURING THAT THESE ADVERTISED SAFETY FEATURES FUNCTION CORRECTLY SHOULD BE OF HIGH IMPORTANCE ESPECIALLY WHEN PEOPLE LIKE I DO, DEPEND ON THEM FOR THE SAFETY OF THEIR CHILDREN.  *TR",
        "vin": "5TDHZRAH7LS"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/12/2020",
        "dateOfIncident": "06/12/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328585,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE WILL LET YOU SHUT THE ENGINE OFF IN DRIVE WITHOUT SHIFTING TO PARK. IF YOU DO THIS AND LEAVE THE VEHICLE ON A SLIGHT INCLINE, IT WILL ROLL AWAY AND YOU MAY NOT BE ABLE TO GET BACK TO IT AND INTO IT IN TIME TO GET YOUR FOOT ON THE BRAKE AND THEN SHIFT IT INTO PARK. THIS SHOULD NOT BE ALLOWED. YOU SHOULD HAVE TO SHIFT TO PARK BEFORE THE ENGINE CAN BE TURNED OFF.  *TR",
        "vin": "5TDFZRBH6LS"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/26/2020",
        "dateOfIncident": "04/12/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325952,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HESITATES, STALLS  AND HAS BUCKING LEAPING FORWARD UNCONTROLLABLY, ON THE ROAD. THE VEHICLE ALSO HAS A VERY LOUD WHINING NOISE UPON SHIFTING THE CAR FROM PARK TO DRIVE AND BACK AGAIN FROM DRIVE TO PARK, AT A STAND STILL. THIS IS A MAJOR ISSUE WITH A NEE CAR, MY WIFE AND I DON'T FEEL SAFE WHILE DRIVING IN THIS CAR.  *TR",
        "vin": "5TDYZRAHXLS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/06/2020",
        "dateOfIncident": "05/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323593,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY NEW 2020 HIGHLANDER HYBRID HAS A BIG ISSUE WITH THE GAS TANK. I GET ONLY 460 MILES, EVEN IF I TOP IT OFF WITH THE GAS SPEWING OUT. TOYOTA ADVERTISED A 600 MILE RANGE TO THE HIGHLANDER HYBRID. THE 600 MILE FUEL RANGE SEEMS VERY OFF WITH THE 2020 HIGHLANDER HYBRID. I HAVE THE XLE AND ALWAYS HAVE KEPT IT IN ECO MODE. I'VE DRIVEN OVER A THOUSAND MILES ON THE CAR, BUT THE MILE RANGE ESTIMATE ON THE CAR IS INACCURATE AND SEEMS TO BE OFF A LOT IF IT'S SUPPOSED TO GET 600 MILES TO A TANK.    MORE IMPORTANTLY, WHEN THE TANK IS EMPTY (THE DASH SAYS I HAD 5 MILES LEFT TO EMPTY), THE GAS TANK ONLY HOLDS AROUND 13 GALLONS EVEN THOUGH THE FUEL TANK CAPACITY IS SUPPOSEDLY 17.1 GALLONS. THOSE 4 GALLONS MAKE FOR 140 MILES LESS DISTANCE ON A TANK. IF I WAIT AND KEEP ON FORCING THE GAS IN SLOWLY, I CAN GET 15 GALLONS BUT I DON'T LIKE THE IDEA OF HAVING TO KEEP ON PUSHING THE GAS NOZZLE UNTIL THE GAS SPEWS OUT OF THE TANK JUST TO GET 15 GALLONS IN. I KNOW TOYOTA HAS BEEN HAVING GAS TANK ISSUES IN OTHER MODELS RECENTLY. ONE OF THE MAIN REASONS I BOUGHT THE CAR WAS FOR THE FUEL TANK CAPACITY AND RANGE.    A VIDEO EXPLANATION OF THE PROBLEM IS BELOW:  HTTPS://WWW.YOUTUBE.COM/WATCH?V=HUU649ZRL-G&T=245S.  *TR",
        "vin": "5TDGBRCH6LS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/24/2020",
        "dateOfIncident": "04/22/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322170,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA ADVERTISES AND REPRESENTS THAT THE HIGHLANDER HYBRID&#8242;S FUEL TANK CAPACITY IS 17.1 GALLONS, AND BASED ON ITS 35 MPG RATING, THE RANGE SHOULD BE ABOUT 600 MILES. HOWEVER, I AM NOT ABLE TO FILL THE TANK BY MORE THAN 12 GALLONS THUS REDUCING MY RANGE TO 420 MILES. I BELIEVE THERE IS A DEFECT IN THE NEWLY DESIGNED SADDLE TANK WHICH PROHIBITS THE TANK FROM BEING FILLED COMPLETELY THUS CHEATING ME OUT OF ABOUT 180 MILES OF DRIVING RANGE.",
        "vin": "5TDHBRCH8LS"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/07/2020",
        "dateOfIncident": "02/24/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320379,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "SUSPENSION IS VERY LOUD AND TIGHT, THE CABIN NOISE IS VERY NOISY IT CAN HIT 95 DECIBELS ON SOUND PRESSURE LEVEL METER. THE NOISE IS SO BAD THAT I DO NOT WANT TO DRIVE THE VEHICLES ANY MORE UNLESS I TURN THE RADIO VOLUME UP AND I CAN NOT HEAR EMERGENCY VEHICLES.THE SERVICE PEOPLE SAID THAT IS NORMAL.THE VEHICLE NOISE CAN BE UNBEARABLE AT TIMES.IWONDER WHAT IT DOING TO MY HEARING.THE VEHICLE WAS LIKE THIS SINCE I BOUGHT NEW.",
        "vin": "5TDGZRBH5LS"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/07/2020",
        "dateOfIncident": "02/24/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320381,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE SUSPENSION IS VERY TIGHT AND CABIN NOISE IS  VERY LOUD.ICAN HIT 95 DECIBELS ON MY SOUND PRESSURE METER. HAVE TO TURN THE RADIO UP SO I DO NOT HEAR IT . CANNOT HEAR EMERGENCY VEHICLES. WONDER IT IS DOING TO MY HEARING. THIS A NEW VEHICLE TOOK IT TO TWO DEALERSHIPS AND THEY SAY IT IS NORMAL, THAT CAN NOT BE NORMAL IT SOUNDS LIKES TRUCK. *TR",
        "vin": "5TDGZRBH5LS"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/03/2020",
        "dateOfIncident": "02/29/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315755,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER LEAVING A SHOPPING CENTER ON FEBRUARY 29 2020, WE PULLED OUT ONTO A ROAD TO HEAD TOWARDS HOME.  WE WERE DRIVING ABOUT 45 MILES PER HOUR IN TRAFFIC AND RECEIVED A NOTIFICATION ON THE SCREEN THAT SAID THE ENGINE WAS OFF, PUT CAR IN PARK.  THERE WAS ALSO A WARNING LIGHT THAT CAME ON FOR THE ELECTRONIC STEERING ASSIST WITH AN EXCLAMATION POINT.  WE WERE ABLE TO COAST TO THE SIDE OF THE ROAD TRYING TO MANEUVER THROUGH TRAFFIC OF 4 LANES.  WE PUT THE CAR IN PARK AND ATTEMPTED TO START THE VEHICLE.  IT WOULD TURN OVER, BUT NOT START.  WE CALLED TOYOTA ROADSIDE ASSISTANCE AND TOLD THEM WHAT HAPPENED AND THEY SAID IT WOULD TAKE ABOUT AN HOUR TO GET TO US AND TOW THE VEHICLE.  AFTER ABOUT 15 MINUTES WE DECIDED TO ATTEMPT TO START THE VEHICLE AGAIN.  IT STARTED, AND THE VEHICLE STEERING WARNING LIGHT CAME ON, BUT THEN WENT OFF.  WE CALLED ROADSIDE ASSISTANCE AND TOLD THEM WE WERE GOING TO ATTEMPT TO DRIVE TO THE DEALERSHIP WHERE WE PURCHASED THE VEHICLE WHICH WAS ONLY A FEW MILES AWAY.  WE LEFT THE VEHICLE THERE TO BE CHECKED AND SO FAR THEY SAY NOTHING HAS BEEN FOUND BUT ARE CHECKING FURTHER AND TESTING THE VEHICLE BUT SO FAR HAVE BEEN UNABLE TO DUPLICATE THE OCCURRENCE.  IT ONLY HAS 300 MILES ON THE ODOMETER.",
        "vin": "5TDDZRBH0LS"
    }
]