[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/02/2022",
        "dateOfIncident": "04/02/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449864,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Toyota Tacoma. The contact stated that while driving at 60 MPH, the vehicle inadvertently stalled temporarily. There were no warning lights illuminated. The contact was able to continue to drive the vehicle. The contact stated that the failure reoccurred for a second time while driving. The vehicle was taken to the dealer who diagnosed that no issues were found; however, the failure persisted. The manufacturer was notified of the failure but did not provide any assistance. The vehicle was not repaired. The failure mileage was approximately 5,000.",
        "vin": "3TMCZ5AN8LM"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/07/2022",
        "dateOfIncident": "01/07/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446667,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I recently changed tires from the factory originals. While tightening the lug nuts 4 wheel studs sheared off while tightening (2 on passenger front tire and 2 on passenger rear tire). In light of this issue I decided to replace all 12 wheel studs on the affected tires. The 8 remaining wheel studs that were still intact all had evidence of thread stretch visible to the naked eye.",
        "vin": "3TMDZ5BN1LM"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/16/2021",
        "dateOfIncident": "12/08/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444037,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "A child infant passenger car seat was placed in the rear passenger center seat position.  The the shoulder/lap-belt was used to install the car seat rear-facing. Once the install was complete.  The shoulder belt was slowly pulled and extended all the way out.  The purpose was to have the shoulder belt reach its maxed length.  This would position the belt to be placed into retracting mode only.  This would prevent the child or an infant to possibly extend the belt once its been retracted.  This would minimize the free play with the belt such as being tangled with child's arm, head, body parts, and potentially becoming a choking hazard.   The issue now, is the shoulder/lap-belt retracting mechanism is malfunctioning.  The shoulder/lap belt is not retracting.  Rather it is stuck and now the entire shoulder/lap belt is extended all the way out.  There is no resistance in the seat-belt and cannot will not secure a rear passenger in the center seat position.  The rear center seat does not have a working safety car passenger safety belt.",
        "vin": "3TMDZ5BN4LM"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/14/2021",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436808,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact leased a 2020 Toyota Tacoma. The contact stated that after driving the vehicle off the dealer parking lot, the brakes would pulsate upon depression without warning. The contact had taken the vehicle to the dealer on four separate occasions and had the brake drums replaced each time; however, the failure persisted. The manufacturer was notified, and the contact was informed that a service representative would contact him. The contact had not yet heard from the manufacturer. The vehicle was not repaired. The failure mileage was 1. The VIN was not available.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/28/2021",
        "dateOfIncident": "09/26/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434784,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Toyota Tacoma. The contact stated while driving approximately 80 MPH, the brakes activated independent of the driver input and the vehicle slowed to 60 MPH abruptly. There was no warning light illuminated. The vehicle was not taken to a dealer to be inspected. The manufacturer was not informed of the failure. The failure mileage was approximately 20,000.",
        "vin": "3TMAZ5CN5LM"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/04/2021",
        "dateOfIncident": "05/17/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419695,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Toyota Tacoma. The contact stated while driving up a hill and whenever the accelerator pedal was released, the vehicle started to roll backward. There was no warning light illuminated. The vehicle was taken to the local dealer to be diagnosed however, the mechanic was unable to determine the cause of the failure. Upon picking up the vehicle, the contact stated that the failure recurred while driving up a hill. The contact then took the vehicle back to the dealer where it was diagnosed with the engine not getting enough oil causing the vehicle to stall. The vehicle was not repaired. The manufacturer was informed of the failure but offered no assistance. The failure mileage was approximately 7,800.",
        "vin": "3TMAZ5CN6LM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/21/2021",
        "dateOfIncident": "04/21/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413258,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 TOYOTA TACOMA. THE CONTACT STATED WHILE DRIVING AT VARIOUS SPEEDS, THE CONTACT STATED THAT THE QI CHARGER PAD WAS EXTREMELY HOT WHILE CHARGING HIS PHONE. THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO TOYOTA OF GASTONIA (4821 WILKINSON BLVD, GASTONIA, NC 28056) TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE QI CHARGING PAD NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER HAD NOT BEEN INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 5,000.",
        "vin": "3TYAZ5CN0LT"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/09/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407267,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 TOYOTA TACOMA TRD SPORT, SOMETIMES THE VEHICLE SEEMS TO LOOSE POWER WHEN DOWN SHIFTING WHILE ACCELERATING (GOING AROUND A CORNER). THE TRUCK ALSO SEEMS LIKE ITS HUNTING FOR A GEAR AROUND THE 35MPH OR 43 MPH, ON FLAT SURFACE, GOING DOWN HILL, OR GOING UP HILL. THIS ALSO HAPPENS ON THE INTERSTATE WHILE GOING 65-70MPH, WHICH WOULD BE CAUSE FOR CONCERN. THIS FEELS LIKE ITS A TRANSMISSION ISSUE BUT ALSO COULD BE AN ENGINE MISFIRE OF A SPARK PLUG OR SOMETHING. THIS HAPPENS ON A DAILY BASIS. DOES ALSO FEEL JERKY AT TIMES.",
        "vin": "3TMCZ5ANXLM"
    },
    {
        "components": "STRUCTURE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/05/2021",
        "dateOfIncident": "03/28/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406509,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "HOOD VIBRATES ARE HIGHER SPEEDS REFLECTING SUN CREATING A FLASH/STROBE LIGHT TYPE EFFECT BLINDING DRIVER.",
        "vin": "3TMGZ5ANXLM"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/29/2021",
        "dateOfIncident": "03/29/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405425,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 TOYOTA TACOMA TRD SPORT, TRANSMISSION LURKS FROM REVERSE INTO DRIVE YOU HAVE TO PRESS THE BRAKE PEDAL A LITTLE HARDER THAN NORMAL TO KEEP FROM LURKING.  SOMETIMES THE VEHICLE SEEMS TO LOOSE POWER WHEN DOWN SHIFTING WHILE ACCELERATING (GOING AROUND A CORNER).  THE TRUCK ALSO SEEMS LIKE ITS HUNTING FOR A GEAR AROUND THE 35MPH OR 43 MPH, ON FLAT SURFACE, GOING DOWN HILL, OR GOING UP HILL.  THIS ALSO HAPPENS ON THE INTERSTATE WHILE GOING 65-70MPH, WHICH WOULD BE CAUSE FOR CONCERN.  THIS FEELS LIKE ITS A TRANSMISSION ISSUE BUT ALSO COULD BE AN ENGINE MISFIRE OF A SPARK PLUG OR SOMETHING.  THIS HAPPENS ON A DAILY BASIS, PURCHASE DATE OF 9.11.2020.",
        "vin": "3TMCZ5AN5LM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/24/2021",
        "dateOfIncident": "11/30/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404754,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "IN LATE NOVEMBER OR EARLY DECEMBER OF 2020, I HAD A CHECK ENGINE LIGHT APPEAR. I CYCLED THROUGH SEVERAL HUNDRED MILES (500+) THINKING IT MAY HAVE BEEN A LOOSE GAS CAP ISSUE THAT NEEDED TIME TO SORT ITSELF OUT. THE LIGHT DID NOT RESOLVE ITSELF AND I VISITED THE CLOSEST DEALERSHIP, AUTONATION TOYOTA, IN TEMPE. I WAS SURPRISED TO LEARN THAT THERE WAS DAMAGE TO THE ENGINE WIRING HARNESS CAUSED BY RODENTS. MANY MANUFACTURERS, INCLUDING TOYOTA, HAVE SWITCHED TO SOY-BASED WIRING INSULATION WHICH IS ATTRACTIVE TO RODENTS.    THE SERVICE REPRESENTATIVE POINTED AT 1-2 OTHER VEHICLES (ALL NEW) THAT WERE IN THE DEALERSHIP FOR THE SAME PROBLEM AND SAID THEY'VE HAD AN INCREASING AMOUNT OF VEHICLES IN FOR THIS ISSUE. MY VEHICLE WAS 7 MONTHS OLD AT THIS POINT WITH 6840 MILES ON IT. THE WIRING HARNESS PART WAS A SPECIAL ORDER PART AND THAT COST ALONE WAS $1431.79. ADD IN THE ESTIMATED 20 HOURS OF LABOR AND THE \"FIX\" WOULD BE $4592.61 AT THAT DEALERSHIP.     I ASKED IF IT WOULD BE OK IF I CONTINUED TO DRIVE THE VEHICLE WHILE WE EXPLORED OUR OPTIONS WITH AN INSURANCE CLAIM. I WAS TOLD THE VEHICLE COULD EXPERIENCE A SUDDEN LOSS OF ACCELERATION AND CAUSE A CRASH. WE WERE ABLE TO INITIATE A NO FAULT CLAIM WITH OUR INSURANCE COMPANY, BUT HAD TO PAY A $500 DEDUCTIBLE AS TOYOTA WOULD NOT WARRANTY THIS ISSUE CAUSED BY THEIR SOY-BASED WIRING INSULATION. WORK WAS COMPLETED AT THE LEASING TOYOTA DEALERSHIP, NOT AUTONATION.    SOMETHING NEEDS TO BE DONE ABOUT THIS SOY-BASED WIRING INSULATION ISSUE. NOT ONLY IS THIS TYPE OF WIRING MANUFACTURING ATTRACTIVE TO RODENTS, THUS CAUSING DAMAGE THAT CAN RESULT IN DANGEROUS DRIVING CONDITIONS, BUT THE WIRING ALSO DETERIORATES AT A MUCH HIGHER RATE IN HIGHER TEMPERATURES. (WE HAD A BMW 550 WITH SOY BASED WIRING THAT WAS DISINTEGRATING IN THE HEADLIGHT HOUSING.) MANUFACTURERS NEED TO STOP PRODUCING SOY BASED WIRING INSULATION OR IMPROVE IT TO REPEL RODENTS.",
        "vin": "3TMCZ5AN5LM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/23/2021",
        "dateOfIncident": "12/31/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404581,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MICROPHONE NOT WORKING, CAUSES ME TO USE MY CELLPHONE, CAUSING DISTRACTED DRIVING.  TO ANSWER A CALL I HAVE TO UNPLUG THE PHONE AND STOP TO MAKE A CALL.  CANNOT CONTACT THE TOYOTA COLLISION CENTER.",
        "vin": "5TFAZ5CN4LX"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/21/2021",
        "dateOfIncident": "03/21/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404107,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS MORNING I ACTIVATED MY CRUISE CONTROL (CC)AS I NORMALLY WOULD AT 55 MPH. IMMEDIATELY MY TRUCK BEGAN ACCELERATING UNTIL I FINALLY DISENGAGED CC WHEN THE SPEED REACHED 83-85 MPH.  IT WAS STILL ACCELERATING AT THE TIME I DISENGAGED IT.  I ATTEMPTED TO RECREATE THE INCIDENT WITH NO LUCK.  BEFORE THE INCIDENT, I WAS DRIVING IN A CITY ENVIRONMENT AT SPEEDS LESS THAN 55 MPH, SO THERE WAS NO WAY I HAD PREVIOUSLY SET THE CC TO A HIGH SPEED THAT WOULD HAVE CAUSED THIS TO HAPPEN HAD I HIT RESUME.",
        "vin": "3TMCZ5AN1LM"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/14/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402933,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "SYSTEM WILL OCCASIONALLY SUDDENLY DECELERATE AS I AM PASSING, USUALLY A LARGE TRUCK. I WILL BE IN ADAPTIVE CRUISE CONTROL AND AS I GET ABREAST OF THE TRAILER, THE VEHICLE WILL SUDDENLY DECREASE SPEED BY 10-20 MPH, THEN ACCELERATE BACK TO THE SET SPEED. THIS, OBVIOUSLY, HAS THE POTENTIAL TO CREATE A REAR END COLLISION IF SOMEONE IS FOLLOWING AND NOT PAYING FULL ATTENTION, ESP IF THERE ARE MULTIPLE CARS FOLLOWING. THIS HAS HAPPENED MULTIPLE TIMES.",
        "vin": "3TMCZ5AN2LM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/22/2021",
        "dateOfIncident": "02/14/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397310,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS LEAVING MY DRIVEWAY, THE TRUCK STARTED JUMPING AND LOSS POWER.  THEN CUT OFF AND WOULDN'T CRANK BACK UP FOR A FEW MINUTES.  EVENTUALLY IT CONTINUED FOR ABOUT 3 OR 4 TIMES.  UNTIL IT FINALLY DIED AND WOULD NOT RUN EVEN THOUGH IT WOULD CRANK.  TOOK IT IN AND FOUND OUT MY PARTICULAR TRUCK WASN'T RECALLED EVEN THOUGH IT HAS A FUEL PUMP PROBLEM.  THEY PUT A FUEL PUMP ON IT.  BUT THEY DON'T KNOW IF IT WAS THE NEWER UPDATED PUMP OR THE OLDER VERSION KNOWN TO HAVE PROBLEMS.  SO I'M RIDING AROUND IN A VEHICLE THAT COULD FAIL ANYTIME.",
        "vin": "3TYCZ5AN9LT"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/20/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397122,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "QI CHARGING PAD HEATING UP CAUSING A BUBBLE UNDER THE PAD.",
        "vin": "3TMGZ5AN5LM"
    },
    {
        "components": "STEERING,FORWARD COLLISION AVOIDANCE,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "02/14/2021",
        "dateOfIncident": "01/20/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396189,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE THE STEERING WHEEL PULLED TO THE LEFT AND THE STEERING WHEEL TURNED TO THE LEFT CONSIDERABLY AND PERMANENTLY EVEN WHEN IT WAS GOING STRAIGHT ON THE ROAD, THE VEHICLE WAS TAKEN INTO SERVICE, THEY ALIGNED IT AND IN JUST 500 MILES IT BEGAN TO PULL TO THE RIGHT AND  THE STEERING WHEEL WAS TURNED TO THE LEFT AGAIN EVEN WHEN THE VEHICLE WAS GOING STRAIGHT ON THE ROAD.  I HAVE AN APPOINTMENT IN SERVICE AGAIN SOON.",
        "vin": "3TYAZ5CN3LT"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/11/2021",
        "dateOfIncident": "02/08/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395723,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING CERTAIN CONDITIONS LIKE HARD BRAKING OR REGULAR BRAKING IN INCUMBENT WEATHER THE REAR WHEELS WOULD LOCK UP. TOOK TO THE DEALER 9/2020  THEY REPLACE THE REAR DRUMS, AND THE ISSUE CAME BACK SHORTLY AFTER THE REPAIRS. I TOOK IT BACK 12/03/2020 THEY REPLACED MORE INTERNAL FINAL DRIVE PARTS LIKE AXLE SHAFTS AND WHEEL BEARINGS SHOES, AND DRUMS AGAIN. THE LOCK UP WOULD DISENGAGE AS SOON AS THE BRAKE PEDDLE IS RELEASED.  ON 2/9/21 WITH 6K MILES MY TACOMA NOW LOCKED UP AFTER TWO PRIOR ATTEMPTS BY THE DEALER TO RESOLVE MY ISSUE. THE TRUCK IS IN THE SHOP AGAIN THIRD TIME SAME ISSUES",
        "vin": "3TMDZ5BN5LM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/06/2021",
        "dateOfIncident": "02/06/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395016,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUCK NEVER SHOWS MORE THAN 320 MILES OF RANGE(SHOULD SHOW 400+)AND ACCELERATES VERY SLOWLY EVEN WHEN THE PEDAL IS PRESSED HARD. THERE IS A NOTICEABLE SHUDDER WHEN THE CAR IS IDLING OR A NEUTRAL. FEELS LIKE DIRTY FUEL INJECTORS BUT IT ONLY HAS 8K.",
        "vin": "3TMAZ5CN4LM"
    },
    {
        "components": "SUSPENSION,STRUCTURE,ENGINE",
        "crash": true,
        "dateComplaintFiled": "02/03/2021",
        "dateOfIncident": "12/31/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11394568,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAD A FRONT/RIGHT COLLISION WITH THE TREES ON A ROAD DURING THE RAINY EVENING. VEHICLE WAS DEEMED A TOTAL LOSS BY OUR CAR INSURANCE COMPANY ADJUSTER. THE AIRBAGS HAVE NEVER DEPLOYED THEREFORE THERE WERE SERIOUS INJURIES AND FRACTURES AS A RESULT OF THE IMPACT. WHY DID THE AIRBAGS NOT DEPLOY?  WAS THERE A BREAKS OR OTHER SAFETY MALFUNCTIONING?",
        "vin": "3TMCZ5AN0LM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/26/2021",
        "dateOfIncident": "12/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390085,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH THE TRUCK WARMED UP: PUSHING THE GAS PEDAL ALMOST TO THE FLOOR TO ENTER TRAFFIC THE TRUCK JUST SAT THERE AND DID NOT MOVE THIS HAPPENED TWICE.  THE ONLY WAY THE TRUCK WOULD MOVE WAS TO PUSH THE GAS PEDAL SLOW AND ENTER THE FLOW OF TRAFFIC AT REDUCED SPEED.    WITH THE TRUCK WARMED UP: PUTTING THE TRUCK IN REVERSE AND PUSHING ON THE GAS PEDAL THE TRUCK DID NOTHING.  TAKING MY FOOT OFF THE GAS PEDAL WHILE STILL IN REVERSE THE TRUCK LUNGED BACKWARDS.  I HAD TO STOP THE TRUCK WITH MY FOOT ON THE BRAKE. THE TRUCK LUNGED BACKWARDS IN REVERSE TWICE WHILE GIVING IT GAS.    WITH THE TRUCK WARMED UP: STOPPED AT A RED LIGHT WITH MY FOOT ON THE BRAKE, I LIFTED MY FOOT OFF THE BRAKE TO MOVE FORWARD AND THE ENGINE REVVED UP AND LUNGED FORWARD I HAD TO STOP THE TRUCK WITH MY FOOT ON THE BRAKE BECAUSE IT WAS MOVING SO FAST AND I WAS NOT PUSHING THE GAS PEDAL.",
        "vin": "5TFAZ5CN7LX"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/23/2021",
        "dateOfIncident": "09/30/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389547,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I START VEHICLE A HISSING OR ELECTRIC SHOCK RATTLES AND SEEMS AS I START TO DRIVE THERE IS NO POWER AND 4 WD IS ON WHEN I BRAKE IT SKIPS MAKING TIRES JUMP.",
        "vin": "3TYCZ5AN5LT"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/08/2021",
        "dateOfIncident": "10/31/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387134,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 TOYOTA TACOMA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V682000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE VEHICLE WAS TAKEN TO AUTONATION TOYOTA MALL OF GEORGIA (3505 BUFORD DR, BUFORD, GA 30519, (770)674-6083) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT STATED THAT THE VEHICLE HESITATED WHILE ATTEMPTING TO ACCELERATE WHILE DRIVING AT VARIOUS SPEEDS. THE VEHICLE HAD NOT BEEN REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 16,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3TMDZ5BN2LM"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/22/2020",
        "dateOfIncident": "04/16/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384611,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PRE COLISION SYSTEM IS FAULTED OUT DUE TO THE SENSOR BEHIND THE WINDSHILD",
        "vin": "3TMCZ5AN9LM"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/10/2020",
        "dateOfIncident": "10/17/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11382875,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2020 TOYOTA TACOMA. THE CONTACT STATED THAT WHILE DRIVING AT 5 MPH ON A SNOW ROAD, HE HAD ATTEMPTED TO MAKE A LEFT TURN BUT DUE TO THE ICY CONDITIONS, THE VEHICLE SLID OFF THE ROAD AND INTO A DITCH. THE DRIVER SIDE CURTAIN AIRBAG DEPLOYED AT AN ANGLE WHICH HIT HIM IN THE RIGHT EYE AND CAUSED IMMEDIATE BLINDNESS. THE SIDE CURTAIN AIRBAG ALSO TRAPPED HIM IN BETWEEN THE SEATBELT AND THE AIRBAG. THE CONTACT WAS RUSHED TO THE HOSPITAL ONCE THE AUTHORITIES ARRIVED AND WAS DIAGNOSED WITH PERMANENT RIGHT EYE BLINDNESS. THE CONTACT ALSO SUFFERED MINOR ABRASIONS TO THE FACE, THE THREE OTHER PASSENGERS IN THE VEHICLE SUSTAINED NO INJURIES. A POLICE REPORT WAS FILED. DUE TO THE FAILURE, THE VEHICLE WAS TOWED TO AN INDEPENDENT TOW YARD WHERE HIS INSURANCE DEEMED THE VEHICLE A TOTAL LOSS UPON INSPECTION. THE DEALER NOR THE MANUFACTURER HAVE YET TO BE MADE AWARE OF THE FAILURE. THE VEHICLE WAS TOTALED. THE FAILURE MILEAGE WAS APPROXIMATELY 3,600. *DT",
        "vin": "3TMDZ5BN2LM"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/20/2020",
        "dateOfIncident": "11/20/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375605,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 TOYOTA TACOMA TRD OFF ROAD HAS SEVERE HESITATION ISSUES DURING WARM STARTUP. TRUCK CRANKS OVER FINE BUT DRAGS FOR AN EXTENDED PERIOD OF TIME BEFORE FIRING. THERE IS A NOTICEABLE SMELL OF GASOLINE WHEN THIS HAPPENS. SOMETIMES THE STARTER SEEMS TO STICK AND MAKES A LOUD GRINDING NOISE. OTHER TIMES THERE IS AN AUDIBLE SINGLE CLICK/POP NOISE IMMEDIATELY AFTER PUSHING THE START BUTTON BUT THE TRUCK STILL STARTS. AFTER THE TRUCK IS STARTED IT WILL OCCASIONALLY IDLE ROUGH AND THE TACHOMETER WILL DIP LOW AND THE TRUCK WILL SHAKE SLIGHTLY AS IF THE TRUCK IS GOING TO STALL. TOYOTA CONTINUES TO DENY ANYTHING IS AMISS DESPITE ME PROVIDING VIDEO EVIDENCE AND DUPLICATING THE ISSUE IN FRONT OF THEM MYSELF. THEY CONTINUE TO REFUSE TO DO ANY REASONABLE AMOUNT OF WORK TO FIX MY VEHICLE UNDER WARRANTY. HERE IS A LINK TO VIDEOS OF THE ISSUE FOR REFERENCE OF THE SEVERITY: HTTPS://YOUTU.BE/Z-W-FD8GZIU",
        "vin": "5TFCZ5AN6LX"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/08/2020",
        "dateOfIncident": "04/20/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373677,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "APROX MILEAGE MARCH 7K ,MILEAGE NOW 12K NOV 8. ON THE VEHICLE.      1ST INCIDENT. MARCH 2020.COLORADO MOUNTAINS GETTING OFF OF THE HIGHWAY OFF RAMP WITH A .5PERCENT GRADE DOWNHILL AND 800 LB TRAILER. NO BRAKES AT 60MPH CLEAR SKYS 8PM DRY PAVEMENT.PEDAL HAD TO BE PUSHED HARDER AND HARDER TO GET THE TRUCK TO STOP YET WOULDNT STOP UNTILL I USED EMERGENCY BRAKE. ALMOST LOST CONTROL DUE TO HAVING TO CORRECT WHICH DIRECTION I HAD TO GO SO I WOULDN'T HIT THE CAR INFRONT OF ME ON THE OFF RAMP. DEALER INSPECTION SAYS NOTHING IT WRONG.     2ND INCIDENT WAS TURNING ON ROUND ABOUT FLAT DRY PAVEMENT 25 MPH. HAD TO USE E BRAKE AGAIN TO AVOID COLLISION DUE TO SOFT PEDAL. BETWEEN 1/3AND 2/3 OF THE DISTANCE TO THE FLOOR THE PEDAL SEEMED NON EXISTANT AGAIN.     3RED 4TH 5TH 6TH AND 7TH INCIDENT. MAY-NOV 2020  BRAKE EMERGENCY WARNING COMES ON DASH SOME TIMES WITH OR WITHOUT BREAK ASSIST ACTIVATED. OFTEN WHEN BRAKING SEMI HARD VEHICLE WILL BRAKE AS IF THERE IS OIL ON THE BRAKES STOPPING DISTANCE BECOMES 20%-50% LONGER THAN ANTICIPATED EVEN WITH PEDAL TO THE FLOOR.  I DO NOT TRUST THIS VEHICLE. IT HAS BEEN BACK TO THE DEALER FOR THIS ISSUE AND WE HAD BEEN TOLD BOTH TIMES IT WAS THERE THAT WE ARE \"USING THE BREAK PEDAL THE WRONG WAY\".  THIS IS GETTING TO BE SCARY FOR US TO DRIVE SO WE USE THE OTHER CAR TO TAKE THE CHILD PLACES. AT RANDOM THE BRAKES FEEL LIKE YOU HAVE TO PUSH THE PEDAL EXTREMELY HARD AND OR TO THE FLOOR HOPING THE TRUCK WILL STOP. REGUARDLESS OF WEATHER, LOAD OR PAVEMENT CONDITIONS.",
        "vin": "3TMCZ5AN0LM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/04/2020",
        "dateOfIncident": "09/25/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372998,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 TOYOTA TACOMA. THE CONTACT STATED WHILE DRIVING 77 MPH WITH CRUISE CONTROL ENGAGED, HE HEARD AN ABNORMAL SOUND. THE CONTACT STATED THAT THE BRAKE PEDAL WAS DEPRESSED AND THE SOUND CEASED. THE SOUND RETURNED WHEN THE ACCELERATOR PEDAL THERE WAS A LOUD NOISE. THE CONTACT STATED THAT AN UNKNOWN WARNING LIGHT ALONG WITH THE LOW OIL PRESSURE WARNING LIGHT WERE ILLUMINATED. THE CONTACT STATED THAT THE HOOD POPPED UP ABOUT AN INCH. THE CONTACT WAS ABLE TO GET PARKED ON THE SHOULDER AFTER WHICH THE STEERING SEIZED. THE VEHICLE WAS NOT DRIVABLE. THE VEHICLE WAS TOWED TO EHRLICH TOYOTA LOCATED AT 4732 W 26TH ST, GREELEY, CO 80634, (970) 339-3900, WHERE THE VEHICLE WAS DIAGNOSED AND IT WAS DETERMINED THAT THE ENGINE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 1,200.*DT*DT  THE CONSUMER STATED THE TOYOTA WAS FIXED ON NOV 4TH BUT HAD TO BE TAKEN BACK TO THE DEALER DUE TO THE LEAKING FLUIDS AND AN OIL LEAK. THAT DEFECT WAS FIXED AS WELL ON NOV 20TH. *TR",
        "vin": "3TMCZ5AN2LM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/29/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11367065,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS SHUT OFF WHILE DRIVING AT 45 MPH IN THE CITY . BRAKES LOCKED AND THE CAR STALLED OFF . I WENT TO THE DEALERSHIP AND THEY SAID THEY TRIED TO INITIATE THE SAME ERROR BUT COULD NOT .",
        "vin": "3TMCZ5AN4LM"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/20/2020",
        "dateOfIncident": "10/12/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365482,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST BOUGHT A NEW 2020 TACOMA SR5, AND IT HAS VERY POOR ACCELERATION WHEN PASSING OTHER VEHICLES. THERE IS A SIGNIFICANT DEAD SPOT WHEN ACCELERATING. IT SEAMS TO HAVE A TRANSMISSION DELAYED SHIFTING RESPONSE TIME WHEN DRIVING. I CONSIDER THIS UNACCEPTABLE FOR A NEW VEHICLE. IT RUNS WORSE THAN MY OLD CAR. IT RUNS LIKE ALL THE FUEL INJECTORS ARE DIRTY. ALSO, A FEW DAYS AGO, I WAS PARKED IN A PARKING SPACE THAT HAD A BIT OF AN INCLINE FOR ABOUT 15-20 MINUTES, AND WHEN I PULLED OUT AND PLACED MY GEAR IN DRIVE, THE TRANSMISSION SLIPPED BADLY AND WOULD NOT DRIVE FORWARD AS IF THE TRANSMISSION WAS BROKEN. I ONLY KNOW A LITTLE BIT ABOUT VEHICLES, BUT I KNOW THIS NEW 2020  V6 SR5 TOYOTA TACOMA THAT I JUST BOUGHT IS NOT RIGHT. I WILL BE TAKING IT TO THE DEALERSHIP SOON TO SEE IF THEY HAVE ANY SUGGESTIONS.I HAVE RECENTLY FOUND OUT ABOUT A RECALL REGARDING THE FUEL PUMP. THIS LEADS ME TO BELIEVE THESE PROBLEMS ARE ALL OR IN PART COMING FROM A POOR FUEL PUMP. THE PROBLEM IS THAT THE NEW 2020 TACOMA'S ARE NOT PART OF THE FUEL PUMP RECALL. I FEAR THIS VEHICLES POOR PERFORMANCE WILL PLACE ME AT AN INCREASE RISK OF HAVING AN ACCIDENT WHILE DRIVING INTO A BUSY INTERSECTION OR THE LIKE. I HOPE YOU (THE READER) PROVIDE THIS INFORMATION TO THE APPROPRIATE CHANNELS IN ORDER TO MAKE THIS VEHICLE SAFE AGAIN.",
        "vin": "3TMAZ5CN2LM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/14/2020",
        "dateOfIncident": "09/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364292,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2020 TACOMA WITH 14K MILES ON IT. I WAS DRIVING MY TRUCK AND I WENT TO HIT MY BRAKES AND THE PEDAL WENT STRAIGHT TO THE FLOOR.  I WAS ABLE TO GET PARTIAL BRAKES BY PUMPING THEM UP LIKE WHEN YOU ARE BLEEDING NEW BRAKES. TOOK TRUCK TO TOYOTA AND THEY HAD IT FOR 10 DAYS.  THERE WAS A TOTAL FAILURE OF THE BRAKE MASTER CYLINDER. IF THIS SCENARIO WOULD HAVE OCCURRED WHILE DRIVING IN TRAFFIC OR ON THE HIGHWAY THE END RESULT COULD HAVE BEEN FATAL.   THE TOYOTA SERVICE MANAGER SAID HE HAD NEVER SEEN ANYTHING LIKE THIS BEFORE AND THEY HAD ENGINEERS HAVE THEM RUN TESTS ON THE PART WHILE ON MY TRUCK SO THEY COULD FIND OUT WHY IT HAPPENED.",
        "vin": "3TMCZ5ANXLM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/19/2020",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11359922,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AND APPLYING MY BRAKES THEY DO NOT ALWAYS SEEM LIKE THEY ARE GOING TO STOP ME IN TIME.  SOMETIMES IT FEELS LIKE THE BRAKE IS GRABBING AND THE STOP IS JERKY AND NOT SMOOTH.  ON A COUPLE OF OCCASIONS WHILE DRIVING WITH CRUISE CONTROL ON I APPLIED THE BRAKE PEDAL BUT AS SOON AS I TOOK MY FOOT OFF THE BRAKE THE VEHICLE SPED UP ON IT'S OWN TO RESUME PREVIOUS SPEED SO IT APPEARS THE CRUISE CONTROL DID NOT DISENGAGE WHEN BRAKE WAS APPLIED.  I FIRST NOTICED A BRAKING ISSUED WHEN I STARTED DRIVING THE VEHICLE IN JULY 2020.  THOUGHT PERHAPS I JUST HAD TO BECOME ACCUSTOMED TO THE BRAKING SYSTEM.  THIS IS NOT THE CASE AND IT HAS BEEN HAPPENING THE PAST 2 1/2 MONTHS THAT I'VE OWNED IT.  THE PROBLEM PERSISTED SO I TOOK IT TO TOYOTA SERVICE DEPT TO BE LOOKED AT.  MY VEHICLE WAS PURCHASED NEW FROM DEALERSHIP AND NOW HAS ABOUT 3500 MILES ON IT.  I TOOK MY VEHICLE TO SERVICE DEPT IN GETTLE TOYOTA ON CORTEZ RD IN BRADENTON FL ON 9/18/20 AND THEY SAID BASICALLY \"IT'S THE NATURE OF THE BEAST.  THEY TESTED IT AND THOUGHT AT FIRST THE BRAKES SEEMED REALLY SENSITIVE BUT THEN COMPARED IT TO A TEST DRIVE OF ANOTHER VEHICLE ON THE LOT AND  DETERMINED THAT'S JUST HOW THE TRUCK IS.  I AM NOT CONVINCED THAT THE VEHICLE IS SAFE.  AFTER SPENDING OVER $40,000 ON A TRUCK I'D LIKE TO FEEL SAFE.  ALWAYS THOUGHT TOYOTA STOOD BEHIND THEIR PRODUCTS BUT NOW NOT SO SURE.  IF YOU CAN LOOK INTO THIS SAFETY CONCERN, I WOULD APPRECIATE IT.",
        "vin": "3TMCZ5AN1LM"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "09/11/2020",
        "dateOfIncident": "05/14/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354418,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 TOYOTA TACOMA DRIVEN BY HIS SON. THE CONTACT STATED THAT AS HIS SON WAS CLEANING THE VEHICLE, HE NOTICED THAT THE DRIVER'S SIDE SEAT FRAME WAS RUSTED. THE CONTACT WAS CONCERNED THAT THE VEHICLE WAS NEW AND THAT THE FAILURE COULD CAUSE THE VEHICLE TO SNAP AND CAUSE HIS SON TO GET INTO AN ACCIDENT WHILE DRIVING. THE VEHICLE WAS TAKEN TO THE ROSEVILLE TOYOTA DEALER LOCATED AT 700 AUTOMALL DR, ROSEVILLE, CA 95661, WHERE THE SERVICE MANAGER STATED THAT SEAT FRAMES TENDED TO RUST OVERTIME HOWEVER, HE PROCEEDED TO INSPECT OTHER TOYOTA TACOMA'S ON THE LOT BUT FOUND NO VEHICLE WITH SIMILAR FAILURES. THE SERVICE MANAGER REFERRED THE MATTER TO THE REGIONAL REPRESENTATIVE WHO STATED THAT THE MANUFACTURER WOULD NOT BE RESPONSIBLE FOR THE REPAIRS. THE CONTACT MADE THE MANUFACTURER AWARE OF THE ISSUE AND WAS INFORMED THAT THE MANUFACTURER WOULD NOT BE RESPONSIBLE FOR THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 3,369.*DT*DT*AS",
        "vin": "3TMCZ5AN7LM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/16/2020",
        "dateOfIncident": "08/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349639,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKES LONG TO START UP. CRANKS OVER WAY TOO MUCH. SOMETIMES STALLS. ALREADY HEARD STARTER GRIND ON FLYWHEEL TWICE.",
        "vin": "3TMCZ5AN5LM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/07/2020",
        "dateOfIncident": "08/07/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343859,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2020 TOYOTA TACOMA TRUCK I FOUND THAT ,WHEN SITING AT A STOP LIGHT, WITH MODERATE PRESSURE ON THE BRAKES, THE BRAKE PEDAL WOULD SLOWLY GO TO THE FLOOR.   TOOK THE TRUCK TO CHECKERED FLAG TOYOTA, 5301 VIRGINIA BEACH BLVD, VIRGINIA FOR REPAIR. WAS TOLD THAT THE PEDAL TO THE FLOOR WAS 'NORMAL' FOR THIS TRUCK.    SHOP FOREMAN SAID THAT THE PEDAL GOING TO THE FLOOR WAS 'NORMAL FOR THIS TRUCK'. I ASKED TO TALK TO THE TOYOTA SERVICE REPRESENTATIVE FOR THE REGION BECAUSE I WAS CONCERNED THAT THE BRAKE PEDAL GOING TO THE FLOOR WAS A MALFUNCTION OF THE BRAKE SYSTEM AND NOT NORMAL.  WAS TOLD THEY WOULD NOT GIVE ME INFORMATION ABOUT THE TOYOTA SERVICE REP BECAUSE THAT WAS NOT THE WAY WE DO THINGS.      A BRAKE SYSTEM THAT THE BRAKE PEDAL CANNOT KEEP PRESSURE AND GOES TO THE FLOORBOARD WHEN DEPRESSED CANNOT BE 'NORMAL'.",
        "vin": "3TMDZ5BN4LM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/05/2020",
        "dateOfIncident": "06/21/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343500,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLS WHEN OPERATING AT VARIOUS SPEEDS. HAS STALLED OUT AT HIGHWAY SPEEDS AND IN PARKING LOTS.  HAS BROKEN DOWN AND REGISTERED FUEL TROUBLE CODES FOUR TIMES IN LESS THAN 90 DAYS.  WHEN THE VEHICLE STALLS IT HAS REGISTERED THE P08700 AND P0017100 CODES FOR LOW FUEL PRESSURE. DEALER HAS REPLACED HIGH AND LOW PRESSURE FUEL PUMPS AND PROBLEM IS STILL NOT FIXED. THIS IS AN EXTREMELY DANGEROUS CONDITION BECAUSE THE DRIVER LOSES ALL POWER AND THE VEHICLE DOES NOT RESTART.  THE DRIVER HAS TO LOOK FOR A PLACE TO 'DITCH' OR PUSH OUT OF TRAFFIC. IT HAS BLOCKED TRAFFIC DURING STALLING EPISODES, CAUSING A SAFETY CONCERN.",
        "vin": "3TMCZ5AN4LM"
    },
    {
        "components": "UNKNOWN OR OTHER,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "07/15/2020",
        "dateOfIncident": "07/11/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339594,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN YOU ARE BACKING UP WITH YOUR HEAD LIGHTS ON DURING THE DAY YOUR BACKUP CAMERA SCREEN GOES ALMOST DARK.  LETS SAY IT IS RAINING OR ANY OTHER REASON YOU HAPPEN TO HAVE YOUR HEAD LIGHT'S ON OR WANT THEM ON AND YOU NEED TO BACK UP YOUR SCREEN FOR THE BACKUP CAMERA GOES ALMOST DARK YOU CAN NOT MAKE ANYTHING OUT ON THE SCREEN.  THIS IS A SAFETY ISSUE THE CAMERA SCREEN SHOULD REMAIN BRIGHT JUST AS IF YOU DO NOT HAVE YOUR HEAD LIGHTS ON.  A PERSON SHOULD NOT HAVE TO TURN OFF THE HEAD LIGHTS OFF JUST TO SEE THE BACKUP CAMERA SCREEN.  SOME STATES REQUIRE WHEN IT RAINS TO PUT YOUR HEAD LIGHTS ON.",
        "vin": "5TFAZ5CN7LX"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/01/2020",
        "dateOfIncident": "05/31/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326870,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Toyo Tire Holdings of Americas, Inc.",
                "productMake": "TOYO",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "SUDDEN AND COMPLETE LOSS OF TIRE PRESSURE ON INTERSTATE.  NO VISIBLE SIGN OF DAMAGE TO THE TIRE.  OEM TIRE, NEW TRUCK, 2,500 TOTAL MILES.  TIRE NAME \"OPEN COUNTRY\", MADE IN JAPAN. *TR",
        "vin": "5TFSX5EN5LX"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/19/2020",
        "dateOfIncident": "01/20/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325187,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA TACOMA 2020 TRD OFF ROAD 4X4 VEHICLE.  THE VEHICLE'S BRAKE BOOSTER WHICH USE THE ABS SYSTEM TO STOP THE VEHICLE WHEN IT ROLLS BACK ON A HILL DOES NOT WORKING PROPERLY ON TOYOTA TACOMA OFF ROAD 4X4 VEHICLE. IT CAN NOT STOP VEHICLE AS REQUIRED. IT IS DEADLY DANGERS IN MOUNTAINS STEEP SLIPPERY AND NARROW ROADS. AT THIS CONDITION THE VEHICLE CONTROL IS IN QUESTION. I PERSONALLY FACED IT, BARELY AVOIDED ACCIDENT.  SOME OTHER TACOMA DO HAVE DIFFERENT  BOOSTER WHICH WORKING PROPERLY. OBVIOUSLY, THAT THIS CAR DOES HAVE DESIGN FLOW.  I DID SPEAK WITH TOYOTA DEALER WHERE I DID BUY THE CAR AS WELL AS WITH TOYOTA REPRESENTATIVE. THEY DID ADMIT THAT THIS CAR IS NOT WORKING AS OTHERS BUT DID CLAIM THAT IT IS WORKING AS DESIGNED.   I DO THINK THAT YOU DO HAVE ENOUGH POWER TO PRESS TOYOTA TO FIX THE PROBLEM AT BOOSTER ON TACOMA OFF ROAD 4X4 VEHICLE.  *TR",
        "vin": "3TMCZ5AN0LM"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/05/2020",
        "dateOfIncident": "03/11/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323329,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IN REVERSE AND BACKING UP, ENGINE WILL SURGE WHEN TURNING THE STEERING WHEEL. IN A TIGHT SPACE TRUCK IS DIFFICULT TO CONTROL WHEN THIS HAPPENS.  *TR",
        "vin": "3TMCZ5AN6LM"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/06/2020",
        "dateOfIncident": "03/06/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320325,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STRUGGLES TO START WITH NORMAL STARTING PROCEDURES. VEHICLE'S IGNITION DELAYS NORMAL STARTING PROCEDURES SOMETIMES ALLOWING THE KEY TO BE HELD SYSTEMATICALLY FOR AN ABNORMAL PERIOD OF TIME BEFORE VEHICLE STARTING. IF VEHICLE FAILS TO START IN THE FIRST TRY WITHIN 3-5 SECONDS VEHICLE WOULD CRANK BUT WOULD NOT START. THEN A SECOND ATTEMPT WOULD HAVE TO BE MADE. THIS IS NOT COMMON FOR A GAS ENGINE VEHICLE . WAS TAKEN TO DEALER FOR FURTHER INSPECTION AND SERVICE ADVISOR SAID THIS IS NORMAL FOR MOST LATE MODEL TACOMAS.",
        "vin": "3TMCZ5AN9LM"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "02/25/2020",
        "dateOfIncident": "02/21/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311439,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "SEAT BECAME UNLATCHED, WHILE APPLYING BRAKES.",
        "vin": "3TMDZ5BN6LM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/15/2020",
        "dateOfIncident": "12/20/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299632,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "RE: 2020 TOYOTA TACOMA, ENGINE FAILURE ON 12/20/19  CATASTROPHIC ENGINE FAILURE ON HIGHWAY, TOWED TO DEALER.  ENGINE SEIZED WITH 1400 MILES.  NO VEHICLE ACCESS, NO ACKNOWLEDGEMENT, CORRESPONDENCE NOR ANSWER FROM TOYOTA FOR ALMOST ONE MONTH",
        "vin": "3TMCZ5AN3LM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/14/2020",
        "dateOfIncident": "12/14/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299272,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 TOYOTA TACOMA. WHILE DRIVING AT 40 MPH THE BRAKE PEDAL WAS DEPRESSED BUT PULSATED. THERE WERE NO WARNING LIGHTS ILLUMINATED. DAYTONA TOYOTA  (51 N NOVA RD, DAYTONA BEACH, FL 32114 (386) 222-6757) WAS CONTACTED BY PHONE HOWEVER, THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED.  THE MANUFACTURER WAS CONTACTED BUT NO FURTHER ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS 1,800.",
        "vin": "5TFCZ5ANXLX"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/26/2019",
        "dateOfIncident": "07/22/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11235133,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE SMELLED OF GASOLINE. AFTER DRIVING THE VEHICLE, WHETHER IT WAS 2 MILES OR 20 MILES, ONCE REACHING THE DESTINATION YOU COULD SMELL GASOLINE. THE SMELL LINGERED FOR AT LEAST 30 MINUTES AFTER THE VEHICLE WAS PARKED.",
        "vin": "3TMCZ5AN8KM"
    }
]