[
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/16/2021",
        "dateOfIncident": "08/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444019,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Toyota Yaris. The contact received a notification for NHTSA Campaign Number: 21V617000 (Fuel System, Gasoline) however, the part to do the recall repair was unavailable. The dealer had been notified about the recall and the contact was informed that the parts were not yet available. The manufacturer had been notified of the recall. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The contact had not experienced a failure. VIN tool confirms parts not available.",
        "vin": "3mydlbyv8ly"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/08/2021",
        "dateOfIncident": "08/06/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443092,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Toyota Yaris. The contact received notification of NHTSA Campaign Number: 21V617000 (Fuel System, Gasoline) however, the part to do the recall repair was not available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The dealer was not made aware of the issue. The manufacturer was made aware of the issue but informed the contact they did not know when parts would be available. The contact had not experienced a failure. VIN tool confirms parts not available.",
        "vin": "3mydlbyv2ly"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/28/2021",
        "dateOfIncident": "08/06/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438478,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Toyota Yaris. The contact received notification of NHTSA Campaign Number:  21V617000 (Fuel System, Gasoline) however, the part to do the recall repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact stated that the vehicle was bucking and jerking while driving at slower speeds. The contact stated that also that while depressing the accelerator pedal, the vehicle failed to respond. Additionally, while depressing the accelerator pedal to the flooring, the vehicle made an abnormal growling sound. The approximate failure mileage was 8,000. VIN tool confirms parts are not available.",
        "vin": "3mydlbjv1ly"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/21/2021",
        "dateOfIncident": "06/15/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433853,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "i was at a stop light waiting for a left turn. there was a truck in front of me. the light turned green. the truck drove forward and was beginning to turn. there was a car space between me and the truck. i accelerated to turn and within a few seconds i felt the anti lock brakes activate, car stopped the engine shut off. i had to put the car in park and restart the engine. its a good thing there wasnt a car behind me.",
        "vin": "3mydlbjv5ly"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/26/2021",
        "dateOfIncident": "03/26/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405045,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE OWNERS MANUAL CAPACITIES FOR AN OIL CHANGE WITH FILTER CALLS FOR 4.4QTS. WHEN THIS AMOUNT OF OIL IS USED AND THE PROPER INSTRUCTIONS ARE FOLLOWED AS PER THE SAME MANUAL TO CHECK THE LEVEL WITH THE DIPSTICK IT SHOWS THAT IT IS OVERFILLED BY CLOSE TO 1QT. THE DEALERSHIP CAN'T EXPLAIN IT NOR CAN TOYOTA. I TRULY BELIEVE THAT THIS COULD CAUSE EITHER PREMATURE ENGINE FAILURE OR POSSIBLY AN ENGINE FIRE BECAUSE OF THIS DESIGN FLAW.",
        "vin": "3MYDLBYV7LY"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/08/2021",
        "dateOfIncident": "09/29/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395251,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2020 TOYOTA YARIS WITH 3500 MILES THAT HAS AN INTENSE AND REPEATED VIBRATION PROBLEM THAT STARTED APPEARING 9 MONTHS AFTER I BOUGHT THE CAR NEW. WHEN I COME FULLY TO A STOP, SOMETIMES THE CAR WILL VIBRATE INTENSELY LIKE A MASSAGE CHAIR. THE VIBRATION CAN BE FELT THROUGHOUT - IN SEATS, STEERING WHEEL, DASH, BRAKE PEDAL, EVEN THE DOORS AND WINDOWS. THE VIBRATION IS SO INTENSE IT CAN BE VISUALLY SEEN. WHEN I LOOK UNDER THE HOOD, THE ENGINE IS SHAKING INTENSELY. HOWEVER, THE PROBLEM ONLY HAPPENS IN DRIVE/REVERSE AND WHEN STOPPED. IF THE CAR IS IN PARK/NEUTRAL, OR WHEN THE CAR IS MOVING, IT DOES NOT VIBRATE. THE VIBRATION COMES BACK WHEN PUT BACK INTO DRIVE/REVERSE. THE VIBRATION ONLY HAPPENS ONCE THE CAR IS WARM. CAR VIBRATES AT 500 RPM. WHEN RPM GOES UP TO 600 OR MORE, IT STOPS VIBRATING. IT ALSO STOPS VIBRATING IF THE A/C COMPRESSOR IS TURNED ON (RPMS RISING). AN INDEPENDENT MECHANIC DIAGNOSED THE PROBLEM TO BE A LOW IDLE BECAUSE IDLE RPMS WERE TOO LOW (NOT A ROUGH IDLE). I WENT TO THE TOYOTA DEALERSHIP 4 TIMES TO FIX THE PROBLEM. THEY WERE ABLE TO REPLICATE THE PROBLEM AND FILM IT HAPPENING BUT WERE NOT ABLE TO FIX IT. THE DEALERSHIP HAS CHECKED OTHER CARS FOR THE PROBLEM; THEY FIRST TOLD ME THAT MY YARIS IS THE ONLY ONE WITH THAT PROBLEM, THEN THEY CHANGED THEIR STATEMENT AND SAID \"3 OTHER YARIS AT OTHER DEALERSHIPS ALSO HAD THAT PROBLEM, BUT IT IS LIKE 3 OUT OF 30,000 YARIS\". THIS MEANS THAT THE VIBRATION PROBLEM IS NOT NORMAL FOR THIS CAR AND A FEW OF THESE CARS ARE DEFECTIVE (WITH MINE BEING ONE OF THEM). I WENT TO THE DEALERSHIP 4 SEPARATE TIMES REGARDING THIS ISSUE BUT THEY REFUSED OR GAVE ME AN EXCUSE, SAID THEY COULDN'T FIX IT, COULDN'T REPLICATE THE PROBLEM, ETC. MY CAR ONLY HAS 3,500 MILES AND THIS IS UNACCEPTABLE FOR A NEW CAR. TOYOTA SHOULD ACKNOWLEDGE THIS PROBLEM AND FIND AN EFFECTIVE REMEDY, TAKE THIS CAR BACK, OR COMPENSATE THE OWNER.",
        "vin": "3MYDLBYV3LY"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/12/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328487,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 TOYOTA YARIS. THE CONTACT STATED THAT SEVERAL UNKNOWN WARNING LIGHTS WERE ILLUMINATED. ADDITIONALLY, THE FRONT PASSENGER'S SEAT BELT FAILED TO SECURELY FASTEN INTO THE BUCKLE. THE CONTACT STATED THAT THE FRONT PASSENGER'S SIDE MIRROR COVER DETACHED FROM THE VEHICLE. THE VEHICLE WAS TAKEN TO AN UNKNOWN DEALER TO BE INSPECTED. THE CONTACT WAS INFORMED THAT THERE WAS AN ELECTRICAL SHORT WITHIN THE DASHBOARD. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 6,000. THE VIN WAS NOT INCLUDED.",
        "vin": ""
    }
]