[
    {
        "components": "AIR BAGS,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/14/2022",
        "dateOfIncident": "03/12/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456699,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "There is water stains on passenger A and C pillar interior headliner and C pillar on the drivers side interior headliner right around the air bags",
        "vin": "2T3W1RFV7LW"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/06/2022",
        "dateOfIncident": "02/26/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455396,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Dash lights went out and windows stopped working (incident date is for dash lights).  Clocks are often blank.  Clearly there is an electrical/wiring issue.    I have complained about it to the dealer at the 5k check, 10k check and the 15k check.  At the 15k check they reset the radio!    Also when turning right it feels like the front wheel is curling under the vehicle and makes a terrible sound (but not always).  I made dealer aware of this at the 5k check, 10k check and 15k check.  My warranty will be up soon so they just keep riding the clock out.",
        "vin": "jtmlwrfv3ld"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/02/2022",
        "dateOfIncident": "02/20/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454939,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "During a road trip with my wife I discovered that the headliner started leaking down the A-frame and into the curtain airbags on the A-pillar on the driver and passenger side of the vehicle. Within 2 minutes of googling the issue I found out that 2019-2020 RAV4s with the factory installed roof rails experience a leak caused by a faulty gasket. This information was confirmed by my service advisor at Toyota of El Cajon after he stated \"Yeah you've got the RAV4 leak, I'm finishing up a warranty claim on one right now\". I expressed concerns over electrical damage, damage to the air bags, and possible mold growth in the vehicle and was told that Toyota doesn't consider water leaking into an airbag/control panel to be an issue. I would really like NHTSA to inform Toyota that water leaking into safety equipment through the roof of a new $50,000 car is indeed a safety issue and just awful quality assurance.",
        "vin": "2T3J1RFV9LC"
    },
    {
        "components": "WHEELS",
        "crash": true,
        "dateComplaintFiled": "02/15/2022",
        "dateOfIncident": "12/27/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452160,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TPS monitoring systems were reading or installed on the wrong tires. Asked if possibly the sensors need to be recalibrated after rotations, dealership said no the vehicle is suppose to relearn the new location.   One morning my front tire said it was low, added air and rechecked it with a handheld PSI reader. Also visually checked it for nails or defects. Tire appeared fine so I got in to drive home. It was the rear tire that blew on the interstate driving home not the front left which was the one that was telling me was low. I did look at the rear while getting in the vehicle. It didn’t appear low visually but it was dark at the time and was reading just fine through the Toyota’s PSI monitoring system. Also didn’t drive any different. Typically you can tell if your tire is low or flat by how it drives. You usually can hear a thumping too. Thought maybe the cold weather was just telling me it’s low, cold weather causes tire air to contract dropping PSI but it will stabilize later. Thought maybe it was that or possibly the sensor was bad in it. All I knew was I checked it and made sure the PSI was at the factories recommended amount. Turns out all 4 tires were reading on the wrong location. Which I didn’t know at the time. Caused my vehicle to hit the side of the bridge from fish tailing. Which resulted in damage to the rear arm that needed to be replaced and significant suspension damage. Totaling 3K+ in repairs.   Toyota opened an investigation but has been dragging their feet on the issue. And don’t want to take responsibility nor tell me why my tires are reading in the wrong locations. They stated that I should have checked all the tires PSI by hand because back in the day they didn’t have monitoring systems that told you the exact tire that was low. But if you are going to integrate a monitoring system, it should work properly. If it doesn’t then it shouldn’t be used with the public at all. How is the customer suppose to know that your system is unreliable.",
        "vin": "JTMEWRFV0LJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/09/2022",
        "dateOfIncident": "02/03/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451251,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving down the highway and without warning, my sunroof completely shattered. I did not go over any bumps, there were no trucks around me, and I did not hear anything hit my window. I just heard a very loud pop and all of a sudden there was glass everywhere inside the vehicle. Luckily I did not get into an accident but this was completely startling and I could have easily gotten into an accident or had glass injure myself or passengers (luckily no one else was in the car). I brought the car into a local Toyota dealership in Colorado and they mentioned that someone who had about the same mileage on their car (17,000-18,000) miles came into that same dealership a few weeks ago with the exact same issue. They told me that Toyota would not consider this a defect or under warranty if it happened after 1,000 miles. I also sent a follow-up email to a service manager at the same dealership and he said that they have seen this before and a field technical specialist has looked into it and determined that it could not be a defect if it happened after 1,000 miles. This does not seem like a freak accident if there have been multiple incidents. This is a serious safety concern.",
        "vin": "JTMA1RFVXLD"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "01/25/2022",
        "dateOfIncident": "07/15/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11448769,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Toyota RAV4 Hybrid. The contact stated that the vehicle had unintended acceleration at stop signs and red lights. The vehicle was taken to the dealer and diagnosed as having no failure. Four days later, the failure recurred and the vehicle crashed approximately 6 - 8 feet into the corner of the contact's residence. None of the air bags deployed upon impact. The contact received medical treatment the next day for bruising from her neck to groin, a torn rotator cuff, and neck and back injuries. Police and fire department reports were filed. The insurance company had not deemed the vehicle totaled. The vehicle remained at the contact's residence. The manufacturer was made aware of the failure and instructed the dealer to have the contact drive the vehicle back to the dealer. The failure mileage was approximately 8,000.",
        "vin": "jtmewrfv3lj"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/25/2022",
        "dateOfIncident": "12/29/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448781,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving on the freeway and when randomly we hear a big bang, very loud and scary. Pulled the sunroof cover back to see that the sunroof had exploded/shattered into a million pieces. We were in alot of traffic heading to the mountains, my daughter was sitting in the back seat and this happened right above her head. Its been almost a month, sunroof on back order, didnt realize there was such a thing as exploding sunroofs until I searched the internet. My car is a lease and under warranty, but yet I am stuck with a $500 deductible to get this fixed. After reading all of these complaints how has this not been recalled? At the time of this happening, I had a few rocks also hit my windshield, for it to bounce off windshield and break a sunroof into a million pieces, this seems like a manufacture defect. We have turned this into our insurance company,  but I feel like Toyota should cover this cost, as I had to come out of pocket for deductible and rental car",
        "vin": "jtmewrfv1ld"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/25/2022",
        "dateOfIncident": "01/19/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448807,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Rear liftgate hinges bend/broke at car body attachment  Appears to be a metal issue with hinges  Rear liftgate door will not seal, allowing exhaust gases to enter vehicle  Problem was reported to Dealer at 25K mile mark, Dealer will not repair under new car warranty",
        "vin": "2T3RWRFV2LW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/19/2022",
        "dateOfIncident": "12/04/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448009,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The windshield on this vehicle is extremely fragile and cracks very easily. Many drivers of this vehicle have reported the same issue online with the windshield on the newest Toyota RAV4. Toyota simply refuses to do anything using the guise of \"external influence\" being the cause of a windshield crack - this same logic would apply to a small pebble or a tapping of a finger to cause a windshield crack.",
        "vin": "2t3a1rfv6lw"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/18/2022",
        "dateOfIncident": "08/25/2021",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11447823,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "On 8/25/21, Toyota Rav 4 Vehicle was parked in garage and caught fire burning down garage and house, minor injuries to occupants in house. Vehicle had recently 7/01/21 been repaired at dealership for battery discharge when parked by installation of new update to DCM Software according to TSB-0095-20  Rev2.   The vehicle has been inspected by police, Hidalgo County, Texas Fire Marshall and Progressive Insurance Company Progressive.  Origin of fire started in vehicle but cause of vehicle fire undetermined by Fire Marshall, Insurance Company related fire to charger plugged into dash of vehicle.",
        "vin": "2T3H1RFV1LW"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/14/2022",
        "dateOfIncident": "04/03/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11447512,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owned a 2020 Toyota Rav4. The contact stated that while driving 45 mph with the cruise control activated and while coming to a red light, the driver depressed the brake pedal and the braking system malfunctioned causing the vehicle to not stop. The vehicle drove through a red light causing a collision with a second vehicle. During the crash the driver sustained rib and torso injuries,  the front passenger sustained injured ribs and fractured tailbone and the rear passenger side occupant sustained a fractured tailbone. No further information was available regarding the second vehicle. During the crash, the vehicle was destroyed. A police report was taken at the scene and the vehicle was towed away. The contact indicated that prior to the incident the vehicle had been examined at the dealer for a possible braking problem but no trouble was found. The manufacturer and local dealer were notified of the incident. In addition, the contact indicated that the backup camera audible alarm was inoperable. The failure mileage was 9,000.",
        "vin": "2T3W1RFV9LC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/07/2022",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446615,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Toyota emphatically advertises that its  2020 RAV4 hybrids come equipped with a 14.5-gallon gas tank that can hit a 580-mile driving range.  The cars suffer from the apparent fuel tank issue that harms both the environment and the benefit of the cars’ electric power. The RAV4 hybrids not only fail to comply with federal and state gas tank regulations, which prohibit the sale of vehicles that cannot fill 90 percent or within two gallons of their nominal gas tank capacity, but suffer from substantially reduced driving range.  The fuel tank defect poses an environmental and safety hazard in that drivers are left to guess how much gas they have left and effectively encouraged to top off their fuel tanks in order to fill up as much as possible,",
        "vin": "4t3ewrfvxlu"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/13/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443634,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "In the sring of this year, i lightly drove through a water filled pothole in a parking lot when all of the displays went dark for a split second and then came back on like the car had just started. I called my dealership right away and was told that maybe some water had gotten into some wiring and caused the glitch but to call again ASAP if it happened again. On Dec 9, 2021 under dry and even surfaces while making a left turn the vehicle went dark again while driving but this time took a touch longer to re-engage. I called the dealership again to report this to be looked at during a maintenance appointment. They found nothing wrong, but suggested it was a feature the car does not have was turned on and they turned it off. I was then shown the button responsible for this ... it was for automatic high beams, NOT some engine efficency button. On Sunday, 12 12 2021 i went to start the car to go to work and it was completely dead, just a small clicking sound to be heard within the cabin. i had to get the car jumped to get it started on the second turn of the key after i removed it from the first attempt. I drove it to the dealership that day and i am still waiting for results. This needs to be adressed ASAP because its a potentially dangerous if not deadly situation if it conks out at highway speeds in front of a semi.",
        "vin": "2t3lwrfv0lw"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/24/2021",
        "dateOfIncident": "11/21/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441556,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "On Sunday,11/21/2021, sitting in my Toyota Rav4 TRD Off Road with my wife in an outside parking lot to a medical office, when we heard a loud pop/bang.  We got out of the vehicle and discovered that the sun roof had shattered. Nothing hit my car.  We were parked in it it for 15 minutes. There was nothing around the vehicle. I taped the window with Gorilla Tape. Dealership inspected the car and told me the warranty does not cover glass. Dangerous situation! Potential for flying glass! There is no warning system for this type of incident.",
        "vin": "2T3J1RFV7LC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/16/2021",
        "dateOfIncident": "11/16/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440715,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "This is regard to 2020 RAV4 XLE with 7,000 mileage battery dead issues twice due to software issue based on Toyota dealership reports.   I do drive my car daily and car not sat in garage more than 2 days!  On evening of July 24th I wan’t able to turn on the vehicle. It was totally dead. Had to request road assistance for jump then took  the car to Toyota Sunnyvale for check. They mentioned the issue was the battery and then having hard time with them to replace it with a new one. They Assured and Confirmed with me couple of times on the phone and at the Service Center this issue will never ever happen again. I was told it was a software issue that was consuming the battery and company fixed the software and they updated on my car and it won’t  happen again for sure.  Morning of November 16th while was heading to work same story repeated again. Faced with a totally dead vehicle, called again for road assistance for a jump and car is now sitting at Toyota Sunnyvale Service Center for analysis.  I cannot trust to Toyota Service Centers any more and now I cannot relay on my vehicle. I look forward for a reasonable response from Toyota Motor Corporation.  Why customer has to face with dead battery, ask roadside assistance and visit the dealership to identify the problem? What if I was out of town or in situations that cannot get roadside assistance? Why if this software issue it was not  software recall and customers was not informed? Why this issue happened twice? What guarantees this will never happen again?",
        "vin": "2T3W1RFV4LW"
    },
    {
        "components": "VISIBILITY,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/09/2021",
        "dateOfIncident": "11/08/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439865,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "My name is [XXX]. My wife, myself, our 2 month old baby and our dog were driving back from a family vacation when our moon roof spontaneously exploded outward. It was an extremely loud noise and then sounded like it was raining glass. Our baby started screaming and crying from the noise. We were able to immediately and safely pull off the freeway to examine the vehicle. Upon inspection we noticed the remaining glass on the edges of the moon roof looked as if it were being pulled upwards. We are very lucky the screen was shut and nobody got hurt. The incident occurred on a sunny & clear, early afternoon while we were on the freeway going 55mph, there were no cars in front of us or beside us for more than a half mile, we were not near or passing under a bridge or an overpass. There were no warning lights or other symptoms before the incident happened, as well as no warning lights after the fact. There was absolutely no reason this should have happened or anything that we did to cause it or to stop it from happening. I took photos of the damage immediately after and it shows the remaining glass lifting outward. I did some online searching and found that this has happened to multiple other drivers with this exact make & model of vehicle, as well as multiple other years.  I brought our car into Toyota within an hour of the incident occurring. One of their employees working said that she has heard of this happening before. I see this as a recurring incident with this model of car and it is extremely dangerous. We bought this vehicle with only 5k miles on it, less than 3 months ago from a Toyota dealership. We bought this car because we have a new baby and wanted a safe family vehicle. We are now terrified that this will happen again. We never would have imagined that anything like this would happened in the first place. From my recent research I am shocked that this vehicle issue has not been recalled.   INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "2t3ewrfv5lw"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/29/2021",
        "dateOfIncident": "06/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438647,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I want an investigation on Toyota Rav4 hybrid 2020 .It has a faulty traction control system . It kicks in on every bump and start the emergency braks vehicle jerks and driver gets confused . its a safety issue and may start causing accident on high speed",
        "vin": "2T3LWRFV3LW"
    },
    {
        "components": "STEERING,AIR BAGS,LANE DEPARTURE",
        "crash": true,
        "dateComplaintFiled": "10/05/2021",
        "dateOfIncident": "10/02/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11435490,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "the car simply a LEMON big time was bought on 08/2020 thru the Santa Monica city Toyota Dealers...they are awful too. let my dad, 80, buy all extra insurances when its brand new car and has 3 years bumper to bumper warranty.  he and me his daughter that is dedicated driver sometimes keep complain that its get bazuka after 35--39 and move up miles per hours, power steering wheel Out of control basically.   can be turn 65 to 90 degree angle without even sorry to say spitting on it..., the UGLY safety feature that will help you to change the lane on freeway, we wouldn't even will be mentioning that. I think its million dollars case here as a LEMON LAW against Toyota Corporation",
        "vin": "2t3c1rfv6lw"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/23/2021",
        "dateOfIncident": "09/07/2021",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434064,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Toyota Rav4. The contact stated that the mirror housings of the vehicle were melting. The dealer and the manufacturer were not notified of the failure. The vehicle was not diagnosed nor repaired. The approximate failure mileage was 8,500.",
        "vin": "JTMEWRFV6LD"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/23/2021",
        "dateOfIncident": "06/15/2021",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434066,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Toyota Rav4. The contact stated that the mirror housings of the vehicle were melting. The dealer was made aware of the failure and informed the contact that they could not assist as the failure was a manufacturer defect. The dealer referred the contact to the manufacturer. The manufacturer was notified of the failure advised the contact that they would follow up with the dealer. A case was opened. The contact stated the dealer took photographs of the failure. The contact stated the manufacturer contacted her and informed her that their field experts determined that the failure was not a manufacturer defect but an environmental issue called solar conversion. The vehicle was not repaired. The approximate failure mileage was 10,000",
        "vin": "JTMEWRFV7LD"
    },
    {
        "components": "SEATS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/09/2021",
        "dateOfIncident": "09/09/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432370,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I am reporting a PROBLEM - the headrests on the front driver and passenger seats will NOT stay down on my 2020 Toyota Rav4- they always slowly keep moving upwards- I guess from the natural vibrations of the  road. I complained at the Toyota service department (at Wilde Toyota in Milwaukee Wisconsin) and they said that is how their headrests work in the Toyota Rav4 - they don't stay down. While this may not be an issue for a tall person, an average person of  5 ft 5 inch tall or shorter would have a serious problem with their head being smacked around when the headrest won't stay down - I have never experienced a headrest that won't lock in place and stay there- I think this could be terrible if I got into an accident and my headrest was in the wrong position.  I am shocked that Toyota does not care. I think you should check into this. A manager there did acknowledge he has heard of this problem before and has had a few people complain about it but they don't think it is a big deal. - they were tall men so they didn't care - they like the headrest all the way up as far as it goes.",
        "vin": "JTMDWRFV0LD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/18/2021",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429669,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "My car’s distance to empty never goes above 420 miles, despite a visit to the Lexington MA Toyota dealership with this complaint.  Published range is about 580 miles.  The dealership reset values in the car, but this did not make any difference, and at no point during my ownership of the car (which was bought new) has the range on the dashboard when the tank is full exceeded 430 miles.",
        "vin": "4T3RWRFV2LU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/05/2021",
        "dateOfIncident": "05/24/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11427932,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owned a  2020 Toyota RAV4.The contact stated while stopped at a red light the vehicle was struck from behind by a Ford F-150 which resulted in none of the air bags deploying. The contact sustained a broken nose, cheeks, dislocated shoulders, and back injury. The contact was transported by ambulance from the scene of the collision.  A police report was taken and the vehicle was towed to a junkyard where it was determined to be destroyed. The manufacturer was informed of the failure and the contact was awaiting a reply. The failure mileage was approximately 54,354. The malfunction airbags according to Toyota Manufacturer.",
        "vin": "2T3LWRFV6LW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/29/2021",
        "dateOfIncident": "07/28/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426967,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Car sat for 4 days while we here hiking.  Battery went dead.  We were 15 miles up a gravel road and thankfully someone came by who had jumper cables.  Reported issue to Toyota today and will take to dealer.  Apparently, Toyota has no current fix for the battery drain when vehicle is off.   Searched online and found 100s of reports of this same issue from 2019, 2020 rav4 owners, both hybrid and non-hybrid.",
        "vin": "JTMRWRFVXLD"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/09/2021",
        "dateOfIncident": "07/08/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424057,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving on the freeway, the panoramic sunroof exploded.  I have photos showing the glass exploding up & outward (away from the vehicle), rather than downward as one would see if the glass had been impacted by a foreign object.  Had I not had the sunroof screen closed glass would have come down onto myself along with any other passengers who could have been inside the vehicle, and possibly caused an accident with other vehicles.  Currently the vehicle is at the Toyota dealership and I am awaiting inspection from Toyota's corporate department and my insurance company.  There was no warning prior to this event occurring.",
        "vin": "jtmdwrfv1ld"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/04/2021",
        "dateOfIncident": "03/04/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423418,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I have had issues with my 2020 rav4.  I have had kickbacks during acceleration, antifreeze/coolant loss, abnormal amount of blow-by, engine runs loud at times, car shakes when I start it, weird noise from under the hood, the dash lights and screen lights went dark once.  I have been to multiple dealerships not long after I bought it and they said they “could not duplicate the issue”..  when I went to them regarding the antifreeze leak they said it is normal in new cars which I know is absolute lies.  I need help as they are not willing to find the issues.  I have pictures and videos to back this up.",
        "vin": "JTMC1RFV9LJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/22/2021",
        "dateOfIncident": "08/31/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421778,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Ongoing problem with an intermittent steering issue.  The problem is that this is an intermittent issue and hard to get to dealer during time of concern, and while they could troubleshoot the issue before the issue fixes itself.   The concern ALWAYS happens upon starting vehicle.  Never happens when you are already going and issue is not present.  Steering wheel will pull right, or left, upon start up, and then at some point it fixes itself and problem is no longer an issue.  Could happen at any time upon start up, cold or hot weather, fresh start, or going back out after having been on road already, just no rhyme or reason for it.    The safety issue is that when turning, when it is pulling, is that it pulls you towards the curb/shoulder, or towards oncoming traffic.  Additionally, it will also not return the wheel after a turn, so if it was pulling left, and you are turning left for example, you have to manually get that wheel back or it'll just keep going left.    I've experimented with turning off lane keep assist, lane centering (cruise control), put it in different modes like trail, sport, etc. and even stopped on the shoulder, and tried to re-start the vehicle.  Nothing can stop it consistently.  And it fixes itself within a 10 minute period.  I have checked the AWD monitor screen to see if a wheel is pulling harder than the others based on the display of power going to wheels, no luck.   It has been doing this since day one.  Not every trip.  Not even every week.  Sometimes it could happen 5x in a week, and sometimes it could be 2 weeks before it happens again and then again in another couple of weeks.  Not the road either.  Must be paying attention when starting out because it could happen on any trip, during a trip if stopping and re-starting vehicle while on a trip, etc. because it can/will pull you.  I have a video, albeit hard to really see much but shows car pulling.  Also note this is NOT a torque steer because it could happen on acceleration OR not.",
        "vin": "2T3RWRFV5LW"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/22/2021",
        "dateOfIncident": "08/31/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421779,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "A different problem that involves steering is when using speed control (cruise control).  I only have attempted this while on the PA Turnpike at faster speeds, or a highway with a higher speed limit, but when engaging speed control with lane centering assistance, vehicle will sometimes pull you too close to the left side of your lane.  In some cases, it will almost appear to others you are drunk as it is working to keep you centered in your lane, but at times it will just pull you to the left side of your lane, so close to others that traffic will beep and I'll want to poop my pants, because it harder to pull back to center when this is doing the steering for you in cruise control mode.  Have turned off lane center assist and the speed control works fine, including slowing you down as traffic slows.  But with lane center assist on, and using cruise control, this is when erratic behavior exists.  Dealer could not duplicate the issue - would require taking this on a fast moving highway, like the PA turnpike, and hope it happens while out on that trip.  Does not always do it, and have to been able to figure out why it does it (I.E. double yellow line vs. white intermittent line).    When it happens, it puts you too close to traffic next to you and could cause other vehicles to either impact with you or make them swerve out of the way thinking you are coming into their lane.  Very serious when it happens, moving at high rate of speed, and lane centering when using speed control is very strong and harder to override vs. the small bump it gives you when not using speed control and too close to the shoulder for example.  That lane correction works well, albeit a bit weak to correct.    Has happened since new, August 2020.  And continues to happen sporadically.",
        "vin": "2T3RWRFV5LW"
    },
    {
        "components": "STRUCTURE,FORWARD COLLISION AVOIDANCE,LANE DEPARTURE",
        "crash": true,
        "dateComplaintFiled": "06/21/2021",
        "dateOfIncident": "05/30/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421657,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I bumped the car in front of me when starting from a red light at an intersection. Impact speed was less than 3 MPH. The damage from this impact resulted in repair cost of almost $4,200. This is outrageous and an example of poor design on the part of Toyota. It is my understanding that the standards require vehicles to absorb up to 5 MPH frontal impact with no damage. Had I known this vehicle was so poorly protected I would have chosen to purchase something else.",
        "vin": "2t3h1rfvxlc"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/08/2021",
        "dateOfIncident": "05/11/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420097,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "My computer car shows these messages: 1. Pre-Collision System: A malfunction in the System has been detected. do not relay on this system. 2. Vehicle Stability Control System: A malfunction in the VSC, TRAC, or hill-start assist control system has been detected. Do not relay on these systems. I ask to another costumer who have the similar car and he said he has the same messages. My Toyota dealer could not detected in all the PM..!!!",
        "vin": "JTMH1RFV3LD"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/01/2021",
        "dateOfIncident": "05/30/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419265,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Went to start car and received warning that smart key was not working Unable to turn on car followed instructions in manual car would not turn on and all power lost Unable to open doors Called AAA and technician stated front battery was drained no power and that battery bad Took to dealer who stated it was computer problem that caused battery to be drained This is a safety issue as this appears to be a recurring problem  Should not be occurring in new car",
        "vin": "JTME6RFV3LD"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/26/2021",
        "dateOfIncident": "05/26/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418641,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 Hybrid Toyota RAV4 would not turn on, indicating \"Smart Key System Malfunction\" - has less than 7,000 miles on it, is driven daily, and no lights or other electrical components were left on in the vehicle between the last time it was driven and when it failed to start. Toyota Roadside Assistance was able to jump the 12V battery and get it started, but warned that it is not a long-term fix.",
        "vin": "2T3RWRFV8LW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/20/2021",
        "dateOfIncident": "05/19/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417880,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I purchased this vehicle in 2020 and from then this has happened twice and no information was provided when I serviced my vehicle or when the vehicle was repaired last time. The battery died earlier with a warning but this time, the battery died again without a warning. The battery was changed in August within 7 months of purchasing the vehicle and after that in the next 8-9 months, the battery died. I am scared to use this vehicle anymore because you never know when the battery will die and the service center people have no information about why the battery got drained out. I saw few more similar complaints online. The vehicle was idle or not used only for 3 days.",
        "vin": "2T3A1RFV0LC"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/17/2021",
        "dateOfIncident": "05/17/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417489,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONTACT OWNS A 2020 TOYOTA RAV4. THE CONTACT STATED WHILE DRIVING 70 MPH, THE CONTACT HEARD AN ABNORMAL SOUND COMING FROM THE VEHICLE. THE CONTACT STATED THAT THE SUN ROOF GLASS WAS SHATTERED. THE CONTACT STATED THAT THE SUN ROOF GLASS SHATTERED WITHOUT INCIDENT OR IMPACT. THE LOCAL DEALER WAS CONTACTED TO SCHEDULE AN APPOINTMENT FOR THE VEHICLE TO BE INSPECTED HOWEVER, THE DEALER WAS EXTREMELY BUSY AND WAS UNABLE TO INSPECT OR REPAIR THE VEHICLE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 14,000.",
        "vin": "JTMW1RFV8LD"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/16/2021",
        "dateOfIncident": "05/04/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416790,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE OWNING THIS VEHICLE, WHICH I PURCHASED IN JUNE 2020, THERE HAS BEEN A STRONG SMELL OF ANTIFREEZE COMING FROM THE FRONT LEFT OF THE VEHICLE.  THE SMELL ONLY HAPPENS WHEN IT IS WARM AND THE AIR CONDITIONER IS RUNNING.  I DO NOT SMELL IT INSIDE THE CABIN. THE SMELL IS VERY STRONG.  I HAVE TAKEN IT THE DEALER 5 TIMES AND AFTER MANY SYSTEMS TESTS, THEY HAVE TOLD ME THE SMELL IS \"NORMAL\" AND THERE IS NOTHING WRONG.",
        "vin": "JTMG1RFV0LD"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/05/2021",
        "dateOfIncident": "05/05/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415329,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO RIGHT HAND SIDE TIRES BLEW OUT WHEN EXITING THE FREEWAY. THERE WAS NO WARNING ABOUT LOW TIRE PRESSURE AND IN ADDITION TO THAT, THIS IS A BRAND NEW 2020 LEASED VEHICLE (1 YEAR OLD). ALL FOUR TIRES NEEDED TO BE REPLACED.",
        "vin": "2T3W1RFV8LC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/29/2021",
        "dateOfIncident": "03/22/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414499,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 TOYOTA RAV4. THE CONTACT STATED THAT WHILE DRIVING IN INCLEMENT WEATHER, WATER LEAKED INSIDE THE VEHICLE FROM THE ROOF RACK INTO THE INTERIOR CABIN AND A BY THE A-PILLAR. THE CONTACT WAS CONCERNED THAT THE WATER COULD CORRODE THE AIR BAGS CAUSING THEM TO NOT DEPLOY IN THE EVENT OF A CRASH. THERE WAS NO WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO RAY BRANDT TOYOTA (2460 VETERANS BLVD, KENNER, LA 70062) WHERE IT WAS DIAGNOSED WITH THE ROOF RACK SEALS NEEDING TO BE REPLACED. THE VEHICLE WAS NOT YET REPAIRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE AND REFERRED THE CONTACT TO AN AUTHORIZED DEALER. THE FAILURE MILEAGE WAS APPROXIMATELY 8,100.",
        "vin": "2T3J1RFV6LC"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/27/2021",
        "dateOfIncident": "04/20/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414125,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA HAS A SERVICE BUILTIN ON A DCM FIRMWARE UPDATE THAT FIXES AN ISSUE WITH REMOTE START AND WILL KILL THE 12V BATTERY EVEN BUT REFUSES TO NOTIFY OWNERS OR EVEN STATE PUBLICLY IF THEY INSTALLED THIS DURING THEIR INSPECTION ON MY CAR.   HAVE BEEN INTO THE DEALERSHIP MULTIPLE TIMES AND HAD AT LEAST ONE BATTERY REPLACED IN A 1 YEAR OLD CAR.  HTTPS://WWW.RAV4WORLD.COM/THREADS/REMOTE-START-SOS-APP.309804/",
        "vin": "2T3EWRFV8LW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/06/2021",
        "dateOfIncident": "04/04/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406643,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BAD BATTERY- MY 2020 RAV4 WAS IN MY DRIVEWAY FOR 4 DAYS WITHOUT BEING DRIVEN.  WHEN TRYING TO START IT, THE BATTERY WAS DEAD (NOTHING WAS LEFT ON).  JUMPED BATTERY AND IT RAN FOR A FEW HOURS.  IT SAT AGAIN FOR 2 HOURS AND THEN THE BATTERY WAS DEAD AGAIN.",
        "vin": "JTMK1RFV4LD"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/06/2021",
        "dateOfIncident": "05/26/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406644,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "UNLESS ALL BACK PASSENGER SEATBELTS ARE FASTENED, THE 'FASTEN SEATBELT SEAT' LIGHT AND BEEPING CONTINUOUSLY GOES OFF.  THIS HAPPENS WHEN NOTHING IS ON THE SEATS AND NO ONE IS SEATED IN THESE SEATS.  THIS HAS BEEN CONTINUOUSLY ONGOING, WHILE DRIVING, SINCE THE DAY I DROVE IT OFF THE  DEALER LOT IN MAY 2020.",
        "vin": "JTMK1RFV4LD"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/05/2021",
        "dateOfIncident": "04/02/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406408,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "GOT IN THE CAR AND IT WOULDN'T CRANK. SEEMED LIKE A DEAD BATTERY ALTHOUGH NOTHING WAS LEFT ON. PUT JUMPER CABLES ON IT AND IT WOULD NOT EVEN JUMP OFF. IT WOULD ACT LIKE IT WAS GOING TO TURN OVER THEN WOULD MAKE A CLICKING NOISE. CAR IS NOT EVEN A YEAR OLD WITH 10,000 MILES.",
        "vin": "2T3J1RFV9LC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/03/2021",
        "dateOfIncident": "03/26/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406231,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL GAUGE NOT PROPERTY WORKING AND GIVING INADEQUATE FUEL AMOUNTS LEFT IN TANK. AT 1/2 OF TANK IT'S MISREPRESENTATION OF ACTUAL FUEL LEFT THAT CAN LEAD TO BEING STRANDED.",
        "vin": "2T3F1RFV6LC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/20/2021",
        "dateOfIncident": "03/31/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403990,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA IS SELLING RAV4 HYBRID 2020 WITH DEFECTIVE GAS TANK. THEY ADVERTISE A 14 GALLON TANK AND ONLY 9-10 GALLONS FILL IT. TOYOTA KNOWS ABOUT THE PROBLEM AND THEY ARE STILL SELLING VEHICLES TO THE PUBLIC.",
        "vin": "2T3RWRFV4LW"
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/15/2021",
        "dateOfIncident": "03/13/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402996,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN VEHICLE WAS STATIONARY AND IN COVERED CARPORT SUNROOF SPONTANEOUSLY POPPED AND SHATTERED",
        "vin": "JTMN1RFV0LD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/14/2021",
        "dateOfIncident": "04/06/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402874,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL TANK CAPACITY WHEN THE CAR WAS BOUGHT NEW WAS 9.3 GALLONS BETWEEN LOW FUEL LIGHT TO REFUEL CLICK AT GAS PUMP.  AFTER FUEL TANK CAPACITY AFTER FUEL TANK AND PUMP REPLACEMENT IS 11.3 GALLONS.  THIS IS BETWEEN WHEN THE LOW FUEL INDICATION ASSERTS TO WHEN REFUELING CLICKS AT THE GAS STATION.  THIS IS STILL WELL BELOW THE ADVERTISED FUEL CAPACITY OF 14.5 GALLONS.  A SOFTWARE RESET WAS DONE, BUT THE FUEL CAPACITY DID NOT CHANGE.  THIS CAUSES US TO REFUEL MORE OFTEN THAN EXPECTED SINCE THE ADVERTISED RANGE OF 500 MILES ON A TANK OF GAS CAN NOT BE ACHIEVED.  HAD WE KNOWN OF THIS ISSUE WHEN WE BOUGHT THE CAR, WE WOULD EITHER NOT HAVE BOUGHT THE CAR OR PAID LESS.  TOYOTA IS STILL SELLING THESE CARS WITHOUT WARNING CUSTOMERS OF THE FALSE ADVERTISEMENT.",
        "vin": "JTMEWRFV7LJ"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "03/08/2021",
        "dateOfIncident": "03/06/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399805,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE FEATURE IS ENGAGED, THE CAR CHANGES LANES.  HAD IT INSPECTED AND ADJUSTED BY THE DEALER.  DEALER SAID \"IF I DON'T LIKE THE FEATURE, TURN IT OFF\"  SO I DO NOT USE THIS \"SAFETY\" FEATURE AS IT WOULD CAUSE ME TO HAVE AN ACCIDENT.  I'VE ONLY TURNED IT ON WHEN I CAN DO SO SAFELY WITHOUT SOMEONE NEAR ME TO SHOW.  FEATURE IS ONLY ENGAGED OVER 35 MPH SO WHEN I AM ON THE HIGHWAY.",
        "vin": "4T3EWRFV8LU"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/07/2021",
        "dateOfIncident": "03/02/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399567,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER THE CAR SITS FOR 3 OR 4 DAYS I DRIVEN THE BATTERY DIES AND NEEDS TO BE JUMPED TO GET IT STARTED AGAIN. NO LIGHTS LEFT ON OR ANYTHING. ON COLD START THE ENGINE MAKES A TICKING NOISE THAT HAS BEEN GETTING LOUDER OVER THAT LAST FEW MONTHS.",
        "vin": "2T3C1RFV2LW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/05/2021",
        "dateOfIncident": "07/16/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399439,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 RAV4 HYBRID: BATTERY KEEPS DYING. PURCHASED 6/22/20, BATTERY DIED MULTIPLE TIMES 3 WEEKS LATER, BATTERY REPLACED 7/16/20. BATTERY DYING AGAIN 2/19/21 AND AGAIN 3/5/21. ONGOING ISSUE. ALSO HEAD UNIT W/USB PORT HAD TO BE REPLACED 12/8/20 AFTER FOUND INOPERABLE MULTIPLE TIMES, THE FINAL BEING 11/9/20. BOTH STOPPED WORKING AFTER SITTING 1-3 DAYS. MAIN. RECORDS NOT UPLOADED SINCE FILE MAY BE PUBLIC DOMAIN, SENSITIVE INFORMATION ON RECORDS. TOYOTA MAY CONTACT ME DIRECTLY FOR RECORDS HOWEVER, AS I HAVE KEPT ALL OF THEM.",
        "vin": "JTMMWRFV5LD"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/24/2021",
        "dateOfIncident": "02/24/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397822,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE MILEAGE I AM GETTING IS FAR BELOW THE STATED RATING ON THE STICKER. I AM AVERAGING ABOUT 33.5 MPG IN MIXED DRIVING WHEREAS THE STATED RATING IS 41 MPG OVERALL. IT'S NOT EVEN CLOSE. THE TANK WAS RECENTLY REPLACED BECAUSE YOU COULD NOT FILL THE TANK. EXTREMELY DISAPPOINTED IN THE MILEAGE WHICH WAS THE MAIN PURPOSE OF BUYING THIS VEHICLE. SOMETHING NEEDS TO BE DONE.",
        "vin": "2T3DWRFV6LW"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "02/23/2021",
        "dateOfIncident": "02/15/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397651,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "NEW VEHICLE BROUGHT IN FOR IT'S 5K MAINTENANCE, TO THE SERVICE DEPARTMENT OF THE DEALERSHIP IT WAS PURCHASED FROM. I POINTED OUT SEVERAL ISSUES WITH THE GAS TANK RANGE, BSM, CAMERA SHUTTING OFF, AND THAT I HAVE TO  KEEP THE STEARING WHEEL TURNED TO THE RIGHT IN ORDER TO GO STRAIGHT. 5K MAINTENANCE IS PERFORMED, THEY NOTICED THE CAR NEEDED TO BE REALIGNED. DRIVING HOME, NO DIFFERENCE FROM WHEN FIRST BROUGHT IN. BRING IT IN TO THE DEALERSHIP NEXT DAY, THE DAY AFTER, I'AM NOTIFIED THAT THE CAR IS READY FOR PICK UP, I ASK WERE IF THEY WERE ABLE TO FIND WHAT CAUSED THE AGLINMENT TO GO OUT A SECOND TIME. THERE RESPONSE IS THAT THERE WAS NO INDICATION OF WHAT CAUSED IT. INFORM THEM THAT 1. I'AM CONCERNED FOR MY SAFETY AND 2. THE LONG TERM DAMAGE THIS IS CAUSING. THEY INFORM ME THAT THEY WILL LOOK INTO THE PROCESS, AND HAVE MANAGEMENT INVOLVED. NEXT DAY, MANAGER INFORMS ME THAT THE AGLINMENT MACHINE WAS OUT OF CALIBRATION, HE HAD TO STOP A TECHNICIAN FROM WORKING ON THE CAR, HAD THE MACHINE CALIBRATED, AND THAT HE PERSONALLY PERFORMED THE ALGINMENT. I PICK UP THE CAR AND THE STEERING WHEEL HAS TO BE TURNED TO THE LEFT TO GO STRAIGHT ON THE HIGHWAY AT 35-45MPH, SLOWING DOWN/STOPPING & ACCLERATING. BRING IT IN NEXT DAY, MANGER HAS 3 ALGINMENTS PERFORMED TO SEE IF THERE ARE ANY VARIATIONS, TELLS ME EVERYTHING IS IN SPEC. IT IS SO PERFECT THEY DIDNT EVEN HAVE TO TAKE A WRENCH TO IT. REASSURES ME NUMEROUS TIMES THAT IT IS SAFE AND IN SPEC, HANDS ME A PAPER \"PROVING\" SO. DRIVE HOME, STEERING WHEEL IS STILL TO THE LEFT. I LOOK AT THE PAPER AND IT CLEARLY LISTS 3 VALUES THAT ARE MARKED AS NOT WITHIN SPEC, AND THAT IT MAY CAUSE WEAR, HANDLING AND SAFETY ISSUES. CAR IS TOWED TO A DIFFERENT DEALERSHIP. DURING THERE TEST DRIVE THE TECH NOTICED THE WHEEL WAS JERKING TO THE LEFT WITHOUT WARNING. WAS INFORMED THAT THE STEARING WHEEL NEEDED A SOFTWARE UPDATE & THE ALGIMENT IS OUT OF SPEC.",
        "vin": "2T3P1RFV7LW"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/17/2021",
        "dateOfIncident": "01/22/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396574,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "HYBRID MALFUNCTION WARNING LIGHT WHILE DRIVING.",
        "vin": "2T3EWRFV1LW"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/17/2021",
        "dateOfIncident": "02/08/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396617,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT WINDSHIELD DEFROSTER IS LOCATED IN THE CENTER 1/2 OF THE WINDSHIELD, BUT NOT ON THE LEFT OR RIGHT SIDE. AS SUCH, THE LEFT AND RIGHT SIDE OF THE WINDSHIELD WILL ICE-OVER DURING NORMAL WINTER SNOW CONDITIONS. ADDITIONALLY, PASSENGER-SIDE WINDSHIELD WIPER FALLS OUTSIDE OF THE DEFROSTER AND WILL FREEZE OVER, ALLOWING THE WIPER TO BUILD-UP ICE THAT MAY SCRATCH THE WINDSHIELD.    BECAUSE OF THE AUTOMATIC WEATHER SYSTEM, IT IS ALSO POSSIBLE TO RUIN YOUR WINDSHIELD WIPER MOTOR FROM THE AUTOMATIC WEATHER SYSTEM TURNING THE WIPERS ON TO FULL IN AN ATTEMPT TO TRY AND REMOVE THE ICE. BECAUSE THE ICE NEVER MELTS, IT CAN'T WIPE THE ICE OFF AND THUS CONTINUES WIPING AT FULL-SPEED. IF THIS PERSISTS, MOTOR WILL BURN-OUT LEAVING BOTH WIPERS OUT OF COMMISSION.    I HAD THIS PROBLEM WHILE DRIVING ON A MOUNTAIN HIGHWAY IN NORMAL SNOW CONDITIONS. BOTH SIDES OF WINDSHIELD LOCATED OUTSIDE OF THE CENTER 1/2 FROZE OVER AND BECAME HARD TO DEFROST, AND THE PASSENGER-SIDE WIPER HAD AN ICE BUILD-UP. SEEMS TO AFFECT THE 2019-2021 MODEL RAV4 AS WELL AS SOME 4RUNNER MODELS WITH THE SAME DEFROSTER BUILD.",
        "vin": "4T3EWRFV0LU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/15/2021",
        "dateOfIncident": "02/15/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396331,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER THE VEHICLE WAS ON THE DRIVEWAY FOR LESS THAN 24 HOURS, IT WOULD NOT UNLOCK DOORS, DISENGAGE THE SHIFT FROM PARK, OR START THE ENGINE.  THE BATTERY APPEARED TO HAVE CHARGE AS THE LIGHTS WOULD GO ON.  THIS WAS THE SECOND TIME THE PROBLEM OCCURRED.  TOYOTA UPDATED THE SOFTWARE, BUT THIS FIX DID NOT SOLVE THE PROBLEM.",
        "vin": "2T3P1RFVXLC"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/12/2021",
        "dateOfIncident": "02/11/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395956,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "LEASED MY 2030 RAV 4 XLE AWD IN LATE NOV 2019   IN JULY 2020 THE ENGINE STOPPING WHEN BREAKING FEATURE WOULD NOT WORK. MESSAGE SAID BATTERY CHARGING. BROUGHT IT TO THE DEALERSHIP THEY SAID THEY COULDN'T FIND ANYTHING WRONG THAT DIDN'T DRIVE IT ENOUGH. TOOK IT HOME. A WEEK LATER IT HAPPENED AGAIN.DEALER KEPT IT OVERNIGHT TO CHECK THE FULL ELECTRIC SYSTEM. FOUND NOTHING WRONG TOLD YOU DRIVE IT MORE. HAPPENS EVERY ONCE AND AWHILE. JUMP TO FEBRUARY 2021. DRIVING IT MORE PARKED CAR OUTSIDE 30 DEGREE NIGHT. NEXT MORNING WENT TO TAKE MY SON TO WORK AND THE CAR WAS TOTALLY DEAD. NOTHING WORKED. DIDN'T LEAVE ANYTHING ON, EVERYTHING LIKE IT ALWAYS WAS. CALLED TOYOTA SERVICE WHO SENT SOMEONE TO JUMPSTART IT. THAT WORKED. I WAS TOLD TO LET IT RUN FOR 30 MINS. I TOOK IT TO THE DEALERSHIP TOYOTA OF MASSAPEQUA NY. THEY CHECK THE BATTERY AND FOUND NOTHING WRONG. THEY KEPT IT OVERNIGHT TO PREFORM  A FIRMWARE UPDATE. I AM JUST READING THAT THE CAR BATTERY SHUTTING DOWN IS A PROBLEM WITH MANY OTHER OWNERS. I HOPE THE FIRMWARE UPDATE WORKS BUT KNOWING WHAT I KNOW NOW I'M NOT SURE. WISH THE UPDATE WAS DOWN BACK IN JULY. TOYOTA SHOULD RECALL ALL 2020 RAV 4",
        "vin": "2T3P1RFV8LC"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/07/2021",
        "dateOfIncident": "02/06/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395034,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FEBRUARY 6, 2021 IN ATLANTA GA, THE VEHICLE, WHILE IN MOTION AT AROUND 30MPH, DISPLAYED A 'HYBRID SYSTEM MALFUNCTION' WARNING AND BEGAN BEEPING AND TREMBLING. THE WARNING SAID THAT THE CAR MUST BE STOPPED WITHIN 0.9 MILES BUT LASTED FAR LESS THAN THAT, FULLY LOSING ANY EFFECT OF THE ACCELERATOR PEDAL MID-TRAFFIC. THE VEHICLE COASTED INTO A PARKING LOT ON MOMENTUM AND WAS STOPPED WITH A FINAL WARNING THAT BRAKING POWER WAS REDUCED. HAD THIS VERY SITUATION OCCURRED ON AN INTERSTATE, IT EASILY COULD HAVE BEEN FATAL TO MY WIFE, WHO WAS DRIVING AT THE TIME, AND TO OUR UNBORN CHILD. THE VEHICLE IS 9 MONTHS OLD, WAS PURCHASED NEW, AND HAS AROUND 15,000 MILES.",
        "vin": "JTMLWRFV2LD"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/05/2021",
        "dateOfIncident": "02/02/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394880,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ON A CITY STREET, THIS IS A UNSAFE CONDITION ,THE CAR DO NOT HAVE A TOWING EYELET OR HOOK.VEHICLE BECAME STUCK, NO WAY TO BE REMOVE FROM STREET ,ACCIDENT ETC. .ALL RAV4 BEFORE HAVE THIS TOWING EYELET OR HOOK OR METAL RING TO HOOK A CHAIN AND REMOVE THE CAR FROM A DANGER SITUATION.",
        "vin": "2T3F1RFV6LC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/03/2021",
        "dateOfIncident": "01/20/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394455,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TAKING THE VEHICLE THROUGH A CAR WASH THE EDGE OF THE HOOD BY THE WINDSHIELD  BUCKLES, FLEXES AND THEN RETURNS TO IT'S NORMAL SHAPE.  THE HOOD ALSO HAS A RIPPLING APPEARANCE WHILE DRIVING AT SPEEDS AROUND  70 MPH",
        "vin": "213W1RFV8LC"
    },
    {
        "components": "SERVICE BRAKES,LANE DEPARTURE,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "01/30/2021",
        "dateOfIncident": "11/30/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390814,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "A FEW MONTHS AFTER I PURCHASED MY 2020 RAV4 XLE HYBRID, I NOTICED THAT MY BRAKES SQUEAKS WHENEVER I MAKE A QUICK STOP, OR AFTER I RELEASE THE BRAKES AFTER STOPPING OR WHEN I AM BACKING UP. IT DOESN'T MATTER ON THE KIND OF ROAD THAT I AM ON.  I BROUGHT MY CAR TO THE DEALERSHIP AND THEY SAID THAT IT IS  NORMAL FOR A HYBRID TO SQUEAKS DUE TO THE BREAK ACTUATOR.  I KNOW PEOPLE WITH TOYOTA HYBRIDS AND THEY DO NOT HAVE THIS PROBLEM.  I AM CONCERNED BECAUSE THIS COULD BE A DANGEROUS ISSUE.  PLEASE ADVISE.  THANK YOU",
        "vin": "2T3RWRFV9LW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/27/2021",
        "dateOfIncident": "09/02/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390406,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS PARKED AT HOME, DID NOT TURN ON AT ALL.VEHICLE WAS ONLY AT ABOUT 5K TOPS.  CALLED ROADSIDE & WAS GIVEN A JUMPSTART.",
        "vin": "2T3C1RFV3LW"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "01/25/2021",
        "dateOfIncident": "01/23/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389740,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD A NUMBER OF INSTANCES WHERE MY VEHICLE'S LANE KEEP ASSIST WILL RANDOMLY JERK ME OUT OF MY LANE. IN SEPT 2020 I EXPERIENCED A SIGNIFICANT EVENT OF THIS HAPPENING WHEN I WAS DRIVING IN THE RIGHT LANE OF AN INTERSTATE AND THE VEHICLE JERKED RIGHT SUDDENLY, PULLING THE VEHICLE INTO THE RIGHT SHOULDER AND ALMOST DROVE ME OFF THE INTERSTATE. ANOTHER SIGNIFICANT INSTANCE HAPPENED ON 1/23/2021. I WAS DRIVING NORTHBOUND ON I-44 AND I WAS IN THE MIDDLE OF 3 LANES. MY VEHICLE SUDDENLY JERKED THE VEHICLE TO THE LEFT INTO THE LEFT LANE OF TRAFFIC. LUCKILY, THE VEHICLE NEXT TO ME SWERVED ONTO THE SHOULDER THINKING I WAS GOING TO HIT THEM. THERE HAVE BEEN OTHER REGULAR INCIDENTS OF THIS HAPPENING, BUT NOT AS SEVERE AS THESE TWO.*DT*DT  THE CONSUMER STATED WHILE DRIVING ON I-44, THE VEHICLE SUDDENLY JERKED TO THE LEFT TOWARDS TRAFFIC. THE CRUISE CONTROL WAS NOT ACTIVATED. THE CONSUMER STATED THE REPAIR TECHNICIANS WERE ABLE DULICATE THE FAILURE BUT, UNABLE TO REPAIR IT.",
        "vin": "2T3W1RFV6LW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/25/2021",
        "dateOfIncident": "01/25/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389797,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE PARKED FOR LESS THAN 24 HRS. 14 MONTHS OLD, APPROX 12,000MI. BATTERY TOTALLY DRAINED. LEFT STRANDED WITHOUT VEHICLE USE.  INDICATES SMART KEY PROBLEM, TRIED OTHER KEYS. BATTERY IS TOTALLY DRAINED.",
        "vin": "2T3P1RFV5LW"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/24/2021",
        "dateOfIncident": "01/24/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389647,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "1.OCCASIONALLY STEERING ISSUES, CAR WANTING TO VEER LEFT OR RIGHT WHILE DRIVING MAINLY NOTICE ON HIGHWAY.  2. SECOND INCIDENT WHERE BATTERY DEAD AFTER NOT DRIVING CAR FOR THREE DAYS.",
        "vin": "2T3W1RFV2LC"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "01/19/2021",
        "dateOfIncident": "07/06/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388918,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TOYOTA ADAPTIVE CRUISE CONTROL KEEPS A SAFE DISTANCE TO THE VEHICLE IN FRONT, SLOWING AND ACCELERATING PROPERLY TO KEEP A SET DISTANCE EVEN DOWN TO A FULL STOP. HOWEVER, WHEN TRAVELING AT ANY SPEED AND ANOTHER CAR ENTERS MY LANE IMMEDIATELY IN FRONT OF MY VEHICLE THE SYSTEM DOES NOT RECOGNIZE THE NEW VEHICLE AND HOW CLOSE IT IS TO THE FRONT OF MY VEHICLE. IT DOES NOT SLOW AT ALL EVEN IF THE DISTANCE TO THE INTRUDER IS ONLY A CAR LENGTH OR LESS.  I HAVE TO MANUALLY BRAKE  QUICKLY TO PREVENT FOLLOWING TO CLOSE AND CAUSING A POSSIBLE REAR END COLLISION. THIS HAPPENS EVERY TIME A CAR SQUEEZES IN FROM OF ME WITH THE ADAPTIVE CRUSE ON AND IS VERY REPEATABLE. I'VE EXPERIENCED IT IN ANOTHER NEW RAV 4 TOO. THIS HAS BEEN REPEATABLY GOING ON SINCE THE VEHICLE WAS PURCHASED NEW ON JAN, 2020",
        "vin": "JTMDWRFV2LD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/13/2021",
        "dateOfIncident": "12/20/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387892,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA STATES THE RAV4 HYBRID HAS A 14.5 GAL GAS TANK. WHEN GAS GAUGE SHOWED 27 MI LEFT, I WAS ONLY ABLE TO PUT 11.8 GAL IN TANK. DEALER TOLD ME TO JUST ASSUME I HAD MORE GAS LEFT. THIS WAS AFTER THEY HAD REPAIRED THE RECALL ON THE TANK APPROVED BY TOYOTA. NO WAY TO KNOW HOW FAR I COULD GO. THE RECALL DIDN'T WORK",
        "vin": "2T3P1RFV0LC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/11/2021",
        "dateOfIncident": "01/04/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387575,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON INTERSTATE AND HEARD AN EXPLOSION AND SAW GLASS FLYING.  STOPPED AND LOOKED AT TOP OF CAR AND SUNROOF HAD A LARGE PART OF IT MISSING.  THERE WERE NO OVERPASSES NOR DID I SEE ANYTHING THAT WOULD CAUSE IT.  TOYOTA'S STATEMENT WHEN I TOOK IT THERE WAS, \"IT HAPPENS.\"  I DO NOT KNOW HOW IT WOULD HAPPEN.  IT MAKES ME THINK IT WAS A MANUFACTURING ERROR.  IF I DID NOT HAVE THE SUNSHADE CLOSED, I WOULD HAVE BEEN COVERED IN GLASS.",
        "vin": "JTMDWRFV3LD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/09/2021",
        "dateOfIncident": "01/31/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387321,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL-TANK CAPACITY IS LISTED AT 14.5 GALLONS THE TANK WON'T ACCEPT MORE THAN 9 OR 10 GALLONS.",
        "vin": "2T3RWRFV4LW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/26/2020",
        "dateOfIncident": "12/18/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385037,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHIN A WEEK FROM THE DATE OF PURCHASE ,THE VEHICLE DID NOT START , HAD TO BE TOWED BACK TO THE DEALER, DEALER SAYS THE VEHICLE STARTED NORMALLY  THE PROBLEM DID NOT DUPLICATE AT THEIR END. NO FAULT DETECTED. 9 MONTHS LATER WHEN THE VEHICLE HAD A MILEAGE OF 6066 AGAIN IT FAILED TO START, HAD TO BE TOWED BACK TO THE DEALER, DEALER AGAIN STARTED THE VEHICLE NORMALLY NO FAULT WAS DETECTED, LATER WHEN THE VEHICLE HAD THE MILEAGE OF 7079 THE VEHICLE STALLED WHILE IN QUE IN A GAS STATION. FLASHING NOTIFICATION IN THE DASH BOARD INDICATED \"DIRT IN THE ENGINE\" THE VEHICLE WAS TOWED BACK TO THE DEALER FOR THE THIRD TIME IN A YEAR NEXT DAY DEALER SAYS THEY DID NOT FIND ANY ISSUE IN THE VEHICLE. MY CONCERN IS NOT ONCE BUT THRICE THE VEHICLE STOPED WORKING BUT THE THE SERVICE DEPARTMENT JUST COULD NOT DIAGNOSE THE PROBLEM. I AM FRUSTRATED - 3 BREAKDOWNS IN THE 1ST YERAR OF THE PERFORMANCE WITHIN 7100 MILEAGE. I THINK THE MECHANICS OF THIS DEALER\"S  SERVICE DEPARTMENT ARE NOT EXPERIENCED TO DETECT THE PROBLEM IN A NEW VEHICLE. HELP",
        "vin": "2T3P1RFV2LW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/26/2020",
        "dateOfIncident": "12/20/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385044,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE GAS TANK WILL NOT FILL TO CAPACITY.. I AM STOPING AT GAS STATIONS ALL THE TIME BECAUSE I AM FLYING THROUGH GAS ..AND IT'S A HYBRID ..WON'T FILL MORE THAN 9 OR 10 GALS .. THE VEHICLE HAS NO RANGE FOR A HYBRID WHICH IS THE EXACT OPPOSITE OF WHAT THEY SAY WHEN THEY'RE TRYING TO SELL YOU ONE.. HAD I KNOWN I WOULD BE AT A GAS STATION EVERY 3 DAY'S WITH A HYBRID I WOULD HAVE NEVER BOUGHT IT",
        "vin": "2T3DWRFV4LW"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/26/2020",
        "dateOfIncident": "12/26/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385068,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR BATTERY COMPLETELY DRAINED AFTER NOT BEING DRIVEN FOR 24 HOURS LEAVING ME STRANDED.  CAR WOULD NOT START AND HAD TO BE JUMP STARTED.  THERE IS AN ELECTRICAL ISSUE CAUSING QUICK AND SIGNIFICANT BATTERY DRAIN.  CAR WAS PURCHASED IN SEPTEMBER 2020 AND HAS LESS THAN 10,000 MILES.",
        "vin": "2T3P1RFV9LW"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "12/21/2020",
        "dateOfIncident": "12/21/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384422,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TETHER ANCHORS ARE MISSING OR NOT VISIBLE. THE LABELS ARE MISSING AS WELL. I'M TRYING TO USE A CARSEAT FORWARD FACING AND NEED TO USE THE TETHER ANCHORS. COULDN'T UPLOAD THE PICTURES.",
        "vin": "2T3RWRFV7LW"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/20/2020",
        "dateOfIncident": "09/11/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384236,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITIONING STOPPED WORKING TWICE, FIRST TIME REPAIRED AT MY EXPENSE AND NOW IT'S OUT AGAIN LESS THAN 2 MONTHS LATER.  REPAIR WAS 1500.00 FIRST TIME.  SECOND CONTINUES TO RATTLE FROM MIRRORS, FRONT END AND CARRYING RACK.  MY RIGHT FRONT FOG LIGHT OUT AND SERVICE SAID FRONT END WAS VERY LOOSE.",
        "vin": "2T3W1RFV3LW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/17/2020",
        "dateOfIncident": "11/26/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383940,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING IS TOO LOOSE TO CONTROL. I BROUGHT TO DEALER 3 TIMES THEY SAID IT OK EVERY TIMES.  I FEEL ARE NOT SAFE, ESPECIALLY WHEN ON HIGH WAYS. LAST WEEK ALMOST SLICED FROM THE ROAD. WHAT SHOULD I DO?",
        "vin": "2T3LWRFV3LW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/16/2020",
        "dateOfIncident": "11/14/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383807,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY DIED LESS THAN 24 HOURS AFTER LAST USE. PARKED IN ENCLOSED GARAGE.",
        "vin": "JTMG1RFV7LD"
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/13/2020",
        "dateOfIncident": "12/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383246,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY 2020 RAV4 LE  VIN: [XXX] LAST JAN.2020 I NOTICED THE BACK DOOR GLASS HAS A LOT OF CIRCLES COMING FROM EFFECT OF SUCTION GLASS HANDLER THESE CIRCLES BECOME VERY VISIBLE WITH HUMIDITY AND CAUSE DECREASE IN MY VISION TO THE BACK OF MY CAR SPECIALTY AT NIGHT I CAN'T DECIDE HOW FAR IS CAR BEHIND ME AND TOTALLY UNSAFE. WHEN I TRIED TO COMPLAIN TO DEALER THEY ARE SO RUDE AND NOT COOPERATIVE, STORE MANAGER HIS NAME [XXX] SAID YOU CAN COMPLAIN TO TOYOTA NOT US INSISTING ON ITS NOT A DEFECT IN MY CAR . JUST FYI I RECORDED MY COMPLAIN AT DEALER OFFICE 2 TIMES. THEN I CONTACTED TOYOTA AND THEY FILE CASE NUMBER [XXX] ASKING ME TO GIVE THEM TIME TO INVESTIGATE ON 12/11/ 2020 AT 6:20 PM EST  I RECEIVED PHONE CALL FROM CASE MANAGER HER NAME IS [XXX] THE PHONE CALL IS RECORDED SHE SAID  AFTER INVESTIGATIONS ALL RAV4 2020 HAS SAME PROBLEM OF CIRCLES IN HATCHBACK GLASS DOOR AND IT COMES FROM THE WAY HOW THE CAR BUILT AND THIS MAKES THE GLASS CONTAINS A LOT OF CIRCLES I TOLD HER THIS DEFECT IN THE CAR BECAUSE IT DECREASES MY VISION SHE SAID TOYOTA DOES NOT CONSIDER THESE CIRCLES A DEFECT ITS JUST BECAUSE THE WAY THE BUILT THE CAR. PLEASE HELP ME I PAID A LOT OF MONEY TO BUY BRAND NEW CAR THEN SURPRISED WITH THIS PROBLEM AND TOYOTA CONSIDER THIS NOT A PROBLEM    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "2T3H1RFV7LC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/11/2020",
        "dateOfIncident": "04/17/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383042,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I FILL MY GAS TANK, IT DOES NOT SHOW FULL. I BOUGHT THIS SUV 4/17/2020. ALSO, BURNS THROUGH GAS QUICKLY. I SEEM TO GO GET GAS OFTEN AS IT QUICKLY BURNS THROUGH HALF A TANK, THEN STAYS THERE FOR A WHILE THEN QUICKLY DOWN TO 1/4 TANK. I WAS SENT FROM TOYOTA THAT THEY KNEW THIS IS A PROBLEM BUT DON'T KNOW HOW TO FIX. NOW WHEN I CALL THEM, THEY TELL ME THEY KNOW NOTHING ABOUT THIS PROBLEM. YET IN THEIR LETTER SAID DO NOT TOP OFF AND DO NOT WAIT UNTIL THE FUEL LIGHT OR WILL RUN OUT OF GAS.",
        "vin": "JTMRWRFVXLD"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/07/2020",
        "dateOfIncident": "12/04/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378318,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN I-40 IN OKLAHOMA AROUND 70-75 MPH ON 12/4/20 AROUND 1:00 PM CT, OUT OF NOWHERE, THE SUNROOF EXPLODED. MOST OF THE GLASS WENT OUT AND BEHIND THE CAR, BUT SOME GLASS ENDED UP ON DRIVER AND 2 PASSENGERS. THERE WAS NOT ANY OTHER CARS (IN FRONT OR BEHIND) AT THE TIME THIS OCCURRED. SOME GLASS DID NOT COME OFF AND YOU CAN SEE BY MY PICTURES THAT THE GLASS IS CURVED UP, SHOWING THE DIRECTION THE GLASS EXPLODED UPWARDS AND OUT OF THE CAR. THE ROOF OF THE CAR, YOU CAN SEE THE PAINT CHIPS CAUSED BY THE EXPLODING GLASS GOING BACKWARDS, PLEASE SEE INCLUDED PHOTO.  I WAS HEADED TO ARLINGTON TX FOR A WEEKEND TRIP, SO I CALLED A TOYOTA DEALER IN ARLINGTON AND TOLD THEM WHAT HAD HAPPENED.  THEY SAID THEY HAVE NEVER SEEN THIS HAPPEN. THEY CONTACTED THEIR TOYOTA REPRESENTATIVE AND THEY SAID THEY HAVE NOT SEEN AN EXPLODING SUNROOF BEFORE AND THAT IT HAD TO BE A ROCK HITTING THE SUNROOF.  THIS DEALER DID GET A SUNROOF DELIVERED ON THE NEXT DAY AND WAS ABLE TO INSTALL ON SATURDAY 12/5/20.   TOYOTA DID NOT BELIEVE THIS WAS DEFECTIVE SUNROOF, BUT I DO BELIEVE SOMETHING WAS DEFECTIVE, BECAUSE THERE WAS NOT ANY VEHICLE IN FRONT OF ME AT THE TIME THIS HAPPENED AND I DO NOT RECALL A ROCK HITTING THE SUNROOF PRIOR TO THE EVENT.  THIS SEEMS ODD THAT THE SUNROOF WOULD JUST SUDDENLY EXPLODE AND SHATTER UPWARDS AND OUT OF THE CAR.  PLEASE SEE ATTACHED PICTURES.  VANDERGRIFF WAS ABLE TO GET IN A SUNROOF AND REPLACE IT, BUT IT WAS AT MY EXPENSE.  PARTS AND LABOR $1,121.86",
        "vin": "2T3EWRFV5LW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/07/2020",
        "dateOfIncident": "12/07/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378391,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE SAT IN THE GARAGE 3 DAYS AND WHEN I TRIED TO START THERE WAS NO POWER TO THE ENTIRE VEHICLE. I TRIED TO JUMPSTART THE VEHICLE WITHOUT AVAIL. CALL TOYOTA THEY SENT SERVICE VEHICLE THAT JUMPSTART THE VEHICLE AND HAD IT RUN FOR @ 10 MINUTES. SHUT CAR OFF AND IT WOULD NOT RESTART. VEHICLE WAS TOWED TO THE TOYOTA DEALERSHIP. PER THE DEALERSHIP THEY HAD TO REPLACE THE BATTERY. I REFUSE TO BELIEVE THAT WAS THE ISSUE. THE BATTERY IS BEING DRAINED BY SOME OTHER ISSUE. TOYOTA NEED TO RECALL THESE VEHICLES AND FIX THE ISSUE PROPERLY.",
        "vin": "2T3W1RFV1LW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/06/2020",
        "dateOfIncident": "02/09/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378093,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 14.5-GALLON GAS TANK IN MY 2020 TOYOTA RAV4 HYBRID HAS A DEFECT THAT PREVENTS THE TANK FROM BEING FILLED TO CAPACITY.  THIS DEFECT NOT ONLY FAILS TO COMPLY WITH FEDERAL AND STATE GAS TANK REGULATIONS, WHICH PROHIBIT THE SALE OF VEHICLES THAT CANNOT FILL 90 PERCENT OR WITHIN TWO GALLONS OF THEIR NOMINAL GAS TANK CAPACITY, BUT SUFFER FROM A SUBSTANTIALLY REDUCED DRIVING RANGE. THE FUEL TANK DEFECT PREVENTS ME FROM GETTING ANYWHERE NEAR THE VEHICLES' ADVERTISED 550-PLUS-MILE RANGE (I AVERAGE 400-425 GALLONS A TANK), WHICH WAS A MAJOR SELLING POINT AND FOR WHICH I PAID A PREMIUM PRICE FOR; THIS HAPPENS AT EVERY INTERVAL I HAVE TO FILL UP ON GAS.  I FEEL THIS IS A SAFETY HAZARD AS WELL, I MAY RUN OUT OF FUEL WHICH MAY RESULT IN AN ACCIDENT OR LEAVE ME STRANDED ON THE SIDE OF A BUSY OR DESERTED ROAD AND WITH A NY WINTER, IT IS JUST NOT SAFE TO BE STRANDED IN THE COUNTRYSIDE WHEN IT IS FREEZING COLD OUTSIDE.  RUNNING OUT OF FUEL MAY ALSO DAMAGE MY VEHICLES FUEL SYSTEM TOO!  THE OWNER'S MANUAL WARNS THAT IF MY VEHICLE RUNS OUT OF FUEL OR THE FUEL IS TOO LOW, THE HYBRID SYSTEM MAY NOT BE ABLE TO START.",
        "vin": "4T3DWRFV3LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/06/2020",
        "dateOfIncident": "12/05/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378169,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2020RAV4 HYBRID HAS FAILED TO START TWICE (5/5/2020 AND 12/5/2020) AFTER SITTING ONLY 1-2 DAYS IN OUR GARAGE. IT REQUIRED JUMPING TO BE RECHARGED. FROM THE CARGURUS SITE, THIS SEEMS TO BE A COMMON PROBLEM WITH NO DEFINITE SOLUTION YET, PERHAPS A BAD BATCH OF BATTERIES, PERHAPS A SOFRWARE UPDATE NEEDED, OR SOMETHING ELSE? TOYOTA NEEDS TO FIGURE IT OUT AND FIX IT! WE DON'T FEEL LIKE A NEW, EXPENSIVE VEHICLE CAN BE DEPENDED ON.",
        "vin": "2T3DWRFV8LW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/02/2020",
        "dateOfIncident": "07/06/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377489,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL TANK IS RATED AT 14.6 GAL BUT THE MOST I HAVE BEEN ABLE TO GET OUT IS 11 GAL.  THE ISSUE IS CONSISTENT ACROSS EVERY FUELING PERIODS AND AFTER TAKING IT TO THE SERVICE CENTER TWICE, THE ISSUE HAS NOT BEEN FIXED AND THE RESPONSE HAS BEEN THAT THE FUEL TANK HAS NO ISSUES.  I HAVE SHOWN THE PROOFS TO THE SERVICE CENTER AND YET THEY DENY CLAIMS.",
        "vin": "JTMDWRFV1LD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/01/2020",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377400,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY BRAND NEW 2020 RAV4 HYBRID ON 7/1/2020 AND WAS TOLD THE CAR IS IN PERFECT CONDITION WITHOUT ANY ISSUE.  STARTED WITH 2ND TANK OF GAS FILL UP, I NOTICE THE METER READING IS NOT CORRECT.  WHEN I DROVE THE CAR AWAY ON 7/1/2020, THE READING SHOW SOMETHING LIKE \"520 MILES TO EMPTY\".  WITH THE 2ND TANK FILL UP, THE READING CHANGED TO \"480 MILES TO EMPTY\".  WHEN COMES TO THE 4TH TANK FILL UP, THE READ IS NOW SHOWING \"410 MILES TO EMPTY\".  ALSO, BASED ON THE CAR SPECIFICATIONS, THE TANK SIZE IS 14.5 GAL, BUT I CAN ONLY FILL UP AROUND 10 GALLONS OF GAS, THE TANK WOULD BE FULL.   I BROUGHT THE CAR TO THE TOYOTA DEALER WHERE I PURCHASED IT TODAY.  I WAS JUST TOLD THEY NEED TO REPLACE THE FUEL TANK ALONG WITH SOME OTHER PARTS ON THE ALMOST BRAND NEW CAR.  THIS IS NOT RIGHT.   TOYOTA SOLD THE CAR WITH MAJOR ISSUE TO ME AND WITHOUT DISCLOSE THE INFORMATION AT THE TIME OF THE SALE.   THE ISSUE WAS LONG EXIST BEFORE I PURCHASE THE CAR AFTER GOOGLED THE ISSUE ONLINE.   THEY SHOULD HAVE DISCLOSED THE FAULTY ISSUE OF THE CAR AT THE TIME OF THE PURCHASE.",
        "vin": "2T3RWRFVXLW"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/27/2020",
        "dateOfIncident": "11/27/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376512,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR DID NOT START AFTER 2 DAYS OF NOT USING IT.",
        "vin": "2T3F1RFV6LW"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/27/2020",
        "dateOfIncident": "11/26/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376655,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WOULD NOT START AFTER SITTING OVERNIGHT IN MY GARAGE. ONLY HAS 2,200 MILES ON IT. DASHBOARD LIGHTS FLICKERING SAYING PARKING BRAKE MALFUNCTION AND CHECK ENGINE/ OTHER WARNING LIGHTS CAME ON. SEEMS TO BE A HUGE ISSUE FROM OTHER REVIEWS. TOYOTA NEEDS A RECALL OR WE NEED TO FILE A CLASS ACTION LAWSUIT! UNACCEPTABLE. LOOKING INTO CA LEMON LAW.",
        "vin": "2T3W1RFVXLW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/24/2020",
        "dateOfIncident": "11/11/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376101,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WOULD NOT START AFTER SITTING UNUSED FOR A FEW DAYS.  BATTERY IS FINE; CAR COMPLETELY DEAD.",
        "vin": "2T3P1RFV3LW"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/21/2020",
        "dateOfIncident": "01/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375744,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA'S CLAIM OF A 3,500 POUND TOW CAPACITY IS NOT TRUE. I CANNOT TOW A 3,000 POUND HOUSE TRAILER LEGALLY WITH THEIR OEM 4-PRONG WIRING HARNESS. A 7-BLADE PLUG IS REQUIRED TO PASS STATE INSPECTION AND TOYOTA DOES NOT AND WILL NOT PROVIDE THIS HARNESS. FALSE ADVERTISING AND SUCKER PROMOTION IS THE PROBLEM. BAIT AND SWITCH!!! SO SAD. VERY ANGRY!",
        "vin": "2T3J1RFV4LC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/20/2020",
        "dateOfIncident": "11/02/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375593,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY ISN'T HOLDING A CHARGE. TEMPS OUTSIDE ARE GETTING COLDER BUT NOT THAT COLD. DON'T DRIVE IT ON SUNDAYS, BATTERY IS DEAD DEAD ON MONDAY MORNINGS. DRIVE AN AVERAGE OF 30 MILES PER DAY. BATTERY WAS REPLACED BY DEALERSHIP AND STILL SLOW TO START IN THE MORNINGS. NOW RUN IT IDLING FOR 20 MINUTES SUNDAY EVENING TO ENSURE IT STARTS MONDAY MORNING",
        "vin": "JTMF1RFV9LD"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/16/2020",
        "dateOfIncident": "11/16/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374816,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR CAR SAT FOR 2 DAYS WITHOUT BEING USED AND THE BATTERY WAS DEAD. READ ONLINE MANY OTHER RAV4 OWNERS HAVING SIMILIAR ISSUES, SOMETHING IS DRAINING THE BATTERY",
        "vin": "2T3W1RFV4LW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/15/2020",
        "dateOfIncident": "10/16/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374750,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL TANK DOES NOT FILL COMPLETELY AND SHOWS INACCURATE READING ON THE DRIVER CONSOLE",
        "vin": "JTMRWRFV0LJ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/13/2020",
        "dateOfIncident": "08/29/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374583,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE EMPTY LIGHT ON THE GAS TANK OF MY TOYOTA RAV4 HYBRID LE TURNS ON, I AM ONLY ABLE TO FILL THE TANK WITH 10.5 GALLONS.  TOYOTA SPECS STATES THAT THE FUEL TANK SHOULD HAVE A 14.5 GALLON CAPACITY, AND WHEN THE EMPTY LIGHT TURNS ON, THERE SHOULD BE 2.3 GALLONS LEFT OF FUEL IN THE TANK. I HAVE COMMUNICATED THIS TO TOYOTA HEADQUARTERS AND TO ROSEVILLE TOYOTA IN CALIFORNIA, BUT THEY STATE THAT MY VIN NUMBER IS NOT WITHIN THE LIST OF AFFECTED CARS, AND THEY REFUSE TO CHECK ON THE ISSUE TO CONFIRM MY COMPLAINT AND ADD MY VIN TO ANY PROGRAM OR SUPPORT THEY MIGHT HAVE.",
        "vin": "4T3MWRFV1LU"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/12/2020",
        "dateOfIncident": "11/06/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374314,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS APPROX 900 MILES AND HAS BEEN TO THE DEALER 3 TIMES AND JUMP STARTED 3 TIMES.  TOYOTA SVC DEPT IS UNABLE TO REPRODUCE OR IDENTIFY THE PROBLEM, I WAS TOLD I'M NOT DRIVING THE CAR ENOUGH AND THAT THEY CAN'T FIX A PROBLEM WHEN THEY DON'T KNOW WHAT IT IS,  I NEVER KNOW WHEN THE CAR WILL START OR NOT,  VERY FRUSTRATING.",
        "vin": "2T3P1RFV5LC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/06/2020",
        "dateOfIncident": "10/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373461,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GAS TANK IS RATED AT 14.5 GALLONS. I HAVE NOT BEEN ABLE TO GET MORE THAN 10 GALLONS OF GAS AT FILL UP ONCE I HAVE GONE 30 MILES AFTER I HAVE 0 MILES REMAINING TO FILL UP. I CAN NOT GO ANYWHERE NEAR 580 MILES AS TOYOTA HAS STATED. I DO GET AROUND 43 MPG DRIVING IN CITY TRAFFIC ONLY.",
        "vin": "2T3RWRFV8LW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/02/2020",
        "dateOfIncident": "05/02/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372724,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE'S FUEL TANK IS LISTED BY TOYOTA COMPANY AS 14.5 GALLON CAPACITY AND, IN REALITY, THIS TANK'S SHAPE ONLY ALLOWS IT TO FILL TO APPROXIMATELY 9 GALLONS. ADDITIONALLY, THE FUEL GAUGES \"MILES TO EMPTY\" DOES NOT APPEAR TO READ THE AMOUNT CORRECTLY. I HAVE ALMOST RUN OUT OF FUEL ON THE HIGHWAY AS A RESULT OF THE VEHICLE'S IMPROPER READING. THE ACTUAL GAS IN THE TANK WAS MUCH LOWER THAN THE VEHICLE ITSELF TOLD ME. THE RANGE IS ADVERTISED BY THE MANUFACTURER AT APPROXIMATELY 500 MILES WHEN IN REALITY IT APPEARS TO BE UNDER 300 MILES DEPENDING ON DRIVING CONDITIONS.",
        "vin": "2T3DWRFV3LW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/02/2020",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372771,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "REFUELING ALLOWS ONLY AROUND 10 GAL. BEFORE THE PUMP AUTOMATICALLY SHUTS OFF. THIS CAUSES SIGNIFICANT (100+ MILES) REDUCTION IN POSSIBLE MILEAGE COMPARED TO REPORTED DTE FROM TOYOTA, AND DOES NOT MATCH THE 14.5 GAL. FUEL CAPACITY REPORTED.",
        "vin": "JTMRWRFV9LJ"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/29/2020",
        "dateOfIncident": "08/04/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11367034,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "NEW 2020 RAV4 HYBRID MAKES LOUD GRINDING NOISE SOMETIMES WHEN PLACED IN REVERSE AND EV MODE IS ENGAGED.  APPEARS TO BE FAILURE OF SPRAG-TYPE DEVICE TO DISENGAGE ENGINE OR TRANSMISSION FROM ELECTRIC DRIVE SYSTEM.  MULTIPLE MEMBERS OF FRANK TOYOTA SERVICE DECLARED IT TO BE NORMAL AND REFUSED TO MAKE ANY WRITTEN ENTRIES EVIDENCING THE COMPLAINT.  THEY CLAIMED I WAS MISTAKEN WHEN I POINTED OUT THAT IT DID NOT BEGIN UNTIL THE VEHICLE HAD APPROXIMATELY 600 MILES ON IT.",
        "vin": "JTMDWRFV1LD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/29/2020",
        "dateOfIncident": "10/23/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372321,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "REFUELING FROM EMPTY ALLOWS ONLY AROUND 10 GAL. BEFORE THE PUMP AUTOMATICALLY SHUTS OFF. THIS CAUSES SIGNIFICANT (100+ MILES) REDUCTION IN POSSIBLE MILEAGE COMPARED TO REPORTED DTE FROM TOYOTA, AND DOES NOT MATCH THE 14.5 GAL. FUEL CAPACITY REPORTED.",
        "vin": "2T3EWRFV6LW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/28/2020",
        "dateOfIncident": "10/02/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366898,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST BOUGHT A TOYOTA RAV4 2020 HYBRID LIMITED LAST AUGUST 8, 2020.  I BOUGHT IT AT BEAVER TOYOTA LOCATED IN ST. AUGUSTINE, FLORIDA.   2.  PROBLEM: I FOUND OUT THAT THERE IS NO HOOK OR HOLE ATTACHED TO THE SOLID FRAME OF THE CAR THAT THE TOWING CABLE CAN BE ATTACHED TO IN CASE I GET STUCK IN A MUD, SAND, OR SNOW BANK.  I WOULD NOT BE ABLE TO TOW OR PULL SOMETHING OUT BECAUSE THERE IS NO HOOK OR HOLE TO ATTACH THE CABLE TO.  3.  EXPECTATION:  THIS IS THE FIRST CAR THAT THIS FEATURE IS ABSENT.  ALL OF THEM HAD THE CONVENIENT HOLE ATTACHED TO THE FRAME THAT THE CABLE CAN BE HOOKED INTO.  I EXPECT TOYOTA TO CORRECT THIS DEFICIENCY.  I BELIEVE IT IS A DEFECT THAT IS EASILY CORRECTED.  I CONTACTED TOYOTA CUSTOMER SERVICE TWICE AND ASK THE PERSON TO TAKE A PICTURE (IN CASE I MISSED IT) UNDERNEATH THE RAV4 2020 HYBRID AS TO WHERE THE CABLE HOOK SHOULD GO INTO.   I WAS GIVEN A NUMBER - TOYOTA MOTOR SALES, USA, INC. CASE FILE #2010151369.  THEY SAID THAT THEY CAN NOT TAKE A PICTURE, THEY REFERRED ME TO THE MANUAL.  THE MANUAL DOES NOT SHOW CLEARLY WHERE TO PLACE IT.   I TALKED WITH MANAGER OF BEAVER TOYOTA AND HE SAID THAT HE COULD SHOW ME WHERE TO PUT THE CABLE WHEN I GO THERE.  I ALREADY INSPECTED THE UNDERNEATH AND THERE IS NO CONVENIENT/SAFE/STURDY PLACE TO ATTACH IT.  4.  RECOMMENDATION:  TOYOTA SHOULD ADD THE HOOK OR HOLE ATTACHMENT FOR THE TOWING CABLE.  IT SHOULD BE WHERE THE HITCH WOULD BE ATTACHED TO.  DID TOYOTA MISS ATTACHING THIS FEATURE AT THE FACTORY ?   5. THIS IS BEYOND WHAT THE DEALERSHIP COULD CORRECT.  IT IS MORE IN THE MANUFACTURING PROCESS.  6. I AM SENDING THIS COMPLAINT TO THE NHTSA BECAUSE THERE IS THE POSSIBILITY THAT SIMILAR 2020 RAV 4 HYBRID LIMITED ARE AFFECTED WITH THIS PROBLEM.  THIS IS WHAT I WOULD CONSIDER A PRODUCT DEFICIENCY AS MENTIONED IN ONE OF THE CRITERIA.    STATIONARY",
        "vin": "2T3DWRFV7LW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/28/2020",
        "dateOfIncident": "10/28/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366943,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "CAN NOT FILL FUEL TANK TO FULL. ONLY ABOUT 11 GALLONS WHEN IT SHOULD BE AT 14.5. CAN NOT GET MILEAGE TOLD IT SHOULD GET",
        "vin": "2T3DWRFV5LW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/27/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366606,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS TANK WILL NOT FILL WITHIN TWO GALLONS OF CAPACITY AND GAS GAUGE DOES NOT ACCURATELY REFLECT FUEL REMAINING.",
        "vin": "JTMDWRFV7LD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/27/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366629,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL GAUGE DOES NOT CORRECTLY SHOW VOLUME IN THE GAS TANK. WHEN GAUGE READS EMPTY AND LIGHT COMES ON ONLY 9-10 GALLONS OF FUEL WILL COMPLETELY FILL THE TANK. SUPPOSEDLY CAPACITY IS 14.5 GALLONS.",
        "vin": "4T3D6RFV4LU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/27/2020",
        "dateOfIncident": "07/31/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366698,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE VEHICLE REACHES A SPEED OF 60MPH A GRINDING NOISE COMES FROM THE AREA BETWEEN THE GAS PEDAL AND DRIVER SIDE DOOR. THE NOISE SOUNDS LIKE A RAPIDLY SPINNING METAL DISC IS FREQUENTLY BUMPING INTO A METAL WALL AS THE CAR VIBRATES NATURALLY AT THE HIGHER SPEED. IT IS UNKNOWN IF THIS CAUSES A SAFETY ISSUE OR NOT BUT IT DOES BOTHER ALL PASSENGERS AS IT IS A HIGH PITCHED GRINDING NOISE.",
        "vin": "JTME6RFV2LJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/25/2020",
        "dateOfIncident": "09/25/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366271,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "APPLE CAR PLAY ISN'T WORKING CORRECTLY, MALFUNCTIONING FREQUENTLY.  IT DISCONNECTS OR STOPS WORKING RANDOMLY, CREATING A DISTRACTION WHILE DRIVING.  EITHER ITUNES STOPS PLAYING OR NAVIGATION DISCONNECTS WHICH CAUSES A DRIVER TO START FIDDLING WITH THE APPLE CAR PLAY ON THE DISPLAY SCREEN AND TAMPERING WITH THE MOBILE DEVICE OR THE WIRING BETWEEN THE MOBILE DEVICE AND THE USB PORT.  THIS APPEARS TO BE A SOFTWARE PROBLEM.  THROUGH DOING RESEARCH ONLINE (RAV4WORLD AND OTHER SITES), I HAVE NOTICED MULTIPLE SIMILAR COMPLAINTS FROM OTHERS WITH THIS SAME 2020 XSE HYBRID MODEL OF THE RAV4.  THE ONLY WAY TO CORRECT THE ISSUE IS TO PULL OVER, TURN THE CAR OFF AND RESTART THE CAR, BUT THE ISSUE HAPPENS TIME AND TIME AGAIN. THE MALFUNCTION OF THIS HANDS-FREE FEATURE IS GOING TO LEAD TO DISTRACTED DRIVING AS DRIVERS ATTEMPT TO REMEDY THE PROBLEM AND WILL LEAD TO PEOPLE GETTING KILLED DUE TO THE MANUFACTURING DEFECT.  PLEASE ISSUE A RECALL IMMEDIATELY.",
        "vin": "4T3EWRFV3LU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/24/2020",
        "dateOfIncident": "10/23/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366142,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "SO I KNEW BEFORE BUYING THIS CAR THAT IT HAD A DEFECTIVE FUEL TANK DESIGN. THE SHAPE OF THE TANK DOESN'T ALLOW FOR THE FUEL VAPOR TO CIRCULATE PROPERLY WHICH IN TURN MAKES THE FUEL WAND THINK THE THE TANK IS FULL WHEN IT REALLY ISN'T EVEN CLOSE. THAT BEING SAID, I TOLD MYSELF IF I NOTICED THIS DEFECT, THAT I WOULD SUBMIT THIS REPORT BECAUSE IT'S THE ONLY WAY TOYOTA IS GOING TO FIX IT FOR LATER CUSTOMERS. THIS ISN'T A SAFETY ISSUE SO I FULLY EXPECT TO NEVER SEE A RECALL OUT OF THIS AND ALL OF US ARE JUST GOING TO HAVE TO DEAL WITH IT.    THE FIRST SIGN THAT I RECEIVED A DEFECTIVE FUEL TANK WAS WHEN MY FIRST TANK OF GAS ONLY GOT ME 400 MILES. THIS VEHICLE, IF FILLED COMPLETELY SHOULD GET YOU AT LEAST 500 TO 530 MILES ON MIXED DRIVING. SO I PULLED INTO THE STATION AND SURE ENOUGH, THE FUEL HANDLE STOPPED AT 12 GALLONS. THAT'S WITH ABOUT A GALLON IN THE TANK ALREADY SO REALLY ABOUT 11. I THEN PROCEEDED TO FILL THE TANK THE REST OF THE WAY AT ABOUT 1/4 GALLON INCREMENTS AND AFTER 10 MINUTES, I FINALLY GOT IT TO 14.5. NOT TOPPED OFF AT ALL, JUST TO THE TOP OF THE TANK + OR - A QUARTER GALLON.    SO AGAIN, MY REASON FOR POSTING THIS IS NOT THAT I'M MAD OR SURPRISED THIS HAPPENED, IT'S JUST SIMPLY TO DO MY PART IN TRYING TO GET TOYOTA TO DO RIGHT BY THEIR CUSTOMERS AND FIX THIS ISSUE. THIS PROBLEM CONTINUES TO PUTS A SMALL BUT STILL ANNOYING BLACK MARK ON AN OTHERWISE AMAZING VEHICLE.",
        "vin": "4T3R6RFV6LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/23/2020",
        "dateOfIncident": "10/23/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365970,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR BATTERY DISCHARGES RANDOMLY.",
        "vin": "2T3EWRFV2LW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/22/2020",
        "dateOfIncident": "10/19/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365669,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FUEL TANK ONLY FILLS TO 10-11 GALLONS. IT IS A 14 GALLON TANK.",
        "vin": "4T3E6RFV2LU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/20/2020",
        "dateOfIncident": "10/18/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365289,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN HAVING AN ISSUE WITH THE GAS TANK OF MY 2020 TOYOTA RAV4 HYBRID LE. THE TANK CAN NEVER BE FILLED TO IT'S FULL CAPACITY OF 14.5 GALLONS. I CAN ONLY ADD 9 OR SOMETIMES 10 GALLONS AND THE GAS TANK GAUGE SHOWS ONLY 3/4 OF THE TANK FILLED AFFECTING THE MPG AND THE RANGE OF THE VEHICLE.",
        "vin": "JTMLWRFV1LD"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/17/2020",
        "dateOfIncident": "10/17/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364861,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "SMART KEY MALFUNCTION-- 2020 RAV4, PURCHASED MAY OF 2020.     FIRST INCIDENT: OCCURRED AFTER VEHICLE SITTING IN A PARKING GARAGE AT AN AIRPORT FOR 4 DAYS. CAME BACK AND VEHICLE WOULDN'T START AND LIGHTS ON DISPLAY PANEL WERE FLICKERING. DOOR LOCKS WERE MALFUNCTIONING, AND UPON JUMP STARTING EVERYTHING WAS OK. TOOK TO DEALERSHIP AND WAS TOLD BATTERY WAS BAD, THEY REPLACED BATTERY.    SECOND INCIDENT: OCCURRED AFTER CAR PARKED FOR 11 HOURS. VEHICLE WOULDN'T START AND LIGHTS ON DISPLAY PANEL WERE FLICKERING AGAIN. DOOR LOCKS WERE MALFUNCTIONING AGAIN AS WELL..     HAVE ALSO SEEN THAT HUNDREDS OF OTHER PEOPLE ARE EXPERIENCING THIS SAME ISSUE.. BASED OFF OF A GOOGLE SEARCH AND RESEARCH, I AM NOT THE ONLY ONE.     ELECTRICAL ISSUE OR SOME SOFTWARE MALFUNCTION IS CAUSING THE VEHICLE TO DRAIN ITS OWN BATTERY AT RANDOM TIME INTERVALS.",
        "vin": "JTMY1RFV4LD"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/16/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364655,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL INDICATOR SHOWS HALF ONLY. THE TANK DOES NOT REGISTER THE CORRECT AMOUNT OF FUEL. THE COMPANY ITSELF NEVER CONTACTED US RE THIS DEFECT. WE TURNED THE CAR IN TODAY AS WE DIDN'T FEEL SAFE DRIVING A CAR WITHOUT AN  ACCURATE FUEL GAUGE READING",
        "vin": "JTMDWRFV0LD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/15/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364539,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL GAUGE/FUEL TANK PROBLEM.  TANK HOLDS 14.5 GALLONS, BUT AUTOMATIC SHUT-OFF ALLOWS ONLY 10 GALLONS.  FUEL GAUGE THEN SHOWS \"FULL.\"  DISPLAYS AND FUEL-LOW WARNINGS COME ON AFTER ABOUT 400 MILES, WITH FUEL GAUGE SHOWING \"EMPTY.\"",
        "vin": "2T3DWRFV7LW"
    },
    {
        "components": "POWER TRAIN,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/15/2020",
        "dateOfIncident": "09/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364593,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE IS HESITATING, JERKING WHEN COMING TO A SLOW STOP AND WHEN GIVING IT GAS.  WHEN PUTTING GAS IN THE CAR THE PUMP AUTOMATICALLY SHUT OFF. WHEN I TURNED THE CAR BACK ON IT SHOWED THAT THE TANK WAS ONLY 3/4 FULL. I PUT MORE GAS AGAIN AND THE GAS TANK OVERFLOWED.",
        "vin": "2T3H1RFV8LW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/13/2020",
        "dateOfIncident": "09/10/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364225,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GAS TANK IS NOT ABLE TO BE FILLED. ONLY 9 GALLONS CAN BE ENTERED. THE DRIVE RANGE IS ONLY 400 MIKES VS THE 540 OF THE TANK COULD BE COMPLETELY FILLED",
        "vin": "JTMDWRFV9LF"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/11/2020",
        "dateOfIncident": "07/07/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363821,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2020 TOYOTA RAV4 HYBRID IS SUPPOSED TO GET 4.5 GALLONS OF FUEL, BUT I AM ONLY ABLE TO FILL UP TO 9 GALLONS FROM EMPTY. WHEN GETTING FUEL, I TOP OFF AND AM STILL ONLY AVERAGING 9 GALLONS PER FILL UP. THIS IS A KNOWN ISSUE WITH TOYOTA, BUT NO FIX.",
        "vin": "2T3RWRFV7LW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/10/2020",
        "dateOfIncident": "10/08/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363748,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT A 2020 TOYOTA RAV4 IN EARLY SEPTEMBER,BUT AFTER 1 MONTH IT BEGAN SHOWING, \"BATTERY IS CHARGING\" FREQUENTLY. I TOOK THE CAR TO THE DEALERSHIP TO SEE WHAT COULD BE WRONG. THEY STATED THAT IT IS NORMAL. IT NORMALLY HAPPENS WHEN YOU APPLY THE BRAKES AND THE MESSAGE WILL BE SHOWN ON THE DASHBOARD, \"BATTERY IS CHARGING\".  I PLAN IN TAKING THE CAR AGAIN TO THE  DEALERSHIP TO GET THIS RESOLVED, SINCE I KNOW FOR A FACT IT IS THE BATTERY THAT IT'S MALFUNCTIONING.",
        "vin": "JTMW1RFV4LD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/08/2020",
        "dateOfIncident": "10/05/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363471,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 RAV4 HYBRID VEHICLE IS RATED FOR AND ADVERTISED AS HAVING AN APPROXIMATELY 580 MILE FUEL RANGE.  PURCHASED NEW, AND DROVE OFF THE LOT WITH A FULL TANK AND 7 MILES ON THE ODOMETER, THE EMPTY FUEL TANK LIGHT CAME ON AT JUST LESS THAN 370 MILES OF NORMAL HIGHWAY AND CITY DRIVING.  WENT TO \"FILL UP\" THE VEHICLE AND IT TOPPED OFF AT ONLY 11 GALLONS.  THE TANK CAPACITY IS ADVERTISED AS 14.5 GALLONS.  MY ASSUMPTION IS THAT EITHER THE FUEL GAUGE IS DEFECTIVE, OR THE FUEL TANK IS SMALLER THAN ADVERTISED.  EITHER WAY, THIS MAKES THE ACTUAL FUEL RANGE OVER 200 MILES LESS THAN ADVERTISED.  I WAS TOLD AT THE DEALERSHIP THAT THE \"RESERVE FUEL\" AMOUNT IS 3.5 GALLONS, HOWEVER, TOYOTA USA HAS TOLD ME THE RESERVE AMOUNT IS 2.2 GALLONS.  THIS IS A SAFETY ISSUE - IIN ORDER TO GET THE FUEL RANGE I NEED, I HAVE TO DRIVE IT NEARLY 200 MILES PAST THE LOW-FUEL INDICATOR, WHICH PUTS ME AT INCREASED RISK OF RUNNING OUT OF FUEL ON THE INTERSTATE.  ADDITIONALLY IT'S NOT CLEAR WHAT WILL HAPPEN IF/WHEN THE FUEL TANK IS DEPLETED.  TOYOTA HAS CHOSEN NOT TO INFORM BUYERS OF THIS FUEL GAUGE DEFECT PRIOR TO PURCHASE, AND INSTEAD ACTIVELY ADVERTISES THE LONG FUEL RANGE - THIS FITS THE DEFINITION OF FRAUD, AND IS COMPLETELY UNVERIFIABLE UNTIL YOU PURCHASE AND DRIVE THE VEHICLE HUNDREDS OF MILES.  HAD I KNOWN, I PROBABLY WOULD NOT HAVE PURCHASED THIS VEHICLE, BECAUSE OF THIS FUEL RANGE SAFETY ISSUE, AND NOT KNOWING HOW MUCH FUEL IS LEFT IN THE VEHICLE.",
        "vin": "4T3R6RFV9LU"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/07/2020",
        "dateOfIncident": "10/06/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363257,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER COMING TO A COMPLETE STOP, WHEN I FOOT OFF THE BRAKE FOR ACCELERATION THE VEHICLE JERKS EVERY TIME.",
        "vin": "2T3A1RFV6LW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/30/2020",
        "dateOfIncident": "08/21/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362039,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 TOYOTA RAV4. THE CONTACT STATED WHILE THE VEHICLE WAS AT THE CAR WASH, THE BRAKE WARNING LIGHTS ILLUMINATED. THE CONTACT DROVE THE VEHICLE HOME. A MONTH LATER AFTER THE VEHICLE FAILED TO START-UP, AND THE VEHICLE WAS TOWED TO MODERN TOYOTA OF BOONE (225 MODERN DRIVE, BOONE NC, 28607, (828) 263-5437) TO BE DIAGNOSED. THE MECHANIC STATED THAT THE FAILURE WAS DUE TO LOW BATTERY VOLTAGE. THE BATTERY WAS RECHARGED AND THE FAILURE WAS FIXED. THE MANUFACTURER WAS NOT CONTACTED OR NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 3,023.",
        "vin": "JTMG1RFV9LD"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/23/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360659,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 TOYOTA RAV4. THE CONTACT STATED THAT WHILE INSIDE OR OUTSIDE THE VEHICLE, THERE WAS AN ABNORMAL ODOR. THE CONTACT LOOKED UNDER THE HOOD AND NOTICED THAT THE COOLANT TANK WAS LOW. THERE WAS NO WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO WILLIAMS SCION OF ELMIRA (951 COUNTY ROAD 64, ELMIRA, NY 14903) WHERE THE VEHICLE WAS DIAGNOSED HOWEVER, THE MECHANIC FAILED TO RETRIEVE A FAULT CODE. THE MECHANIC FOUND NO VISIBLE LEAKS. THE VEHICLE WAS NOT REPAIRED. THE FAILURE RECURRED. THE CONTACT REFERENCED NHTSA CAMPAIGN NUMBER: 20V046000 (ENGINE AND ENGINE COOLING) AS A POSSIBLE SOLUTION TO THE FAILURE HOWEVER, THE VIN WAS NOT INCLUDED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 6,800.",
        "vin": "2T3A1RFV5LW"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/18/2020",
        "dateOfIncident": "09/16/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11359832,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A SPECIFIC CONCERN FOR THE BATTERY/ELECTRIC SYSTEM THAT APPEARS TO BE VERY PREVALENT..  IN THE 3 MONTHS SINCE BUYING MY 2020 TOYOTA RAV4 LIMITED HYBRID (JUNE 20, 2020)-I'VE HAD TO HAVE MY CAR JUMPED TWICE DUE TO A DEAD BATTERY.  AT FIRST, I THOUGHT THERE MIGHT BE SOMETHING I WAS NOT DOING CORRECTLY.  HOWEVER, AFTER READING THE COMMENTS ON SEVERAL SITES IT APPEARS THAT THIS IS A VERY COMMON ISSUE.  THE CAR HAD BEEN DRIVEN THE DAY BEFORE EACH TIME AND WOULD NOT START THE NEXT MORNING.  THE SERVICE PERSON WHO CAME OUT TO JUMP IT THE SECOND TIME SAID THAT HE GETS A LOT OF CALLS FOR THESE NEW CARS.  THE SECOND TIME IT ALSO LOST MY PARKING ASSIST ON THE BACKUP CAMERA ALONG WITH THE LAST RADIO SETTING.  UNFORTUNATELY- TAKING IT TO THE DEALER HAS NOT WORKED FOR MOST OF THE OWNERS.  THE DEALER CAN FIND NOTHING WRONG OR EVEN LOCATE THE ISSUE.  WHAT HAS TOYOTA DONE TO DETERMINE WHY THIS IS HAPPENING?  IS IT SOFTWARE, BATTERY, ELECTRICAL OR A COMBINATION OF THESE?      REFERENCES:  HTTPS://WWW.MOTORBISCUIT.COM/ARE-2019-AND-2020-TOYOTA-RAV4-HYBRIDS-SUFFERING-BATTERY-ISSUES/  HTTPS://WWW.CARGURUS.COM/CARS/DISCUSSION-C29023_DS1091695  HTTPS://WWW.RAV4WORLD.COM/THREADS/2020-HYBRID-STARTING-ISSUE-DUE-TO-BATTERY-DRAIN.303771/  HTTPS://WWW.KBB.COM/TOYOTA/RAV4/2020/CONSUMER-REVIEWS/  HTTPS://WWW.REDDIT.COM/R/RAV4CLUB/COMMENTS/FUCB6M/2020_RAV4_BATTERY_DEAD/  PLUS MORE --- JUST GOOGLE '2020 RAV4 HYBRID BATTERY PROBLEMS'",
        "vin": "2T3DWRFV7LW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/18/2020",
        "dateOfIncident": "09/18/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11359905,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "DARK SMOKED BORDER WINDOW VENT PROTECTOR IS UNSTICK. .SO THE  PASSENGER DARK SMOKED WINDOW VENT PROTECTOR IS BROKEN.THE GLUE IS NOT WORKING WELL.",
        "vin": "2T3K1RFV9LC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/07/2020",
        "dateOfIncident": "06/30/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353485,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL CAPACITY FOR THE VEHICLE IS SUPPOSE TO BE `14.5 GALLONS, HOWEVER THE VEHICLE ONLY FILLS UP TO 10 GALLONS WHEN EMPTY .",
        "vin": "4T3RWRFV8LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/01/2020",
        "dateOfIncident": "07/11/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352652,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2020 RAV4 XLE WITH ABOUT 3,000 MILEAGE. THE CAR BATTERY HAS DIED  TWICE. THE FIRST TIME IT HAPPENED, I JUMP STARTED THE CAR. THE SECOND TIME, I  TOOK THE CAR TO THE DEALER BUT THEY SAID THERE WAS NOTHING WRONG WITH THE CAR.  I DON'T UNDERSTAND WHY A NEW CAR WOULD BE HAVING THESE BATTERY PROBLEMS.  HAS ANYONE HAD ANY SIMILAR PROBLEMS AND HAVE SUGGESTIONS ON HOW TO  RESOLVE THE ISSUE?",
        "vin": "2T3W1RFV2LC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/31/2020",
        "dateOfIncident": "08/30/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352201,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE VIEW MIRRORS ON DRIVER SIDE AND PASSENGER SIDE VIBRATE WHEN TRAVELING AT ANY SPEED AND VIBRATE/SHAKE EXCESSIVELY TRAVELING AT HIGHWAY SPEEDS GREATER THAN 50MPH.  THIS REDUCES VISIBILITY AND CAUSES NAUSEA.",
        "vin": "JTMP1RFV8LD"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/28/2020",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351775,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 TOYOTA RAV4. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V286000 (SUSPENSION) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE LOCAL DEALER STAPP TOYOTA LOCATED AT 8019 RASPBERRY WAY, FREDERICK, CO 80504, WAS CONTACTED AND IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "JTMN1RFV1LD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/24/2020",
        "dateOfIncident": "08/21/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351054,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A 2020 TOYOTA RAV4 HYBRID FOR FUEL EFFICIENCY. I'VE HAD IT NEARLY 6 MONTHS AND HAVE NOT BEEN ABLE TO REALIZE ANY FUEL EFFICIENCY DUE TO A FAULTY FUEL TANK. MY GAS GAUGE WAS AT 1/4 TANK AND I REFUELED.  THE PUMP STOPPED AFTER REACHING 'FULL'. WHEN I RESTARTED THE VEHICLE AFTER 'FILLING UP', THE GAUGE WENT TO 3/4 TANK INSTEAD OF FULL.    AT ANY GIVEN TIME, I DO NOT KNOW HOW MUCH FUEL IS IN THE TANK, THEREFORE, I CANNOT TELL IF THE VEHICLE IS EVEN FUEL EFFICIENT.     MY PREVIOUS CAR WAS A 2003 TOYOTA RAV4 NON-HYBRID AND I'D REFUEL EVERY 2 WEEKS AND IT HAS THE SAME SIZE FUEL TANK THAT THE 2020 TOYOTA RAV4 HYBRID SUPPOSEDLY HAS (14.5 GALLONS). IT FEELS LIKE THE FUEL TANK IS HALF THAT SIZE.     I'M HAVING TO REFUEL MY 2020 TOYOTA RAV4 HYBRID WEEKLY TO KEEP FROM LEAVING ME STRANDED BECAUSE THE GAS GAUGE IS READING INCORRECTLY.     TOYOTA NEEDS TO CORRECT THIS ISSUE ASAP.",
        "vin": "2T3RWRFVXLW"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/23/2020",
        "dateOfIncident": "08/23/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350829,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY \"DIED\" THE BEGINNING OF AUGUST - JUMP STARTED AND DROVE TO THE DEALERSHIP SERVICE CENTER. I WAS TOLD THAT THE BATTERY WAS FINE AND THAT \"SHORT DISTANCE\" DRIVING CAN DRAIN THE BATTERY - SINCE I DRIVE 45 MILES A DAY TO AND FROM WORK, THAT IS NOT A VALID \"EXCUSE\". NOW, 3 WEEKS LATER, MY CAR WAS PARKED ON A FLAT SURFACE FOR 36 HOURS WITH NOTHING LEFT ON - AND THE CAR IS COMPLETELY DEAD. TESTED THE BATTERY MYSELF BEFORE JUMPSTARTING IT - AND IT FULL. ABSOLUTELY NO REASON WHY MY CAR SHOULD NOT START.",
        "vin": "2T3W1RFV1LW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/17/2020",
        "dateOfIncident": "08/08/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349968,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR BATTERY DIED AFTER ONE DAY OF SITTING WITHOUT USE. DEALER DID NOT FIND ANY PROBLEMS. BUT IT HAS LESS THAN 10,000 MILES. TOYOTA DEALER OFFERED NO SOLUTION AND MANY OTHERS HAVE THIS PROBLEM.",
        "vin": "2T3RWRFV9LW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/17/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349970,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR DOES NOT FILL UP WITH FUEL TO MANUFACTURER SPECIFICATIONS.  CANNOT GET MORE THAN 10 GALLONS INTO 14.5 GALLON TANK. SERIOUS SAFETY ISSUE.",
        "vin": "2T3RWRFV9LW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/12/2020",
        "dateOfIncident": "07/31/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348928,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR BATTERY DIED AFTER OWNING THE VEHICLE FOR 5 MONTHS, LESS THAN 3,000 MILES. WHILE DRIVING, I WOULD GET A MESSAGE THAT READ, \"BATTERY CHARGING.\" DEALERSHIP REPLACED BATTERY AND 1 WEEK LATER, THE NEW BATTERY DIED. AFTER DOING A PARASITIC DRAIN TEST, THE PROBLEM WAS SOURCED TO THE DATA CONTROL MODULE. THE DEALERSHIP UPLOADED NEW SOFTWARE AND SO FAR I'VE HAD NO FURTHER ISSUES.",
        "vin": "2T3A1RFV9LC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/11/2020",
        "dateOfIncident": "06/21/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348596,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL TANK IS ADVERTISED AS 14.5 GALLONS /580 MILES PER TANK. BRAND NEW VEHICLE OFF THE LOT ONLY FILLS UP TO 8 GALLONS AND GETS 420MILES PER TANK",
        "vin": "2T3RWRFV8LW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/05/2020",
        "dateOfIncident": "08/05/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343428,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAD NO BATTERY POWER TO START THE VEHICLE AFTER SITTING IN THE DRIVEWAY FOR 36 HOURS FROM WHEN LAST DRIVEN. THIS PROBLEM POSSES A SIGNIFICANT HAZARD AS THE VEHICLE WAS TOTALLY DISABLED.",
        "vin": "2T3DWRFV6LW"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/05/2020",
        "dateOfIncident": "02/16/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343488,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "SERIOUS D-CELL BATTERY DISCHARGE ISSUE. TWICE OUR NEW RAV4 HYBRID HAS HAD TO BE JUMPED AND TAKEN TO DEALER FOR A DEAD BATTERY. DEALER FOUND NOTHING FIXABLE BUT REPLACED THE BATTERY. 1ST TIME WE WERE STRANDED IN HOTEL PARKING LOT AFTER TRIP ABROAD. 2ND TIME WAS AT HOME. CARGURUS SENDS ME 5 COMPLAINTS A DAY FOR OTHERS WITH THE SAME ISSUE.  VEHICLE IS NOT RELIABLE.",
        "vin": "2T3MWRFV4LW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/05/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343554,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER STEERING FAILED SUDDENLY. THE CAR WAS DRIVEN FOR TWO HOURS (FROM NYC TO PHILADELPHIA) THEN PARALLEL PARKED ON A CITY STREET AND TURNED OFF. THE CAR WAS RESTARTED LESS THAN ONE MINUTE AFTER BEING TURNED OFF (TO IMPROVE THE PARKING JOB); THE CAR STARTED, AND WAS ABLE TO DRIVE IN A STRAIGHT LINE FORWARDS AND BACKWARDS, BUT THE WHEELS COULD NOT BE TURNED WITHOUT SIGNIFICANT FORCE. THE REPAIR SHOP WAS UNABLE TO FIND ANYTHING WRONG WITH THE CAR OTHER THAN A PARTIALLY DRAINED BATTERY.",
        "vin": "2T3MWRFV8LW"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/02/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342753,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 TOYOTA RAV4  HYBRID PURCHASED DEC 2019  BATTERY DIES AFTER CAR HAS BEEN SITTING A FEW DAYS  CAR DOES NOT START  HAVE TO TOW TO DEALER",
        "vin": "2T3RWRFVXLW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/02/2020",
        "dateOfIncident": "08/02/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342854,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO DAYS OF NOT DRIVING AND NO POWER TO CAR BROUGHT TO DEALERSHIP THEY SAID I WAS DREAMING OF THINGS AND BOUGHT IT HOME THEN TWO DAYS LATER IT HAPPEN AGAIN",
        "vin": "2T3P1RFV8LC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/31/2020",
        "dateOfIncident": "05/22/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342629,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN USING CRUISE CONTROL ON THE FREEWAY. IF THE CAR IN FRONT OF ME GOES TO EXIT AND SLOWS DOWN. MY CAR BRAKES EVEN THOUGH I AM NOT EXITING. I HAVE ALMOST BEEN HIT BY TWO SEMIS ON TWO DIFFERENT OCCASIONS BECAUSE OF THIS. I HAVE ALSO ALMOST BEEN HIT BY A COUPLE OF CARS AS MY CAR UNEXPECTEDLY BRAKED ON REGULAR ROADS WHEN THE CAR IN FRONT OF ME PULLED INTO A RIGHT HAND TURN LANE AND SLOWED DOWN NEXT TO ME.",
        "vin": "4T3EWRFV6LU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/30/2020",
        "dateOfIncident": "07/28/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342327,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 TOYOTA RAV4. THE CONTACT STATED THAT AFTER ENTERING THE VEHICLE, IT WAS DISCOVERED THAT THERE WAS NO ELECTRICAL POWER INSIDE OF THE VEHICLE. THE VEHICLE FAILED TO START. AFTER RECHARGING THE BATTERY, THE VEHICLE WAS DRIVEN TO GATORLAND TOYOTA LOCATED AT 2985 N. MAIN ST, GAINESVILLE, FL 32609, AND THE CONTACT WAS INFORMED THAT THE BATTERY POWER WAS DRAINED DUE TO THE VEHICLE NOT BEING DRIVEN FOR MORE THAN 48 HOURS. THE MANUFACTURER WAS ALSO NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 970.",
        "vin": "JTMY1RFV1LD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/28/2020",
        "dateOfIncident": "07/28/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341918,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS A 14.5 USG GAS TANK AND GETS APPROXIMATELY 40MPG AS PER THE VEHICLE COMPUTER. THE VEHICLE SHOULD HAVE A RANGE OF APPROXIMATELY 560 MILES. AT 390 MILES, THE DISTANCE TO EMPTY DISPLAY WAS 44 MILES AND THE GAS GAUGE NEEDLE WAS JUST ABOVE E. AT THE FILL UP THE PUMP KICKED OFF AT 9.6 GALLONS. WHEN TRYING TO ADD MORE GAS, THE PUNP KICKED OFF AGAIN AT 10.1 GALLONS. THE GAS GAUGE READS FULL AND THE DISTANCE TO EMPTY READS 470 MILES. I AM EITHER 4 GALLONS SHORT OF A FULL TANK OR THE GAUGE READS EMPTY WHEN THERE IS 4 GALLONS REMAINING.  I HAVE OWNED THIS CAR FOR 4 WEEKS.  A SERVICE WRITER AT THE DEALERSHIP DENIES ANY KNOWLEDGE OF THE PROBLEM AS THERE IS NO ACTUAL RECALL NOTICE.  TOYOTA IS AWARE OF THE PROBLEM AND HAS NO REMEDY.  DEALERSHIPS HAVE BEEN MADE AWARE THROUGH INTERNAL MEMOS WHICH ARE AVAILABLE ONLINE. THE RESPONSE FROM THE DEALERSHIP IS TO LEAVE IT FOR A DAY TO BE LOOKED AT.  I REALIZE THERE IS NO CURRENT FIX, BUT DEALERSHIPS SHOULD BE DOCUMENTING COMPLAINTS.",
        "vin": "JTMRWRFV9LJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/28/2020",
        "dateOfIncident": "07/28/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341941,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE SECOND TIME NOW THE BATTERY IN THE BRAND NEW 2020 RAV4 XLE (HAD IT FOR LESS THAN A MONTH) WAS DRAINED WHEN THE CAR WAS NOT IN USE FOR A COUPLE OF DAYS.  HAD CAR TOWED TO DEALER, BATTERY RECHARGED AND TOLD NOTHING WRONG, NO ERROR CODES, ETC. LESS THAN TWO MONTHS LATER, IT HAPPENED AGAIN NOW.  CAR BEING TOWED TO THE DEALER AND I AM ASKING FOR A NEW BATTERY TO BE INSTALLED.",
        "vin": "JTMW1RFV6LJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/24/2020",
        "dateOfIncident": "07/23/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341305,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY DIES WHEN NOT STARTED FOR A FEW DAYS, WITH NO DOORS LEFT OPEN OR LIGHTS LEFT ON, ETC. DEALER STATES THAT DIAGNOSTICS CAME BACK CLEAR AND THERE IS NOTHING WRONG WITH THE BATTERY. ISSUE STILL PRESENT. VEHICLE WAS LEFT IN THE GARAGE OFF FOR 3 DAYS, WHEN WE NOTICED THE CAR WOULD NOT START AND THE BATTERY WAS DEAD.",
        "vin": "JTMC1RFV6LD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/23/2020",
        "dateOfIncident": "06/25/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341054,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL TANK DOES NOT FILL UP 14.5 GALLONS. IT ONLY FILLS UP ABOUT 9-10 GALLONS OF FUEL. MILEAGE RUN ON FULL TANK IS WAY WAY LESSER THAN WHAT IS ADVERTISED.",
        "vin": "JTMDWRFV6LD"
    },
    {
        "components": "STEERING,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "07/21/2020",
        "dateOfIncident": "06/16/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340719,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 TOYOTA RAV4. THE CONTACT STATED THAT AFTER STARTING THE VEHICLE AND DRIVING APPROXIMATELY 3 TO 4 MILES, THE VEHICLE PULLED TO THE RIGHT WITH AND WITHOUT THE LANE ASSIST FEATURE ACTIVATED. WITHIN ANOTHER 2-4 MILES THE FAILURE WAS INDEPENDENTLY REMEDIED. THE CONTACT TOOK THE VEHICLE TO DELUCA TOYOTA (1719 SW COLLEGE RD, OCALA, FL 34471, (352) 732-0770) HOWEVER, THE MECHANIC WAS UNABLE TO DUPLICATE THE FAILURE. THE FAILURE RECURRED FIVE TIMES. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 3,000. *LN*JB *BF *JS",
        "vin": "2T3W1RFV6LC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/17/2020",
        "dateOfIncident": "04/18/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339877,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL INDICATION IN CAR IS INCORRECT. WHEN FUELING TO FULL DOES NOT INDICATE FULL AND FUEL GAUGE APPEARS INCORRECT AS QUANTITY DECLINES VERY QUICKLY. NOT ABLE TO TELL FROM THE GAUGE HOW MUCH FUEL IS ACTUALLY IN THE CAR. HAPPENS AT ALL SPEEDS IN ALL CONDITIONS SINCE CAR PURCHASED ON 04/18/2020",
        "vin": "JTMDWRFV6LD"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/17/2020",
        "dateOfIncident": "07/16/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340023,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 JANUARY RAV4 XLE AWD. 2 CASES OF DEAD BATTERY. 1ST IN APRIL MILEAGE 2029, 1 WEEK WITHOUT DRIVING. 2ND IN JULY MILAGE 2896, 2 DAYS WITHOUT DRIVING.  1ST TIME; AAA JUMPED IT, TESTED BATTERY SAID IT FAILED. TOOK TO DEALER; NOTHING WRONG, BATTERY TEST GOOD.  2ND TIME; TOYOTA ROAD SERVER JUMPED IT.    A SIMPLE SEARCH OF THE WEB SHOWS HUNDREDS OF THE SAME ISSUE.  POSSIBLE REPORTED CAUSES; BAD BATCH OF BATTERIES, DCM FW UPDATE (TSB T-SB-0021-20 - DOESN'T APPLY TO OUR CAR), MYSTERY \"SENSOR\" NEEDS TO BE REPLACED, CONSTANT DATA COMMUNICATIONS BETWEEN KEY FOB, POSITIONING SATELLITE OR BLUETOOTH PHONE.    THIS IS HUGE SAFETY ISSUE!!!  PEOPLE ARE BEING STRANDED AT ANY TIME WITH A DEAD BATTERY ON CARS LESS THAN A YEAR OLD!!!",
        "vin": "2T3P1RFV1LC"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "07/09/2020",
        "dateOfIncident": "07/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11338404,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JULY 3, 2020 AT 2:30PM I WAS PARKING THE CAR INTO A PARKING SPACE IN A STRIP MALL WHEN I HAD MY FOOT ON THE BRAKE TO STOP THE CAR BUT THE CAR IMMEDIATELY ACCELERATED AND CRASHED INTO THE PARKED CAR IN FRONT OF ME.  WITH MY FOOT STILL ON THE BRAKE, I PUT THE CAR INTO REVERSE, WHEN THE CAR ACCELERATED AGAIN AND JERKED BACKWARDS,  WITH MY FOOT STILL ON THE BRAKE, I PUT THE CAR INTO DRIVE AND THE CAR ACCELERATED AND CRASHED INTO THE PARKED CAR IN FRONT ON ME AGAIN FOR THE 2ND TIME.  THE AIR BAGS DID NOT DEPLOY.  I WAITED FOR THE OWNER OF THE PARKED VEHICLE, THE POLICE ARRIVED ON SITE AND THE CAR WAS TOWED TO THE DEALERSHIP. *LN  CONSUMER STATED BOTH THE DEALER AND MANUFACTURER WERE NOTIFIED.*JB",
        "vin": "JTMN1RFV8LD"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/08/2020",
        "dateOfIncident": "07/08/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338147,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "RAV4 WAS PURCHASED FIRST WEEK OF JUNE 2020. TWO WEEKS LATER, I GO TO START THE CAR IN THE MORNING AND THE BATTERY IS DEAD.  I HAD IT JUMPED AND TOOK IT TO TOYOTA.  THE DEALER SAID EVERYTHING WAS WORKING AS IT SHOULD.  I TOOK IT HOME.  THIS MORNING, THREE WEEK AFTER THE FIRST INCIDENT, I GO TRY TO START THE CAR IN THE MORNING AND THE BATTERY IS DEAD.  THE TOW TRUCK DRIVER WAS ABLE TO JUMP AND START THE CAR.  SINCE THIS WAS THE SECOND TIME THIS HAPPENED IN A MONTH, I HAD THE CAR TOW TO THE DEALER FOR FURTHER DIAGNOSTICS.  SOMETHING IS DEFINITELY WRONG WITH THE ELECTRICAL SYSTEM.  CAR WAS PARKED IN THE GARAGE OVER NIGHT BOTH TIMES.  NO LIGHTS INTERIOR OR EXTERIOR LIGHT WERE ON.  NO DOORS AJAR TO DRAW POWER.  RADIO WAS TURNED OFF.  BOTH FAN AND A/C WAS TURNED OFF.",
        "vin": "2T3F1RFVXLW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/06/2020",
        "dateOfIncident": "07/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337664,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "DEAD BATTERY AFTER 1 MONTH OF PURCHASE",
        "vin": "JTMEWRFV8LJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/06/2020",
        "dateOfIncident": "07/06/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337697,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 TOYOTA RAV4 HYBRID HAS BEEN EXPERIENCING A HOST OF ISSUES SINCE PURCHASED MARCH 1, 2020. TOP THREE ARE: 1) FUEL TANK / FUEL SENDER ISSUE (SEE ATTACHED FROM TOYOTA CORPORATE), 2) REMOTE CONNECT ISSUE (T-SB-0021-20, ALSO ATTACHED), AND MOST RECENTLY 3) SMART KEY SYSTEM MALFUNCTION, PKSB FAILURE, BRAKE ASSIST FAILURE, AND A DEAD BATTERY. THESE MOST RECENT FAILURES ARE MOST TROUBLING AS THE CAR WAS TOTALLY UNRESPONSIVE. THE VEHICLE WAS PARKED IN A TEMPERATURE CONTROLLED GARAGE FOR 60 HOURS, UNTOUCHED. THERE ARE NO AFTER-MARKET INSTALLATIONS, AND NOTHING WAS ACCIDENTALLY LEFT ON; NO HIGH-DRAIN ACCESSORIES TO BLAME. THIS IS STRICTLY AN ELECTRICAL / SOFTWARE / FIRMWARE ISSUE, AND TOYOTA HAS SHOWN ZERO ACCOUNTABILITY IN ADDRESSING THE ISSUE. HUNDREDS, IF NOT MORE, 2020 RAV4 HYBRID OWNERS HAVE EXPERIENCED THE ISSUE (FOR REFERENCE: HTTPS://WWW.RAV4WORLD.COM/THREADS/DEAD-BATTERY.303636/). THESE VEHICLES SHOULD NOT BE PERMITTED TO BE SOLD AS-IS.",
        "vin": "2T3DWRFV8LW"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/05/2020",
        "dateOfIncident": "06/25/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337561,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TRIED TO SET RADAR CONTROLLED CRUISE CONTROL FOR THE FIRST TIME ON A WORK TRIP TO MICHIGAN AT 70 MPH. THE STEERING WHEEL IMMEDIATELY TURNED TO THE LEFT AND TOOK CONSIDERABLE PRESSURE TO KEEP VEHICLE STRAIGHT. TOOK SUV IN TO SHOP AND THEY SAID THE RADAR CONTROLLED ADAPTIVE CRUISE CONTROL WAS WORKING FINE  AND THEY COULD NOT DUPLICATE PROBLEM. THIS WEEK TOOK ANOTHER WORK TRIP TO MICHIGAN AND THE SAME PROBLEM HAPPENED ABOUT 20 TIMES WHILE TRYING TO SET CRUISE CONTROL AT 70 MPH. WHEN I DISABLED THE RADAR CRUISE CONTROL THE PROBLEM VANISHED  BUT THE SUV WOULD NOT DETECT TRAFFIC IN FRONT OF IT AND OF COURSE WOULD NOT SLOW DOWN. WILL TRY TO VIDEO THIS PROBLEM AND TAKE SUV BACK TO SHOP FOR A FIX.",
        "vin": "2T3MWRFV7LW"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/01/2020",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337075,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WINDSHIELD WAS HIT BY A SMALL ROCK FROM THE VAN ON THE LEFT LANE. IT CAUSED A CHIP BUT IT CRACKED ALMOST 15 INCHES ACROSS MY WINDSHIELD. I HAVE SEEN CHIP FROM MY PREVIOUS VEHICLES BUT IT NEVER LEFT A CRACK, THAT INSURANCE COVERED IT WITH NO DEDUCTIBLE. OTHER THAN NEEDING THE WINDSHIELD TO BE REPLACED, IT NEEDS TO BE CALIBRATED TOO OR SOME SENSORS WON'T WORK. THAT'S ANOTHER $390 PLUS TAX FROM TOYOTA SERVICE CENTER. I SPOKE TO A REPRESENTATIVE FROM AUTOGLASS NOW LOCATED AT RALEIGH, NC, THAT I CONTRACTED TO REPLACE MY WINDSHIELD, SHE SAID THEY'VE BEEN GETTING A LOT OF RAV 4 LATELY WITH THE SAME ISSUE. THIS IS SO FRUSTRATING. I WENT TO THE GROCERY STORE AND SPENT $20, JUST TO SPEND $600 COS OF A BROKEN WINDSHIELD. TOYOTA PUT A CHEAP KIND OF GLASS THAT IT CRACKED BY A SMALL ROCK. THIS VEHICLE ISN'T CHEAP EITHER. TOYOTA, WHAT CAN YOU DO FOR US CONSUMERS? THIS IS SUCH A HASSLE AND EXPENSIVE INCONVENIENCE.",
        "vin": "JTMC1RFV8LD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/30/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331757,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FUELING ENDS PREMATURELY.   TOPPING OFF FUEL TANK CAN TAKE AS MUCH AS 2 MORE GALS.",
        "vin": "2T3DWRFV8LW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/28/2020",
        "dateOfIncident": "06/20/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331313,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "NEW VEHICLE, PARKED IN ENCLOSED GARAGE, AT HOME FOR THIRTY-SIX (36 ) HOURS. VEHICLE HAD APPROXIMATELY SIX-HUNDRED (600) MILES.  WIFE MADE ATTEMPT TO START THE VEHICLE BUT THE BATTERY WAS DEAD. NO LIGHTS, NO HORN FUNCTIONING.  CALLED TOYOTACARE FOR ASSISTANCE.. THEY RESPONDED AND DETERMINED THE NEW BATTERY HAD FIVE (5) VOLTS. THIS WAS DESCRIBED AS A TOTALLY DEAD BATTERY. I TOOK THE VEHICLE BACK TO THE DEALERSHIP, TOYOTA OF OLYMPIA (WASHINGTON) REPLACED THE DEAD BATTERY AND INSTALLED A BATTERY TRICKLE CHARGER.   THE NEXT DAY, WE DROVE  THE VEHICLE FOR AT LEAST FIVE HOURS AND PARKED IN CLOSED GARAGE. BATTERY VOLTAGE WAS  12.67 VOLTS. AFTER THREE HOURS, PARKED, THE BATTERY WAS 12.69. THE NEXT MORNING AT 6AM THE BATTERY WAS 12.63. WITHIN THREE HOURS (9AM) THE BATTERY WAS 12.45 VOLTS.  ANY BATTERY AT 12.45 VOLTS IS CONSIDERED A DEAD BATTERY.  WITHIN TWELVE HOURS THE BATTERY DIMINISHED FROM FULLY CHARGED TO DEAD  VISITED THE WEB SITE OF CARGURUS AND LOCATED APPROXIMATELY SIXTEEN OTHER COMPLAINTS WITH THE EXACT SAME PROBLEM- DEAD BATTERY AFTER VEHICLE IS PARKED FOR TWO DAYS.",
        "vin": "2T3EWRFV5LW"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/27/2020",
        "dateOfIncident": "02/20/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331193,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL GAUGE IS INACCURATE AS WELL AS MILES REMAINING CALCULATIONS ARE INACCURATE. FUEL GAUGE INDICATES EMPTY WHEN APPROXIMATELY 2+ GALLONS REMAIN IN THE FUEL TANK.  *TR",
        "vin": "2T3DWRFV3LW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/25/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330883,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A NEW 2020 RAV4 HYBRID XSE IN JANUARY. TWO WEEKS AGO, I WENT OUT IN THE MORNING TO DRIVE IT AND IT WOULDN'T START. THE BATTERY WAS DEAD. I HAD LEFT IT PARKED IN THE DRIVEWAY WITH THE CAR LOCKED. THE CAR HAD 5,400 MILES. I CALLED ROADSIDE ASSISTANCE TO JUMP IT AND GET IT TO THE DEALERSHIP. THEY RAN DIAGNOSTICS AND HAD NO IDEA WHAT THE PROBLEM WAS. THEY SUGGESTED I WASN'T DRIVING IT ENOUGH ?  *TR",
        "vin": "JTMEWRFV2LJ"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/24/2020",
        "dateOfIncident": "06/23/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330488,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2020 TOYOTA RAV4. THE CONTACT STATED THAT SUNLIGHT WAS REFLECTED OFF THE CHROME ON THE DASHBOARD, WHICH CAUSED THE CONTACT'S VISION TO BE IMPAIRED WHILE ATTEMPTING TO USE THE SIDE MIRRORS. THE VEHICLE WAS NOT TAKEN TO A DEALER OR AN INDEPENDENT MECHANIC TO BE INSPECTED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 150.  *BF*JB",
        "vin": "2T3J1RFV8LC"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "06/24/2020",
        "dateOfIncident": "01/12/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330596,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 TOYOTA RAV4. THE CONTACT STATED THAT ON SEVERAL OCCASIONS WHILE DRIVING, THE VEHICLE INDEPENDENTLY VEERED TO THE LEFT AND TO THE RIGHT. THE VEHICLE WAS TAKEN TO MARKQUART TOYOTA (1844 COMMERCIAL BLVD, CHIPPEWA FALLS, WI 54729), ON SEVERAL OCCASIONS HOWEVER, THE MECHANIC WAS UNABLE TO DUPLICATE THE FAILURE. THE CONTACT WAS INFORMED THAT LANE DEPARTURE ASSIST WAS ACTIVATED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT STATED THAT THE FAILURE WAS INTERMITTENT. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT TO HAVE THE VEHICLE TAKEN BACK TO THE DEALER FOR ASSISTANCE. THE FAILURE MILEAGE WAS APPROXIMATELY 800.",
        "vin": "2T3A1RFV4LC"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/23/2020",
        "dateOfIncident": "06/16/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330262,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE VEHICLE (NEW) ON 6/03/2020. ON 6/16/2020, WARNING LIGHTS AND BUZZERS WENT ON AS I WAS DRIVING THE VEHICLE. THE WARNINGS TOLD ME THAT THERE WAS A PROBLEM WITH MY BRAKES, AND THAT I SHOULD PULL OVER AS SOON AS POSSIBLE. I DROVE TO A NEARBY PARKING LOT. THE BRAKES CONTINUED TO WORK. I TURNED THE CAR OFF AND RESTARTED IT, THINKING IT MIGHT BE A COMPUTER GLITCH IN WHAT WAS A BRAND NEW CAR. WHEN I RESTARTED THE CAR, I BACKED OUT OF MY PARKING SPOT TO \"TEST\" THE BRAKES. THE CAR STOPPED, BUT THE BRAKES SEEMED WEAKER. ULTIMATELY, THE VEHICLE WAS TOWED TO THE DEALERSHIP. THE DEALER'S SERVICE REP CONTACTED ME TO TELL ME THAT THE BRAKE ASSIST ASSEMBLY HAD FAILED. I ASKED IF THIS WAS SOMETHING THEY HAD SEEN BEFORE AND HE SAID NO. AFTER SOME RESEARCH, I DETERMINED THAT THIS HAS BEEN A PROBLEM AND THE SUBJECT OF A RECALL WITH CERTAIN 2019 AND 2020 TOYOTA VEHICLES, INCLUDING THE 2019 RAV4 HYBRID. IN ADDITION, THIS DEFECT AFFECTS NOT ONLY THE BRAKE SYSTEM, BUT THE VEHICLE STABILITY CONTROL SYSTEM. I SUSPECT THE PROBLEM WITH MY CAR IS A CONTINUATION OF THE PROBLEMS WITH THE 2019 MODEL YEAR. I BELIEVE TOYOTA SHOULD HAVE EITHER CORRECTED THIS PROBLEM OR CHECKED THE 2020 CARS SUFFICIENTLY TO MAKE SURE THEY WERE SAFE TO DRIVE AND THAT THE BRAKE ASSIST  ASSEMBLY WAS NOT DEFECTIVE.  *TR",
        "vin": "JTMDWRFV5LD"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/23/2020",
        "dateOfIncident": "06/23/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330344,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 TOYOTA RAV4. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V064000 (ENGINE AND ENGINE COOLING) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. LE MIEUX TOYOTA (2550 S ONEIDA ST, GREEN BAY, WI 54304) WAS CONTACTED AND CONFIRMED THAT THE PART WAS NOT AVAILABLE FOR THE RECALL REPAIR. THE CONTACT WAS PROVIDED A LOANER VEHICLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS UNAVAILABLE.",
        "vin": "2T3DWRFV0LW"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/23/2020",
        "dateOfIncident": "06/22/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330342,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 TOYOTA RAV4. THE CONTACT STATED THAT THE RADAR ENHANCED CRUISE CONTROL FAILED TO OPERATE WHILE DRIVING AT VARIOUS SPEEDS WITHOUT WARNING. THE CONTACT STATED THAT WHEN A VEHICLE PULLED IN FRONT OF THE VEHICLE, THE VEHICLE SLOWED DOWN HOWEVER, THE BRAKE LIGHT FAILED TO ILLUMINATE. THE VEHICLE WAS TAKEN TO TWIN CITY TOYOTA (301 AUTUMN RIDGE DR, HERCULANEUM, MO 63048) HOWEVER, THE MECHANIC WAS UNABLE TO DUPLICATE THE FAILURE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 59. *BF*JB",
        "vin": "2T3J1RFV8LC"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/19/2020",
        "dateOfIncident": "06/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329686,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS LESS THAN A WEEK OLD (LESS THAN 1000MILES) AND I NOTICED THE FUEL TANK LID WAS CONSTANTLY POPPING OPEN. REALIZED THAT WHEN I TURNED MY CAR ON OR OFF (VERIFIED BY DEALERSHIP MECHANICS) THE GAS TANK FUEL LID WILL POP OPEN. SO, SOMEHOW THE POWER BUTTON ON THE VEHICLE CONTROLS MY GAS TANK LID. VEHICLE HAS BEEN WITH TOYOTA MECHANICS FOR ABOUT 24HRS NOW.  *TR",
        "vin": "JTMEWRFV8LD"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/08/2020",
        "dateOfIncident": "05/18/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327740,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS BOUGHT NEW IN DECEMBER 2019 WITH 7 MILES ON IT. ON TWO SEPARATE OCCASIONS, THE VEHICLE WAS LOCKED AND LEFT IN THE DRIVEWAY OVER NIGHT. UPON ENTERING THE VEHICLE THE NEXT MORNING, THE VEHICLE WOULD NOT START. ALL LIGHTS WHEN ON UPON PRESSING THE START BUTTON, BUT WHEN PRESSED AGAIN, ALL LIGHTS FADED AND THE CAR COMPLETELY DIED. VEHICLE WAS TOWED TO LOCAL TOYOTA DEALERSHIP WERE IT WAS KEPT FOR OVER A WEEK. ALL TESTS CAME BACK INCONCLUSIVE.  *TR",
        "vin": "JTMN1RFV1LD"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/06/2020",
        "dateOfIncident": "03/07/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327550,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS MY NEW CAR 2020 RAV4 XLE. I BROUGHT IT IN DEC  2019.  ONE DAY I PARKED MY CAR IN  EVENING AND NEXT  DAY CAR DID NOT START (AFTER  3 MONTH OF USE WITH AROUND 1100 MILES ON IT). I CALLED TOYOTA  AND THEY SEND PERSON TO TOW CAR. THEY DID BATTERY JUMP AND IT WORKED. AFTER THAT I HAVE MANUALLY TURNED OFF ALL THE LIGHTS  INSIDE THE CAR TILL NOW(HEAD LIGHT IS AUTO MODE) AND HAVE NO BATTERY ISSUE BUT I STILL WORRY ABOUT SOMETHING WRONG  WITH THIS CAR?S ELECTRIC SYSTEM.  *TR",
        "vin": "JTMP1RFV6LD"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/04/2020",
        "dateOfIncident": "05/28/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327214,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS INVOLVED WAS STOLEN AND IN A SINGLE CAR COLLISION WITH A TELEPHONE POLE. EXTENSIVE FRONT END DAMAGE OCCURRED WITH NO DRIVER SIDE AIR BAG DEPLOYMENT.  *TR",
        "vin": "2T3MWRFV2LW"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/02/2020",
        "dateOfIncident": "06/02/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327007,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED 5/22/20. UNIT PARKED IN DRIVEWAY. WENT OUT TO USE THE AUTO AND ALL SYSTEMS FAILING IN AUTO. VEHICLE WILL NOT START. BRAKE ALERT, ENGINE ALERT, AIRBAG ALERT, POWER STEERING ALERT, EVERY LIGHT ON INSIDE VEHICLE FLASHING WITH ALERTS THAT THEY ARE FAILING.  *TR",
        "vin": "2T3EWRFVXLW"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/30/2020",
        "dateOfIncident": "05/23/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326582,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE MIRRORS VIBRATE AT HIGHWAY SPEEDS. MAKES IT HARD TO SEE WHEN CHANGING LANES.  *TR",
        "vin": "2T3J1RFV2LC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/29/2020",
        "dateOfIncident": "05/28/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326565,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2020 TOYOTA RAV4 WOULDN'T START.  IT WAS PARKED IN MY GARAGE.  A TOW TRUCK OPERATOR RAN A TEST AND FOUND THAT I HAD A DEAD BATTERY.  THIS WAS SURPRISING BECAUSE I ONLY HAD 1,800 MILES ON THIS VEHICLE.  AFTER THE OPERATOR CHARGED THE BATTERY, I DROVE IT TO THE TOYOTA DEALER'S SERVICE DEPT.  THEY RAN SOME TESTS AND REPLACED THE DEAD BATTERY UNDER WARRANTY.  THEY WERE UNABLE TO FIND OUT WHAT CAUSED THE BATTERY TO FAIL.  THE TECHNICIAN TOLD ME THAT THEY HAD 5 BATTERIES FAIL THIS MONTH.  I DID AN INTERNET SEARCH AND FOUND OTHER PEOPLE HAD THE SAME PROBLEM WITH THE 2020 TOYOTA RAV4.  THEY THOUGHT THAT IT EITHER COULD BE AN INTERNAL SHORT IN THE BATTERY, OR ELSE THE DIGITAL PARKING BRAKE WAS DRAINING THE BATTERY.  THIS BATTERY PROBLEM COULD BE A SERIOUS SAFETY PROBLEM THAT COULD LEAVE PEOPLE STRANDED IN WINTER WEATHER.*JB",
        "vin": "2T3H1RFVXLW"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/28/2020",
        "dateOfIncident": "01/27/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326333,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 TOYOTA RAV4. THE CONTACT STATED THAT UPON PURCHASING THE VEHICLE, THE POWER STEERING WAS LOOSE AND BECAME DIFFICULT TO MANEUVER THE VEHICLE WHILE DRIVING AT VARIOUS SPEEDS. SHE ALSO STATED THAT THE STEERING WHEEL PULLED TO THE LEFT WHILE DRIVING AT VARIOUS SPEEDS. THE VEHICLE WAS TAKEN TO TOM WOOD TOYOTA (6408 CRANE DR, WHITESTOWN, IN 46075) ON THREE OCCASIONS WHERE THE ALIGNMENT WAS ADJUSTED HOWEVER, THE FAILURE PERSISTED. THE CONTACT THEN TOOK THE VEHICLE TO ANDY MOHR TOYOTA (8941 E US HWY 36, AVON, IN 46123) WHERE THE VEHICLE WAS DIAGNOSED WITH A MISSING FRONT TOE LINK. THE VEHICLE WAS REPAIRED HOWEVER, THE FAILURE PERSISTED. SHE THEN TOOK THE VEHICLE BACK TO ANDY MOHR TOYOTA FOR THE SECOND TIME WHERE THE MECHANIC MANUALLY ADJUSTED THE STEERING WHEEL HOWEVER, THE FAILURE PERSISTED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. UPON INVESTIGATION, THE CONTACT LINKED HER FAILURE TO NHTSA CAMPAIGN NUMBER: 20V286000 (SUSPENSION) HOWEVER, THE VIN WAS NOT INCLUDED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 60.",
        "vin": "JTMEWRFV3LD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/26/2020",
        "dateOfIncident": "12/24/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325914,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2020 TOYOTA RAV4 HYBRID LIMITED ADDITION FROM TOYOTA OF ESCONDIDO AND TOOK DELIVERY IN DECEMBER OF 2019.  UPON DELIVERY, I NOTICED THE INSTRUMENTATION SAID THIS VEHICLE HAD 575 MILES TO EMPTY.  WE WENT ON OUR ANNUAL CHRISTMAS TRIP TO N. CALIFORNIA.  I NOTICED THAT OUR FIRST REFUELING I COULD NOT FILL THE  TANK MORE THAN 9.5 TO 10 GALS OF FUEL WHEN SYSTEM SAYS LOW FUEL.  THIS HAPPENS CONSISTENTLY SINCE THE FIRST FILL UP IN DEC 2019 TO NOW MAY 2020.  THE BEST MILEAGE TO EMPTY HAS BEEN CONSISTENTLY 415 - 430 MILES TO EMPTY.  WHERE DOES THIS EXPLAIN THE 14.5 GALLON FUEL TANK.    SECONDLY WITH  VERY CAREFUL AND TEDIOUS DRIVING IN TOWN OR HIGHWAY CANNOT ATTAIN ANYWHERE NEAR THE VEHICLE STICKER OF 41/38 MPG.  THE BEST I CAN OBTAIN IN TOWN IS 31.5 MPG.  I TOOK THE VEHICLE IN SEVERAL TIMES TO ADDRESS THIS ISSUE AND WAS TOLD THERE WAS NO FIX IN PLACE FOR THE FUEL ISSUE, BUT THEY ARE AWARE OF THIS ISSUE AND HAVE KNOWN OF THIS ISSUE SINCE 2019 MODELS.    THEY HAD THE VEHICLE FOR THE DAY AND RETURNED IT TO ME WITH A FUEL ECONOMY READING OF 61 MPG.  I WAS ASTONISHED AND ASKED HOW DID THEY DO THIS.  THERE WAS NOT REPLY.  JUST DRIVING THE VEHICLE HOME FROM THE DEALER THE FUEL ECONOMY STARTED TO FALL DRASTICALLY  AND WITHIN 2 DAYS THE ECONOMY WAS BACK TO 31.5 MPG.  *TR",
        "vin": "2T3DWRFV9LW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/25/2020",
        "dateOfIncident": "05/10/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325902,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASE MY BRAND NEW TOYOTA RAV4 XLE ON MAY 9, 2020. EXPERIENCING VERY POORLY INSTALLED/DESIGNED SIDE MIRRORS THAT SHAKE REPEATEDLY. IT BEGAN HAPPENING WHEN IT WAS ONLY AT HIGHWAY SPEEDS BUT NOW IT IS ALL THE TIME AND HONESTLY, IT'S SUCH A SUBSTANTIAL VIBRATION. WENT TO THE DEALERSHIP AND HAVE THEM CHECK ON IT AND THEY AGREE WITH ME. AND THEY COMPARE THIS WITH 2 NEW OTHER RAV4 ON THEIR LOT AND THEY ALL DID THE SAME. THE DEALER CLAIMS IT'S A CHARACTERISTIC AND SAYING THAT THEY CANNOT DO ANYTHING ABOUT IT AND MADE ME HAVE TO OPEN A CASE WITH MANUFACTURING. THEY CLAIM I HAVE TO WAIT UNTIL A FIX IS ISSUED. ALSO CALLED AND TALKED WITH TOYOTA AND THEY SAID THE SAME THING, THAT THEY CAN'T DO ANYTHING ABOUT IT. I DEEM THIS A SAFETY CONCERN; PARTICULARLY WITH LANE CHANGING. IT'S A MAJOR PROBLEM AND I'M GETTING BLOWN OFF LIKE IT DON'T MATTER. I'M A TRAVEL NURSE AND DRIVING FROM STATE TO STATE AND DRIVING ON HIGHWAYS WITH THE SIDE MIRROR SHAKING WILL BE A DEFINITE SAFETY CONCERN. I BOUGHT A 2020 BRAND NEW CAR TO GET MORE SAFETY FEATURES WHILE I'M TRAVELING BUT IT SEEMS LIKE THAT IS NOT THE CASE. REALLY AFRAID THIS MIGHT CAUSE ACCIDENT. IM AFRAID OF MY SAFETY AND THE OTHER PEOPLE. I HAVE FRIEND WHO HAD THE SAME CAR WITH THE SAME ISSUE. HOPEFULLY YOU CAN GUYS HELP ME WITH THIS ISSUE. THANK YOU",
        "vin": "2T3W1RFV9LC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/22/2020",
        "dateOfIncident": "05/21/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325618,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "YESTERDAY 05/21/2020 6 PM IN LAKE NONA ORLANDO , I STOPPED  MY CAR ON THE ROAD DUE TO  HAIL STORM AND RAIN AT 6 PM , I DIDN'T NOTICE THE DAMAGE  IN THE NIGHT ,   WHOLE BODY IS DISFIGURED , NO GLASS BROKEN , EVERYWHERE DEPRESSION , I HAD RAV 4 2006 , PRADO 2014 IN UAE ,  THE BODY WAS VERY STRONG ,  BUT MY POOR 2020 RAV4 PREMIUM XLE CANT  TOLERATE A SIMPLE HAIL STORM ,  I AM VERY UPSET , IF IT IS MADE OF STEEL IT WILL HAPPEN LIKE THIS , ITS PAPER LIKE ALUMINUM ,  I NEED A TOYOTA VEHICLE STRONG , NOT LIKE PAPER . KINDLY DO THE NEEDFUL, I BOUGHT  THE CAR UNDER CAR LOAN , I SPEND ALMOST 38000$ ON IT   31000 PLUS INSURANCE PLUS INTEREST 4000 , TAX ETC   WAITING FOR THE REPLY  , OR PLEASE EXCHANGE WITH A STRONG SUV  ANY MODEL WITH STEEL BODY , WHAT SAFETY FOR PASSENGERS , IN CASE OF A COLLISION , VERY UPSET WITH THIS SITUATION.  *TR",
        "vin": "2T3C1RFV8LC"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/09/2020",
        "dateOfIncident": "02/08/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323939,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GAS TANK WILL HOLD UP TO 10 GALLONS OF GAS AND TRYING TO ADD MORE CAUSES THE TANK TO OVERFLOW, EVEN WHEN THE FUEL LIGHT INDICATES THE GAS TANK ISN'T FULL.  VEHICLE IS ADVERTISED TO HOLD 14.5 GALLONS.  *TR",
        "vin": "2T3EWRFV3LW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/27/2020",
        "dateOfIncident": "02/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322412,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA ADVERTISES THE 2020 RAV4 HYBRIDS ARE EQUIPPED WITH 14.5 GALLON FUEL TANKS, THE HYBRID ALLEGEDLY SHOULD GET 41 MILES PER GALLON FOR CITY DRIVING, 38 MPG FOR HIGHWAY DRIVING AND A COMBINED 40 MPG.  THIS SHOULD APPROXIMATELY PROVIDE A RANGE OF 580 MILES ON A TANK OF GAS.    HOWEVER, MY RAV4 HYBRID CANNOT REACH THAT RANGE BECAUSE WHEN REFUELING, THE GAS PUMP NOZZLE AUTOMATICALLY SHUTS OFF BEFORE THE TANK IS CLOSE TO BEING FULL.     ADDING 8 GALLONS OF GAS WHEN THE LOW FUEL LIGHT IS ILLUMINATED CAUSES THE FUEL NOZZLE TO SHUT OFF. TRYING TO ADD MORE FUEL ALLEGEDLY CAUSES AN OVERFLOW EVEN THOUGH THE TANK SHOULD HOLD 14.5 GALLONS TOTAL.    WHEN I CHECKED WITH THE DEALER ABOUT THE ISSUE THEY DO NOT HAVE ANY FIX FOR THIS ISSUE AND THEY HAVE SAID TOYOTA ALREADY KNOWS ABOUT THE ISSUE.    I GOT PISSED OFF BECAUSE BOTH THE DEALER AND TOYOTA KNOWS ABOUT THE ISSUE, BUT THEY HIDE THIS INFORMATION FROM ME WHILE SELLING THIS CAR. I GUESS THEY CANNOT ADVERTISE FUEL TANK CAPACITY AS 14.5 GAL, WHAT THEY ARE DOING IS UNETHICAL. I WISH I GET AN OPTION TO RETURN MY CAR AND GET MY MONEY BACK.",
        "vin": "JTMEWRFV6LD"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/23/2020",
        "dateOfIncident": "04/23/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322088,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE OWNED THIS RAV 4 HYBRID FOR 4 MONTHS. I HAVE DRIVEN ONLY 2500 MILES SO FAR.  I LIVE IN NEW ENGLAND AREA.  RAV4 IS MADE IN CANADA.  TWICE IN THE LAST 3 MONTHS I HAVE HAD A DEAD BATTERY AFTER LEAVING PARKED FOR 2-4 DAYS.  BOTH TIMES NEED ASSISTANCE FROM A BATTERY CHARGER.  HYBRID BATTERY SHOWS OVER HALF CHARGED. THE 12 VOLT BATTERY SEEMS TO BE THE ISSUE.  THERE ARE NO AFTERMARKET ACCESSORIES.  SMARTPHONE APP NOTIFIES ME IF THERE IS AN ISSUE WHEN PARKED.  THIS ISSUE IS NOT ISOLATED.  MANY COMPLAINTS ON RAV4 FORUMS.",
        "vin": "2T3DWRFV6LW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/19/2020",
        "dateOfIncident": "03/31/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321561,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL GAUGE DOES NOT REFLECT THE TRUE AMOUNT OF FUEL IN THE FUEL TANK. IT SEEMS TO BE SHOWING LESS FUEL FOR EXAMPLE THE RAV4 HYBRID HAS A CAPACITY OF 14.7 GALS OF FUEL. FILLING UP WHEN THE INDICATOR SHOWING ABOUT 18 MILES AND ABOUT 1/4 TANK. RE-FUELING ONLY 9.8 GALLONS WAS PUT INTO THE TANK. THE 2020 RAV4 HYBRID WILL ACHIEVE GOOD GAS MILEAGE AND AT 1/4 TANK SHOULD BE ABOUT 3.7 GAL. IN THIS CASE IT SHOULD HAVE 4.5 GALLONS. I WOULD ASSUME THAT A RESERVE WOULD BE 2 GALLONS WHICH WOULD GIVE ME 60+ MILES UNTIL COMPLETELY EMPTY.  NOW IT IS BETTER TO HAVE MORE FUEL INSTEAD OF THE OPPOSITE OF LESS FUEL. BUT DEFINITELY THE 2020 RAV4 HYBRID HAS A FUEL INDICATOR ISSUE. WHICH FROM MY RESEARCH HAS THE SAME ISSUE STARTING FROM THE REDESIGNED 2019 RAV4. IT WOULD ALSO SEEM THAT TOYOTA HAS NOT BEEN INCLINED TO PROVIDE A FIX FOR THE ISSUE, SINCE THIS IS OCCURRING IN TWO MODEL YEARS. TOYOTA NEEDS TO ADDRESS THE ISSUE IN A TIMELY MANNER AND IN MY OPINION IT HAS NOT DONE FOR ITS CUSTOMERS. I ASK THE NHTSA TO INVESTIGATE THIS ISSUE TO PROVIDE REDRESS TO THE OWNERS OF THE RAV4 STARTING WITH THE REDESIGN 2019 MODEL YEAR. YOUTUBE HAS NUMEROUS COMPLAINTS FOR THIS ISSUE. I HAVE CONTACTED TOYOTA SUPPORT BY PHONE AND THEY SAY ARE AWARE OF THE ISSUE I REPORTED BUT HAVE NO TRUE FIX OR WHY IT IS OCCURRING.  I PREVIOUSLY OWNED A 2017 RAV4 HYBRID AND THIS ISSUE WAS NOT REFLECTED IN THIS MODEL YEAR. WHEN FILLING AT ABOUT 1/4 TANK I WOULD BE PUMPING ABOUT 12-12.5 GALLONS.  THANK YOU  [XXX]     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "2T3DWRFV9LW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/31/2020",
        "dateOfIncident": "01/26/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319807,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM WRITING THIS LETTER REQUESTING YOUR ASSISTANCE IN RESOLVING A CONTINUING PROBLEM I HAVE EXPERIENCED REGARDING MY RECENTLY PURCHASED 2020 TOYOTA RAV 4.     IT SEEMS MY CAR CANNOT STAY IN THE DRIVING LANE, EVEN FOR A SHORT DISTANCE, WITHOUT MY HAVING TO CONSTANTLY ADJUST THE STEERING. I HAVE TAKEN MY CAR FOUR TIMES TO AUTHORIZED TOYOTA REPAIR SHOPS, BUT EACH TIME THEY WERE UNABLE TO CORRECT THIS PROBLEM. IN FACT, I WAS TOLD THAT THERE IS NOTHING WRONG WITH MY CAR, AND THIS IS HOW A TOYOTA RAV PERFORMS. I ALSO HAD A TIRE ALIGNMENT, THINKING THIS WAS THE PROBLEM, BUT TO NO AVAIL.    GERMAINE TOYOTA ALLOWED ME TO TEST DRIVE A SIMILAR CAR, AND I NOTED IT STILL NEEDED CONTINUAL ATTENTION, BUT NOT AS MUCH AS MY CAR.    I BELIEVE THIS TO BE A DANGEROUS DEFECT IN THE CAR AND MAY LEAD TO MANY UNNECESSARY ACCIDENTS.    PLEASE LET ME KNOW IF YOU WILL BE OF ASSISTANCE TO ME AND OTHERS WHO MAY BE IN THE SAME SITUATION.    I ANXIOUSLY AWAIT HEARING FROM YOU.",
        "vin": "JTMH1RFV8LD"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/31/2020",
        "dateOfIncident": "02/04/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319894,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA TELLS ME THAT THE LANE DEPARTURE SYSTEM (LDA)  AND THE LANE TRACING SYSTEM (LTA) ARE INDEPENDENT BY DESIGN.  THIS CREATES AN UNSAFE DRIVING ENVIRONMENT AND HAS THE POTENTIAL TO CAUSE ACCIDENTS. I HAVE ABOUT 4700 MILES ON MY CAR AND MANY MILES OF DRIVING WITH THE LDA & LTA ENGAGED. I HAD POSITIVE CONTROL OF THE STEERING WHEEL AT ALL TIMES IN THE INCIDENTS DESCRIBED BELOW.     WHILE DRIVING DOWN THE ROAD THE LTA CONSTANTLY MAKES CORRECTIONS TO THE RELATIVE POSITION OF THE CAR IN THE TRAFFIC LANE. IT REGULARLY TRIES TO STEER YOU OUT OF YOUR LANE.  USUALLY, WHEN THE LTA IS STEERING THE VEHICLE OUT OF THE LANE, THE LDA SIGNALS.  THE LTA DOES NOT MAKE A CORRECTION DESPITE THE LDA SOUNDING.     IF THE LTA/LDA COMMUNICATED, RATHER THAN BEING SEPARATE MODULES, THE LDA WOULD TELL THE LTA IT WAS ABOUT TO STEER THE CAR OUT OF THE LANE AND MAKE THE CORRECTION.     INSTEAD, THE LTA STEERS THE CAR OUT OF THE LANE AND THE LDA TELLS YOU THAT YOU LEFT THE LANE OR WILL LEAVE THE LANE.  WHEN I DROVE 40 PLUS MILES TO THE DEALER, I TOLD HIM THAT I FELT AS IF I HAD WRESTLED THE VEHICLE THE ENTIRE WAY.  THE SERVICE MANAGER DROVE THE VEHICLE AND EXPERIENCED THE CONDITIONS I AM DESCRIBING. HE TOLD ME THAT TOYOTA TOLD HIM THE VEHICLE WAS FUNCTIONING AS DESIGNED.  I ALSO CALLED TOYOTA USA AND WAS TOLD THE SYSTEMS ARE INDEPENDENT AND FUNCTIONING AS DESIGNED. I TOLD THE DEALER AND TOYOTA USA THAT THE SYSTEMS ARE A SAFETY HAZARD.    AS AN INDEPENDENT SYSTEM THE LTA CREATES A HAZARDOUS DRIVING CONDITION.  IT IS TRYING TO STEER YOU OUT OF YOUR LANE, AND IF YOU DON'T MAINTAIN STRONG PRESSURE ON THE STEERING WHEEL, YOU WILL LEAVE YOUR LANE. THAT IS ESPECIALLY TRUE IF YOU IF DRIVE BY AN EXIT LANE. ON AN EXIT LANE TO THE RIGHT, EVEN THOUGH THERE IS A LANE MARKING TO THE LEFT OF THE VEHICLE, IT MAKE A SHARP PULL TOWARD THE RIGHT,",
        "vin": "JTMEWRFV4LD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/23/2020",
        "dateOfIncident": "03/20/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319058,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH FUEL GAUGE ON EMPTY AND DISTANCE TO EMPTY (DTE) SHOWING LESS THAN 20 MILES LEFT, AM ONLY ABLE TO FILL WITH 10-10.5 GALS OF FUEL IN A 14.5 GAL TANK.",
        "vin": "2T3EWRFV1LW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/15/2020",
        "dateOfIncident": "03/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318149,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR IS NEW 800 MILES TOTALLY DEAD BATTERY.PARKED IN DRIVEWAY OVER NIGHT.  TOW SERVICE TOOLS US WAS THE SECOND NEW RAV4 WITH A DEAD BATTERY TODAY.",
        "vin": "2T3DWRFV5LW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/09/2020",
        "dateOfIncident": "03/09/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317076,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL TANK DOES NOT FILL TO ITS ADVERTISED CAPACITY OF 14.5 GALLONS. I GET ONLY ABOUT 10 GALLONS UNTIL IT STOPS.",
        "vin": "2T3EWRFV1LW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/09/2020",
        "dateOfIncident": "03/08/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317143,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "ATTEMPTED TO FILL THE FUEL TANK ON 2020 RAV4 HYBRID WHICH REFLECTED THAT IS WAS BELOW 1/4 FULL, BUT WAS ONLY ABLE TO PUT IN 7 GAL WHICH OBVIOUSLY DID NOT REFLECT A FULL TANK (14.5GAL)",
        "vin": "2T3DWRFV7LW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/06/2020",
        "dateOfIncident": "12/10/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316516,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I CANNOT FILL THE TANK FULL. I HAVE TRIED SEVERAL GAS STATION PUMPS AND FILLING SLOWLY AFTER THE PUMP CLICKS OFF.  WITH TIME AND EFFORT, I CAN GET ANOTHER 2 GALLONS IN, BUT THE RANGE IS LESS THAN ADVERTISED.  THIS HAS OCCURRED WITH EVERY FILL SINCE I PURCHASED THE VEHICLE.  I INVESTIGATED ON-LINE AND WITH MY SERVICE DEPT AND SAW OTHERS ARE HAVING THE SAME ISSUE.  I ALSO SAW A CLASS ACTION SUIT.  I FILED A COMPLAINT WITH TOYOTA AS WELL.",
        "vin": "JTMRWRFVXLD"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/04/2020",
        "dateOfIncident": "02/22/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316139,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE FREEWAY IN OUR BRAND NEW 2020 TOYOTA RAV4 HYBRID WITH ONLY 5,000 MILES, ALL OF A SUDDEN THE SUNROOF EXPLODED ABOVE US -- SHATTERING GLASS FRAGMENTS UPWARDS AND OUTWARDS. OF COURSE, SOME MINOR FRAGMENTS LANDED UPON MY WIFE AND I -- BUT FOR THE MOST PART THE GLASS SHOT UPWARDS AND AWAY.  IT WAS AS THOUGH SOMEONE HAD FIRED OFF A LOUD SHOTGUN INSIDE THE CAR. AFTER REGAINING CONTROL OF THE CAR AND SEEING THE SUNROOF COMPLETELY SHATTERED I LOOKED BACK AND NOTICED THAT THERE WERE NO OVERPASSES AROUND FOR SOMEONE TO DROP A ROCK AND ONLY A HANDFUL OF OTHER VEHICLES TRAVELING TO THE RIGHT OF US GOING IN THE SAME DIRECTION.    WE GOOGLED THE CLOSEST TOYOTA DEALERSHIP AND DROVE 5 MILES TO JOHN ELWAYS CROWN TOYOTA.  THE SERVICE ADVISOR WHO LOOKED AT THE CAR JUST SHOOK HIS HEAD.  WHEN ASKED IF ANYTHING LIKE THAT HAS HAPPENED BEFORE -- HE REPLIED, \"NO.\"   I THEN LEFT THE CAR WITH THE DEALERSHIP SINCE THE INCIDENT HAPPENED ON A LATE AFTERNOON SATURDAY AND RENTED A RENTAL CAR FROM THEM.    THE SERVICE DEPT. FINALLY CONTACTED ME ON TUESDAY AFTERNOON TO INFORM ME THAT THE SUNROOF WAS NOT COVERED BY THE WARRANTY -- AND THAT I WOULD NEED TO PAY THEM $1,700 TO HAVE IT REPAIRED BY THE DEALERSHIP.    THIS IS A DEFINITE \"QUALITY CONTROL\" ISSUE OF TOYOTA'S -- AND FROM MY OWN RESEARCH HAVE FOUND NUMEROUS OTHER CUSTOMERS HAVING THE SAME SUNROOF EXPLOSION ISSUES OCCUR. BY NO MEANS SHOULD THIS PRODUCT DESIGN FAILURE AND GLASS SAFETY ISSUE BE IGNORED OR SHOULD EVER HAPPEN.  IT'S OUTRIGHT DANGEROUS.       AFTER MORE THAN A WEEK OF ENDLESS CONVERSATIONS, PROVIDING IMAGES, ETC.WITH THE CUSTOMER SERVICE FOLKS AT JOHN ELWAY'S DEALERSHIP AND TOYOTA HEADQUARTERS (PLANO, TX) THEY REFUSED TO HONOR THE WARRANTY REPAIRS -- AND ULTIMATELY LEFT ME HOLDING THE BAG TO REPLACE THE OBVIOUSLY DEFECTIVE WINDOW MYSELF.    THIS IS A 2020 RAV4 -- ONLY TWO MONTHS OLD. AGAIN, THIS SHOULDN'T HAPPEN.",
        "vin": "JTMEWRFVXLJ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/04/2020",
        "dateOfIncident": "02/21/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316172,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL TANK ACCEPTS BETWEEN 9.5 AND 10 GALLONS TOTAL FOR A REFILL, EVEN WHEN IT HAS THE LOW FUEL LIGHT LIT.  AFTER ADDING 9.5 GALLONS TO AN EMPTY TANK, THE FUEL GAUGE SHOWS FULL.  THE TANK SPECS CLAIM A 14.5 GALLON TANK.  THE VEHICLE ESTIMATES THE DISTANCE YOU CAN TRAVEL APPARENTLY ASSUMING A 14.5 GALLON TANK.  RELYING ON THE ESTIMATED DISTANCE YOU CAN DRIVE IS NOT A GOOD IDEA, YOU WILL END UP STRANDED.  THE FUEL TANK NOT ACCEPTING A FULL 14.5 GALLONS IS A PROBLEM.  THE SAFETY ISSUE COMES IN WHEN THE \"DISTANCE TO EMPTY\" IS SIGNIFICANTLY MISREPRESENTED, BEING OFF BY AS MUCH AS 140MILES RIGHT AFTER FILLING THE TANK AND DROPPING FASTER THAN WOULD MAKE SENSE GIVEN THE PROMINENTLY REPORTED MPG VALUE ON THE SCREEN.",
        "vin": "2T3DWRFV2LW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/01/2020",
        "dateOfIncident": "11/30/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315399,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE PURCHASING, THE VEHICLE WILL NOT ALLOW FOR FULL FILLING OF GAS TANK TO 14.5 SPECIFIED GALLONS.  THE REPORTED RANGE OF THE VEHICLE IS THEREBY REDUCED.  IN ADDITION, THE VEHICLE IS NOT ACHIEVING ANYWHERE NEAR ITS MFG SPECIFIED GAS MILEAGE OF 27/30/29.  THE MOST THE VEHICLE CAN ACHIEVE IS 22.4 MPG.",
        "vin": "2T3A1RFV9LC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/01/2020",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315482,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A NEW 2020 RAV4 XLE IN DECEMBER 2020, IT IS NOT EVEN 3 MONTHS OLD.  I PARKED MY RAV4 IN MY DRIVEWAY AFTER GETTING HOME FROM WORK.  THE FOLLOWING MORNING MY CAR HAD A DEAD BATTERY.  I HAD THE BATTERY JUMPED BY TOYOTA ROADSIDE SERVICE.  THE CAR STARTED UP, AND I WAS TOLD TO LET THE ENGINE RUN FOR ABOUT 45 MINUTES SO THE BATTERY COULD CHARGE.  THERE'S NOTHING I COULD HAVE LEFT TURNED ON THE EVENING BEFORE THAT WOULD HAVE RUN THE BATTERY DOWN. IF YOU LEAVE A LIGHT ON, OR A DOOR AJAR THE LIGHTS GO OUT AFTER 20 MINUTES.  THIS WAS NOT THE CASE. I DID AN INTERNET SEARCH ON TOYOTA RAV4 BATTERY PROBLEMS AND FOUND THAT THIS IS A COMMON ISSUE.",
        "vin": "2T3W1RFV5LW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/27/2020",
        "dateOfIncident": "12/27/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311871,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE'S FUEL TANK WILL NOT FILL TO THE ADVERTISED CAPACITY OF 14.5 GALLONS. STOPS AT APPROXIMATELY 10 GALLONS. THIS ISSUE IS KNOWN BY THE MANUFACTURER AND DEALERSHIPS ABOUT THE MODEL YEAR AND CONTINUES INTO THE NEW. THE BUYERS ARE NOT INFORMED OF THIS BEFORE THE SALE IS MADE. WHY ARE TOYOTA AND THEIR DEALERSHIPS BEING ALLOWED TO CONTINUE THIS DECEPTIVE BUSINESS PRACTICE?",
        "vin": "213DWRFVXLW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/25/2020",
        "dateOfIncident": "02/25/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311533,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE FUELING THE VEHICLE CAN ONLY PUT 10 GALLONS OF FUEL IN THE GAS TANK NO MATTER HOW EMPTY THE VEHICLE IS.",
        "vin": "2T3RWRFV8LW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/24/2020",
        "dateOfIncident": "02/20/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311222,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DOING MY FIRST FILL UP, MY GAS TANK WAS ONLY ABLE TO TAKE 11.19 GALLONS OUT OF THE 14.5-GALLON TANK AND THAT WAS AFTER DRIVING PAST WHEN THE REFUEL LIGHT HAD COME ON. THE RANGE OF THE TANK WAS THE PRIMARY REASON FOR PURCHASING THE RAV4 HYBRID AND UPON DOING MY RESEARCH I SEE THIS IS A PROBLEM FOR MANY RAV4 OWNERS. WITH A NEW 30 THOUSAND DOLLAR CAR HAVING THIS MUCH OF A FLUCTUATION IN ESTIMATED AND ACTUAL RANGE MEANS THAT THERE IS A DIFFERENCE OF OVER 100 MPG MISSING FROM THE RANGE. I DO NOT TRUST THE VEHICLE AND HOW IT REPORTS ITS INFORMATION AND DON'T FEEL COMFORTABLE ENOUGH TO TAKE A FAMILY TRIP AS I CAN'T TELL WHAT THE TRUE RANGE OF MY VEHICLE IS. IT IS STATED THAT TOYOTA IS LOOKING INTO THE ISSUE BUT THAT THEY SENT THE NOTICE OUT TO DEALERS AND SERVICE DEPARTMENTS, THIS SHOULD HAVE BEEN DISCLOSED BEFORE PURCHASING THE VEHICLE AND THIS IS NOT RIGHT AS FAR AS BUSINESS PRACTICES GO. ASIDE FROM THAT THE FACT THAT I DON'T GET TO FILL A FULL TANK THANK I PAID FOR BECAUSE OF THE SYSTEM OR DESIGN IS NOT OK. PLEASE HELP TO REMEDY THIS. I ALSO VIDEOTAPED MY FIRST TANK FILL UP WITH VIN EVIDENCE THAT THE VEHICLE IS MINE.",
        "vin": "2T3LWRFV9LW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/21/2020",
        "dateOfIncident": "02/21/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310579,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS TANK EITHER DOES NOT HOLD THE 14 GALLONS PROMISED OR DOES NOT ALLOW ALL FUEL TO BE USED.  TANK ONLY ACCEPTS APPROX 9 GALLONS ON FILLUP.  RANGE DISPLAYED ON DASH IS GREATLY DIMINISHED FROM PUBLISHED INFORMATION.",
        "vin": "2T3RWRFV5LW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/20/2020",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310277,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 RAV4 HYBRID XSE WILL NOT FILL TO A FULL TANK OF FUEL AFTER COUNTLESS REPEATED ATTEMPTS. THE OWNERS MANUAL STATES IT'S A 14.5 GALLON TANK AND ONCE THE LOW FUEL LIGHT COMES ON YOU SHOULD HAVE ABOUT 2.2 GALLONS OF RESERVE FUEL. I AM UNABLE TO GET EVEN CLOSE TO THE 12.3 GALLONS GIVE OR TAKE IT SHOULD NEED.  I CAN ONLY PUMP AROUND 9 GALLONS OF FUEL. THIS LEAVES ME WITH ONLY GETTING A RANGE OF 350+ MILES TO A TANK. ALSO THIS ISSUE WAS DISCOVERED IN 2019 AND NO ONE LET ME KNOW MY 2020 WOULD BE AFFECTED BY THIS WHEN PURCHASING. TOYOTA SHOULD HAVE MADE THIS CLEAR BECAUSE IT WOULD HAVE CHANGED MY DECISION. ALSO AFTER REPEATED ATTEMPTS AT THE DEALERSHIP THEY SAID THEY HAVE NO FIX FOR THIS ISSUE AT THE TIME.",
        "vin": "2T3EWRFVXLW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/19/2020",
        "dateOfIncident": "01/08/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310145,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "UNABLE TO FILL FUEL TANK TO ADVERTISED CAPACITY (14.5 GALLONS).  THIS IS A RECURRING ISSUE.  WHEN FUEL IS LOW INDICATED BY FUEL GAUGE AND DISTANCE TO EMPTY CALCULATION, NEARING EMPTY, I AM ONLY ABLE TO FILL 9.5-10.5 GALLONS MAX.",
        "vin": "JTMEWRFV9LD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/19/2020",
        "dateOfIncident": "12/13/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310155,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS FOR A 2020 RAV4 HYBRID, THE NTHSA SYSTEM SEEMS TO BE LUMPING THIS TOGETHER WITH THE REGULAR RAV4.     THE FUEL TANK HAS ISSUES ACCEPTING FUEL UP TO THE LEVELS SPECIFIED IN THE MANUAL OR THE CALIBRATION OF THE FUEL LEVEL SENSOR IS OFF. PER THE OWNERS MANUAL PROVIDED BY TOYOTA WHEN THE REFUEL LIGHT ILLUMINATES THE CAR HAS APPROXIMATELY 2.2 GALLONS OF FUEL REMAINING. WHEN THIS LIGHT ILLUMINATES I AM ONLY ABLE TO FILL THE CAR WITH 9-10 GALLONS OF FUEL. THE TANK CAPACITY IS 14.5 GALLONS SO THE CAR IS MISSING 2.3-3.3 GALLONS OF FUEL EVERY FILL UP. THE FUEL GAUGE DOES NOT READ FULL AT THIS POINT EITHER. TO GET THE MISSING FUEL INTO THE VEHICLE YOU CAN SLOWLY \"TOP OFF\" UNTIL THE CORRECT AMOUNT OF FUEL HAS BEEN ADDED BUT THIS BECOMES A SAFETY CONCERN AS THE PUMPS SAFETY MECHANISMS CONSTANTLY ENGAGE MAKING IT IMPOSSIBLE TO TELL WHEN THE TANK IS ACTUALLY FULL AND WHEN IT WILL BEGIN SPEWING OUT THE EXTRA FUEL ON TO THE GROUND.     I WATCHED THE FIRST FILL AT THE DEALERSHIP AND THIS DID NOT OCCUR. THE ISSUE SLOWLY PROGRESSED IN THE FOLLOWING FILLS AND NOW OCCURS DURING EVERY FILL.",
        "vin": "JTMDWRFV7LD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/19/2020",
        "dateOfIncident": "02/17/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310231,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "HAS PROBLEMS FILLING UP GAS TO THE FULL TANK",
        "vin": "2T3DWRFV0LW"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/17/2020",
        "dateOfIncident": "01/06/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309701,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE THE RAV4 LE BASE MODEL. IN THE FIRST 3 GEARS, TRANSMISSION JERKS A LOT DURING ACCELERATION, ALWAYS FEELING IT IS HAVING A HARD SHIFT. WHEN I PRESSED THE BRAKE PADEL PARTIALLY OR ROLLING STOP, THE CAR LURCHES, THIS IS PARTICULARLY DANGEROUS WHEN I MAKE TURNS, I FEEL THE CAR IS NOT STABLE. VERY DISAPPOINTED AT TOYOTA.",
        "vin": "2T3H1RFV2LW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/17/2020",
        "dateOfIncident": "11/15/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309704,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GAS TANK ON MY NEW TOYOTA RAV4 HYBRID, MODEL YEAR 2020 WILL NOT EVER FILL TO CAPACITY OR ANYWHERE NEAR IT. I PURCHASED IN NOVEMBER 2019. THE ADVERTISED RANGE OF THE CAR WAS OVER 500 MILES PER TANK AND MY RANGE IS ONLY 375 MILES TYPICALLY. AFTER A SEARCH ONLINE I SEE THIS IS A KNOWN PROBLEM EVEN BEFORE I PURCHASED THE CAR, YET I WAS NEVER INFORMED OF THE DEFECT OF THE TANK BY TOYOTA THAT IT WILL NOT FILL TO ANYWHERE NEAR THE STATED 14.5 GALLONS.",
        "vin": "JTMEWRFV6LD"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/15/2020",
        "dateOfIncident": "01/10/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309423,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "CONTINUATION, LOST WEBSITE.",
        "vin": "2T3RWRFV5LW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/15/2020",
        "dateOfIncident": "02/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309444,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS TANK DOES NOT FILL ALL THE WAY",
        "vin": "JTMEWRFV3LJ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/11/2020",
        "dateOfIncident": "01/29/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308400,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY CAR ON 12-21-19 WITH THE EXPLICIT SALES CLAIM THAT THE 2020 RAV4 HYBRID TANK HOLDS 14.5 GALLONS. I WAS PROMISED THAT I COULD DRIVE OVER 550 MILES ON ONE TANK OF GAS. HOWEVER, I HAVE HAD TO REFUEL MY CAR 3 TIMES ALREADY. EACH TIME WHEN MY CAR FUEL TANK EMPTY LIGHT TURNED ON, I COULD ONLY GET BETWEEN 10-10.8 GALLONS UNTIL IT'S 'FULL.'  I HAVE BEEN ABLE TO DRIVE ONLY 354-413 MILES ON A 'FULL' TANK OF GAS, A FAR CRY FROM THE 550 MILES PROMISED. I HAVE CONTACTED TWO DEALERSHIPS AND HAVE OPENED UP A CASE NUMBER WITH TOYOTA CORPORATION. THEY DENY EVER HAVING HEARD OF THIS PROBLEM AND DO NOT HAVE A FIX. DOING A QUICK SEARCH ONLINE PULLS UP COUNTLESS SIMILAR COMPLAINTS ABOUT THIS CAR ON CAR FORUMS. I ALSO LEARNED THAT A COUPLE OF CLASS ACTION LAWSUITS HAVE ALSO BEEN RECENTLY FILED.",
        "vin": "JTMRWRFV0LD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/11/2020",
        "dateOfIncident": "02/10/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308536,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STOPPED AT GAS STATION WITH FUEL GAUGE EMPTY.  CAR ADVERTISED AS HAVING A 14.5G FUEL TANK AND A RANGE OF 550+ MILES.  WHEN TANK IS EMPTY IT WILL ONLY ALLOW 10-10.5 GALLONS OF FUEL BEFORE FULL.  HAS EXHIBITED THIS BEHAVIOR ALL 4 TIMES BEING FILLED UP.  TOYOTA HAS NOT ADDRESSED THIS SINCE THE REDESIGNED 2019 MODEL YEAR AND CONTINUES TO SELL CARS WITH NO NOTIFICATION TO CUSTOMERS LEAVING THEM TO GUESS HOW MUCH FUEL IS LEFT OR, AT WORSE TRY TO OVERFILL TO CAPACITY.",
        "vin": "JTMDWRFV2LD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/07/2020",
        "dateOfIncident": "01/20/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307757,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2020 TOYOTA RAV4 HYBRID DOES NOT GET THE RANGE NOR FUEL TANK CAPACITY AS ADVERTISED BY TOYOTA. THE FUEL TANK IS SPECIFIED AS 14.7 GALLONS, BUT MAXIMUM THAT I AM ABLE TO PUT IN IS AROUND 12 GALLONS AFTER FUEL TANK IS COMPLETELY EMPTY. BEING ABLE TO PUMP EVEN THIS MUCH FUEL INTO THE TANK IS ONLY POSSIBLE AFTER MANY PUMP RESTARTS. THIS IS A BOTH A SAFETY AND ENVIRONMENTAL HAZARD AS I HAVE TO CIRCUMVENT THE AUTOMATIC PUMP STOP.",
        "vin": "2T3DWRFV1LW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/05/2020",
        "dateOfIncident": "12/14/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307182,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ACTUAL FUEL TANK CAPACITY OF THE 2019-2020 RAV4 HYBRIDS DO NOT MATCH THE ADVERTISED CAPACITY. THE AVERAGE AMOUNT OF FUEL THAT HAS BEEN ABLE TO ENTER THE TANK WHEN THE GAUGE SHOWS NEARLY EMPTY IS 9-11 GALLONS IF UNSAFE FUELING PRACTICES ARE USED. THE FUEL NOZZLE FROM THE PUMP MUST BE PULLED OUT FROM THE VEHICLE TO PREVENT IT FROM SHUTTING OFF WHILE REFUELING.",
        "vin": "JTMDWRFV0LD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/04/2020",
        "dateOfIncident": "02/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306912,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL FILLING SHUTS OFF WHEN AT GAS PUMP.  TANK NOT CAPABLE OF FILLING TO TOYOTA SPEC GALLON CAPACITY (14.5).  MAXIMUM 10.5 GALLONS.  GREATLY REDUCING OVERALL MILEAGE AND POSING SAFETY RISK WHEN MANUALLY TOPPING OFF GAS TANK.",
        "vin": "2T3RWRFV9LW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/03/2020",
        "dateOfIncident": "02/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306715,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 TOYOTA RAV4. THE CONTACT STATED WHILE DRIVING ABOUT 5 MPH THE BRAKES FAILED. NO WARNING LIGHTS ILLUMINATED PRIOR TO THE FAILURE. THE CONTACT DEPRESSED THE BRAKES 3-4 TIMES AND VEHICLE SUDDENLY ACCELERATED AND CRASHED INTO PARKED VEHICLE. PRIOR TO THE CRASH A WITNESS SAID THE BRAKES MADE AN ABNORMAL NOISE. THE DAUGHTER ALSO HEARD A NOISE. A POLICE REPORT WAS FILED. THE VEHICLE DID CRASH INTO THE VEHICLE IN FRONT OF HER. THE AIR BAGS DID NOT DEPLOY.  THE CRASH OCCURRED FEB 3, 2020. THE APPROXIMATE FAILURE MILEAGE WAS 1300.  *DT*JB *BF*JB",
        "vin": "JTMEWRFV9LJ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/03/2020",
        "dateOfIncident": "11/22/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306892,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2020 TOYOTA RAV4 HYBRID XSE HAS A FAULTY FUEL TANK.  TOYOTA ADVERTISED THAT THE TANK IS 14.5 GALLONS. WE ARE ONLY ABLE TO FILL ABOUT 10 GALLONS.",
        "vin": "2T3EWRFV9LW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/01/2020",
        "dateOfIncident": "01/04/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306432,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE LOW FUEL LIGHT COMES ON (IN THE MANUAL INDICATES THERE'S ABOUT 2.2 GALLONS LEFT IN THE TANK), I CAN PUMP ABOUT 9 GALLONS OF FUEL INTO THE TANK TO THE FIRST CLICK-OFF FROM THE GAS PUMP.  SO, FOR A 14.5-GALLON TANK WITH A *2.2-GALLON RESERVE I SHOULD BE ABLE TO PUT ABOUT 12 GALLONS IN WHEN I FUEL UP, NOT 9 GALLONS.  THE FUEL GAUGE WILL NOT SHOW FULL WHEN FUELING AND THE PUMP FIRST CUTS OFF, IT'S BETWEEN 3/4 AND FULL.  THE DTE (DISTANCE TO EMPTY) WILL SHOW ABOUT 410 MILES AT THIS POINT.  IT IS NOT POSSIBLE TO FILL THE TANK TO IT'S STATED CAPACITY.  THIS HAS BEEN CONFIRMED BY A TECHNICIAN AT THE DEALERSHIP WHERE I PURCHASED THE VEHICLE.  TOYOTA INDICATED TO THE TECHNICIAN THAT THERE IS NO FIX.  TOYOTA IS CONTINUING TO SELL THE RAV4 HYBRIDS WITH DEFECTIVE GAS TANKS.",
        "vin": "2T3DWRFV3LW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/31/2020",
        "dateOfIncident": "10/20/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306380,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA ADVERTISED AND SOLD THE CAR WITH 14.5 GALLON TANK, BUT I CANNOT FILL MORE THAN 10 GALLONS BEFORE THE PUMP SHUTS OFF AUTOMATICALLY, AND I DO NOT GET THE RANGE THAT IS ADVERTISED.",
        "vin": "2T3RWRFV2LW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/29/2020",
        "dateOfIncident": "01/05/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302911,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GAS TANK OF MY 2020 RAV4 HYBRID IS NOT FILLING PROPERLY. THE TANK IS SUPPOSED TO BE 14.5 GALLONS. MY FUEL GAUGE WILL READ JUST ABOVE EMPTY AND MY DISPLAY SAYS THAT I HAVE 29 MILES TO EMPTY. WHEN I GO TO FILL-UP MY TANK, THOUGH, IT CUTS OFF AFTER ROUGHLY 8.6 - 9 GALLONS. IF IT WAS TRULY ALMOST EMPTY, THIS IS WAY SHORT OF THE AMOUNT OF GAS THAT IT WILL TAKE TO FILL-UP MY TANK. WHEN I TURN THE CAR BACK ON, MY GAS GAUGE READS BETWEEN 3/4 AND FULL. BETWEEN FILL-UPS, I CAN ONLY DRIVE ABOUT 380 MILES. TOYOTA ADVERTISES ABOUT 580 MILES BETWEEN FILL-UPS. THIS HAS HAPPENED EVERY TIME I FILL-UP AND AT DIFFERENT GAS STATIONS.",
        "vin": "JTMRWRFV3LD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/28/2020",
        "dateOfIncident": "01/27/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302474,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GAS TANK WILL NOT COMPLETELY FILL AT THE GAS STATION. WHEN THE GAS LIGHT COMES ON AND SHOWS THAT IT IS EMPTY, I WILL GO TO THE GAS STATION AND IT WILL ONLY ALLOW ME TO FILL UP ABOUT 9-10GALLONS OF GAS. THE GAS TANK IS LISTED AS BEING 14.5GALLONS. THEREFORE, THE REPORTED GAS MILEAGE THAT WAS EXPECTING TO GET FROM THIS CAR IS EXTREMELY UNDER RATED AND INCORRECT. I CAN SLIGHTLY SQUEEZE THE GAS HANDLE AND PUT MORE FUEL IN THE TANK BUT I RUN THE RISK OF POTENTIALLY OVERFILLING AND SPILLING FUEL ON THE GROUND. THIS IS EXTREMELY FRUSTRATING.",
        "vin": "2T3DWRFV5LW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/27/2020",
        "dateOfIncident": "12/02/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302202,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL TANK WILL ONLY ACCEPT LESS THAN 10 GALLONS OF FUEL. THE STATED CAPACITY OF THE FUEL TANK BY TOYOTA IS 14.5 GALLONS. THIS DEFECT CAUSES AT LEAST TWO PROBLEMS: THE MARKETED RANGE OF THE VEHICLE IS MARKEDLY DIMINISHED, AND THE FUEL GAUGE GIVES FALSE, MISLEADING INFORMATION TO THE POINT YOU NEVER KNOW HOW MUCH FUEL IS LEFT. THESE ARE SAFETY ISSUES BECAUSE YOU DO NOT KNOW FOR SURE WHEN AND WHERE YOU WILL RUN OUT OF FUEL.",
        "vin": "JTMEWRFV4LJ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/24/2020",
        "dateOfIncident": "01/24/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301745,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA ADVERTISES CAR WITH 14.5 GALLONS OF GAS WITH 590 MPG RANGE AND FUEL TOPS OFF AT 10 GALLONS ONLY.",
        "vin": "2T3LWRFV4LW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/20/2020",
        "dateOfIncident": "01/20/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300607,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL GAUGE DOES NOT PROPERLY REGISTER CORRECT FUEL AMOUNT IN VEHICLE. IT IS SHOWING EMPTY WITH ABOUT 4.5 GALLONS LEFT IN FUEL TANK. DEALERSHIP REFUSES TO ADMIT THERE IS AN ISSUE AND TRIES TO BLAME IT ON ETHANOL FUEL ADDITIVES....",
        "vin": "2T3RWRFV3LW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/15/2020",
        "dateOfIncident": "12/18/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299574,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TOLD MY TOYOTA RAV4 HYBRID HAS A 14.5 GALLON GAS TANK. EVEN WHEN FILLING UP WHEN THE GAS LIGHT TURNS ON, I AM BARELY ABLE TO FILL 10 - 11 GALLONS.  UPON FILL-UP, THE SYSTEMS SHOW 520 MILES (EXAMPLE) TO EMPTY BUT WITHIN 20 MILES OF DRIVING THE BALANCES RUNS DOWN TO UNDER 450.",
        "vin": "2T3RWRFV4LW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/15/2020",
        "dateOfIncident": "01/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299594,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE'S FUEL TANK CAPACITY IS 14.5 GALLONS.  WHEN THE FUEL GAUGE ON THE DASH SHOWS 1/8 OF A TANK, I CAN ONLY ADD 9-10 GALLONS OF FUEL BEFORE THE FUEL PUMP CLICKS OFF.  AT A FUEL TANK LEVEL OF 1/8, I SHOULD BE ABLE TO PUT 12-13 GALLONS OF FUEL IN THE TANK.  THERE IS NOT A SAFETY ISSUE HERE, BUT I'M NOT ABLE TO GET THE DRIVING RANGE ON A TANK OF FUEL THAT I WAS EXPECTING WHEN I PURCHASED THE VEHICLE.  I SHOULD BE GETTING A RANGE IN EXCESS OF 500 MILES PER FILL UP, BUT I'M ONLY GETTING AROUND 400.",
        "vin": "2T3DWRFVXLW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/09/2020",
        "dateOfIncident": "01/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298061,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 RAV4 XLE HYBRID. FUEL GAUGE SHOWS EMPTY WHEN ONLY APPROXIMATELY 10 GALLONS OF THE 14.5 GALLON TANK HAVE BEEN USED.  THIS LEADS TO GETTING FAR LESS RANGE FROM A TANK OF GAS THAN THE VEHICLE SHOULD OR IS ADVERTISED TO GET.  WHEN YOU FILL THE TANK THE COMPUTER FIRST ESTIMATES OVER 500 MILE RANGE BUT THEN QUICKLY DROPS AND ACTUAL RANGE YOU GET IS MORE THAN 100 MILES LESS DUE TO THE FUEL TANK PROBLEM.",
        "vin": "2T3RWRFV7LW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/30/2019",
        "dateOfIncident": "12/25/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11292178,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE INDICATES FUEL EMPTY (GAS GAUGE AND WARNINGS) AFTER APPROX 350 MILES. FUEL TANK SUPPOSED TO BE 14.5 GAL., BUT TANK ONLY ACCEPTS 9-10 GALLONS FUEL BEFORE SHUTOFF. 1 FULL TANK FROM DEALER PLUS 1 FILL-UP WITH SAME RESULT. VEHICLE ALSO ONLY AVERAGING 36 MPG AFTER 2 TANKS MOSTLY HIGHWAY & NOW INTO 1 TANK MIXED CITY/HIGHWAY (TOYOTA INDICATES 38 HIGHWAY/40 CITY).    EITHER FUEL TANK IS DEFECTIVE/CAPACITY IS INACCURATE, GAUGES/COMPUTER/WARNINGS ARE DEFECTIVE, OR BOTH?",
        "vin": "JTMDWRFV0LD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/28/2019",
        "dateOfIncident": "11/11/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291750,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS LIGHT COMES ON AFTER THE CAR HAS CONSUMED ~10 GALLONS. THE VEHICLE IS ADVERTISED HAVING 14.5 GALLON TANK WITH 580 MILE TRIP.",
        "vin": "2T3EWRFV3LW"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/27/2019",
        "dateOfIncident": "11/26/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282630,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE VIEW MIRRORS ON BOTH DRIVER AND PASSENGER SIDE SHAKING WHEN ON HIGHWAY SPEED",
        "vin": "2T3EWRFV7LW"
    }
]