[
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/31/2022",
        "dateOfIncident": "12/28/2019",
        "fire": false,
        "manufacturer": "Zero Motorcycles Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449555,
        "products": [
            {
                "manufacturer": "Zero Motorcycles Inc.",
                "productMake": "ZERO",
                "productModel": "FX",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Zero FX Motorcycle. The contact stated while riding 45 MPH, the motorcycle inadvertently lost electrical power and stalled. The contact was able to veer to the side of the road. The overheating warning light was illuminated. The motorcycle was towed to the dealer who diagnosed that the engine needed to be replaced. The contact stated that the motorcycle was repaired under a manufacturer’s extended warranty; however, the failure reoccurred while riding. The motorcycle was towed to the same dealer who reprogrammed the computer software; however, the failure persisted, and the vehicle would reverse instead of going forward as intended. The motorcycle was towed to the dealer who replaced the engine for the second time; however, the failure reoccurred. The contact stated that the sprocket was fractured, and the motorcycle chain was loose. The motorcycle was towed to the dealer who replaced the engine a third time. The contact stated that the motorcycle would not start. The contact noticed that one of the two batteries was defective and that the motorcycle would start after removing the defective battery. The motorcycle was taken to the dealer who refused to replace the battery under the warranty and suggested that the contact had damaged the battery. The manufacturer was notified of the failure but provided no assistance. The motorcycle was not repaired. The failure mileage was approximately 1,219.",
        "vin": "538xxdz40lc"
    }
]