[
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "04/01/2022",
        "dateOfIncident": "03/27/2022",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459221,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Volkswagen Tiguan. The contact stated that while driving approximately 45 MPH, the Forward Collision Avoidance system and Forward Collision Avoidance Automatic Emergency  braking engaged. The brake warning light was illuminated on the instrument panel. The failure reoccurred three times. The vehicle was taken to the independent mechanic who was unable to retrieve a fault code. The vehicle was not repaired. The contact requested that the dealer notify the manufacturer of the failure. The approximate failure mileage was 17,000.",
        "vin": "3VV2B7AX8LM"
    },
    {
        "components": "ELECTRICAL SYSTEM,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/18/2022",
        "dateOfIncident": "10/01/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457353,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Emergency breaking activate when passing construction zone or taking curves on the road and sensors reads barriers or cones and locks the breaks and emergency breaking warning comes on dashboard.  Horn not functioning in high humid climates",
        "vin": "3vv1b7axxlm"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/09/2022",
        "dateOfIncident": "03/09/2022",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455800,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Water coming in through sunroof and pooling in the back seat foot pans. Only reason I was aware was first because someone with the same vehicle told me it happened to them and second I began to see moisture and ice on the inside of the windshield. Also began to have a mold odor. This lead to corrosion of the floor pans and damage to electrical wiring. Unknown what other long term damage could be caused.",
        "vin": "3vv2b7ax2lm"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE,FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "01/01/2022",
        "dateOfIncident": "12/31/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445800,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Unknown",
        "vin": "3VV3B7AX9LM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/22/2021",
        "dateOfIncident": "07/21/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426054,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "Complete engine stoppage approximately 18:00 21 July 2021.  Headed east on Germany Road, a serpentine two lane road with no shoulder.  Engine stopped and vehivle coasted to a stop.  I turned on the emergency lights and put the vehicle in park.  Fortunately, I was able to restart the car and proceed.  It was pure luck that I wasn't rear-ended.",
        "vin": "3VV2B7AX4LM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/15/2021",
        "dateOfIncident": "07/01/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425001,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "On three separate occasions the power steering unit lost power, after restarting the car it would work again.",
        "vin": "3VV2B7AX4LM"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/24/2021",
        "dateOfIncident": "06/20/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422103,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SIDE REAR SEAT BELT, BEING USED WITH HIGH-BACK CHILD BOOSTER CAR SEAT (GRACO),LOCKED UP WITH CHILD IN THE CAR SEAT. THE SEAT BELT WOULD NOT RELEASE AND GOT TIGHTER AS THE CHILD TRIED TO RELEASE IT. ADULTS COULD NOT RELEASE THE BELT OR REMOVE CHILD FROM THE CAR SEAT. THE SEATBELT HAD TO BE CUT TO REMOVE THE CHILD. THE CAR SEAT HAS BEEN IN USE IN VARIOUS OTHER VEHICLES (HONDA, FORD, SUBARU AND AUDI) WITHOUT INCIDENT.",
        "vin": "3VV2B7AX9LM"
    },
    {
        "components": "ENGINE",
        "crash": true,
        "dateComplaintFiled": "06/22/2021",
        "dateOfIncident": "06/14/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11421878,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact's fiancé owned a 2020 Volkswagen Tiguan. The contact stated while his fiancé was driving 30 mph when the steering wheel and the entire vehicle began to shake. The contact stated the Electronic Throttle Control warning light was illuminated. The driver was distracted by the failure, which caused her to run a red light and crash into another vehicle. All front and side air bags deployed. The driver did not sustain any injuries or seek medical attention. The contact stated his mother was seated at the rear driver side and did sustain injuries on both of her knees and sought medical attention on the day of the accident and also the following day. The contact stated unknown person in the other vehicle sustain also injuries on their knee. A police report was filed. The insurance company deemed the vehicle totaled. The vehicle was towed to the insurance lot. The contact called the local dealer and was made aware of the failure. The manufacturer had not been informed of the failure. The failure mileage was approximately 7,139.",
        "vin": "3VV3B7AX0LM"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/14/2021",
        "dateOfIncident": "05/29/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420847,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "One of the fuel injectors cracked along with the fuel rail leading to a very large fuel leak. There was also an oil leak at the same time, but the origin has not been diagnosed. The vehicle was towed to the dealership to diagnose the problem and attempt repair. There were no warning lights, signs, or symptoms. I started the vehicle and drove approximately 20 ft to a stop sign, going under 10 mph, and all of a sudden smelled an extreme odor of gasoline. The check engine and other driver alerts came on.",
        "vin": "3VV2B7AX0LM"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "05/24/2021",
        "dateOfIncident": "05/21/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11418306,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2020 Volkswagen Tiguan. The contact stated while parking the vehicle when it accelerated independently and crashed into 2 different vehicles. The contact stated no warning light was illuminated. The contact stated she had visible bruises on her sternum, right thumb, and upper left chest from the seat belt. Airbags did not deploy. The contact did seek medical attention the next day. A police report was filed. The vehicle was not drivable. The vehicle was towed to an independent mechanic and was unable to diagnose the failure. The vehicle was not repaired. A dealer was contacted. The manufacturer had been informed of the failure. The failure mileage was approximately 1,700.   THE CONSUMER STATED THE VEHICLE WAS BEING REPAIRED.",
        "vin": "3VV2B7AX4LM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/10/2021",
        "dateOfIncident": "03/04/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415833,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS BACKED OUT OF A PARKING SPACE IN A LOT. A POP WAS HEARD AND THE BRAKE THE BRAKE PEDAL WENT TO THE FLOOR AND EVENTUALLY STOPPED. THE INSTRUMENT PANEL SHOWED FAULTY BRAKE BOOSTER. I HAD VW TOW THE VEHICLE TO THE DEALERSHIP AND THEY ORDERED A NEW BRAKE BOOSTER AND REPLACED IT. ON MAY 7, 2021 THE SAME SYMPTOM HAPPENED AND I CONTACTED THE DEALERSHIP AND THEY AGAIN TOWED THE VEHICLE TO THEIR LOCATION. I AM WAITING FOR A CALL FROM THE DEALERSHIP ON THE DIAGNOSIS.",
        "vin": "3VV1B7AX9LM"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "05/08/2021",
        "dateOfIncident": "07/15/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415672,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WILL STOP ITSELF WHILE IN MOTION THROUGH THE AUTOMATIC BRAKING SYSTEM AT RANDOM TIMES, BOTH IN TRAFFIC AND WHEN NO OTHER VEHICLES ARE AROUND. THE WARNING WILL SHOW UP IN THE GAUGE CLUSTER AND THE CAR WILL QUICKLY COME TO A STOP.     THIS HAS HAPPENED ON AT LEAST 4 OCCASIONS. THE DEALER HAS STATED THERE ARE NO FAULTS.",
        "vin": "3VV4B7AXXLM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/17/2021",
        "dateOfIncident": "11/16/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403580,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT A NEW 2020 VW TIGUAN IN JULY OF 2020 IN MARYLAND AND IN OCT 2020 MY CAR STARTED TO STINK LIKE MILDEW FROM THE BAD MOONROOF DRAINS THAT DRAINED RAINWATER INTO MY CAR. I HAVE TAKEN IT TO THE DEALERSHIP 2 TIMES TO HAVE THE CARPETS AND FLOOR MATS REPLACED AND IT STILL STINKS. I TOOK IT TO A PREMIER DETAILING COMPANY TO DO AN EXTREME OZONE AND INTERIOR DETAILING, STILL STINKS (STILL OWED REIMBURSEMENT FOR THIS FROM VW). THE DETAILING PROFESSIONAL OF 20 YEARS AT THE PREMIER DETAILING SHOP SAYS THIS KIND OF MILDEW ODOR CANNOT BE REMOVED. I AM TRYING TO GET THIS LOOKED AT FOR A THIRD TIME AT A VW DEALER BUT AM GETTING THE RUNAROUND FROM THE SERVICE MANAGER WHO SAYS THEY WILL NOT LOOK AT IT UNLESS VW PREAUTHORIZES IT. THIS FALL UNDER MARYLAND LEMON LAW AND I GUESS VW IS TRYING TO AVOID ME TAKING THEM TO COURT. I AM LOOKING FOR MY MONEY BACK FROM VW OR FOR THEM TO PUT ME INTO ANOTHER VEHICLE AND THEY ARE JUST GIVING ME THE RUNAROUND. VW KNEW OF THIS ISSUE ON MY MODEL WHEN THEY SOLD THIS CAR TO ME BUT VW REFUSES TO PUT A RECALL OUT ON THIS THOUGH HUNDREDS OF TIGUAN'S WITH MOONROOFS ARE AFFECTED. MY BEST FRIEND HAS A SEVERE MOLD/MILDEW ALLERGY AND SHE WILL NOT BE ABLE TO GET INTO MY CAR, A FRIEND HAS ALREADY HAD AN ASTHMA ATTACK IN THE CAR, AND I AM CONCERNED OF THE LONG TERM AFFECTS THE MILDEW IN THE CAR IS HAVING ON MY HUSBAND AND I SINCE THIS IS THE ONLY VEHICLE WE HAVE.",
        "vin": "3VV2B7AX3LM"
    },
    {
        "components": "UNKNOWN OR OTHER,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/26/2021",
        "dateOfIncident": "02/25/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398000,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE'S FRONT ASSIST COLLISION SENSOR WILL ENGAGE ITSELF WHILE GOING DOWN SOME DRIVEWAYS REGARDLESS OF HOW SLOW OR ANGLED I TRY TO EXIT (I ALWAYS MAKE SURE THAT MY EXIT AND TURNS ARE SAFE FROM ANY ONGOING TRAFFIC SO THE SENSOR IS ONLY BEING TRIPPED FROM GROUND IN FRONT OF THE SENSOR). I HAVE BEEN ALMOST BEEN REAR ENDED THREE TIMES BECAUSE OF THIS AND ALMOST HIT FROM THE SIDE WHEN THE THE SENSOR ENGAGED WHEN I WAS MORE THAN HALFWAY OUT INTO THE FIRST LANE TO MAKE MY TURN.    VW DEALER THAT I BOUGHT THE CAR FROM SAID, IT IS THE DRIVER'S RESPONISBILITY TO MANUALLY TURN OFF THE FRONT ASSIST COLLISION SENSOR EACH AND EVERY TIME YOU INTEND TO DRIVE THE CAR.",
        "vin": "3VV4B7AX2LM"
    },
    {
        "components": "SUSPENSION,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/30/2020",
        "dateOfIncident": "10/12/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385558,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE BEGAN TO FAIL WHILE PARKED, THE CHECK ENGINE AND EPC LIGHTS CAME ON. IT BEGAN TO FAIL AS IF IT HAD NO STRENGTH. ON DECEMBER 23, THE DEALER WAS TAKEN FOR THE THIRD TIME DUE TO THE SAME PROBLEM, THE FIRST TIME THEY TOLD US THAT IT WAS GASOLINE (PUMA) THAT THAT BRAND COULD NOT BE USED, THEY CHANGED THE BRAND TO SHELL AND CONTINUED WITH THE PROBLEM. BEFORE THIS HAPPENED, THE DELER MADE US A RECALL OF SOMETHING AND AFTER THIS IT WAS THAT THE FAILURES BEGAN. THE BUS ONLY HAS 3,500 MILES. THE LAST THING THEY TOLD US THAT WHAT IS DAMAGED IS THE EVAPORATOR TODAY IS DECEMBER 30 AND THEY HAVE NOT RETURNED THE VEHICLE TO ME.     THE PASSENGER SIDE OF THE SUSPENSION SOUNDS WHEN YOU GET A BUMP OR A HOLE IN THE ROAD AND TELL US THAT IT IS NORMAL IN THE VEHICLE.",
        "vin": "3VV3B7AX7LM"
    },
    {
        "components": "UNKNOWN OR OTHER,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "11/04/2020",
        "dateOfIncident": "06/12/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372963,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR ALERTS ME AT RANDOM TIMES WHEN I AM DRIVING DOWN OPEN WINDING ROADS THAT I AM GOING TO GET IN A COLLISION WHEN THERE ARE NO CARS OR OTHER VEHICLES ON THE ROAD.  IT ALSO GOES OFF WHEN I'M DRIVING THROUGH CONSTRUCTION AND THERE'S CONES ON THE SIDE OF THE ROAD BUT I'M NOT EVEN CLOSE TO HITTING.  IN MICHIGAN, WE HAVE A LOT OF CONSTRUCTION SO IT SHOULDN'T BE GOING OFF AND SCARING ME ALL THE TIME.  IT WILL ALSO HAPPEN IN SPURSE, SO IT'LL GO OFF THREE OR FOUR TIMES ON THE SAME ROAD IN THE SAME DAY AND THEN NOT GO OFF AGAIN FOR WEEKS.  I'VE TAKEN IT IN TO THE DEALER TWICE TO BE LOOKED AT AND BOTH TIMES THEY FOUND NOTHING WRONG.  IT CONTINUES TO RANDOMLY ALERT BE WHEN I AM NOT IN DANGER OF AN ACCIDENT BUT IT ENDS UP SCARING ME ANYWAYS AND MAKING ME THINK I'M ABOUT TO BE HIT.  IT HAS GONE OFF ON THE HIGHWAY, OPEN ROADS, CITY STREETS, AND CONSTRUCTION ZONES.  THANKFULLY THE AUTO-BREAKING HASN'T TURNED ON BUT I'M ALSO CONCERNED IT WILL AND THEN THAT ITSELF WILL CAUSE AN ACCIDENT.  I BELIVE WHATEVER SENSOR IT USES IS FAULTY, BUT AGAIN THE DEALERSHIP HAS REAFFIRMED BE TWICE THAT THEY SAW NO ISSUES WITH IT.",
        "vin": "3VV2B7AX2LM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/20/2020",
        "dateOfIncident": "10/20/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365341,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES STARTING SQUEALING PERIODICALLY WHEN APPLYING THE BRAKES LIGHTLY, WITH ONLY 1,000 MILES ON THE VEHICLE. TOOK THE VEHICLE BACK TO THE DEALERSHIP AND THEY SAID IT WAS NORMAL. BRAKES NOW SQUEALING NEARLY ALL THE TIME WHEN BRAKES APPLIED LIGHTLY, NOT SO MUCH IF BRAKING HEAVILY.  VEHICLE HAS 5,000 MILES ON IT. HAD ANOTHER VW DEALERSHIP LOOK AT IT AND THEY SAID THE SAME THING, IT IS NORMAL AND NOT A SAFETY ISSUE. HANDED A BROCHURE TO CONVINCE ME IT OK.",
        "vin": "3VV3B7AX8LM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/05/2020",
        "dateOfIncident": "10/05/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362849,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CHANGE OIL SERVICE LIGHT CAME ON AND KEPT REMINDING ME DAILY FOR 10 DAYS THAT I NEEDED AN OIL CHANGE.  I TOOK IT TO THE LOCAL DEALERSHIP TODAY AND THEY SAID THEY WOULD ONLY CHANGE THE OIL AT 10,000 MILES. I ONLY HAD 5800 MILES BUT THE OIL WAS LOW SO THEY ADDED OIL.  I HAVEN'T EVEN HAD THE CAR 6 MONTHS.  WHAT IS WRONG WITH THE NEW ENGINES OR SHOULD THE OIL REALLY BE CHANGED AT 6000 MILES?   I SHOULD NOT BE HAVING ISSUES WITH A BRAND NEW VEHICLE.  SOMETHING NEEDS TO BE DONE BY VOLKSWAGEN TO CORRECT THIS ISSUE.",
        "vin": "3VV3B7AX6LM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/21/2020",
        "dateOfIncident": "07/29/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360270,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT CAR ON 4/6/ 2020 BRAND NEW AT 2600 MILES OIL LITE CAME ON  I CHECKED AND IT NEEDED 1 QUART.I WENT TO DEALER THEY CHECKED IT AND ADDED 1 QUART AND TOLD ME TO COME BACK WHEN IT HAPPENS AGAIN . I CHECK IT EVERY WEEK AND NOW 9/21/20 IT IS ADD THE ADD POINT ON THESTICK  ODOMETER NOW AT 3800 MILES. THIS HIGH CONSUMPTION IS TO MUCH.THE LIGHT HAS NOT COME ON YET BUT I DONT LIKE RUNNING IT DOWN TO THE BOTTOM OF THE STICK. I HAD A 2019 TIGUAN AND IT NEVER NEEDED OIL AND HAD OVER 8000 MILES ON IT.I BELIEVE THEY MADE CHANGES TO THE ENGINE AND IM NOT HAPPY WITH IT .THEY NEED TO DO SOMETHIG ABOUT IT SOON. I ALSO HAD A 2014 PASSAT THAT NEVER USED OIL.  NO HELP FROM DEALER EXCEPT TO PUT A QUART IN.QUIRK  VW QUINCY MA",
        "vin": "3VV2B7AX3LM"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "09/18/2020",
        "dateOfIncident": "09/17/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11359751,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2020 VOLKSWAGEN TIGUAN. THE CONTACT STATED WHILE DRIVING AT 40 MPH, THE AUTOMATIC EMERGENCY BRAKING ENGAGED WITHOUT WARNING. THE VEHICLE CAME TO A COMPLETE STOP. THE CONTACT PULLED OVER TO THE SIDE OF THE ROAD WAITED FOR A MINUTE THEN DROVE TO HIS DESTINATION WITH NO FURTHER ISSUES. THE CONTACT CALLED JOE HEIDT MOTORS VOLKSWAGEN (515 RT 17 N, RAMSEY, NJ 07446, (201) 327-2900) AND WAS INFORMED TO HAVE THE VEHICLE DIAGNOSED IMMEDIATELY. THE DIAGNOSTIC TEST WAS STILL PENDING. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 7,722.",
        "vin": "3VV0B7AX3LM"
    },
    {
        "components": "WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/02/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352690,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "GOOD EVENING, I WOULD LIKE TO KNOW THE BEST PERSON TO COMMUNICATE WITH REGARDING THE DISCREPANCIES I HAVE RECENTLY FOUND ON MY TITLE, REGISTRATION, AND INSPECTION FORM. MY NAMES SEEM TO BE INCONSISTENT ON THE  FORMS. THE INSPECTION FORM ALSO INDICATES THAT THE LEFT WHEEL AND RIGHT WHEEL HAVE BEEN REMOVED ACCORDING TO THE INSPECTION FORM. THERE IS ADDITIONAL INFORMATION THAT MAY HELP INVESTIGATE THIS MATTER. PLEASE FEEL FREE TO E-MAIL ME AT YOUR EARLIEST CONVENIENCE AT [XXX] THANK YOU AND I LOOK FORWARD TO SPEAKING WITH YOU.    [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "3VV2B7AX7LM"
    },
    {
        "components": "WHEELS",
        "crash": true,
        "dateComplaintFiled": "08/03/2020",
        "dateOfIncident": "07/27/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343022,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR IS NOT EVEN 6 MONTHS OLD AND WHILE DRIVING ON A HIGHWAY THE TIRE BLEW, MY CAR FISHTAILED AND I HIT A GUARDRAIL. THE TIRE IS SHREDDED. I TOOK IT TO A TIRE SHOP THE SAME NIGHT AND THEY SAID THIS IS NOT WHAT TYPICALLY HAPPENS TO A TIRE.",
        "vin": "3VV3B7AX5LM"
    },
    {
        "components": "SEAT BELTS,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/13/2020",
        "dateOfIncident": "07/10/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339072,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "SEATBELTS ARE WET AND MOISTURE IS BUILDING UP IN THE CAR AFTER HEAVY RAIN WHILE SUNROOF AND ALL DOORS CLOSED AND CAR IS PARKED. POSSIBLY A SUNROOF DRAINING ISSUE. SEATBELTS MAINLY AFFECTED ARE IN THE REAR, PARTICULARLY REAR-PASSENGER - BUT FRONT BELTS AFFECTED ALSO. WATER ALSO OBSERVED IN REAR DOOR WELLS AND ON FRONT DRIVER'S WINDOW POST (LEFT OF WINDSHIELD).  SEATBELTS SMELL DAMP AND ARE SO WET THAT THEY ARE UNCOMFORTABLE TO WEAR AND WOULD LEAVE WATER ON CLOTHES,",
        "vin": "3VV2B7AXXLM"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/13/2020",
        "dateOfIncident": "03/31/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328653,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "EMERGENCY CONTACT FUNCTION DOES NOT WORK, I HAVE BEEN PAYING FOR THE SUBSCRIPTION. MULTIPLE TICKETS HAVE BEEN PLACED WITH VW CARNET OFFICE FOR MONTHS AND HAVE NOT HELP.  *TR",
        "vin": "3VV0B7AX4LM"
    }
]