[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/28/2022",
        "dateOfIncident": "02/28/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454577,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "When driving my car down the street today, it abruptly stopped in the middle of the street and and engine locked up. I could not shift gears. I could not put my car in neutral. I was literally stuck in the middle of the street with a vehicle that gave me no warning of malfunctioning. This is the 3rd transmission that I have had in this car. It is a 2021 Buick Enclave with just over 12,000 miles.",
        "vin": "5GAERBKWXMJ"
    },
    {
        "components": "STEERING,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "08/28/2021",
        "dateOfIncident": "07/17/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430863,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "This car crosses the line before the lane keep assist does anything. The car nearly hit an oncoming car. I asked the Koons Tysons Buick Service rep about it and he said he has heard this from a number of people but noting has been done. It seems like a software patch is necessary to make this safe.",
        "vin": "5GAEVCKW2MJ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/25/2021",
        "dateOfIncident": "08/23/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430512,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Brakes started grinding at 1000 miles. I will filed a complaint with the dealership and hope they record it. Now I have approximately 2100 miles on the car and it continues to sound and feel like my brake pad and rotor on the right front are grinding every time I apply the brakes. On July 23 2021 an own coming 18 wheeler did not see me and made a left turn in front of me at the traffic light . I step on the brakes lightly to stop but the car made the metal to metal sound and kept moving forward. So I had to jam on the brakes to stop. All wheels slid forward immediately except the front right. I think different brake pads and rotors are needed on this vehicle. This is definitely a safety issue to all drivers as well as others that are on the road.",
        "vin": "5GAERBKW6MJ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/22/2021",
        "dateOfIncident": "07/02/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426025,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "No accident. I bought this brand new car on May 29, 2021, and have been experiencing brake issues. When I apply the brakes, there is a weird noise, grinding type and it feels like there is less traction (like when slowing down on snow). I have to apply more pressure to my brakes to slow the vehicle and come to a stop. The problem occurs quite often.",
        "vin": "5GAERBKW9MJ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/08/2021",
        "dateOfIncident": "04/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423968,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Brakes started grinding at 300 miles.  I have filed a complaint with dealership who did record it and advised that it was a known issue that GM is working to resolve.  I now have approximately  2000 miles on the car and it continues to sound and feel like my brakes are grinding every time I apply the brakes.  Occasionally, when I apply the brakes and they are making the grinding feeling -  it feels as if the vehicle is not wanting to slow down and I need to apply more pressure to my brakes.   This definitely would be a safety issue to the driver as well as others that are on the road.",
        "vin": "5gaevbkw9mj"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/22/2021",
        "dateOfIncident": "04/19/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421887,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "This vehicle has an auto stop start feature that the dealer refuses to override. The problem is that if you are stopped  to make a left turn, the engine stops. When you need to go when there is a break in traffic, there is a hesitation to get going just when you need instant power. Also at stop lights or signs you tend to keep tapping the brake to keep it running resulting in a dangerous situation. Also if you are stopped and forget and get out of the car, it can start up and run into something. I just want the ability to disable  this  dangerous feature.",
        "vin": "5gaevbkw4mj"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/06/2021",
        "dateOfIncident": "06/06/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419828,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "when applying the brakes it sounds lile metal on metal",
        "vin": "5gaerbkw5mj"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/01/2021",
        "dateOfIncident": "06/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419275,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I have a 2021 Buick Enclave Premium purchased 01.03.2021from Alden Buick-GMC been having problems with my brakes when I apply my brakes I have a brake noise grinding growling noise coming from the brakes. Took vehicle to dealership today 06.01.2021. Was told cause is Composition of brake material, dealers informed by GM not to replace any parts or attempt any repairs at this time. Was informed vehicle is safe to drive and GM engineering is working on a solution to this concern. I am concerned should the brakes not work properly when applied causing an accident. Would like to know if NHTSA is aware of this problem on the 2021 Buick Enclaves and 2021 Cadillac XT5-XT6, 2021 Chevrolet Blazer, Traverse, and 2021 GMC Acadia? Would like to know if NHTSA feels it is safe to drive?",
        "vin": "5GAEVBKW9MJ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/05/2021",
        "dateOfIncident": "05/05/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415287,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I DRIVE MY BUICK ENCLAVE AFTER IT SITS FOR ANY LENGTH OF TIME, IF I APPLY THE BRAKES, I HAVE A LOUD GRINDING TYPE SOUND AND I NOTICE THE NOISE CONTINUES AS I DO MY SHOPPING AND IT DOES NOT ALWAYS GO AWAY.  I TOOK THIS VEHICLE TO THE BUICK DEALERSHIP AND I WAS TOLD THAT GENERAL MOTORS IS AWARE OF THE PROBLEM AND THEY (GM) WERE TRYING TO FIND A SOLUTION TO THE NOISE.  ALSO, I WAS TOLD THAT I CAN CONTINUE TO DRIVE THIS VEHICLE AS IT WOULD POSE NO SAFETY ISSUES.  I FIND IT UNNERVING TO DRIVE A VEHICLE WITH NOISY BRAKES AND I INQUIRED WHEN GM FINDS A FIX WILL I BE CONTACTED?  I WAS TOLD TO CALL BACK PERIODICALLY TO SEE HOW GM HAS DECIDED TO CORRECT THE NOISE PROBLEM.  AS OF THIS WRITING I HAVE ONLY 684 MILES ON THIS BUICK ENCLAVE.  I DO FEEL THIS ISSUE IS WORTHY OF CONSIDERATION BY THE NHTSA    05/05/2021",
        "vin": "5GAEVAKW8MJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/01/2021",
        "dateOfIncident": "02/03/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398571,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST BOUGHT A NEW 2021 BUICK ENCLAVE AND THERE IS A NOISE COMING FROM THE WINDSHIELD OR THE WINDOW.  SOUNDS LIKE MY WINDOW IS CRACKED.  HOWEVER, WHEN I TRY TO LET UP THE WINDOW, THE  WINDOW DOESN'T MOVE AND SOUND IS STILL THERE.  THE NOISE IS THERE FROM ABOUT 45 MPG AND UP.",
        "vin": "5GAERBKWXMJ"
    }
]