[
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/19/2021",
        "dateOfIncident": "11/19/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441002,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "2021 CADILLAC ESCALADE. CONSUMER STATED THAT THE TAIL LIGHTS ON THE VEHICLE WERE INTENSELY BRIGHT.",
        "vin": "99999999999"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/26/2021",
        "dateOfIncident": "10/26/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438218,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "5/19/2021, Engine Vibrating, vehicle stall, 3 days repair. Ignition wiring bad/ replaced 5/28/2021, Engine Vibrating, Vehicle stop running, 3 day repair/electric module burn/temporary repair by Georgia car dealer. 6/3/2021 taken to NY dealer to repair 5/28/2021 problems, 15 Day to repair. 10/12/2021 Engine vibrating, passenger compartment filled with smoke, valve lifter crack, vehicle parked on dealers parking lot for 15 day, has not been repair.  Vehicle has spent 35 total  days in car dealers for different engine problems. On all occasions  dashboard has gong haywire. Emergency brake lock, passenger door would not open 10/12/2021. Contacted GMC has not responded.",
        "vin": "1GYS4BKL0MR"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/30/2021",
        "dateOfIncident": "07/21/2021",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427220,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 Cadillac Escalade. The contact stated while driving 70 mph, the contact heard an abnormal rattling sound and then saw smoke coming from under the hood. Other drivers were honking at the contact and alerted him that there was oil leaking from the rear of the vehicle. There was no warning lights illuminated. The contact was able to pull over and had the vehicle towed to the dealer. The dealer diagnosed that the axle rod had detached causing an engine failure. The vehicle was not repaired and remained at the dealer. The dealer was awaiting a new replacement engine. The manufacturer was not made aware of the failure. The failure mileage was 2,000. Vin was not available.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "06/28/2021",
        "dateOfIncident": "06/26/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422597,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "When driving on the city streets of Chicago I approached a movable bridge which spans the Illinois river.  The bridge deck was constructed of steel.  As I was about to begin crossing the bridge my car brakes locked up completely, sending the vehicle into a short skid.  Fortunately, the car behind me was not tailgating me or I most certainly would have been struck in the back of the vehicle.  This is a brand new vehicle which I took delivery of on May 14, 2021.  There were no warning lights or indications that anything was malfunctioning on the vehicle.  I can only guess that all of the steel in the bridge decking somehow was interpreted by my vehicle to be another vehicle, and automatically slammed on the brakes in the mistaken assumption that I was about to hit another vehicle ahead of me.  In fact, there was not another vehicle ahead of me for about 100 yards.",
        "vin": "1GYS4GKL3MR"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "06/28/2021",
        "dateOfIncident": "06/27/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422643,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I recently purchased a 2021 Cadillac Escalade with Supercruise driver assistance system.  There have been at least 5 instances where I attempted to turn off the Supercruise function and the system does not allow me to regain control of the vehicle.  For example, I will turn off the Supercruise fuction by hitting the Supercruise function on the steering wheel and it will begin to flash red on the steering wheel.  I will move the steering wheel slightly to let the system know I am taking control of the vehicle but the vehicle does not recognize my input.  The car will start to slow down, turn on the flashers, and announce over the speakers to \"Take Control of the Vehicle.\"  The main issue is that the car will fight me and not allow me to accelerate to keep up with traffic.    There are sometimes when supercruise turns off without incident, but my issue stems from when Supercruise mistakenly thinks that I am not in control of the vehicle and slows down.  Again, I have put my hands back on, I put input into the steering wheel to let it know I'm in control and even tap the brakes.    I have contacted Cadillac Customer Service and have opened a case on June 28, 2021.  The case number is 9-680-7138449",
        "vin": "1GYS4GKL7MR"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/09/2021",
        "dateOfIncident": "05/07/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415747,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING WITHIN THE SPEED LIMIT OF APPROXIMATELY 65 MPH ON A 3 LANE HIGHWAY ON ROUTE 476 IN PENNSYLVANIA, THE ABILITY TO ACCELERATE OR MAINTAIN SPEED WAS INEXPLICABLY DISABLED.  I WAS FORCED TO ATTEMPT TO MOVE THE VEHICLE ACROSS MULTIPLE LANES IN AN EFFORT TO REACH THE BREAKDOWN LANE.  SECONDS AFTER REACHING THE BREAKDOWN LANE, THE ENGINE SHUT DOWN.  THE VEHICLE WAS TOWED FROM THE SCENE ON A FLATBED AND WAS TRANSPORTED TO HOLMAN CADILLAC IN MARLTON NEW JERSEY.  I AM WITHOUT A VEHICLE AND NO LOANERS WERE AVAILABLE.  I AM REPORTING THIS HAZARDOUS INCIDENT FOR YOUR RECORDS.  PLEASE ACKNOWLEDGE RECEIPT OF THIS SUBMISSION THROUGH A RETURN EMAIL.  MY NAME IS [XXX] AND EMAIL ADDRESS IS [XXX].  THANK YOU    PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "1GYS4GKL8MR"
    },
    {
        "components": "LANE DEPARTURE,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "04/14/2021",
        "dateOfIncident": "04/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408144,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE BLIND SPOT MONITORING AND REAR PARKING DEFECTIVE.  THIS OCCURS WHEN THE CAR IS IN MOTION AND STAYS ON OVER 35 MILES PER HOUR.  UNDER 35 MILES PER HOUR IT TURNS ON AND OFF AT RANDOM TIMES.",
        "vin": "1FA6P8JZ3K5"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/05/2021",
        "dateOfIncident": "01/30/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394848,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2021 CADILLAC ESCALADE. THE CONTACT STATED WHILE DRIVING 40 MPH, THE DASHBOARD INDICATOR BEGAN TO FLICKER AND THEN WENT BLANK. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER BAKER MOTOR COMPANY OF CHARLESTON (1513 SAVANNAH HWY SUITE A, CHARLESTON, SC 29407, (843) 628-0202) WHERE THE MECHANIC WAS UNABLE TO DIAGNOSE THE CAUSE FOR THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER HAD BEEN INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 20.",
        "vin": "1GYS4CKL3MR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/17/2020",
        "dateOfIncident": "12/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383896,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE DRIVER ASSIST SYSTEM  ALERT WHILE DRIVING  DEALER IS CONSULTING WITH CADILLAC ENGINEERING, BUT CAN'T FIGURE   HOW TO FIX, BECAUSE NO CODE APPEARS - EVEN THOUGHT THE WARNING STILL APPEARS",
        "vin": "1GYS4DKL6MR"
    }
]