[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/12/2022",
        "dateOfIncident": "01/28/2022",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451640,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "wHILE DRIVING ON A MICHIGAN EXPRESSWAY 1/28/22 THE SUNROOF EXPLODED NOTHING HIT MY VEHICLE THE SUNROOF CAME CRASHING DOWN IN SMALL PICES AND COULD OF CUT A CHILD OR GOT IN ANYONES EYES PLUSH THE SHOCK OF THE EXPLODING GLASS I CONYACTED THE BME DEALER THEY DID NOT HELP PLUS ACTED LIKED THIS VEVER EVER HAPPEND i CONTACTED BMW USA AND THEY ADVISED HARD TO PROVE IT WAS A DEFECT AND IT MUST OF BEEN OUTSIDE FORCE MY INSUREANCE COMPANY DID INSPECT",
        "vin": "5UXTY5C07M9"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/23/2022",
        "dateOfIncident": "01/06/2022",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448559,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The side seat rail plastic covers are easily detached from both driver and passenger side of front seats. On one occasion, the driver seat cover detached and slid forward near pedals while driving creating a potentially serious accident.",
        "vin": "5uxty9c04m9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/02/2021",
        "dateOfIncident": "12/02/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442456,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact leased a 2021 BMW X3. The contact received a recall notification for NHTSA Campaign Number: 20V601000 (Electrical System) however, the dealer informed the contact that the part for the recall repair was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was notified of the issue and confirmed that the part was not yet available. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "5UXTS1C07M9"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/15/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440495,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 BMW X3. The contact stated that the tailgate would fall on the contact without warning upon use. On one occasion, the tailgate had fallen on her left arm and the contact had to wrestle her arm out of the vehicle as the tailgate sensor failed to recognize her arm. Once her arm was released, the tailgate locked her purse inside the vehicle. The contact did not suffer any injuries. The contact called the dealer and arrangements were made to drop her off at home and to take her back to the vehicle once a spare key was made. The contact also stated that the car alarm would independently activate without warning while being driven and while stationary. The manufacturer was not notified of the failure. The vehicle was not repaired. The failure mileage was unknown.",
        "vin": "5uxty5c00m9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/31/2021",
        "dateOfIncident": "10/30/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438825,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "My sunroof exploded while driving on the interstate. There was a very loud boom almost like a gunshot. All of the glass came crashing down into the cabin. This was an extremely dangerous situation as I was traveling on the interstate. There was no warning, no rocks or any other object hit the glass to initiate this occurrence. The vehicle will be inspected by the bmw dealer 11/1/21 and my insurance company is in the process of reviewing photos of the damage.",
        "vin": "5UXTY3C07M9"
    },
    {
        "components": "EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/04/2021",
        "dateOfIncident": "10/01/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435343,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "On many cars including mine, and a family members 2021 8 series, BMW uses a light sensor on the instrument cluster to set the daytime dimming of the digital cluster and backup cameras.  However, Florida-legal window tint confuses the system, and causes the screens to dim in a way that cannot be overridden or adjusted. There is a setting for screen brightness, however it is only active for night.   This has caused difficulties reading the instrument display repeatedly. This is includes: collision warnings, back up camera, vehicle speed, and safety warnings.   Here is a video showing the effect on someone else's car. Mine is worse, and driver said that that is gets worse depending on circumstances.  https://streamable.com/n4tjp4",
        "vin": "5UXTY9C0XM9"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/28/2021",
        "dateOfIncident": "09/28/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434808,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The high voltage battery recall has been open for 1 year, which any reasonable person would agree is far in excess of a reasonable amount of time as the issue is one that could lead to a fire / death.",
        "vin": "5UXTS1C02M9"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/29/2021",
        "dateOfIncident": "07/12/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427011,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The car has part analogue part digital display, the MPH is displayed only via the analogue dial in 10 MPH increments. It's difficult to maintain speeds at 25 / 35 /45 /65 mph. The functionality exists to enable the digital speedometer but BMW refuses to code it on. Rather the company directs you to after market coders to enable the functionality. Alternatively you needed to opt to the $1000 optional fully digital display but this was not made clear at the sales process.  BMW has a solution for the 2019 / 2020 X3 under SIB 62 07 19 but refuses to acknowledge this at service centers.",
        "vin": "5UXTY5C0XM9"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/11/2021",
        "dateOfIncident": "07/10/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424300,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I was at a stop light and when the light changed I stepped on the gas.  The car suddenly turned completely off.  I had no steering, no braking no ability to turn the hazard lights on.  I was in the middle of the street with traffic behind me and my child was in the back seat with me.  The car completely died.  There were no warning signs at all  Cars started to go around me and I exited the car with my child to avoid getting hit because I could not put my hazard lights.   I called my husband and after about 10 minutes I could see the headlights were on.  My husband gave me his care and he took my car home but he said the car was acting weird and kept  shutting off while on the way back home.  then it shut off completely again in our driveway and we cannot close the doors.   We are waiting for BMW to pick up the car tomorrow.",
        "vin": "5uxty5c07m9"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/03/2021",
        "dateOfIncident": "06/28/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423320,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2021",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "DUELER HP SPORT",
                "productYear": "9999",
                "size": "225/60R18",
                "type": "Tire"
            }
        ],
        "summary": "Car only 9 months old, tread on both front tires bald, hydroplaning on wet roads. Almost was in an accident, I travel for work and got a BMW for reliability, I’m really second guessing my choice of cars right now.Bridgestone said tread is from out of alignment. BMW checked alignment and front is spot on. 13,000 miles on tires. Horrible driving experience in such a short time. Very disappointed that BMW would put such terrible tires on.",
        "vin": "5UXTY5C02M9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/14/2021",
        "dateOfIncident": "06/10/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420948,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving on I-10 W in Phoenix Arizona with my husband on Thursday June 10th, 2021 when we heard a loud glass shattering sound.  I immediately looked for a place to park or exit.  I thought maybe someone was shooting at our vehicle in the freeway.  I tried changing lane as quickly as possible to exit into Baseline Rd and parked at a parking lot.   I was so scared looking at the mirror to see if anyone was following us.  We walked around the SUV checking the windows, windshield but no broken glass or holes on any of them.  I thought of the moonroof/sunroof so I hopped on the BMW to check the moonroof/sunroof.   The sunroof  shattered into million pieces.  I didn't see a warning on the dashboard.  We didn't go under any bridge between Elliott and Baseline.  There were no big trucks around us either. It shattered without warning.  This happened between 11:00am - 11:30am, light traffic.  My BMW X3 2021 is brand new, only 20 days old and approximately 400 or so miles.  I believe it's a safety issue with the glass or moonroof/sunroof structural defect.  Definitely a highway safety hazard when it shattered out of the blue at 65 miles an hour. Luckily we didn't have the sunroof open. It's  extremely hot this time of the year in Phoenix.   I decided to drive it immediately to The BMW dealership.  The service department checked it out and the Service Advisor told me to call my insurance.  I contacted the BMW Warranty Department and the Manager told me it is not covered under warranty.  She was making the assumption that a rock hit the sunroof.  I contacted BMW Customer Service and reported it.   The BMW Customer Service Executive called me back today and pretty much said the same thing as the Warranty Manager.   BMW and NHTSA should investigate the occurrences of Sunroof shattering without any apparent reason for the safety of drivers and passengers plus all the other drivers on the road who may get impacted by such an occurrence.",
        "vin": "5UXTY3C00M9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/18/2021",
        "dateOfIncident": "05/14/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417659,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Exploding rear passenger window glass sent fine glass particles and glass chips everywhere.  Was driving from 5300 ft elevation to 10800 ft elevation so it appears to be caused by faulty glass and air pressure change causing an outward push of air pressure. Nothing hit the window. This was my first time driving the car.  Any rear passengers would have been hospitalized due to glass in the eyes.  BMW is denying the issue is with their product.",
        "vin": "5UXTY9C05M9"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/07/2021",
        "dateOfIncident": "05/06/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415569,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR IS NOT STABLE ON HIGHWAYS, DRIFTS LEFT OR RIGHT, EVEN AFTER WHEEL ALIGNMENT DONE BY A BMW DEALER. CONSTANT CORRECTIONS NEEDED EVERY 5-10 SEC TO STAY IN LANE.",
        "vin": "5UXTY5C08M9"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "05/07/2021",
        "dateOfIncident": "04/12/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415588,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "ON APRIL 12, 2021 I WAS DRIVING MY 2021 BMW X3 AND AS I WAS PULLING UP INTO A PARKING STALL, MY VEHICLE ACCELERATED ON ITS OWN CAUSING MY VEHICLE TO COLLIDE WITH A BRICK WALL.",
        "vin": "5UXTY3C05M9"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/01/2021",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414757,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "3 TIMES TODAY SHORTLY AFTER ENGAGING CRUISE CONTROL AND SETTING IT TO 75MPH, THE VEHICLE ACCELERATED QUICKLY TO OVER 90MPH AND HAD TO BE MANUALLY DISENGAGED. WHEN THIS HAPPENED, I DID NOT HAVE MY FOOT ON THE GAS AND DIDN'T PRESS ANY OF THE CRUISE CONTROL BUTTONS EXCEPT TO DISENGAGE IT WHEN IT DANGEROUSLY ACCELERATED ON ITS OWN.",
        "vin": "5UXTY9C08M9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/26/2021",
        "dateOfIncident": "02/25/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398131,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAND NEW BMW X3 3.0 IS NOT ABLE TO TRACK STRAIGHT, THE CAR NEEDS CONSTANT CORRECTIONS TO STAY ON STRAIGHT COURSE. MULTIPLE VISITS TO BMW DEALERSHIPS DID NOT HELP, THE DEALERS REFUSE TO RECOGNIZE THE ISSUE. THIS IS SAFETY ISSUE SINCE THE CAR TENDS TO GO OFF ROAD AND MAY LEAD TO AN ACCIDENT.",
        "vin": "5UXTY5C08M9"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/28/2021",
        "dateOfIncident": "01/05/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390549,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR CAR HAS JUST SHUTDOWN ALTOGETHER WAITING AT A TRAFFIC LIGHT. ALSO, THE MAIN CONSOLE ABOVE THE STEERING WHEEL HAS GONE COMPLETELY BLACK SEVERAL TIMES WHILE DRIVING.",
        "vin": "5UXTS1C08M9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/17/2020",
        "dateOfIncident": "07/12/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383939,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "BRIGHTNESS ADJUSTMENT FOR CONTROL DISPLAY SCREEN (BACKUP CAMERA, NAVIGATION,MESSAGES ETC) HAS BEEN ELIMINATED FROM MENU.  DRIVER HAS NO WAY TO ADJUST DAYTIME BRIGHTNESS ANYMORE.  BMW REPLACED IT WITH A INTERIOR BRIGHTNESS SENSOR IN THE UPPER LEFT CORNER OF THE INSTRUMENT CLUSTER ABOVE THE GAS GAUGE. THE DANGER INCURS BECAUSE THE SCREEN KEEPS CHANGING BRIGHTNESS IN THE DAYTIME BASED UPON LIGHT ENTERING THE AUTO AND HITTING THE LIGHT SENSOR.  THIS HAPPENS COMING OUT OF A GARAGE, TREE LINED STREET, CLOUDY DAY ETC.  THE DANGER IS THAT YOU CANNOT OBSERVE THINGS CLEARLY USING THE BACK-UP CAMERA, AND USING NAVIGATION DURING THE DAYTIME YOU CANNOT MAKE OUT DIRECTIONS, ROADS, HIGHWAYS ETC BECAUSE THE SCREEN TURNS A DULL WHITE OR ALMOST GRAY AT TIMES.  THIS FORCES YOU TO STAR AT THE SCREEN OR GET CLOSER OR ASK YOUR PASSENGER TO READ THE SCREEN.  THE BRIGHT WHITE LETTERS AND NUMBERS GOES DULL AND UNREADABLE.  DEALERS AND SERVICE MANAGERS HAVE ACKNOWLEDGED THAT THIS IS AN ISSUE BUT NO SOLUTION.  FORUMS IN EUROPE ALSO ACKNOWLEDGE THIS PROBLEM THAT BMW IS AWARE OF WITH NO INTENT ON CORRECTING.  IT WAS ALSO A PROBLEM ON MY 2019 BMW 530 BUT I HAD THE CAR CODED TO PUT THE DAYTIME ADJUSTMENT BACK ON THE MENU FOR DRIVER ADJUSTMENT.  COMPLAINTS ON THE INTERNET ALSO FOR 2020 BMW X5 AND NO ONE HAS A RESOLUTION.  I GLUED A SMALL LED TO MY DASH THAT WILL FOOL THE SENSOR AND BRIGHTEN MY SCREEN BUT IT IS NOT PRACTICAL TO LEAVE THIS LIGHT ON AT ALL TIMES.  BMW NORTH AMERICA ACKNOWLEDGES MY ISSUE ALSO WITH NO SOLUTION.  DEALERS HAVE VERIFIED THIS WITH OTHER NEW CARS ON THEIR LOTS BUT ALSO WITH NO SOLUTION. SOMETIMES THEY BLAME TINT TO APPEASE YOU BUT NONE OF MY CARS OR OWNER COMPLAINTS HAD ANY TINT ON THEIR WINDOWS OR POLARIZED GLASSES.",
        "vin": "5UXTY5C02M9"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/16/2020",
        "dateOfIncident": "12/16/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383792,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR'S SPEEDOMETER ONLY DISPLAYS SPEED IN 10 MILES INCREMENTS, WHICH MAKES IT NEARLY IMPOSSIBLE TO KNOW EXACT CURRENT SPEED OF THE CAR. FOR EXAMPLE WHEN SPEED IS BETWEEN 50 AND 60 I CAN ONLY GUESS WHAT MY ACTUAL SPEED IS, 52 OR 58.   BMW FOR SOME STRANGE REASON SELLS AN OPTIONAL PACKAGE WHICH ENABLES ACCURATE DIGITAL SPEEDOMETER, AND I THINK ACCURATE SPEEDOMETER MUST BE STANDARD.   THIS IS A SAFETY ISSUE.",
        "vin": "5UXTY5C08M9"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/27/2020",
        "dateOfIncident": "10/26/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366599,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "PARKING DISTANCE CONTROL IS FAULTY AND SOMETIMES LOCKS UP THE BRAKES IN A JARRING MANNER WHEN BACKING UP EVEN WHEN THERE IS NOTHING BEHIND THE CAR, CLOSE TO THE CAR OR IN THE ADJACENT PARKING SPACES. BMW EVEN SAYS TO TURN OFF PDC WHEN USING PARKING ASSISTANT PLUS. MANUAL SAYS CAR CAN STILL HIT CURB USING PDC. 3 TIMES ALREADY",
        "vin": "5UXTY9C08M9"
    }
]