[
    {
        "components": "AIR BAGS,ENGINE,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "04/05/2022",
        "dateOfIncident": "12/15/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459647,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "After conducting a $10k forensic review on the car, they found out that the computer was infected with malware and that that vehicle will always put out fm transmitters to get into your cellular devise to hack it Unfortunately, this is the case for this bricked...Need a replacement with transferring the lease over to a similar priced vehicle.",
        "vin": "WA1BAAFY6M2"
    },
    {
        "components": "UNKNOWN OR OTHER,BACK OVER PREVENTION,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/08/2022",
        "dateOfIncident": "11/01/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455646,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The backup camera in the car randomly stops working while driving in reverse. These cameras are mandated by federal law and malfunctions can lead to collision with unforeseen living beings while backing up. The MMI screen also goes completely white/blue while driving forward. Additionally,  the adas package comes with a birds eye view camera that is completely skewed created a deceptive understanding of objects in the surroundings. This can lead to collisions making the adas packing (and perhaps the collision warning) totally unreliable.  The vehicle is available for inspection as needed. Took the brand new vehicle to the dealer, they refused to fix it as their engineer could not reproduce the issue. Later after a lot of argument, they mentioned they cannot fix it because of resource shortage. Argued they cannot sell brand new vehicles that are faulty, we were told their other cars may have the same issue so they cannot guarantee a loaner will fix this problem. We have spent hours on phone and in person with the dealer service center in vain.  There were no warnings of the problem. The screen went blank during the drive. This happened for the first time around November 2021. This happens fairly arbitrarily.",
        "vin": "WA1BAAFY4M2"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/14/2022",
        "dateOfIncident": "02/12/2022",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451901,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 Audi Q5. The contact received notification of NHTSA Campaign Number: 21V947000 (Electrical System, Structure). The dealer was contacted and informed her that an appointment for service would not be available for two months. The manufacturer had been notified of the issue. The contact was informed that the protective cover used to repair the failure was a plastic cover which the contact did not believe was adequate for the repair. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "wa1baafy9m2"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/04/2021",
        "dateOfIncident": "11/28/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11442684,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving down a slight hill in 1/2 inch of snow at 5MPH and when I tired to gently brake as I descended the hill, the brake pedal had no resistance and went flat to the floor. I had no brakes. I then tried to steer towards the side of the road and the steering wheel completely locked up and I was not able to steer. I slid 150 feet down the hill and into a ditch. No brakes and no steering. There must have been a failure of some kind. Terrifying.",
        "vin": "WA1CAAFY1M2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/01/2021",
        "dateOfIncident": "11/17/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442318,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The failed component is the gateway module that sits underneath the rear seats below the cup holders. In my case approximately 5 oz of water seeped out of my briefcase via a leaky water bottle and it shut down the gateway module and rendered the car inoperable.. losing all power and engine on the highway at approximately 60 mph. Fortunately I was successful in navigating the car to the side of the road by coasting and other than the fear was not harmed. Car was towes to Audi service where they confirmed that the gateway module failed.. they did not notice any water on the module and replaced it next day ..I was surprised that they had 5 in stock.. just googling Audi Q5 gateway module I noticed many similar incidents like mine I am worried that a family unknowingly with children in the back could have a similar incident and create serious risk. This needs to be communicated immediately to all Audi owners that are impacted and a recall needs to be initiated once a solution is developed and tested.",
        "vin": "WA1BAAFY9M2"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/27/2021",
        "dateOfIncident": "09/24/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438422,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 Audi Q5. The contact stated while driving 60 MPH and exiting off a ramp, the sunroof exploded without impact causing the shattered glass to enter the vehicle and fall on the driver. The contact stated that no object had struck the vehicle to cause the failure. The contact pulled over to the side of the road and inspected the vehicle before driving to the residence. The contact had the vehicle towed to an independent mechanic who inspected the vehicle but could not diagnose the cause of the failure. The local dealer was contacted regarding replacing the sunroof. The vehicle was not repaired. The manufacturer was made aware of the failure. The failure mileage was approximately 4,000.",
        "vin": "wa1aaafy6m2"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/15/2021",
        "dateOfIncident": "10/11/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436964,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving on the road, multiple warning and error messages suddenly appeared on dashboard. Entire car shut down in very short time left no time for driver to safely pull over. The car cannot move in the middle of the road and put the driver, passengers and surrounding vehicles at risk. The car was towed to a dealer and they confirmed the gate way module under rear seat is wet and shorted.",
        "vin": "WA1BAAFY5M2"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/08/2021",
        "dateOfIncident": "08/15/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436032,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 Audi Q5. The contact stated that while she was driving 65-70 MPH, the warning message \"Transmission Engine Failure\" appeared on the instrument panel. The vehicle inadvertently stalled while attempting to veer to the side of the road. The contact stated she was able to restart the vehicle after several attempts however, the vehicle was towed to her residence. The dealer was notified of the failure and advised the contact to take the vehicle to their location for diagnostic testing. The vehicle was taken to the dealer who diagnosed that the ECM chip had failed and needed to be replaced. The vehicle was repaired. The contact also stated while she was reversing, the vehicle inadvertently stalled. There were no warning lights illuminated. The vehicle was taken to the dealer who diagnosed that the clutch had failed. The vehicle was repaired. The manufacturer was not notified of the failure. The approximate failure mileage was 9,000.",
        "vin": "WA1AAAFY1M2"
    },
    {
        "components": "WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/27/2021",
        "dateOfIncident": "09/24/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434472,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "My 2021 Audi Q5 has a manufacturing recall (Safety Recall 42L1 - Rear Axle Trailing Arm Lock Nut) on it and my dealer cancelled my appointment and informed me that they will not perform the recall repair unless I schedule (something that I have to pay for) at the same time - they will not perform the recall repair otherwise. This was the Audi Minneapolis dealership located at 9393 Wayzata Blvd, Golden Valley, MN 55426. I was told that this needed to be reported to you guys.",
        "vin": "WA1BAAFY0M2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/26/2021",
        "dateOfIncident": "09/06/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434437,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving the vehicle many warning lights suddenly turned on and the vehicle came to an abrupt stop in the middle of an intersection. Then the windows rolled down automatically. Vehicle would not start, posing a serious safety issue as it was in the middle of an intersection. Audi dealer indicated the gateway module malfunctioned. They said it had gotten wet, which I have no idea how it would’ve gotten wet. The gateway module is located under the backseat center console. The dealership indicated they had 5 cars brought in in 2 weeks with same issue. I have since read on Audi forums that this has happened to many others and left some stranded in the center-lane of highways.",
        "vin": "Wa1baafy6m2"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "09/14/2021",
        "dateOfIncident": "09/13/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432949,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "when using cruise control, the vehicle suddenly brakes. If set a 70mph it will jam on the brakes and reset to 45 mph. This has caused near rear collisions. This is a recurring problem,.Audi service tried 3 times to identify the problem. Google has  other owners with the same problem.",
        "vin": "wa1caafy7m2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/11/2021",
        "dateOfIncident": "09/07/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432571,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The 2021Audi Q5 has a gateway module under the middle back seat.  Any fluid that contacts this module will cause it to fail shutting the car down completely.  In addition, immediately above the module are 2 drink car holders.  It only takes a small amount of spilled drink to cause this to happen.  This happened to me on Sept. 7 causing my car to come to a complete stop immediately after passing thru and intersection.  Eventually this will get someone killed on seriously injured.  Audi has been aware of this issue but they don't inform potential buyers.  This has happened numerous times before and I have attached other incidents posted on the internet.  Please take action to make Audi take responsibility and corrective action. Electrical System problem #1 On August 19th, we drove our Audi through heavy rain early in the day on interstate 90 to go to mass general hospital. It was then parked in their covered parking garage. When we went to return home, we were on the entrance ramp to I 90 east and suddenly the car displayed messages of brake failure, electrical failure, steering failure, and then it died. It could not even be put in park. I was able to coast to the narrow shoulder. It was towed to brookline Audi. We are told by the service technician that the gateway module in the vehicle got wet and it is our responsibility as we drove through water. Although we certainly drove in pouring rain, we never drove through any flooded areas. The apparent fact that water somehow got into this new car and shorted out this all important device is terrifying.  Electrical System problem #2 Driver was with 2 passengers (3 young females) driving in a new 2021 Audi Q5 (less than 5 months old and less than 6000 miles) at about 70 mph on garden state parkway in NJ. A brake malfunction warning light appeared on the dashboard and within 5 seconds the car completely shut down in the middle lane of the parkway (in a black car at 10pm). This was the first notification or warning--nothin",
        "vin": "WA1BAAFYXM2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/10/2021",
        "dateOfIncident": "09/03/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432403,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle control module failed while driving. All car functions failed.  Had a difficult time pulling off the road safely.    Car towed to dealer.  Found the module wet.  However area around module was dry.  They don’t know where the water is coming from.    Audi is aware of the issue and is replacing the part free of charge.    If we were on a highway when the module failed it could have been disastrous.",
        "vin": "WA1AAAFY2M2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/23/2021",
        "dateOfIncident": "08/19/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430205,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "On August 19th, we drove our Audi through heavy rain early in the day on Interstate 90 to go to Mass General Hospital. It was then parked in their covered parking garage. When we went to return home, we were on the entrance ramp to I 90 East and suddenly the car displayed messages of brake failure, electrical failure, steering failure, and then it died. It could not even be put in park. I was able to coast to the narrow shoulder.  It was towed to Brookline Audi. We are told by the Service Technician that the Gateway Module in the vehicle got wet and it is our responsibility as we drove through water. Although we certainly drove in pouring rain, we never drove through any flooded areas. The apparent fact that water somehow got into this new car and shorted out this all important device is terrifying.",
        "vin": "WA1BAAFY4M2"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/09/2021",
        "dateOfIncident": "07/03/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428427,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving a brand new Audi Q5 it suddenly went into  \"Panic mode\" with the windows going up & done,Steering malfunctioning, warning the driver to pull over. The car shuts down unexpectedly without reason. The whole car freezes ! While at the dealership, the tech told us there was another car being repaired with the same issue .Turns out if the back battery gets wet(hidden under the back cup holder)the car shuts down. A cup of coffee spilled in the back seat but there are many reports online (part #J533) with any incidence of wetness. Audi is aware of this problem and although they ordered a new part, the problem is NOT repaired permanently .It can happen again and again .Audi needs to have a major recall on all Q3, Q5 and Q7. We were on a residential street when this happened but a multi vehicle crash would have taken place if on a highway.We are asking for a refund since the car was 2 weeks old at the time with less than 5,000 miles. We need the public to know they are driving a car with a a major design flaw and could cause serious accidents.",
        "vin": "WA1BAAFY7M2"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/07/2021",
        "dateOfIncident": "08/04/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428184,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "while driving, my 2021 Audi q5 with 1400 miles,  it began to malfunction; every light & warning (transmission, brakes, AWD , etc.) began flashing as failing on the dashboard.  The windows begin going up & down.  Steering began to be hard.  Finally, I was able to steer the q5 out of traffic.  Traffic was going about 40-50 mph.  2.  the q5 was towed to Audi for diagnostic 3.  Audi called & said that the gateway got wet and the cost for the part is $1200. It will take 2 weeks to get the part in.  Audi has no openings until October.  4.  They stated that the water drains are working and that they found a water bottle cap in the backSeat of the car; therefore, the gateway will not be covered under warranty. Huh?  5. I am unsure why the warranty will not cover any Safety issues on a 4 month old car.  6.  Audi is assuming there was a water spill, because there was a water bottle cap in the car.  7.  What are you talking about, Audi?  Why are you assuming things?  What is the real cause of this traumatic experience?  8.  Secondly, no one told me not to have a water bottle cap in the q5 backseat area; the q5 without warning, began to shut down.  9. The engine light stayed on.  10.  Audi is not acting in good faith, why are there assumptions made?   11.  Audi must recall the q5 and announce a public safety warning of the danger that is lurking  in the back seat called a gateway.   12.  Audi must clearly state “Danger! Danger!  No water bottle caps allowed in backseat”.   13.  Also, not to mention, there were no Audi loaner cars available; this gives off the appearance  that Audi is making a lot of repairs and they are aware of this $1200 “water bottle cap” problem called a gateway.  14. I am aware my experience is possibly rare, BUT it must not happen ever.   This was a dangerous scary experience that must not happen again to me or any family!  15. Pls demand Audi to recall these q5s to relocate the gateway, before someone dies!!! 16.  I will trade in q5 to avoid death...",
        "vin": "Wa1aaafy1m2"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/23/2021",
        "dateOfIncident": "07/20/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426144,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "2021 Audi Q5 parked (not running) in parking lot , outside temperature 95F, gasoline dripping from under right rear passenger area (approx 1/4-1/2 liter).  Audi Service Center inspected and said the fuel pump needs replacing.  Fuel system warning light had been yellow and gas cap gasket had been replaced .",
        "vin": "WA1BAAFY3M2"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/10/2021",
        "dateOfIncident": "06/27/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424179,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I leased a 2021 Audi Q5 (VIN: WA1BAAFY7M2[XXX]) in November 2020. 2021 Audi Q5 has gateway module underneath the middle row seat. The gateway module is like the brain of the car and if it stops working the car stops - basically the car is brain dead. In my case, I was driving the car with my family i.e. wife, 7 and 3 year old kids when the car abruptly shut off. Luckily, I was on a road with 45 MPH speed limit and no traffic, so nothing happened to us. If this happened on a highway or other situation anything could have happened to me and my family. After safely parking the car and getting it towed to Audi Westmont, the car was inspected, and I was informed about the gateway module issue. To my shock, the mechanic said that it’s a design flaw that Audi is aware of but doesn't have a solution yet. Furthermore, he said that just at Laurel Audi in Westmont 4 cars were repaired for this problem. When I googled, several Audi owners have faced this problem. As I mentioned earlier, despite knowing the issue Audi didn't inform the owners and yet to inform the owners despite this being a serious enough problem that could put owners/families in a life threatening situation. Here's the link to the video taken during the diagnosis of the problem: https://asr.autonation.com/tV0Ij5Ym5c. I have also attached picture of the hodgepodge fix i.e. wrapping gateway module in plastic. The reason I say it is hodgepodge is that wrapping in plastic won't prevent water from condensing on gateway module and the problem repeating. Preceding the days my car had this problem, there were heavy rains and humidity was very high, as noted in the video there is no source of water leak or water entering the gateway module externally, given that finding and the fact that there was heavy rains, high humidity in the preceding days - condensation can likely be the potential cause of the problem. There are thousands of 2021 Audi Q5's and every single one has this risk.  PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "WA1BAAFY7M2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/29/2021",
        "dateOfIncident": "06/17/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422846,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Driver was with 2 passengers (3 young females) driving in a new 2021 Audi Q5 (less than 5 months old and less than 6000 miles) at about 70 mph on Garden State Parkway in NJ. A brake malfunction warning light appeared on the dashboard and within 5 seconds the car completely shut down in the middle lane of the parkway (in a black car at 10pm). This was the first notification or warning--nothing in the prior minutes or days. The driver was unable to restart the vehicle after several attempts and was unable to drift to the shoulder of the parkway. The SOS button in the vehicle didn't work and hazards didn't appear to be working either. Several cars driving at or above the 65 mph speed limit were braking and swerving at the last second to avoid collision and several cursed at the vehicle (as they were unable to see the vehicle in the darkness). Passenger in front seat called 911 to request assistance to provide a roadblock as it seemed imminent that the vehicle was going to be hit. 911 operator said safest place was to remain in the vehicle given the vehicle location and the speed of other drivers. The radio briefly turned back on and then turned off. Nothing else was working. When the tow arrived, the driver notified the individuals that the front hazards were working but the back hazards were not. The vehicle was towed to the local Audi Service Center. Eleven days after Audi accessed the vehicle, a report was received which said that the vehicle had an \"elec[trical] malf[unction]\" and that they \"found car would not turn on and no communication to any control units. [They] performed hard reset to gate way control unit[,] found fuse blown for control unit[,]  replaced fuse [and] still same concern found[.] [G]ateway control unit internally faulty causing car not to start[.] [R]eplaced and recoded control unit [and] cleared faults and test drove car[.]\" The report also notes that 3 weeks after the car was leased, the vehicle owner indicated that the car was stalling out. ",
        "vin": "Wa1BAAFY7M2"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/26/2021",
        "dateOfIncident": "05/08/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422446,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Water was spilled in the backseat of the car (less than 12 ounces of water). This caused a complete  electrical failure impacting the engine and power steering. The failure happened at a slow speed in a parking lot but would have been much more dangerous on highway. The car would not turn on or off and would not shift into any gear after coming to a stop. Was told that the water caused a failure in the data bus control module.",
        "vin": "wa1aaafy5m2"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/18/2021",
        "dateOfIncident": "06/17/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421380,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The panoramic Sunroof exploded while driving spontaneously.   Luckily no one was injured due to the shattered glass due to the cloth screen being drawn fully.   The problem was reported to Audi and to the local dealer.  The vehicle has not been inspected by insurance or police.  There were no warning indicators prior to the incident.",
        "vin": "WA1AAAFY9M2"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/24/2021",
        "dateOfIncident": "02/16/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397753,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT WHO IS A CERTIFIED MECHANIC CALLED ON BEHALF OF A CUSTOMER WHO OWNS A 2021 AUDI Q5. THE CONTACT STATED THAT WHILE THE OWNER WAS DRIVING, THE VEHICLE RAN OVER A STRIP OF ALUMINUM THAT WAS LYING IN THE ROADWAY CAUSING THE FUEL TANK TO BE RIPPED OPEN. THE CONTACT STATED THAT THE FUEL TANK WAS MADE FROM PLASTIC AND NOT METAL CAUSING THE FUEL TO LEAK FROM THE VEHICLE. THE VEHICLE WAS TAKEN TO AUDI RENO TAHOE (9190 S. VIRGINIA ST, RENO, NV 89511) WHERE THE FUEL TANK WAS REPLACED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 9,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/18/2021",
        "dateOfIncident": "02/16/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396809,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "A PIECE OF METAL IN THE ROADWAY PIERCED MY GAS TANK CAUSING THE GASOLINE TO LEAK OUT. THIS CREADTED A CONDITION WHICH COULD HAVE CAUSED A FIRE OR AN EXPLOSION.",
        "vin": "WA1BAAFY2M2"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/06/2021",
        "dateOfIncident": "12/21/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386836,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Q5 HAS A VERY SERIOUS DEFECT, THAT IS, THERE IS A GATEWAY MODULE LOCATED UNDER THE REAR SEAT CUSHION/CUP HOLDER. ALL OF THE COMMUNICATIONS TO ALL THE CONTROLLERS GO THROUGH THIS LITTLE BOX. IF WATER SPILLS, IT COLLECTS AROUND THE GATEWAY AND CORRODES IT, WHICH WILL SHUT DOWN THE CAR. THIS SHUTDOWN OCCURRED WHILE I WAS DRIVING MY FAMILY. LOST ALL POWER, ENGINE, ELECTRICAL, EVERYTHING. BARELY COASTED OUT OF THE ROADWAY. THIS IS A DESIGN FLAW TO LOCATE THIS SENSITIVE MODULE UNDERNEATH REAR CUP HOLDERS AND WILL LEAD TO DANGEROUS SITUATIONS FOR PEOPLE IN THE CAR.",
        "vin": "WA1BAAFY1M2"
    }
]