[
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/10/2022",
        "dateOfIncident": "03/08/2022",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456014,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Car has an emergency call system in case of a crash. The dashboard shows a malfunction that  flashes every few minutes. Call to dealer for a repair was not considered a safety hazard and was scheduled  for the next  month.",
        "vin": "5UXTA6C0XM9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/18/2022",
        "dateOfIncident": "11/15/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452751,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 BMW X5. The contact stated an unknown recall notice was received in regards to a recalled battery. The contact called the dealer and it was informed that the parts for the recall repair were not available. The manufacturer was not notified of the issue or contacted. The contact had not experienced a failure. No further information was available.",
        "vin": "5uxta6c02m9"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "02/12/2022",
        "dateOfIncident": "01/25/2022",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451675,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "This is a 2021 BMW X5 with BMW's blind spot warning system.  The vehicle currently has approximately 5,500 miles and was purchased new.  The blind spot warning system has consistently malfunctioned since the vehicle was delivered.  When monitoring the right side (passenger side) blind spot it only picks up on average 1 of each 3 vehicles encountered and completely the ignores the the others.  By \"picks up\" I mean the visual indication in the right side mirror is lighted when the vehicle is in the blind spot. For those the system does not detect there is no visual indication of the vehicle and if the right turn signal is activated there IS NO WARNING of the vehicle in the blind spot. This effectively renders this critical safety system completely useless and a serious safety hazard as it is clearly malfunctioning.     Upon complaining, the X5 was inspected by the dealer who reported that no malfunction was found and the system \"is functioning as designed\".  After additional discussion with the service manage the dealer verbally admitted the system was not detecting other cars on the right side of the vehicle consistently but as there was no electrical fault detected in the system, it must be OK and it was not a repairable issue.  Assuming the dealer's analysis of the problem is correct, this leads to the conclusion there is a serious safety design flaw in BMW's blind spot detection system.    A brief examination of various BMW related internet forums shows this issue, or very similar issues concerning the function and design of the BMW blind spot detection system have been reported by several BMW owners, suggesting the problem is likely a design flaw and not a simple component failure.",
        "vin": "5UXCR6C08M9"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/11/2022",
        "dateOfIncident": "02/01/2022",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451567,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The auto dimming function of the rearview mirror and the driver side mirror does not work consistently. During nighttime driving, the auto dimming can suddenly turn off unexpectedly, blinding the driver. I took the car into BMW and they confirmed that it is a known issue with the positioning of the sensor that controls the systems that affects all X5’s, but they did not say specifically which year models. They told me their engineers are currently looking into a solution to the problem but they currently do not have a solution, and that they may issue a recall but couldn’t provide any further information. It is very frustrating and dangerous, as I have been driving home many times late at night and suddenly I’m blinded by headlights behind me and it makes it very hard to see while driving at night.",
        "vin": "5UXTA6C05M9"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "02/10/2022",
        "dateOfIncident": "02/05/2022",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451300,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving in the left lane of the freeway, and there was a k-rail to the left of the lane, because there was construction in the shoulder. At one point, there was a break in the k-rail, where it had an opening, and went away from the lane, then back about 20 ft later. The lane departure system jerked the wheel to the left, attempting to steer out of the lane; if I had not held the wheel steady, it would have steered the vehicle directly into the k-rail as it rejoined the side of the lane.",
        "vin": "5UXTA6C02M9"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/01/2022",
        "dateOfIncident": "01/21/2022",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449735,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 BMW X5. The contact stated that as her husband was stopped at a stop light, the vehicle began to rev after he had taken his foot off the brake pedal without warning. Once her husband placed his foot back on the brake pedal, the revving stopped, and her husband was able to resume normal driving. On a separate occasion, her husband was waiting for a vehicle to move out of a parking spot; the same failure occurred as her husband took his foot off the brake pedal. Her husband was forced to slam on the brakes as the engine continued to rev and the vehicle lurched forward. The contact who was seated in the passenger’s seat, shut off the vehicle to avoid hitting the vehicle in front. Her husband restarted the vehicle and drove it home; he then had the vehicle towed to the dealer the next day. The dealer inspected the vehicle but could not duplicate the failure. The service tech was not satisfied with the results and decided to call the manufacturer to approve more testing of the vehicle. The vehicle had yet to be repaired and remained in the possession of the dealer. The failure mileage was approximately 14,000. The VIN was not available.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/21/2022",
        "dateOfIncident": "01/05/2022",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448346,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 BMW X5. The contact stated while his wife was reversing the vehicle into the main road when shifting gears into drive, the vehicle began to reverse independently while still depressing on the brake pedal. The contact stated the vehicle ran into two different trees and slashed the front driver's side tire. The contact stated the Park Distance Control (PDC) malfunction warning light was illuminated. No air bags were deployed. The driver did not have any injuries or seek medical attention. A police report was not filed. The contact was able to park the vehicle back into his residence. The contact towed the vehicle to a local dealer, who called the manufacturer. The manufacturer sent their engineers to diagnose the failure. The manufacturer called the contact and was informed it was a human error. The failure mileage was approximately 8,000.",
        "vin": "5UXCR6C08M9"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/29/2021",
        "dateOfIncident": "12/15/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445512,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "After stopping for a red light for a right turn vehicle does not accelerate in hybrid mode when commanded to do so. No alarms are present. Car is shown to be in Drive. After numerous attempts to switch transmission gears and restart the engine, switched to gas (sport) mode and was able to accelerate the car. Occurred on at least 3 occasions. A dangerous event because drivers behind the car could accelerate thus causing an accident. The incident could also cause driver rage from drivers behind my car attempting to make the left turn.",
        "vin": "5UXTA6C06M9"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/26/2021",
        "dateOfIncident": "12/25/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445005,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "UNKNOWN  CAR STARTED SHAKING ON THE HIGHWAY AND SUDDENLY LOST POWER.    SHOWN ERROR 'POWER TRAIN MAILFUNCTION'",
        "vin": "5UXTA6C04M9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/10/2021",
        "dateOfIncident": "10/08/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436201,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The low beam headlights do not illuminate the road sufficiently when there are dips in the road or going up hill. The dealer says the lights are fine but relative to the other cars, there is clearly a problem with low beams on undulating roads. On undulating roads or going up hills, the low beams often only illuminate about 20 ft in front of the car. The problem appears to be BMW has drastically limited the upward lighting from the lights for safety of other drivers. However, they have gone too far and created a safety issue with too little upward illumination to be safe on uneven roads. The low beams are great on a perfectly flat surface, but even with a small up hill grade, the low beams are not set to provide enough lighting of the road. I have taken to driving with high beams on for undulating roads because of the lighting provided by the low beams is so bad. This means inadvertently blinding oncoming drivers because I don't turn the high beam headlights down soon enough. I often need to use high beams to read the names of side street signs. The turn signal does a better job illuminating these side street signs than the low beams. By trying to enhance safety for on coming drivers from low beams, they forgot to account for real world driving condition of undulating roads and have created a worse safety issue by forcing more frequent use of high beams that absolutely blind on coming divers.",
        "vin": "5UXTA6C00M9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/07/2021",
        "dateOfIncident": "10/07/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435970,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Drive train warning displayed then power loss and stalling occurred on highway",
        "vin": "5uxcr6c09m9"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/28/2021",
        "dateOfIncident": "08/27/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11434671,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Previously reported that the BMW X5e, Plug in hybrid, shuts itself off once the driver's door is opened leaving anybody in the car at risk of serious health problems or even death!  A menu selection option should disable this unsafe practice but it does not work. As if there is a software glitch. Other models, the X3e stays on when the driver's door is opened. I've previously reported this item but now my father has injured himself recently. After a medical appointment and retrieving his medications my father was in the car in unsafe and deadly heat and attempted to exit the vehicle due to the car shutting itself off and he fell and hurt himself. The manufacturer has been contacted several times and at times they say this should not be happening but the dealers are saying that is how the vehicle is designed. I also have videos of the other models not shutting off for review.  PLEASE FIX THIS ITEM!",
        "vin": "5UXTA6C05M9"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "09/23/2021",
        "dateOfIncident": "09/21/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434135,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "When reversing out of driveway/parking space, the rear cross traffic warning alert doesn't give any warning until my vehicle is inches from another vehicle. The system isn't sensitive enough.",
        "vin": "5YMJU0C09M9"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "09/16/2021",
        "dateOfIncident": "09/15/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433205,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "System fails to notify me of pedestrians/cross traffic when backing out of driveway, parking lots, etc.  Multiple near misses.  Orange/red shadows on screen do not appear.  Ditto for beeps.",
        "vin": "5uxta6c0xm9"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/18/2021",
        "dateOfIncident": "08/18/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429666,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "SRS (airbag system) unit that is located underneath center console cupholder can be damaged by a small amount of liquid. Once SRS is damaged, a restraint system failure notification is alerted and the vehicle becomes immobile.  Similar recall was issued in the past : Recall Number 96V107000  Manufacturer stated that neither the cupholder nor SRS unit is not watersealed. As the SRS unit seats directly underneath the non-watersealed cupholder it is not surprising to say that this may cause liquid damage while vehicle is in motion.  Incident : Vehicle was purchased June 2021, a week later a restraint system failure notification was displayed. Towed the vehicle back to the deaelarship and found out that the SRS unit was damaged due to liquid. Dealer explains that liquid may leak through the cupholder and disable SRS unit.  SRS unit was replaced with new, but no other prevention was made.",
        "vin": "5UXCR4C08M9"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/14/2021",
        "dateOfIncident": "07/15/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429142,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Lower tailgate failed and caused me to dump a load of groceries on a busy highway.  Vehicle was inspected and it was determined that a spindle connected to a motor had failed. The tailgate must be opened and closed manually now.  There were no messages of failure or warning that the rear tailgate was unlocked when this grocery incident occurred.   I am a member of a Facebook forum related to this vehicle and many other owners whose vehicles were made in the same time frame have experienced this failure. The part has been on back order for a month.",
        "vin": "5UXTA6C07M9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/30/2021",
        "dateOfIncident": "05/21/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427137,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "My BMX X5 45e SUV shuts itself off once the driver's door is opened turning off the car and all systems, including the Air Conditioning. There is an option in the menu to NOT allow the vehicle to shut off when the driver's door is opened.  That has no affect on the operation at all. As if there is a software glitch ignoring this menu selection. I've contacted the BMW Genius line 2 times and they advised this should not be happening. The dealer advised, after inspection, this is how the car is designed. On several occasions I've had people in the car, to include my disabled parents and had to run errands... That leaves them in the vehicle without any air. There is a \"pre condition\" feature you can activate Only if there is battery power left on the vehicle. My disabled father was found trying to stand outside in 96 degree weather a couple weeks ago while I was attempting to get his prescriptions after a medical appointment.  The system had shut itself off with him in the car and the inside of the vehicle was well over 115 degrees. The problem occurs all the time. I currently have a loaner X3e and that SUV DOES stay on when in sport mode (using combustion engine). I have 2 separate videos of the X3e where the vehicle does Not turn itself off after I open the drivers door and get out.  I feel the design of my X5e is a huge safety issue putting people's lives at risk!  I'd be happy to speak to someone about this issue if needed and am willing to have the vehicle inspected as well. There are no warning lights or indicators that go off and the vehicle has been inspected by the dealership twice since being purchased on 5/14/21, last inspection was yesterday 7/29/21.  Again, I don't understand why BMW is giving different answers and why another vehicle does not have the same potential life safety issue.",
        "vin": "5UXTA6C05M9"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/13/2021",
        "dateOfIncident": "07/10/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424536,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle was being driven and showed power supply issue and then flashed a drive train warning and lost propulsion power. The vehicle started hopping / jerking. The A/C stopped working and the center console became intensely hot to the touch; so much so it was uncomfortable to keep you hand on the center console.   The vehicle is currently at the dealership stating they believe a software update was needed. The issues mirror those that occurred when the car failed as a result of a previous EV battery recall.  Issue concerns me as the intense heat created makes me concern about of potential electrical fire or failure when driving at higher speeds.   Occurred on July 10, 2021.",
        "vin": "5UXTA6C02M9"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/07/2021",
        "dateOfIncident": "06/09/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423701,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "On 6/8/2021, when pulling out of my driveway approximately 9:00 am, I experienced the car switching from Hybrid mode to Sport mode without me engaging the Sport mode control.   The following day (6/9/2021), after a day of primarily interstate driving (over 200 miles), while stopping at a red light, I felt the brake pedal fall to the floor faster than I was applying pressure and I came to a sudden stop.  The brakes had seized and the car was towed to Thompson BMW.  The tow driver was able to release the brakes by pulling up the brake pedal.  Thompson BMW could not recreate the brake failure but their diagnostics indicated brake failure.  BMW NA was called as my car was less than 6 months old with 9724 miles.  The service advisor told me that they were instructed to replace the Master Cylinder but could not tell me why brakes failed.  Knowing that this was a significant safety concern, I opened a safety complaint with BMW.  BMW could not tell me the root cause of the brake failure and as a result, I had no confidence that the problem was “fixed”.  Master cylinders rarely fail. They also refused to provide me the diagnostics report. They said I was only entitled to the maintenance invoice.  Linda Vitale was assigned my complaint and in a voicemail, told me I lost power to the DSCI module.  She said the DSCI “has a fail-safe mode and if no power was present the conventional brakes” would work.  They replaced the DSCI module and “it should be fine.”  Based on her email, and then conversation, BMW engineering said I had an electrical issue.  So why did the conventional brakes fail? I am very concerned that BMW has not identified the real problem and I can experience this brake failure again. If this failure had occurred while braking on an interstate highway, I could have been killed or vehicle could have caused fatal accident.  I am extremely concerned about the safety of this vehicle, especially since over 60% of my driving in on highways and interstates.",
        "vin": "5UXTA6C0XM9"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/24/2021",
        "dateOfIncident": "06/08/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422175,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 BMW X5. The contact stated while reversing out of their driveway and making a right turn, the display screen on the center console went red. The contact depressed the brake pedal and the pedal went all the way to the floor. The contact took their foot off the brake pedal and depress on the accelerator pedal, when the contact noticed the display screen showed the vehicle went from hybrid mode to sports mode on it's own. The driver had to press the hybrid button to get the vehicle back to normal. However, the next day the contact was driving at an undisclosed speed and approaching a red light when they depressed the brake pedal the vehicle jerked  to a stop. The contact then depressed the accelerator pedal but the vehicle would not move. The contact waited a few moments and depressed the accelerator pedal again this time the vehicle was slowly moving forward. The contact was able to pull over to the side of the road. The vehicle was towed to a local dealer who inspected  the vehicle but was not able to duplicate the failure.  However, they stated that the failure was related to the brake system and replaced the master cylinder.  Although, the vehicle was repaired the contact was concerned that the dealer could not provide the reason the failure occurred on the vehicle. The manufacturer was made aware of the failure. The failure mileage  was 9,700.",
        "vin": "5uxta6c0xm9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/21/2021",
        "dateOfIncident": "05/21/2021",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418033,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The cars hybrid batteries caught fire while sitting in garage being charged. After car was removed from garage and fire department had things \"under control\" which took about 2 hours they left saying it would be towed in the morning. About 30 minutes later the car exploded setting fire to the house. The house was saved the car is nothing more than a burnt shell, a total loss. Thank God no one was hurt but I see where BMW had a ton of recalls on the 2020 version on the exact version of this vehicle for the same thing. Obviously nothing was fixed.",
        "vin": "5uxta6c02m9"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/28/2021",
        "dateOfIncident": "04/27/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414335,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "DROVE AT THE SPEED OF 75 MPH IN THE HIGHWAY ALL IN A SUDDEN THE CAR LOST POWER UNTIL ITS SPEED DROPPED TO 62 MPH. IT IS A HYBRID. DASH BOARD SHOWED SOME RESERVED BATTERY POWER AND HALF TANK OF GASOLINE. IT IS A BIG SAFETY ISSUE. NEED TO FIND THE CAUSE OF IT.",
        "vin": "5UXTA6C05M9"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/26/2021",
        "dateOfIncident": "04/24/2021",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413936,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A NEW BMW X5 2 MONTHS OLD WITH 2000 MILES.  THE VEHICLE WAS PARKED NOT RUNNING WITH NO POWER IN MY GARAGE.  ON SATURDAY MORNING IT SPONTANEOUSLY COMBUSTED INTO FLAMES.  I HAPPENED TO BE NEAR THE GARAGE AND SPOTTED THE FLAMES 4-5 FEET TALL SHOOTING OUT FROM HOOD.  I IMMEDIATELY RAN INSIDE TO ENSURE MY FAMILY WAS EXITING THE HOUSE AND WE CALLED 911.  I ATTEMPTED TO EXTINGUISH THE FLAMES WITH A HOSE WHILE WAITING ON THE FIRE DEPT.  THEY ARRIVED AND EXTINGUISHED AND CUT ALL ELECTRICAL POWER TO THE VEHICLE AND WINCHED IT OUT OF MY GARAGE.  VERY UPSETTING AND DISTURBING THAT THE NEW VEHICLE RANDOMLY BURST INTO FLAMES WHILE SITTING IN GARAGE.",
        "vin": "5UXCR6C09M9"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/13/2021",
        "dateOfIncident": "04/13/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407871,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "MY X5 WAS PARKED IN MY GARAGE AND STARTED BY ITSELF WHILE I WAS OUTSIDE OF MY HOUSE WITH GARAGE DOORS CLOSED. I WAS ABLE TO STOP THE ENGINE BY USING THE BMW CONNECTED APP. I DID NOT HAVE ANY SCHEDULED OR PROGRAMMED START EVENTS.I CALLED BMW CORPORATE AND WAS TOLD TO TAKE THE X5 TO A DEALER FOR A DIAGNOSTIC SCAN WHICH COULD NOT BE SCHEDULED FOR TWO DAYS FROM NOW.",
        "vin": "5UXCR6C0XM9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/11/2021",
        "dateOfIncident": "01/11/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388037,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "2021 BMW X-5. CONSUMER WRITES IN REGARDS TO EXTENDED BATTERY RANGE SAFETY RECALL. *LD    THE CONSUMER STATED THE VEHICLE WAS BEING SOLD WITH A FAULTY BATTERY. *JS",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/04/2021",
        "dateOfIncident": "12/28/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386420,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "SEAT BELT TENSIONER WOULD NOT RELEASE AND CONTINUED TO TIGHTEN AROUND CHILD'S WAIST. COULD NOT EXTRACT THE CHILD AND HAD TO CUT SEAT BELT LOOSE.",
        "vin": "5UXTA6C00M9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/09/2020",
        "dateOfIncident": "12/09/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11382731,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2012 BMW X5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V601000 (ELECTRICAL SYSTEM) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. AN UNKNOWN DEALER WAS CONTACTED AND CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5UXTA6C04M9"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/01/2020",
        "dateOfIncident": "11/29/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377377,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAD 2 ALERTS 2.5 HRS INTO JOURNEY, HAVING GONE I-675 TO 16: 1. DRIVETRAIN MALFUNCTION 2. POWER SUPPLY. I HAD STOPPED FOR FOOD.  I GOT BACK IN, TURNED ON THE ENGINE, AND THESE ALERTS CAME ON IMMEDIATELY.  I CALLED BMW, THEY SAID CAR SHOULD NOT BE DRIVEN. HAD IT TOWED TO HILTON HEAD BMW. THEY'VE HAD IT TWO DAYS AND SAY THIS IS RELATED TO THE RECALLED BATTERY AND THEY HAVE NO IDEA AS OF TODAY HOW TO FIX IT. THEY SAID THIS PROBLEM IS HAPPENING ALL OVER. I ALSO GOT A THIRD MESSAGE ABOUT DRIVING ASSISTANCE SUPPORT LAST WEEK THAT I WAS TOLD TO IGNORE.",
        "vin": "5UXTA6C05M9"
    }
]