[
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/29/2021",
        "dateOfIncident": "12/05/2021",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 11445486,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact's son owned a 2021 Chevrolet Colorado. The contact stated that while her son was driving on a county road at an undisclosed speed, the vehicle inadvertently crashed into a tree  4-6 feet away from the road, and caught fire. No further information was available on the occurrence of the crash. The contact stated that the air bags may have failed to deploy. The fire was extinguished with the assistance of the fire department. The contact's son may have been pronounced dead at the scene. The contact's son was transported out of the vehicle with the assistance of emergency units and was airdropped to the hospital, where it was diagnosed that he sustained brain hemorrhage and third-degree burn on 65% of his body. The contact was unsure whether a fire department report was filed. A police report was filed.  The vehicle was towed to an auto body shop where it was totaled. The dealer and the manufacturer were not notified of the failure. The failure mileage was approximately 5,000.",
        "vin": "1GCGTCEN7M1"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/03/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439172,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "My radio volume goes nuts and the controls go unresponsive,  The unit brings the volume up to max I can not hear emergency crews if they are using the siren.  This also creates a safety issues as now I am taking my eyes off the road to try and stop the problem.  The infotainment system is failing yes the truck is available for inspection.   I have taken video of the problem and sent it to the dealer.  The vehicle has not been inspected by police or insurance rep,  as far as manufacturer as this truck has been back to the dealer more then 4 times I fell that would be the manufacture as they are certified by GM.  GM knows that there is an issue with the infotainment system,  not sure why they have not done a recall on this unit.    No warnings are given before this happens.   This problem first showed up when the truck had about 3,000 miles on it I bought the truck brand new.",
        "vin": "1GCGTDEN7M1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/10/2021",
        "dateOfIncident": "08/09/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432474,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "This is to inform you of a safety-related vehicle service which may appear as a safety-related defect. Not only does it have the potential to affect each (1) vehicle which is serviced at such a facility but it also has the potential to affect (2) multiple vehicles across the federal interstate highway system as well as (3) properties and (4) human life. Every vehicle traveling on a roadway, bridge, overpass, through a tunnel, through mountain passes, construction zones, etc may be at increased risk in encountering any vehicle serviced at such a facility if such improper service is not discovered and corrected prior to catastrophic failure.",
        "vin": "1GCHTCENXM1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/12/2021",
        "dateOfIncident": "08/11/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428819,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I purchased a brand new Colorado earlier this year.  The vehicle currently has about 9,000 miles on the odometer.  On two recent occasions within 1 1/2 weeks of each other while driving at highway speeds, there was a clunk noise and the transmission acted as if it had been shifted into neutral.  The truck would not accelerate, and the RPMs were very high as I was pushing the accelerator and the vehicle was not responding but the engine was revving.  This was an extremely scary and unsafe situation as cars were behind me and I narrowly avoided being hit as I tried to get over to the side of the road without any ability to accelerate.  The first time it happened, after placing the vehicle in park and waiting a few minutes, I was able to get it back into gear and I drove straight to the dealer.  The dealer \"was unable to replicate the problem\" and told me it was probably just a one-time \"glitch.\"  Approximately 1 1/2 weeks later, it happened again.  I took it back to the dealer.  The dealer stated that the computer showed error codes P0700 and P2817, both of which are faulty transmission codes.  The dealer stated that the technician cleared the codes, drove the vehicle, and was once again \"unable to replicate the problem.\"  The dealer stated that it was going to request assistance from Chevy's engineers because it could  not figure out what was wrong with the vehicle.  I don't believe the vehicle is safe to drive at this point, as I narrowly avoided being in an accident on two occasions within 1 1/2 weeks of each other due to the failure of the vehicle's transmission to work appropriately.",
        "vin": "1GCGTDEN1M1"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/30/2021",
        "dateOfIncident": "06/27/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422982,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 Chevrolet Colorado. The contact stated while towing a 2020 Forest River ePro 20BHS, the service DEF system malfunctioned, not allowing the contact to view the temperature and the towing controller. The contact stated the check engine warning light was illuminated. The vehicle was taken to a local dealer where it was diagnosed with the DEF system needing to be regenerated. The vehicle was not repaired. The manufacturer had not been informed of the failure. The failure mileage was approximately 29,000.",
        "vin": "1GCPTDE14M1"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/28/2021",
        "dateOfIncident": "10/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 11414238,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT CALLED ON BEHALF OF HIS CLIENT'S FATHER WHO OWNED A 2021 CHEVROLET COLORADO. THE CONTACT STATED WHILE THE CLIENT'S FATHER WAS ATTEMPTING TO TURN AROUND ON A NARROW ROAD, THE VEHICLE FELL OFF A CLIFF AND CRASHED INTO A CREEK BED. THE AIR BAGS DID NOT DEPLOY. THE DRIVER PASSED AWAY DUE TO A BROKEN NECK AND FRACTURED SPINE. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO A TOW LOT. THE VEHICLE WAS DEEMED TOTALED BY THE INSURANCE COMPANY. A DEALER WAS NOT CONTACTED. THE MANUFACTURER HAD BEEN INFORMED OF THE FAILURE AND INSPECTED THE VEHICLE. THE FAILURE MILEAGE WAS 950.",
        "vin": "1GCGTBEN5M1"
    },
    {
        "components": "POWER TRAIN,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/25/2021",
        "dateOfIncident": "09/16/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413847,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED A NEW TRUCK AND WERE SHOCKED TO SEE THE LACK OF BASIC SAFETY FEATURES. WE ARE HAVING A HARD TIME GETTING IN IT BECAUSE OF A LACK OF STEP BAR AND GRAB HANDLE ON THE DRIVER SIDE. THE EMERGENCY BRAKE PEDAL IS IN THE WRONG SPOT AND TRIPS US. THE CRUISE LIGHT CANNOT BE SEEN WHILE DRIVING.  THERE IS A LACK OF SHIELDING IN THE WHEEL WELLS EXPOSING THE ENGINE AND EXHAUST.  IT IS FULLY EXPOSED ALL ALONG THE BOTTOM (NO SHIELDS AS NORMAL).  THE FUEL SYSTEM DOESN'T LOCK AND IS VULNERABLE TO TAMPERING.  THE INTERIOR MATERIALS ARE ALL EXTREMELY CHEAP AND THE A/C IS VERY WEAK. THE TRANSMISSION SHIFTS WEIRDLY AT TIMES WHICH IS SCARY.  YOU CANNOT ADJUST THE MIRRORS BECAUSE THEY ARE MANUAL AND UNSAFE WHILE DRIVING.  WE ARE SHOCKED AT 26K GETS US A NEW VEHICLE THAT HAS SO MANY OMISSIONS ON IT - IT SHOULD NOT BE PERMITTED WHEN SO MANY STANDARD SAFETY EXPECTATIONS ARE UNMET.",
        "vin": "1GCGSBEA7M1"
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/15/2020",
        "dateOfIncident": "10/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383543,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK HAS VIBRATION WHEN AT HIGHWAY SPEEDS AND DURING DECELERATION. ALSO SQUEAKING NOISES COMING FROM SUSPENSION. TRUCK HAS 4642 MILES.",
        "vin": "1GCGSCENXM1"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/06/2020",
        "dateOfIncident": "11/07/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378155,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WINDSHIELD IS DEFECTIVE - WITHIN A MONTH OF OWNING THIS NEW TRUCK ONE STRIKE AGAINST IT (WHILE ON THE HIGHWAY) (OUR FIRST WINDSHIELD STRIKE) BROKE IT VERY SIGNIFICANTLY - CRACKED THROUGHOUT.  I AM ABOUT 60 YEARS OLD AND HAVE OWNED MANY, MANY VEHICLES - WE HAVE NEVER SEEN A WINDSHIELD BREAK SO FAST AND SO SEVERELY.  WE DID AN INTERNET SEARCH AND THERE ARE MANY OTHER CHEVY COLORADO OWNERS THAT HAVE MADE THE SAME OBSERVATION - MANY ARE SAYING IT IS CHEAP, UNUSUALLY THIN GLASS FOR FUEL ECONOMY OR FOR LESS EXPENSE, OTHERS SAY CHEVY HAS NOT INSTALLED THEIR WINDSHIELDS WITH THE PROPER AMOUNT OF ADHESIVE BEHIND IT.  OWNERS SAY THE AFTER MARKET REPLACEMENT DOESN'T EASILY BREAK ON IMPACT LIKE THIS FACTORY ORIGINAL WINDSHIELD DOES.  I AM NOT A SCIENTIST - ALL OUR FAMILY KNOWS IS THAT IT WAS NOT SAFE TO HAVE THIS FACTORY WINDSHIELD ON THIS NEW TRUCK AND WE DON'T FEEL SAFE DRIVING THE VEHICLE WITH A WINDSHIELD THAT DOESN'T PROTECT US PROPERLY WHILE ON THE HIGHWAY.  THIS WAS ONLY ONE IMPACT ON THE GLASS AND THE WHOLE WINDSHIELD IS DAMAGED SIGNIFICANTLY TO WHERE YOU CAN FEEL THE SHARP EDGE WITH YOUR FINGER FROM THE OUTSIDE OF THE VEHICLE.  THERE ARE OTHER ISSUES WITH THIS 2 MONTH OLD TRUCK BUT THIS WINDSHIELD IS A SAFETY ISSUE FOR ALL CONCERNED AND THESE TRUCKS NEED A TSB OR RECALL FOR OWNERS THAT HAVE THIS DEFECTIVE, FLIMSY WINDSHIELD.",
        "vin": "1GCGSBEA7M1"
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/20/2020",
        "dateOfIncident": "10/18/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365452,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "WAVY WINDOWS IN ALL 4 DOORS ON A BRAND NEW 2021 CHEVY COLORADO. DEALER WON'T REPLACE GLASS, WINDOWS ARE ALL MISSHAPEN AND HAVE SPECKS THROUGHOUT ALL THE WINDOWS. MAKES IT HARD TO SEE AT NIGHT WHILE DRIVING.",
        "vin": "1GCGSCEN0M1"
    }
]