[
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/27/2022",
        "dateOfIncident": "02/05/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11454319,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "We were hit perpendicular to the passenger side door of our 2021 Camaro. The side airbag(s) did not go off. The other vehicle was going about 15-20 mph upon impact. The right side of our car was seriously smashed in. Its a good thing the passenger was not killed or injured and this is a law of physics abnormality.",
        "vin": "1G1FF1R73M0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/08/2021",
        "dateOfIncident": "10/12/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11439752,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "there is a burning oil smell, that is so pungent it causes nausea and burning of the eyes when driving the vehicle. have taken it to 2 separate dealerships, the first told me they could not find an oil leak and i would have to deal with it. the second dealership stated that it is a valve on the back of the motor and that there is nothing they can do about it. i was told not to roll down the windows and to leave recirculate on. called and spoke to gm directly and they state take it to a third dealer and they denied my request to send a master tech to check the vehicle. i am left with driving a car that leave me nauseated and is a possible hazard to drive.",
        "vin": "1g1fh1r74m0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/17/2021",
        "dateOfIncident": "01/17/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388603,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM NOTIFYING NHTSA OF THIS INCIDENT FOR THE RECORD. I PURCHASE THIS VEHICLE ON 9/30/2020 ... AFTER 3 SHORT TRIPS TO KEEP FLUIDS MOVING AND THE BATTERY CHARGED DURING THE BREAK IN PERIOD THE CAR HAS BE SETTING UNDER A CAR COVER WITH 426 MILES ON IT.  I AGAIN STARTED TO GO FOR A RIDE ON 1/17/2021TO DO ANOTHER BREAK IN RIDE. THE CAR STARTED WELL AND WHEN I PUT IN DRIVE I NOTICED A SHUTTERING AND THE TRANSMISSION INABILITY TO SHIFT SMOOTHLY. AFTER JUST A FEW MILES I NOTICED SHIFTING AND SLIPPING WAS STARTING TO BE MORE FREQUENT SO FOR SAFETY REASONS I BROUGHT THE CAR BACK HOME. WHILE TURNING INTO MY STREET THE CAR TRANSMISSION FAILED AND SLIPPED AND STOPED IN THE MIDDLE OF A TURN JUST NARROWLY AVOIDING AN ACCIDENT. THE TRANSMISSION IS ALL OVER THE PLACE WHEN SHIFTING, ENGAGING AND TAKING OFF. THIS CAR CAN NOT BE DRIVEN SAFELY AT THIS TIME IT IS NOT SAFE AND I FIND OUT THROUGH RESEARCH IT IS AN ONGOING PROBLEM WITH GM WITH LITIGATION IN PROGRESS ON THIS ISSUE. WHY AND HOW CAN GM STILL SELL THESE CARS WITH THIS ISSUE STILL PRESENT. I CAN NOT TAKE A CHANCE WITH THIS CARE AS IS MY LIFE AND THE LIFE OF MY FAMILY DEPENDS ON IT. .THANK YOU IN ADVANCE FOR YOUR ATTENTION AND SUPPORT WITH THIS MATTER.",
        "vin": "1G1FF1R70M0"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/04/2021",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386457,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2021 CHEVROLET CAMARO EQUIPPED WITH THE HILL START ASSIST FEATURE. THE CONTACT STATED THAT THE VEHICLE HAD A MANUAL TRANSMISSION. WHILE STOPPED ON AN INCLINE WITH THE BRAKE PEDAL AND CLUTCH PEDAL DEPRESSED, THE HILL START ASSIST FEATURE ACTIVATED, LOCKING THE TRANSMISSION TO PREVENT THE VEHICLE FROM ROLLING BACKWARDS. THE CONTACT STATED THAT WHILE ATTEMPTING TO MOVE FROM THE STOPPED POSITION, THE CLUTCH PEDAL AND ACCELERATOR PEDAL WERE DEPRESSED SIMULTANEOUSLY HOWEVER, THE HILL ASSIST FEATURE HESITATED TO RELEASE FOR APPROXIMATELY 2-SECONDS CAUSING THE VEHICLE TO ROLL BACKWARDS. THE CONTACT WAS CONCERNED ABOUT A POSSIBLE ACCIDENT DURING THE TWO SECOND DELAY WHEN THE FEATURE FAILED TO DEACTIVATE IMMEDIATELY. ANOTHER CONCERN WAS THAT THERE WAS NO WAY TO OVERRIDE THE FEATURE. REYMORE CHEVROLET (746 N MAIN ST, CENTRAL SQUARE, NY 13036, (315)668-2673) WAS MADE AWARE OF THE FAILURE. THE CONTACT WAS INFORMED THAT THE HILL START ASSIST FEATURE WAS INCLUDED IN THE VEHICLE'S SAFETY FEATURES AND COULD NOT BE DEACTIVATED. THE CONTACT STATED THAT HE BELIEVED THE ISSUE TO BE A DESIGN FLAW AND NOT A FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT CONTACTED NOR NOTIFIED OF THE ISSUE. THE APPROXIMATE FAILURE MILEAGE WAS 260.",
        "vin": "1G1FG1R77M0"
    }
]