[
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/31/2022",
        "dateOfIncident": "02/23/2022",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459057,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Got it in the car and pushed the push start button. The cars engine turned over only half way and started to restart and turn over multiple times even though the motor was running halfway. This went on for 15 minutes until i opened up the hood and looked down and after a couple minutes the engine seized and turned off and started smoking, shortly after started on fire from the bottom of the engine. The fire went on for 10 minutes until we turned it off.",
        "vin": "1FMSK7FH0MG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/21/2022",
        "dateOfIncident": "03/18/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457587,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Approximately 1.5 months ago, my ford explorer started having issues with shifting frm drive to reverse or reverse to drive, stopped to reverse and stop to drive. I had my oil changed and there were 2 updates to the transmission that were done. The problem persists. When going through a car wash in which you put the car in neutral and ride through as it washes, I placed the car in neutral and almost hit the vehicle in front of me due to it taking 3-4 seconds to shift from drive to neutral.",
        "vin": "1FMSK7FH7MG"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/18/2022",
        "dateOfIncident": "03/18/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457248,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I'm writing to you to relay a serious safety issue that started with the 2021 Explorer ST manufacturing processes. When Ford designed the new Explorer ST, the rear subframe was engineered to allow the rear differential to be attached with four bolts (Attachment-A). This was needed to properly secure the differential in light of the ST motor putting out more horsepower than their other models. My 2020 Explorer ST had the correct subframe with two bolts (Attachment-B.)  At some point during the manufacturing of the 2021 ST models, Ford started using base-model Explorer rear subframes that contained a single bolt (Attachment-C) on the rear portion of the subframe. This was likely done due to the global shortage of parts and materials that most automotive manufacturers encountered. The results were predictable, and many users in Explorer discussion groups have reported the single-bolt shearing off, dropping the differential and damaging the rear suspension components and exhaust (Attachment-D & E.)  This is a glaring safety issue, especially with a performance car, as a failure at speed could result in loss of control of the vehicle. To date, Ford has not responded to my inquiries requesting more information and a resolution. They did recently release a Special Service Message acknowledging that this is an issue (Attachment-F.)  The thread below on explorerst.org outlines the problem in detail. There are dozens of people there and in the Explorer ST groups on Facebook that have encountered this problem, with varying levels of successful resolution and attention from Ford. I'm happy to provide additional links to conversations about this, if needed.  https://www.explorerst.org/threads/rear-end-damage.2602/  I represent a growing group of ST owners who would like Ford to issue a recall, and repair their vehicles before a failure occurs.",
        "vin": "1FM5K8GC1MG"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "03/09/2022",
        "dateOfIncident": "03/06/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11455879,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact leases a 2021 Ford Explorer. The contact stated while his wife was driving at 25 MPH with Co-pilot 360 assist mode and the evasive steering assist engaged, she lost control of the steering wheel. The contact stated that his wife could not feel the connection between the steering wheel and the front tires of the vehicle. The contact stated that the vehicle made a sharp right turn and crashed into a telephone pole. There were no warning lights illuminated.  The air bags deployed. The contact 's wife sustained bruises and lesions on the ankle, knee cap, arms and on her left breast but did not seek medical assistance. A police report was filed. The vehicle was towed to a tow lot.  The vehicle was then towed to another tow lot where it was totaled. The dealer was not notified of the failure. The manufacturer was notified of the failure and informed the contact that they could not assist. The failure mileage was approximately 12,000.",
        "vin": " 1FMSK8DH5M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/02/2022",
        "dateOfIncident": "06/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454819,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 Ford Explorer. The contact stated while driving at 50 MPH, the vehicle started to hesitate as if the transmission was slipping. There were no warning lights illuminated. The contact drove the vehicle to an unknown dealer where it was diagnosed that no issues were found. The manufacturer was notified of the failure. The failure mileage was approximately 11,100.",
        "vin": "1fmsk7dh3mg"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/28/2022",
        "dateOfIncident": "02/17/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454405,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Audio Control Module failed on 2/17/22. No audio for Forward Collision Warning, Rear Cross Traffic Warning, and  reverse sensors. Dealer replace ACM, which fixed the issues on 2/22/22. However on 2/27/22, the speakers started making a popping crackling noise and front speakers went out. Then a few minutes later, no audio for about 15 minutes, but the popping noise still continued. After no audio for about 15 minutes the driver side speakers started to work, but the popping noise continued. Vehicle will be going back to the dealership.",
        "vin": "1FMSK7DHXMG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/03/2022",
        "dateOfIncident": "01/17/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450125,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 Ford Explorer. The contact stated that while driving at various speeds, the transmission would suddenly downshift or upshift erroneously. Additionally, while operating the vehicle a grinding sound was present while the transmission was shifted into drive with a chemical odor inside the cabin of the vehicle. The cause of the failure was not yet determined. The local dealer and manufacturer were notified of the failure. The failure mileage was 7,500.",
        "vin": "1FM5K8GC7MG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/01/2022",
        "dateOfIncident": "01/28/2022",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449762,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owned a 2021 Ford Explorer which was used to haul a 2002 Opus OP. The contact stated that while the vehicle was at the RV dealer for installations to be performed the vehicle caught on fire and was destroyed. The contact was informed after the installation of an electronic brake controller was completed the vehicle was parked and approximately 20 minutes later flames were present coming from the engine compartment. The fire department was called to the scene and extinguished the flames. The vehicle was destroyed. Prior to the incident an electric brake controller was installed in the vehicle and wired DC to DC in order to send a charge to the tow vehicle. The manufacturer was made aware of the failure and a case was opened. The fire department indicated that the fire originated in the engine compartment. A fire report was taken at the scene. The failure mileage was 3,807.",
        "vin": "1FM5K8GC6MG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/01/2022",
        "dateOfIncident": "02/01/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449820,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Upon starting the vehicle, after it had been parked for about 30 min, I received an error message Stop Safely Now and the vehicle would not start.  We attempted to jump start the battery with another vehicle, tested the voltage and it showed full at 12V, and then had a roadside service attempt to jump the vehicle.  The accessory power (radio/lights/power windows) work.  This has never happened before and the car had no indication of any issues, alerts or messages prior to this.",
        "vin": "1FM5K8FW1MN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/13/2022",
        "dateOfIncident": "01/12/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11447286,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "A police officer complained of a strong odor of exhaust coming through the hvac vents. Officer complained of a  light dizziness feeling. Suv was grounded from service. Complaint was verified. Upon opening of the hood a odor of exhaust gas  was smelled on the right side of the motor. No visible leaks could be heard or seen. Suv was driven to our local Ford dealer for repair.",
        "vin": "1FM5K8AB2MG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "01/11/2022",
        "dateOfIncident": "10/20/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447016,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I took possession of a Ford Explorer approximately October 12, 2021.  Two weeks later on October 20, 2021, I took the car to a carwash and after paying with a credit card, the barrier went up and as I was putting my card back into my wallet, and my foot not on the accelerator, the car took off on its' own to approximately 20 to 25 mph, so I applied the brakes and the pedal went to the floor with no braking.  I applied the brakes continually, as the car jumped a curb traveled through a meadow went through a fence and crashed into a tree.  I had the car towed to the dealer so they could analyze what went wrong and they said they couldn't find anything wrong, but they couldn't say as to why the Explorer spontaneously accelerated without brakes.  The carwash had a video surveillance system and the video clearly shows the car accelerating, jumping the curb and eventually going into the forest to hit a tree.  It is a blessing that I was in a remote area with no people around as the only control I had for the vehicle was steering and had there been people around someone would have been injured or killed.  I contacted the Texas DMV Lemon Law department and they couldn't help because I hadn't tried to get the malfunction repaired more than three times.  They did recommend I contact the NHTSA as safety of this vehicle and possibly others of the type represent a major safety hazard.  Is there anything the NHTSA can do to look into this case and first see that this malfunction is fixed on future products and second see that I can be treated fairly by the Dealer and Ford Motor Company?  The car has been declared a total loss, as it would cost too much to repair.  It is in a AAA Insurance lot.",
        "vin": "1FMSK7FH7MG"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/20/2021",
        "dateOfIncident": "12/06/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11444445,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 Ford Explorer. The contact stated that he was driving approximately at 55 MPH when a deer jumped out in front of his vehicle. As a result, the contact crashed into the deer and the air bags did deploy, however when it did it was very aggressive. The contact stated that he and his wife were both sustained multiple injuries caused by the airbags. The contact stated the passenger suffered injuries to both her eyes causing blindness and isn't certain if it would be permeant. The contact stated that he sustained injuries to his wrist, neck, and leg. The contact stated the ambulance was called and took them to the hospital where they received treatment. The contact stated the vehicle was towed to a junkyard service, and from there towed to the dealer where it remains currently. The contact was advised that his vehicle may be totaled and that he should await further details. The failure mileage was 3,000.",
        "vin": "1fmsk8dh0mg"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/14/2021",
        "dateOfIncident": "12/06/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443800,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact leased a 2021 Ford Explorer. The contact stated while driving approximately 25 MPH, the vehicle accelerated independently. The contact stated that five minutes later the vehicle went into safety mode and the vehicle failed to move. The low battery message was displayed. The vehicle was towed to the residence. The contact called the local dealer but, the vehicle was not diagnosed or repaired. The manufacturer was not contacted. The failure mileage was approximately 7,600.",
        "vin": "1FM5K8FW7MN"
    },
    {
        "components": "SEATS",
        "crash": true,
        "dateComplaintFiled": "12/14/2021",
        "dateOfIncident": "11/26/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11443819,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The vehicle was involved in a rear-end collision.  When the collision occurred, both front seats dropped into a fully reclined position and locked fully reclined.",
        "vin": "1FM5K8HC4MG"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/13/2021",
        "dateOfIncident": "11/25/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443642,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "On 11/25/2021, I started the vehicle and drove about 2 miles when I noticed that the airbag light was illuminated on the dash.  Knowing that this is a safety concern, I pulled into a parking lot and shut off the vehicle.  I let the vehicle sit for about 30 seconds and restarted the car.  When restarted, the light did not come back on.  Took the vehicle in to have a recall performed and told the service advisor that the light had come on.  They confirmed that there was a \"stored code\" but \"not something that made sense\".  The dealership has had the vehicle for 9 days with no resolution.  They say that a wiring pigtail harness needs replaced but also that there is a fault in the driver's seat airbag.  The replacement airbag is not available due to a backorder (told 3-4 weeks).  I feel that this is a large safety concern as I was told I could pick up the vehicle until the parts become available knowing that there is a fault in the airbag.  The failure occurred with 3410 miles on the odometer.",
        "vin": "1FM5K8FW7MN"
    },
    {
        "components": "STRUCTURE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/09/2021",
        "dateOfIncident": "10/25/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443304,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "On October 25, 2021; my wife and I were driving across country when we experienced a blow-out at 75 MPH in New Mexico (about 80 miles west of Amarillo. The blow-out was caused by body cladding, which came off the right rear door of our 2021 Ford Explorer - apparently attributable to 19+ MPH desert cross winds at highway speeds of 75 MPH. The trim lodged in the right rear wheel well; slicing the tire and cutting a gash from the aluminum rim. We had to get to California for a scheduled closing on our new home and were therefore unable to stay in Amarillo or Albuquerque for the three days required to receive a matching rim and tire, so I had a nearby tire store install a wheel of a different size with an offsetting tire size to approximate the circumference of the stock wheels and tires. Ford has thus far neglected to acknowledge the obvious defect that would allow a body part to blow off the car and has offered no assistance in repairing the car or reimbursing me for the wheel and tire I had to purchase to meet personal legal obligations. I've seen evidence in online forums indicating other incidents of body trim blowing off Ford Explorers at highway speeds. Ford must take responsibility for this defect and reimburse other owners and me for costs incurred to resolve implications of their defective body parts.",
        "vin": "1FMSK7FH5MG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/23/2021",
        "dateOfIncident": "11/23/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441506,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "There is no way to securely lock the vehicle when someone with the key fob is near it. When fueling, someone can unlock the opposite side of the car, by pulling on the door handle, which unlocks it, enter and drive away. Not only does this open the possibility of easily stealing the car, but also abducting passengers, if any have the fob on them, or simply stealing contents, planting contents, etc.  This is a serious security issue",
        "vin": "1fmsk8fh2mg"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/12/2021",
        "dateOfIncident": "11/12/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440203,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "When vehicle is up to temperature, there is an overpowering burning smell coming through the vents into the cab. It only occurs at idle and dissipates when the vehicle is in motion. With the hood open, there is some small noticeable amount of smoke coming from the left side of the engine compartment. The smell is not plastic or rubber.",
        "vin": "1fm5k8gc2mg"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/30/2021",
        "dateOfIncident": "06/05/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438750,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Vibration:  First use of the day, at about 35 MPH vehicle exhibits vibration throughout, especially around 40-41mph. Felt in steering wheel, seat, and with a loud rumble often heard.  Has been since car was new.  Has a vibration in rear view mirror at highway speeds.  Goes away after driving for 15 miles or so, and at least a half hour.  Returns after vehicle cools off.  Cruise control: Adaptive cruise sometimes causes extreme braking at highway speeds for no reason.  This happened while driving past a vehicle on Alligator alley causing all my passengers to comment, even though I had not touched the brake. Happened again 10/28 on 75 coming down from Sarasota.  Braking: ABS engages on dry roads, especially when turning, for example into a driveway, but it cold be just a normal stop for a traffic light.  The brakes also “grab” when coming to final stop, causing the car to stop suddenly",
        "vin": "1fm5k8fw6mn"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "10/21/2021",
        "dateOfIncident": "10/14/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437614,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I had the safety recall 21V735000 performed on October 12, 2021. Within 2 days the same problem of rear-view backup camera blue screen recurred, just as it did before the recall. The problem happens in about 1/3 of trips. Once the blue screen occurs, it doesn't go away until powering off the vehicle, waiting a few minutes, and then upon powering the vehicle on the rear backup camera might work again for a while, but will usually break again the same day.",
        "vin": "1fm5k8fw1mn"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "09/09/2021",
        "dateOfIncident": "05/06/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432323,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "When putting the car in reverse it jerks back if the pedal is touched which has almost caused an accident. It takes about a minute or two to adjust backing up and the rear camera does not show until the clutch has adjusted.",
        "vin": "1fmsk7dh5mg"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "08/16/2021",
        "dateOfIncident": "08/10/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429266,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Third row seat won't go up or down (it is an electrical seat for folding flat or to lift back up for seating). On Aug 12, 2021 took it to Ford dealership near me for any appointment to have fixed. In morning of Friday 13th dealership said still hadn't figured out the problem. By afternoon of 13th August dealership said it is either module or buttons issue and said they needed keep it over weekend. Dealership said they d call me by noon on Monday 16th August to let me know. Well, since I hadn't heard from then I called them again (as I have been doing since they dont seem to communicate with customers). Callie of Service dept said its the buttons/switches. That must order them; closest place had them is Tennessee she said. We are concerned for we had these exact issues with 2015 Explorer; started with 3rd row seat then all other electrical issues started happening. That explorer suv was in shop for several months.",
        "vin": "1FMSK8FH2MG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/16/2021",
        "dateOfIncident": "08/11/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429352,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Constant shuddering between 30-45mph.  Local dealer fobs it off as typical, I've driven other 2020 and 2021 Explorers, none have exhibited similar symptoms. Dealer refuses to repair, Ford corporate will not investigate.  Has already had one rear axle replaced under warranty, not waiting another 3 weeks for parts when this one breaks again.",
        "vin": "1FM5K8FW8MN"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "08/04/2021",
        "dateOfIncident": "07/14/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427704,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Adaptive Cruise control reads the overhead electronic posted 65MPH  speed limit signs as 85MPH.   This only occurs when traveling on I-670 eastbound between Leonard Ave and I-270 on the east side of Columbus Ohio...This section of highway was recently upgraded with \"Smart Lane\"     overhead electronic signs.  The dash on this vehicle shows the posted speed limit at all times, but if the cruise control is on the vehicle with automatically go to what it reads and in this case goes to 85MPH!  I have driven this vehicle over 5000 miles in 4 different states and this situation only occurs at this particular locatiion.  I have contacted State of Ohio, Department of Trtansportation and discussing this issue with Drive Ohio representative Luke Stedke  ( Luke.Stedke@drive.ohio.gov)",
        "vin": "1FMSK8DH1MG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/30/2021",
        "dateOfIncident": "06/28/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423018,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The transmission in the Ford Explorer failed on June 28th. This was noticed by observing the vehicle struggle to shift gears, and sometimes failing to shift at all resulting in extremely high RPMs. It also resulted in rough transitions from Park to Drive, combined with lurching forward suddenly.   The vehicle is currently awaiting service at the Ford dealership, which was originally scheduled for June 29th. Upon notification to the dealership (where vehicle was purchased) of a transmission issue, the dealership moved the appointment to July 6th, thus encouraging me to drive a dangerous vehicle until then. During the next couple of days, the car intermittently exhibited both check engine and service lights, but neither consistently. It also produced another alert which automatically put the car into park from drive. Once the car turned off and back on, the alert did not repeat.  The car was then taken to a separate dealership where it was diagnosed with a defective transmission due to an engine coolant leak. The dealership did not provide any means of transportation in response despite the vehicle being under warranty.",
        "vin": "1FM5K8GC0MG"
    },
    {
        "components": "STEERING,TIRES",
        "crash": false,
        "dateComplaintFiled": "06/24/2021",
        "dateOfIncident": "06/18/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422181,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The front tires chewed to pieces, one blew, and the dealer initially felt it was an alignment issue from the factory.  Up one further inspection, they found an aluminum toe rod with a 45 degree bend.    I believe this was a factory issue as we hit nothing on the highway.  It seems from an FMEA point of view, it is likely the blown tire and momentum of the car bent the tie rod and that the tire damage was caused by a part failure or some other issue with the car.  It is a 3 month old car with 9,400 miles.  The car struck Nothing on the highway.",
        "vin": "1FMSK8DH9MG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/07/2021",
        "dateOfIncident": "03/29/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415587,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED TRANSMISSION FLUID ON THE GARAGE FLOOR. MARCH 27,2021. DROPPED THE CAR OF AT THE DEALERSHIP WHERE I BOUGHT THE CAR. 2021 FORD EXPLORER ST WITH 2120 MILES I PURCHASED ON JANUARY 30, 2021. PROBLEM WAS DIAGNOSED AS LEAKS AT THE TRANSFER CASE SEALS ON THE TRANSMISSION OUTPUT DRIVE TRAIN. THE BOOTS WERE LEAKING TRANSMISSION FLUID. THE TRANSFER CASE NEEDED TO BE REMOVED AND THE SEALS REPLACED. THIS RESULTED IN WAITING 6 WEEKS FOR THE PARTS TO BE DELIVERED AND 1 WEEK MORE TO REPAIR AND INSTALL. TODAY I STILL DO NOT HAVE MY CAR BACK. WEEK 7 WILL BE NEXT WEEK WHEN COMPLETION IS ESTIMATED TO BE .",
        "vin": "1FM5K8GC8MG"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "05/01/2021",
        "dateOfIncident": "04/23/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414737,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A FORD EXPLORER ST 2021 IN NEW YORK FROM CITY WORLD FORD ON BOSTON RD IN THE BRONX ON APRIL 22, 2021 AT APPROXIMATELY 9:37PM. I TOOK MY CAR HOME THE SAME SAME DAY. THE FOLLOWING DAY (SECOND DAY) I STARTED EXPERIENCING A PRE-COLLISION ASSIST NOT AVAILABLE AND POWERTRAIN MALFUNCTION/REDUCED POWER LIGHT ON MY DASHBOARD AT 12:49 PM. THE CAR BEGAN TO JERK AND FELT LIKE IT WAS ON AWD MODE. THE GAS PEDAL WAS HEAVY AND DIFFICULT TO DRIVE WHILE I WAS ON THE HIGHWAY WITH MY CHILDREN. I STARTED TO SMELL FIRE COMING FROM THE INSIDE OF MY CAR. ONCE I STARTED EXPERIENCING THOSE PROBLEMS FROM MY CAR I IMMEDIATELY PARKED THE CAR. I IMMEDIATELY CALLED THE DEALERSHIP DIDN'T GET AN ANSWER SO I DROVE TO THEM PERSONALLY AFTER I LET IT COOL DOWN FOR A COUPLE OF HOURS. I EXPLAINED THE PROBLEM I EXPERIENCED WITH THE CAR TO THEM. THE DEALERSHIP STATED TO ME TO TAKE IT TO THE REPAIR SHOP THE MONDAY AND I DID. THE NEXT DAY (TUESDAY) I PICKED UP THE CAR FROM REPAIR SERVICE CENTER. THE NEXT DAY I STARTED EXPERIENCING THE SAME PROBLEMS WITH THE FORD. I WENT BACK TO THE DEALERSHIP ON WEDNESDAY (NEXT DAY) AND STATED I WANTED A NEW CAR OR EXCHANGE FOR A DIFFERENT CAR. MANAGER STATED I HAD TO TAKE THE CAR FOR SECOND TIME FOR REPAIR. I THEN TOOK THE CAR FOR THE SECOND TIME FOR REPAIR ON WEDNESDAY. THE CAR IS CURRENTLY STILL IN THE REPAIR SERVICE CENTER AND STILL DISPLAYING MALFUNCTIONS AFTER BEING REPAIRED IN THE REPAIR SERVICE CENTER. I HAVE NOT YET RECEIVED MY CAR BACK AND REPAIR CENTER STATED THEY ARE NOT SURE WHEN WILL THE PROBLEM WILL BE FIXED AND WORKING PROPERLY.",
        "vin": "1FM5K8GC2MG"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/20/2021",
        "dateOfIncident": "02/09/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404027,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WHEEL WELLS OF THE VEHICLE COLLECT LARGE AMOUNTS OF SNOW AND ICE. THIS BUILD UP CONSTRICTS THE WHEELS OF THE VEHICLE CONTACTING THE TIRES RESTRICTING ROTATION AND STEERING. THIS IS AN EXTREMELY DANGEROUS POTENTIALLY DEADLY SITUATION. WE HAVE CONTACTED FORD MOTOR COMPANY AND THE DEALERSHIP. NO REMEDY TO THIS SITUATION HAS BEEN OFFERED.  PLEASE INVESTIGATE AND ANY ASSISTANCE IS APPRECIATED.  I BELIEVE THIS IS A WIDE SPREAD PROBLEM FORD IS UNWILLING TO DEAL WITH.  THIS CONDITION OCCURS IN COLD WEATHER AND SNOWY ICY CONDITIONS.  THE BUILD UP HAZARD HAPPENS EVEN DRIVING SHORT HIGHWAY DISTANCES.",
        "vin": "1FMSK8BH2MG"
    }
]