[
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/14/2022",
        "dateOfIncident": "06/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456659,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 Ford E-450. The contact received notification of NHTSA Campaign Number: 22V089000 (Steering, Service Brakes, Hydraulic). The contact stated that while driving at an undisclosed speed, several unknown warning lights illuminated. The vehicle then experienced a loss of power steering assist. The dealer was made aware of the failure but informed the contact that they were not equipped to perform recall repairs on RVs. The manufacturer was made aware of the failure and informed the contact that the nearest dealer able to perform the recall repair was more than 100 miles away. The vehicle was not repaired. The failure mileage was approximately 3,000.",
        "vin": "1fdxe4fn7md"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/24/2021",
        "dateOfIncident": "03/15/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430282,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns 2021 Ford E-450.  The contact stated that while driving at various speeds on the freeway, the contact mentioned that any time another vehicle or object was near the vehicle, it lost steering capabilty. The contact would have to regain control of the steering wheel in order for the steering wheel to resume back to normal. No warning light illuminated. The vehicle was taken to the dealer where it was diagnosed and kept for three days however unable to duplicate the issue. The vehicle was not repaired. The failure recurred. The manufacturer was notified of the failure and was informed to take the vehicle to another dealer to have a second diagnosis test ran. The failure mileage was approximately 11,015",
        "vin": "1FDXE4FN3MD"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/30/2021",
        "dateOfIncident": "07/30/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427139,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "2021 ENTEGRA ODYSSEY. CONSUMER WRITES IN REGARDS TO SAFETY RECALL 20V-780.  THE CONSUMER STATED THAT THE VEHICLE WAS DAMAGED DURING A FLOOR REPAIR. THE FRONT WINDOW SHADE, THERE WAS A LEAK UNDER THE BATHROOM VANITY,, AND THE VANITY TRIM WAS DAMAGED.  THE CONSUMER ALSO STATED THE DEALER WAS SUPPOSED TO ORDER PARTS TO COMPLETE THE RECALL REPAIR. THE DEALER STALLED ON ORDERING THE NECESSARY PARTS.",
        "vin": "1FDXE4FN7MD"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/07/2021",
        "dateOfIncident": "06/18/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423803,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The Service Advance Trac light comes on sporadically. This also triggers the Cruise Control and Hill Start Assist to turn off. Any of these malfunctions could prove to be a safety issue particularly with regard to stability and control of the vehicle. The vehicle has not yet been to a dealer for these issues as we are traveling. The malfunction has occurred about 5-6 times while driving, without any particular triggers.There were no early warnings and the first time the service light came on was June 18th and we were on a two lane flat road doing about 50 mph. The Advance Trac (and cruise/Hill Start) remains non-functional until vehicle is turned off for at least 10 minutes. It then often resets and performs normally until the next failure - which does not seem to be predictable.",
        "vin": "1FDXE4FN5MD"
    },
    {
        "components": "SUSPENSION,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/08/2021",
        "dateOfIncident": "05/07/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415637,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE ADVANCE TRAC KEEPS FAULTING AND DISABLING THE CRUISE CONTROL, ABS BRAKING, HILL HOLDER, AND SKID CONTROL FUNCTIONS, SEEMS TO OCCUR AT HIGHWAY SPEEDS WITH CROSSWIND",
        "vin": "1FDXE4FN4MD"
    },
    {
        "components": "STEERING,SUSPENSION,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/07/2021",
        "dateOfIncident": "01/29/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395092,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE ADVANCEMENT WARNING CAME ON THE MAIN GAUGE DISPLAY SCREEN WHILE I WAS DRIVING 62 MPH WITH CRUISE CONTROL SET. VEHICLE IS A 2021 JAYCO GREYHAWK 31F CLASS C MOTORHOME ON FORD E450 CHASSIS WITH 7.3L GAS V-8 AND 6-SPEED AUTOMATIC TRANSMISSION. CRUISE CONTROL STOPPED WORKING AND WOULD NOT COME BACK ON. HILL START ASSIST DISABLED MESSAGE CAME ON AFTER I HIT \"OK\" FOR THE SERVICE ADVANCEMENT WARNING. VEHICLE BECAME VERY DIFFICULT TO CONTROL WITH MODERATE CROSSWIND. IT WOULD SWAY SIDE TO SIDE AND MOVED ALL OVER IN THE LANE AS I STEERED AND COUNTERSTEERED. VEHICLE POWER ALSO SEEMED TO DECREASE AS IT WOULD ONLY GO ABOUT 52 MPH IN 5TH GEAR AND WOULD DOWNSHIFT TO 4TH IN ORDER TO GO FROM 45 UP TO ABOUT 55. IT WAS TERRIFYING TO GO THAT FAST WHEN A GUST OF WIND HIT.  WE PULLED INTO A TRUCK STOP, TURNED OFF MOTOR AND LET IT SIT A COUPLE MINUTES. IT RESTARTED EASILY BUT EVEN STATIONARY IN PARK AND IN DRIVE (STOPPED) THE SERVICE ADVANCEMENT WARNING CAME BACK ON AND THE CRUISE CONTROL WOULD NOT POWER ON. SHUT MOTOR OFF AND DISCONNECTED NEGATIVE BATTERY CABLE FOR ABOUT 20 MINUTES, HOOKED BATTERY UP AND  VEHICLE STARTED WITH NO WARNING LIGHTS. DROVE ANOTHER 20ISH MILES WITH NO ISSUES, THEN TURNED ON CRUISE CONTROL AND SET IT AT 55. AFTER 2 MINUTES THE C/C SHUT OFF AGAIN, SERVICE ACTIVATOR WARNING CAME ON, VEHICLE HARD TO CONTROL WITH CROSSWIND   AND DECREASED ENGINE POWER. PULLED TO SHOULDER, TRIED TO RESTART AND SAME ISSUE AS AT TRUCK STOP. DISCONNECTED BATTERY AGAIN  20 MINUTES, HOOKED BACK UP AND DROVE WITH NO ISSUES FOR 6 HRS (AND 1 FUEL STOP) WITH C/C REMAINING OFF.  NEXT DAY ISSUE REPEATED ITSELF: C/C TURNED OFF AFTER ABOUT 2 MINUTES, SERVICE ADVANCEMENT LIGHT ETC. DISCONNECT BATTERY 20 MIN, RESTART AND DROVE WITHOUT TURNING ON C/C FOR 7 HRS (W/ 2 STOPS) NO ISSUES.  FULL POWER AND ADVANCEMENT ELECTRONIC STABILITY CONTROL WORK FINE WHEN SERVICE ADVANCEMENT WARNING IS NOT ON.*DT*JB*DT*DT*DT*JB*JB*JB*DT",
        "vin": "1FDXE4FN7MD"
    }
]