[
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/08/2022",
        "dateOfIncident": "02/06/2022",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450951,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "BERKSHIRE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "headlights, headlight switch, lights dont work, no night time driving no day time running lights. these lights are from a audi A5 and no longer available, changed bulbs, no help",
        "vin": "4uzachfexlc"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/01/2022",
        "dateOfIncident": "12/20/2021",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445794,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "BERKSHIRE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The headlights on my early 2021 Berkshire XL 37A motorhome are not safe to drive at night, the headlights do not provide ANY help in seeing the road at night, in many consumer complaints the same issue is addressed. Forest river corp, is NO HELP they are in denile of any issues, but yet have had many many complaints. I am very affraid of getting in a accident if i have to drive at night, they really dont work and its like they arent even on. Please help us all, we need forest river to step up and take this on, they have many other issues but are the work company i have ever delt with and mad after spending 300K in good faith for a really bad product. Terry",
        "vin": "4UZACHFEXLC"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "03/22/2021",
        "dateOfIncident": "08/10/2020",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404237,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "BERKSHIRE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2021 FOREST RIVER BERKSHIRE. THE CONTACT STATED THAT THE BACK OVER PREVENTION CAMERA WAS INOPERABLE. ADDITIONALLY, THE DRIVER'S AND PASSENGER'S SIDE CAMERAS HAD BEEN INOPERABLE SINCE THE VEHICLE WAS PURCHASED. THE CONTACT TOOK THE MOTORHOME TO LAZY DAYS RV (6130 LAZY DAYS BLVD, SEFFNER, FL 33584, (800)626-7800) TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE INFOTAINMENT SYSTEM NEEDED TO BE REPLACED. THE MOTORHOME WAS NOT REPAIRED. THE MANUFACTURE WAS NOTIFIED OF THE FAILURE. THE CONTACT WAS REFERRED ANOTHER DEALER TO SCHEDULE A REPAIR. THE APPROXIMATE FAILURE MILEAGE WAS 6,000.",
        "vin": "4UZACHFE8LC"
    }
]