[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/18/2021",
        "dateOfIncident": "09/17/2021",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440949,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "R-POD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "On Sep 17th, while coming off a 2,000 mile road trip to Yosemite, the rhino rack with tent and awning ripped off my No Bo 10.6 trailer, did 4 frisbee turns in the air and came crashing down into the fast lane of I93 between Las Vegas and Kingman. The weight alone (roughly 500 lbs.) would've killed anyone driving behind me. Luckily it didn't and skidded into the emergency lane. The lack of concern from the manufacturer has me stymied. I've been told it was a manufacturing defect but am unable to get any phone calls or emails back from their warranty/service department. This was installed at the manufacturer. I need to make sure all owners of a No Boundaries 10.6 trailer are aware of this as I do not believe any type of recall or notice has gone out from Forest River. Dealer has all photos. Tom's Camperland in Mesa AZ",
        "vin": "5ZT2RPAC8MV"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/03/2021",
        "dateOfIncident": "04/25/2021",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414940,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "R-POD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED A 2021 R-POD 171 IN MARCH 2021. THE FRONT WINDOW RANDOMLY SHATTERED ON I-10 AS THE TRAILER WAS BEING TOWED AT 55 MPH. THERE WAS NO DEBRIS ON THE ROAD, OR FOUND WHEN CLEANING UP THE GLASS IN THE CAMPER. THERE WERE NO OTHER VEHICLES ON THE ROAD. THE ROAD WAS SMOOTH. I HAVE COME TO LEARN THIS IS A KNOWN ISSUE WITH R-POD FRONT WINDOWS, AND FOREST RIVER WILL NOT FIX THE ISSUE. FOREST RIVER WAS USING SINGLE PANE WINDOWS. THOSE BROKE. THEY SWITCHED TO THICKER GLASS (WHICH IS WHAT I AM TOLD WHAT WE HAD) THAT SUPPOSEDLY DON'T BREAK. NOW THEY DO DOUBLE PANE WINDOWS. THESE ARE $361 AND $200 SHIPPING. ESTIMATED 1 HOUR LABOR INSTALL. THE FRONT WALL IS BEGINNING TO WARP SO I WORRY IT WAS MORE THAN JUST THE WINDOW THAT WAS AT FAULT.",
        "vin": "4X4TRP718MB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/26/2020",
        "dateOfIncident": "08/25/2020",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351410,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "R-POD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "WORKING WITH ONE OF THE LATEST FAILURES I THINK WE HAVE POTENTIALLY IDENTIFIED THE CAUSE OF THE 195/196 R-POD FROM WINDOW FAILURES. IT IS NOT FROM ROCKS OR ROAD HAZARDS.    TEMPERED GLASS DOES NOT NORMALLY BREAK THE WAY IT HAS BEEN ON THE 195/196 R-PODS FRONT WINDOWS; THIS TYPE OF BREAKAGE IS GENERALLY CAUSED BY STRESS IN THE GLASS NOT SOMETHING LIKE A ROCK STRIKE.     WHEN I INSPECTED MY WINDOW AND FRAME, I FOUND ON THE FRAME INSIDE MY POD, ON THE SIDE OF MY WINDOW, A BEND IN THE FRAME RESULTING IN AN UNEVEN SEATING SURFACE FOR THE WINDOW. THIS WOULD RESULT IN UNEVEN LOADING OF THE GLASS WHEN DRIVING (WIND LOAD) WHICH WILL EVENTUALLY RESULT IN THE BREAKS PEOPLE ARE SEEING (TEMPERED GLASS DOES NOT LIKE STRESS LOADING). SEE THE PHOTO BELOW OF MY WINDOW FRAME AND THE BEND; I HAVE NOT HAD THE GLASS BREAK YET.     THROUGH THE FACEBOOK OWNERS GROUPS, WE HAVE FOUND THOSE WITH BROKEN WINDOWS, WHERE JUST THE GLASS WAS REPLACED, OR THOSE THAT STILL HAVE THE BROKEN WINDOW, HAVE THIS BEND.     THE GOOD NEWS IS, WE ARE ALSO FINDING THIS BEND IS NOT IN ALL 195/196.     FROM WHAT I CAN TELL THIS SEEM TO BE EITHER A DEFECT IN THE FRAME MANUFACTURING OR IN MANUFACTURING INSTALLATION WHERE THE FRAME IS FORCED TO FIT THE SHAPE OF THE FRONT CURVE OF THE POD. THERE IS A SECONDARY FRAME INSIDE (I LABELED IT 'SCREEN FRAME?') THAT HAS LOTS OF BENDS ON THE SIDES, I DON'T THINK THIS HAS ANY IMPACT ON THE GLASS, BUT DOES INDICATE THAT THE FRAME WAS TWISTED TO GET INSTALLED.    FOREST RIVER TOLD ME THAT THEY DID NOT KNOW THE CAUSE AND THAT NHTSA WAS INVESTIGATING SO THEY DID NOT WANT TO KNOW WHAT I HAD FOUND.",
        "vin": "4X4TRPV13MB"
    }
]