[
    {
        "components": "EXTERIOR LIGHTING,WHEELS,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/06/2021",
        "dateOfIncident": "10/01/2021",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442855,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDWOOD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 Forest River Wildwood trailer. The contact stated that multiple failures had occurred with the trailer upon purchase. First, he stated that the front strip exterior light located in the front of the trailer would not turn off while driving or while turned off. He also mentioned that the water pump would bypass the check valve and fill up the water tank; due to the failure, the water tank would overflow, and water would then leak out of the trailer. The contact also stated that the plastic fenders over each of the tires on the trailer had begun to crack. The manufacturer had been notified about the multiple failures on numerous occasions; however, the contact had yet to hear back from the manufacturer. The vehicle had yet to be repaired. The failure mileage was unknown.",
        "vin": "4x4twbc27mu"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/11/2021",
        "dateOfIncident": "10/10/2020",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395814,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDWOOD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2021 FOREST RIVER WILDWOOD TRAILER. THE CONTACT STATED THERE WAS INCORRECT WIRING IN BREAKER BOX. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER CAMPERS RV CENTER (7700 W 70TH ST, SHREVEPORT, LA 71129, (318) 938-5441) WHERE IT WAS DIAGNOSED WITH NEEDING THE BREAKER BOX TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER HAD NOT BEEN INFORMED OF FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "4X4TWDH24M8"
    }
]