[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/03/2022",
        "dateOfIncident": "02/24/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459422,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 3500",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Part Number: 85138746 - DEF tank assembly, heater, pump, reservoir.  I was told there were issues with the heater and pump. The heater turns high or the heater won’t work; and there are issues with the connector.02/24/22: My truck has 16,000 approx. miles. The check engine light came on and displayed message that I had so many miles until truck would be restricted to 65MPH.  I took my truck into Kendall dealership in Nampa, Idaho and was told there was myself and another person who had the same issue. A couple weeks go by and I call the dealership back and was told that I was 5th in line and there were 20 behind me.  I was told that there were 11,000 parts already spoken for and 6,000 parts on backorder. I was one of the backorder individuals.  I was also told that they do not have a ETA on when they would receive parts and that parts show up unexpected.    They told me that I would have to contact GM customer service for assistance.  The dealer called me back March 31st to see if I got my camper moved and how much it cost to move.  They told me the dealership would cover one month truck payment and would like me to send in my loan payment statement. I asked for clarification as I didn’t know how I could have been 2nd person and the other day he said I was fifth in line.  He said that there are at least 2-3 persons for service technician at dealership.  Only 2 got fixed in the last 2 months.  I asked if the new part going in will have the same issue or will be a re-designed part that fixes the issue.  Dealer said the same part.  GM is working on a re-design part and not ready for manufacturing.  I asked why this wasn’t on a recall and he said no because it would bring people in that don’t need it replaced because their part is still working, and that GM doesn’t have a re-designed part to fix the issue.  Gortsema Motors in Grangeville, Idaho a friend brought in their 2018 Chevydiesel truck (with 87,000 miles) for the same issue. Dealer said they have many cases.",
        "vin": "1GT49WEY1MF"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/03/2022",
        "dateOfIncident": "02/14/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459426,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 3500",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Problem: Unable to shift transmission from D to another position like R, P, N due to snow/slush being on shifter. I travel on Idaho state highways and County roads that are plowed.  In February, I traveled state highway 14.  Road conditions were plowed snow roads, broken snow floor, slush and pavement without slush or snow.  I had a passenger with me on this trip from Elk City, Idaho to Grangeville, Idaho via SH-14.  When I pulled into my storage unit, I could not shift from D to P or N or R.  I could only drive forward.  The temperature in Grangeville was mid 40s. I did not have any tremendous snow build up on the under carriage or wheel wells.  I drove to the dealer Gortsema Motors and their service technician said that I needed to go to a car wash and blow out the snow buildup next to the transmission linkage shifter.  When I pulled into the car wash, I still could not shift the transmission.  My passenger got out and used the water to push out the snow buildup around the linkage shifter.  Then I was able to shift between all gears P, R, N, D.  This is a big concern because this should not have happened.  This is a major problem in the winter and had there not been a car wash to blow out the snow/slush, I would not be able to turn the truck off or restart the diesel truck in gear.  There needs to be a protective shield around the shifter so that snow/slush does not get up into area and cause the shifter to not shift.",
        "vin": "1GT49WEY1MF"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/05/2022",
        "dateOfIncident": "12/10/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455361,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 3500",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The throttle body gets stuck wide open after the eninge gets up to operating temperature, it will give some warning with the throttle like on off throttle use and no codes show up at all. The risk of everyones is in extrem DANGER. The break are to soft and well not stop unless you put both feet on the break pedal down to the floor. Tranismission can NOT figure out what gear it needs to be in way too many gears and horrible fuel mpg for the 6.6L Duramax L5P. None of the GM dealership will look at the truck unless there is a code or it is happening right there when they look up the trucks VIN.",
        "vin": "1GT49UEY9MF"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/28/2022",
        "dateOfIncident": "02/24/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454519,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 3500",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "•The diesel exhaust fluid heater is a faulty component in the system, there is a back order on the part with no ETA • My pickup only does 55MPH right now and soon to do 5MPH you cannot drive on a public road doing 5MPH •There is thousands of other people having the same exact problem! •The DEF light is illuminated on my dash along with the check engine light, when you diagnose the error code it comes up with “P20C1 Reductant Heater C Control Circuit/OPEN”",
        "vin": "1gt49wey6mf"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/10/2022",
        "dateOfIncident": "01/03/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446957,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 3500",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Tailgate falls open while traveling down the road",
        "vin": "1gt49vey5mf"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/26/2021",
        "dateOfIncident": "10/26/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438295,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 3500",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The vehicle recently had a recall repaired at the dealership. I subsequently took delivery on it as a BRAND NEW UNIT, and the brakes are extremely soft; to the point where I must depress the pedal to the floor to get it stopped even at slow speeds.   I hoped it was just an air bubble from the repair; but the fluid levels are full and the dealer had no ideas on what could be wrong at this point. I have a great relationship with this dealer, and we’ll continue working on it. But GM is releasing absolute trash lately and I fear that some poor family will load up, trusting these vehicles, and be badly injured or killed. After 200 miles of driving it back to my residence, both at highway speeds and residential road speeds, these brakes have not improved; ruling out an air bubble. I’m worried it may be associated with the recall that was previously remedied.",
        "vin": "1GT49TEYXMF"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/10/2021",
        "dateOfIncident": "06/10/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420443,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 3500",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Trailer brake wiring connection continually disconnectsthen reconnects some time later. Some periods of up to 10 minutes without having trailer braking power. Major safety issue when toeing fifth wheel trailer. We lost brakes going down steep grades. GMC is aware of issue, but has not provided a solution. Vehicle has been yo service shop with no resolution. Case has been opened with GMC.",
        "vin": "1gt49vey4mf"
    }
]