[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/18/2022",
        "dateOfIncident": "02/11/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452757,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 GMC Acadia C1. The contact stated while driving approximately 40 mph, the parking brake engaged independently. The contact also mentioned having difficulties steering the vehicle. The vehicle was restarted and it resumed to normal. The vehicle was not diagnosed or repaired. No further information was available. The failure milage was unknown.",
        "vin": "1GKKNXLS7MZ"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/02/2022",
        "dateOfIncident": "01/31/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450038,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Brand new vehicle purchased from dealer, at 8900 miles transmission slipped. Dealer has for 2 hours and couldn’t find problem, but replaced transmission fluid it was dark. At 9000 it happened again, they have vehicle and said the new transmission fluid is dark and muddy. Only 100 miles, so they determined they need to take apart transmission and see what happened. It’s a 52k car, it should not be repairs, it should be replaced under warranty.  Video of 8900 from dealership https://video.37483.net/timeline/2CJTHEW6",
        "vin": "1GKKNLLS7MZ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/25/2022",
        "dateOfIncident": "01/23/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448795,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Was accelerating to approx 45-50mph when the vehicle gave no power, but my RPMs were revving.  Once removing my foot off the gas pedal and trying to get power back, after the 2nd or 3rd time I resumed power.  The car has less than 9000 miles on it.  Right after, a message alerted me to have the vehicle brought in for service, and the engine light came on.  According to the dealership, the found code P0700 which is normal, followed by P7224, something I am unable to locate anywhere online.  They said they tested everything and all came back normal.  It's been noted and if it happens again to let them know.  I'm not feeling comfortable paying 50K+ for a vehicle to have it go haywire under 10K miles.",
        "vin": "1GKKNLLS7MZ"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/25/2022",
        "dateOfIncident": "01/21/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448903,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I want to voice my concerns with the windshield wipers, and storage placement. In winter weather conditions the storage compartment at the base of the windshield fills up with snow, even when driving. The wiper blades eventually end up resting on this snow. When wipers are turned on there is a  quite often a build up of ice on the wiper blades. This causes the wiper blades to raise above windshield and not clean the windshield (partially or completely)  Generally you need to stop and break/snow or ice from the wiper as you can not see.   Same occurs when e get a freezing rain  ice builds up at base of windshield then eventually ices up the wiper blades and not cleaning the windshield. The vehicle is not designed to handle winter and freezing rain conditions, after building vehicles for many years we should have a better wiper system. --Blades should have electric heat wires in them,   --maybe need completely electric windshield to handle snow/ice cond. -- The placement of the defroster vents are very poorly placed, they should be all across the base of the windshield. A couple of days ago we had freezing rain,  blades were freezing up, heater defroster was at max heat, and fan was at max, I had to constantly pull over and scrape ice off.  This is very dangerous situation be it ice or snow. Design engineers really don't seem to take the winter conditions into consideration in the design of vehicles. I have driven over 5 million kms during my career and used to dealing with many types of conditions. No accidents . Just want to bring these issue to your attention. I am extremely disappointed in this unit because of this. Thanks [XXX]  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "1GKKNLLS9MZ"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/04/2022",
        "dateOfIncident": "01/04/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446196,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 GMC Acadia. The contact stated while driving approximately 30 MPH, the vehicle started making an abnormal dinging sound. The contact stated service restraint system warning message was illuminated. The vehicle was taken to a local dealer where it was diagnosed with needing the SDM module replaced. Upon investigation, the contact associated the failure with NHTSA Campaign Number: 21V702000 (Air Bags) however, the VIN was not included. The manufacturer was not informed of the failure. The failure mileage was approximately 16,000.",
        "vin": "1GKKNKLA2MZ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/15/2021",
        "dateOfIncident": "09/11/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443935,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 GMC Acadia. The contact stated that while driving approximately 30-60 MPH, the vehicle started shuddering inadvertently. There were no warning lights illuminated. The contact stated that he continued to drive the vehicle. The contact stated that the failure reoccurred while driving and the vehicle stalled. The contact was unable to restart the vehicle after several attempts. The vehicle was towed to the dealer who diagnosed that the transmission fluid needed to be replaced per the service bulletin #PIP5608H; however, the failure persisted. The dealer advised the contact to drive the vehicle for 200 miles and bring it back if the failure reoccurred. The contact stated that the vehicle continued to shudder and stall while driving. The vehicle was taken back to the dealer who diagnosed that the transmission torque converter needed to be replaced. The manufacturer was notified of the failure. The vehicle was repaired. The approximate failure mileage was 4,100.",
        "vin": "1GKKNXLS8MZ"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/27/2021",
        "dateOfIncident": "10/22/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441816,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Electronic parking brake is setting itself without you doing it even when parked on a completely flat surface.  Voice activated assist is going off while driving down the road without you hitting the steering wheel button. 1st dealer I took the car to refused to even address issue because the car didn’t throw a code even though the parking break issue happened while in their parking lot. 2nd dealer at this point has had the car for a total of 16 days. They tried to tell me the parking break was normal, manager at actual dealership told me it definitely was not normal, and they don’t know what to do about voice activation going off. It has now been at dealerships 3 times for this issue within Oct and Nov 2021. Only 4,500 miles on car. If it is having these electric issues already what is in store for this car in the future? My husband has a video on YouTube of voice activated assist issue so far 2 other people are saying their cars are having the same issue.",
        "vin": "1GKKNPLS8MZ"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/19/2021",
        "dateOfIncident": "10/11/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441021,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "My 2021 Acadia just stooped working as COMPLETLY SHUT OFF. I had no power to contact OnStar or more importantly to put my 4 ways(Hazard lights) on to signal or warn other motorists that there is a problem ahead. I could not push the vehicle as it is locked in gear because of the termination of power. I have had this exact problem happen 3 times leaving me and my family stranded on a busy road with nothing working. On each occasion I have removed my family from the vehicle in fear of being rear-ended! This would not only cause an accident with harm or fatality to my family, but has put that same risk to other motorists on the road. When I have had the vehicle in the dealership (Champion Buick/GMC of Brighton) in which it needs to be towed, they have not been able to find or confirm this issue. The dealership has had the vehicle for multiple weeks with help and assistance of GM with also no resolution. This is a very intermittent issue and when it happens it is an extremely dangerous situation. The vehicle gives no warning except for a total shut down.",
        "vin": "1GKKNKLA0MZ"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/04/2021",
        "dateOfIncident": "07/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439390,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 GMC Acadia. The contact stated while stopped at a stop light and depressing the brake pedal, the engine revved up with the RPM’s increasing up to 15,000. No warning lights were illuminated. The contact stated that the vehicle jerked and vibrated as the transmission did a hard shift. The vehicle was taken to the dealer who took the vehicle on a 24-minute test drive and no failure was found. The vehicle was taken to the dealer several times and no failure was able to be determined. The failure occurred several times. The manufacturer was notified of the failure however, no assistance was offered. The approximate failure mileage was 249.",
        "vin": "1GKKNXLS2MZ"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/02/2021",
        "dateOfIncident": "10/28/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439134,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "On at least 3 occasions, my vehicle’s locks have malfunctioned and I’ve been locked out of my car with one incident being locked out in the rain. Upon approaching my vehicle and using the unlock button on the outside of my door, I was unable to access my vehicle. Then trying my key fob and app to unlock, with all attempts unsuccessful. The back hatch of the vehicle would open, so my daughter had to crawl through to manually open the door. Once the vehicle was started, once put in drive, the vehicle would not lock. As stated, I can confirm three dates this has happened and that I’ve contacted my local dealer. I am pretty sure it’s happened one other time but I can not remember the date. The dealer would only look at it once and could not find anything wrong because the problem did not happen in the short time my vehicle was there. I do have video of at least one instance that I can provide.",
        "vin": "1GKKNULS3MZ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/29/2021",
        "dateOfIncident": "09/14/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438701,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Brakes grind, usually after sitting overnight. It has happened on multiple occasions.",
        "vin": "1GKKNULS6MZ"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/30/2021",
        "dateOfIncident": "08/28/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431036,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 GMC Acadia. The contact stated while driving approximately 65-70 MPH, the driver’s side rear spring detached and almost caused a collision. The dealer was made aware of the failure and it was arranged for the vehicle to be towed to the dealer for diagnosis. The contact stated that the vehicle was towed to the dealer prior to the failure after the contact heard an abnormal noise coming from the rear of the vehicle. However, the dealer could not replicate the failure and the vehicle was not repaired. The manufacturer was made aware of the failure. The failure mileage was approximately 12,000.",
        "vin": "1gkknxls1mz"
    },
    {
        "components": "VISIBILITY/WIPER,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "08/16/2021",
        "dateOfIncident": "01/15/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429267,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Since purchase of this vehicle in Dec 2020, the rear camera vision has been intermittent. I originally thought it to be driver problem however I am now told that there is a module that needs to be replaced and it is not available and possibly not being manufactured at the present time. As a result the entire Camera parking assist system is completely out of service with no information on when the module may be available to repair the issue. I believe this may be a Safety issue as backing up into traffic be it parking lots or roadways, this equipment is an essential addition to safety to other vehicles and pedestrians.",
        "vin": "1GKKNULS9MZ"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "08/05/2021",
        "dateOfIncident": "08/05/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427862,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 GMC Acadia. The contact stated that while his wife was reversing the vehicle, the accelerator pedal was stuck to the floorboard and the vehicle crashed into the garage wall. No medical attention was received. No police report was filed. The dealer was made aware of the failure and informed the contact to tow the vehicle to their location to diagnose the failure. The vehicle was awaiting a tow truck and had not been diagnosed or repaired. The manufacturer was not made aware of the failure. The failure mileage was approximately 2,500.",
        "vin": "1gkknmls6mz"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/31/2021",
        "dateOfIncident": "07/07/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427297,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "As I was driving down Interstate 65 in south Alabama on a drizzling rainy day, the sunroof made a very loud popping noise and then exploded, with shattered glass falling into my SUV.  Luckily, I was able to keep my vehicle on the road without swerving and losing control.  I closed the sunshade on the sunroof to keep the glass from continuing to fall in and drove home.  There was no warning lights nor any indication that something was wrong with the sunroof.  When I got home, I called the nearest GMC dealership in Pensacola, Florida to report the issue (850.637.8973).  Jonathan Sparks handled the claim.  He sent out team members to pick up the vehicle from my home.  They first removed as much of the glass as they could to keep it from flying off and possibly hitting another vehicle behind them.  They drove it to Pensacola, replaced the entire sunroof, and then brought it back to me.  Documentation and pictures are attached.",
        "vin": "1GKKNXLSXMZ"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "05/28/2021",
        "dateOfIncident": "04/09/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418857,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Was on the interstate driving when the emergency brake engaged causing the car skid the tires and almost completely coming to a stop in heavy traffic.  Shortly after this the transmission had issues which caused the car to be undrivable and had to be towed.  The dealership had the car for over a month and replaced the TCM.  There were no other warnings prior to this.",
        "vin": "1GKKNXLS7MZ"
    },
    {
        "components": "ELECTRICAL SYSTEM,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "05/07/2021",
        "dateOfIncident": "04/07/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415501,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE PURCHASED NEW MID-MARCH 2021 AND IN LESS THAN 30 DAYS THE REAR BACK-UP CAMERA STOPPED WORKING INTERMITTENTLY.  THIS HAS OCCURRED SEVERAL TIMES AND THE VEHICLE IS CURRENTLY AT THE DEALER BEING DIAGNOSED.",
        "vin": "1GKKNUL48MZ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/23/2021",
        "dateOfIncident": "04/20/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413574,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "WIFE WAS DRIVING SOUTHBOUND ON US287 BETWEEN VERNON, TX AND WICHITA FALLS, TX IN A 75MPH SPEED ZONE.  VEHICLE ABRUPTLY AND FOR NO APPARENT REASON SLOWED  AS IF THE BRAKES HAD BEEN APPLIED WITH SUFFICIENT FORCE TO CAUSE HER TO BEND FORWARD AT THE WAIST.  SUBSEQUENTLY, THE VEHICLE SPEED BECAME ERRATIC AND SHE SLOWED TO 25 WHILE MOVING ONTO THE SHOULDER.  COULD EASILY HAVE CAUSED A FATAL ACCIDENT HAD TRAFFIC NOT BEEN UNUSUALLY LIGHT.  I AM ENCLOSING GM SERVICE BULLETIN ISSUED IN JULY OF 2020 (I FOUND IT POSTED ON THE NHTSA WEB SITE) REGARDING THE TRANSMISSION USED IN THIS CAR.  A SAFETY RECALL SHOULD BE IMMEDIATELY ISSUED .GM NHTSA SHOULD HAVE REQUIRED GM TO  NOTIFY BUYERS OF THIS CONDITION PRIOR TO PURCHASE WHEN THE INHERENT POTENTIAL DEFECT FIRST BECAME APPARENT.  WE BOUGHT THE VEHICLE NEW IN QUESTION ON 2 FEB 21 AND IT HAD BEEN DRIVEN JUST 4,063 MILES AT TIME OF INCIDENT.",
        "vin": "1GKKNPLS5MZ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/06/2021",
        "dateOfIncident": "03/31/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406709,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR CAMERA STOPPED WORKING.",
        "vin": "1GKKNUL4XMZ"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/12/2020",
        "dateOfIncident": "11/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383159,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STEERS TO LEFT,VOLUME DOES NOT WORK AFTER A CONNECTED CALL WHILE DRIVING,SCREEN BLACKS OUT AND NOISE COMING OUT OF LEFT DRIVER DOOR PANEL WHILE CAR IS OFF,ALSO MESSAGE  THAT SD CARD WAS REMOVED NO APPS WORKING",
        "vin": "1GKKNMLS5MZ"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/24/2020",
        "dateOfIncident": "11/09/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376090,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "WE BOUGHT OUR CAR ON 11/7/2020 ,2 DAYS AFTER STARTING THE MESSAGES APPEAR ON THE SCREEN (SERVICE SAFETY RESTRAINT SYSTEM) CAR AND ON MY PHONE, THIS ALWAYS HAPPEN WHEN IN MOTION,  ON A CITY OR HIGHWAY DOESN'T MATTER WHERE YOU'RE DRIVING. WE HAVE NO IDEA WHAT COULD CAUSE THE PROBLEM CAUSE ONLY HAD 2 MILES WHEN TOOK IT OUT FROM THE DEALER. I FEEL THAT IS A DEFECTIVE PRODUCT INSTALLED ON THE VEHICLE.  ALSO THE PASSENGER SEAT DOESN'T MOVE TO BE ADJUSTED. WENT TO THE DEALER A WEEK AGO BUT STILL WAITING FOR CALL BACK TO MADE THE REPAIR.",
        "vin": "1GKKNMLS5MZ"
    }
]