[
    {
        "components": "SUSPENSION,ENGINE,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "03/22/2022",
        "dateOfIncident": "03/10/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457792,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "My blind spot warning light and signal doesnt work all the time.  for example, if a pass a car, or a car passes me at a speed of more than 5 miles per hour, there is no notification from the blind spot warning light in the mirror, or an audalble signale either.  i have taken the car to the GMC dealership 3 times and i was told that is normal, and nothing is wrong.  I own other GMC models and i have never experianced this intermitant issue.",
        "vin": "1GKS2DKL3MR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/25/2021",
        "dateOfIncident": "10/22/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438090,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "On Friday October 22, 2021 around 7:20am as I was driving my children to school I was driving around 40 mph when suddenly I received an alert on the dashboard saying “brake system fail”, I then proceeded to brake to make sure my breaks were working when I noticed they did not work. I then started pumping the gas pedal repeatedly to make the vehicle stop. My car was not stopping and my children and I panicked and started crying. As I was getting closer to a vehicle and ready to crash I swerved the vehicle to the right where it was just an empty lot. I continue to press and pump  the brakes until the vehicle came to a complete stop. I took pictures of the dash board once the vehicle was completely off. My Vehicle was towed to my house shortly after. I refuse to drive that vehicle after the terrible experience that jeopardize the life of my children and myself. We have suffered emotional distress.",
        "vin": "1gks1bkd1mr"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/12/2021",
        "dateOfIncident": "10/06/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11436452,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a  2021 GMC Yukon. The contact stated while stopped on the highway a Crown Victoria crashed into the rear driver's quarter panel and a Honda Civic crashed into the front bumper of the vehicle. The air bags failed to deploy. There was a police report filed. There was no reported fire. The contact sustained pain and medical attention was provided. The vehicle was towed to an independent mechanic. The local dealer was not contacted. The vehicle was not diagnosed or repaired. The manufacturer was notified but, no further assistance was provided.  The failure mileage was approximately 7,000.  The contact stated there was visible damage to the rear axle and fuel tank.",
        "vin": "1GKS2BKD2MR"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/04/2021",
        "dateOfIncident": "09/24/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435331,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Engine failed on my new vehicle.  GM is aware of faulty lifters produced over roughly a 3 month period.  My vehicle has been confirmed to have those faulty batch lifters.  At this time GM is only replacing lifters on the side of the engine that failed.    The local dealership is having 2-3 of these come into the service shop per day.  This is a major problem and I am being told it could be 2 months before I get my vehicle back.  When I get the vehicle back I want it fixed properly and safe to drive.  I don't want my family broken down on the side of the road due to GM knowingly not replacing a faulty product let alone the inconvenience of not having the vehicle again for repairs.",
        "vin": "1GKS2DKL0MR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/29/2021",
        "dateOfIncident": "09/14/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434850,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "A/C system draining into drivers side floor area.  Water from the A/C system is not draining properly and causing water to collect under the carpet on drivers side, leading to mold, bacteria and potentially harmful to people with respiratory issues.   After researching various Internet forums, this seems to be a common issue in 2021 Yukon and Tahoes.   The dealership will be investigating the issue tomorrow.",
        "vin": "1GKS2BKD9MR"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/09/2021",
        "dateOfIncident": "09/08/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432298,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "GMC Yukon Denali SUV 2021, push rods and lifters in motor are bad, this could have cause an accident due to SUV stopping in traffic or on the highway. Please help with this safety issue. The GMC Denali SUV 2021 only has 7000 miles on it, it new. I thank you in advance for you support.  Regards George L Patterson",
        "vin": "1gks1dklxmr"
    },
    {
        "components": "AIR BAGS,LANE DEPARTURE",
        "crash": true,
        "dateComplaintFiled": "08/23/2021",
        "dateOfIncident": "08/18/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 4,
        "odiNumber": 11430208,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact rented a 2021 GMC Yukon. The contact was driving at 75mph, the contact stated they felt the steering wheel was moving independently causing the vehicle to veer in the opposite direction. Both hands were required in order to control the steering wheel. The contact attempted to avoid a large puddle, the vehicle independently veered to the right causing a crash with a curb and crossed an exit ramp which caused the vehicle to crash then into an embankment and into a ditch. This caused damage to the front passenger side tire of the vehicle. The side air bags did deploy but not the front driver or passenger side airbag did not deploy. No warning lights illuminated from the vehicle. The medical treatment was at the scene in which they checked the contact father in- law and their baby and took them to the hospital by ambulance with the contact's wife who was also in the vehicle. The contact also sustained a cut from the airbag being deployed, the contact wife also had bruises to their upper chest and leg, The contact father-in-law was also injured with his upper body and also a small rash on their face when the side airbag was deployed, as well the contact mother-in-law has complained of a headache.  A police report was filed. The vehicle was towed from the scene to an impound lot. The vehicle was not diagnosed or repaired. The manufacturer was not made aware of the failure. The failure mileage was approximate 16,000.",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/02/2021",
        "dateOfIncident": "08/02/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427458,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2021",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "COOPER",
                "productModel": "COOPER DISCOVERER H/T PLUS",
                "productYear": "9999",
                "size": "275/55R20",
                "type": "Tire"
            }
        ],
        "summary": "The contact owns a 2012 GMC Yukon equipped with Cooper Tires, Tire Line: Discoverer HTP, Tire Size:  275/55/R20, DOT number: Not Available. The contact stated that while inspecting the tires, the rear driver’s and passenger’s side tires had visible bulges. The tires were not replaced. The dealer was not made aware of the failure. The contact attempted to contact the manufacturer but was not able to reach a live representative. The failure mileage was 116,224.The VIN was not available.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/05/2021",
        "dateOfIncident": "07/04/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423440,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Once again, the car has been repaired under the recall for the airbags, but once again the cars lights have turned on to state service safety restraint system. I am unable to trust the airbags will deploy with the system being that this issue has been appearing multiple times and reappeared after the recall was complete.",
        "vin": "1GKS2DKL6MR"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "06/24/2021",
        "dateOfIncident": "06/02/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422144,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "This new 2021 GMC Yukon Denali we purchased on June 2, 2021 has a very sophisticated controls system that includes a feature, entitled \"Brake Assist,\" that is designed to detect \"rapid brake pedal applications due to emergency braking situations and provides additional braking to activate the Antilock Brake System (ABS) if the brake pedal is not pushed hard enough to activate ABS normally.\"  \"Brake Assist disengages when the brake pedal is released.\"  After I left the dealership (June 2nd), I noticed that the \"Service Brake Assist\" light had illuminated on the Driver Information Center (DIC).  I pulled off the road to check the Owner's Manual, and then continued home trusting that no immediate hazard existed.  I subsequently set up an appointment with the dealership for a checkup.  A week later, the dealership downloaded a new software package from GMC.  The Brake Assist light did not appear when the engine started, so I left for home (50-minute drive at moderate speeds).  Enroute to my home, I stopped at a store and turned the engine off.  Started home a few minutes later.  While accelerating past 45 mph, the brake system independently engaged, which threw me against the steering wheel and into the windshield.  As the SUV decelerated through 20 mph, the brakes automatically released.  I was not hurt, nor did I lose angular control of the vehicle.  I completed my drive home and parked the Yukon normally.  Did not drive it again until returning to the dealership a few days later.  This second visit did not bear fruit.  After significant explorative work, the lead mechanic drove the vehicle several miles under a multitude of conditions, but could not duplicate the problem or get the light on the DIC to extinguish.  At my request, the dealership returned possession to me with the light still illuminated.  I have driven the vehicle several miles since then with the \"Service Brake Assist\" light still illuminated.  I suspect this is a GMC software problem.",
        "vin": "1GKS2DKL3MR"
    },
    {
        "components": "STEERING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/25/2021",
        "dateOfIncident": "05/25/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418490,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Hello, I am a Repair Technician for a General Motors dealership in Reno NV. vehicle in question has no ability to to placed in neutral without the engine running. per GM repair guides the vehicle must either be placed in neutral with engine running or a special tool is needed to placed trans into neutral in to move vehicle. this is a major safety concern as vehicle became engine became disabled and the vehicle could not be moved. steering is locked, parking brake automatically sets and neutral position on gear selector cannot be selected. this happened at our dealership. but i can only imagine this happening to someone on the highway. stuck blocking the road with no ability to move the vehicle to safety. i feel this is extremely dangerous and i am sending an email to General motors technical assistance also.",
        "vin": "1GKS2BKD9MR"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/09/2021",
        "dateOfIncident": "05/08/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415724,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN AN INTERSTATE ON A CLEAR SUNNY DAY 70 DEGREES. THERE WERE NO VEHICLES NEARBY OR AN OVERPASS. IT WAS ME, MY HUSBAND AND OUR DOG IN THE VEHICLE. OUT OF NOWHERE WE HEARD A LARGE BANG AND I NOTICED THE SUNROOF WAS SHATTERED. IT TOOK ALL MY HUSBAND ALL HE COULD TO FROM WRECKING. THANKFULLY I THOUGHT TO CLOSE THE SUNROOF SHADE SO MORE GLASS WOULDN'T LAND IN THE VEHICLE. THERE WERE SHARDS 9F GLASS EVERYWHERE.  WE PURCHASE OUR 2021 YUKON 3 MONTHS AGO. SO WE WERE IN A NEW VEHICLE WITH APPROXIMATELY 5K MILES. VERY SCARY AND I WAS STILL SHAKING ONCE WE WERE ABLE TO EXIT THE INTERSTATE. THE SAFETY GUIDELINES FOR PANORAMIC SUNROOF NEED TO BE UPDATED! I HAD NO IDEA THIS WAS AN ISSUE.",
        "vin": "1GKS2CKD7MR"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/03/2021",
        "dateOfIncident": "04/30/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414928,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS STATIONARY AND UPON TURNING IT ON A MESSAGE SHOWED UP ON THE DISPLAY STATING TO IMMEDIATELY TAKE THE VEHICLE FOR SERVICE AND TO DRIVE CAREFULLY BECAUSE OF A POWER STEERING ISSUE. ONCE THE VEHICLE WAS PLACED IN REVERSE TO BEGIN  TO LEAVE THE PARKING SPOT, IT WAS EVIDENT THAT THERE WAS NO STEERING AVAILABLE ON THE VEHICLE. IT WOULD ONLY MOVE FORWARD AND BACKWARDS BUT THE STEERING WHEEL WOULD NOT MOVE IN ANY DIRECTION AT ANY DEGREE MAKING THE VEHICLE IMPOSSIBLE TO DRIVE SAFELY OR CAREFULLY TO ANY LOCATION. ATTEMPTING TO DRIVE THE VEHICLE FOR SERVICE WOULD HAVE CAUSED AN ACCIDENT AND ULTIMATELY WAS IMPOSSIBLE SO WE DECIDED TO HAVE THE VEHICLE TOWED. THE DEALERSHIP SERVICE DEPARTMENT INFORMED US THAT THIS WAS A PROBLEM WITH THE SYSTEM/SOFTWARE AND THAT THE VEHICLE HAD MANY MORE HISTORY CODES FOR THIS ISSUE. AFTER INFORMING US THAT THE UPDATE FOR THE STEERING SYSTEM WAS COMPLETED, THEY ALSO SAID IT MAY NOT BE THE FIX BASED ON THE MULTIPLE HISTORY CODES. THE CAR IS STILL BEING INSPECTED AS THEY ARE UNABLE TO BE SURE THE CAUSE OR THAT IT WILL NOT OCCUR AGAIN. RECORDS OF SERVICE CAN BE PROVIDED ONCE THE VEHICLE IS RETURNED TO US AND MESSAGES OF COMMUNICATION WITH THE SERVICE DEPARTMENT CAN ALSO BE PROVIDED UPON REQUEST.",
        "vin": "1GKS2DKL5MR"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/04/2021",
        "dateOfIncident": "04/03/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406358,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELLING DOWN THE HIGHWAY 69 MPH WITH MY WIFE AND THREE SMALL CHILDREN WHEN THE DASH FLASHED MULTIPLE ERROR CODES, ENGINE SPEED LIMITED TO 62 MPH, AND BRAKES ESSENTIALLY WENT OUT. WAS ABLE TO GET SAFELY STOPPED. CONTACTED DEALERSHIP AND THEY ADVISED SHUTTING IT OFF FOR 20 MIN AND IT WOULD \"RESET\". IT DID NOT RESET AND WE REFUSED TO DRIVE IT IN SUCH UNSAFE CIRCUMSTANCES WITHOUT ADEQUATE BRAKE FUNCTION ETC. GMC ROADSIDE ASSISTANCE CAME AND TOWED IT AWAY. COULD HAVE RESULTED IN MUCH WORSE OUTCOMES AND WE ARE THANKFUL NO ONE WAS INJURED. VERY NERVOUS TO DRIVE IT AGAIN AFTER WE GET IT BACK, NOT KNOWING IF IT WILL MALFUNCTION AGAIN.",
        "vin": "1GKS2BKD3MR"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/12/2021",
        "dateOfIncident": "03/08/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402695,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING APPROX. 62 MPH ON A HIGHWAY, WENT TO SLOW DOWN AND UNABLE TO BRAKE, UPON PUSHING DOWN ON THE BREAK THERE WAS RESISTANCE, AFTER PUMPING THE BREAKS MULTIPLE TIMES I WAS EVENTUALLY ABLE TO SLOW DOWN WITH A LOT OF FORCE. MESSAGES ON DASHBOARD READ \"BRAKE SYSTEM FAILURE\" \"62 MAX SPEED ESC, SERVICE ESC, SERVICE TRAILER BREAK SYSTEM, AND FORWARD COLLISION SYSTEM UNAVAILABLE.\" ABS, ESC AND CHECK ENGINE LIGHT ALL ILLUMINATED ON DASH SCREEN.",
        "vin": "1GKS2BKD2MR"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SEATS,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "02/28/2021",
        "dateOfIncident": "02/23/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398289,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VECHILE IS PARK AT CARL BLACK GMC",
        "vin": "1GKS2DKL1MR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/12/2020",
        "dateOfIncident": "11/28/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383127,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WILL NOT SHIFT INTO GEAR FROM PARK.  WHEN IT'S IN GEAR (YOU CAN HOLD THE BUTTON TO SELECT A GEAR TO MOVE), BUT AS SOON AS YOU RELEASE THE BUTTON - IT GOES RIGHT BACK INTO PARK.      IT COMES AND GOES.    I'VE BEEN STUCK IN MY DRIVEWAY.  STUCK AT THE GROCERY STORE.  HAD IT ONCE SURPRISE ME AT A STOPLIGHT AND WAS ALMOST REAR ENDED - THAT TIME I NEEDED TO HOLD THE BUTTON TO ESCAPE TO THE NEAREST PARKING LOT.      DEALER, OF COURSE, WAS NOT ABLE TO REPLICATE AS THEY SAID THE ISSUE DOES NOT THROW A CODE.  I HAVE VIDEO AND PICTURES, WHICH I HAVE SUPPLIED.  SOMETIMES THE ENGINE LIGHT COMES ON TOO.      DEALERSHIP DID SAY THERE WERE SOME SERVICE NOTES IN THE SYSTEM REGARDING A SIMILAR PROBLEM, BUT THAT GM HAS YET TO ISSUE A TSB.    I'M HONESTLY WORRIED THIS WILL CAUSE A MAJOR ACCIDENT AND I DON'T TRUST HAVING MY FAMILY IN THE CAR.  IT'S AN $86,000 SUV.  UNREAL AND SO DISAPPOINTING.",
        "vin": "1GKS2DKL0MR"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/06/2020",
        "dateOfIncident": "11/04/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378101,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE COMING BACK FROM A TRIP WITH MY CHILDREN AND THIS VEHICLE WAS BARELY 2 WEEKS OLD WITH 0 MILES AND WE WERE ON A HIGHWAY WHEN ALL THE EMERGENCY LIGHTS ON THE DASH WENT OFF. IT WAS FLAGGING THE ELECTRICAL SYSTEM, THE ENGINE, THE BRAKES. HONESTLY ALL THE LIGHTS POSSIBLE WENT OFF. THE VEHICLE WAS LAGGING AND IT FELT FORCE WHEN WE PUSHED ON THE GAS. OUR HANDS WERE GRIPPING THE STEERING WHEEL TO KEEP IT IN LANE TILL WE COULD GET OFF.",
        "vin": "1GKS2DKL7MR"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/01/2020",
        "dateOfIncident": "09/19/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362218,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED THE CAR ON 9/8/2020, I STARTED NOTICED A ERROR MESSAGE ON 19SEP2020, THAT STATED SERVICE SAFETY RESTRAINT SYSTEM WITH THE AIRBAG WARNING LIGHT COMING ON.  THIS LIGHT COMES ON AND OFF SO THERE IS NO WAY TO TELL FOR SURE IF THE AIRBAG IS WORKING APPROPRIATELY.  THE MESSAGE COMES ON BOTH IF YOU ARE IN MOTION OR STATIONARY.",
        "vin": "1GKS2DKL6MR"
    }
]