[
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/01/2022",
        "dateOfIncident": "01/12/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11449744,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "On Wednesday, January 12, 2022, while driving from Columbia, SC to Cincinnati, we were heading northwest through the mountains of North Carolina, on I-40, just east of the TN border.  Traffic was fairly steady and heavy, so we were traveling at approximately 45 MPH, in the right lane, winding through the mountains. Our friend, ** ***** was driving, my wife, ********* *****, was sitting in the right front passenger seat, working on her laptop, and I was sitting immediately behind her, also working on my laptop.  With a semi-trailer truck slowing ahead of us, *** signaled to make a lane change into the left lane (this is only a two lane highway).  As we were transitioning to the left lane, the vehicle suddenly – without any warning or driver inputs – slammed on its brakes, bringing the truck to a sudden and violent stop.  Given the violent halting of the truck, we all assumed we had been rear-ended by a truck.  The braking was so serious, luggage from the rear of the vehicle shot forward like a missile, striking my wife in the back of the head.  She suffered what we believe to be a concussion, and she did seek medical attention in the days following the incident. Sitting behind her, the sudden stopping action caused me to twist my left knee, resulting in what might be a cartilage tear.  I also saw my physician in the days following, and he acknowledged the swelling of the left knee.  He advised me to monitor the knee carefully, and if the pain persists, to get an MRI.  The pain has not gone away, and I plan to get an MRI in the next week or so. Our friend suffered a severely strained back in the incident, and has been treating his back with both ice and heat therapy.  This was the THIRD time this happened, each nearly resulting in a tragic accident.  The dealer said \"it's just a software glitch.\"  The \"Brake Assist\" program is clearly defective and unsafe.",
        "vin": "1GKS2JKL0MR"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/11/2022",
        "dateOfIncident": "01/07/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447127,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I was traveling on the highway and the vehicle started to jolt, sputter and speed acceleration was reduced in a highly congested area with little room to maneuver. I had to quickly shift lanes and get off at the first exit I could as I figure out what the issue was. I immediately contacted my Dealership and they were able to get me an emergency appointment so my vehicle could be inspected that day. After the Dealers analysis they said that a lifter needed to be replaced. I have a brand new vehicle with less than 8,611 miles on it. The lifter issue puzzled me so I went to the GMC Yukon message and sure enough there are ALOT of 2021 Yukon/Tahoe owners that have had this exact same issue with even worse stories than mine.",
        "vin": "1GKS1JKL0MR"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/15/2021",
        "dateOfIncident": "12/14/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443857,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving 30 mph when the car went into neutral and rolled to a stop. When I put on the brakes the engine shut off and it went into park. It would not restart or shift out of park . I was stuck in an active busy road. The car was towed to the dealer. They said it was a problem with the BCM. GMC had put out a bullletin which was to reprogram the BCM. My concern is that if this had happened on a busy interstate in traffic at highway speeds the results could have been fatal.",
        "vin": "1gks2jkt1mr"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/09/2021",
        "dateOfIncident": "07/04/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11424049,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Make left turn and distracted by kids in the back. Looked back and felt a crash. Collided with a traffic signal pole and caused major/total damage to vehicle. Driver side airbag DID NOT deploy causing injury to neck, shoulder, and lower back.",
        "vin": "1gks2hkd3mr"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/24/2021",
        "dateOfIncident": "05/02/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422099,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Our vehicle had a warning light of traction system not working - we were told to take to nearest dealer that springs with the valves were faulty and lifters not working.  Took it to Everett in Benton, AR.  Took two weeks to get the parts to fix.  Told this was a problem.  We had 4000 miles on the vehicle.  Yesterday, it happened again.  Told by Cowboy in Heber Springs, AR where we bought the vehicle they had six in their shop with same problem.  They advised that our vehicle would have to be towed.  GMC does not think it is a safety issue but it is - the vehicle slows down and there is little power to drive.  Yesterday I was pulling a bass boat and only made it home with great difficulty.  This problem that seems to be prevalent with all the 2021 Denalis needs to be investigated before someone gets hurt or killed.  First incident was May 2, 2021 and second (after allegedly being fixed) was June 23, 2021.",
        "vin": "1gks2jkl8mr"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/01/2021",
        "dateOfIncident": "01/06/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405900,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS BEEN AT THE DEALER WITH GM INVOLVEMENT STARTING JANUARY 6TH AND IT HAS BEEN OUT OF THE REPAIR FACILITY FOR LESS THAN 2 WEEKS UP TO TODAY, 4/1/2021.  THE VEHICLE HAS AN ADAPTIVE SUSPENSION SYSTEM THAT HAS NOT ONLY FAILED, BUT HAS CONTINUED TO FAIL AFTER MULTIPLE REPAIR ATTEMPTS.  THERE SEEMS TO BE AN ISSUE WITH THIS NEW ADAPTIVE SUSPENSION, SPECIFICALLY WHEN THE 'VEHICLE ACCESS' OPTION IS TOGGLED IN THE SETTINGS.  THIS HAS CAUSED MULTIPLE SAFETY WARNINGS; 'VEHICLE TOO HIGH, DRIVE SLOWLY VEHICLE UNSAFE' AND 'VEHICLE TOO LOW, DRIVE SLOWLY, VEHICLE UNSAFE'.  DEALER AND GM HAVE REPLACES MILLIE PARTS, SOFTWARE AND SENSORS, TO NO AVAIL.  THE MAJOR CONCERN IS THAT MOST OWNERS DON'T REALIZE THE RISK AND THIS IS A FLAW IN THE DESIGN WHICH COULD LEAD TO ACCIDENTS.  MY VEHICLE HAD TO BE TOWED IN AT THE LAST RESURGENCE BECAUSE IT WAS NOT IN AS STATE TO BE DRIVEN.  THE SUSPENSION COLLAPSED AFTER HAVING 35 DAYS IN THE SHOP.  IT SEEMS THAT THE SOFTWARE AND THE SYSTEM AREN'T PROPERLY FUNCTIONING/DESIGNED.  THIS COULD BE ENDEMIC IN EVERY DENALI, OR OTHER GM VEHICLE WITH THIS SYSTEM, THAT ENABLES THE AUTOMOTIVE ACCESS (VEHICLE LOWERS WHEN IN PARK).  THIS ISSUE OCCURRED WHILE PARKED AND WHILE DRIVING, BOTH LOCALLY AND HIGHWAY.  THE SCARIEST WAS WHEN I WAS DRIVING TO THE DEALER AND THE SUSPENSION STARTED BOUNCING CAUSING ME TO GO NO MORE THAN 40MPH ON THE INTERSTATE TO THE DEALER.",
        "vin": "1GKS2JKLXMR"
    },
    {
        "components": "VISIBILITY/WIPER,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "01/31/2021",
        "dateOfIncident": "01/13/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390879,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE OWNED OVER A DOZEN GM TRUCKS OVER THE LAST 20+ YEARS AND THIS MODEL IS THE WORST EVER!  MY COMPLAINT: GM TOOK AWAY THE TURN SIGNAL LIGHTS ON THE SIDE MIRRORS. THE TURN SIGNAL INDICATORS ON THE DASH ARE TOO SMALL AND LOCATED WITH MANY OTHER LIGHTS/INDICATORS, SO THEY CANNOT BE SEEN QUICKLY NOR 'EASILY' AND CAN'T BE HEARD UNDER NORMAL TRAFFIC CONDITIONS. THIS CREATES AN INCREDIBLY DANGEROUS SITUATION WITH DRIVER DISTRACTION TRYING TO SEE IF A TURN SIGNAL HAS BEEN ACTIVATED AND INCREASES THE RISK OF VEHICLES NEXT TO THE TRUCK NOT EXPECTING A LANE CHANGE IF THEY ARE AHEAD OF THE TAIL LIGHTS. NUMEROUS TIMES OVER THE PAST FEW WEEKS I'VE OWNED THIS VEHICLE, I'VE ALMOST RUN INTO ADJACENT VEHICLES I COULDN'T 'SEE' BECAUSE THE BLIND SPOT WARNING SYSTEM DOES NOT DETECT VEHICLES WELL ENOUGH TO AVOID TURNING INTO THEM AND ALSO BECAUSE I WAS DISTRACTED TRYING TO SEE THE TURN INDICATOR ON THE DASHBOARD, OOK INTO THE SIDE MIRRORS AND WATCH MY DISTANCE TO CARS IN FRONT OF ME. THE TURN SIGNAL INDICATORS ON THE MIRRORS ON THE PRIOR MODEL SIGNIFICANTLY REDUCED DRIVER DISTRACTIONS AND INCREASED SAFETY TO THE DRIVER, PASSENGERS AND ADJACENT VEHICLES. GM MUST BE HELD ACCOUNTABLE FOR REMOVING SAFETY FEATURES!  THEY MUST BE FORCED TO REPLACE THE MIRRORS WITH ONES THAT HAVE TURN SIGNAL INDICATORS IN THEM LIKE ON PRIOR MODEL YEARS.  IF IT'S NOT A SAFETY ISSUE, WHY DID THEY HAVE THE INDICATORS IN THE MIRRORS BEFORE?? REMOVING THE MIRROR SIGNAL LIGHTS WAS OBVIOUSLY A SICK WAY FOR GM TO SAVE A FEW DOLLARS WITH INTENDED DISREGARD FOR THE SAFETY OF IT'S OWNERS, PASSENGERS AND EVERYONE ELSE ON THE ROAD.   THESE PROBLEMS EXIST WHEN THE VEHICLE IS STOPPED (BLIND SPOT ISSUES), TURNING, CHANGING LANES AND MOVING ON EVERY TYPE OF ROADWAY, BUT ESPECIALLY AT HIGHWAY SPEEDS WHERE HUNDREDS OF FEET ARE TRAVELED IN ONLY A FEW SECONDS, AND DISTRACTIONS BECOME EVEN MORE UNSAFE AND DANGEROUS TO EVERYONE.",
        "vin": "1GKS2JKL3MR"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/31/2021",
        "dateOfIncident": "01/14/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390885,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "GM CHANGED THE TRAVEL OF THE STEERING COLUMN SO NOW IT'S ONLY A FEW INCHES FROM THE DASHBOARD. IN PRIOR MODELS, THE STEERING WHEEL (SW) TRAVEL WAS MUCH MORE. DUE TO GM'S DESIRE TO SAVE MONEY AND COMPLETE DISREGARD FOR DRIVER, PASSENGER AND OTHER VEHICLES SAFETY, THE DRIVER HAS TO REACH OUT TO THE SW RESULTING AT DANGEROUS ELBOW ANGLES. IN PERFORMANCE CARS, THE SW IS DESIGNED TO BE CLOSE TO THE DRIVER BECAUSE PHYSICS PRINCIPLES OF TORQUE REVEAL: THE GREATER THE ANGLE OF REACH, THE MORE TORQUE IT REQUIRES TO TURN THE SW. SO REACHING OUT WITH THE ELBOW AT ZERO TO 10 DEGREES REQUIRES A MUCH LONGER REACH, THUS GREATER FORCE/TORQUE AND LONGER REACTION TIME, THAN HAVING THE SW AT A 30-40 DEGREE 'ELBOW BEND'. THE POINT IS, FOR A DRIVER TO TURN THE SW ON THIS VEHICLE, IT TAKES TOO MUCH STRENGTH AND TOO LONG A REACTION TIME TO SAFELY OPERATE IT. I DO NOT FEEL SAFE DRIVING THIS MODEL LIKE I DID WITH PRIOR MODEL YEARS. WITH THIS 'LAND YACHT' HAVING AN EVEN LONGER WHEELBASE THAN BEFORE, THE DISTANCE TO THE SW IS EVEN MORE CRITICAL IN REGARDS TO REACTION TIME AND SAFE DRIVING! PLUS, SINCE THE SW IS SO CLOSE TO THE DASHBOARD, WHEN I RAISE MY LEG TO STEP ON THE BRAKE PEDAL (WHICH NOW I HAVE TO DO BECAUSE GM ALSO TOOK AWAY THE FOOT PEDAL ADJUSTER!), MY LEG HITS THE BOTTOM OF THE SW!  THE TIME IT NOW TAKES TO BRING A FOOT UP OVER THE BRAKE PEDAL, TO LOOK DOWN TO SEE IF YOUR LEG IS GOING TO HIT THE SW AND CAUSE THE SW TO EITHER STOP MOVING OR RE-DIRECT THE VEHICLE INTO AN UNPLANNED DIRECTION, ALL WHILE TRYING TO STOP THIS OVER 7,700 LB VEHICLE WITH MUSHIER BRAKES THAN ANY MODEL EVER, IS DANGEROUSLY LONG. THE OVERALL REACTION TIME TO GENERALLY STOP THIS MODEL IS AT LEAST 5 TIMES THAT OF MY 2018 YUKON XL DENALI. THE TRAVEL LENGTH OF THE SW NEEDS TO BE INCREASED 2-3 INCHES TO SAFELY OPERATE THIS TRUCK. GM MUST BE HELD ACCOUNTABLE FOR INCREASING DANGEROUS SITUATIONS WITH THEIR VEHICLES!",
        "vin": "1GKS2JKL3MR"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/02/2020",
        "dateOfIncident": "10/16/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372749,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH ONLY 52 MILES (2-DAYS OLD), I WAS DRIVING HOME WHEN I HEARD A KNOCK.  THEN THE ENGINE LIGHT CAME ON AND THE VEHICLE STABILITY CONTROL LOWERED THE VEHICLE AND THE VEHICLE SHUT OFF.  I WAS LEFT IN THE MIDDLE OF TRAFFIC UNABLE TO MOVE THE VEHICLE TO A SAFE LOCATION.  NEUTRAL WOULD NOT WORK EITHER.  WHEN THE VEHICLE WAS TOWED TO THE GMC DEALERSHIP, THEY KNEW EXACTLY WHAT WAS WRONG WITH THE CAR, BROKEN SPRINGS IN THE ENGINE.  APPARENTLY THEY SENT A NOTICE STATING THAT THE ENGINE SPRINGS WERE BREAKING AND NEEDED TO BE REPLACED.  THE DEALERSHIP ONLY OFFERED TO REPLACE THE 2 BROKEN SPRINGS, NOT ALL OF THEM SINCE MY VEHICLE WAS BUILT AFTER THE DATE NOTED FOR HAVING ISSUES.  THEY WOULD NOT PROVIDE ME WITH ANY PAPERWORK ABOUT THE SERVICE.  I'M NOT SURE HOW THIS COMPANY CAN GET AWAY WITH SELLING VEHICLES THEY KNOW HAVE ISSUES WITH FAULTY PARTS.",
        "vin": "1GKS2JKL6MR"
    }
]