[
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/04/2022",
        "dateOfIncident": "03/13/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459514,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The rear glass shattered with temperature change and defrost use?. The car was garage kept all winter until the weekend of the issue. It was kept outside overnight on Friday and temperatures were in the 20s. I used my rear defroster for the very first time on Saturday morning and returned home Saturday. On Sunday morning, I closed the door of the car and the rear glass shattered and collapsed. It seems like they may have a batch of badly tempered glass but refuse to acknowledge it. They required me to have the car towed to the dealership. This damages any investigation value and they said it looked like a hammer smashed it in but it didn’t look like that when it was at my home. I had police come and look at it and they did not find any evidence of vandalism. The location of the damage is VERY centered and would be hard to reach and not likely the spot for someone just trying to smash the window.",
        "vin": "1HGCV3F18MA"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "04/04/2022",
        "dateOfIncident": "04/03/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459606,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A ROAD ,IT AUTOMATICALLY APPLIED THE BRAKES AS IF ANY VEHICLE IN FRONT OF ME OR ANY  OBSTACLES CAME IN FRONT OF MY VEHICLE ,BUT IT WAS NOTHING I WAS VERY LUCKY THAT THERE WAS NO VEHICLE BEHIND ME OTHERWISE I WOULD HAVE INVOLVED IN AN ACCIDENT",
        "vin": "1HGCV1F51MA"
    },
    {
        "components": "SERVICE BRAKES,LANE DEPARTURE,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/22/2022",
        "dateOfIncident": "03/19/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457907,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "21 Accord breaking itself there is no reason and there is no car around. Blind Spot working itself there is no car around car. Almost had 4 accidents.  Not driving anymore waitin attorneys for lemon law",
        "vin": "1HGCV1F53MA"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "03/21/2022",
        "dateOfIncident": "03/21/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457664,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 Honda Accord. The contact stated while driving approximately 60 mph, the steering wheel and brakes failed to function. The contact stated no warning light was illuminated. The contact stated he drove into a side rail and stretched the driver side panel of the vehicle. The contact also stated the rear view camera was not functioning. The air bags did not deploy. The contact stated he did not have any injuries nor seek medical attention. No police report was filed. The contact he was able to drive to his residence but continued to experience the failure on the steering wheel and multiple warning lights were illuminated. The vehicle was not diagnosed or repaired. A dealer was not contacted. The manufacturer had not been informed of the failure. The failure mileage was approximately 38,000.",
        "vin": "1HGCV1F45MA"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/21/2022",
        "dateOfIncident": "03/21/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457697,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The car slowed down and break in the middle of intersection no others cars or people in the way",
        "vin": "1HGCV1F48MA"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/11/2022",
        "dateOfIncident": "01/13/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456284,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The automatic breaking system has almost caused 2 accidents. As I am easing into a stop with a car in front of me, my car has applied the automatic breaking system while I am breaking. The car In front was a car length ahead of me, thus it should not have been activated because I was not in danger. This almost caused an accident because the person behind me was basically getting a break check from me. Although it is trying to prevent an accident from happening it is actually causing one. A similar incident happened when a car was turning into a side street. I was slowing down and easing into my breaks when suddenly the automatic break system was applied. Again I had a safe distance between me and the car that was turning and it made be break really hard. The car behind me had to swerve out of the way in order to avoid a crash. The automatic breaking system is ruining my break pads. I am barely at 7000 miles and my accord is starting to make noise when I apply pressure to my breaks when I am backing up.",
        "vin": "1HGCV1F37MA"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/07/2022",
        "dateOfIncident": "03/07/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455604,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I was with my family taking the on ramp to the Long Island expressway, when suddenly the rear wheels locked up and the parking brake was engaged. I hit the brakes. And as fast as it happened is as fast as it resolved.  Scared all of us and almost got hit from the car behind us.",
        "vin": "1hgcv1f43ma"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/04/2022",
        "dateOfIncident": "02/15/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455249,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Not sure exactly the date but it was around 2-15-22  when the incidences happened several times last month while driving eastbound on the I-10. All of a sudden my vehicle was coming to a complete stop but I didn’t allow it to so I pressed the accelerator pedal to keep moving forward. One of the first times it happened there was a vehicle behind me but not close enough to have caused an disruptions in both vehicles. The second incident occurred but with no vehicles behind on the highway. The only warning indicator popped up on my dash was a flashing “Brake” indicator with an audio chime.",
        "vin": "1HGCV1F49MA"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/03/2022",
        "dateOfIncident": "03/03/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455126,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Paint chipping on the body, the paint has chipped down to bare metal",
        "vin": "1HGCV1F34MA"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/01/2022",
        "dateOfIncident": "02/24/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454771,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "2/24/22 - Drove to work in the morning. Front driver door will not open from outside or inside. Had to climb over the center console and exit thru the passenger door. The driver's door will unlock, but will not open.  Problem disappeared when getting back to the car after work (4pm EST).  3/1/22 - Rear driver door would not open from outside or inside. This was going on most of the day. Took the car to Great Lakes Honda West (Elyria, Ohio) at about 6:30pm EST.  The rear driver door opened when at the dealership.  The service tech mentioned possible BCM issue, but said I would have to bring it back when the door was stuck closed again.",
        "vin": "1HGCV3F40MA"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/25/2022",
        "dateOfIncident": "02/15/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454044,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Phantom Braking when using Adaptive Cruise control.  The vehicle brakes unexpectedly when adaptive cruise control is enabled.  Typically happens when there is no leading vehicle in my lane, but there are vehicles ahead of me in other lanes.  Happens consistently, almost every time the adaptive cruise is enabled.    The system also applies brakes in situations when cruise control is not enabled, and there is no leading vehicle in front of me.    Issue can surprise drivers behind me and lead to a collison where I am hit from behind.",
        "vin": "1hgcv3f55ma"
    },
    {
        "components": "ELECTRICAL SYSTEM,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/24/2022",
        "dateOfIncident": "01/01/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453797,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Automatic braking has initiated for no reason, at least four times almost causing accidents, car radio sometimes will no shut off, seems to be some type of electrical problem, I have had both issues looked at by dealer who states they cannot find a problem with this vehicle, there is Definitely a problem and it must be found before someone get hurt.  auto braking has happened on the freeway, and on residential streets",
        "vin": "1HGCV1F56MA"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/29/2022",
        "dateOfIncident": "01/29/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449364,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I have experienced 2-3 sec hesitation upon accelerating.  This hesitation occurs occasionally usually when turning and the is stopped or moving slowly. When it has happened I have experienced threatening safety situations particularly when making turns when crossing oncoming traffic such as when making a left 90 degree turn at a stop light with oncoming traffic in the lane I am crossing or if I have to make a quick acceleration to avoid a rapidly threatening safety situation.",
        "vin": "1HGCV3F5XMA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/10/2022",
        "dateOfIncident": "11/26/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446942,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Navigation system errors:  turn wrong direction, turn wrong compass direction, system will not recognize home.  System was inspected more than once by the Honda dealer. A case was filed with Honda Corp",
        "vin": "1HGCV2F92MA"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/08/2022",
        "dateOfIncident": "01/07/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446693,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "My vehicle has less than 5,000 miles. My vehicle has been running fine for the last 5 months; however, I got back into my car and heard my rear right brake, on the passenger side, making a grinding sound. It appears that the break pad is worn out and grinding on the rotor, or the brake module is faulty and has been forcing additional pressure on the rotor to create and untimely wear.   The grinding is so strong, it is making it unsafe to drive under normal conditions.  No warning lamps or indicators are on.  Warranty inspection is scheduled. There are other reports of this issues with other owners.  The vehicle has not been in an accident, modified, or driven in any manner other than normal driving.  Additionally, when it is raining, the auto brake feature may turn on and slow the vehicle quickly when it is not necessary.",
        "vin": "1HGCV1F16MA"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/26/2021",
        "dateOfIncident": "12/25/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445019,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2021",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "EXTREMECONTACT DWS06 PLUS",
                "productYear": "9999",
                "size": "235/40ZR-19 96W",
                "type": "Tire"
            }
        ],
        "summary": "My tires were purchased new on 11/6/21 from Les Scab in Portland, OR. and are Continental ExtremeContact DWS06Plus, size 235/40ZR-19. A few weeks after purchase the TPMS came on so I had the tires checked at Les Schwab. I was told all the tire were low, likely due to weather. Within a couple weeks the TPMS came on again, I returned to Les Schwab on 12/18/21. I was told all the tires were a little low again but that the rear drives tire was at 19 Psi. I was told again it was likely weather but that the rear drivers tire was a little lower than the rest and if the TPMS came on again to return. On the evening of 12/23/21 the TPMS came on again. I took my car to Les Schwab again and about 11am and was told they could fill the tires, but they could try to find and fix the problem because they would close at 1pm and they did not have time but to bring it back on Monday. Despite my pleas, they refused. I tried calling the Regional Manager at his store but every time I called someone answered and either hung up or put the call on hold but did not answer.   On 12/25/21 at about 6:50pm while driving about 55 mph on the I-5 freeway in Portland, OR., I was in the center lane and heard a loud pop. My stirring wheel pulled right and as I held tight, I heard another loud, dull, grinding noise from the front passenger side of the car. I slowed, turned on my hazard lights and waited for traffic to stop so I could pull to the side of the freeway. I looked and saw that the front passenger side tire tread had completely detached from the sidewall. I then called to have to car towed back to my home.",
        "vin": "1HGCV3F9XMA"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/13/2021",
        "dateOfIncident": "11/08/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443613,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 Honda Accord. The contact stated when entering their vehicle. they noticed several small dark circles forming around the front driver side window as well the front windshield which made it difficult for the contact visibility while driving the vehicle. The contact stated after a few days the dark circles would disappear however it comes back intermittently. The contact took the vehicle to a local dealer who inspected the vehicle and was told they believe the failure is related to the tinting on the windows that is causing the failure but was not able to provide a fixture for the failure. The vehicle was not repaired. The manufacturer was made aware of the failure. The failure mileage was unknown.  Consumer stated circles appear randomly on six windows. There are wide dark slanted stripes that intermittently appear within the window. Regional Manager stated occurrences had to do with the tinting of the eight windows. Suggestions were made as to what could be done.  Either, warranty ,would be extended or, darken the tint, or, replace all eight windows.",
        "vin": "1hgcv1f37ma"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES,ENGINE",
        "crash": true,
        "dateComplaintFiled": "12/08/2021",
        "dateOfIncident": "12/07/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443037,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Upon pulling into a parking space, with the steering wheel almost at full lock to the right, when I braked, the car suddenly accelerated out of control and hit another car. Airbags did not deploy but there was damage to both vehicles, no injuries. Vehicle has been taken to a collision repair shop to await repair. It is available for inspection. Has not been looked at to date.",
        "vin": "1HGCV3F55MA"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "11/15/2021",
        "dateOfIncident": "11/15/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440569,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Blind spot warning indicator intermittently illuminates when there is no vehicle in the blind spot.",
        "vin": "1HGCV1F57MA"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/13/2021",
        "dateOfIncident": "11/09/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440332,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I opened the hood to clean leaves collected at the drain. As with my other cars, I thought that the hood would remain in up position. It just suddenly came down with tremendous force. I almost had my hands crushed under the hand. I got lucky  but driver's side viper arm broke at the end which I had to get replaced at my expense.  I think that Honda should recall and install hood lift supports to prevent serious injury to persons.",
        "vin": "1HGCV1F59MA"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/03/2021",
        "dateOfIncident": "07/31/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439227,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The paint is peeling off",
        "vin": "1hgcv1f56ma"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "10/07/2021",
        "dateOfIncident": "08/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435932,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 Honda Acord. The contact stated that while driving, the brakes engaged inadvertently without warning. Additionally, the vehicle slowed down while approaching the pedestrian crossing. The local dealer was called, and an appointment was scheduled however, the vehicle was not diagnosed or repaired. The manufacturer was not notified of the failure. The failure mileage was 9,300. The VIN was not available.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/30/2021",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434957,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "ANC making annoying noise and never goes away , car makes a loud humming noise that is really noticeable when driving. This has been going on since I bought it .  Replacing it doesn’t help it it’s the same thing. Honda needs to fix this .",
        "vin": "1HGCV2F30MA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/24/2021",
        "dateOfIncident": "09/22/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434291,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving in heavy rain on interstate, vehicle experienced lack of power and flashing check engine light. Driver was unable to maintain speed. Pulled off at next exit and turned off. Roadside assistance was contacted immediately after pulling off. Vehicle restarted and ran normally after allowing it to remain off for approximately 1.5 hr.  Roadside assistance was cancelled. Continued trip without further incident.",
        "vin": "1hgcv1f46ma"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/14/2021",
        "dateOfIncident": "09/14/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432942,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Tire jack not provide with buying new car Honda Accord hybrid 2021 How can I use flat tire repair kit without tire jack.It was disclosed to me when buying. Tire jack & tools tick mark in delivery documents but not provided.",
        "vin": "1hgcv3f56ma"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/30/2021",
        "dateOfIncident": "08/17/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431095,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving in heavy rain for most of the morning, I entered an interstate and attempted to pass a semi.  The engine lost power as I moved into the center lane.  I had to slow down and re-enter the far right hand lane as the engine trouble light began flashing and I had either very little power or too much power to keep the car in a steady state.  This out me and my wife's safety at risk as the rain was heavy, and pulling over to the shoulder did not seem to be a good idea since I could keep the car in forward motion in some way. I pulled off at the next exit and we ate lunch and apparently the car reset as the engine light quit flashing and the car acted normally after that.  The dealer was approached and said, since the light was off there was nothing they could do. A TSB is out that applies to this problem but the dealer said the manufacturer was contacted and declined a repair.",
        "vin": "1hgcv2f39ma"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "08/24/2021",
        "dateOfIncident": "05/25/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430390,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Incident 1: Car suddenly applied brakes while traveling at 60 MPH on the fast lane. There was no vehicle in the front for at least 50 ft. ahead.  Incident2: Car suddenly applied brakes while traveling at about 40 MPH.  Again no vehicle in the front for at least 100 ft. in the front.  Worried about the vehicles colliding from the rear and the whiplash effect on the neck, because the braking was not expected.  Contacted the dealer.  First time I was told to bring it in for check up.  I did not take it because I wanted to do it at the first oil change. Second time happened about 3 weeks ago.  Contacted the dealer.  Asked the dealer whether the safety feature can be turned off.  He said he will get back to me next day.  He never did. Sent a subsequent message \"???\" but no reply.  Then I called this morning. He said he is with a client and will get back to me in 30 mins. He did not. Then I sent a message saying that I am disappointed with the after sales service with the dealership on this safety issue and that I will inform NTSB about this problem.",
        "vin": "1HGCV3F9XMA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/09/2021",
        "dateOfIncident": "08/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428388,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Going at highway speeds with recirculate button pressed, a noise comes out of AC vent  When recirculate button is turned off, sounds goes away",
        "vin": "1HGCV3F56MA"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/13/2021",
        "dateOfIncident": "06/11/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420769,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "N/A",
        "vin": "1HGCV1F50MA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/11/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416061,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2021 HONDA ACCORD. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 50 MPH, THE STEERING WHEEL CEASED WHILE THE IDLE WARNING ERROR ILLUMINATED. THE CONTACT MENTIONED THAT THE STEERING WHEEL RETURNED TO NORMAL FUNCTION INDEPENDENTLY. THE VEHICLE WAS NOT TAKEN TO A DEALER NOR INDEPENDENT MECHANIC. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED A CASE NUMBER. THE APPROXIMATE FAILURE MILEAGE WAS 564.",
        "vin": "1HGCV1F16MA"
    },
    {
        "components": "VISIBILITY,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/20/2021",
        "dateOfIncident": "11/04/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11412992,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2021 HONDA ACCORD. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE VIEW OUT OF THE FRONT WINDSHIELD WAS VERY DISTORTED. ADDITIONALLY, THE BRAKE PEDAL HESITATED TO OPERATE CORRECTLY WHEN DEPRESSED. THE VEHICLE WAS TAKEN TO TAMERON HONDA (1675 MONTGOMERY HWY, BIRMINGHAM, AL 35216, (205) 236-5414) WHERE THE TECHNICIAN VERIFIED THE FAILURE DURING A TEST DRIVE. THE CONTACT STATED THAT THE WINDSHIELD HAD BEEN REPLACED THREE TIMES. THE CONTACT STATED THAT BOTH FAILURES RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. A FIELD REPRESENTATIVE INVESTIGATED THE ISSUE WITH THE WINDSHIELD HOWEVER, NO FURTHER ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS APPROXIMATELY 5.",
        "vin": "1HGCV1F54MA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/06/2021",
        "dateOfIncident": "03/06/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399536,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON THE HIGHWAY, HEARD A BOOM, SUNROOF BLEW OUT. NO REASON/EXPLANATION. THE COVER WAS CLOSED AND THE SUNROOF WAS COMPLETELY CLOSED, NOT EVEN TILTED UP. DRIVING ABOUT 70 MPH.",
        "vin": "1HGCV1F56MA"
    }
]