[
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/14/2021",
        "dateOfIncident": "07/13/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424785,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 Honda Insight. The contact stated while driving at 55 mph, a deer jumped in front of the vehicle causing the contact to hit the deer but none of the air bags deployed. The contact mentioned that the automatic brakes were engaged during the incident. No one was injured and a police report was filed. The contact stated no warning lights were illuminated. The vehicle was towed to a dealer and was awaiting an inspection. The manufacturer was not informed of the failure. The failure mileage was approximately 6,500.",
        "vin": "19XZE4F50ME"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/10/2021",
        "dateOfIncident": "02/04/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395655,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED THE VEHICLE ON 1/23/21. ON 2/4/21, I WAS DRIVING IN DOBSON, NC, WHEN THE POWER CONTROL UNIT (PCU) MALFUNCTIONED, LEADING TO LOSS OF POWER STEERING AND BRAKES. WHEN I STARTED THE CAR, THE WARNING LIGHTS CAME ON. I TURNED THE CAR OFF AND THEN RESTARTED IT WITHOUT WARNING LIGHTS. I THEN BACKED OUT OF THE DRIVE AND STARTED ON MY WAY. AS I WAS DESCENDING A HILL, THE TRANSMISSION SHUT OFF. I WAS ABLE TO COAST TO A STOP WITH SOME BRAKING. THE CAR WAS TOWED TO FLOW HONDA IN WINSTON-SALEM, NC, WHERE THEY REPLACED THE PCU. WE PICKED UP THE CAR ON 2/9/21. MY WIFE WAS ABLE TO DRIVE IT FROM WINSTON-SALEM TO DURHAM, NC WITHOUT INCIDENT. SHE THEN DROVE ON I-40 TOWARDS OUR HOME IN RALEIGH, NC. WHILE TRAVELING ON I-40 AT 65 MPH, THE PCU MALFUNCTIONED AGAIN, AND THE TRANSMISSION STOPPED WORKING. SHE WAS UNABLE TO ACCELERATE, AND THE POWER STEERING AND POWER BRAKING WOULD NOT FUNCTION. SHE WAS ABLE TO COAST OVER TO THE RIGHT LANE FROM TWO LANES OVER AND THEN COASTED TO THE EXIT TO SAFETY. WHEN THE TOW TRUCK CAME TO RETRIEVE THE VEHICLE, THE CAR STARTED BUT WOULD NOT GET OUT OF PARK (IT COULD SHIFT INTO NEUTRAL BUT WOULD REVERT TO PARK WHEN MY FOOT WAS TAKEN OFF THE BRAKE). THE CAR WAS TOWED TO CROWN HONDA OF DURHAM, WHERE WE PURCHASED THE VEHICLE.",
        "vin": "19XZE4F51ME"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/16/2021",
        "dateOfIncident": "12/09/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388438,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TWO OCCASIONS I'VE HAD A BRAKE SYSTEM PROBLEM EROR MESSAGE POP UP ON MY HOME SCREEN INSIDE OF THE CAR AND ON THE HONDALINK APP 12/09/2020 AND ON 12/18/2020. I WAS LEAVING WORK ON BOTH INCIDENTS. THE MESSAGE READS: THE BRAKE SYSTEM HAS A PROBLEM OR THE BRAKE FLUID MAY BE LOW. I THERE IS NO RESISTANCE FROM THE BARK PEDAL, DOWNSHIFT TO LOWER GEARS TO SLOW THE VEHICLE. IMMEDIATELY STOP IN A SAFE PLACE AND CONTACT ROADSIDE ASSISTANCE.     PART TWO: THE BRAKE SYSTEM HAS A PROBLEM. AVOID HIGH SPEEDS AND SUDDEN BRAKING. HAVE YOUR VEHICLES CHECKED BY A DEALER IMMEDIATELY.  THE MESSAGE DISAPPEARS AFTER A FEW MINUTES OF BEING ON THE DISPLAY SCREEN. ALSO THE BRAKES ARE SQUEAKING MOSTLY WHEN I'M ABOUT TO TAKE OFF IN MOTION DURNING STARTUP. I TOOK THE CAR TO THE HONDA DEALERSHIP ON 01/15/2021. THEY COULD NOT GET THE CAR TO DUPLICATE THE BRAKE ERROR CODE THAT'S  SHOWED UP BEFORE. THE TECH TEST DROVE MY CAR FOR 20 MILES AND NOTHING WAS FOUND. TODAY 01/16/2021 WHEN I RETURNED HOME FROM THE STORE THE BRAKES SQUEAKED AGAIN, BUT THIS TIME WHEN I WAS BACKING THE CAR IN TO MY PARKING SPACE.",
        "vin": "19XZE4F54ME"
    }
]