[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/04/2022",
        "dateOfIncident": "01/24/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459570,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "After approximately 2 unbroken hours of driving North on I-35 from Minneapolis on January 24th, 2022, I exited the freeway at exit 214 near Moose Lake.  I came to a stop at the top of the ramp (stop sign) to allow cross traffic to clear and then proceeded to accelerate while turning left to cross the bridge over the freeway.  About halfway through the turn, a blinking check-engine light came on.  The engine also began running noticeably rougher and would not accelerate beyond 30-40 mph.  I proceeded to drive about a 1/4 mile in this state to the nearest parking lot - a McDonalds just beyond the bridge.  Once parked, I turned the car off and looked up check-engine codes in the owner's manual.  The manual indicated that a cylinder misfire was detected and that I should seek dealer service.  Frustrated (the nearest Honda dealer was likely in Duluth, an hour away), I tried starting the car and was surprised to find that it started normally without any check-engine light.  After some lunch, I got back on the freeway and proceeded to drive another several hours without incident to my final destination near Virginia, MN. I quickly chalked it up to the unusually cold weather that morning, even for MN in January, and, since the issue has never repeated itself, I did not consult a dealer.  However, I've recently read of many other Ridgeline owners experiencing very similar issues and thought it would be best for me to contribute my account. Under the right conditions, I believe this could be a very serious safety concern that deserves rigorous attention by Honda's engineers.",
        "vin": "5FPYK3F5XMB"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/23/2022",
        "dateOfIncident": "12/19/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458019,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "After driving for long distance (over 200 miles) in cold weather at highway speeds, and then making a slow right-hand turn, the Check Engine light came on and vehicle went into 'limp' mode. This happened twice, 2 weeks apart. Vehicle has less than 8,000 miles on it.",
        "vin": "5fpyk3f13mb"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/10/2022",
        "dateOfIncident": "11/06/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456074,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Upon exiting or entering the highway, the truck loses power and will not accelerate. This happens after multiple hours of highway driving and seems to only happen when the temperature is near or below freezing.  The Check Engine Light (CEL) comes on and is flashing.  This has happened to me four times. Three of which were exiting one highway to merge onto another and there was ample room to slow down and pull over.  One time was merging onto a highway from a Rest Stop with a great deal of traffic and I was fortunate the shoulder was available to avoid being collided with.  The first time was on 11/6/2021 (2200miles), second and third was on 12/19/2021 (5600miles) and last time was 3/9/2022 (10100miles). All occurrences the gas tank had ample gas.  Shutting the truck off and turning it back on clears the CEL and no error codes are stored (according to the dealer).  This problem has been reported multiple times and yet there has been no response from Honda. Also, even though the error codes are not present after the vehicle is turned off and back on, I was able to capture three error codes prior to turning the vehicle off P0302, P0303, P0300.",
        "vin": "5fpyk3f87mb"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/09/2022",
        "dateOfIncident": "01/01/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455884,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 Honda Ridgeline. The contact stated that upon either exiting or merging onto a highway at various speeds, the vehicle would independently go into Limp Mode with the check engine warning light illuminated. The contact had filed a complaint with the manufacturer through the website; however, the contact had not received a response from the manufacturer. The contact had taken the vehicle to the dealer where the mechanic was informed by the manufacturer to check the engine valves however, the dealer had not been able to diagnose the failure. The vehicle had yet to be repaired. The failure mileage was approximately 1,800.",
        "vin": "5fpyk3f76mb"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/04/2022",
        "dateOfIncident": "01/17/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455186,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle went into \"limp mode\" after exiting a freeway. When attempting to merge into roadway, vehicle flashed CEL for engine. Vehicle shut down 3 cylinders giving very little power to merge into traffic. Unable to get vehicle over 30 mph on a busy road. Honda dealer said no codes were stored and haven't heard of the complaint previously. Vehicle had no issues previously. 6,000 miles on a new vehicle.",
        "vin": "5fpyk3f8xmb"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/03/2022",
        "dateOfIncident": "02/23/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454956,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "On 2/23/2022, I was driving my Ridgeline on local roads with 40 MPH speed limits. On 2 separate occasions, the \"BRAKE\" flashed on the dashboard for no reason. There were no obstructions ahead. The warning appeared for a second or two and then disappeared. I felt no braking of the vehicle.   I have previously reported this incident by Email, and has been assigned #491499 2021 Honda Ridgeline-BRAKE Warning on Dashboard.",
        "vin": "5FPYK3F19MB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/01/2022",
        "dateOfIncident": "04/16/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454658,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The automatic high beam assist does not function properly. The high beams go on and off constantly. They pick up their own reflections even on dark roads with no on coming traffic. They will stay on when other cars are approaching. They come on when in traffic. They flash on and off at cars approaching. I have requested two dealerships to look into this and they did not even put it in the work order to check the issue. I have complained to Honda customer service with no satisfaction. I am afraid the lights will affect on coming cars or aggravate cars in front of me. The system is absolutely useless and should not be offered as a safety option.",
        "vin": "5fpyk3f76mb"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/24/2022",
        "dateOfIncident": "02/01/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453766,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "This is a general issue that you can find in the forums of the Honda Pilot/Ridgeline/Passport. Is affecting all of them.   Very easy to replicate. When using adaptive cruise control and the person in front of you changes lanes. If that person that moved to another lane slows down your vehicle will slow down too, thinking that the car is still in front of you.  This is a huge security risk that can cause a rear-end collision if the person behind you is distracted.",
        "vin": "5fpyk3f73mb"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/14/2022",
        "dateOfIncident": "01/21/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451939,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "On 1/21/22,After driving an hour at 75mph exited onto off street. While driving through traffic truck began to \"sputter\" and wouldn't accelerate. I then noticed flashing engine light. After driving about 5 minutes through traffic because I had no place to go, I parked and shut it off. Turned back on no light and no issue. Since I needed to drive home later that night I brought to a dealership for diagnostics. Like everyone else in the Honda forum, no codes or errors. 2675 miles on the truck, about 1/2 tank of gas. Temp around 20 deg. On 2/12/22,  Drove 160 miles, 70-75mph, temp 10 degrees, gas tank 3/4 full. Didn't stop that entire time. Got off on an exit and continued to drive between 30-45 mph for about 4 miles without coming to a full stop. Finally I reached a stop sign. Cross traffic did not have to stop. After stopping (engine idle was on but don't think engaged) and no oncoming traffic, I turned left. Immediately as I pressed the gas pedal, truck started to sputter and engine light started flashing. Luckily no traffic coming up from behind and I had room to pull over and stop. However, since this is the SECOND time this has happened, I had my wife video the dashboard. Yep got it all on video. This has to be FIXED. Can't imagine if that were my kids driving and traffic was barreling up on them. Imagine a semi coming up at 60mph and no power or place to move out of the way. After stopping and turning off the truck, the issue went away. Coming home the same day, there were no issues. Closet Honda dealer is an hour away so I can't drop off conveniently. 2021 Honda RTLE, 3500 miles",
        "vin": "5FPYK3F77MB"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/31/2022",
        "dateOfIncident": "12/07/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449572,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "This is an unsafe vehicle to drive and can cause injury or DEATH.  I along with many others have been having problems with the CEL flashing and engine running properly.  The dealers can't find a cause because the code deletes itself and the problem temporary goes away when you shut the engine off and is NOT saved in the computer.  It has been a complete waste of time going to the dealer only to find no codes stored.  I am not alone in this, as many others are starting to have this exact same problem during the exact same driving conditions.  See the forum below:  https://www.ridgelineownersclub.com/threads/2021-check-engine-light-flashing.229929/#post-3220773  Here is the first time it happened.   (THIS HAS HAPPENED 3 TIMES ALREADY)  (DEC 7, 2021) Hello all, I have a 2021 RTL-E. After driving on highway for an hour and a half at 80mph, I exited the highway and as soon as I pulled onto a secondary road the check engine light started flashing and the engine was hesitating with little to no power and poor shifting. I limped it to safe place to pull over (aprox 3 miles) and shut the truck off.  I checked under the hood and didn't see anything and after approximately two minutes I restarted the truck and the light was gone and it drove fine after that. (It was 15°F with 10,250 miles at the time and not towing or hauling anything) I drove it the next day 4 hours on Highway without any issues.  Has anybody else experienced this issue on the 2021's?  There's not enough room to type the other times this problem occurred!!!  This is an unsafe vehicle to drive and can cause injury or DEATH.  The 2021 Honda Ridgeline is no longer the dependable vehicle that I was hoping to have when I purchased it NEW in June of 2021.  I live in a rural area and do not have a dealer that is close by which is why I bought a Honda in the first place because it was Supposed to be a dependable vehicle.  This needs to get resolved and I would appreciate any help on how to resolve this.",
        "vin": "5FPYK3F79MB"
    },
    {
        "components": "WHEELS",
        "crash": true,
        "dateComplaintFiled": "01/23/2022",
        "dateOfIncident": "03/22/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448522,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "OEM front left and right fender flares detaching from fender on highway speeds. If I didn't notice this, it would of broke off and hit a pedestrian or another vehicle  cuasing an accident. I will be bringing this in for the 3rd time to fix the same problem. I really believe it's an engineering defect.",
        "vin": "5FPYK3F83MB"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/02/2022",
        "dateOfIncident": "12/31/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445874,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Drove the pickup 3 hours in 10 degree weather at 60-70 mph. Exited the freeway, stopped at light, went through the intersection and truck began to bog down. Engine light started flashing and truck wouldn’t go over 35 mph. Pulled off road, shut down the engine for 5 minutes, started truck up and drove like normal the 3 miles home. Could have been dangerous at the intersection as the truck wouldn’t accelerate as normal and I had very little power to the wheels.",
        "vin": "5fpyk3f8xmb"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/16/2021",
        "dateOfIncident": "12/16/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444074,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "General Complaint - The infotainment system is terribly designed and requires way too much interaction from the driver to function properly.  I just traded in my 2015 F150 for a 2021 Honda Ridgeline.  EVERYTIME I choose to NOT connect my iPhone to the system through a  USB to Apple Lightning cable, the system displays a warning that there is no device connected and will not show any other information until several specific buttons are pushed.  Other scenarios where too many buttons needed to change settings. Too much interaction for a driver to do while safely operating the vehicle. I would replace the head unit but too many settings for the vehicle would be lost. Honda failed miserably in the radio design. Technology should help drivers, not hinder.",
        "vin": "5FPYK3F50MB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/24/2021",
        "dateOfIncident": "10/22/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437980,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "On this model of vehicle, if the vehicle dies and cannot be restarted, as an example if you are on a busy highway or intersection, there is no way to get the vehicle in Neutral so it can safely be moved WITHOUT having a special tool, Honda part #07AAA-TZ3A100. This tool is currently not available to purchase from any Honda dealer. This tool has to be used with the front hood open and reaching down and turning a bolt & manually locking the transmission in Neutral. The location of this bolt outside the truck & under the hood is also a hazard for the vehicle rolling and not being able to easily disengage it from neutral by having to get back out of the truck again and get under the hood. It is also a hazard to have to get out of the vehicle, on a highway or busy intersection or other hazardous area. In prior models of this vehicle, there was a method to manually put the vehicle in neutral while seated in the drivers seat, minimizing the risk of injury by having to get out of the truck and pop the hood. This is a very hazardous design flaw that should be remedied by Honda immediately. Honda should provide remedy to all vehicle owners and provide the method for manually putting the vehicle in neutral back inside the vehicle as it was in prior models as it is a safety hazard as it is designed now with the manual release under the front hood.",
        "vin": "5FPYK3F10MB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/23/2021",
        "dateOfIncident": "05/10/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437877,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "My Ridgeline have a wireless charger that fails charging and and makes the phone hot after trying to charge the phone and fails, my Honda dealer replaced the unit but the problem persist, I did find that is not only my vehicle but a lot more and Honda is aware of the situation, my concern is that this charger can make my phone explode with huge consequences, I don't feel save with this device that can make my truck caught on fire.",
        "vin": "5fpyk3f8xmb"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/13/2021",
        "dateOfIncident": "05/29/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436666,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Never works since bought on May 30, 2021, Wireless charger getting connected and disconnected every 15 seconds, makes the phone hot and not charging. Can be check it at any time. The dealer replaced the wireless charger already and still with the same problem, phones tested: iPhone pro max, Samsung s21 ultra, Google pixel. The dealer can't find a solution, it is thousands of people with not only Ridgeline 2021 but Pilots, Accord,  Civic and Odyssey. They know the problem but still selling the vehicles like that.",
        "vin": "5fpyk3f8xmb"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/08/2021",
        "dateOfIncident": "09/07/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11432142,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "While trying to feel for the composite bed release button underneath the tailgate with the tailgate closed, the sharp composite bed of the truck lid sliced my finger open. The manufacture should have at least chamfered the edge of the trunk lid or installed a guard or trim piece that would prevent contact with the razor-sharp fiberglass-reinforced plastic material.",
        "vin": "5FPYK3F74MB"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/04/2021",
        "dateOfIncident": "08/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427774,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "- Auto-high beam is too sensitive.  It switches high beams off with reflections off of road signs and then turns back on.   - Cannot count on advertised functionality. Can switch off when needed based on its extreme sensitivity.  Can cause road rage from constantly changing from high - low - high. - Not yet confirmed with dealer or others.  However multiple internet comments on this issue. - Believed issue is not from failure but from a design or setting defect.",
        "vin": "5fpyk3f74mb"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "06/24/2021",
        "dateOfIncident": "06/23/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422075,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle veering constantly while Lane Keeping Assistance is engaged causing persistent swerving and inviding adjacent lanes as well as requiring additional distraction while system is engaged. Adaptive Cruise Control erratically and some times violently applies  brakes, causing the following vehicles to constantly apply their brakes to avoid rear collision with the Ridgeline.",
        "vin": "5FPYK3F82MB"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/16/2021",
        "dateOfIncident": "06/16/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421121,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "When the vehicle is in drive, stopped on a steep hill, and allowed to slip backward the software puts the transmission in neutral  and shuts of the engine off. This leaves the vehicle coasting backwards with very little steering or brakes. This happened to me and I coasted backward across a street before I could get it stopped. If a car had been coming it would have hit me sideways. I can reproduce this in drive forward or in reverse, and I reproduced this in a second 2021 Ridge Line truck. There is no warning or message.",
        "vin": "5FPYK3F77MB"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/16/2021",
        "dateOfIncident": "06/12/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421198,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "When vehicle is in drive, stopped on a steep hill, and allowed to slip backward the software puts the transmission in neutral  and shuts of the engine off. This leaves the vehicle coasting backwards with very little steering or brakes. This happened to me and I coasted backward across a street. If a car had been coming it would have hit me sideways. I can reproduce this in drive forward or in reverse, and I reproduced this in a second 2021 Ridge Line truck. There is no warning or message.",
        "vin": "5FPYK3F74MB"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "05/25/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418436,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I have a 2021 Honda Ridgeline Sport equipped with CMBS an automatic braking system that is supposed to be a safety feature, but actually makes the car more dangerous.   The problem with the Ridgeline Sport collision mitigation braking system is that it attempts to mitigate crashes when the system thinks an obstacle is ahead, but it is a false warning, and there are no actual obstacles.   It appears there is a software or sensor defect in the Honda Sensing technology causing the vehicle to issue warnings and alerts to the driver and the potential to automatically hit the brakes without warning when there are no obstacles in front of the vehicle and it has not deviated from its lane.  Service Advisor/Mechanic at dealership called it a computer glitch. Nothing they can do. Taking it back again to have it on record; dealership tried to fix vehicle. This vehicle is potentially dangerous with no way to correct concern at this time. Problem continues since March 2021.",
        "vin": "5FPYK3F17MB"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/03/2021",
        "dateOfIncident": "04/18/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414897,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC HIGH-BEAM SYSTEM ON 2021 MODELS FUNCTIONS ERRATICALLY, SOMETIMES COMING ON WHEN CARS ARE APPROACHING. ALSO TURNS ON AND OFF CONSTANTLY FROM REFLECTIONS ON ROAD SIGNS AND EVEN MILE MARKERS",
        "vin": "5FPYK3F73MB"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/08/2021",
        "dateOfIncident": "03/31/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407040,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT NIGHT EVEN WITH NO TRAFFIC AHEAD, THE AUTOMATIC HIGH BEAMS RARELY TURN ON. WHEN THEY DO, THEY TURN OFF ALMOST IMMEDIATELY DUE TO REFLECTIONS FROM ROAD SIGNS AND EVEN SMALL ROAD MARKERS. OCCASIONALLY, THEY'LL FAIL TO DIM IN A TIMELY FASHION OR WILL FLASH CAUSING OTHER DRIVERS TO THINK I'M DOING THIS ON PURPOSE. OTHER OWNERS OF 2020 AND 2021 HONDA RIDGELINES ARE REPORTING THE SAME USELESS AND UNSAFE OPERATION. I OWNED 2017 AND 2019 HONDA RIDGELINES WITH AUTOMATIC HIGH BEAMS AND THE FEATURE WORKED REASONABLY WELL. FROM 2017-2019, HONDA USED A DEDICATED CAMERA FOR THE AUTOMATIC HIGH BEAM FUNCTION. FOR THE 2020 MODEL YEAR, HONDA ELIMINATED THIS CAMERA AND MERGED THE AUTOMATIC HIGH BEAM FUNCTIONALITY INTO THE \"MULTI-PURPOSE CAMERA UNIT\" THAT IS ALSO USED FOR OTHER FUNCTIONS SUCH AS THE LANE KEEPING ASSIST SYSTEM FEATURE OF HONDA SENSING. IN SHORT, THE NEW AUTOMATIC HIGH BEAM SYSTEM IS NOT ONLY USELESS, BUT OFFENSIVE TO OTHER DRIVERS. I'M AFRAID THE FLASHING WILL INDUCE ROAD RAGE OR GAIN UNWANTED ATTENTION FROM LAW ENFORCEMENT OFFICERS. FOR NOW, I HAVE DISABLED THE AUTOMATIC HIGH BEAM SYSTEM. THE 2021 RIDGELINE'S HEADLIGHTS ARE ALREADY A STEP BACKWARDS ACCORDING TO IIHS TESTING (AND MY OWN OBSERVATIONS) AND I FEEL LIKE THE \"HIGH BEAM ASSIST' CREDIT THEY APPLY SHOULD BE REMOVED SINCE THIS FEATURE IS NEXT TO USELESS SINCE THE 2020 MODEL YEAR.",
        "vin": "5FPYK3F74MB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/05/2021",
        "dateOfIncident": "03/24/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406615,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVING AN ISSUE WITH MY BRAND NEW 2021 RIDGELINE. AUDIO WHEN I'M HOOKED UP WITH ANDROID AUTO OR WITH BLUETOOTH DOES THIS WEIRD VOLUME ADJUSTMENT THING WHEN STANDING STILL. I'VE RESET EVERYTHING DONE ALL THE TROUBLESHOOTING, EVEN TOOK IT TO DEALER WHO SAID OH IT'S NORMAL TO HAVE A [XXX] SOUNDING STEREO IN YOUR NEW $38K TRUCK... ODDLY ENOUGH MY BROTHER NEW 2021 CRV WITH THE SAME BASIC STEREO DOES NOT DO THIS. NOR DOES MY WIFE'S RAV4 2020 WHEN WE USE ANDROID AUTO,,,,  PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "5FPYK3F16MB"
    }
]