[
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/30/2022",
        "dateOfIncident": "03/27/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459037,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Red Turtle warning light appears and the vehicle slows down immediately to 5~8 mph. Happens without warning and apparent triggers. Occurred multiple times in last week on freeways, exiting parking lot and on side road.",
        "vin": "1C4JJXR62MW"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/11/2022",
        "dateOfIncident": "03/04/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456364,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I bought a brand new Jeep Wrangler Rubicon 4xe in July 2021.  Starting in December of 2021 and continuing to this day I will periodically get an error message that says \"Service Hybrid Electrical System\" and the car will either not start or shut off while it is in motion.  I have contacted Jeep Cares and have been elevated to their customer retention group to continue to try to solve this issue.  The dealer has been great at trying to fix the issue but they have admitted that they don't know what it is or how to fix it and are relying on the national Jeep engineers to help try to fix it.  Talking with the mechanics at the dealer they keep saying the national Jeep engineers are just guessing at this point on what the issue is and they don't know what the issue is either.   I am far from the only one that is having this issue.  If you search any Jeep forum you will find countless other owners with the same issue, https://www.4xeforums.com/search/37154/?q=service+hybrid+electrical+system The underlying issue with the Jeep 4xe's is a huge public safety issue.  This is due to the fact that the Jeep 4xe will randomly turn off while driving, such as driving down a highway going 60mph.",
        "vin": "1C4JJXR65MW"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/10/2022",
        "dateOfIncident": "12/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456063,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 Jeep Wrangler. The contact stated that while driving at various speeds, the front end of the vehicle would violently shake and vibrate while driving over bumps in the roadway. The vehicle was taken to the local dealer who replaced the front shock absorbers and rotated the tires however, the failure persisted. The cause of the failure was not yet repaired. The manufacturer was not yet notified of the failure. The failure mileage was 18,000.",
        "vin": "1C4HJXEN4MW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/07/2022",
        "dateOfIncident": "03/07/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455511,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "3/7 7:50 AM Jeep driving in electric mode and slowly pulling up to a stop light.  Jeep started beeping and threw an error about shutting down and immediately stopped on its own in traffic.  Turned Jeep off and on to continue driving.  3/5 approx 10:00 AM.  Jeep idling in parking lot for approximately 20 minutes in e-save battery charge mode.  Jeep turned off with a charge fault error.",
        "vin": "1C4JJXR69MW"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/07/2022",
        "dateOfIncident": "03/07/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455585,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "My windshield has cracked 2 separate times. I got it fixed by safelife after the first, the second just happened today. Both times I never heard anything hit the window and the crack just appeared. I had a jeep wrangler before this one and never had any issues with the windshield. This one is brand new and has been on the road since Nov 2021 and now has 2 issues. It leads me to believe it is a manufacturing issue. I work from home and don’t drive very often, when I do it’s highway. I just can’t believe that it has cracked twice.",
        "vin": "1C4HJXDG0MW"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/01/2022",
        "dateOfIncident": "02/28/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454769,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving my car last night and it it just stopped on the 15 fwy, while everyone was driving 70 MPH. This car will kill me or kill others!!!! It’s unsafe!!!",
        "vin": "1C4JJXP68MW"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/24/2022",
        "dateOfIncident": "07/30/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453939,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH WARNING “SERVICE AXLE LOCKER SYSTEM” . I HAVE NEVER USED MY AXLE LOCKERS ONCE, NOR BEEN OFF ROAD WITH MY JEEP & THE DIFFERENTIAL TRIED TO LOCK ITSELF. THIS IS DANGEROUS. IF DIFFERENTIAL LOCKS COULD CAUSE FATALITIES.  YES, HAVE TAKEN MY JEEP TO THE DEALERSHIP 3 TIMES, IT IS CURRENTLY UNDER INVESTIGATION, HAVE HAD THE REAR DIFF REPLACED ONCE, THE REASON: DIFF OIL SLOWLY WORKS ITS WAY INSIDE THE SENSOR OVER TIME AND SINCE DIFF OIL HAS METALLIC FLAKES IN IT FROM THE BEARINGS/GEARS IT WILL CAUSE THE CIRCUIT BOARD IN THE LOCKER SENSOR TO SHORT OUT. ONCE THAT HAPPENS THE ONLY FIX IS A NEW AXLE. YOU CANNOT BUY THE SENSOR SEPARATELY.  NOT ISOLATED SITUATION. MANY WRANGLER OWNERS FROM 2018 TO 2021 POSTING THIS UP. ACCORDING TO JL WRANGLER FORUM, FCA DOES NOT HAVE A FIX YET. THIS SHOULD NOT BE HAPPENING ON A $65K VEHICLE IN FIRST 90 DAYS! SEVERAL OWNERS ON 3RD AND 4TH AXLE REPLACEMENTS. THERE ARE 30 PAGES OF COMPLAINTS ON THIS. DECIDED TO REPORT THIS AS IT APPEARS FROM THE FORUM FCA DOES NOT HAVE A FIX THIS IS APPEARING ON SEVERAL JEEP WRANGLER RUBICON'S,",
        "vin": "1C4JJXFM8MW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/23/2022",
        "dateOfIncident": "02/19/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453571,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 Jeep Wrangler. The contact stated while driving 65 MPH, the steering wheel began to forcefully shake and the contact lost control of the vehicle. The contact stated no warning light was illuminated. The contact was able to park on the side of the road and turn off the vehicle. The contact stated she was able to restart the vehicle and drive to her destination. The contact took the vehicle to the local dealer, where it was diagnosed with needing the steering damper to be replaced. The vehicle was not repaired. The manufacturer had been informed of the failure. The failure mileage was 17,100.",
        "vin": "1C4HJXEN7MW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/17/2022",
        "dateOfIncident": "02/14/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452534,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "There is an option to engage \"Full Regen Mode\" to recharge the battery while driving in Hybrid mode. As I was driving with this on, i took my foot off the accelerator, so the vehicle slowed down under \"Full Regen Mode\" as it is supposed to. But then the front tires went over a pothole/break in the road, and the vehicle sped up instantly. This happened two more times, and in both instances the vehicle sped up on its own when it encountered a break in the road while on \"Full Regen Mode\" with my foot off of the accelerator. The third time was in a parking lot of a strip mall, where I would have crashed into the car in front of me if my foot was not already hovering over the brake pedal. The Advance Collision Warning system also went off, scaring everyone nearby, and I managed to brake hard. Now I have stopped using the \"Full Regen Mode\" option while driving in Hybrid mode.",
        "vin": "1C4JJXR67MW"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/16/2022",
        "dateOfIncident": "02/15/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452216,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Could not start my 2021 jeep only 900 miles on it and said charging fault and then started an hour later but then later on that day  Was driving with my child and dead stop in middle of turnpike just shut off. Thank god it turned he Ck on and made it home.  Now dealership is saying they can look at it within two to four weeks.  This is a terrible.",
        "vin": "1C4JJXP67MW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/14/2022",
        "dateOfIncident": "02/14/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451877,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "2021 JEEP WRANGLER. CONSUMER WRITES IN REGARDS TO THE \"JEEP WOBBLE'\"  THE CONSUMER STATED VEHICLE EXPERIENCED A SEVERE WOBBLE. THE CONSUMER STATED THE DEALER COULD NOT DUPLICATE THE ISSUE; THEREFORE, ARE UNABLE TO REPAIR THE VEHICLE. ANOTHER DEALERSHIP STATED THEY WOULD REPLACE THE DAMPNER, AT THE OWNER'S EXPENSE, IN AN EFFORT TO RESOLVE THE ISSUE.",
        "vin": "1C4HJXEN1MW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/14/2022",
        "dateOfIncident": "02/14/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451989,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "2021 EJEEP WRANGLER. CONSUMER WRITES IN REGARDS TO ENGINE ISSUES.  THE CONSUMER STATED THE ENGINE WARNING LIGHT ILLUMINATED. THE VEHICLE WOULD NO LONGER OPERATE USING ELECTRICITY. THE DEALERSHIP MADE SOME REPAIRS AND UPGRADES. THE VEHICLE BEGAN TO OCCASIONLY OPERATE WITH ELECTRICITY. THE ELECTRICITY WILL NOT OPERATE IF THE CLIMATE CONTROL WAS ON, AND WHEN IT IS COLD OUTSIDE.",
        "vin": "1C4JJXP66MW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/10/2022",
        "dateOfIncident": "02/10/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451458,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Steering has play in the wheel. Dealer says it’s a normal thing in the Jeep. At high speeds on the freeway you can move the wheel back and forth about 3-4 inches. The 2021 already has the steel steering box as opposed to the aluminum.",
        "vin": "1C4JJXFM0MW"
    },
    {
        "components": "STEERING,SUSPENSION,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/07/2022",
        "dateOfIncident": "02/04/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450838,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "It has a Death Wobble, it’s back in the shop this week, was in the shop last week as well. Same problem, no fix.Shakes Violently while I’m on the Expressway with small children surrounded by 18 Wheelers on I-75.Very, Very Scary, I can’t control the vehicle at all.Chrysler knows that they have a defective Jeep.No warning, it just appears out of nowhere. I can’t live like this. I’m on automatic payment, this is not fair to me as a Consumer. Please help me. Happened in: October 2021,November 2021,December 2021, January 27,2022,February 4,2022.",
        "vin": "1C4HJXDN3MW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/04/2022",
        "dateOfIncident": "01/26/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450400,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "After having possession of our Jeep Wrangler 4XE for less than 6 months we have had to bring it in for engine issues twice - on our second visit we were informed that it was likely unsafe to drive as they could not guarantee it would not stall out while being driven. After much research it was found that there has been litigation for this same issue in at least one other state with multiple plaintiffs where FCA settled and paid out a large sum to consumers. I no longer feel safe driving this vehicle as multiple repairs have been necessary so far and there seems to be no guarantee that it will not happen in the future. A car stalling (this has been reported at as high as 70 miles per hour) during operation is a safety concern for myself and of all others driving on the road. We were informed that this could happen anytime after the check engine light illuminates, or as it turns on in many cases. The fact that there has not been a large scale recall, and that we were not informed of the issue when obtaining the vehicle is a huge safety hazard.",
        "vin": "1C4JJXP64MW"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/03/2022",
        "dateOfIncident": "01/25/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450173,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I have a severe shake in front steering ,over bumps or driving over bridge entrances. This occurs at highway speeds approx. 65-70 mph when temperatures are 30 deg. F and below, so bad you have to brake heavy and pull off road to get it to stop shaking and it is dangerous when traffic is heavy trying to get off road. I have had it to dealer they can’t verify concern, contacted Jeep last week still no response back. This is a on going concern with owners online since 2012 it needs to be addressed and repaired.  In fact some type of recall for this concern should be addressed as these vehicles are unsafe under these conditions. This vehicle has no modifications it is as purchased .Only has 8600 miles and afraid to drive on highway. Any help with this concern would be greatly appreciated. Thank You [XXX]  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "1C4HJXDM9MW"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/31/2022",
        "dateOfIncident": "01/29/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449497,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Yesterday, for the second time, the car shutdown while I was driving. I was on the road, close to 60 mph and the car turned the engines off. It shut down and the \"D\" light on the gear shift was blinking. I had to quickly try to get to the right lane, without any engine. After 3 tentatives, when I turned it back on, the engine light was on.",
        "vin": "1C4JJXP61MW"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/31/2022",
        "dateOfIncident": "12/14/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449539,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Backup camera will periodically go black on screen when putting the vehicle into reverse. It had been replaced once under warranty after a certified dealer found it to be “defective” upon inspection. Problem persists even after replacement.",
        "vin": "1C4JJXR65MW"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/21/2022",
        "dateOfIncident": "01/21/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448371,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I have no technical no-how with cars so I will describe as best I can.  We have a brand new 2021 Jeep Wrangler 4xe--bought it one month ago--and two weeks in, while driving, the check engine light came on.  We were out of town so called the local dealer but they could not see us for three weeks.  So we researched the issue and thought it could be a loose gas cap etc.  We did some trouble shooting but nothing changed.  Then, while driving, the entire dash lit up with various warnings, including the hybrid warning, and it just shut down.  We were next to a parking lot and coasted in.  Through a series of actions we were able to get it driving again and made it to another dealership.  When we arrived all signals were gone and they could find no trouble codes to check.  We were able to drive back home and we thought maybe it was the loose gas cap issue.  We would have taken it into the dealership as a precaution, but service appts are weeks out.  And it drove fine for several days.   Then our daughter was driving it on an extremely busy and dangerous road.  Luckily she'd just turned off it into our neighborhood--but she was still driving at a decent speed--and all of a sudden all the warning lights came on again, including the hybrid signal, and the car completely shut down on her.  Stopped mid-drive and mid-road.  We now have had it towed to the dealership.  We have also read all the similar stories now with Jeep 4xes and have serious concerns about the extent of this issue and thus the safety of the vehicle.  The dealership can't look at it for weeks, but we have already contacted sales to see what they can do.  I feel like it could take months to work out what is happening here--especially with service backups--and I do not feel safe with any of our family members doing a back and forth on this until we find out that a serious recall in underway.",
        "vin": "1C4JJXR65MW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/21/2022",
        "dateOfIncident": "10/19/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448316,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Over the past few months there has been a violent shimmy in the front end when traveling over 65 mph. It occurs when turning or going over bumps at highway speeds. I have demonstrated the local dealer. They have made several attempts to fix the issue without success. They have adjusted the tires, alignment and replaced the front stabilizer as well as checked other front end components. At this point they have washed their hands of the issue. Suggesting that I contact the dealer I bought it from. I wanted to create an official complaint here.",
        "vin": "1C4JJXP62MW"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/20/2022",
        "dateOfIncident": "09/15/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448179,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Sun visor mount breaks. This is a known issue... several folks are complaining about it and the replacement part has been back ordered for months. In my case this vehicle is just over a year old.   https://www.jeepgladiatorforum.com/forum/threads/sun-visor-broken-500.33448/  1) The visor can't be used to block sunlight in the drivers face. 2) The visor can fall in the drivers face obstucting the driver view while driving",
        "vin": "1C4HJXFN9MW"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/19/2022",
        "dateOfIncident": "01/16/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448108,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I almost had a car accident because my car shacked uncontrollably which is dangerous!!! I had my children in the car, the shaking started last year, my car is still new and shouldn’t be having these problems!!!!",
        "vin": "1c4hjxdg3mw"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/19/2022",
        "dateOfIncident": "01/16/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448110,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "JL Wrangler equipped with LED headlight and fog light. When drive in snowstorm, snow quickly cover up headlight and fog light due to not enough heat generated from headlight fog light. Once snow covers headlight and fog light completely, the visibility reduced to couple feet at most. Make it extremely dangerous.",
        "vin": "1C4JJXFM6MW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/18/2022",
        "dateOfIncident": "01/07/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447836,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Steering wanders. Vehicle will wobble at high speeds. Vehicle pulls to the right when you release the wheel. Vehicle requires constant steering input, these inputs are unpredictable. Dealership refuses to work on the vehicle “that’s just how these handle”. This issue has existed from the date of pick up, and been to the dealership twice.",
        "vin": "1c4jjxfg0mw"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/18/2022",
        "dateOfIncident": "01/18/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447952,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "On multiple occasions while driving on the highway the vehicle starts shaking resulting in lost of steering.  This is similar to issue described on the internet as \"death wobble\".  Slowing down to 45 mph results in vehicle stopping to shake and control is regained.",
        "vin": "1C4JJXP60MW"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/16/2022",
        "dateOfIncident": "01/16/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447697,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The front defrosters are terrible they only defrost the center part of windshield. Ice builds up making it impossible to see anything.  This is a serious problem to all drivers and pedestrians.",
        "vin": "1c4hjxdg4mw"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/07/2022",
        "dateOfIncident": "12/31/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446634,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Issue Death Wobble - Traveling at highway speed of 75 MPG hit a transition between roadway and bridge causing the steering wheel to violently shack left to right. Had to slow down to 45 MPH before it to stop. Hit next transition and issue repeated.   Called and setup an appointment at the dealership to inspect, as vehicle only has 13,008 miles. Stock vehicle no modifications made to it. Dealership inspected and is replacing the steering damper (Steering stabilizer) as the source of the issue. Apparently known was an issue by the manufacture, according to the dealership.   No warning of symptoms prior to failure.  This issue puts the occupants in potential risk of injury or death. If loss of control of vehicle occurs and the vehicle crashes or rolls. Fortunately I was able to safely slow down and the issue stopped without incident.",
        "vin": "1C4HJXEGXMW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/05/2022",
        "dateOfIncident": "01/03/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446281,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Seeing indicator for Service Charging System. Cars will stop in the middle of the road when this happens.",
        "vin": "1C4JJXP66MW"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/04/2022",
        "dateOfIncident": "12/29/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446099,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving a vehicle swerved into my lane, to avoid hitting them I tapped my brakes, upon tapping my breaks the Jeep lost propulsion and it felt as though my brakes lost power as well. I had to coast into a parking lot where I didn’t even make it to a spot and had to be towed to the dealer. The Jeep would no longer start and gave a “service charging system” message.   Upon inspection the dealer stated that Chrysler immediately shipped a power inverter module (pim) upon my Jeep being entered into the system.   Since my issue, I have seen 3 other 4XE Jeeps pulled over and broken down in precarious positions.   This is what prompted me to file this report, as I believe this may be an issue related to other 4XE Jeeps and if this is the case, it is only a matter of time before an accident that causes loss of life because of how severe and sudden the issue is.   Thanks for looking out for our well being and everything y’all do at the NHTSA.",
        "vin": "1C4JJXP66MW"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/02/2022",
        "dateOfIncident": "01/02/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445875,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I have experienced the famous Jeep Death Wobble in the past with my 2015 Jeep Wrangler Sport...same model as now, so I knew what I was experiencing. Over 2 days I was driving the highways (real estate agent) and 6 times when I hit a bump in the road the front end starting shaking and I began to lose control of it. I knew from before that putting on the brakes quickly will help to stop it, but hard to do going 65-70mph down the highway. Fortunately it was a holiday weekend and not many people on the road. It responded fairly quickly when I braked quickly most of the times, but the last time, it didn't respond quickly and I had a car fairly close behind me so I couldn't stop harder. It took a couple of seconds to get it under control. I feel lucky I didn't cause an accident or be in one.",
        "vin": "1C4GJXAG3MW"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/31/2021",
        "dateOfIncident": "12/31/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445764,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "There have been absolutely no modifications to my 21 Jeep Wrangler JL sport it has never been off road it has the stock tires at the proper tire pressures and I experienced it unbearable wobble at high speeds when I hit a bump AKA death wobble I cannot believe that jeep is still not addressed this problem, it has been ongoing for years with the Jeep lineup and not been addressed this is my first Jeep Wrangler and my first dealing with the death wobble",
        "vin": "1c4hjxagxmw"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/26/2021",
        "dateOfIncident": "12/23/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444963,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving on highway at posted speed of 70 mph in state of Michigan and jeep quit running I had 3/4 tank of fuel and 37% battery power remaining got it restarted made it to a gas station shut off jeep filled with gas and jeep wouldn’t come back online said charging port malfunction so I open charge door and didn’t see any thing in the removed negative side of 12 volt battery underneath the hood waited for 3 mins reinstalled battery terminal and was able to get it started but the temp controls only work on extreme hot or extreme cold no in between drove back home approximately 150 with check engine light on after several power down and restart the check engine light went away and all went back to normal again",
        "vin": "1c4jjxp6xmw"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/21/2021",
        "dateOfIncident": "12/14/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444526,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle lost power while driving at highway speed, rapidly decelerating from 70 MPH to <20 MPH. Ignition was turned off after pulling off the highway. When vehicle restarted, alarms cleared and system temporarily operated normally. Problem returned shortly thereafter, but this time did so while accelerating across a street. This condition could have jeopardized safety of self or others by eliminating ability to maneuver/stranding vehicle in roadway.  This incident was reported to dealership, who then inspected/investigated. Source is thought to be a faulty fuel pressure sensor.  Warning lamps that accompanied this condition were: Check Engine, Sway Bar Link disconnected, and check 4-wheel drive.  The check engine light appeared and reset approximately 60 miles prior, and no other symptoms were noted.",
        "vin": "1C4HJXFG2MW"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/21/2021",
        "dateOfIncident": "12/21/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444528,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Jeep wrangler Sahara 2021 4xe is brand new leased and driven off the lot the previous day with 35 miles on the car and one full charge overnight. Car was going down a hill with  Max  Regeneration engaged. It lost power and said place in Park. It states service charging system and there is an engine fault and the car will not start will not go into neutral to move to a safe location and it stuck in the center of a busy road placing myself the driver at extreme risk.",
        "vin": "1c4jjxp63mw"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/18/2021",
        "dateOfIncident": "12/17/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444223,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "As I was driving my vehicle, the dashboard displayed 2 warning signs that stated “service shifter” and “service shifter stop safely shut off engine to engage park”. This put my safety at risk because the vehicle hesitated even when attempting to pull over and shift the vehicle into park.  While driving, the vehicle’s transmission had jerking movements that made it difficult to complete this task. The problem has not be confirmed by the auto maker. The vehicle has not been inspected. There were no warning lamps or messages to my Uconnect app about the status of the vehicle prior to the incident. Symptoms include delays in accelerating and the vehicle struggling to switch between gears. These problems first appeared approximately 1 month ago.",
        "vin": "1C4JJXP62MW"
    },
    {
        "components": "STEERING,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/10/2021",
        "dateOfIncident": "12/09/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443316,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving approximately 35 miles an hour while on E save with max regeneration enabled, the car cut all power, RPM went to zero, service charging system error displayed on dash. Once able to get car off of Road, was able to restart. The Uconnect app does show a charging system fault, once plugged in charging system does charge, per dealer new error codes report to substantiate failure of power.",
        "vin": "1C4JJXP67MW"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/09/2021",
        "dateOfIncident": "05/23/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443294,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle was purchased on 5/22/2021 from dealer as new vehicle purchases (lease).  On 5/23 less than 24 hours after delivery with 76 miles on the ODO, I got a (CEL) and numerous errors (service hybrid electrical vehicle system, service 4wheel drive system, vehicle charge fault with a red charge cord light indicator). Vehicle was returned to dealer on Monday morning with notice of issues.  They diagnosed the vehicle for 1 day and returned it to me to continue to drive while they ordered parts.  Vehicle was diagnosed with a P0AA6-00 “Hybrid Battery Voltage System Isolation Fault.”   Dealer stated vehicle was safe to drive and would contact when parts were received.  On 6/08 vehicle was returned  to service for incoming parts at 575 miles.  Dealer stated FCA advised them to replace the Indicator lamp module but did not correct the issue and they could not return the vehicle to me as they stated \"FCA said vehicle can not be placed back on road as it may catch fire or explode\".    Vehicle has been at the dealer with no return since 6/8/2021.  They have changed 1 indicator lamp module, 2 battery heater/chiller modules, 3 PHEV main wire harnesses and have requested a 4th as they have not been able to make the previous 3 work/function.  Vehicle has now been down 7months with now successful repair and parts not available until 1/02/2022 at the earliest.  And vehicle now sits with 17 unresolved trouble codes.",
        "vin": "1C4JJXP65MW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/05/2021",
        "dateOfIncident": "11/23/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442753,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "My Jeep, with less than 12,000 miles on it, had a catastrophic failure of the clutch pressure plate, which blew the clutch and tore a hole through the top of the bell housing, cutting the electrical wiring and coolant line.  Car towed to dealer I originally purchased the Jeep from.  My Jeep VIN was not included in the safety recall notice issued in February 2021, however, my Jeep's software was updated on the first service appointment in March 2021.  This software update did not prevent the pressure plate from malfunctioning.  The dealer is claiming this is a clutch failure due to driver error and is not acknowledging the other damage done to the engine and refuses to make good on their product failure.",
        "vin": "1C4HJXEG2MW"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/03/2021",
        "dateOfIncident": "11/13/2021",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442560,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "My 2021 Jeep Wrangler with 1900 miles caught on fire and was a total loss, preliminary investigation believes the cause of the fire to be a gas leak.  There were no indications or warning lights, saw black smoke coming from the engine compartment by the time I pulled over and got out of the vehicle it was on fire and within minutes the entire car was engulfed by flames and it was a total loss",
        "vin": "1c4hjxeg4mw"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/01/2021",
        "dateOfIncident": "11/03/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442210,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 Jeep Wrangler. The contact stated while driving 65 MPH, the vehicle experienced the death wobble. The contact stated no warning light was illuminated. The contact stated that he had experienced the failure several times per day. The contact took the vehicle to the local dealer, where it was diagnosed with needing a road force balance & alignment. The vehicle was repaired but continued to experience the failure. The manufacturer had been informed of the failure. The failure mileage was approximately 23,000.",
        "vin": "1C4HJXDG8MW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/01/2021",
        "dateOfIncident": "11/29/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442278,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I was running an errand. The jeep has been charging the whole night before so it had a full charge. After the hour long errand, I got back to the jeep and tried starting it up. On the dash, the check engine light, the wrench with a lightning bolt was on. On the dash, it’s says the “Service charging system” and “service Hybrid Electrical  vehicle system” needs to be service. A little while later of trying to start up, the tow truck happened to start it up by pressing on the gas pedal after turning it on. It’s been in the shop for a week now.",
        "vin": "1c4jjxr66mw"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/17/2021",
        "dateOfIncident": "09/10/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440773,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "After 5 months and 5000 miles of use, the vehicle died hard while driving on the highway with \"charging system error\" and had to dangerously navigate to the shoulder.  The vehicle was so broken not even the power locks would work.  The dealer replaced the Power Distribution Unit (fuse box), but the part was the same, so they suspect it was an assembly issue.  If you look at online forums, _dozens_ of people are having the same problem with this vehicle.  What is even more concerning is that almost every person had a different fix - and many are having this as a repeat problem, with multiple people invoking the lemon law and having Jeep buy the vehicle back.    This is very dangerous and broad issue.  A recall is needed to protect the public.  https://www.4xeforums.com/forums/2021-jeep-wrangler-4xe-general-discussion-forum.8/ https://www.jlwranglerforums.com/forum/threads/4xe-shut-down-on-highway-with-charge-error-think-i-know-what-causes-it-now.76544",
        "vin": "1C4JJXR65MW"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "11/17/2021",
        "dateOfIncident": "07/27/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440822,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving down the highway when the engine on my Wrangler 4xe suddenly shut off forcing me to cut off traffic to get to the shoulder. Numerous error messages were displaying but I did not have time to see them all. Final message I could see was \"Charging System Error\".  After turning the Jeep off then back one the problem cleared.  I suspect this was caused by the Adaptive Cruise Control system.  It had started to brake hard for a car not actually in my lane.  At the same moment people were pulling in behind me to move over for a police car on the shoulder. The Adaptive Cruise Control started what was a hard brake check on this traffic, so I overrode it by pressing on the accelerator, at which point it died.   At the dealer they determined from the codes that the transmission control unit had shut off the engine control unit.  Otherwise nothing could be determined as being wrong with the vehicle.  Seeing all the other complaints of similar incidents involving Wranglers I think there is bad software code in the vehicle's control systems.",
        "vin": "1C4JJXP60MW"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/16/2021",
        "dateOfIncident": "11/16/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440713,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving normally along a busy road at 40mph. Suddenly, the car stalled and I could not accelerate. I coasted until it completely stopped in the middle of a busy road. I was unable to move the car, and instead had to put the car in park and turn off the engine. The \"D\" light on the gear shifter was blinking, and then the battery on the car went from 55% charge down to 47% charge. A red lightning bolt emergency sign came on but then went off immediately after. With the car off in the middle of the road, I restarted it hoping for the best. Luckily, it did restart fine and I could continue driving. However, I have heard on Jeep 4xe forums that this is an issue with many other owners, some even happening on the interstates. I am now too afraid to drive this car with my child or for long distances, because this issue was completely spontaneous and unpredictable. I took it to the dealer to be serviced, but they are unsure what is going on. And as a side note, this is a brand new car (2021 year) with 105 miles. I only had it for FIVE days before this happened. Prior to this incident I also noticed that the charge would not hold very long at all - for example, driving it today 3.4 miles from one point to the dealer, the charge went from 47% to 17% - this should not be normal. Overall this issue is unacceptable and this needs to be addressed immediately before people die. Thanks for your consideration.",
        "vin": "1C4JJXP63MW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/16/2021",
        "dateOfIncident": "07/27/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440694,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Excessive steering wheel play resulting in poor control and wandering while driving.  Requires constant corrections to keep vehicle in the lane.  Very dangerous at interstate speeds especially when passing other vehicles.  I have returned to the dealer and they have no correction for this issue.  I see there are many complaints on the internet about this same problem on 2021 Jeep Wranglers.  Driving at higher speeds is dangerous!!",
        "vin": "1C4HJXCG0MW"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/14/2021",
        "dateOfIncident": "11/11/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440382,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving and needed to use the driver side sun visor. As I took it off of the fixed mount, the swivel mount dropped out of the \"socket\". I pushed it back in and kept driving only for it to fall out again further on my trip. Now, a few days later, the visor will not stay in place and keeps dropping randomly as I drive. This issue is well documented on Wrangler owner forums and creates a safety hazard as visibility is impaired. My concern is that these can randomly drop and obscure vision due to the windshield being shorter than normal (Jeep design).",
        "vin": "1C4HJXEG5MW"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/11/2021",
        "dateOfIncident": "10/22/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440118,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I left my daughters house with my jeep wrangler and as I shifted into forward gear there was no power on my wrangler 4XE hybrid. I move the vehicle to the side of the road and towed it to the dealers. After a little over two weeks they got it repaired. After that I have read reports of this kind of thing happening in traffic. When I lost power the engine light and stability control light came on. It is now repaired but I’m having second thoughts about the safety of the vehicle since I sometimes transport my grandchildren in the vehicle.",
        "vin": "1c4jjxp67mw"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/02/2021",
        "dateOfIncident": "10/25/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439002,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Description: - Recurring on multiple occasions - Multiple lights on the dash come on. They may flash or persist - i.e. engine light, turtle light, crash avoidance light, among others. - The vehicle loses power (it’s a hybrid). This includes the motor and the engine. - The steering is compromised. You cannot steer the vehicle very well during this loss of power. - The vehicle usually will not restart and must be towed in or, in some cases, the battery can be disconnected causing the vehicle to reset and allowing it to begin operating again. This solution can work for a several power cycles or none at all. - When this happens, and you attempt to restart the vehicle sometimes when the power returns you are unable to tell if the vehicle is in neutral, drive, reverse, park, etc.  - I experienced a case where the vehicle was in the Run position and the power windows would not open. When it was in the Off position, the windows would open. Perhaps this is intended behavior.  - The seatbelt light will stay on even though all passengers in the vehicle are buckled in. It is unclear if this is part of the same issue, but it seems to be. - Systems compromised: Steering, braking, power/engine, seatbelts, etc.  Examples of Incidents: - Driving in neighborhood (Safe Location) - Driving at highway speed (Unsafe Occurrence) - Driving on an off-road trail (thankfully with others) (Unsafe Occurrence) - Driving at highway speed - We almost crashed twice trying to get off the hwy. (Unsafe Occurrence)  Compounding Safety Issues: - Roadside Assistance didn’t show up after ~7 hours waiting. - FCA’s utter confidence in the repair process is scary to me. - Confidence apparently based on recent software updates to the system, which was installed in a prior visit. The FCA rep wasn’t initially aware the vehicle was back in for service 2 days after installing the latest firmware. - Lack of ability to update software OTA (over the air).",
        "vin": "1C4JJXR68MW"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/02/2021",
        "dateOfIncident": "06/04/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439030,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The two main wire harnesses are faulty.  It would not charge or hold a charge.  Driving it was dangerous and would stop drastically at any given random moment. A jerking motion would occur while driving.  Lights on dash would come on, engine, charging fault station. Charging fault. And lightening bolt warning signs. Sometimes it would say don’t drive call for assistance.  The dealership has had my vehicle since June 4 2021.  The parts I’m told won’t be available until end of January 2022.  I purchased the jeep on April 30th 2021.  It’s very scary when you’re on the road, w my family and it decides to lock up or sounds like the transmission is falling from the under carriage.  Luckily we weren’t rear ended or pushed through an intersection.",
        "vin": "1c4jjxp68mw"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/01/2021",
        "dateOfIncident": "04/25/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438944,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Steering wonders at 55mph or higher. You have to continually correct to keep straight on Highway. I have reported it to Jeep the manufacturer and had it to the dealership and they did not find anything wrong and said that’s the way they drive. I have had three jeeps before this one and by far it’s the worst",
        "vin": "1c4hjxfg6mw"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/27/2021",
        "dateOfIncident": "10/26/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438309,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "When driving vehicle I’m having to over correct steering I can’t look away for .5 seconds to look in mirrors because car wanders side to side trying to stay in my lane is a nightmare it’s not safe at all",
        "vin": "1C4HJXEN4MW"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/26/2021",
        "dateOfIncident": "10/05/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438207,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Unknown. Car came to a sudden stop while driving and the lights beside the gear started flashing. A message on the dashboard popped up that said for me to put the car in park and then select my desired gear. Major safety concern for a car to just shut down for no reason while driving down the street. Luckily I was on a back road with little traffic. Afraid to drive the car on major highways or at higher rates of speed where this malfunction could cause a serious accident.",
        "vin": "1C4JJXR63MW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/25/2021",
        "dateOfIncident": "10/25/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438096,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Jeep constantly drifts and wanders.  We were told by the technician “that the steering gear is the updated one already. The tech said it drives straight for a minute then feels a little wander. We will not be able to make it better. unfortunately.  there is paperwork from the factory telling us not to replace the steering gear.”  This is a safety concern given that the steering is not reacting properly.",
        "vin": "1C4HJXDN7MW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/21/2021",
        "dateOfIncident": "10/02/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437635,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "While towing a <3000 lb. trailer up a long grade (2.5 to 3 miles) on the interstate at the posted speed, warning messages were displayed on the dashboard approximately 2/3 of the way up the hill.  “Service Electronic Throttle Control”, and Check Engine light displayed while the vehicle speed dropped dramatically from 70 mph to approximately 35.   This same error occurred every time I tried ascending a long grade with the trailer (under load).  Initially reduced speeds ( below the posted limit) did not change the outcome.  Trying to use the optional manual shifting, did not change the outcome.   Recreated initial problem following 1st dealership service for the events.",
        "vin": "1C4JJXFM1MW"
    },
    {
        "components": "ELECTRICAL SYSTEM,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "10/21/2021",
        "dateOfIncident": "10/18/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437703,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I purchased this vehicle new and over the past 12 months, the back-up camera and stereo has stopped working four times.  It usually fixes itself after a day or so, but this time it has been 3 days and it still will not work.",
        "vin": "1C4HJXFG3MW"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/20/2021",
        "dateOfIncident": "09/20/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437481,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Since we purchased this jeep new it has been plagued with steering wandering and pulls to left or right without warning.  It was dangerous to drive and unsafe for my family.  After some researched I learned there was a technical service bulletin (8-003-21) for the 2018-2020 JL and supposedly the 2021 had the upgraded steering gear and updated software for the electric power steering.  However this really didn't solved the problem and may owners have been complaining about the same unsafe wandering or pulling of the vehicle from left or right.  I have take it to the dealer and also called Chrysler direct, so they can open case number (80562177).  After 30 days at the dealer the outcome was to increase the tow to +.35 from Chrysler's recommended +.20. It is my understanding both +.35 and +.20 are within the manufacture's recommended specifications.  Normally isn't the toe supposed to be near or at zero (0).  It seems that setting the toe to +.35 is a band-aid.  While the wandering and pulling has decreased I fear this is short term solution and it may cause unseen premature failure of other components.",
        "vin": "1C4JJXFM3MW"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/15/2021",
        "dateOfIncident": "09/07/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436872,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Drivers-Side Sun Visor broke loose while driving, momentarily blocking vision and disrupting driving, while at hwy speeds.  New vehicle with < 10kms mileage at time of event.  Due to apparent design flaw, and high frequency of failures, replacement visors are back-ordered for months.    The Safety issue is that due to the tall windshield design of the vehicle, I am unable to block the sun up to 2 hrs after sunrise or 2 hrs before sunset, until new parts come in, some time in January 2022, per the dealership.  Appears to be a design issue originating with the introduction of the Wrangler JL model, back in 2018.  Refer to the following Wrangler on-line Forum for details:https://www.jlwranglerforums.com/forum/threads/sun-visor-fix.44865/",
        "vin": "1c4hjxdg6mw"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/14/2021",
        "dateOfIncident": "09/27/2021",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436759,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The engine caught on fire after a short drive. The fire burned the entire top of the rear of the engine and completely through the wiring harness before I could extinguish it with a fire extinguisher and water. The fire appears to have started at the top rear of the engine where the fuel line enters the intake. The manufacturer, Stellantis, hired a special investigator from EAA/Bosch to look at it, and he agrees that it is similar to fires in similar engines that were recalled in October 2020, NHTSA Campaign number 21V-665. Stellantis has not responded to repeated requests for resolution.",
        "vin": "1C4HJXCN3MW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/08/2021",
        "dateOfIncident": "08/07/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435984,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The Jeep wanders all over the road, the steering is not stable nor steady. This is a safety issue, nothing I have done has helped the problem.",
        "vin": "1c4hjxeg5mw"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/06/2021",
        "dateOfIncident": "10/06/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435781,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 Jeep Wrangler. The contact stated that while driving at  55 - 60 mph, the RPM gauge went high but the temperature gauge was normal. A burning odor was detected, metal grinding noises were heard, and the vehicle inadvertently lurched forward. The contact pulled over and saw that there was smoke coming from under the hood. The vehicle was towed to the dealer and remained at the dealer, not diagnosed nor repaired. The contact had the vehicle serviced at the dealer in March 2021, for NHTSA Campaign Number: 21V028000 (Power Train). However, the failure recurred related to the recall. The manufacturer was not made aware of the failure. The failure mileage was approximately 9,700.",
        "vin": "1C4GJXAG5MW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/04/2021",
        "dateOfIncident": "10/04/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435337,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "New vehicle brake failure. Dealer Replaced Master Cylinder defect. Pedal goes completely to floor occasionally no brakes. HCV now determined possibly bad. ABS system affected. Continuous occasional pedal goes to floor. Been reported and serviced by dealer at least 4 times. Problem continues sporadically.  Begin within 2 weeks of purchase. Vehicle should be replaced for safety issues.",
        "vin": "1C4HJXKN4MW"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/24/2021",
        "dateOfIncident": "09/23/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434254,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle locked up, no steering, no braking or control while traveling at 40mph nearly causing an accident.  Interface said Anti Theft Mode engaged, enter code.  This nearly caused a crash and the vehicle was immobilized and had to be towed to dealership.  Vehicle has less than 3000 miles on the odometer.  This presented a significant safety risk to driver, passengers and other motorists.",
        "vin": "1C4HJXDN5MW"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/23/2021",
        "dateOfIncident": "07/23/2021",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433994,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "2021 JEEP WRANGLER. CONSUMER WRITES IN REGARDS TO FUEL TANK ISSUE.   THE CONSUMER STATED WHILE DRIVING, THE VEHICLE BEGAN SMOKING AND WENT INTO LIMP MODE. THE VEHICLE WAS TAKEN TO THE DEALER WHO HADN'T DETERMINED THE CAUSE OF THE FAILURE AFTER 6 WEEKS. THE VEHICLE HAD 2,845 MILES.",
        "vin": "1C4HJXDM2MW"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/20/2021",
        "dateOfIncident": "09/16/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433716,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "On 9/16/21, my vehicle dangerously lost power, following a very loud sound and a violent shudder. Power for braking and steering was lost. The vehicle had no response to the accelerator pedal. I attempted to coast to the shoulder of the road, when the vehicle slammed into park on its own while still traveling at roughly 15mph. The wheels locked and the vehicle came to a violent stop by itself, likely not activating the brake lights. The cooling fans came on at full speed, climate control cancelled itself, and the vehicle locked in park. While using the built in emergency button, the vehicle telematics shut down and dropped the dispatcher. I completed the emergency service call using my phone. The vehicle was towed to the dealer, initial reports are that it is not drivable, the main hybrid battery pack fuses are blown. The prior night, the vehicle failed to charge using the Jeep EVSE cable.",
        "vin": "1C4JJXP62MW"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/16/2021",
        "dateOfIncident": "09/12/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433228,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "After driving to my destination with 47% battery on the 4xe and full tank of gas.  Turned the car to stop and got a service hybrid system malfunction.  Tried to start up the car but the car wouldn't start.  Had to get it towed to the dealership.  The service tech told me that there is a isolation fault in the 17kwH battery and the entire shut down due to safety concerns.",
        "vin": "1C4JJXR68MW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/10/2021",
        "dateOfIncident": "08/12/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432431,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "JEEP WRANGLER steering issues! Vehicle wanders right and left does not track straight, the faster you go the worse it gets. There is a constant correction to the steering! Very unsafe at freeway speeds! Dealer says this is normal for a Jeep!",
        "vin": "1C4HJXEG5MW"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/10/2021",
        "dateOfIncident": "08/20/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432472,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Charging Fault Error came on as my wife was driving home when her 2021 Jeep Wrangler 4XE suddenly shut off and came to a immediate halt. She was barely able to prevent a major accident, which could've caused serious injury to herself and others on the road. Vehicle would not restart and was not even able to put the vehicle in neutral to push out of harm's way. The moment it happened I received a message on my Jeep UConnect app that a Charging Fault Error occurred. I didn't know what this meant, but about 60 seconds later my wife called me in distress and told me what happened. She was terrified couldn't even drive the rest of the way home and had to stand in 100F heat for an hour waiting for a tow truck. Result: The Jeep Wrangler 4XE is still in the shop (it's been in the dealership for over 3 weeks now, and we've owned it for 3 months and 3500 miles. They have no diagnosis and say they are still ordering parts. Asked 2x to speak with upper management at FCA and was told someone would call in 24 hours, it' been over 72 hours now. Included file of Jeep case number and Jeep 4XE forum with multiple chats on this same issue.",
        "vin": "1C4JJXP63MW"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/03/2021",
        "dateOfIncident": "08/23/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431693,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "As I approached a stop sign while braking, the Jeep seized up, shut off, and gave the Electronic Stability Control warning. I attempted to restart and it didn’t start or get out of park. It then gave Blind Spot Monitoring System error and Service Charging System error. I’m grateful that I was at a stop sign unlike some of the other reports of this issue that were on the highway. It was quite a jolt when the vehicle seized. The vehicle has been at the dealership since 8/24. It was thought the hybrid battery needed replacement. A new one gave the same errors to the service team. The vehicle remains with the service department awaiting another battery.",
        "vin": "1C4JJXP65MW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/24/2021",
        "dateOfIncident": "06/28/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430330,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "My 2021 Wrangler steering wheel is loose feeling.  When sitting still the wheel has a couple inches of play in it.  When driving you are constantly having to turn the steering wheel back and forth to keep the car going straight.  When you are turning back and forth it is easy to over compensate and you can go out of your lane.  Very annoying.  Dealer inspected steering (all tight), alignment (set to end of spec) and said had the newest steering gear.  Finally, the dealer says they are all like that.  I bought my granddaughter a 2019 and it was horrible.  Jeep had a fix with the new cast steering gear and that fixed her 2019.  I drove it last night and the steering is much tighter than my 2021.",
        "vin": "1C4HJXDN6MW"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/18/2021",
        "dateOfIncident": "08/11/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429535,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle shut down in middle of road. All lights on dash came on and vehicle became disabled. It repeated it self two more times that week and i finally had it towed to dealer.",
        "vin": "1c4jjxr6xmw"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/18/2021",
        "dateOfIncident": "07/26/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429547,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Veh shuddered while driving. Warning light on dash for Hybrid system malfuction/red lighting bolt on dash. Veh taken to dealer 3 weeks ago. Needs new Power Inverter module. Wont drive. Part eta is 3 months out.",
        "vin": "1C4JJXR64MW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/18/2021",
        "dateOfIncident": "07/18/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429602,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Since new, (leased about a month ago), the steering on this 2021Jeep Wrangler JL-2door has been extremely loose. The vehicle wanders as you drive it, there is a play in the steering wheel and front axle, making it extremely difficult to keep straight on the road.  I have to constantly fight the wander with both hands tightly on the steering wheel to keep it from moving into other lanes. Took to the dealer and they said it’s all normal and “all Jeep’s drive that way”.  Well, not really.  My 2014 Jeep Wrangler JK-2 door handled perfectly on the road.   I feel very unsafe driving this vehicle at all times.  I’m not the only one complaining about this. Social media is full of similar complaints and some aftermarket companies have even come out with parts to fix this problem. However, the customer should not have to pay to correct a manufacturing problem.",
        "vin": "1C4GJXAN2MW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/16/2021",
        "dateOfIncident": "06/29/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429362,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The component that malfunctioned is the nuts of the ball joints, related to the steering component, upon inspection at the dealer is when they advised that the nuts that hold on to the ball joint had became loose  My safety and the safety of my family was put at risk as if this had become fully undone the vehicle would just not be controllable   Has the problem was confirmed by a dealer service center  The components have been inspected by the manufacturer  There was no warning lamps, messages or other symptoms of the problem prior to the failure, and it first appeared June 39th 2021",
        "vin": "1c4hjxfn0mw"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/13/2021",
        "dateOfIncident": "07/30/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429040,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The vehicle all of a sudden shut down and the charging system alert came on and said service charging system - this was while starting to merge off 131 north at the Saginaw exit. I coasted to the side of the road put it in park I attempted to start again and at first there was nothing  Then I did it again and it started I did not see the charging error but it went into my log. I drove home. When I got home I tried plugging it in and it blew every breaker I tried plugging into. Called dealership and there it sits. They have no idea.",
        "vin": "1C4JJXP67MW"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/13/2021",
        "dateOfIncident": "07/30/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429046,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving on 131 northbound just before the Saginaw croton exit my Jeep lost power I was in the left lane had to merge across to the right to exit and all the lights were on noting charging system needs service I got off highway onto ramp and coasted to side of ramp and realized it was not even on anymore. I immediately shut it off checked my uconnect app for a service warning and it said charging system failure all the lights on the dash were alerting me until it shut down I sat for a bit and tried to start it and it did but was jerky when attempting to drive. I switched to esave and the engine kicked in but was also doggy. I had 60% battery so I’m not sure what happened. I attempted to plug in when I got home and it blew breakers anywhere I attempted to plug it in and made a very loud pop! I didn’t try it anymore at home as it scared me. Contacted the dealer and two weeks later it’s at the shop. They have no idea what is going on - it’s acting up but now doesn’t even put the info into the log according to my service technician at the dealer. They are waiting on Chrysler engineers to get back to them with what to do.",
        "vin": "1C4JJXP67MW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/09/2021",
        "dateOfIncident": "08/08/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428380,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The car flashed a red icon and displayed a message saying power was lost and telling us to pull over safely and put the car on park. We were in the middle lane on the New Jersey Turnpike and people were driving around us at 80mph, and the car would not accelerate. We were able to pull over and restart the car and it worked as if nothing happened. I got an email on the UConnect system saying there was a charging issue, and then  a second email saying I should get the car serviced. I took it to the dealership this morning and am waiting on a diagnosis.",
        "vin": "1C4JJXP67MW"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/09/2021",
        "dateOfIncident": "08/09/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428459,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Engine began leaking diesel fuel and smoking from the fuel hitting hot components. Possible fire could have occurred. So much diesel that it coated the trailer I was towing.",
        "vin": "1C4JJXFM0MW"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/06/2021",
        "dateOfIncident": "08/02/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428018,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "On Monday the Wrangler began to have electrical problems, the sound system cut off and then the climate control quit working.  The car was running rough, jerky like an acceleration problem.  By Tuesday afternoon it would not start right off.  When I got it to start the same problems happened with the radio, climate control, and the screen cut off.  I tried to put the car in reverse but the P would only flash.  I attempted to turn the car off, it would not turn off until I cycled through all of the buttons.  I attempted to restart the car and went through the above mentioned cycle twice more.  I called the salesman who sold the car to me two days before, he told me to call Chrysler Roadside. The tow truck operator came out on Wednesday morning.  At that time the car would start but not go into neutral.  The tow truck driver attempted to override the safety feature and was not able to.  The car was drug onto the roll back in park.  On Wednesday afternoon I spoke with the dealer  mechanic who said that a squirrel or rat had built a nest in the engine and chewed through the negative cable.  He mentioned foam being all over the place. The story had minor changes after I went to the dealership on Thursday.  After some research I wonder if that was the problem or if they are trying to get out of warranty repairs the are not yet able to diagnose.  I am refusing to take delivery of the vehicle until I am assured that myself and family are safe.",
        "vin": "1c4hjxfg4mw"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/05/2021",
        "dateOfIncident": "07/28/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427834,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving the Jeep on the freeway, it shut off out of nowhere and came to a very quick halt. It nearly caused a major accident on the freeway. A few moments after the Jeep encountered this issue and shut off, I received a message on mu UConnect app saying that there was a Charging Fault Error.   The incident has been reported multiple times online in Jeep forums for the new 2021 Jeep 4xe. Many people have reported that the Jeep shut off while driving at high speeds on the freeway, and the vehicle comes to a sudden and dangerous stop. This is what happened to me.",
        "vin": "1C4JJXP63MW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/05/2021",
        "dateOfIncident": "07/16/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427924,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle pulled to the right and almost hit a person walking on road.  Turned wheel to avoid person and Jeep steering started to wander on the road.  Took a few seconds to get vehicle under control.  Took to Dealer service department.  Technician drove vehicle and said it drives normal and showed no diagnosis codes.  No warning lamps or messages were present.",
        "vin": "1C4HJXAG0MW"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/04/2021",
        "dateOfIncident": "07/31/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427795,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "This vehicle is a plug-in hybrid Jeep Wrangler.  On July 31, 2021 while returning home from vacation and driving at highway speeds (65mph +/-), the powertrain of the vehicle completely failed.  The screen flashed that there was an electrical system malfunction and to pull over.  The vehicle was very difficult to control as I had to travel across three lanes of high-speed traffic to get to an exit ramp.  Fortunately, we made it safely to the exit ramp, where the vehicle completely shut down.    This was the second time this happened.  While driving to vacation on July 22, 2021, a similar incident occurred.  The first incident, however, was not a complete failure.  The vehicle's screen flashed that there was an electrical problem, but the vehicle did not completely stall.  After pulling over, the vehicle restarted.  At that time, I scheduled an appointment with the Jeep dealership to investigate the issue.  That appointment was scheduled for August 1, 2021 (the day after the catastrophic failure).",
        "vin": "1c4jjxp69mw"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/03/2021",
        "dateOfIncident": "07/31/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427635,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving vehicle on HWY 610 in Houston, Texas at approximately 55-60 MPH. Suddenly, vehicle simply stopped working in the middle of driving. Everything on my dash was reading zero. Car were swearing to avoid hitting me. I also had a baby in the backseat of my vehicle. Suddenly, the dash started to read place car in park, Service Charging System. The P at my gear shift was flashing rapidly. I was able to slowly and dangerously coast to the emergency lane. Where I was able to turn the vehicle off. This is a very dangerous situation. At this point, Jeep has no idea what the problem is an this is very frustrating.",
        "vin": "1C4JJXP66MW"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/02/2021",
        "dateOfIncident": "07/28/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427442,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving at night on a 4-lane highway at approximately 55 mph southbound in the left lane.  My hybrid vehicle had less than 1% of battery power and was running using the gas engine.  With no warning the vehicle suddenly experienced a sudden deceleration to less than 10 mph then a warning light came on stating \"service charging system- place vehicle in P and start engine. Fortunately there were no vehicles in close proximity either in front, behind, or in the lane to my right, so I was able to make it over to the shoulder before it came to a complete stop. At that point I received an alert from my UCONNECT app that stated \"Your 2021 Jeep Wrangler Unlimited was unable to charge.\" It also stated to \"Get service immediately.\" I placed the vehicle in park and attempted to start the engine with no response. I repeated the procedure and the engine started after which I was able to drive home. I had the vehicle towed to the dealer the next morning where, after two days, the dealer returned the vehicle and told me they could find nothing wrong. no codes in the computer,  and no information from Jeep on any similar problems, despite getting the aforementioned alert received from the UCONNECT app.  My main concern is that this type failure, the sudden engine failure/deceleration with no warning either inside or outside (brake lights), especially at night, can easily result an accident. I was very fortunate that I was on a highway with other cars near me. A crowded street, highway, or freeway would be a totally different story.",
        "vin": "1c4jjxr61mw"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/25/2021",
        "dateOfIncident": "07/24/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426393,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Pulled out of parking lot and into street.  Several different warnings came on and the vehicle stopped on its on and became totally unresponsive in the middle of the street.  Warnings included E-drive charging fault, check engine, shift error, among many others.  Car push button would not allow the car to turn off.",
        "vin": "1C4JJXP6XMW"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/11/2021",
        "dateOfIncident": "07/10/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424263,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The vehicle gave a Service Hybrid Electric System error and disabled the engine at approximately 60 mph when traveling in E-Save mode, with <1% battery, and half a tank of gasoline. After navigating the vehicle to the side of the road, it came to a hard stop at about 5-8 mph. After 10 minutes, the vehicle restarted in Hybrid mode as was able to operate without error until reaching our destination. Weather conditions were clear at 85 degrees. Issues occurred on a two-lane byway. No injuries, other damage, or police reports at this time. The vehicle will be delivered for service for recreation and diagnosis of the issue. Issue occurred with approximately 246 miles, direct from the dealership upon delivery. The vehicle has no aftermarket accessories.",
        "vin": "1C4JJXR67MW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/07/2021",
        "dateOfIncident": "07/02/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423708,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 Jeep Wrangler. The contact stated that while driving at approximately 41 mph, the hybrid mode failed to let the engine operate and the vehicle stalled without warning. The contact mentioned that the power steering also ceased. The vehicle was restarted later under E-save mode. The vehicle was taken to the dealer however, the mechanic failed to diagnose the vehicle. The vehicle was taken to another dealer where it was partially diagnosed that the Transmission Control Module was disabled. The vehicle was not repaired. The manufacturer was notified of the failure and provided a case number. The approximate failure mileage was 940.",
        "vin": "1c4jjxr68mw"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/06/2021",
        "dateOfIncident": "07/04/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423533,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The actual malfunctioning issue is UNKNOWN. However, my best explanation is as follows: While driving my new 2021 Jeep Wrangler Rubicon (which only has 1400 miles), on the highway at roughly 70 miles per hour and going up a hill, the vehicle felt as if it were trying to up-shift a gear but then immediately down-shift a gear. This up-shift and down-shift feeling continued in quick repetition over and over in a violent shaking manner that thrust the entire vehicle forwards and backwards as long as I continued the acceleration up the hill. Letting off the accelerator seemed to end the violent shaking. I pulled over on to the side of the highway to stop, and turned off the Jeep since the check engine light came on. I waited about five minutes and started up the Jeep again. The check engine light was still on, though. Any acceleration at any speed now causes the Jeep to violently thrust forwards and backwards like I experienced on the highway. I tried to get Jeep Roadside to tow the Jeep to a dealership, but learned how worthless this Jeep Roadside program truly was. Several days after this incident, and I still do not have my Jeep at a dealership for repairs, nor do I have a rental. Jeep Roadside refuses to tow my Jeep to a dealership that has a rental, and I cannot afford to pay the towing fee's to get to a dealership with a rental. The nearest dealerships tell me they are six to eight weeks out on loaner vehicles. I'm too worried to try and driving my Jeep the distance to reach a dealership with a rental, cause it is way too unsafe to operate this Jeep with the violent shaking. I'm curious if anyone else is having this same issue, or knows more.",
        "vin": "1C4JJXFM9MW"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/06/2021",
        "dateOfIncident": "07/05/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423627,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving down the road and ALL the warning lights came on at the same time.  They were flashing across the dash one at a time.  We got a sway bar warning, an airbag warning, check engine light came on and then all of the sudden we lost power steering.  It took all my husband's strength to control the vehicle when the power steering went out.  We had to maneuver to the side of the road.  If I had been driving, I fear what would have happened.  We had the vehicle taken to our local dealer.  Darcars Chrysler Plymouth and Jeep in Waldorf MD.  The service technician there said he had no idea what was wrong and it would take several days to get it looked at.  We took to the internet to research our issue.  We found over and over people with a Jeep Wrangler Rubicon from model years 2019-2021 having the same issues.  The issue turns out to be a problem with the \"wiring harness\".  The Jeep forums online have documented instances of this problem by many, many people.  Jeep should be forced to recall these wiring harnesses since they won't do a voluntary recall.  This is a dangerous defect.  Our vehicle has 6,000 miles on it.  Our vehicle is available to inspect at the dealer.  Someone is going to die if this defect isn't addressed.",
        "vin": "1C4HJXFN9MW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/02/2021",
        "dateOfIncident": "06/16/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423297,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WANDERS AT HIGHWAY SPEEDS AS WELL AS LOW SPEEDS. REQUIRES CONSTANT \"ARMS/HANDS\" PRESSURE TO KEEP VEHICLE TRACKING STRAIGHT. TRAVELLING ON A CURVY ROAD REGULARY THE VEHICLE ENDS UP CROSSING OVER THE YELLOW LINES ON OCCASION CAUSING A PANIC FOR ME AND ANY APPROACHING VEHICLE - SO FAR NO ACCIDENT. THE DEALER INSTALLED A PART RECOMMENDED BY JEEP BUT DID NOT FIX ISSUE.",
        "vin": "1C4GJXAN0MW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/29/2021",
        "dateOfIncident": "06/29/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422858,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "2021 Jeep Wrangler JL, build date 05/2021, apprx 1,000 miles, has the newer steering gear (black) that was supposed to fix the steering issue that Jeep has had since 2019. The Jeep is wandering within lane and requires constant wheel correction to stay within lane. This happens at slower speeds and highway speeds. Steering is overly sensitive. Lane changing requires overcorrection due to the wandering. Difficult to hold straight line. Dealer says nothing is wrong and that's how it is and nothing they can do to fix. Dealer states they cannot duplicate. This is a known issue from FCA on previous years and has continued into some 2021 models. Not being able to drive within the lanes poses a hazard to driver, passengers, and other vehicles on the road. Overcorrection due to extreme sensitivity will create a roll over hazard.",
        "vin": "1C4HJXAG6MW"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/28/2021",
        "dateOfIncident": "06/19/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422564,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "It's over heating while drive at has 12000 miles on it and getting over 250 degrees derating and dash lights came on flashing red saying over heating to hot air shut off going 60 miles an hour. Had to pull off road because it had no gas pedal with cars behind me almost getting hit.",
        "vin": "1c4jjxfmxmw"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/25/2021",
        "dateOfIncident": "06/25/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422301,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "A charging system error caused engine to shut down. I was driving down the road at about 30-40 mph and the vehicle just shut down. I was stopped in the right lane of traffic. A red plug appeared on the instrument panel. The vehicle started back up after several attempts to restart it. The red plug disappeared. I was able to drive the rest of the way home with no issues (about 1 mile). When the vehicle stopped it was in electric mode, had about 50% battery left, and had slightly less than a quarter tank of gas. I called dealer and made a service appointment for today. The vehicle was at the service department for about 3 weeks previously for the service light being on. We picked up the vehicle 2 weeks ago and the issue was not resolved. We had been texting with the service advisor about it while it was there and as soon as we picked it up and noticed the service light was still on he quit responding to us and would not get back with us.",
        "vin": "1C4JJXR69MW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/25/2021",
        "dateOfIncident": "06/17/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422375,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The backup camera turns off completely and the line marks for the parking spot disappears. According to the dealership this is a manufacturer defect that the manufacturer is aware of but haven't taken any actions. It is a dangerous situation as the backup camera is standard feature in all cars and people rely on the camera when backing up the vehicle.",
        "vin": "1C4JJXP65MW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/24/2021",
        "dateOfIncident": "04/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422086,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle has less than 1000 miles on odometer. Wandering, constant steering wheel input needed to keep vehicle on center. Steering feels loose. Have NOT experienced \"Death Wobble\". Tires/wheels are OEM and of course new. Tire pressures are within OEM door label specs. Lug nuts checked and vehicle raised from ground and checked for obviously loose suspension/steering components; none found. Dealer states normal condition for type of vehicle; I disagree. Dealer has not worked on the vehicle. I have owned several Jeeps over the decades...this is by far the worst for steering issues. Tow and alignment have not been checked/adjusted.",
        "vin": "1C4HJXCG0MW"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/22/2021",
        "dateOfIncident": "05/15/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421792,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "DUELER H/L ALENZA",
                "productYear": "9999",
                "size": "P275/55R20",
                "type": "Tire"
            }
        ],
        "summary": "While driving down a paved rural road, the tire pressure light illuminated.  Pulled vehicle over to the side of the road and right rear tire was flat.  Vehicle had 2100 miles on it.  Did not drive over any objects, and did not impact sidewall at all.  Tire just failed.",
        "vin": "1c4jjxp62mw"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "06/22/2021",
        "dateOfIncident": "06/17/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421837,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Brand new, 3 month old 2 DOOR Jeep JL Wrangler 2021.  Jeep purchased in March 2021...    PROBLEM:  Front passenger side seat will not go back into upright position.  It is on an angle & won't straighten up.  Returned to service/dealership - they had to order a part to connect to the actual seat frame.  Have to wait for part.  Cannot have front passenger until repaired.",
        "vin": "1c4gjxan8mw"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/20/2021",
        "dateOfIncident": "06/19/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421529,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving on a one way high way. Was about to overtake a semi truck. While half way on the opposite lane doing a legal overtake my acceleration decreased significantly, nearly causing my passengers and I to get into a head on collision with the another vehicle. All of this was due to the fact that the Jeep’s acceleration was decreased. The following warning appeared and code was registered: Check engine light code P00AF Service Electric Throttle Control  stop/start unavailable  Service stop start system  Acceleration issues   after shutting down my engine all the codes disappear and vehicle precedes to normal driving. I am extremely worried that this might happen again and pace me and my loved ones in a dangerous situation as well as other people on the road",
        "vin": "1C4JJXFM4MW"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/12/2021",
        "dateOfIncident": "06/12/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420689,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "My jeep wrangler has axle lockers.  They are only supposed to be able to be engaged when the vehicle transfer case is set to 4wd low (4L).  Since buying this jeep brand new, the vehicle information intermittently shows the axle lockers being engaged in 2wd high (2H).  I have brought it to the dealer twice for this problem.  First they reset the computer.  The second time they replaced the 4wd module.  The incorrect status is redisplayed again.  I have only had this jeep for 2 months, it has less than 3000 miles on it.  The dealer doesn't seem to know what the problem is.  I have talked with Jeep corporate who also says they can find no reports of this issue.  However the internet jeep forums are full of people reporting this problem, supposedly it is related to failed axle locker sensors on the Rubicon wranglers.  It is common enough an aftermarket company sells a wiring harness that bypasses the sensor.  Because the sensor is not available separately, eventually this requires the entire axle be replaced.  Some people have had their axles replaced 3-4 times.  There really should be a recall.  More than a few posters have also stated their axles have locked by themselves in 2H.  This could cause a crash as axle lockers are not designed for use on pavement or at high speeds.    Here are some links to the the forums:   https://www.jlwranglerforums.com/forum/threads/%E2%80%9Cservice-axle-locker-system%E2%80%9D-light-on.13241/ https://www.jlwranglerforums.com/forum/threads/what-happens-when-the-axle-lock-sensor-fails.67068/ https://www.jlwranglerforums.com/forum/threads/random-service-axle-locker-system.35153/ https://www.jlwranglerforums.com/forum/threads/jl-rubicon-owners-keep-your-locker-sensors-from-failing-how-to-pot-your-sensors.56892/  Here is a link to the wiring harness sold because it is such a common problem https://www.zautomotive.com/product/z_lkr_oem/ The attached photo shows the car in 2H, the lock symbol over the axle, driving 70mph",
        "vin": "1c4hjxfg6mw"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/09/2021",
        "dateOfIncident": "05/03/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420367,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The engine has a manufacture machining defect causing the engine to lose oil.  This component has been inspected my an authorized dealer and has spent 4 weeks in the service department trying to be repaired.  Manufacture has asked dealership to modify the engine block by grinding down the engine and placing a new seal.  The dealership is an agreement this is a temporary fix to a larger problem of poor manufacturing by FCA suppliers.  The loss of oil can lead to unknown catastrophic engine failure, including on major highway posing a saftey risk.",
        "vin": "1C4JJXFM1MW"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/07/2021",
        "dateOfIncident": "06/02/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420003,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "This is about the new Jeep Rubicon 4XE Hybrid Wrangler. We were traveling slowly on a dirt road in our new Jeep. Suddenly it began to slow down and it stopped. It would not move any further. The shifter was frozen in Park. Lights and warnings were illuminated on the dash that were not on before this happened. We were in a wilderness and had no cell reception whatsoever. It would not start, drive or otherwise move. Eventually someone came by and took us into a small town where we called the dealer for assistance. They told us to call Jeep Roadside Assistance. We came close to having to spend the night out there in 40 degree weather with no ability to walk out 14 miles in total darkness. The Jeep was towed to the dealer where it remains 7 days later. It has 183 miles on it. Purchased it on May 29 and it broke down on June 2. The failure seemed to be electrical and across the board. It is the 4XE Hybrid, and the internet is littered with stories just like ours of this Jeep failing and stranding people or stopping on freeways or in intersections. We don't think it was ready for market when they introduced it for sale.Had this happened on a freeway it could have been disasterous for us and others around us.",
        "vin": "1c4jjxr67mw"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/02/2021",
        "dateOfIncident": "05/04/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419328,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "We were on the way to drop our kids off at school when the car gave us a bunch of errors (see pictures). Once we got out of the driveway, the Jeep would not go faster than 5mph. It was towed to the dealer on May 4 and has been there ever since. I have been given conflicting information on what is wrong with it from the dealership and the manufacturer. No ETA on fix.",
        "vin": "1c4jjxp60mw"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/31/2021",
        "dateOfIncident": "05/28/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419109,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I have a brand new 2021 Jeep Wrangler 4xe, which is a hybrid and electric vehicle, which gives about 30 miles on a full battery charge. Since the electric mode distance is limited, the car has a hybrid and gas-only mode that runs on gas for when the battery needs a charge after 30 miles. The following problem occurred over 10 times in a 2 day timeframe:   The vehicle gave a dashboard warning that stated \"service charging system\" and \"service transmission\" plus my Jeep app gave a message \"a charge fault has occurred.\" Within 10 seconds, the entire car shut off. At the time, I was going 60 mph on a freeway. This nearly caused a 10-car pile up, but I was fortunately able to get onto the shoulder despite the entire electrical system shutting down. I was lucky, because after 10 seconds, the car came to an immediate stop and I could not move it at all. At the time, I had two-thirds full tank of gas.   I was able to start the engine about 15 minutes later. Shortly thereafter, the same problem occurred again after about 5 minutes of driving. This sequence repeated itself over 10 times until I was able to get towed to a nearby dealership. I was advised that the battery needed to be charged and this problem would not occur. This is an unacceptable explanation, since this vehicle has a gas-only mode to account for the 30 mile electrical battery distance. The following day, I got a full charge, but the problem happened again on the freeway, this time with 20% battery remaining and a one-half tank of gas. I had to get towed for the second time in two days.   This is a very dangerous problem. This car should be recalled. Someone could have died due to the car completely shutting off while on a freeway and coming to a total half after only 10 seconds.   The Jeep 4xe online forum reports 10 separate episodes of the same problem. I have attached a pdf of the formum to prove this is a recurrent issue. I am certain that someone will suffer a fatality from this recurrent problem.",
        "vin": "1c4jjxr6xmw"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/31/2021",
        "dateOfIncident": "05/17/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419117,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving on the freeway at 70mph the car threw an charge error transmission error and the motor completely shut off. I was left coasting on a busy Bay area freeway with no running engine. I almost got rear ended twice while trying to pull off to the side of the road. I came to a stop and after 5min the car started up and no error lights showed up.",
        "vin": "1C4JJXP60MW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/27/2021",
        "dateOfIncident": "05/27/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418784,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The backup camera does not work at different times. Local dealership said it was a common issue and should resolve itself in an hour.",
        "vin": "1C4HJXEN6MW"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "05/24/2021",
        "dateOfIncident": "05/23/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418297,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 Jeep Wrangler. The contact stated while attempting to park the vehicle, the vehicle independently accelerated while the brake pedal was depressed. As a result, the vehicle crashed into the rear of a vehicle parked on the street. The air bags failed to deploy. A police report was not filed. There were no injuries sustained. The vehicle was not drivable. The vehicle was towed to an impound lot. The vehicle was not diagnosed nor repaired. A dealer was not contacted. The manufacturer had not been informed of the failure. The failure mileage was 930.",
        "vin": "1C4JJXR60MW"
    },
    {
        "components": "STEERING,WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/19/2021",
        "dateOfIncident": "04/18/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417748,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Within a few days of purchasing the vehicle, I noticed that the vehicle moved dramatically to the right and to the left, and the steering mechanism of the vehicle was extremely loose. At 150 miles, I brought it in...the adjusted the steering and aligned the tires. I went on a three hour trip on the highway on April 18th, 2021, Sunday. I nearly crashed into a huge tractor trailer truck because the vehicle swung rapidly to the right and the steering mechanism was so loose, it would not respond sufficiently in time. In addition, the vehicle swings wildly with even mild wind. I managed within inches to swing the car away. I have now brought the vehicle back two more times to the dealership, and they deny any issue. I have provided videos with my spouse driving. My son also drove and found the same issue. The issue occurs both at speeds above 50...and at a speed of 15 miles. This steering column of this vehicle is defective and a true danger on the highway. The manufacturer refuses to take any responsibility in spite of ample knowledge and notice by consumers. Complaints about this issue are all over the internet. We have videos of the defect, which have been provided.  I have tried to return the vehicle but they refuse. It has been in the shop 5 of 7 weeks of ownership.  The dealership states the vehicle is to manufacturer specifications...this is a serious defect.",
        "vin": "1C4HJXFG8MW"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/15/2021",
        "dateOfIncident": "05/08/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416684,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "NAVIGATING STEEP DOWNHILL HAIRPIN TURNS TOTAL STEERING LOSS. GOT VEHICLE STOPPED, SHUTOFF VEHICLE RESTARTED AND HAD STEERING BUT CHECK ENGINE LIGHT WAS ON. CONTINUED ON TO GET OFF OF HILL. SMELL OF HOT ELECTRICAL IN CAB.  TOOK TO DEALER VEHICLE HAS 6000 MILES ON IT. VEHICLE HAS BEEN AT DEALERSHIP  SINCE. LONG LIST OF CODES FOR COMMUNICATION FAILURES. WHEN CHECKED AT DEALERSHIP.   TRACTION CONTROL ACTIVATED AND COULD NOT MOVE VEHICLE UNTIL IT WAS SHUTOFF AND RESTARTED..",
        "vin": "1C4GJXAN1MW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/11/2021",
        "dateOfIncident": "04/17/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416182,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED 1/3/2021. STEERING WANDER, PULLS TO RIGHT, AND 2' DEAD ZONE IN STEERING WHEEL. DEAD ZONE HAS NO TIRE RESISTANCE IN THE STEERING WHEEL. ALWAYS A NEED TO KEEP A TENSION ON THE WHEEL TO PREVENT GOING TO THE RIGHT. MAIDEN VOYAGE UP THE AZ 87 MOUNTAIN FREEWAY AND SECOND TIME UP AND DOWN THE TWISTY 87 FREEWAY IN ARIZONA SEVERAL TIMES CONSTANT WANDERING. A COUPLE OF TIMES IT FELT AS IF I WAS ABOUT TO LOOSE CONTROL OF THE JEEP AT 65MPH. IMMEDIATELY I SLOWED DOWN BELOW THE SPEED LIMIT. I AM VERY FAMILIAR WITH THIS FREEWAY.  JEEP PULLS TO THE RIGHT EVEN FROM THE LEFT LANE. YOU CAN SEE THE STEERING WHEEL TURN A FEW DEGREES TO THE RIGHT AS THE JEEP EMBLEM IS NOT CENTER ON. THERE ARE TIMES IN THE DEAD SPOT YOU MOVE THE WHEEL BACK AND FORTH 2' AND IT'S NO RESPONSE. SOME TIMES THE DEAD ZONE IS ALMOST 2' ON THE WHEEL AND SOMETIMES IT'S LESS. DEALER ALIGNED AFTER AXLE REPLACEMENTS UNDER WARRANTY AND THEN 5/10/21 ALIGNED AGAIN. WAS RETURNED TO ME SAYING IT STILL PULLS. I TOOK IT OUT AND IT STILL WAS OFF, BROUGHT IT BACK AND THEY ALIGNED TWICE AGAIN AND IT STILL PULLS TO THE RIGHT. DUE TO GO BACK AGAIN 5/13/2021, TECH CALLING FCA. THAT WILL MAKE 20 DAYS IN THE SHOP WITHIN FIRST 127 DAYS OF OWNERSHIP. MILEAGE 3200.  PULLING IS NOTICEABLE ON PAVEMENT OVER 40 MPH AND GETS MORE PRONOUNCED THE FASTER YOU DRIVE AND ON FREEWAYS.",
        "vin": "1C4HJXFN0MW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/24/2021",
        "dateOfIncident": "04/24/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413672,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHIN A FEW DAYS OF BUYING IT BRAND NEW OFF THE LOT THE BACK UP CAMERA QUIT DISPLAYING THE LINE ASSIST INTERMITTENTLY WHEN VEHICLE IS PLACED IN REVERSE. WE HAD IT RESET AT THE DEALERSHIP. THE ISSUE CONTINUED. A FEW WEEKS LATER THE BACK UP CAMERA IS NOW FAILING TO DISPLAY ANY PICTURE AND APPEARS AS A BLACK SCREEN WHEN VEHICLE IS IN REVERSE. THIS HAPPENS WHEN VEHICLE IS STATIONARY AND PUT INTO REVERSE TO BACK UP. IT CONTINUES EVEN IF YOU ATTEMPT TO PUT IT BACK IN PARK AND THEN REVERSE AGAIN.",
        "vin": "1C4HJXDM1MW"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "04/06/2021",
        "dateOfIncident": "03/16/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406742,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "' IMMEDIATELY AFTER PURCHASE OF MY 2 DOOR 2021 JEEP WRANGLER JL (ANNIVERSARY) THE REAR VIDEO CAMERA STOPPED WORKING AT START UP, AND CONTINUED TO BE AN ONGOING ISSUE, DESPITE SOFTWARE REINSTALLS.    '  TWO AND A HALF MONTHS AFTER PURCHASE AND WITH JUST 2000 MILES ON IT, WHILE DRIVING IN THE RAIN I NOTICED THAT APPROXIMATELY 10 SECONDS AFTER I PUT ON THE WINDSHIELD WIPERS, THE DASHBOARD LIGHT WOULD DIM SIGNIFICANTLY, WHICH MADE IT DIFFICULT AND DISTRACTING TO SEE THE SPEED AT WHICH I WAS DRIVING, OR THE CRUISE CONTROL.  DIMMING MIGRATED QUICKLY AFTER THAT TO THE MONITOR WHICH BECAME HARD TO READ OR SEE. UCONNECT WAS ALSO NOT WORKING WITH IMAGES AND AUDIO BEING IN DISCERNABLE.    ' NOT LONG AFTER THAT, I NOTICED THAT THE CRUISE CONTROL WAS ALSO INCREASING THE MPH ON ITS OWN WHILE IT WAS BEING SET.  CLEARLY HAVING ELECTRICAL ISSUES.    ' FIVE DAYS LATER GOING SOMEWHERE BETWEEN 40-50MPH ON A HIGHWAY, THE JEEP SHIFTED INTO MANUAL AND I COULD NO LONGER ACCELERATE.  LUCKILY, THERE WAS NOT A LOT OF TRAFFIC AND I COASTED TO THE SIDE OF THE ROAD AND PULLED INTO A PARKING LOT WHERE I STOPPED THE CAR, SHUT IT OFF, TURNED IT BACK ON.  THE CAR WAS STILL WORKING, BUT I WAS SCARED BY WHAT CLEARLY COULD HAVE BEEN A LIFE-THREATENING CIRCUMSTANCE.    ' AT THE DEALERSHIP WHILE THE CAR WAS BEING DELIVERED TO ME IN THE GARAGE BY AN EMPLOYEE, IT STOPPED DRIVING IN FRONT OF MANY EMPLOYEES AND MYSELF. THE WINDSHIELD WIPERS WERE GOING AS FAST AS POSSIBLE AND RAIN WAS POURING DOWN, AND THE CAR SLIPPED INTO MANUAL OR PARK, AND BECOMING UNDRIVABLE.      ' THE CAR CLEARLY HAS SERIOUS SAFETY PROBLEMS WITH THE TRANSMISSION AND MY DEALERSHIP SEEMS UNCONCERNED ABOUT THE SAFETY OF THEIR CLIENTS. THE JEEP CONTINUES TO BE A CONCERN FOR ME, AND I DO NOT FEEL SAFE DRIVING IT.  I ALSO BELIEVE THIS IS NOT A NEW PROBLEM FOR JEEPS.",
        "vin": "1C4GJXAN2MW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "04/01/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405917,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS AN AUTOMOTIVE AFTERMARKET VENDOR \"PANORAMIC JEEP WORLDWIDE\"  HQ IN AUSTIN, TX WHOM IS CUTTING AWAY STRUCTURE OF THE FACTORY JEEP FREEDOM TOP TO INSTALL STANDARD HOUSEHOLD TEMPERED GLASS AS SUNROOFS. ADDING WEIGHT TO THE TOP OF A VEHICLE, WEAKINING THE OEM ENGINEERED SAFETY OF THE FREEDOM TOP TO THE DEGREE THAT THE TOPS WILL FAIL IN AN IMPACT.    AND NO ONE HAS CAUTIONED PEOPLE OR ISSUED A WARNING TO THIS BUSINESS.    I AM AWARE YOUR PRIMARY DOMAIN IS WACHDOG FOR THE OEM'S SOMEONE NEEDS TO WARN THE PUBLIC ABOUT THIS.  INFO@PANORAMIC JEEPLLC.COM  INFO@PANORAMICJEEP365.COM    NOW TO ADD TO THE PROBLEMS- THIS GENTLEMAN A NIXON SANTIAGO, IS RECURUITING INSTALLERS IN NYC, PA, VA      ALL PROMOTION DONE VIA SOCIAL MEDIA (INSTAGRAHAM, TIC-TOCK, AND FACEBOOK)  YET IN ALL APEARANCES HAVE PREVENTED LISTINGS OF PHYSICAL ADDRESSES AND TRADITIONAL WEBSITES WITH LINKS TO A PHYSICAL ADDRESS WHERE THEY CAN BE SERVED BY A PROCESS SERVER.  I BEG YOU TO LOOK INTO THIS FOR THE SAFETY OF US AMERICANS.",
        "vin": "1C4HJXDN9MW"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/01/2021",
        "dateOfIncident": "03/27/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405967,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "2021 RUBICON 88 DAYS OLD 2097 MILES. 3/27/2021. PURCHASED 1/3/2021. DASH WARNING INTERMITTENT SERVICE AXLE LOCKER SYSTEM. I HAVE NEVER USED MY AXLE LOCKERS ONCE.  CAME ON AFTER RIDING UP A VERY SHORT DIRT HILL IN 4L AFTER SHIFTING BACK TO 4H THEN MY DASH BEGAN FLASHING INTERMITTENTLY SERVICE AXLE LOCKER SYSTEM ON AND OFF. HAD TO DRIVE IT HOME THIS WAY WITH THE ALERT FLASHING ON ANS OFF.  GOT INTO DRIVEWAY AND DIFFERENTIAL TRIED TO LOCK ITSELF IN MY DRIVEWAY WHILE BACKING AND FILLING INTO GARAGE. THIS IS DANGEROUS.  IF DIFFERENTIAL LOCKS AT 70MPH ON FREEWAY OR GOING DOWN STEP WINDING ROAD UNEXPECTEDLY FEAR THIS COULD CAUSE AN ACCIDENT. AT DEALER NOW.  REPLACED REAR AXLE ASSEMBLY. STILL BROKEN, THROWING CODES, DEALER TRYING OTHER THINGS.     PLEASE KNOW NOT ISOLATED SITUATION. MANY WRANGLER OWNERS FROM 2018 TO 2021 POSTING THIS UP. ACCORDING TO JL WRANGLER FORUM, FCA DOES NOT HAVE A FIX YET.  THIS SHOULD NOT BE HAPPENING ON A $55K VEHICLE IN FIRST 90 DAYS!  SEVERAL OWNERS ON 3RD AND 4TH AXLE REPLACEMENTS.  THERE ARE 30 PAGES OF COMPLAINTS ON THIS. HTTPS://WWW.JLWRANGLERFORUMS.COM/FORUM/THREADS/'SERVICE-AXLE-LOCKER-SYSTEM'-LIGHT-ON.13241/PAGE-30#POST-1420979    I DECIDED TO REPORT THIS AS IT APPEARS FROM THE FORUM FCA DOES NOT HAVE A FIX  THIS IS APPEARING ON SEVERAL JEEP WRANGLER RUBICON'S BUT NO ONE HAS REPORTED IT HERE THAT I CAN FIND.",
        "vin": "1C4HJXFN0MW"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/30/2021",
        "dateOfIncident": "03/27/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405579,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2021 JEEP WRANGLER UNLIMITED SAHARA'S BACK UP CAMERA FAILED WITHIN 3 WEEKS OF MY PURCHASE OF THE VEHICLE BRAND NEW. IT WAS IN THE SHOP FOR TWO WEEKS AS THEY COULDNT RECREATE THE PROBLEM AS THE BACK UP CAMERA WORKS INTERMITTENTLY. I PROVED PICTURES OF THE BLANK SCREEN WHILE THE VEHICLE WAS IN REVERSE. THEY DECIDED TO REPLACE IT EVEN THOUGH THEY SAY JEEP WONT REPLACE ANYTHING UNLESS THEY CAN RECREATE. ON SATURDAY MARCH 27TH WHEN I WENT TO PUT THE VEHICLE IN REVERSE THE NEW BACK UP CAMERA FAILED TO WORK AGAIN. THIS SEEMS TO BE A COMMON OCCURRENCE THAT I AM READING ON JEEP FORUMS, YET THE DEALERS CAN NEVER RECREATE THE ISSUE, AND WHEN THEY SAY THEY FIXED SOMETHING IT HAPPENS AGAIN. THE BACK UP CAMERA SHOULD WORK 100% OF THE TIME, NOT INTERMITTENTLY. THIS IS A STANDARD FEATURE ON ALL NEW CARS IN THE USA. THIS IS EXTREMELY DANGEROUS TO NOT HAVE A RELIABLE BACK UP CAMERA. ON TOP OF THIS ISSUE MY SIRIUS XM IS INTERMITTENT AS WELL SKIPPING THE SOUND ABOUT EVERY 10 SECONDS OR SO. THESE ISSUES OCCUR WHEN MOVING ON THE HIGHWAY AS WELL AS WHEN THE VEHICLE IS STATIONARY.",
        "vin": "1C4HJXEG0MW"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/29/2021",
        "dateOfIncident": "03/07/2021",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405482,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TOWING THE MANUAL TRANSMISSION JEEP WRANGLER RUBICON (TRANSFER CASE IN NEUTRAL AND TRANSMISSION IN 1ST GEAR) 4 WHEELS DOWN THERE WAS AN EXPLOSION UNDER THE JEEP WITH A BALL OF FIRE. THE VEHICLE WAS INCAPACITATED. THERE WAS NOT ANY SMOKE, NOISE OR INDICATIONS OF AN ISSUE BEFORE AND UP TO THE EXPLOSION. THIS HAPPENED ON A STRAIGHT SMOOTH 4 LANE ROAD AT 40 MPH.",
        "vin": "1C4HJXFG7MW"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "03/24/2021",
        "dateOfIncident": "03/20/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404746,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "A CAR CAME INTO MY SON'S LANE. TO AVOID A HEAD ON COLLISION, HE VEERED RIGHT AND WENT HEAD ON WITH A GUARDRAIL. AIR BAGS DID NOT DEPLOY AND THE SEATBELT DID NOT LOCK. HE WAS ON HWY 1090. WE FIND OUT TOMORROW IF THE JEEP WILL BE TOTALED BECAUSE IT HAS FRAME DAMAGE. THE JEEP DEALERSHIP THAT HAS THE JEEP RIGHT NOW COULD NOT TELL US WHY THE AIR BAGS DID NOT DEPLOY AND THE SEAT BELT DID NOTHING LOCK.*DT*JB*JB",
        "vin": "1C4HJXDGXMW"
    },
    {
        "components": "ELECTRICAL SYSTEM,WHEELS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/18/2021",
        "dateOfIncident": "03/16/2021",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403621,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2021 JEEP STARTED SMOKING IN THE ENGINE AND WITHIN 10 MINUTES BURST INTO FLAMES. THE ENTIRE FRONT END WAS DAMAGED BEYOND REPAIR / BURNED AND FIRE STATIONS HAD TO PUT OUT THE FIRE. MY DAUGHTER, DOGS AND I WERE ABLE TO MAKE IT OUT OF THE CAR BUT VERY SCARY.",
        "vin": "1C4HJXENXMW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/10/2021",
        "dateOfIncident": "03/10/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400261,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAND NEW AND FROM THE START THE STEERING WANDERS AND THERE IS A LOT OF PLAY IN THE STEERING. IT'S A NONSTOP BATTLE TO KEEP THE VEHICLE GOING IN A STRAIGHT LINE AND IT GETS MORE DANGEROUS WITH THE SPEED INCREASES. THE WANDERING WITH THE VERY LOOSE STEERING CAUSES OVER STEERING ISSUES WHICH HAS CAUSED THE VEHICLE TO CROSS THE CENTER LINE AND GO ONTO THE ROAD'S SHOULDER. TURNING HAS SERIOUS CONTROL ISSUES WITH CONSTANT STEERING ADJUSTMENTS THROUGHOUT THE TURN SO THE VEHICLE IS NOT TRACKING A STRAIGHT LINE THROUGH THE TURN. THIS IS ON CITY AND COUNTRY ROADS, STRAIGHT AWAY AND TURNING THROUGHOUT CORNERS.",
        "vin": "1C4HJXFG7MW"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/03/2021",
        "dateOfIncident": "02/07/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398971,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS 2021 JEEP WRANGLER UNLIMITED ON SEPTEMBER 9, 2020. IT IS A TOTALLY STOCK VEHICLE WITH NO MODIFICATIONS OF ANY SORT. IT HAS NOT BEEN DRIVEN OFF ROAD AT ALL, AND ONLY ON CITY STREETS, HIGHWAYS, AND INTERSTATES, NO ACCIDENTS.       WHILE DRIVING ON A NEARBY INTERSTATE IN JANUARY OF 2021, AT ABOUT 77 MPH, A MINOR SEAM IN THE ROAD SENT MY VEHICLE INTO WHAT IS COMMONLY KNOWN AS  'DEATH WOBBLE' MODE. HAD ABOUT 4,000 MILES ON THE ODOMETER. ON A FIVE HOUR ROAD TRIP, IT HAPPENED OVER A DOZEN TIMES ON THAT TRIP ALONE.I VIDEOED THE CAR IN VIOLENT WOBBLE AT HIGHWAY SPEED AND RETURNED THE CAR FOR ANOTHER DAY OF SERVICE.       THE LOCAL JEEP SERVICE CENTER ORDERED A 'STEERING DAMPER' ASSEMBLY AS A FIX FOR THE PROBLEM, EVEN THOUGH THE 2021 WRANGLERS COME WITH THAT STEERING DAMPER AS STANDARD EQUIPMENT STARTING THIS YEAR. UNFORTUNATELY, THE PART IS ON AN EXTENDED BACK-ORDER, I AM TOLD, AND WON'T BE AVAILABLE FOR SOME TIME.       IN THE MEANTIME, THEY DID A 'ROAD-FORCE' WHEEL AND TIRE BALANCE AS AN INTERIM FIX. ONE TIRE WAS AT 24 LBS, ONE WAS AT 17 LBS, AND THE OTHER TWO WERE AT 10 LBS AND 1 LBS.       SINCE THEN THE CAR HAS HAD FEWER, MOMENTARY, WOBBLES OF MUCH SHORTER DURATION, AND HAS RECOVERED QUICKLY MORE IT DOES WOBBLE BRIEFLY AT SLOWER SPEEDS NOW AS WELL.       WHILE DRIVING, I CAN FEEL THE SUPPRESSED WOBBLES IN THE STEERING WHEEL AND GAS PEDAL  AND AM CONCERNED FOR SAFETY AND CONTINUED WEAR AND DAMAGE TO FRONT SUSPENSION AND TIRES, AND THE FREQUENCY OF HAVING TO DO COSTLY ROAD FORCE BALANCING ON THE TIRES. I LOVE THE JEEP BUT I'VE LOST CONFIDENCE IN THE CAR AT THIS POINT.       I HAVE ATTEMPTED TO UPLOAD SOME VIDEO OF ONE OF MY CARS DEATH WOBBLES, SHOWING ITS INTENSITY, AND REFUSAL TO SUBSIDE UNTIL DECELERATED TO ABOUT 55 MPH. THE VIDEO EXCEEDS THE SPACE ALLOWED FOR THIS DOCUMENT, SO YOU'D HAVE TO CONTACT ME TO ARRANGE ANOTHER WAY TO VIEW IT IF NECESSARY.",
        "vin": "1C4HJXDG3MW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/02/2021",
        "dateOfIncident": "02/07/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398724,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAND NEW VEHICLE WANDERS AT HIGHWAY SPEEDS AS WELL AS LOW SPEEDS. REQUIRES CONSTANT \"ARMS/HANDS\" PRESSURE TO KEEP VEHICLE TRACKING STRAIGHT. VEHICLES PULLS TO THE RIGHT DESPITE HAVING UNDERGONE 3 ALIGNMENTS NOW AT 3K MILES. 2021 WRANGLER HAS THE UPGRADED STEERING BOX AND WHILE NO DEAD SPOTS ON THE WHEEL, THE RIGHT PULL IS ANNOYING. PLENTY OF UNHAPPY CUSTOMERS. THE FIX WHICH SEEMS TO BE KNOWN AMONSGT JEEP OWNERS IS RELATED TO LONGER LOWER CONTROL ARMS IN ORDER TO INCREASE CASTER SO THE VEHICLE TRACK STRAIGHT.",
        "vin": "1C4JJXFM7MW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/22/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397333,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT WINDSHIELD DEFROSTER ONLY BLOWS HOT AIR ON CENTER OF WINDSHIELD LEAVING THE DRIVER AND PASSENGER WINDSHIELD FROSTED AND FOGGY AND DANGEROUS TO DRIVE ESPECIALLY IN THE WINTER.",
        "vin": "1C4HJXDG0MW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/22/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397399,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING SLOW OR FAST THE CAR WANDERS AND THERE IS 'PLAY' IN THE STEERING WHEEL. DIFFICULT TO STAY STRAIGHT AND IN ONE LANE WITHOUT CONSTANTLY ADJUSTING.",
        "vin": "1C4HJXFG4MW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/21/2021",
        "dateOfIncident": "02/21/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397225,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BACKUP CAMERA ON MY 2021 JEEP WRANGLER UNLIMITED RUBICON JUST STOPPED WORKING. I GOT IN, STARTED THE CAR AS USUAL, WENT TO BACK UP AND THE SCREEN IS COMPLETELY BLACK. I'VE GONE 3 DIFFERENT PLACES TODAY AND THE CAMERA HAS NOT WORKED ALL DAY. I LITERALLY BOUGHT THIS CAR BRAND NEW 3 WEEKS AGO. THIS IS A SAFETY HAZARD. SOMEONE WILL WRECK WHEN THIS GOES OUT ON THEM. IT LOOKS LIKE A VERY COMMON PROBLEM WHEN I GOOGLE THE ISSUE!",
        "vin": "1C4HJXFNXMW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/21/2021",
        "dateOfIncident": "02/19/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397248,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "A BUNCH OF CODES FLASHED ON MY DASH SCREEN AND THEN STEERING WHEEL LOCKED UP WHEN I WAS DRIVING ON A CITY STREET I HAD JUST TURNED AND WAS GOING STRAIGHT AT ABOUT 30 MPH. I HAD TO USE EXCESSIVE FORCE TO PULL THE CAR OVER AND TURNED CAR OFF AND ON AND THEN I REGAINED STEERING. ALTHOUGH THE STEERING WAS BACK, THE CHECK ENGINE LIGHT TURNED ON. I WAS OUT OF TOWN SO I TOOK IT TO A DEALER TO SEE IF IT WAS SAFE TO DRIVE 2HRS BACK HOME. THEY CHECKED IT SAID A BUNCH OF CODES CAME UP BUT THEY CLEARED THEM AND DIDN'T FIND ANYTHING WRONG. THEY TEST DROVE IT AND COULDN'T DUPLICATE THE PROBLEM SO  THEY SUMMED IT UP AS A COMPUTER GLITCH, AND SAID IT WOULD MOST LIKELY NOT HAPPEN AGAIN AND SHOULD BE FINE DRIVING BACK HOME. IT WAS FINE THE REST OF THAT DAY. THE NEXT DAY AS I'M DRIVING IT HAPPENS AGAIN AND DOES ANOTHER 4 TIMES THAT DAY. 3 DRIVING THRU CROWDED CITY STREETS ONCE I WAS DRIVING STRAIGHT AT ABOUT 15 MPH, NEXT I WAS AT A STOP SIGN AND THEN I WAS SLOWING DOWN TO PULL INTO A PARKING SPOT. THE 4TH TIME THAT DAY I WAS ON THE FREEWAY HEADING BACK HOME. I WAS IN HEAVY TRAFFIC GOING ABOUT 40 MPH. SAME AS THE FIRST INCIDENT I HAD TO PULL OVER AND TURN THE CAR OFF AND ON AGAIN TO REGAIN CONTROL OF STEERING. AND THE CHECK ENGINE LIGHT STAYED ON.",
        "vin": "1C4HJXFG7MW"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/14/2021",
        "dateOfIncident": "02/06/2021",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396161,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "ONLY 500 MILES ON VEHICLE, WENT OFF-ROADING FOR THE FIRST TIME AND WITHIN A SHORT TIME AFTER CLIMBING A STEEP HILL, SMOKE CAME FROM UNDER VEHICLE AND CLUTCH WENT TO FLOOR AND STAYED. TURNED JEEP OFF, PUMPED CLUTCH WHICH SEEMED FINE BUT SMOKE CONTINUED FOR A MINUTE. WENT UNDER VEHICLE AFTER SMOKE STOPPED AND SAW BURNT FIBERS COMING OUT FROM TRANSMISSION CASE. RESTARTED VEHICLE AND NO MOVEMENT. TOWED JEEP OUT TO HOME. JEEP ROADSIDE TOOK IT TO DEALERSHIP. APPARENTLY THE CLUTCH SWITCH PLATE OVERHEATED, FLASHED, AND COMPLETELY BURNED AWAY! THERE'S A RECALL I WAS UNAWARE OF BUT NOW 500 MILES ON BRAND NEW JEEP AND CLUTCH PLATE, PRESSURE PLATE, ETC MUST BE REPLACED.    JEEP IS AT TATE BRANCH JEEP IN CARLSBAD NM WHERE THEY CAN GIVE DETAILS ON DAMAGE.",
        "vin": "1C4HJXFGXMW"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/12/2021",
        "dateOfIncident": "01/29/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395953,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING IN FOG WITH AMBIENT TEMPERATURES OF APPROXIMATELY 9 DEGREES, WINDSHIELD ICED OVER APPROXIMATELY 2/3RDS FROM THE OUTSIDE IN WITH ONLY THE MIDDLE OF THE WINDSHIELD CLEAR, FRONT DEFROSTER ONLY WAS ON MAXIMUM, WITH NO AIR FLOW TO ANYWHERE ELSE, BUT WOULD NOT CLEAR THE WINDSHIELD IN FRONT OF THE DRIVER NOR THE PASSENGER SIDE. PUT HAND ABOVE DEFROST VENTS AND WAS ONLY BLOWING IN THE MIDDLE, NO OBSTRUCTION. WE CONTACTED OUR JEEP DEALER AND TOOK IT TO BE LOOKED AT, THEY SUBMITTED STARS CASE #101853238 AND TOLD US THAT NO ISSUES OF THIS TYPE HAD BEEN REPORTED TO THEM FROM JEEP. WE SEARCHED ON YOUTUBE HTTPS://YOUTU.BE/PLKTXSKZNI4 AND FOUND THIS SAME ISSUE ADDRESSED EXCEPT ON A 2021 JEEP GLADIATOR (JEEP PICKUP). WHEN IT HAPPENED TO US, WE DID NOT TAKE PICTURES AS WE WERE MORE CONCERNED ABOUT GETTING TO OUR DESTINATION AND THEN HOME.",
        "vin": "1C4HJXFN7MW"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/09/2021",
        "dateOfIncident": "02/09/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395429,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS AN ACTIVE RECALL FOR THIS JEEP MODEL.  I TOOK IT TO THE DEALER TODAY, FEBRUARY 9, 2021, TO GET IT FIX AND THEY DO NOT HAVE THE PARTS.  THE DEALER (PLANET DODGE IN MIAMI, FL) INSTRUCTED ME TO CALL FCA GROUP (FIAT CHRYSLER AUTOMOBILE -- OWNERS OF JEEP), WHICH I DID IN FRONT OF THEM, AND NO FIXING OR RESOLUTION.  PART OF THE RECALL STATES HEATED DEBRIS EXPELLED FROM THE TRANSMISSION CASE MAY COME IN CONTACT WITH COMBUSTIBLE MATERIALS IN THE VEHICLE, POTENTIALLY LEADING TO A FIRE.",
        "vin": "1C4HJXDG5MW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/09/2021",
        "dateOfIncident": "01/16/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395491,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "LESS THAN 200 MILES ON CAR CHECK ENGINE LIGHT STARTS BLINKING   CAR ALSO SHAKING   TOOK IT TO DEALER THEY REPLACED A SPARK PLUG   THE NEXT DAY SAME THING   THEY THEN REPLACED ALL THE SPARK PLUGS AND TOLD ME 2021 WRANGLERS WOULD HAVE A RECALL ON THIS   BUT I DON'T NOTICE SAME PROBLEM ANYWHERE",
        "vin": "1C4HJXFG8MW"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/08/2021",
        "dateOfIncident": "01/18/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395249,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON THE FREEWAY AND \"SERVICE SHIFTER\" WARNING APPEARED ON AND OFF. ALSO, WHILE DRIVING ON A CITY STREET THE WARNING CAME ON AND OFF. LIGHTS ON THE SHIFTER FLASHED. DEALERSHIP SAYS THE VALVE BODY IN THE TRANSMISSION IS DEFECTIVE AND NEEDS TO BE REPLACED OR THE WHOLE TRANSMISSION NEEDS TO BE REPLACED. THEY STATED IT'S A SERIOUS SAFETY CONCERN BECAUSE THE CAR CAN STOP SHIFTING ALTOGETHER WHILE DRIVING.",
        "vin": "1C4HJXEG2MW"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/28/2021",
        "dateOfIncident": "01/28/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390573,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BACK UP CAMERA STOPPED WORKING FOR A SHORT PERIOD OF TIME.",
        "vin": "1C4HJXFN6MW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/16/2021",
        "dateOfIncident": "01/15/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388415,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAND NEW 2021 JEEP WRANGLER BACKUP CAMERA ISN'T WORKING THE DAY I PURCHASED IT. JUST GOT A BLACK SCREEN WHEN I PUT THE VEHICLE IN REVERSE FROM A PARKED POSITION. I'VE RESTARTED THE VEHICLE MULTIPLE TIMES THINKING IT'D RESET THE SCREEN BUT STILL NO LUCK.",
        "vin": "1C4HJXDG6MW"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/25/2020",
        "dateOfIncident": "12/24/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384913,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING DURING A MEDIUM SNOW FALL:  THE FRONT WINDSHIELD DEFROSTER IS TERRIBLE! EVEN WITH THE FRONT DEFROSTER ON HIGH HEAT, AND FULL DEFROST MODE, THE DEFROSTER ONLY BLOWS HOT AIR ONTO THE CENTER PORTION OF THE WINDSHIELD. THE RIGHT AND LEFT SIDES OF THE WINDSHIELD GET NO HOT DEFROST AIR (NO AIR WHATSOEVER) AND SNOW AND ICE BUILDS UP ON THE RIGHT 12' AND LEFT 12' OF THE WINDSHIELD. THIS ALSO CAUSES HEAVY SNOW/ICE BUILDUP ON THE WIPER BLADES. TERRIBLE AND DANGEROUS WINDSHIELD DEFROSTER DESIGN. AIR COMES OUT OF THE CENTER DEFROST VENTS ONLY. NO AIR COMES OUT OF THE WINDSHIELD VENTS IN FRONT OF THE DRIVER OR PASSENGER. HORRIBLE AND DANGEROUS DESIGN WHICH MAKES VISIBILITY WHILE DRIVING DURING A SNOWFALL ALMOST IMPOSSIBLE.",
        "vin": "1C4HJXCG0MW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/29/2020",
        "dateOfIncident": "10/14/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376916,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "THE JEEP HAS EXCESSIVE STEERING PLAY AND WANDERS IN THE LANE. WHEN TRAVELLING IN A STRAIGHT LINE, THE VEHICLE REQUIRES CONSTANT AND SIGNIFICANT STEERING CORRECTION. THIS ISSUE BECOMES MORE PRONOUNCED AND DANGEROUS AT SPEEDS ABOVE 60MPH. TWO REPAIR ATTEMPTS HAVE BEEN MADE BY JEEP ONLY OF LAS VEGAS, BUT THE PROBLEM PERSISTS. THIS VEHICLE HAS THE NEW BLACK STEERING GEAR BOX AND 840 MILES. AFTER THE LAST REPAIR ATTEMPT, THE PROBLEM IS WORSE. VEHICLE IS NOW TOO DANGEROUS TO DRIVE.",
        "vin": "1C4HJXFNXMW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/17/2020",
        "dateOfIncident": "09/30/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375058,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING HAS EXCESSIVE PLAY. SEEMS TO BE MORE NOTICEABLE ON HOT DAYS. THE VEHICLE SEEMS TO DRIFT LEADING TO CONSTANT CORRECTION WHILE DRIVING. THIS HAPPENS AT ALL SPEEDS.",
        "vin": "1C4GJXAN4MW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/03/2020",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372913,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2021 JEEP WRANGLER. THE CONTACT STATED WHILE DRIVING 45 MPH, HE BECAME AWARE THAT THE STEERING WHEEL WAS LOOSE AND FAILED TO STEER THE VEHICLE STRAIGHT. THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO LINDSAY CHEVROLET LOCATED AT 15605 JEFFERSON DAVIS HWY, WOODBRIDGE, VA 22191, (571) 200-4754, WHERE IT WAS DIAGNOSED WITH NEEDING THE STEERING GEAR TO BE REPLACED AND THE STEERING MODULE UPDATED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS 225.",
        "vin": "1C4GJXAN5MW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/24/2020",
        "dateOfIncident": "10/18/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366230,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS BRAND NEW AND THE CHECK ENGINE LIGHT CAME ON ONLY AFTER 300 MILES. DEALER DIAGOSED THE PROBLEM WITH O2 SENSOR FAILURE AND VALVE COVER DEFECT.   THE VEHICLE RAN VERY ROUGH AND FELT LIKE IT WAS ABOUT TO STALL.  SEARCH ON JLWRANGLERFORUMS SHOWS THERE ARE OTHERS EXPERIENCING SIMILAR PROBLEMS WITH LESS THAN 500 MILES ON THE ODOMETER.",
        "vin": "1C4HJXDG5MW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/20/2020",
        "dateOfIncident": "09/10/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365429,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "WANDERING STEERING ABOVE 30 MPH WON'T TRACK STRAIGHT, EXCESSIVE PLAY IN THE WHEEL.  ORDERED FROM DEALER WENT TO THE SHOP FOR STEERING ISSUES AT 52 MILES AND BACK AGAIN 2 WEEKS LATER, JUST PICKED IT UP FROM THE DEALER AND STEERING IS WORSE, I FEEL IT IS UNSAFE FOR MY 17 YEAR OLD DAUGHTER TO DRIVE.",
        "vin": "1C4HJXFG6MW"
    }
]