[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/28/2022",
        "dateOfIncident": "03/28/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458728,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 Hyundai Tucson. The contact stated while driving at various speeds, the vehicle intermittently failed to respond while the accelerator pedal was depressed. The contact stated that the vehicle only responded while turning. The contact stated that the failure almost caused a rear end collision several times while driving through intersections. The contact had to slam on the brake pedal. The contact stated that there were no warning lights illuminated. The contact then drove the vehicle to the dealer however, the mechanic was unable to determine the cause of the failure. The contact stated that he was notified of a possible transmission failure. The manufacturer was not notified of the failure. The failure mileage was 9,000.",
        "vin": "KM8J2CA47MU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/16/2022",
        "dateOfIncident": "07/23/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452185,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Purchase new Tucson from Hyundai of Saint Augustine FL in April 2021, the vehicle worked fine. Then in July 2021 the vacuum assist brakes would not hold a vacuum after the engine was shut down, so when you went to start the vehicle it required excessive pressure on the brake peddle to clear the interlock before the vehicle would start.  Took vehicle to dealer and told service writer that I thought it was the Check Valve leaking.  After 2 hours service writer told me Tucson was ready and their technician did not find anything wrong and that there is no Check Valve. Drove vehicle home and the vacuum assist brake was still not correct so I filed a case with Hyundai USA (#18769467) about the problem and waited for them to contact me.  When they contacted me they told me to take it back to dealer and they would fix the problem. I know enough about vehicles that use engine vacuum for power assist brakes have a check valve, so before I went back to dealer I looked up the part number (59139-2W000) vacuum intensifier, and the Hyundai patent (US7752841B2) which clearly shows a check valve. Went back to dealer in October as instructed by Hyundai and told the service writer the same thing I told him the first time.  Waited 2 hours again and was told the technician did not find anything wrong and there is no check valve.  I then showed him the part number and said that is the check valve.  He said he would check with the service manager to see if Hyundai would cover the cost to replace the part and would call me later.  Got the call and was informed that Hyundai would NOT pay to replace the part because the dealership technician did not find any thing wrong. How could the technician find anything wrong with a check valve when he said there is no check valve in the brake system. If the engine quit while I was driving I would not have power assist brakes which could cause an accident. I bought the part from different dealer & installed it, brakes work fine now.",
        "vin": "KM8J33AL2MU"
    },
    {
        "components": "POWER TRAIN,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/21/2021",
        "dateOfIncident": "10/22/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444611,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle becomes unresponsive to the gas pedal after idling at a red light, acceleration is delayed for about 5 seconds. After the cars check engine light turns on and the vehicle begins to idle rough. Vehicle shakes randomly when coasting above 30mph and does not want to accelerate when pressing the gas pedal.",
        "vin": "KM8J33AL6MU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/13/2021",
        "dateOfIncident": "11/01/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440349,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "It appears after breaking, the brakes stick and the car won’t accelerate when pressed on the gas pedal.",
        "vin": "KM8J23A47MU"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "09/28/2021",
        "dateOfIncident": "09/26/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11434675,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 Hyundai Tucson. The contact stated that her right-hand thumb was jammed between the front driver's side door. The contact had to insert the fob key into the door's keyhole in order to open the door since the unlock button on the key fob and door button could not unlock to open the door. Medical attention was received for injuries sustained with a broken right-hand thumb and a 2-inch laceration. The vehicle was not diagnosed nor repaired. The dealer and manufacturer were not made aware of the failure. The failure mileage was 4,844.",
        "vin": "km8j3cal0mu"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/23/2021",
        "dateOfIncident": "06/01/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426171,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "What component or system failed or malfunctioned, and is it available for inspection upon request? Vehicle was running exceptionally well until a software update was applied at the dealership. Hyundai has no recalls / safety campaigns on file for my vehicle make and model and was adamant that no updates should have been applied. On or shortly after this time, vehicle performance became really poor. mpg per tank dropped to around 22 / 23 mpg highway (normally 27-29 mpg), acceleration performance was reduced, and it felt as thought vehicle had issues accelerating at time. Shifting on hills became an issue as well as the vehicle did not appear to properly shift into the next gear when necessary. I was notified after purchase of the vehicle that it should be parked outside of my garage due to possible fire concerns even though my vehicle was supposedly not affected.  How was your safety or the safety of others put at risk? Lack of power / acceleration when needed affected getting onto the highway and shifting lanes. Vehicle rode almost like brake was being continuously applied and slowing down the vehicle at times. Lack of power and improper shifting almost caused an accident or two.  Has the problem been reproduced or confirmed by a dealer or independent service center? No, dealer was unable to reproduce after a quick 10 minute test drive on flat land. I started keeping records and screenshots afterwards.   Has the vehicle or component been inspected by the manufacturer, police, insurance representatives or others? No. Hyundai refuses to contact me back regarding these issues. During this time, an email was sent globally indicating that Hyundai BlueLink would no longer support a feature that independently slowed / stopped vehicles in case of theft.  Were there any warning lamps, messages or other symptoms of the problem prior to the failure, and when did they first appear? No warning lights have appeared on this vehicle.",
        "vin": "km8j3cal5mu"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "05/17/2021",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11417388,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Forward collision warning is set at \"early\", but I only get 1 out of dozen incidents where I feel the warning should be triggered. Often I had to hit the brake hard enough to cause chest pains for me & my passenger. So, the injury below is a minor one for now, but may easily become quite extensive.",
        "vin": "KM8J23A49MU"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/26/2021",
        "dateOfIncident": "03/10/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413920,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED RECALL NOTICE THAT THE POSSIBILITY EXIST THAT A BATTERY COMPARTMENT FIRE COULD HAPPEN. RECALL NOTICE ALSO STATED THAT VEHICLE SHOULD 'NOT BE PARKED INDOORS.' THE RECALL NOTICE ALSO STATED 'AN ELECTRICAL SHORT IN THE ABS MODULE COULD INCREASE THE RISK OF AN ENGINE COMPARTMENT FIRE.' SO WE DON'T DARE PARK THE CAR IN OUR GARAGE SINCE IT IS LOCATED BENEATH OUR HOME, THEREBY LEAVING A NEW CAR OUT IN THE ELEMENTS AT ALL TIMES. IN ADDITION AS SENIOR CITIZENS OUR SAFETY AND WELL BEING ARE BEING JEOPARDIZED AS WE CANNOT ENTER OUR VEHICLE FROM INSIDE OUR HOME, BUT MUST ENTER FROM THE STREET IN ALL TYPES OF INCLEMENT WEATHER. WE CALLED THE SERVICE DEPARTMENT BUT DID NOT RECEIVE A CALL BACK. WE REACHED OUT TO OUR SALESMAN AND HE WAS THE ONE WHO GAVE US INFORMATION ON THE RECALL AND ADDED OUR NAME TO THE REPAIR LIST. HOWEVER WHEN WE DIDN'T HEAR FROM THEM WITH AN UPDATE WE TOOK A DRIVE TO THE DEALER. DURING THE VISIT TO THE DEALER IN MARCH WE WERE TOLD THE PIECE IS ON BACK ORDER. TODAY I CALLED THE SERVICE DEPARTMENT AND WAS TOLD THERE IS NO DATE YET TO FIX THIS RECALL. HOW LONG ARE WE EXPECTED TO WAIT FOR THE 'FIX' AND TO LEAVE OUR CAR OUTSIDE?",
        "vin": "KM8J3CAL2MU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/30/2021",
        "dateOfIncident": "03/30/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405530,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2021 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CALLED CENTRAL AVENUE HYUNDAI (111 S CENTRAL AVE #1, HARTSDALE, NY 10530, (315) 816-3071) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE MANUFACTURER STATED THAT THE PART WAS ON BACK ORDER. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J2CA49MU"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/25/2021",
        "dateOfIncident": "10/29/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404778,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "IN THE INITIAL NHTSA TUCSON RECALL, DATED SEPTEMBER 4, 2020, THE ONLY 2021MY TUCSON VEHICLES TO BE INCLUDED WERE THOSE MANUFACTURED THROUGH 3/31/20 AND SPECIFICALLY ON 6/23/20.  ONCE THE PROBLEM WITH THE ABS MODULE HAD BEEN IDENTIFIED AND CONFIRMED, AND THE RECALL ISSUED, HYUNDAI CONTINUED TO MANUFACTURE, AND SELL TUCSON VEHICLES WITH THE SAME KNOWN SAFETY FLAW. RATHER THAN SHUT DOWN THE PRODUCTION LINE UNTIL CORRECTIONS COULD BE MADE, HYUNDAI CONTINUED TO 'INVESTIGATE' THE PROBLEM WHILE 2021MY TUCSON VEHICLES MANUFACTURED AFTER THE END OF AUGUST 2020 CONTINUED TO BE SOLD.  HYUNDAI CONTINUED TO SELL THESE CARS WHILE AT THE SAME TIME ADMITTING IN NHTSA DOCUMENTS THAT THE COMPANY WAS 'UNSUCCESSFUL IN DETERMINING THE EXACT ROOT CAUSE' OF THE PROBLEM.  INSTEAD, THE COMPANY 'CONCLUDED THAT THE RISK OF AN ELECTRICAL SHORT RESULTING IN A FIRE COULD BE MITIGATED [NOT ELIMINATED] BY LIMITING THE OPERATING CURRENT IN THE ABS MODULE THROUGH A LOWER AMPERAGE FUSE.'  IT WASN'T UNTIL NOVEMBER OF 2020 THAT A PRODUCTION CHANGE WAS IMPLEMENTED.  THEN, IN DECEMBER OF 2020, THE SEPTEMBER RECALL WAS EXPANDED TO INCLUDE VEHICLES MANUFACTURED THROUGH NOVEMBER 2020.",
        "vin": "KM8J33AL3MU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/19/2021",
        "dateOfIncident": "03/16/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403845,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2021 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. HORNE HYUNDAI (1360 E AUTO CENTER DR, APACHE JUNCTION, AZ 85119) WAS CONTACTED AND AN APPOINTMENT WAS SCHEDULE FOR THE VEHICLE TO BE REPAIRED. THE VEHICLE WAS TAKEN TO THE DEALER AND LEFT TO BE REPAIRED. THE CONTACT WAS INFORMED THAT THE PARTS WERE NOT YET AVAILABLE AND TO PICK UP THE VEHICLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J33A41MU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/18/2021",
        "dateOfIncident": "03/15/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403623,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "HYUNDAI TUCSON ANTI-LOCK BRAKE SYSTEM MODULES CORRODE INTERNALLY AND CAUSE AN ELECTRICAL SHORT AND FIRE. THEY ISSUED A RECALL, AND THEIR NOTICES SAY IT WILL TAKE LESS THEN ONE HOUR TO PERFORM INSTALLATION OF NEW ABS MODULES, YET ALL DEALERSHIPS SAY IT TAKES HALF A DAY. I JUST VISITED A DEALERSHIP WHO DIDN'T EVEN HAVE THE PARTS TO DO IT!!! AND EACH SERVICE DEPARTMENT ONLY SCHEDULE 5-7 RECALLS PER DAY. SO ALL DEALERSHIPS ARE BOOKED FOR MONTHS AND MONTHS OUT. LEAVING US ALL WITH THIS VERY DANGEROUS DEFECT, THREATENING TO BURN DOWN OUR HOMES. THIS IS NOT A RECALL BEING PERFORMED IN A TIMELY MATTER CONSIDERING HOW POTENTIALLY SERIOUS IT IS. THEY SHOULD BE BANNED FROM SELLING ANY MORE VEHICLES UNTIL THIS PROBLEM IS COMPLETELY FIXED. SO WHAT ARE ALL OF US CONSUMERS WHO CAN'T GET THIS RECALL FIXED SUPPOSED TO DO IF OUR VEHICLES SUDDENLY BURSTS INTO FLAMES?",
        "vin": "KM8J33A47MU"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/14/2021",
        "dateOfIncident": "01/07/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402935,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "WE GOT THE RECALL NOTICE ON BLUE LINK CALLED FLETCHER WHERE WE BOUGHT IT AND WAS TOLD THEY WOULD GET TO US SOMETIME THAT THE PART WAS BACKORDERED HAVEN'T HEARD FROM THEM SINCE WHEN I CALLED GOT THE SAME SPEECH ASK ABOUT FIRES AND THEY SAID THERE'S NOTHING TO WORRY ABOUT WE STILL DRIVE IT BECAUSE IT'S ALL WE HAVE BEEN PARKING IN THE GARAGE BECAUSE NO WORRIES ACCORDING TO FLETCHER AND HONESTLY IT'S BEEN BELOW FREEZING",
        "vin": "KM8J3CAL2MU"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/13/2021",
        "dateOfIncident": "03/13/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402753,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "HYUNDAI DEALERSHIPS WON'T PERFORM RECALL ON DANGEROUS ABS ISSUE THAT CAUSES ENGINE COMPARTMENT FIRES. THEY SAY TO PARK OUTSIDE AND AWAY FROM STRUCTURES, BUT DEALERSHIPS SAY THEY ARE ONLY ALLOWED TO PERFORM 7 RECALLS A DAY BECAUSE THEY TAKE \"4 HOURS\" BUT THE RECALL PAPER WORK SAYS IT SHOULD TAKE LESS THEN 1 HOUR. SO THEY ARE BOOKED FOR MONTHS AND MONTHS LEAVING US WITHOUT A WAY TO GET THE DANGEROUS FIRE CAUSING ISSUE FIXED. THIS IS A SERIOUS ENOUGH ISSUE, THAT SHOULD BE PRIORITY EVEN BEFORE THEIR SALES. IT'S DISGUSTING WHAT HYUNDAI HAS BEEN GETTING AWAY WITH CONCERNING THEIR FAULTY VEHICLES.",
        "vin": "KM8J33A47MU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/09/2021",
        "dateOfIncident": "12/31/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399906,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2021 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V543000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CALLED CIOCCA HYUNDAI OF QUAKERTOWN (550 S WEST END BLVD, QUAKERTOWN, PA 18951, (215) 883-9295) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8J2CA43MU"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/01/2021",
        "dateOfIncident": "12/31/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398545,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERE HESITATION WHEN ATTEMPTING TO ACCELERATE FROM A STOP. CAR DOES NOT MOVE, REQUIRES SVERAL ATTEMPTS TO PRESS THE ACCELERATOR BEFORE THE CAR RESPONDS, EXTREMELY DANGEROUS WHEN ENTERING AN ON RAMP, MERGING ONTO A HIGHWAY, OR IN HEAVY TRAFFIC. THIS HAS BEEN AN ONGOING PROBLEM WITH THIS CAR,  HAS NOT BEEN RECTIFIED , HYUNDAI REFUSES TO ACKNOWLEDGE THE PROBLEM.",
        "vin": "KM8J3CA40MU"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "01/12/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387738,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A BRAND NEW 2021 HYUNDAI TUCSON ON 1/1/2021. I FOUND OUT ON 1/10/2021 THAT THERE WAS AN ACTIVE RECALL ON MY CAR. AFTER LOOKING THROUGH THE LAWS IT STATES THAT A CAR DEALERSHIP IS LEGALLY NOT ALLOWED TO SELL A CAR THAT HAS AN ACTIVE RECALL. WHEN I CALLED THE DEALERSHIP THEY VERIFIED THAT THEY RECEIVED THE RECALL INFORMATION FOR THAT SPECIFIC CAR ON 12/30/2021 BUT PROCEEDED TO SELL IT ANYWAYS. I AM VERY UPSET THAT THIS HAPPENED AND NOW I HAVE TO TAKE TIME OUT OF MY DAY TO TAKE THE CAR INTO THE SHOP FOR THEM TO FIX THE PROBLEM ON A BRAND NEW CAR THAT NEVER SHOULD HAVE LEFT THE SHOWROOM FLOOR.",
        "vin": "KM8J3CAL9MU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/11/2021",
        "dateOfIncident": "01/10/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387555,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "DEAR SIR:   \"HYUNDAI RECENTLY TOLD OWNERS OF NEWER TUCSON VEHICLES NOT TO DRIVE THEIR RECALLED SUVS IF THE ANTILOCK BRAKE SYSTEM (ABS) WARNING LIGHT COMES ON, AND TO KEEP THE VEHICLES PARKED OUTDOORS SO THEY DON'T CATCH A HOUSE OR GARAGE ON FIRE.\"THIS PARTICULAR HYUNDAI DEALERSHIP IN QUESTION HERE HAS NEVER MENTIONED IT TO ME EVEN THOUGH THE SALES AGENT ([XXX]) WAS ASKED BY MY FRIEND THAT WAS WITH ME TO ASSIST ME WITH/HELP ME OUT IN DEALING WITH THE NEGOTIATION THAT IS, ALWAYS, A COMMON PRACTICE WHEN ONE WANTS TO BUY BOTH USED OR NEW CAR.  I WAS THEN, UNEXPECTEDLY, ADVISED BY THE NEXT DAY, BY MY FRIEND, ABOUT THIS UNFORTUNATE AND EXTREMELY BAD NEWS; OF COURSE, AFTER A THOROUGH RESEARCH, TO FIND OUT WHETHER MY NEW CAR (2021 HYUNDAI TUCSON SUV WAS RECALLED BY THE AUTHORITIES OR NOT.  FROM WHAT HE TOLD ME, HE, SIMPLY, PLUGGED IN THE VIN NUMBER ([XXX]) AND DID THE SEARCHING.  THE RESULT WAS VERY SERIOUS AND LIFE-THREATENING FOR BOTH MYSELF AND MY DAUGHTER.I WILL BE LOOKING FORWARD TO HEARING FROM YOU SOON ON THIS MATTER OF GREAT IMPORTANCE TO ME AS WELL AS MY DAUGHTER AND FAMILY MEMBERS.  IN ADDITION, I WANT YOU TO, PLEASE, COMMUNICATE WITH ME THROUGH EMAIL OR REGULAR MAIL.  I HAVE THE INTENT TO SEEK FOR AN ATTORNEY TO, DIRECTLY, TAKE OVER MY CASE AND DEAL WITH THE DEALERSHIP IN QUESTION HERE.  I, FURTHER NOTIFY YOU THAT MY FRIEND IS NOT GOING TO BRING YOU THE $5,000 THAT HE PROMISED TO YOU.  THAT ($5,000) WILL BE USED TOWARDS THE ATTORNEY FEE.  PS  THIS CAR IN QUESTION WAS BOUGHT ON 01/09/2021  SINCERELY YOURS,  [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "KM8J33AL1MU"
    }
]