[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "06/26/2021",
        "dateOfIncident": "06/26/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422400,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle is easily stolen, and is a safety risk for others. Kia's are getting stolen at an alarming rate and should be recalled! Not only are they getting stolen but they pose a major safety risk because the people stealing them are crashing them, running from police, etc. Damage to my own property as well as others (mine had mysterious damage but I have no idea who or what they hit).  Something must be done!",
        "vin": "KNDMB5C14M6"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "04/28/2021",
        "dateOfIncident": "04/22/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414324,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "DATE OF INCIDENT:  22 APR 2021, THURSDAY  DESCRIPTION OF INCIDENT:  WHILE DRIVING ON CRUISE CONTROL AT 45 MPH ON A WELL-PAVED TWO-LANE ROAD WITH NO OTHER VEHICLES OR OBSTACLES PRESENT IN EITHER LANE, THE VEHICLE SUDDENLY AUTOMATICALLY DECELERATED SHARPLY, CAUSING THE FRONT END TO PLUNGE. SIMULTANEOUSLY, SEVERAL ALERTS, BOTH IN WORDS AND SYMBOLS FLASHED ON THE DASH. THESE INCLUDED 'CHECK COLLISION ALERT' AND LIGHTS SHOWING A SKIDDING VEHICLE AND A SECOND SHOWING THE FRONT OF A VEHICLE IN A CRASH.      ALTERNATING MY ATTENTION BETWEEN THE ALERTS/MESSAGES ON THE DASH AND DRIVING THE VEHICLE, I STEERED TO THE SIDE OF THE ROAD AND STOPPED.  THE ENGINE WAS TURNED OFF AND THEN RESTARTED.  ALL ALERTS AND SYMBOLS WERE EXTINGUISHED.  AN INSPECTION OF THE FRONT OF THE VEHICLE SHOWED NOTHING COVERING OR OBSTRUCTING ANY PORTION OF THE VEHICLE.      I ACCELERATED BACK ONTO THE ROAD AND RETURNED TO A SPEED OF 45 MPH WITHOUT USING CRUISE CONTROL.  THE VEHICLE  RETURNED TO NORMAL DRIVING WITH NO ALERTS OR WARNING SYMBOLS.       AFTER DRIVING APPROXIMATELY ANOTHER 20 MILES, WITH TWO PERIODS OF PARKING THE VEHICLE, THE CRUISE CONTROL WAS AGAIN ENGAGED AT 45 MPH ON AN OTHERWISE EMPTY ROAD.  WHILE I ATTEMPTED TO EXIT THE FOLLOWING-DISTANCE CONTROL FEATURE, THE VEHICLE AGAIN BRAKED SUDDENLY WITH THE SAME SET OF ALERTS AND SYMBOLS AS DURING THE FIRST INCIDENT.  AGAIN STEERING TO THE ROAD SHOULDER, THE ENGINE WAS STOPPED AND RESTARTED WITH ALL ALERTS/SYMBOLS EXTINGUISHED EXCEPT THE CHECK ENGINE LIGHT.",
        "vin": "KNDMC5C18M6"
    }
]