[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/12/2021",
        "dateOfIncident": "02/15/2021",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440264,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "SPRINGDALE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 Keystone Springdale RV. The contact stated that the front cap sealant located on the front roof of the camper had been missing since the RV was purchased, causing water to leak inside the camper. The dealer was notified of the failure and advised the contact that he would be responsible for the cost of the repair. The manufacturer was not notified of the failure. The vehicle was not diagnosed nor repaired. The approximate failure mileage was 0.",
        "vin": "4YDT28220M3"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/15/2021",
        "dateOfIncident": "10/15/2021",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436953,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "SPRINGDALE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 Keystone Trailer. The contact stated while the RV was stationary, the slide out dinette would not slide out from the body as designed. The trailer was towed to a local dealer where it was diagnosed with needing the outriggers replaced however, the RV was not repaired. The manufacturer was informed of the failure and was awaiting a response. Keystone still waiting for parts.  Consumer stated manufacture still needs to replace defective outriggers and do a complete safety check including possible recall from propane tank malfunction. In addition, they damaged the outside front exterior wall leaving a gaping hole near the frame of our rig and they damaged the interior fascia trim around the dinette.",
        "vin": "4YDT17917MW"
    }
]