[
    {
        "components": "EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/06/2022",
        "dateOfIncident": "01/14/2022",
        "fire": false,
        "manufacturer": "KTM North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450634,
        "products": [
            {
                "manufacturer": "KTM North America, Inc.",
                "productMake": "KTM",
                "productModel": "790 ADVENTURE R",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "1) The vehicle TFT display containing important data such as speed etc.. blacks out on occasion. The vehicle itself is still functional but with the display blacked out the operator has no speed information, or information about the vehicle such as fuel levels and ABS control. KTM has been made aware of the issue as it has affected multiple users worldwide.   2) The indicator/blinker control switch does not engage the blinkers when pushing the switch to the left. In right hand drive markets this a particular hazard. Again, the issue is common across the 790/890 Adventure and Duke models.",
        "vin": "VBKTR6404MM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/23/2022",
        "dateOfIncident": "01/06/2022",
        "fire": false,
        "manufacturer": "KTM North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448515,
        "products": [
            {
                "manufacturer": "KTM North America, Inc.",
                "productMake": "KTM",
                "productModel": "790 ADVENTURE R",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The motorcycle's instrument cluster (TFT Display) often becomes obscured by internal condensation (fogging), sometimes remaining obscured for extended periods of time (i.e., 30 minutes). When this occurs, it is impossible to see critical operation/safety information such vehicle speed, traction, and ABS settings. It is also impossible to operate the menu to control these same settings. The resulting conditions make vehicle operation unsafe--especially when fogging occurs while operating the vehicle.   Based on extensive forum searches, this issue is a design flaw that is well-known, but largely unaddressed by the manufacturer (KTM). Many owners of the same vehicle model experience this safety issue. My local dealership has \"warrantied\" (replaced) one display for this condensation issue, but refuses to further remedy the issue, even though the replacement display has the same problem.",
        "vin": "VBKTS6400MM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/08/2022",
        "dateOfIncident": "04/02/2021",
        "fire": false,
        "manufacturer": "KTM North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446703,
        "products": [
            {
                "manufacturer": "KTM North America, Inc.",
                "productMake": "KTM",
                "productModel": "790 ADVENTURE R",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Motorcycle does not start properly when cold.  Takes several tries to start.  Once started it dies several times and must be restarted.  Once running, it idles very rough for several minutes.",
        "vin": "VBKTR6405MM"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/06/2022",
        "dateOfIncident": "06/07/2021",
        "fire": false,
        "manufacturer": "KTM North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446509,
        "products": [
            {
                "manufacturer": "KTM North America, Inc.",
                "productMake": "KTM",
                "productModel": "790 ADVENTURE R",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The motorcycle is having a cold start issue.  When starting after 24hours, the motorcycle will not start right away or will only start on one of two cylinders.  After roughly 60 seconds the second cylinder starts up.",
        "vin": "VBKTR6406MM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/30/2021",
        "dateOfIncident": "08/22/2021",
        "fire": false,
        "manufacturer": "KTM North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445550,
        "products": [
            {
                "manufacturer": "KTM North America, Inc.",
                "productMake": "KTM",
                "productModel": "790 ADVENTURE R",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "If the bike has been sitting overnight, then the first start of the day is difficult.  It does not want to start and takes a few tries.  When it does start it is on only 1 cylinder...this goes back to normal once it warms up after a minute or so.  This began @700 miles.  This problem goes away immediately if you use 89 octane fuel.  I have just stayed with 89 but other owners have reported after going back to the fuel KTM recommends 91 octane or higher, the problem comes back.",
        "vin": "VBKTR6407MM"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/30/2021",
        "dateOfIncident": "04/15/2021",
        "fire": false,
        "manufacturer": "KTM North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445599,
        "products": [
            {
                "manufacturer": "KTM North America, Inc.",
                "productMake": "KTM",
                "productModel": "790 ADVENTURE R",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "When engin is cold for more then 8 hours. Engin will start only on 1 cylinder (right), for +/- 1 minute (1000 +/- rpm), after, you will heard internal explosion, and left cylinder will start (1600 +/- rpm) . and dropping at 1400 for normal idle. With an strong gazoline smells after start-up, after 2 3 minutes smeel is gone  Please note that I live in Canada Quebec",
        "vin": "vbktr640xmm"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/30/2021",
        "dateOfIncident": "10/21/2021",
        "fire": false,
        "manufacturer": "KTM North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445537,
        "products": [
            {
                "manufacturer": "KTM North America, Inc.",
                "productMake": "KTM",
                "productModel": "790 ADVENTURE R",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "When I start the bike,  it sounds like the engine is only running on one cylinder and misfiring.  It runs 'rough' like this for about 30 -60 seconds and the revs are sitting between 1000-1300 instead of the normal 1300-1500rpm range.  You can smell fuel while this is happening.  It then 'pops' and the engine runs fine after that.  I live in the Netherlands,  but wanted to register the issue here as well for investigation.",
        "vin": "VBKTS6409MM"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/29/2021",
        "dateOfIncident": "09/09/2021",
        "fire": false,
        "manufacturer": "KTM North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445504,
        "products": [
            {
                "manufacturer": "KTM North America, Inc.",
                "productMake": "KTM",
                "productModel": "790 ADVENTURE R",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The motorycle has a hard time to start. At times throttle needs to be added to keep the engine from dying out. A modern and fuel injected bike should not need to have the throttle be opened for the bike to start up.",
        "vin": "vbktr6400mm"
    },
    {
        "components": "ENGINE",
        "crash": true,
        "dateComplaintFiled": "10/28/2021",
        "dateOfIncident": "10/27/2021",
        "fire": false,
        "manufacturer": "KTM North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438484,
        "products": [
            {
                "manufacturer": "KTM North America, Inc.",
                "productMake": "KTM",
                "productModel": "790 ADVENTURE R",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Stalled dozens of times and sudden loss of power when cold",
        "vin": "VBKTR6407MM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/26/2021",
        "dateOfIncident": "10/26/2021",
        "fire": false,
        "manufacturer": "KTM North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438301,
        "products": [
            {
                "manufacturer": "KTM North America, Inc.",
                "productMake": "KTM",
                "productModel": "790 ADVENTURE R",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I just wanted to make you aware of my 2021 KTM 890 R VIN # [XXX]  2000 MILES   Since new it has had a hard start when cold or sitting overnight. It takes 2 or 3 times to start and keeps stalling  I stalls runs rough and even runs on one cylinder for 30 to 60 seconds. Its a 2 cylinder motorcycle.  Once running it runs great rest of day.  MANY folks are seeing  the same condition and KTM is not responding with anything of a solution  I have owned many many motorcycles and even 6 KTMS but their lack of attention here is not good.  Dealers say it's normal or no problem found. My local dealer said yeah, we have seen it no real fix.  The earlier 2019/2020 790 models had hard start issues but this new 2021 890 model is worse, more widespread and more severe— running on one cylinder at start up.  I am a master mechanic in the auto industry and understand something is wrong. If ANYONE bought a new car and it took several times to start each morning and it ran rough for a little you would not accept it.  Not only is it not great for customer satisfaction but could be hurting the engine and might be an excess EPA emission issue too.  Thanks for listening and more info is on the ADV website with lots of potential impacted customers   here is a vid-- https://youtu.be/rPwFnlp0oxE [XXX]  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "vbktr6406mm"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/24/2021",
        "dateOfIncident": "09/16/2021",
        "fire": false,
        "manufacturer": "KTM North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437938,
        "products": [
            {
                "manufacturer": "KTM North America, Inc.",
                "productMake": "KTM",
                "productModel": "790 ADVENTURE R",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "Starting immediately after the mandatory 600 mile service check by an authorized KTM dealer, this vehicle started experiencing prolonged cold start failures. It went from starting 100% of the time after three or less start attempts to requiring approximately ten failed start attempts before starting and running. Until 10/20/21, this motorcycle has always been fueled with either 93 octane gasoline with 10% alcohol or 90 octane fuel with no alcohol (only 2-3 times) as recommended by the manufacturer. On 10/20/21, I filled the nearly empty fuel tank with 87 octane, 10% alcohol. On the next overnight cold-soak starting attempt, and every cold start following, the vehicle started immediately on the first start attempt and settled immediately into a normal fast idle until warmed-up. This vehicle was purchased new with 0 miles on June 11, 2021. It received it's 600 mile manufacturer-required service at approximately 680 miles in September, 2021. It currently has, as of 10/24/2021, approximately 1300 miles on the odometer.",
        "vin": "VBKTR6400MM"
    },
    {
        "components": "POWER TRAIN,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/24/2021",
        "dateOfIncident": "10/01/2021",
        "fire": false,
        "manufacturer": "KTM North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437948,
        "products": [
            {
                "manufacturer": "KTM North America, Inc.",
                "productMake": "KTM",
                "productModel": "790 ADVENTURE R",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "When running the motorcycle on the manufacturer-recommended 91+ (premium) octane fuel, the engine can take up to 5 or 6 tries (over the course of a few minutes) to start when it's sat overnight. When the engine eventually does start it runs very rough on only one (of two) cylinder. During this rough starting there is an overpowering smell of raw/un-ignighted fuel coming from the exhaust pipe.  There seems to be some kind of issue with the fueling or ignition timing that prevents the engine from running properly on 91+ octane fuel. Switching to a slightly lower 89 (mid-grade) octane fuel mostly, but not completely, seems to fix the issue. However this fuel is not rocommended by the manufacturer due to the high compression ratio and I'm worried that it might cause damage in the long term.  The bike was taken to the KTM dealer who performed a reset of the factory ECU; however, this did not help the issue at all.   Reading online, I've found dozens of people with other 2021 KTM 890 Adventure motorcycles experiencing the same issues e.g. no start, hard starting, running on one cylinder, etc.   Running on only one cylinder and sometimes dying is a major safety issue.",
        "vin": "VBKTR6402MM"
    },
    {
        "components": "EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/07/2021",
        "dateOfIncident": "09/01/2021",
        "fire": false,
        "manufacturer": "KTM North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432047,
        "products": [
            {
                "manufacturer": "KTM North America, Inc.",
                "productMake": "KTM",
                "productModel": "790 ADVENTURE R",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "The brake lights were not illuminated intermittently and ABS was not engaging intermittently",
        "vin": "Vbktr6407mm"
    }
]