[
    {
        "components": "LANE DEPARTURE,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/27/2022",
        "dateOfIncident": "03/01/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458493,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "Observation 1: Lane-keeping assistance is unreliable and the results of its operation are highly variable.  In optimum conditions (daylight, wide lanes which are clearly marked; good contract between lane markings & pavement; no more than very gentle, wide-radius curves), this feature will do one of three things when the vehicle starts to drift from the middle of the lane:   (1) the feature will gently steer the vehicle back to the desired position,  (2) the feature will exhibit a warning by vibrating the steering wheel and allow the vehicle to change lanes or  (3) fail and do nothing -- without any warning whatsoever.   One never knows how the car will react but it certainly cannot be trusted.  Observation 2: When driving in light traffic or no traffic conditions the vehicle will occasionally brake aggressively.   This was observed to occur on multiple occasions.  Two situational examples which have been observed several times:   (1) four lane roadway inside city limits; speed: 40mph; I was gently braking to stop behind a vehicle stopped at a traffic light; car applied brakes rapidly nearly causing a rear-end crash as the vehicle behind me did not anticipate the Acura's action.  (Judging from the hand signal I received I believe the driver of the vehicle behind me though I was administering a \"brake test\" -- a common precursor to \"road rage.\") (2) driving on a two lane country road at 50-55MPH; no other traffic within hundreds of feet in any direction;  vehicle brakes rapidly for no apparent reason;  my attempt to accelerate and over-ride the \"safety feature\" was unsuccessful -- eventually the Acura stopped this action and I was able to resume desired speed. Important to note:  At no time during these incidents did braking occur to avoid a crash or minimize damage.  These were uncommanded operations that actually increased the probability of a crash.   These events occurred between 11/21 and 03/22.",
        "vin": "5j8ye1h41nl"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/11/2022",
        "dateOfIncident": "03/10/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456296,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "May the water leak causes fire .  I have many issues going on on my new 22 MDX  7k miles on it , the car is acting crazy no keyless entry working, remote is not working, I called many dealers after they checked it they said we have to keep the car for few days because there's water leaking on the driver side, it was a shocking for me that a brand new car having that, I called the worst company ever Acura and i told them i need a replacement or buy back I'm not agree  to fix a brand new car and go through this hassle for years, they was very aggressive and not professional or fair and the case manager hange up on me (Jassica) she refused to let me speake to her manager or supervisor, she said just have to leave the car at the dealer for few days without loaner or reimbursement!! Is it fair ?! And she started to give reasons for the problem which is not true, now I need help to get it done.The worst after sale service ever It was one of my big mistakes that happened to my life to buy Acura !",
        "vin": "5J8YE1H42NL"
    },
    {
        "components": "ELECTRICAL SYSTEM,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/10/2022",
        "dateOfIncident": "02/07/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456241,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "All warning lights came on dashboard. Car wouldn't turn off",
        "vin": "5J8YE1H43NL"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/24/2022",
        "dateOfIncident": "02/14/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453758,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2022 Acura MDX. The contact stated while driving 50 MPH, the brakes applied independently. The contact stated the brake warning light was illuminated. The contact stated that the vehicle decelerated to 10 MPH however, quickly started accelerating after depressing the accelerator pedal. The vehicle was not diagnosed or repaired. A dealer was not contacted. The manufacturer had not been informed of the failure. The failure mileage was approximately 5,500.",
        "vin": "5J8YE1H06NL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/18/2022",
        "dateOfIncident": "02/18/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11452717,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "Sunroof spontaneously exploded outward while driving children to school. Loud boom like an explosion, no rain or inclement weather. Received a splinter from small shards of glass after Acura dealership vacuumed. They quoted me $1100 and $1400 for repair of this defect, and was unable to determine when glass would arrive. Did not give loaner or anything, and car is less than 30 days old.",
        "vin": "5j8yd9h41nl"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/13/2022",
        "dateOfIncident": "06/19/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447407,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "After 4 times of taking the vehicle to two dealerships for the same concerns, I am having the following problems with my vehicle at this time:: wind/whistling/whining noise heard while driving and has gone unresolved. The car consistently makes a whining/whistling noise when reaching speeds between 40-65mph and has been a known issue with this year make and model per documentation provided to me by the dealership.",
        "vin": "5j8ye1h45nl"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "01/09/2022",
        "dateOfIncident": "01/07/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446769,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving on a 80-mph 3-lane one direction (6 both) toll road, following a Tx State Trooper. About a 1/4 mile ahead of me were two waste disposal trucks. One in the right land and one passing the other in the center lane. The trooper and I pulled into the left lane. As we approached the waste disposal trucks (about 1/8 mile away) my brakes automatically engaged and braked hard for no reason. I tried to override it by depressing the accelerator but the accelerator did not respond (as though it had been disengaged). Behind me was a Mercedes SUV, which had to brake hard to avoid rear ending me. My brakes kept automatically braking (off and on). I finally pulled off the road on the left shoulder and brought the car to a complete stop. It then allowed me to proceed on my way. I bought the car in part for this safety feature, but it clearly is faulty. In reading about braking system, i found that older models had a button that you could use to turn the system off. In my 2022 model, you can turn it off only with multiple steps. You can also adjust the responsiveness of the auto-brake system through a multiple step process. Clearly, this is a major problem that needs to be addressed. I was very lucky that the car behind me braked immediately or it would have rear-ended me at high speed. It was about 5:30 p.m. It was getting dark but not completely dark. I think the problem is with the automatic braking system for forward crash avoidance, but my adaptive cruise control was engaged.",
        "vin": "5J8YE1H85NL"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/20/2021",
        "dateOfIncident": "09/18/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441158,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "The brakes are not working warning light has flashed several times. In numerous calls and dealer visits Acura has no resolution the say it’s under investigation. There is a service bulletin from May of 2021 but I was never advised of this issue and I am very uncomfortable driving the car with a brake problem.",
        "vin": "5J8YE1H8XNL"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/24/2021",
        "dateOfIncident": "09/21/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434268,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "The vehicle makes noise while shifting from Park to Reverse to Drive. Transmission fluid and oil fluid leaking while I had driven only 450 miles. Had reported the issue to the Service Department. They informed that since the engine is new it will take a while for the transmission gear to quiet it down. They can't find any leakage for the first two times when I brought the vehicle for them to inspect. Their Service Manager was able to identify the issue and assigned the technician to trace it down. My car is currently in their shop for the third time since I just purchased it on August 19th, 2021.",
        "vin": "5J8YE1H84NL"
    },
    {
        "components": "STEERING,SUSPENSION,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/11/2021",
        "dateOfIncident": "07/10/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424283,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "The car is making extreme noise from the rotors and it’s screeching. I took the car to paragon Acura multiple times and they stated it’s normal. A brake sign pops up and the car seems extremely unsafe.   I have videos to to show everything",
        "vin": "5J8YE1H8XNL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/25/2021",
        "dateOfIncident": "06/05/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422259,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "A transmission error popped up on the car and the vehicle would not accelerate past a few miles per hour. The issue is happening intermittently and the dealer and Acura service claims it’s a random issue. A sign that says brake fault keeps popping up as well and it’s really scary to drive the car. Acura service said it’s normal and working as designed and there is no fix at the moment",
        "vin": "5J8YE1H8XNL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/13/2021",
        "dateOfIncident": "05/03/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420745,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "Transmission failed right as I drove off the lot.  The car initially started to jerk and then was revving to 7000rpms and would not speed up past 25mph. The car also stopped moving when I put it in reverse. When I tool it back to the lot within the hour, around 3 days later they told me the transmission failed ln the car. This was a brand new car and should not have happened.",
        "vin": "5j8ye1h4xnl"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/03/2021",
        "dateOfIncident": "05/31/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419519,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "I purchased the new MDX 2022 on May 27th 2021. On May 31st, while driving on the Interstate 287 at 65mph, the car suddenly stop accelerating. When I pushed the gas pedal, the engine only revved up but the car continued to slow down. I pulled the car on the shoulder lane, shut the engine off and restarted. The problem continued. The dashboard had the warning sign \"Transmission System Problem. Avoid heavy Acceleration and high speed.  See your dealer\". It also showed the sign \"Emission System problem, power may be reduced. See your dealer\".   The problem occured on the busy interstate 287 in central Jersey without any prior warning, on a brand new MDX 2022. We were lucky since it was 11pm and we were in right lane, so could pull over the shoulder. In the online forums, I have found one more user with the similar problem.   The Acura dealer has inspected the car and requested the transmission system change. The car has 1071 miles only and 4 days out of the dealer's parking lot.",
        "vin": "5J8YE1H32NL"
    }
]