[
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/26/2022",
        "dateOfIncident": "11/09/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454264,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "Limpmode:  Life Threatening failure of vehicle shutting down accelerating in heavy traffic in speeds over 70 mph. On 9 Nov 22 I was driving on interstate to take my wife to her radiation appointment.  Within 1 mile of exit, traveling in far-right lane in 4 lanes of heavy traffic with an additional two lanes of heavy traffic merging in from the right, I had to get over into the merging oncoming traffic.  When I went to accelerate to merge right into the heavy traffic, my BMW dash lit up red and the acceleration was shut off leaving the car coasting.  I could not accelerate, stuck in my lane the car started slowing from 70+mph traffic down to 60mph, 55 mph and I was able to get over into exit lanes at 45 mph with car still decelerating up exit ramp.  I pulled off to the exit ramp onto the side of the road into the grass/pavement to safety.  The BMW’s failure to operate was a life-threatening incident for me, my wife and mother in the car in the middle of very heavy traffic.  In addition, all on-coming vehicle traffic was put at risk of life threatening injuries with a high risk of rear end multiple collisons.  I sat looking at the dash reading and it read a few minor problems with sensor for pedestrians and cameras and if it proceeded to fail to contact maintenance, however the car was ok to drive.  I shut the car off and restarted it and was able to get my wife to her appointment.  I drove the car home with no issues.  Vehicle was towed to dealership the next day at Century BMW where it was purchased and informed by BMW Mfg not to touch the vehicle.  BMW N.A. sent engineers to dealership to investigate cause.  BMW N.A.  could not recreate environment, however choose to do repairs thought best to resolve issue.  BMW N.A. sent report to dealership for parts order and repairs.  My many requests for trouble code reports from BMW N.A. and Century BMW starting from 24 Nov 2021 to Jan 2022 were ignored. 18 Feb 22 Partial Rpt. received by accident from service rep.",
        "vin": "5UX53DP08N9"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/24/2022",
        "dateOfIncident": "11/24/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453844,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "SUV's lift gate has opened on its own twice. Once in the garage resulting garage door damage as well as $798.00 in lift gate damage. The second time the vehicle was outside unattended.",
        "vin": "5ux43dp03n9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/03/2021",
        "dateOfIncident": "10/28/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439252,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "When a door or hatch is opened, the car horn is continuously activated for up to two minutes. No switches or key fob buttons deactivate the horn. The dealer service department thinks it is a defective switch or relay in the steering column. The vehicle is underivable because of he loud noise of the horn. It risks damaging hearing, making other sounds undetectable, disturbing others including drivers, pedestrians, and neighbors (one called me to complain, thank you). It also puts one at risk for violent road rage incidents.",
        "vin": "5ux43dp05n9"
    }
]