[
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/30/2022",
        "dateOfIncident": "01/30/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449456,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "First I will say I am an experienced driver with 40 years of driving experience and owned may automobiles.  This is the first automobile I have owned with LED headlights.  During my product research, car review magazines touted LED headlights as superior.  Sadly, I have not found this to be the case.  I have found with the LED headlights, there is a very distinct horizontal line, almost a focused, horizontal beam of light, which can literally be described as night and day.  The headlights, while driving on a perfectly flat surface, illuminates the road quite well in the distance and seem to work best on the expressway.  But no road is perfectly flat.  Driving through my neighborhood at night, with cars parked on the side of the road,  a road with a slight rolling waviness, as I am travelling down one of these rather gentle crests, the road in the distance front of me is not illuminated (as the beam of light is projecting downward), and I have found that in general, dark colored cars parked on the side of the road are hidden until I am almost upon them.   To make matters worse, just driving through the neighborhood at night, irregardless of the road, I have found that these head lights do not cause the reflectors on parked cars to illuminute at all due to the beam of light projecting low and not enough light scatter, which makes it difficult to identify dark colored parked vehicles.  Also, I live in a neighborhood with no sidewalks.  People are out on the streets walking.  If they have dark colored clothing on, it is extremely difficult to see these people as once again, the beam of light is projected low.  On the older cars with halogen lighting, there was enough light scattering about to fully illuminate pedestrians as well as activate the rear relectors on cars.  I feel these LED head lights are quite dangerous and hope inprovements can be made.  No incidents have occured, but I feel this will be an ongoing problem.",
        "vin": "1gnevgkw2nj"
    }
]