[
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/26/2022",
        "dateOfIncident": "02/26/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454280,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving at approximately 45-50 miles per hour, the engine completely failed.  An Engine Failure/Failed/Reduced Power alert message appeared on the dash at the time of the event and the car lost all power, losing speed and coming to a stop.  The road was curbed on both sides with no available shoulder or median to access leaving the vehicle stranded in the right, eastbound lane with continuous traffic approaching from behind.  My safety and the safety of others were at risk as I was on a 45mph, 4 lane road, with vehicles approaching quickly from behind and having to change lanes to go around my vehicle and avoid an accident.  This could have been catastrophic if I'd been on an interstate or in many other situations.  I discovered an email from OnStar Diagnostics that was time stamped at the very time I experienced the incident, 8:02am.  The email states \"An issue with the Engine and Transmission System in your 2022 Chevrolet Equinox has been detected. Please service your vehicle immediately.\"  Also, it was only about 25 degrees and I was afraid to stay in the car due to the continuous traffic.  I purchased this vehicle 3 days ago on Wed, Feb 23 and it has approximately 200 miles on it.  There were no symptoms prior to the incident today.  The vehicle is currently at Bill Estes Chevrolet in Indianapolis, Indiana and will be looked at this Monday, Feb 28th.",
        "vin": "2GNAXMEV9N6"
    }
]