[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/12/2005",
        "dateOfIncident": "06/25/2005",
        "fire": false,
        "manufacturer": "GM PRODUCTS DIV. GM CORP.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10128513,
        "products": [
            {
                "manufacturer": "GM PRODUCTS DIV. GM CORP.",
                "productMake": "POWERTRAIN",
                "productModel": "POWERTRAIN",
                "productYear": "1992",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SAFARI AWD VAN WAS STOPPED AT END OF PARKING LOT READY TO DRIVE ONTO THE ROAD AND IT JUST COLLAPSED OVER THE FRONT DRIVER'S SIDE TIRE.... JUST 'POP!' AND ITS RIDING ON TOP OF THE TIRE. THE TORSION BAR HAD JUST CRACKED IN TWO. FORTUNATELY I WASN'T MOVING VERY FAST AND DIDN'T HAVE THE USUSAL CREW OF KIDS ALONG IN THE CAR THIS TIME. I KEEP HEARING THIS IS A COMMON DEFECT WITH CHEVY ASTROS AND SAFARI VANS. I WOULD HAVE LOST COMPLETE CONTROL IF I HAD ALREADY BEEN DRVING FASTER ON THE HIGHWAY.WHY DOESN'T SOMEONE RECALL THIS PART. THEY'VE APARENTLY CHANGED THE DESIGN OF THE ORIGINAL TORSION BAR.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/30/2005",
        "dateOfIncident": "04/28/2005",
        "fire": false,
        "manufacturer": "GM PRODUCTS DIV. GM CORP.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10118740,
        "products": [
            {
                "manufacturer": "GM PRODUCTS DIV. GM CORP.",
                "productMake": "POWERTRAIN",
                "productModel": "POWERTRAIN",
                "productYear": "1992",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 1992 CHEVROLET BLAZER UNDER NORMAL CONDITIONS I APPLIED THE BRAKES AND THE BRAKE PEDAL WENT TO THE FLOOR. THIS SITUATION CAUSED EXTENDED STOPPING DISTANCE. HAD THERE BEEN ANOTHER CAR IN FRONT OF ME OR OTHER CIRCUMSTANCES THIS CONDITION WOULD HAVE CAUSED AN ACCIDENT. MY HUSBAND CHECKED THE BRAKE SHOES, PADS, FLUID,AND RELATED COMPONENTS. HE PULLED A FRONT WHEEL SPEED SENSOR AND CLEANED IT, TOOK IT FOR A TEST DRIVE AND COULD NOT GET THE CONDITION TO REPEAT. THE BRAKES WORKED FINE AFTER SLAMMING DOWN THE PEDAL SEVERAL TIMES. THIS TRUCK USES A ALL WHEEL ABS SYSTEM AND APPARENTLY HAS A DESIGN FLAW. WE ARE CONCERNED ABOUT DRIVING IT NOW SINCE ITS POSSIBLE THE CONDITION MAY RECUR AT ANY TIME. I UNDERSTAND GM HAD A RECALL ON SOME OF THERE VEHICLES BETWEEN 1988 AND 1996 FOR A PROBLEM WITH EXTENDED STOPPING DISTANCE DUE TO A FAULTY ABS SYSTEM ,BUT WHEN I CALLED CHEVROLET, THEY SAID THEY COULDN'T FIND ANYTHING ON OUR BLAZER, AND THAT A RECALL 99V193000  EXPIRED IN 2002. OUR CASE # WITH CHEVROLET IS 1-332-009609. HOW CAN A SAFETY RECALL JUST EXPIRE WHEN THERE ARE STILL UNSAFE VEHICLES ON THE ROAD. WE ARE THE ORIGINAL OWNERS ,AND NEVER RECEIVED A RECALL NOTIFICATIONS. THERE IS OBVIOUSLY A DESIGN FLAW IN THIS ABS SYSTEM THAT CAUSES EXTENDED STOPPING DISTANCES, AND THIS POSES A SAFETY HAZARD.*AK",
        "vin": "1GNEK18K5NJ"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/06/2004",
        "dateOfIncident": "12/04/2004",
        "fire": false,
        "manufacturer": "GM PRODUCTS DIV. GM CORP.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10102217,
        "products": [
            {
                "manufacturer": "GM PRODUCTS DIV. GM CORP.",
                "productMake": "POWERTRAIN",
                "productModel": "POWERTRAIN",
                "productYear": "1992",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT FRONT WHEEL CAME OFF 1992 PONTIAC GRAND AM SE WHILE DRIVING.  AS I WAS DRIVING, I HEARD A THUMPING NOISE.  WHEN I STOPPED, I LOOKED AT THE WHEELS AND EVERYTHING APPEARED TO BE OKAY.  I CONTINUED DRIVING.  AS A MADE A LEFT TURN, THE RIGHT FRONT WHEEL (RIM & TIRE) CAME OFF.  IT APPEARS ALL 5 STUDS FOR THE LUG NUTS SHEARED OFF.  ONLY ONE OF THE STUDS, WITH THE LUG NUT STILL ATTACHED, HAS BEEN LOCATED.  VEHICLE HAS BEEN TOWED TO SHOP, INSPECTION PENDING.*AK",
        "vin": "1G2NE54N3NC"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "11/16/2004",
        "dateOfIncident": "11/16/2004",
        "fire": false,
        "manufacturer": "GM PRODUCTS DIV. GM CORP.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10100016,
        "products": [
            {
                "manufacturer": "GM PRODUCTS DIV. GM CORP.",
                "productMake": "POWERTRAIN",
                "productModel": "POWERTRAIN",
                "productYear": "1992",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 1992 CHEVROLET K2500 EXTENDED CAB HAS, SINCE I BOUGHT IT NEW IN 1192 HAD A PROBLEM WITH THE FRONT PASSENGER SEAT SLIDING FORWARD WHEN I STEP ON THE BRAKES IN SOME SITUATIONS.  IT DOESN'T HAVE THE TRADITIONAL SEAT LATCH/RELEASE THAT OTHERS USE TO KEEP THE UPRIGHT FROM MOVING FORWARD IN HARD BRAKING SITUATIONS, WHICH ALSO RELEASES THE SEAT AND ALLOWS IT TO MOVE FORWARD.  I HAVE NEARLY REAR ENDED CARS BECAUSE THIS CAUSES A MAJOR DISTRACTION.  *AK",
        "vin": ""
    }
]