[
    {
        "components": "ELECTRICAL SYSTEM,LANE DEPARTURE,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "04/02/2022",
        "dateOfIncident": "03/25/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459308,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "TERRAIN",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "Mientras conducía el panel de instrumento digital donde están los relojes se apagó en su totalidad. El auto siguió funcionando pero no podía ver nada en el panel porque estaba literalmente muerto.  Me moví hacia un costado de la carretera y apagué el carro. Lo volví a prender pero el panel siguió muerto. El carro si trabajaba. Llegue con mucho temor a casa y lo envié al concesionario donde lo compré. Me dijeron que era el panel de instrumentos y que lo tenían que cambiar.",
        "vin": "3GKALMEV3NL"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/15/2022",
        "dateOfIncident": "01/12/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456764,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "TERRAIN",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2022 GMC Terrain. The contact stated upon purchasing the vehicle and driving 60 MPH to her residence for an hour, she smelled a strong glue, plastic and chemical-like odor. The contact stated that she parked the vehicle out in the sun and rolled the windows down; however, she could still smell a strong chemical odor inside the vehicle. The contact stated that the odor was significantly strong and caused her to have a sore throat while driving the vehicle. The contact stated that the odor smell was everywhere inside the vehicle; however, she had only been riding in the front driver's seat. The dealer was notified of the failure and advised the contact to take the vehicle to their location and they would spray ozone inside the cabin of the vehicle. The vehicle was not diagnosed or repaired.  The manufacturer was not notified of the failure. The failure mileage was approximately 6.",
        "vin": "3GKALPEV4NL"
    }
]