[
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/19/2022",
        "dateOfIncident": "03/03/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457462,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "I bought a new 2022 Honda Ridgeline RTL-E February 2022. Drove it 100 miles and was driving down the road 40 mph with no one in front or behind. The brake warning light came on and the ABS locked up. The dash lit up and said \"Collision Mitigation System Problem\". The same CMS failure happened a half dozen times until I got it home. I took it to the dealership the next morning and on a test drive, the same thing happened to their service manager after resetting the system. They said the vehicle was not safe to drive. They kept it and are trying to get a radar sending unit but there are none. They have had the truck for almost 4 weeks. I have since read about this same failure mode going back to the 2017 model year.",
        "vin": "5FPYK3F76NB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/13/2022",
        "dateOfIncident": "03/12/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456462,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "Factory wireless charger. Available for inspection upon request. Unsafe conditions created when wireless charging failed during a drive causing driver to be distracted by misbehaving equipment. Trying to readjust phone was distracting. Problem reproduced at dealer. Dealer declined to repair/replace equipment. Dealer advised iPhone 12 mini silicone case was interfering with the charging. Removed case, but bare phone did not resolve the issue. Replaced phone with brand new iPhone 13. New phone exhibits same behavior. Charger charges for a few seconds, then stops and led indicator blinks. Then charges for a few seconds, and fails again. iPhone started to get real hot so I turned off the wireless charger.",
        "vin": "5FPYK3F72NB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/13/2022",
        "dateOfIncident": "03/10/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456463,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "Equipment did not malfunction, but it behaved in a way that was not expected. Equipment available for inspection upon request. The actuation pressure of the shifter buttons is too high. Occasionally a full press on the reverse or drive buttons doesn’t shift the transmission into the expected drive mode. I pressed the reverse button, and expected the vehicle to shift to reverse, but when I applied gas it rolled forward. I was able to react quickly enough to stop the vehicle from colliding with my garage door. This happened again in the parking lot of a local shop, I was again able to react quickly enough to prevent a collision. The same issue happened again at work, but after trying to shift into drive, the vehicle failed to shift out of reverse despite apparent tactile full button press. Compone try not inspected by dealer or any authorities, no accidental collision have occurred. No warning lights or other indicators have appeared. Equipment hasn’t failed, but it behaves in a way that is unexpected and could cause a low speed collision.",
        "vin": "5FPYK3F72NB"
    },
    {
        "components": "STEERING,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/01/2022",
        "dateOfIncident": "02/24/2022",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454741,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2022 Honda Ridgeline. The contact stated that the vehicle had been driven for approximately a mile; after arriving at her residence, she was unable to shift the vehicle into reverse while depressing the button to select reverse. The contact stated that the emission, transmission, and an unknown sensor warning light were illuminated on the instrument panel during the failure. The contact's husband was able to drive the vehicle to the dealer where they diagnosed the vehicle with a possible battery failure. The battery was replaced and the vehicle was returned to the contact. Two days later while the contact was in a drive-thru line, a whitish-gray smoke started coming from the steering wheel. The steering wheel then became extremely hot to the touch. The contact’s husband who was seated next to her became alarmed and yelled out the fire. The contact and her husband then exited the vehicle out of fear that the vehicle might catch on fire. The contact turned the vehicle off and the smoke stopped. The contact then had the vehicle towed back to the dealer where it remained in their possession. The manufacturer had yet to be notified of the failure. The vehicle had yet to be diagnosed or repaired. The failure mileage was approximately 200.",
        "vin": "5fpyk3f73nb"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/26/2022",
        "dateOfIncident": "02/26/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11454265,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "Came up to a turn light, it was green. Went to make the turn and the vehicle slammed on the brakes. No car in front of me. Car behind me had to swerve to avoid hitting me because the car stopped so quickly. Lacerations to my neck from the seatbelt. After the car came to a full stop the light turned red. After light turned green again car moved forward as normal.",
        "vin": "5FPYK3F58NB"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/25/2022",
        "dateOfIncident": "02/20/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454004,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "When entering a slight curve in the road, the steering wheel shakes and the dash says BRAKE. There is always a car in the oncoming lane, but well within its lane. I only have 1000 miles on the Ridgeline, but this has happened several times. In each instance the brakes were never applied, but it is quite unnerving. There are times when the shaking (vibrating) steering wheel is more violent which makes me think that it is close to applying the brakes.  I had the same issue with my 2018 Accord. The dealer is aware but they say there is nothing wrong with the vehicle.",
        "vin": "5fpyk3f70nb"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/23/2022",
        "dateOfIncident": "02/23/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453636,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "2022 HONDA RIDGELINE. CONSUMER WRITES IN REGARDS TO VEHICLE MALFUNCTION INDICATION ISSUE.   THE CONSUMER STATED THE WINDOW'S MOTOR ON THE DRIVER'S SIDE HAD TO BE REPLACED. THE ENGINE LOST POWER WHILE DRIVING, WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALERSHIP WHERE NO CODES WERE FOUND. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 1,258 MILES.",
        "vin": "5FPYK3F79NB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/30/2022",
        "dateOfIncident": "01/28/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449469,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "After 1h 45min ride on highway in 14F I was taking exit ramp and with only 500 miles on the truck the check engine started blinking, I pulled over shut off the engine, started it back up and all was good, went to dealer and they said no code was stored",
        "vin": "5FPYK3F75NB"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/19/2022",
        "dateOfIncident": "01/17/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448094,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "The wireless charging pad does not work, no matter what position the phone is. I have tried with the case off, so that's not the issue. And I've also tried multiple phones.  It pretends to power on and start charging but then it stops in less than a minute, even WITHOUT driving the car....so the phone has no chance to move.",
        "vin": "5FPYK3F81NB"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/21/2021",
        "dateOfIncident": "12/19/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444582,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "The automatic high beam system is very erratic.  It fluctuates between high and low beam randomly on rural roads when it should be in steady high beam.  It also randomly changes to high beam when oncoming vehicles are approaching causing the other driver to be blinded and flash their high beams.  Vehicle has been in for service twice and the service center says the system is functioning as designed. I have a 30 minute video available which shows the erratic function as well as the high beam at oncoming traffic if needed.  It is more than 3 GB large and exceeds your file limitations.. This is an ongoing problem that occurs whenever the automatic high beam function is  activated. I only turn it on to get video documentation of the problem.",
        "vin": "5FPYK3F7XNB"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/17/2021",
        "dateOfIncident": "12/17/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444196,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "The Automatic High Beams do not always turn off when an oncoming vehicle approaches. There seems to be an issue with the way the system operates in general. They do turn on when expected. They stay on when they should be off. They shut off when they should be on. Dealer states that they do not detect any fault codes in the system and can not troubleshoot any further. Dealer loaned me a 2020 CRV that performed as expected under the same driving conditions. There seems to be a lot of complaints on the internet over the past couple of years. Surprised that Honda has not fixed this safety issue. Thanks!",
        "vin": "5FPYK3F54NB"
    }
]