[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/27/2022",
        "dateOfIncident": "03/07/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458499,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "Not even 500 miles on it and the transfer case/ power control unit went down. (It’s the thing that switches it from electric back to engine power.",
        "vin": "KM8S5DA17NU"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "03/14/2022",
        "dateOfIncident": "02/24/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456541,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "the weather was 20 degrees, sensor on the front did not work causing a Collison , dealer said they dont work it the cold i want this repair under warranty,  dealer never stated they dont work in the cold",
        "vin": "km8s2da12nu"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/23/2022",
        "dateOfIncident": "02/19/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453574,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving highway speed. Nice, clear day.  No trucks or vehicles within 1/4 mile. No impact to windshield.  Stress fracture started on passenger side of front windshield. Initial three inch fracture has expanded to over 12 inches",
        "vin": "5NMS5DAL2NH"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "02/09/2022",
        "dateOfIncident": "01/27/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451231,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "What component or system failed or malfunctioned, and is it available for inspection upon request? Warnings appeared on the instrument panel at the same time the power steering would go out and I would not be able to safely steer the car. This happened on 4-5 occasions.  These are the various warnings that would appear:  Check Lane Following Assist System Check Blind Spot Safety System Check Driver Attention Warning System  How was your safety or the safety of others put at risk? Not being able to steer was very concerned and happened to me while driving on a busy highway at one point. I could barely steer the car well enough to get it to the shoulder. I had to cross 4 lanes of traffic during rush hour.   Has the problem been reproduced or confirmed by a dealer or independent service center? I had it towed to the dealer the final time it happened. They stated that it is a problem with the power steering module   Has the vehicle or component been inspected by the manufacturer, police, insurance representatives or others? Crossroads Hyundai of Loveland inspected the vehicle  Were there any warning lamps, messages or other symptoms of the problem prior to the failure, and when did they first appear? No, not until the moment the issue occurred.  The strangest part of the issue is that after I would pull over and stop the vehicle, I would clean the sensors on outside of the car and on then restart the car and then sometimes it would work again. It seemed to happen on days that there was poor weather or messy roads that would impede the sensors' abilities.",
        "vin": "km8s2da16nu"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/08/2022",
        "dateOfIncident": "01/13/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451022,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "My Vehicle Hyundai Santafe Plugin hybrid 2022 is not showing an accurate gas miles range. It is giving incorrect information especially when traveling long drives. This is giving me anxiety about the loss of gas in the vehicle. It is also does not giving approximate mileage as described by the company on the sticker.",
        "vin": "KM8S6DA29NU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/29/2022",
        "dateOfIncident": "01/28/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449369,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "2022 santa fe PHEV Pebble or road debris punctured inverter cooling radiator causing to leak out. Quality or design flaw ? If happens  and driver is unaware until too late, entire inverter system could be ruined or possible battery fire. Took to dealer for repair. ~1600.00$ Non covered repair cost. Warning light went on, who's to say caught it in time to prevent worse damage to inverter / battery pack",
        "vin": "KM8S7DA2XNU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/15/2022",
        "dateOfIncident": "01/15/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447598,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "Hello I purchased a new 2022 Santa Fe plugin affected by the recall on Jan 11, 2022 and the dealership calls me on 1/15 saying I need to give them the vehicle back and there is NO timeframe available for when the fix will happen.  Should the Hyundai dealership NOT sell me a vehicle with a dangerous open recall on Jan 11 when the campaign is opened up on 12/27/2021?  What are my rights as a consumer with a 4-day old vehicle they now want back for an indeterminate time?",
        "vin": "KM8S7DA21NU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/28/2021",
        "dateOfIncident": "08/26/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445305,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "Service engine light is on sine the vehicle has 850 miles.  Several attend to repair but still not been repair.",
        "vin": "5NMS5DAL6NH"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/19/2021",
        "dateOfIncident": "11/01/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441023,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "New vehicle purchased 10/15/21 form Lester Glen Hyundai in Toms River NJ. After two weeks   and 1100 miles car started leaking gasoline on garage floor, street and driveway at rate of approx one drop every two seconds. Called closest Hyundai dealer (Burns Hyundai), both dealerships said appointments were three weeks out, scheduled on 12/1 with Burns. Stated this was a hazerdous waste spill and extremem safety hazzard but dealers made no other offer of help. Before filing complaint called Hyundai corp and they told me they would escalate but would take 7 days to get back to me (Hyundai complaint #189991007). no one has called me. In last effort LM with president of Lester Glenn 11/18 at 3:20pm asking to call back and resolve so I would not have to file complaint, nobody called me as of 11/19 at 1pm. Leaking appears to be coming from a While plastic block at the rear of the gas tank.",
        "vin": "KM8S7DA23NU"
    },
    {
        "components": "VISIBILITY,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/01/2021",
        "dateOfIncident": "10/15/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438875,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "We purchased my 2022 Hyundai Sante Fe in July of 2021. I had about 5000 miles on the vehicle at the time. On October 15th I was driving down a 2 lane road and heard a pop, I didn't think much of it, thought it might have been an acorn that fell on my roof as the area I live in is very treesy. Later that evening when we got back in the car to leave, we noticed the windshield was cracked, probably about a six inch area. I told my husband earlier that day I heard the popping noise but did not see anything actually fly up and hit the windshield. So we proceeded to call the insurance company who told us the entire windshield would need to be replaced. We were responsible for our $500 deductible. The repair shop contacted every Hyundai dealership in the southeast region only to find out the windshields were on backorder until Oct. 31st. (red flag) In the meantime the crack has spread all the way across the windshield. We found it odd that windshields would be on backorder so we googled \"Hyundai Sante Fe cracked windshields\" and we were floored at the amount of stories out there with the same exact problem, not only with the Sante Fe but other Hyundai SUV models as well. I just wanted to bring this to your attention because I feel the windshields are defective and unsafe. I don't know how many people this has to happen to before Hyundai acknowledges the issue. Even if it were an acorn that fell, it should not have done the  damage that it did. I still feel it was spontaneous as I did not see anything actually hit or bounce off the windshield. So here we are still waiting on the windshield to arrive at the repair shop and out $500.",
        "vin": "5NMS64AJXNH"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "10/28/2021",
        "dateOfIncident": "10/15/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438501,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "When my wife sits in the passenger seat the seat is so low she cannot see over the dashboard. When she uses a cushion the air bag off light goes on indicating she is not protected from collision.  This is an obvious safety issue which my dealer claims to know nothing about and has no solution.  Please contact Hyundai and have them address this issue.  Thanks, [XXX]  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "5NMS24AJ3NH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/01/2021",
        "dateOfIncident": "08/31/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431311,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "When using WAZE via wireless car play, the connection would be disconnected and prompted me to use cable.  Haven't use cable yet so not sure if cable will work.",
        "vin": "5NMS1DAJ9NH"
    }
]