[
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/05/2022",
        "dateOfIncident": "03/31/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459675,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "Traveling at 50 MPH when vehicle began to loose speed and would not accelerate when I stepped on the gas pedal. EPS warning light came on. Was able to pull off the road and turn off vehicle. Waited a few minutes and restarted vehicle which drove without problems. Took vehicle to the dealer who indicated the system was not showing any malfunction codes and they could not replicate the problem. Claimed to reset the system back to factory settings. Will also be notifying Hyundai via certified letter due to history of engine recalls.",
        "vin": "KM8JECA1XNU"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/21/2022",
        "dateOfIncident": "03/13/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457735,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "Headlights have a mechanical flap that blocks a significant portion of your view at night. In the mountains where I live I am unable to safely drive the car at night. I almost had a serious accident driving up the street to my home when a car coming the opposite direction caused my headlights to go into the low beam mode blocking the majority of my site of view. Terrifying to say the least.",
        "vin": "KM8JECA15NU"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/09/2022",
        "dateOfIncident": "03/08/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455850,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "On 3/8/22 between 5:10 pm ET and 5:45 PM ET, I was traveling to a destination with a friend following behind me in her vehicle.  Later, when it was dark, we traveled back to our homes.  She followed me again until the location that we parted to head in different directions.  After arriving home, she messaged me to state that my \"tail lights kept going on and off the whole way\" to our destination.  She also stated \"They were fine on the way home though in the dark\".  I'm unsure if my vehicle was part of the 12 vehicles recalled for lighting issues/reflashing, but if it is, it didn't work, or if it wasn't, the recall may not have covered everything.",
        "vin": "5NMJCCAE8NH"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/02/2022",
        "dateOfIncident": "03/02/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454849,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "I was in a turning lane & a driver swerved in front of me. My car is equipped with auto start stop and it was on. I slammed on my brakes and the engine turned off. When I tried to start  restart the car there was a fluttering/grinding noise. Turned off the key and restarted the car.  Dangerous in the intersection with a stalled car. At the dealer now but not optimistic. Annoying to have to turn off feature each time.",
        "vin": "5nmja3ae6nh"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/26/2022",
        "dateOfIncident": "02/24/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454278,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "My car’s infotainment constantly and consistently goes black and disconnects and reconnects when connected to Apple CarPlay. This may seem like an inconvenience at first, but it poses a real safety issue when using navigation in an area I’m unfamiliar with. In this case it can cut out for ten seconds or more as I’m about to make a turn, which can distract me or make me make a sudden move or turn to make my destination. It also cuts out phone calls, which can force me to use my phone’s speakerphone and regular phone features which require I hold and/or look at the phone while driving. This is a known Hyundai/Apple issue that seems to be impacting thousands of people. I have an iPhone XR with the latest software (15).",
        "vin": "KM8JFCA11NU"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/25/2022",
        "dateOfIncident": "01/21/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453967,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "The car will accelerate, but not beyond a speed of 20 - 30 MPH. The issue is intermittent, one happens in January 2022 and another one happens in Feb 2022. The issue happens after parking overnight, and the issue will go away after restarting the car. No-fault light shows up. The problem has not been reproduced by a dealer since it is intermittent. The issue is reported to the manufacturer, but no actions from the manufacturer have been taken. The issue does pose a safety risk to me and other road traffics since the problem may happen anytime on driving.",
        "vin": "5NMJB3AE8NH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/05/2022",
        "dateOfIncident": "01/31/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450529,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "At highway speed engine began stumbling and shaking car and stalled the car within 5 seconds bring car to halt. Engine would not restart properly, would not settle at idle rpm with rapidly inconsistent rpm shaking the car and then stall within 5 seconds.  Any attempt to place car in drive immediately stalls car. After attempting 50-60 bump starts to get car off road the check engine light and error message about engine control system error eventually showed. Hyundai towing refused to take inoperable car to dealership for warranty repair of 1000mi car, instead left it at our apt parking lot.   The engine failure left the driver and other motorists in danger as unable to move stranded car off 50mph busy main road on cold dark snowy evening.  Dealer reports they are “swamped” with repairs and cannot see an inoperable car for at least 2-3 weeks and no loaners or rental could be provided.   There were no warning lights or warning during initial stall or subsequent restarts. Error message and check engine light did not light until attempting 50-60 bump starts trying to get car off road and a hazard to occupants and other motorists.",
        "vin": "5nmjecae2nh"
    },
    {
        "components": "EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/03/2022",
        "dateOfIncident": "10/24/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450274,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "The headlights on the 2022 Hyundai Tucson are a road safety hazard and should be outlawed from US roadways. Turning on the headlights creates a dark shadow covering over half of the windshield from top to bottom with a triangle at the bottom of shadow at each end. The triangles can be seen on each headlight lens. Driving the Tucson at night is like wearing a pair of dark sunglasses. The bottom of the shadow moves with every movement of the vehicle which is distracting hazardous, hypnotizing and not safe. If I would have driven this vehicle at night, I would not have purchased it.",
        "vin": "5nmje3ae3nh"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/20/2022",
        "dateOfIncident": "09/30/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448166,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2022 Hyundai Tucson. The contact stated while his wife was at a standstill, she depressed the accelerator pedal however, the vehicle failed to move forward for several seconds. The contact stated no warning light was illuminated. The contact stated he had also experienced the failure on multiple occasions. The contact took the vehicle several times to the local dealer however, the mechanic was unable to duplicate the cause of the failure. The manufacturer had not been informed of the failure. The failure mileage was approximately 500.",
        "vin": "KMHJECA16NU"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "12/22/2021",
        "dateOfIncident": "12/02/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11444744,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owned a 2022 Hyundai Tucson. The contact stated that while driving at 5 mph, the accelerator pedal was stuck and the vehicle made a roaring sound. The brake pedal was depressed but the brakes failed to engage and the vehicle crashed into two trucks and then crashed into a church where it stopped. All of the air bags deployed upon impact. The contact sustained an injury to her chest from the air bag deployment but did not receive medical treatment. A police report was filed. The vehicle was towed to a tow yard and deemed totaled by the insurance company. The manufacturer was made aware of the failure and a case was opened. The failure mileage was approximately 6,000.",
        "vin": "5nmjbcaexnh"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/08/2021",
        "dateOfIncident": "10/05/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11439716,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "Thankfully we are alive. We were going at speed and he attempted to pass me on the median, grass and rumble strips. He was inches away from my rear bumper, riding me. When I put the turn signal to move away from him he hit my driver’s side rear panel (side swiped), thank God it didn't turn into a pit maneuver and killed us. He then proceeded to take off. So one thing I have to say is, the vehicle has great pick up. I called 911 and went after him to get his lic plate. When I got to be about 10 car lengths or so, he slammed his brakes. Since I was on the left lane, I could not keep going left and risk going into oncoming traffic. Plus, there was a car on the right lane I slammed the brakes and rear ended him on his right rear. He had a 2021 Toyota Tacoma pick up and our hood flipped up and shattered the windshield. The hood stayed up and I was driving blind. All I did was keeping straight, not knowing where I was going and didn’t hit a vehicle, tree, embankment or sign. I went there yesterday and I have no idea how I we didn’t die. I’m so shaken up by it. When we came to a stop, there was a hole about 6 feet from my front tire. We were the victim of road rage and this person caused the accident purposely. He admitted it to the police. He said to the cop, I was slowing down traffic. I suspect with the size of his vehicle and being so close to my rear bumper, he did not see my turn signal. My major concern is the airbags did not deploy and the hood flipped open blocking my view. I was in a forum and this happened to the same model owned by someone else. I suspect this is a design flaw.",
        "vin": "KM8JBCA19NU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/01/2021",
        "dateOfIncident": "10/27/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438835,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "Bought car new, since bought car it has had burning smell after drivers at time. Never got this when trying out the car and I found the car diagnosis has 4 issues that related to chassis at 0mi. But dealership said that was not an issues.",
        "vin": "5NMJE3AE6NH"
    },
    {
        "components": "AIR BAGS,ENGINE",
        "crash": true,
        "dateComplaintFiled": "11/01/2021",
        "dateOfIncident": "10/28/2021",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438850,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2022 Hyundai Tucson. The contact stated that while driving approximately 55 mph, she collided with an Elk. The engine caught fire and the vehicle was engulfed in the flames. The driver was able to exit the vehicle safely. The contact stated that prior to the crash, the check engine warning indicator light was illuminated. The air bags failed to deploy. There were no reported injuries.  A police report was filed. The fire department extinguished the fire. The vehicle was towed to an independent lot. The local dealer was not contacted. The vehicle was not diagnosed or repaired. The manufacturer was not notified. The approximate failure mileage was 1,000.",
        "vin": "5NMJACAEHN8"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/01/2021",
        "dateOfIncident": "11/01/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438978,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "I purchased my Hyundai Tuscon Limited Saturday 10/30/21 and during the day its perfect at night the headlights produce a black shawdow on the driver side headlight. I am now nervous to drive my vehicle at night due to causing an accident. The visibility in the road from the blind spot has mimicked something black crossing the road and slammed my breaks on thinking I was going to hit an animal or something.  It causes visibility issues that are a safety hazard.  The dealership can't seem to see what I see or don't have any information on this issue.  But if you go to https://www.hyundai-forums.com/threads/2022-tucson-headlight-problem-black-void-shadow-on-driver-side.677546/   Many are having the same issue, no warning lights or anything its a defect in the headlights",
        "vin": "5nmje3ae5nh"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/13/2021",
        "dateOfIncident": "10/06/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436682,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2022 Hyundai Tucson. The contact stated while driving approximately 20 MPH, the vehicle experienced loss of motive power and unintended acceleration. The contact stated no warning light was illuminated. The vehicle was not taken to a local dealer. The manufacturer was not informed of the failure. The failure mileage was approximately 500.",
        "vin": "KM8JFCA16NU"
    },
    {
        "components": "UNKNOWN OR OTHER,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/11/2021",
        "dateOfIncident": "10/11/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436339,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "Wireless Apple Carplay disconnects randomly causing loss of onscreen maps and turn by turn directions. Hands free phone calls are also dropped. This creates a very dangerous, not to mention annoying situation when driving in busy traffic and depending on the map guidance. It has caused me to take my attention off the road trying to get the system to reconnect so I do not miss an exit or turn. Many others with the same make/model vehicle are complaining of this same defect on the internet. Today it happened 20-30 times on a 3hr trip. Most times it reconnects on its own after a some time. Sometimes I have to manually hard reboot the infotainment system to get it back. I have been to the dealer and have called Hyundai care. No one seems to know what the issue is. They just kind of give me the runaround. The dealer admitted there is a problem but had no solution. Carplay is supposed to make driving safer by putting your phone GPS etc on the car screen for safe hands free operation. These disconnects are going to get someone killed.",
        "vin": "5nmjccae6nh"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/07/2021",
        "dateOfIncident": "10/06/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435805,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving on the highway and as I was slowing down for the slower traffic ahead the car started jerking and then the gas pedal wouldn’t cause the car to accelerate. I had to cross several lanes of traffic not being able to accelerate to get to the breakdown lane but could not get all the way off the highway. I believe that the issue was with the engine or brakes. There was a smell of burning in the car so I turned off the engine as soon as I got over as far as possible.  I was afraid to try to turn on the engine because is smelled like something was burning.  I had to sit partially in the highway with cars speeding by rushing to get out of my lane to avoid crashing into me while I called emergency service. The car was towed to the nearest dealership and I am awaiting the results of the inspection results from the dealership. There were no warnings or lights that I noticed prior to this incident.",
        "vin": "5NMJECAE3NH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/10/2021",
        "dateOfIncident": "08/22/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432538,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "Before even reaching 3,000 miles, the engine in this brand new vehicle overheated in very normal driving conditions (under 80 mph on straight, flat interstate in 60-70 degree sunny weather). The dealership technician determined that the engine overheated and the water pump was severely damaged due to the compressor bolts not being tightened correctly during the manufacturing process at the factory.",
        "vin": "5NMJECAE1NH"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/17/2021",
        "dateOfIncident": "08/17/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429487,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2022 Hyundai Tucson. The contact stated while driving 25 mph, the vehicle would not accelerate until the accelerator pedal was depressed to the floorboard. The dealer was made aware of the failure on three separate occasions but informed the contact to drive the vehicle to 5,000 miles and the failure would fix itself. The vehicle was not repaired. The manufacturer was made aware of the failure. The failure mileage was approximately 200. The VIN was Invalid.",
        "vin": "KM8JB3A13NU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/04/2021",
        "dateOfIncident": "08/01/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427751,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "Dear all,  I bought the 2022 Hyundai Tusan SUV on June 16th, 2021. Since then, the car engine has been turn off more than 20 times, causing problems that require restarting. When I stop at the traffic light while driving and start, the car will turn off and I have to take off my car key and wait in 30 seconds and turn on the car again. Nowadays, The brakes were not applied because the engine was turned off while driving. At that time, my driving speed was around 15mph because I exited from a HWY. I think the engine issue is occurred when the engine rpm is low. I took a video of the engine turn off issue.  Thank you,",
        "vin": "5NMJA3AE6NH"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/22/2021",
        "dateOfIncident": "07/22/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425983,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "Nothing happened...yet. Has the NHTSA noticed how several new Hyundai vehicles, as well as a few Infiniti and Toyota vehicles, have turn signals mounted on the rear bumper? This is ridiculous and should be UNACCEPTABLE.  There's absolutely no reason turn signals and reverse lamps can't be mounted where the stop and tail lamps are mounted. It's nearly impossible to see turn signals on the bumper. PLEASE CONSIDER A HEIGHT MANDATE FOR REAR TURN SIGNALS AND REVERSE LAMPS. And, if possible, also consider a mandate for *bright* side repeater signals, amber rear signals, and a height requirement for front signals as well. It's about time that North America joined the rest of the world in these mandates. Thank you!!!",
        "vin": "5NMJCCAE2NH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/15/2021",
        "dateOfIncident": "06/07/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424945,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "Purchased a new 2022 SUV Tucson on 5/22/21.  While driving on a busy street 6/7/21 during work traffic the vehicle just cut off without warning.  With horns blaring I managed to coast to the right blocking traffic leaving one lane open for moving traffic.  Vehicle after a couple of tries would start but would not move when gear was placed in Drive or Reverse.  Hyundai Roadside Assistance notified vehicle towed to closest Hyundai Dealership.  This was dangerous vehicles were almost running into the back of my SUV while abruptly stopping. I exited the vehicle while waiting for the tow truck in fear of vehicle being hit placing myself and others at risk of an accident. Informed by Asst. Service Manager at Hyundai Dealership that no one was trained to work on the 2022 TUCSONs at the Dealership.  As a Public Safety measure at least some employees at each dealership should be trained to work on all newly released vehicles before they are placed on the market.   Notified on June 15, 2021 that the vehicle has a limp mode/ limp node problem.  June 16, 2021 I was informed by Hyundai dealership that the 22 TUCSON has a mechanical defect, transmission fluid was leaking which now the Transmission needs to be replaced.  The newly purchased vehicle currently has only around 370 miles on it.  I thought vehicles go through an inspection before leaving factory and after they reach the dealership before being sold.  This I consider to be another safety issue anything can happen during transport.  A repurchase/buyback from Hyundai wasn't approved.  The vehicle is available for inspection upon request.  Vehicle is ready and will be picked up from the dealership  requesting an invoice of the repair work completed for viewing.  This vehicle could have caused a catastrophic deadly occurrence",
        "vin": "5NMJACAE5NH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/22/2021",
        "dateOfIncident": "06/21/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421833,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "i bought this 2022 tucson from pohanka hyundai in capitol heights MD , after less than a month i started feeling harsh shifting in the transmission i looked underneath the vehicle and noticed immediately a red oil dripping from the transmission i took it back to the dealership and they told me you can drive it until we order a new transmission from hyundai !!! ignoring any safety concern i have , i refused to drive it like that and asked for a replacement for the car and after tons of fighting they agreed to give me a new car , i am reporting this incident to get you familiar with that kind of cars because maybe bunch of tucsons have the same issue and i am the only one detect it",
        "vin": "5nmjb3ae3nh"
    }
]