[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "04/05/2022",
        "dateOfIncident": "12/06/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459753,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "The owns a 2022 Kia Sportage LX. The contact stated while driving approximately 35 MPH to get onto the highway, the contact accelerated; however, the driver in front of her stopped. The contact hit the rear end of the driver in front. The forward collision sensor warning light did not illuminate on the instrument panel. The air bags did not deploy. The vehicle did not have to be towed. There was a police report filed. There was no injury or medical reports. The vehicle was taken to a local mechanic to be repaired for the autobody damages only, not the forward collision sensor failure. The vehicle was drivable and not destroyed. The approximate failure mileage was 4800.",
        "vin": "KNDPMCAC0N7"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/16/2022",
        "dateOfIncident": "03/15/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456991,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "The vehicle was purchased new from the dealer in May 2021. Parked in the driveway and while attempting to adjust the seat height manually, the lever snapped off locking the seat height into its last position. The lever and its \"teeth\" are made of plastic which appears obviously and ultimately designed to fail. This could be a potential safety issue if the driver attempts to adjust the seat height while the vehicle is in motion. Has the problem been reproduced or confirmed by a dealer or independent service center? NO; the dealer will be notified tomorrow. Has the vehicle or component been inspected by the manufacturer, police, insurance representatives or others?  NO; the dealer will be notified tomorrow. Were there any warning lamps, messages or other symptoms of the problem prior to the failure? NO; the dealer will be notified tomorrow.",
        "vin": "KNDPM3ACXN7"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "03/12/2022",
        "dateOfIncident": "12/06/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456423,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "The component on the Kia 2022 Sportage LX called the Forward Collision Warning failed to come on during an accident. This car is available for inspection upon request. My safety and the driver in the car in front of me were put at risk. We were both wearing our seat belts and did not suffer any health issues, but for the future of all drivers, this failed warning system should be recalled. The dealer will not confirm the problem, but the autobody company that repaired the damage confirms that there are no proper parts to confirm this system appropriately. This model only has a camera that sits behind the rearview mirror area. It has gone off two times since the accident where it states that the system is disengaged even though it is turned on. The police only viewed the damage and stated the car was driveable. The insurance company viewed the damage and gave compensation to have it fixed. The autobody company repaired the damage but was concerned about the system failure. I reported it and discussed it with the consumer relations person for the dealership. I also spoke with the general manager of the dealership. They said I would have to make the complaint to Kia. They would not give me an appropriate trade-in value for another safer vehicle. There were not any warning lamps, sounds or messages that went off before the impact occurred.",
        "vin": "KNDPMCAC0N7"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/24/2022",
        "dateOfIncident": "02/10/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11453949,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "My mother was in a car accident where another driver was not paying attention and t-boned her passenger side, doing about 55+ mph. My mother's vehicle, the Kia, had just begun travelling through an intersection (~10-15 mph) when the crash occurred.   The Kia was hit so hard that it rolled 2-3 times before coming to a complete stop. She survived with a few fractured bones, thankfully, but the steering wheel airbag DID NOT DEPLOY! Every other airbag (driver side, passenger side, rear side) deployed, but not one of the most important ones.  We're not sure if her injuries would have been lessened with that airbag or not, but the car was totaled out by insurance. There were no warning lights or symptoms prior to the crash.",
        "vin": "KNDPN3AC3N7"
    },
    {
        "components": "AIR BAGS,FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "01/09/2022",
        "dateOfIncident": "10/10/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446787,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "I was involved in a highway forward collision accident and the emergency braking, alert, and air bags never went off.",
        "vin": "KNDP6CACXN7"
    }
]