[
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "03/21/2022",
        "dateOfIncident": "02/26/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457671,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "There is an issue that according to a document that the dealer gave me and is related to Rear Camera Component Fault Stored In The Radio (Code e B21 7A-9A) They say they have no solution to the issue.  When placing the change of the vehicle in reverse, the radio does not project any image, it is a high vehicle and the visibility is somewhat poor.",
        "vin": "1C4RJKEG1N8"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/14/2022",
        "dateOfIncident": "03/14/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456693,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "Power steering unavailable 1 week after purchase of vehicle at 380 miles. Safety hazard in driving to any location. After research, apparently this is a widespread issue with Ls steering and are somehow still being sold. This is a huge safety issue and should have been address when initial complaints were brought to light immediately. I am unsure how this model is still being sold and would like to be properly be reimbursed and return of this vehicle due to the misinformation and inaccuracy in marketing and sales of this vehicle.",
        "vin": "1C4RJKBG7N8"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/06/2022",
        "dateOfIncident": "02/14/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455414,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "I purchased the vehicle 2/12/2022, a Saturday. On Monday 2/14/2022 I got in the car and it would not start. I pushed the start button and nothing happened. At first I thought my key fob battery was dead but when my wife returned home we had the same issue with hers.   We called the dealer and they thought it was a dead battery and sent a tow truck. The tow truck driver and myself tried to jump start the car and nothing happen. We then tried to load the car on to a flat bed but could not because the car automatically engaged the electronic parking break and would not freely move, even in neutral. Two members of the dealer's service department came down the next day and tried to jump the vehicle and also tried to supply external power to the second battery under the passenger seat. This also did nothing. Keep in mind other electronics in the vehicle like the power seat and back lift gate continued to operate.  We then had the tow truck return with a different truck which had the ability to put the front wheels on a dolly and tow the vehicle to the garage. When delivered to the dealership they tested it with the same results. Fortunately, they were able to \"fix\" the problem at the dealership it had appeared to be a loose fuse and we had the vehicle returned the next day. However, today (3/6/2022) I got into the vehicle and it will not respond again, same issue! The key fobs do not respond at all and if you hit the start button nothing happens.   I have a wife, an eight year old daughter and twin baby (14 month old) sons. Now what if we are in the car together and this happens? Now luckily both times this has happen it was in my driveway, but I cannot take the car anywhere because I cannot risk the safety of my family taking this vehicle. This was the purpose of buying this vehicle so we could have a family vehicle that would accommodate our family and now it is basically a brick sitting in my driveway. This is the second time this has happened in less than a month.",
        "vin": "1C4RJKBG8N8"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/24/2022",
        "dateOfIncident": "02/14/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453850,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE STOPPED COMMUNICATING WITH THE KEY FAB.  THE WHOLE CAR IS DEAD BECAUSE OF THIS.  I THOUGHT THIS WAS A 1 OFF TYPE OF THING, BUT I SEE THIS COMPLAINT AND AN ARTICLE ABOUT THIS ON THE WEB.  WAITING TO SEE A REPAIR FROM JEEP BUT THEY CANT GET PARTS.  BEING SITTING AT THE DEALERSHIP SINCE MONDAY FEBRUARY 14.  WAITING ON THE COMMUNICATIONS THING TO FIX THE CAR.",
        "vin": "1C4RJHBG4N8"
    }
]