[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/17/2022",
        "dateOfIncident": "11/30/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452546,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "I purchased a brand new 2022 Kia Soul GT line on 9/01/2022. At 4300 miles, the IVT transmission imploded while on the freeway. Same issues as all the others reported here - fluctuating rpms, followed by a complete loss of power while the tach is redlined. Had it towed to the Kia dealership, and they determined that I needed a new transmission. The only thing they could tell me was that there were metal shavings in the transmission fluid. Also, I didn't get a new transmission in my new car - they installed a refurbished trans, which I questioned, but I was assured that all would be well. Of course, the \"new\" transmission failed after only 1300 miles, same issue, and my car is still in the shop two weeks later. No warning lights came on, no notification of trouble through the app, either. Now I'm getting half-answers from my dealership about my next steps. I know what that will be - an attorney. KIA HAS KNOWN ABOUT THESE IVT TRANSMISSION FAILURES FOR OVER TWO YEARS AND THEY HAVE DONE NOTHING. I will never buy another Kia again. Ever. If you're reading this, please DON'T BUY A KIA.",
        "vin": "KNDJ63AU2N7"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "12/28/2021",
        "dateOfIncident": "12/18/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11445349,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2022 Kia Soul X-Line. The contact stated while at a stop, the vehicle was rear-ended and the seat belts did not retract nor did none of the airbags deploy. The contact sustained shoulder bruises and a hip bruise. The contact's friend was sitting in the passenger side front seat and sustained a head injury that required stitches. A police report was filed and the vehicle was towed to an insurance lot. The manufacturer was not informed of the failure. The failure mileage was approximately 8,000.",
        "vin": "KNDJ23AUXN7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/12/2021",
        "dateOfIncident": "10/10/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436495,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "As explained to me by the phone lady at Parsons KIA in Winchester Va. It is a built in feature that supposedly kills the engine at a stop light to save gas. however occasionally if you let go of the brake and hit the gas at the right time the car lunges out into the intersection then dies. I almost got side swiped once. Then when I reported this to the car dealer the answer is they  ask their customers to remember to turn off the feature before driving the car. This \"WILL\" cause an accident some where out there and needs to be recalled immediately before people are killed because of it.",
        "vin": "KNDJ23AU4N7"
    }
]