[
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/11/2022",
        "dateOfIncident": "01/24/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456297,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "My truck had around 230 miles on it and I experienced a thumping noise from the engine compartment. The thumping disappears once the truck reaches operating temperature and the EGR valve opens. Dodge claims they have no idea what the cause is. Additionally, there is an electrical draw. I have to jump start my truck every morning. The claim it is the amplifier. I pulled the fuse overnight and still had to jump start the following morning. I’m getting the run around.",
        "vin": "3C63R3JL0NG"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/21/2022",
        "dateOfIncident": "01/21/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453203,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "Uconnect 12” Screen Blinds Driver With Full Brightness in Reverse.    There is a software issue with the Uconnect 12” screen in RAM trucks.  The issue arises in dark unlit areas when the truck is put in reverse, the Uconnect 12” screen is automatically switched to full brightness, resulting in blinding the driver so the side rear view mirrors become useless.  There is no way for the driver to override this max brightness when in reverse.  The Uconnect 12” screen should maintain its current level of brightness when the driver places the truck in reverse and not default to max brightness. In urban areas this may not be as significant issue as it is in rural areas.  Many times, I have had to throw a heavy blanket, jacket, or sweatshirt over the screen so I would not be blinded by its increase to max brightness when putting the truck in reverse.  This issue is made significantly worse when trying to back a 30’ trailer in the dark and can no longer see anything from the side view mirrors due to the max brightness of the Uconnect 12” screen blinding me.  This is similar to passing a car with their bright lights on, but they sit there until you take the truck out of reverse.  This Uconnect 5 12” screen seems to be significantly brighter than the Uconnect 4 screen in my previous vehicle. This is a safety issue as it temporarily blinds the driver when in reverse and has already caused damage to one trailer.  The Uconnect 12” should maintain the current level of brightness and not go to max brightness when the truck is put in reverse.  Please make this a priority request for the next software release of the Uconnect 12”.     Thank you!",
        "vin": "3C63R3FL4NG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/14/2021",
        "dateOfIncident": "12/11/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443717,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "My vehicle came with 4X4 gear box shift on the floor.  I could not get it to move into neutral or 4 low gear. I hardly drove in so it was no big deal so one day I pulled up the boot around the shift and there was a screw blocking the forward movement. It was the same screw that mount the plastic around the shift, after removing it I was able to get all the gears. The danger in that screw could have put me at risk by locking me into a gear and only staying there. The only reason I discovered this was I changed out my vinyl for carpet.",
        "vin": "3C63RRGLXNG"
    }
]