[
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/23/2022",
        "dateOfIncident": "02/07/2022",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458084,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "There seems to be an issue with the led headlights. When on they are projecting two dark shadows of something looking like rectangle objects. This is very unsafe and definitely very annoying because all you see are those two shadows right in front of your eyes.",
        "vin": "JF2SKALC2NH"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/08/2022",
        "dateOfIncident": "03/08/2022",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455717,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "Same complaint as NHTSA ID Number: 11454147.  I have   a serious safety concern with a new vehicle purchased in February 2022.  I have there are three  issues concerning the vehicle’s headlights:   1.There are two large shaded dark spots directly in your field of vision.  These are approximately fifteen to twenty feet directly in front of the vehicle.   2.The cutoff lines are jagged and irregular with low points dropping down.  These are always in motion with the steering responsive headlights.    3.There are two rectangular black areas below the cutoff area in your field of vision. These too are always in motion with the steering responsive headlights.     These headlights create a variety of safety concerns.  The dark shaded areas result in a reduced clarity of vision in the most needed area; directly in front of the car in the dominant field of vision.    The jagged irregular moving cutoff lines are extremely distracting.  When the lowered dark cutoff areas move across your field of vision, it’s as if something is jumping out in front of the car.  The driver struggles to know if there is an actual need for emergency action or not.   Then perhaps the greatest concern of well being is the two dark moving rectangular boxes below the cutoff lines.  Your eyes fixate on these moving rectangles.  When fixated on these boxes the driver is not giving complete attention to the whole field of vision.   The first time I drove the vehicle at night I became almost completely disoriented and would have had a accident if I had been driving faster than the 20mph under cruise control.  I stopped, got my bearings and drove the last quarter mile home.  I thought I had had a brain seziure.",
        "vin": "JF2SKARC0NH"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/28/2022",
        "dateOfIncident": "02/23/2022",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454529,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "Bought my brand new Forester less a month and i have to replace a windshield already!!!  Discovered about 5 inches crack while warming up the car on the snow day.  Subaru have a glass action agains them about windshield so easily to crack. Service dept refused to replace my windshield because of a super tiny hold that can not be seen by normal eyes, i think it was a damage from crack .   We have a different brand vehicle which has about 10x bigger intake but never cause the crack for year. Now i know the reason why Subaru offer the limited windshield replace program.",
        "vin": "Jf2skanc3nh"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/25/2022",
        "dateOfIncident": "01/24/2022",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454147,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "This is not a specific incident but a serious safety concern with a new vehicle purchased in January 2022. There are three contributing issues to the concern with the vehicle’s headlights: 1.There are two large shaded dark spots directly in your field of vision.  These are approximately fifteen to twenty feet directly in front of the vehicle. 2.The cutoff lines are jagged and irregular with low points dropping down.  These are always in motion with the steering responsive headlights.   3.The most glaring problem is two rectangular black areas below the cutoff area in your field of vision.  These too are always in motion with the steering responsive headlights.  Up close to a wall these are about eight inches wide, but when projecting on the road these grow exponentially to several feet. Note - These matters are most prominent with the low beam headlights.    These headlights create a variety of safety concerns.  The dark shaded areas result in a reduced clarity of vision in the most needed area; directly in front of the car in the dominant field of vision.  The jagged irregular moving cutoff lines are extremely distracting.  When the lowered dark cutoff areas move across your field of vision, it’s as if something is jumping out in front of the car.  The driver struggles to know if there is an actual need for emergency action or not.  Then perhaps the greatest concern of well being is the two dark moving rectangular boxes below the cutoff lines.  Your eyes fixate on these moving  rectangles.  When fixated on these boxes the driver is not giving complete attention to the whole field of vision. This seems to be a design flaw.",
        "vin": "JF2SKARC6NH"
    }
]