[
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/24/2022",
        "dateOfIncident": "02/24/2022",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453945,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "I turn my vehicle on while am waiting to car to get warm i turn on the heat the windshield crack by it self",
        "vin": "4S3GKAM67N3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/11/2021",
        "dateOfIncident": "11/09/2021",
        "fire": true,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440139,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2022",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving on a three-lane parkway commuting to work, and the weather was clear. I was the only person in the vehicle. I left just after 7:40AM I had been driving for about 40 minutes. I had the cruise control ready to be set as I had turned it on briefly earlier in the drive, but it was not turned on at the time. When the cruise control button is pushed and \"ready,\" lane keeping assistance turns on. The dashboard suddenly alerted saying the \"Eyesight Driver Assist\" was not working. Seconds later it said \"check owner's manual\" and then \"check engine.\" Within a few seconds, the car began decelerating quickly. I got over to the right lane, turned on my hazard lights, and then pulled off on the shoulder where the car came to a full stop. I turned the car off and could see smoke coming from under the hood of the car. Within about 10 or 20 seconds, I climbed over the center console and out of the passenger door on the right and began backing quickly away from the car while watching it. The car then started on fire under the hood, and I called 911 immediately. My call to 911 was at 8:26AM. This whole incident--from driving to the start of the fire--occurred within about 1 minute or at most 2 minutes total.   The car is a 2022 Subaru Impreza and was brand new. It had no prior issues or maintenance completed on the vehicle and no maintenance was due. I had the car for less than two months, and it had just over 1000 miles on it. I had never seen any warning lamps, messages, or other symptoms on the car before. I had driven the car home from work the previous day and got home around 7:00PM. This was the first time I had seen any of the warning signs on the dashboard indicated above.  The police department arrived within a few minutes and then the fire department arrived a few minutes after that. The fire spread to the entire vehicle and it was towed. The insurance company (GEICO) and Subaru indicated they will be investigating and inspecting the vehicle.",
        "vin": "4S3GTAB61N3"
    }
]