[
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "09/15/2010",
        "dateOfIncident": "08/01/2009",
        "fire": false,
        "manufacturer": "UNKNOWN MANUFACTURER",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10355859,
        "products": [
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "1992",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 1992 DUCATI 900 SS MOTORCYCLE HAS A DESIGN DEFECT THAT CAUSED THE STEERING TO LOCK UP AND THE MOTORCYCLE TO CRASH.  ON THE TOP TRIPLE CLAMP IS LOCATED THE IGNITION SWITCH / STEERING LOCK ASSEMBLY. IT IS ATTACHED WITH TWO STRANGE LOOKING CONE HEAD TAMPER PROOF BOLTS. THESE BOLTS DO NOT APPEAR TO BE BOLTS AT ALL AND THERE IS NO OBVIOUS WAY TO LOOSEN OR TIGHTEN THEM.   THEY ARE MADE TO BE TAMPER RESISTANT. THE PROBLEM OCCURRED WHEN ONE OF THESE \"BOLTS\" CAME LOOSE UNBEKNOWNST TO ME AND DROPPED INTO THE ALUMINUM WEBBING OF THE LOWER TRIPLE CLAMP. IT BECAME LODGED BETWEEN THE STEERING STOP OF THE FRAME AND THE TRIPLE CLAMP EFFECTIVELY LOCKING THE STEERING IN ONE DIRECTION.  ONLY MINUTES BEFORE I WAS DOING 75 MPH ON THE FREEWAY.  THE STEERING LOCKED ON THE ROAD TO MY HOUSE. NOT BEING ABLE TO STEER THE BIKE  IT  CRASHED. I WAS IN DISBELIEF AS I HAD NO IDEA WHY I COULD NOT TURN THE STEERING AS THIS WAS A VERY UNUSUAL AND UNIQUE CIRCUMSTANCE, ONE THAT I HAD NOT EXPERIENCED IN ALL MY 40 YEARS OF MOTORCYCLE RIDING. UPON LIFTING UP THE BIKE AND CLOSE EXAMINATION I FOUND THIS ODD LOOKING CONE HEAD BOLT SMASHED AND STILL LODGED IN BETWEEN THE STEERING STOPS. LUCKILY I WAS ONLY DOING ABOUT 15 MPH WHEN I CRASHED. I FIRST INFORMED DUCATI VIA THEIR WEBSITE. EVENTUALLY THEY TOLD ME TO INFORM THE LOCAL DUCATI DEALER (ERICO) ABOUT THIS SERIOUS DEFECT. THE DEALER TOLD DUCATI NORTH AMERICA WHO'S RESPONSE WAS \"TOO BAD THERE IS NOTHING WE CAN DO.\"  THIS IS A SERIOUS AND DANGEROUS FLAW IN THE BIKE. MANY THOUSANDS OF THESE BIKES WERE MANUFACTURED AND IT WOULD NOT SURPRISE ME IF THIS COULD OR HAS HAPPEN TO ANOTHER BIKE. THE CRASH COULD BE MUCH MORE SERIOUS. I WAS VERY DISAPPOINTED IN DUCATI'S RESPONSE AS IT SHOWED NO CONCERN FOR THE SAFETY OF THEIR CUSTOMERS. THE DEALER TELLS ME THERE IS NO SAFETY OR SERVICE BULLETIN ABOUT THIS ISSUE. MY BIKE SUFFERED OVER $1000 IN DAMAGE FROM THIS DESIGN FLAW THROUGH NO FAULT OF MY OWN. LUCKILY IT HAPPENED AT 15 MPH AND I WAS NOT SERIOUSLY HURT. *TR",
        "vin": "ZDM1LC4M6PB"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/13/2005",
        "dateOfIncident": "08/06/2005",
        "fire": false,
        "manufacturer": "UNKNOWN MANUFACTURER",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10139614,
        "products": [
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "1992",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT PURCHASED A 1992 TIGER CX MADE BY PROVAN INDUSTRIES.  WHILE DRIVING THERE WAS A SWAY IN THE REAR SUSPENSION AT 60 MPH OR BY STRIKING BUMPS IN THE ROAD.  THE CONTACT THOUGHT THAT THIS WAS CAUSED BY POOR TIRES, AND THE REPAIR SHOP REPLACED THE TIRES AND SHOCKS, AND ADDED AN AIR SUSPENSION SYSTEM .  ALL OF THESE CORRECTIONS DID NOT SOLVE  THE PROBLEM.  AGAIN WHILE DRIVING AT 60 MPH OR HITTING BUMPS THE REAR OF THE VEHICLE SWAYED TO THE LEFT OR RIGHT, DEPENDING ON THE DIRECTION.  THE VEHICLE WAS TAKEN BACK TO  THE  REPAIR SHOP TO INSPECT THE SUSPENSION.  THE REPAIR SHOP COULD NOT DETERMINE THAT THERE WAS ANYTHING MECHANICALLY WRONG.  THE CONTACT  WAS REFERRED TO  OWNERS MANUAL INFORMATION PAGE WHICH STATED THAT  GROSS WEIGHT RATIO OF THE FOUR WHEEL DRIVE HAD A LIMIT OF 8600 POUNDS, AND THE TWO WHEEL DRIVE HAD A LIMIT OF 7200 POUNDS.  THIS VEHICLE WAS A FOUR WHEEL DRIVE.  THE CONTACT CONTACTED THE MANUFACTURER, WHO SAID THEY HAD NO SUCH PROBLEMS.  THE MECHANIC SUGGESTED THAT THE CONTACT TAKE THE VEHICLE TO A TRUCK SCALE AND WEIGH IT.   THE CONTACT TOOK THE  VEHICLE TO  A TRUCK SCALES AND WEIGHED IT,  THE TOTAL WEIGHT WAS  7080 POUNDS WITH FUEL IN THE TRUCK.  THE CONTACT CALLED CHEVROLET BECAUSE   THE CHASSIS WAS MADE BY CHEVROLET.  CHEVROLET PROVIDED A GROSS WEIGHT LIMIT OF 7200 POUNDS AFTER THE CONTACT GAVE THE VIN OF THE VEHICLE. *AK",
        "vin": "1GCFK24K5NE"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/05/2005",
        "dateOfIncident": "07/20/2005",
        "fire": true,
        "manufacturer": "UNKNOWN MANUFACTURER",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131655,
        "products": [
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "1992",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Norcold Inc.",
                "productMake": "NORCOLD",
                "productModel": "REFRIGERATOR",
                "productYear": "1999",
                "type": "Equipment"
            }
        ],
        "summary": "WE RECENTLY LOST OUR CAMP TRAILER TO FIRE CAUSED BY A NORCOLD REFRIGERATOR.  THE FRIDGE HAD BEEN RECALLED AND THE RV REPAIR PLACE INSTALLED THE RECALL KIT AS PER NORCOLD'S INSTRUCTION AND IT BURNED DOWN IN LESS THAN 24 HOURS.  IN DOING RESEARCH ABOUT NOROLD, I SEE THAT THERE HAVE BEEN SEVERAL WRONGFUL DEATH SUITS FILED AND PERSONALLY KNOW FIVE PEOPLE WHO HAVE LOST THEIR CAMPERS BECAUSE OF NORCOLD REFRIGERATORS. I WILL GLADLY PROVIDE SWORN STATEMENTS IF YOU NEED THEM.   OUR INSURANCE COMPANY SETTLED WITH US BUT IT WAS NOT NEAR WHAT IT WILL COST US TO REPLACE THIS CAMPER. THANK GOODNESS WE HAD NOT ALREADY PICKED IT UP AND LEFT ON OUR TRIP. I HAVE PICTURES TO SHOW WHAT HAPPENED - BEFORE AND AFTER.  NORCOLD WILL NOT TAKE RESPONSIBILITY FROM ALL I HAVE SEEN ON THE INTERNET AS WELL AS SPEAKING TO OTHER PEOPLE WHO HAVE LOST THEIR CAMPERS DUE TO THIS PROBLEM. HOW MANY PEOPLE HAVE TO DIE BEFORE THOSE PEOPLE WILL BE MADE TO STOP MAKING THAT REFRIGERATOR?!?!?!  HOW MANY PEOPLE WILL LOSE THEIR LIFE'S SAVINGS AND COME UP EMPTY HANDED BECAUSE NORCOLD REFUSES TO REPLACE THE CAMPERS THAT THEIR PRODUCT BURNED DOWN?  WE ARE SIMPLE FOLKS AND CANNOT AFFORD AN ATTORNEY SO WE ARE, SIMPLY PUT - SCREWED.  THIS IS WRONG. IF YOU RESEARCH THIS, YOU WILL SEE WHAT I AM TELLING YOU IS THE TRUTH.  JUST GO TO GOOGLE.COM AND TYPE IN \"WRONGFUL DEATH NORCOLD\" OR \"NORCOLD FIRE\".  PLEASE ADVISE ME WHAT, IF ANY, RECOURSE PLAIN ORDINARY PEOPLE HAVE TO PROTECT THEMSELVES AND THEIR LOVED ONES FROM BEING KILLED OR WIND UP STILL PAYING PAYMENTS FOR A CAMPER THAT IS NO LONGER THERE, BECAUSE THESE PEOPLE ARE NOT STOPPED AND TELL YOU, \"TOO BAD.\"   IN FILING THIS COMPLAINT, IT DID NOT HAVE THE OPTIONS I NEEDED TO TELL YOU ABOUT THE MAKE AND MODEL OF THE CAMPER WE JUST LOST - IT WAS A 30 FT ROYAL DUTCHMEN 30FK WITH ALL THE WHISTLES AND BELLS.   THANKS SO MUCH FOR YOUR TIME AND ASSISTANCE.  SIMONE.  *JB",
        "vin": "47CT20P23N1"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "05/14/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "UNKNOWN MANUFACTURER",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10009198,
        "products": [
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "1992",
                "type": "Vehicle"
            }
        ],
        "summary": "PLASTIC FUEL TANK LEAKS AT FILLER NECK/ TANK INTERFACE. FUEL DRIPS ONTO GROUND NEAR REAR LEFT WHEEL. STRONG SMELL OF FUEL FROM INSIDE OF VEHICLE TO THE POINT THAT VEHICLE CANNOT BE DRIVEN WITH WINDOWS ROLLED UP. 2 CRACKS IN THE PLASTIC TANK CAN BE SEEN WHERE FILLER NECK ATTACHES TO THE TANK. VEHICLE WAS NOT INVOLVED IN ANY SORT OF ACCIDENT. SEVERAL OTHER LOTUS ELAN OWNERS REPORT THE SAME PROBLEM: REFER TO HTTP://RET0027H.ERESMAS.NET/LOTUSELANCENTRAL/ARCHIVES/APRIL02MP.HTM.*TS  ***DIMSII IVOQ ENTRY POSTED AFTER 12-12-02 CUT OVER TO ARTEMIS***761907",
        "vin": "SCCGA36B2MH"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/21/2001",
        "dateOfIncident": "11/10/2001",
        "fire": false,
        "manufacturer": "UNKNOWN MANUFACTURER",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 754772,
        "products": [
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "1992",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE HAULING MY HORSE TRAILER, THE FIBERLGLASS ROOF FLEW OFF OF IT IN HEAVY HIGHWAY TRAFFIC (EASTERN SHORE, MD. THROUGH 495, CAPITAL BELTWAY)SOMETIME BETWEEN 5 AND 8 P.M. ON 11/10/01.  MY TRAVEL COMPANION AND I EXPERIENCED NO INDICATION OF THIS OCCURRENCE UNTIL WE STOPPED FOR DINNER. CONTACTED ALL HIGHWAY AND POLICE AUTHORITIES, AND ROOF COULD NOT BE LOCATED.  HAD DAMAGED TRAILER EXAMINED BY LOCAL TRAILER REPAIR AUTHORITY AND THEY SUGGESTED THAT THE MANNER IN WHICH THE ROOF WAS ATTACHED WAS INSUFFICIENT AND DANGEROUS.  I HAVE CONTACTED THE MANUFACTURER, AND THEY CLAIM THAT BECAUSE THE TRAILER IS 9 YO, SUCH AN INCIDENT COULD HAPPEN DUE TO AGE AND WEAR. THE OWNER'S MANUAL MAKES NO INDICATION THAT THE ROOF NEEDS TO BE CHECKED PERIODICALLY FOR POSSIBLE ATTACHMENT PROBLEMS.    I WAS LUCKY THAT NO ONE WAS CRITICALLY INJURED AND THAT I WAS NOT TRANSPORTING HORSES, BUT ONLY SADDLES FROM A HORSE SHOW.  WOULD LIKE TO FIND OUT WHY THERE APPEARS TO BE NO STANDARD FOR TRAILER SAFETY SINCE THIS CASE COULD HAVE RESULTED IN CHARGES AS SERIOUS AS MANSLAUGHTER.   WOULD ALSO LIKE RECOURSE, LEGALLY, FOR DAMAGES INCURRED THUS FAR.  I HOPE SOMEONE WILL CONTACT ME TO DISCUSS THIS MATTER.  THANK YOU.*AK",
        "vin": "UH233N407NN"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/23/2001",
        "dateOfIncident": "02/12/1995",
        "fire": false,
        "manufacturer": "UNKNOWN MANUFACTURER",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 748964,
        "products": [
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "1992",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD GLASS TOO SMALL FOR HOLE, CUT BY FACTORY, WINSHIELD FALLS OUT.*AK",
        "vin": "4CDJ46M2XN2"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/08/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "UNKNOWN MANUFACTURER",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 738970,
        "products": [
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "1992",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PULLING OUR 20 FT. BOAT ON A 3 HOUR TRIP AT DUSK WE HEARD A LOUD NOISE.  IT WASN'T TILL THE NEXT MORNING AFTER PULLING THE BOAT OUT OF THE WATER THAT WE SAW THAT THE TIRE HAD HALF OF THE TREAD GONE.  AT FIRST IT LOOKED AS THOUGH IT WAS A RECAP BUT REALIZED THAT IT WAS A NEW TIRE FROM THE FACTORY.  WHEN ALL THE FIRESTONE INFO CAME OUT WE FELT THAT THIS TIRE AND THE OTHER 3 THAT ARE STILL ON OUR TRAILER ARE PART OF THE SITUATION AT HAND, BUT HAVE BEEN TOLD BY TIRE STORES THAT OURS ARE NOT ON THE RECALL.  WE STILL HAVE THE TIRE THAT BLEW.  HAVE PUT A SPARE TIRE ON AND THE OTHER 3 TIRES ARE STILL ON.  PLEASE CONTACT US SO WE CAN REST EASY.  *AK (DOT NUMBER: VERJT1B121  TIRESIZE: G78-14 ST)",
        "vin": "1MDBK5R14NG"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/02/2001",
        "dateOfIncident": "07/01/1992",
        "fire": false,
        "manufacturer": "UNKNOWN MANUFACTURER",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 738623,
        "products": [
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "1992",
                "type": "Vehicle"
            }
        ],
        "summary": "OK HERE IS THE PROBLEM AND HAS BEEN THE PROBLEM ALL ALONG. I COULD NEVER TOW ANTHING AT ALL THE VEHICLE WOULD BE ALL OVER THE ROAD. I CANNOT PUT A 62 LB BOX OF MUD IN THE BACK OF THE VEHICAL BECAUSE IT FISHTAILS ALL OVER THE ROAD. I TRIED TO LEARN TO LIVE WITH IT I HAVE BEEN VERY LUCKY IN WINTER IT IS VERY SCARY. I EVEN PUT HAEAVY DUDY AIR SHOCKS ON IT BUT THAT DID NOT STOP IT FROM FISHTAILING WITH ANY WEIGHT IN THE BACK. IF YOU GO OUT AND GET ANY DODGE RAM CHARGER PUT A BUCKET OF DRYWLL MUD OR 2 IN THE BACK AND DRIVE DOWN THE HIGHWAY.  *AK",
        "vin": "3B4GM17Y0MM"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/29/2000",
        "dateOfIncident": "09/17/2000",
        "fire": false,
        "manufacturer": "UNKNOWN MANUFACTURER",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 732837,
        "products": [
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "1992",
                "type": "Vehicle"
            }
        ],
        "summary": "TREAD SEPARATED FROM THIS TIRE AND DAMAGED THE WHEEL WELL STRUCTURE.  *AK (DOT NUMBER: A3HH1DL207  TIRESIZE: ST22575R15)",
        "vin": "1EE5M3529N9"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/25/1999",
        "dateOfIncident": "07/15/1999",
        "fire": false,
        "manufacturer": "UNKNOWN MANUFACTURER",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 710494,
        "products": [
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "1992",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADGASKETS WERE REPLACED BY DEALER. AFTER 10 MILES OF DRIVING, THE ENGINE LIGHT CAME ON, KNOCKING SOUND WAS HEARD AND THERE WAS A BURNING ODOR. ENGINE BEARINGS HAD BURNT OUT DUE TO ANTIFREEZE CONTAMINATING THE ENGINE OIL. CAR WAS JUNKED. STILL CONTESTING ORIGINAL REPAIR BILL OF $1,896.",
        "vin": "1MECM534XNA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/02/1999",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "UNKNOWN MANUFACTURER",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 709482,
        "products": [
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "1992",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SHIFTS HARD OUT OF 1ST GEAR",
        "vin": "JH4KA7672NC"
    }
]