[
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/18/2018",
        "dateOfIncident": "06/12/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162151,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "1981",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE HAD AN UPPER CONTROL ARM BOLT COME OUT 4 TIMES ON MY CAR CAUSING THE WHEEL TO TUCK UNDER THE CAR. I ALSO HAD A LOWER CONTROL ARM BOLT COME OUT ONCE. I'VE BEEN LUCKY, IT'S ALWAYS HAPPENED WHEN I WAS TURNING AROUND OR GOING SLOW. HOWEVER, THE FIRST TIME IT HAPPENED, I WAS PULLING AWAY FROM THE CURB IN FRONT OF MY HOUSE, AND IT SOUNDED LIKE A ROCK SHOT OUT FROM UNDER THE TIRE. I STOPPED AND TOOK A LOOK AT THINGS AND LOOKED AT THE STREET BUT DIDN'T SEE A IT OR BOLT OR ANYTHING, AND FIGURED IT WAS A ROCK. IT DROVE FINE, GOT ON THE FREEWAY AND MY CAR SEEED TO DRIFT TO THE RIGHT. I GAVE IT A NORMAL SMALL CORRECTION AND SHOT HALF WAY ACROSS THE LANE NEXT TO ME THEN BACK ACROSS MY LANE. LET'S JUST SAY I ALMOST LOST CONTROL OF THE VEHICLE. SCARED ME! NOW I KNOW WHY THEY CALL THEM CONTROL ARMS! I WAS WONDERING IF THE CONTROL ARM BOLTS COMING LOOSE ARE AN INHERENT PROBLEM WITH THESE VEHICLES, BECAUSE I'VE HAD MY CAR FOR ABOUT 15 YEARS AND IT'S BEEN A REAL PROBLEM WITH MINE. VERY DANGEROUS AND I'VE BEEN VERY LUCKY. A COUPLE OF TIMES I JUST GOT OFF THE FREEWAY A FEW MINUTES BEFORE IT CAME APART. ONCE I WAS COMING TO A STOP AT A STOP SIGN WHEN IT HAPPENED. IT FELT LIKE I GOT A FLAT TILL I LOOKED AT MY WHEEL ALL CROOKED ON MY CAR. ONCE PULLING AWAY FROM A CURB. THE OTHER TIMES I WAS GOING SLOW MAKIN A TURN. VERY LUCKY! I DON'T HAVE RECEIPTS FOR THE REPAIRS OR PICTURES. I'VE BEEN LUCKY IT JUST MADE THE WHEEL TUCK UNDER AND DIDN''T DO DAMAGE TO ANYTHING ELSE. BUT IF I HAD BEEN GOING FAST, WHO KNOWS THE DAMAGE IT COULD HAVE CAUSED? I SEE THIS AS SUPER DANGEROUS! I'VE ASKED A MECHANIC IF THE BOLTS COULD BE DRILLED AND A CASTLE NUT AND PIN BE USED TO PREVENT THIS FROM HAPPENING AGAIN? I DON'T REMEMBER THE ANSWER. I HAVE A DIFFERENT MECHANIC WHO HELPS ME WITH MY CAR. I NEED TO ASK HIM WHAT HE THINKS THE BEST SOLUTION TO THIS PROBLEM IS, BECAUSE I'M BEYOND TIRED OF IT. THANKS!",
        "vin": "1G1AY8764BS"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/11/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 753118,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "1981",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE ORIGINAL OWNER OF THIS VEHICLE.  IT HAS BEEN IN STORAGE SINCE 1982 AND HAS 4900 ORIGINAL MILES.  THE VEHICLE IS IN NEW SHOWROOM CONDITION.  I AM NOW PLANNING TO TRANSPORT THE VEHICLE TO FLORIDA AND DIRVE IT ON OCCASION.  I WAS NOTIFIED OF THIS RECALL IN 1983 AND HAVE MISPLACED THE NOTIFICATION DUE TO THE CAR BEING IN STORAGE.  I WOULD APPRECIATE ANY ASSISTANCE IN GETTING THIS RECALL DONE, WORKING WITH A DEALER NEAR WHERE IT IS STORED IN BURLINGTON, VERMONT.  THEY SAY THEY HAVE NO ACCESS TO OBTAINING THIS INFOFRMATION AND UNLESS I CAN PROVIDE THE NOTICE, THEY ARE UNABLE TO HELP ME.  I WOULD LIKE TO ARRANGE THIS FOR EARLY IN NOVEMBER WHEN I RETURN TO VERMONT AND WILL WORK WITH SHEARER CHEVROLET TO ACHIEVE THE BEST SOLUTION POSSIBLE.   NO SAFETY DEFECT MENTIONED. *AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/26/1998",
        "dateOfIncident": "12/15/1997",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 821063,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "1981",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL TANK WHICH IS MADE OF A STEEL OUTER SHELL WITH AN INNER LINER OF HIGH DENSITY POLYETHYLENE DEVELOPED A CRACK IN BOTH FRONT LOWER CORNERS. THIS PERMITTED FUEL  TO ENTER BETWEEN THE STEEL TANK AND THE LINER. THE CONDENSATION IN THE FUEL RUSTED THE OUTER TANK, RESULTING IN A FUEL LEAK.  *AK",
        "vin": "1G1AY876185"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/26/1998",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 529765,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "1981",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL TANK'S PLASTIC LINER CRACKED IN THE FRONT LOWER CORNERS CAUSING THE FUEL TANK'S OUTER STEEL SHELL TO RUST AND CAUSE A LEAK.",
        "vin": "1G1AY876185"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/26/1998",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 529766,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "1981",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL TANK'S PLASTIC LINER CRACKED IN THE FRONT LOWER CORNERS CAUSING THE FUEL TANK'S OUTER STEEL SHELL TO RUST AND CAUSE A LEAK.",
        "vin": "1G1AY876185"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/26/1998",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 529786,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "1981",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL TANK'S PLASTIC LINER CRACKED IN THE FRONT LOWER CORNERS CAUSING THE FUEL TANK'S OUTER STEEL SHELL TO RUST AND CAUSE A LEAK.",
        "vin": "1G1AY876185"
    }
]