[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/09/2015",
        "dateOfIncident": "02/17/2015",
        "fire": false,
        "manufacturer": "Utility Trailer Manufacturing Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10693035,
        "products": [
            {
                "manufacturer": "Utility Trailer Manufacturing Company",
                "productMake": "TRAILERS",
                "productModel": "FLATS",
                "productYear": "1994",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Sailun Tire Americas, Inc.",
                "productMake": "TOWMAX STR",
                "productModel": "ST",
                "productYear": "9999",
                "size": "ST225/75 R15",
                "type": "Tire"
            }
        ],
        "summary": "IN JUNE OF 2014 WE PURCHASED 8 235/85R 16 TRAILER TIRES FROM LES SCHWAB TIRE CENTER-FIFE, WA. (SHAUB-ELLISON CO. DBA LES SCHWAB TIRE CENTER OF FIFE, WA. WE WERE \"UPGRADED AND UP-SOLD\" TO THE TOXMAX BRAND TRAILER TIRE AT 235/85R 16; 8 TIRES FOR $1298.00.  WITHIN APPROXIMATELY 2000 MILES WE HAD A CATASTROPHIC TREAD SEPARATION AS WE RETURNED EMPTY TO OREGON TO MOVE.  WE TOOK IT AS A ROAD HAZARD REPLACED THE TIRE IN TEXAS AND RETURNED THE BLOWN CASING TO LES SCHWAB MADRAS OREGON FOR ANY CREDIT.    IN FEBRUARY 2015 WE TRAVELED TO TEXAS FROM OREGON WITH SOME HOUSEHOLD ITEMS AND AN EMPTY CONTAINER. APPROXIMATE MILEAGE ON THE TIRES WAS 6000 MILES.  WITH IN 500 MILES OF OUR DESTINATION WE BEGAN TO EXPERIENCE ADDITIONAL TIRE FAILURES FOR AN END RESULT OF 3 TIRES CATASTROPHICALLY FAILING AND ONE TIRE NEARLY HITTING A MERCEDES SUV UPON THE FAILURE.  UPON ONE TIRE FAILING THE TIRE ADJACENT ON THE AXLE BEGAN TO DO THE SAME AND SHOWED IRREGULAR TIRE WEAR AND TREAD/SIDEWALL BLISTERING.  WHEN WE FINALLY ARRIVED HOME WE FOUND TO HAVE 6 TIRES OF THE PURCHASED SET UN-SERVICEABLE AND/OR HAD COMPLETELY FAILED.     LES SCHWAB HAS STOOD ON \"IF WE CANT GUARANTEE IT WE WONT SELL IT\" A NO FAULT TIRE WARRANTY AND THE TOWMAX TIRE WARRANTY.  THE REMAINING TIRE HAS 6/32 OF THE ORIGINAL 10/32 TREAD DEPTH. TOWMAX WARRANTS THE TIRES UP TO 2/32.  I HAVE TRIED TO RESOLVE THE ISSUE WHICH I BELIEVE ARE INFERIOR AND/OR DEFECTIVE TIRES SOLD BY LES SCHWAB.  ON THURSDAY MARCH 5TH, 2015 I ASKED BY REGISTERED EMAIL A MEDIATED REMEDY AND ASKED FOR AN ANSWER BY FRIDAY COB AS WE HAD BEEN TRYING TO RESOLVE FOR OVER TWO WEEKS.  THEY FAILED TO RESPOND WITH ANY RESOLUTION.     THERE ARE 100'S IF NOT 1000'S OF COMPLAINTS OF THIS TIRE BRAND AND SIZE DISTRIBUTED BY TBC OF FLORIDA.  I BELIEVE TO HAVE 4 OUT OF 8 TIRES TO SEPARATE UNDER NORMAL USE IS A FLAG FOR FURTHER INVESTIGATION.  I HAVE 3 MORE OF THE 8 TIRES BEGINNING TO SEPARATE.    THEY BEGIN WITH BECOMING OUT OF ROUND AND THEN BLISTER WITH A FINAL TREAD SEPARATION.  *TR",
        "vin": ""
    }
]