[
    {
        "components": "ELECTRONIC STABILITY CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "05/03/2020",
        "dateOfIncident": "04/14/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323115,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "YEA THE VEHICLE WAS PURCHASED SEPTEMBER 2019 @185K MILES AND STARTED HAVING PROBLEMS AROUND APRIL 2020 @ 250K MILES MY , THIS MONTH AFTER DRIVING FOR ABOUT AN HOUR YOU COULD SAY , MY CAR OVER HEATED AND THE BATTERY AND ELECTRICITY SENSORS AND SUCH STOPPED WORKING WHICH CAUSES ALL MY LIGHTS TO COME ON MY DASH INCLUDING MY ENGINE LIGHT SO I HOPE THE BATTERY DOESN'T CAUSE MY CAR TO BARELY SWITCH GEARS OR IDLE UNLOCK THE GASKET HAS BLOWN BUT I DON'T EVEN DRIVE FAST SO PLS HELP  , THE RESERVOIR WAS SHOOTING WATER AND STEAM AND I LOOKED UP RECALLS RECENTLY AND SAW THAT THERE WERE 2 ON THESE SO I WAS HOPING COULD I GET A REPLACEMT OR REPAIRMANT ? I'M GOING THROUGH THE MOVING PROCESS SO I'D NOW SOME TYPE OF TRANSPORTATION PLEASE",
        "vin": "JH4UA3657TC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/19/2014",
        "dateOfIncident": "08/02/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10637525,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS HEADED UP A HILL WHEN I PULLED OVER TO THE SIDE OF THE ROAD TO LET AN EMERGENCY VEHICLE PASS. WHEN I ATTEMPTED TO REENTER TRAFFIC, THERE WAS A LOUD BANG, SOME GRINDING NOISE, AND A JOLT AS THE VEHICLE BEGAN TO ROLL BACKWARDS. I WAS STARTLED WHEN I IMMEDIATELY PLACED THE VEHICLE IN PARK BUT IT CONTINUED TO ROLL DOWN HILL. THEN I ENGAGED THE PARKING BRAKE, (I NEVER USE THE PARKING BRAKE DUE TO AN UNFORTUNATE HAPPENING IN THE PAST WITH A DIFFERENT VEHICLE). I ATTEMPTED TO PUT THE VEHICLE IN DRIVE, THINKING THE TRANSMISSION NEEDED ONLY TO RESET ITSELF WHEN A LOUD GRINDING NOISE BEGAN TO EMANATE FROM THE UNDERSIDE OF THE VEHICLE, ALONG WITH SMOKE COMING FROM MY HOOD. AT THAT POINT, I LEFT THE VEHICLE THERE AND HAD IT TOWED TO A SHOP WHERE I WAS INFORMED THAT THE DIFFERENTIAL HAD SOMEHOW BECOME DISENGAGED FROM THE TRANSMISSION.   *TR",
        "vin": "JH4UA2650TC"
    },
    {
        "components": "STEERING,AIR BAGS,WHEELS",
        "crash": true,
        "dateComplaintFiled": "01/07/2014",
        "dateOfIncident": "05/11/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10558754,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "MAY 2013, ON A STRAIGHT ROAD, AT 8:55PM.  MOTORIST TRAVELING TOWARDS ME SPEEDING WITH BRIGHT LIGHTS ON.   MOTORIST MADE CONTACT WITH MY CAR ON PASSENGER SIDE FENDER AND DOOR.  MOTORIST HIT AND RAN AND LATER TOLD POLICE SHE THOUGHT SHE HIT AN OBJECT.    AT THE TIME OF IMPACT THERE WAS A LOUD EXPLOSION AS THE AIRBAGS DEPLOYED, DARKNESS, AN AWFUL SMELL, SMOKE, I COULD NOT SEE, I LOST CONTROL OF THE CAR AS THE CAR VEERED ACROSS THE STREET TO ON- COMING TRAFFIC.  I THOUGHT I HAD DIED, BUT AS THE CAR STOPPED IN THE GRASS, I FELT THE BRAKES AND REALIZED I HAD NOT DIED.  I EXIT THE CAR COUGHING AS MY CHEST FELT LIKE IT WAS ON FIRE, I COULD BARELY SEE, MY EYES WERE BURNING, THEN I REALIZED I WAS HIT.  NEIGHBORS CAME AND OFFERED TO HELP; I TOLD THEM THAT I WAS NOT FEELING ANY PAIN, YET  .  AFTER EFFECTS:  BURN ON BOTH FOREARMS, RIGHT SIDE OF FACE FELT LIKE SOMEONE SLAPPED WITH AN OBJECT-LIKE A HOT BATH TOWEL, FEELING OF DUST IN MY EYES, WATERY EYES, LOSS OF TASTE OF FOOD, CONSTANT TIREDNESS, FEELING LETHARGIC EVEN 9 MONTHS LATER, SEVERE PAIN AND NUMBNESS IN RIGHT LEG AND RIGHT ARM, LOWER BACK PAIN NOT SEVERE, THE URGE TO KEEP MY EYES CLOSE, CANNOT REMAIN ASLEEP FOR EXTENDED PERIOD, AND WHEN I WAKE I WANT TO KEEP MY EYES CLOSE, THREE TIMES DID NOT GO TO WORK BECAUSE MY HEART PALPITATING ALL DAY LIKE I AM HAVING AN HEART ATTACK, USED A CAKE BECAUSE I WAS LIMPING.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/27/2007",
        "dateOfIncident": "08/24/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10200900,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1996 ACURA 2.5 TL.  THE VEHICLE WAS SERVICED AT THE REPAIR SHOP FOR A DEAD BATTERY.  THE REPAIR SHOP ADVISED THAT THE VEHICLE WOULD NOT SHIFT INTO GEAR.  THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN ID 99V227000 (POWER TRAIN: AUTOMATIC TRANSMISSION).  THE CURRENT AND FAILURE MILEAGES WERE 56,569. RETURNED USPS, 2ND ATTEMPT MADE 07/24/07 FAILED. *LJ ,",
        "vin": "JH4UA2654TC"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "01/10/2007",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10178547,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "1996 ACURA SEAT BELT DIDN'T LOCK AND AIR BAG DIDN'T DEPLOY DURING ACCIDENT**CC  THE CONSUMERS WIFE HIT A TREE AND CONSEQUENTLY HER HEAD WENT OVER THE STEERING WHEEL AND HIT THE WINDSHIELD. *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/04/2006",
        "dateOfIncident": "04/03/2006",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10154565,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "GOT ESTIMATE FROM DEALER FOR 2600.00 DOLLARS FOR MECHANICAL REPAIR ON A FREE 41 POINT INSPECTION.  TOOK CAR TO ANOTHER SHOP AND HAD REPAIRED FOR 119.00 DOLLARS.  *NM",
        "vin": "JH4UA3653TC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/04/2005",
        "dateOfIncident": "09/26/2005",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10138534,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "2.  *NM",
        "vin": "JH4UA2656TC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/07/2005",
        "dateOfIncident": "09/20/1999",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135757,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PROBLEM IS: AT CERTAIN COMBINATIONS OF RPM AND SPEED, THE ENGINE LABORS. IT CAUSES EXCESSIVE VIBRATIONS, WHICH CONTINUE UNTIL EITHER THE SPEED OR RPM IS CHANGED. IT IS NOT RELATED TO TRAVELING UP OR DOWN AN INCLINE. TAKEN TO ACURA DEALERSHIP SEVERAL TIMES AND THEY STATED THEY WERE UNABLE TO REPRODUCE THE PROBLEM BUT NOTED THAT IT SHIFTED HARD ON 1-2 UPSHIFT AND FLUSHED THE TRANSMISSION SYSTEM.  THIS DID NOT FIX THE VIBRATION.  WHEN I TOOK THE CAR BACK IN FOR SAME PROBLEM THEY STATED THE FRONT BRAKE ROTORS WERE WARPED AND REPLACED FRONT BRAKE ROTORS AND PADS.  TOOK CAR BACK TO DEALERSHIP WITH SAME PROBLEM AGAIN AND THE TIRES WERE THEN BALANCED.  PROBLEM CONTINUED SO I DETERMINED THEY COULDN'T FIND THE PROBLEM AND GAVE UP. *JB",
        "vin": "JH4UA3654TC"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/03/2005",
        "dateOfIncident": "05/21/2005",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10124751,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "1996 ACURA TL WINDSHIELD WIPERS FAILED ON THE VEHICLE.*MR  THE WIPER MOTOR HAS BEEN REPLACED TWICE.  THIS WIPER FAILURE RESULTED  IN POOR VISIBILITY WHILE DRIVING IN RAIN.  *NM",
        "vin": "JH4UA2649TC"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/09/2004",
        "dateOfIncident": "06/21/2004",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10086449,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 1996 ACURA 3.2 TL HAS 40,000 MILES ON IT.  ABS LIGHT CAME KEPT COMING ON. BRAKE FLUID WAS ADDED, WHICH RESOLVED THE PROBLEM FOR A FEW DAYS.  THE CAR WAS TAKEN TO THE LOCAL ACURA DEALER, JERRY DAMSON HONDA/ACURA AND WAS CHECKED OUT.  ACCORDING TO THE SERVICE DEPT., THE ABS MODULATOR WOULD NEED TO BE REPLACED, A COST OF APPROXIMATELY $2100 - THEY DID DRAIN AND BLEED THE ABS SYSTEM BUT THAT ONLY SOLVED THE PROBLEM FOR ABOUT 2 MONTHS.  THE DEALER IS NOT INCLINED TO RESOLVE THIS PROBLEM TO EVERYONE'S SATISFACTION, AS THE CAR IS OUT OF WARRANTY AS TO ITS AGE, NOT NECESSARILY MILEAGE.  THIS IS A SAFETY FEATURE, AND A PRODUCT THAT MUST BE REASONABLY DURABLE, AND THIS FAILURE OCCURRED LONG BEFORE IT SHOULD HAVE.  AS THIS IS A MAJOR SAFETY FEATURE, AND THE ABS SYSTEM IS TIED TO THE TRACTION SYSTEM, ITS FAILURE TO OPERATE PROPERLY MAY HAVE SERIOUS CONSEQUENCES.  OUR RESEARCH HAS SHOWN THAT MOST OWNERS SIMPLY DISCONNECT THE SYSTEM AS THE COST TO FIX IT IS EXORBITANT.  ACCORDING TO THE SERVICE DEPARTMENT, THEY SEE THE FAILURE OF THE ABS SYSTEMS ON THIS YEAR OF CAR MORE IN CARS THAT ARE DRIVEN IN A REASONABLE MANNER.*AK",
        "vin": "JH4UA3658TC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/16/2004",
        "dateOfIncident": "06/16/2004",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10079289,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT ANY SPEED  VEHICLE  OVERHEATED. VEHICLE WAS TAKEN TO THE DEALERSHIP, AND MECHANIC DETERMINED THAT THE INTAKE MANIFOLD CRACKED AND COOLANT SPILLED INSIDE THE ENGINE. *AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/07/2004",
        "dateOfIncident": "11/19/2003",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10052562,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS LETTER WAS SENT TO ACURA: HAVE A 1996 ACURA 2.5 TL THAT WAS PURCHASED AT RADLEY ACURA.  MY VIN # [XXX].  I NOW KNOW THAT THERE WAS A RECALL AND SAW THAT AN ACURA 2.5 TL  VIN # [XXX] COLLAPSED DUE TO THE LOWER JOINT BREAKING ON MAY 22, 2003.  I HAD TO REPLACE MY LOWER BALL JOINTS ON THE FRONT OF MY CAR  ON 11/19/2003.    AS I DROVE INTO THE CAR DEALERSHIP, I WAS NOT DRIVING ON A ROUGH ROAD SURFACE.  I MENTIONED NOTHING ABOUT DRIVING ON A ROUGH ROAD SURFACE. MY CAR WAS MAKING A VERY LOUD NOISE WHEN I DROVE INTO THE SURFACE AREA.  FOR THE PAST 3 YEARS I TOLD THE RADLEY DEALERSHIP ABOUT THE NOISE IN MY PASSENGER FRONT SUSPENSION.  EACH TIME THEY TOLD ME THEY WOULD LUBRICATE THE AREA BECAUSE THE BUSHINGS NEEDED LUBRICATION.  NO ONE EVER TOLD ME THAT THEY WOULD CHECK THE BALL JOINTS.  PAM VAUGHAN (ACURA SERVICE ADVISOR) SHOULD REMEMBER THAT MY VEHICLE WAS LUBRICATED BECAUSE I TALKED WITH HER EACH TIME I HAD THE PROBLEM. AT THIS TIME MY CAR WAS STILL UNDER WARRANTY BECAUSE I HAD PURCHASED AN EXTRA 3-YEAR WARRANTY ON THE CAR.   I DID HAVE A PROBLEM WITH A NOISE IN MY FRONT SUSPENSION AS EARLY AS 7/22/96 (SEE RECEIPT).  RADLEY SAID THEY JUST TIGHTENED THE SUSPENSION.     THE DEALERSHIP DID NOT HAVE THE PARTS TO REPLACE THE BALL JOINTS AND THEY DID NOT HAVE A LOANER CAR TO GIVE ME SO THAT I COULD LEAVE THE CAR.  NOT UNTIL I READ THE RECALL NOTICE AFTER THE REPAIR THAT 124,875 CARS WERE RECALLED THAT I REALIZED THAT I SHOULD NOT HAVE DRIVEN THAT CAR HOME BECAUSE THE BALL JOINT COULD HAVE SEPARATED CAUSING THE FRONT SUSPENSION TO COLLAPSE AND STEERING CONTROLLABILITY TO BE REDUCED.  THE DEALERSHIP SHOULD HAVE INFORMED ME OF THIS.*AK   UPDATED 07/30/2012 *JS    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "JH4UA2656TC"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/04/2003",
        "dateOfIncident": "04/20/1999",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10025426,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED AN 1996  ACURA 2.5 TL IN OCTOBER OF 1998 AND I HAVE NEVER RECEIVED A RECALL NOTICE OF ANY KIND FOR THIS VEHICLE. MY ADDRESS HAS BEEN THE SAME FOR THE LAST 9 1/2 YEARS. THE ONLY PERSONAL INFORMATION  THAT HAS CHANGED IS MY LAST NAME, FROM WASHINGTON TO GORDON WHICH CHANGED JULY 13, 2002.  *AK",
        "vin": "JH4UA2651TC"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/24/2003",
        "dateOfIncident": "05/22/2003",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10019211,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 1996 ACURA 2.5TL. A COUPLE DAYS AGO WHILE DRIVING MY PASSENGER SIDE WHEEL COLLAPSED DUE TO THE LOWER BALL JOINT BREAKING. I CONDUCTED RESEARCH TO SEE IF THERE HAD BEEN A RECALL ON THAT PART ,AND IN FACT THERE WAS. THE PROBLEM IM FACING IS THAT IT ONLY COVERED CERTAIN VEHICLES WITH CERTAIN VIN NUMBERS([XXX].... THROUGH [XXX]...)MY VIN # IS [XXX]. I UNDERSTAND THAT MY VEHICLE DOESN'T FALL WITHIN THOSE NUMBERS BUT I EXPERIENCED THE SAME PROBLEM AND DON'T THINK I SHOULD HAVE TO PAY IF IN FACT THIS IS THE SAME DEFECT THAT HAPPENED TO ALL THOSE OTHER VEHICLES.   *NLM    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "JH4UA2656TC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/13/2002",
        "dateOfIncident": "06/19/2002",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000110,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A LOUD GROWLING SOUND COMING FROM THE ENGING COMPARTMENT OF MY 1996 ACURA 2.5 TL. THE DEALER INFORMED THAT IT IS A CRACKED MANIFOLD AND HE HAS SEEN IT MANY TIMES BEFORE. HOWEVER, THEY STILL DID NOT OFFER TO SUBSIDIZE THE REPAIR IN ANY WAY. I WOULD THINK THAT AN EXHAUST MANIFOLD SHOULD NOT CRACK THIS EARLY IN THE LIFE OF THE CAR. WHAT IS EVEN WORSE, IS IT IS KNOWN PROBLEM AND THE MANUFACTURER IS DOING NOTHING ABOUT IT. THE MANIFOLD IS THE SAME AS THAT FROM THE OLD ACURA VIGOR'S. I WOULD THINK THE MANUFACTURER WOULD HAVE FIXED THE PROBLEM BY NOW. I SINCERELY HOPE THE MANUFACTURER CORRECTS THIS PROBLEM, ESPECIALLY AS IT MAY POSE A FIRE HAZARD.",
        "vin": "JH4UA2642TC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/21/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 769998,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FOLLOWING PROBLEM WAS REPORTED TO THE DEALER 35 DAYS AFTER IT WAS PURCHASED, BUT WE WERE TOLD THERE WAS NO PROBLEM.  THE DEALER NEVER LOOKED AT THE VEHICLE.  THE SERVICE MANAGER MADE THAT DETERMINATION BASED ON OUR DESCRIPTION OF THE PROBLEM.  THE PROBLEM IS:  AT CERTAIN COMBINATIONS OF RPM AND SPEED, THE ENGINE LABORS.  IT CAUSES EXCESSIVE VIBRATIONS, WHICH CONTINUE UNTIL EITHER THE SPEED OR RPM IS CHANGED.  IT IS NOT RELATED TO TRAVELING UP OR DOWN AN INCLINE.  WE'VE HAD THREE SEPARATE DEALERS LOOK AT IT, BUT NONE WERE ABLE TO FIND WHAT WAS WRONG.  THEY ALL AGREED, THERE WAS SOMETHING WRONG.  WE WOULD LIKE THE ORIGINAL DEALER TO FIX THE PROBLEM, SINCE WE IDENTIFIED SO SOON AFTER PURCHASING IT.  THANK YOU.  DT",
        "vin": "JH4UA3652TC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/12/2002",
        "dateOfIncident": "04/10/2000",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8011637,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING  VEHICLE SHUTDOWN, AND LOST CONTROL.*AK",
        "vin": "TJH4UA3652T"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/30/2000",
        "dateOfIncident": "09/10/1999",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 735484,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "ACURA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT BALL JOINTS MAKING NOISES.  RECALL WAS FROM CARS BUILT PRIOR TO AUG, 1995 BUT THIS CAR WAS BUILT IN SEPTEMBER OF 1995.  THE DEALER REFUSED TO INVESTIGATE OR TO HONOR RECALL AND NOW THE BALL JOINTS ARE NOISY AND THE CAR UNSTABLE AT HIGHER SPEEDS.  CA.  *AK",
        "vin": "JH4UA2642TC"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/06/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 730390,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "ACURA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SUMMARY LISTED FOR ABOVE VEHICLE.  *AK",
        "vin": "JH4KA9651TC"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/06/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 730390,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "ACURA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SUMMARY LISTED FOR ABOVE VEHICLE.  *AK",
        "vin": "JH4KA9651TC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/20/2000",
        "dateOfIncident": "07/20/2000",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 725715,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "ACURA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SPECIFIC PROBLEM I AM EXPERIENCING IS A CRACK IN THE EXHAUST MANIFOLD.  IN SPEAKING WITH THE DEALERSHIP THEY CONFIRMED THAT THIS IS A COMMON PROBLEM WITH THIS PARTICULAR CAR MODEL.  THEY STATED THAT THEY HAD RECEIVED MULTIPLE VEHICLES WITH THIS PROBLEM.  THIS IS A TWO PIECE EXHAUST MANIFOLD AND IT IS MY UNDERSTANDING THAT THE SPLIT IS OCCURING ALONG THE SEAM OF THE TWO PIECES.  THEY STATED THAT THIS IS A FIRE HAZARD, YET NO RECALL HAS BEEN MADE BY THE MANUFACTURER.*AK",
        "vin": "JH4UA265XTC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/09/1999",
        "dateOfIncident": "08/08/1999",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 844633,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN THE ROAD WITH NO IMPACT, AND BOTH AIRBAGS DEPLOYED. CONSUMER CONTACTED DEALER  *AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/05/1999",
        "dateOfIncident": "11/11/1998",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 547825,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "ACURA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "POSSIBLE RECALL COMPONENT FAILURE (99V-069) CAUSING VEHICLE ROLL OVER ACCIDENT, PRIOR TO RECALL NOTICE. MJS",
        "vin": "JH4K49657VC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/01/1998",
        "dateOfIncident": "06/01/1996",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 605251,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR BUMPER IS LOOSE.  QCAW",
        "vin": "JH4UA265OTC"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/29/1998",
        "dateOfIncident": "05/15/1998",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 824786,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER HAS BEEN  EXPERIENCING BRAKE DEFECTS. EVERY EIGHT MONTH OR LESS CONSUMER HAD TO HAVE BRAKE REPAIRS DONE. EVERY REPAIR WORK WAS DONE BY THE DEALER AT COST TO THE CONSUMER. *AK",
        "vin": "PLEASE FILL"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "11/01/1997",
        "dateOfIncident": "02/01/1996",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 603579,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO/CD PLAYER FAILED.",
        "vin": "JH4UA2647TC"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/01/1997",
        "dateOfIncident": "02/01/1996",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 603579,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDOW REGULATOR FAILED.",
        "vin": "JH4UA2647TC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/01/1997",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 603438,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVE LINE WHINES UPON ACCELERATION OR DECELERATION.",
        "vin": "JH4UA365XTC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/01/1997",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 603438,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "IGNITION SWITCH REPLACED DUE TO BUZZING NOISE.",
        "vin": "JH4UA365XTC"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/06/1997",
        "dateOfIncident": "04/21/1997",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 812021,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE FRONT PASSENGER'S SIDE WINDOW SHATTERED, CAUSE UNKNOWN.  *AK",
        "vin": "JH4KA9655TC"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/10/1997",
        "dateOfIncident": "04/01/1996",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 603074,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR BRAKE PADS WORN.",
        "vin": "JH4UA2652TC"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/10/1997",
        "dateOfIncident": "12/27/1996",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 603077,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR BRAKES FAILED.",
        "vin": "JH4UA2640TC"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "04/10/1997",
        "dateOfIncident": "10/01/1996",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 603092,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUNK LOCK INOPERATIVE.",
        "vin": "JH4UA2658TC"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/21/1996",
        "dateOfIncident": "05/01/1996",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 510295,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "ACURA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE CD PLAYER.",
        "vin": "JH4UA2653TC"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/19/1996",
        "dateOfIncident": "01/01/1996",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 503569,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "ACURA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "SEAT BELTS IN REAR SEAT CAN'T BE USED BY AN ADULT AS THE MALE AND FEMALE ENDS ARE TOO CLOSE TOGETHER AND THEREFORE DO NOT FIT. *DSH",
        "vin": "JH4UA3658TC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/02/1996",
        "dateOfIncident": "03/27/1996",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 982241,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "ACURA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE GRADUALLY ENTERING DRIVEWAY, VEHICLE ACCELERATED, PUSHING TRUCK PARKED IN DRIVEWAY INTO GARAGE DOOR AND PUSHING ANOTHER VEHICLE. PLEASE DESCRIBE.  *AK",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/12/1996",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 980586,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "ACURA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR BUMPER CRACKED IN CENTER SHOWING STIROFOAM. PLEASE DESCRIBE DETAILS.    *AK",
        "vin": "JH4UA3651TC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/12/1996",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 980586,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "ACURA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR BUMPER CRACKED IN CENTER SHOWING STIROFOAM. PLEASE DESCRIBE DETAILS.    *AK",
        "vin": "JH4UA3651TC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/12/1996",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 980586,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "ACURA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR BUMPER CRACKED IN CENTER SHOWING STIROFOAM. PLEASE DESCRIBE DETAILS.    *AK",
        "vin": "JH4UA3651TC"
    }
]