[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/21/2008",
        "dateOfIncident": "03/11/2008",
        "fire": false,
        "manufacturer": "SAFARI MOTOR COACHES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10239180,
        "products": [
            {
                "manufacturer": "SAFARI MOTOR COACHES, INC.",
                "productMake": "BEAVER",
                "productModel": "PATRIOT",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "1.  ACCORDING TO THE REPAIR FACILITY, THE FRAME FAILURE WAS THE RESULT OF THE FRAME BEING UNDER ENGINEERED.   2.  THIS FRAME FAILURE WILL OCCUR ONLY ONCE AND FOLLOWING IS A QUOTE FROM THE SHOP FOREMAN THAT WAS RESPONSIBLE FOR THE REPAIRS:  \"THIS IS SERIOUS ISSUE. IF THE FRAME HAD FAILED COMPLETELY, ESPECIALLY ON A TURN OR A GRADE, THE AXLE WOULD HAVE COME LOOSE FROM THE FRAME, WITH CATASTROPHIC AND/OR LIFE THREATENING RESULTS.  IF YOU HAVE ONE OF THESE RV'S, I RECOMMEND THAT YOU CHECK IT OUT, OR HAVE IT CHECKED OUT.\"  I HAVE A NAME OF ANOTHER PERSON, RICHARD T. AMES, WHO HAD THE SAME FAILURE.  THERE ARE OTHER SAFETY ISSUES WITH THIS FRAME AND I WOULD ALSO LIKE TO SEND YOU PICTURES AS SUPPORTING EVIDENCE.  3.  THE CRACKS IN THE FRAME WERE REPAIRED AND A 3/8\" PLATE WAS WELDED BETWEEN THE UPPER AND LOWER FRAME TO REINFORCE THE AREA.*TR",
        "vin": "4SLC0DN3XT1"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/28/2006",
        "dateOfIncident": "10/25/2006",
        "fire": false,
        "manufacturer": "SAFARI MOTOR COACHES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10174559,
        "products": [
            {
                "manufacturer": "SAFARI MOTOR COACHES, INC.",
                "productMake": "BEAVER",
                "productModel": "PATRIOT",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE DRIVING 60 MPH UNDER NORMAL ROAD CONDITIONS, THE FRONT PASSENGER SIDE SHOCK ABSORBER FRACTURED.  THERE WAS A NOISE FROM THE RIGHT SIDE OF THE MOTOR HOME PRIOR TO THE INCIDENT.   THE MAKE OF THE MOTORHOME IS BEAVER PATRIOT MOTORHOMES AND THE MODEL WAS SAVANNAH.*AK  THE CONSUMER REPLACED THE SHOCKS THE FIRST TIME HIMSELF. THE CONSUMER STATED THE NOISE RETURNED AND HE DISCOVERED THE SHOCK HAD BROKEN AGAIN AND PULLED AWAY FROM THE FRAME AND FELL TO THE HYDRAULIC HOSE THAT GOES TO THE BRAKES. THE SECOND TIME THE SHOCKS WERE REPLACED BY A DEALER WHO INSTALLED 2 SHOCKS ON EACH SIDE INSTEAD OF ONE. UPDATED 01/09/07.*JB",
        "vin": "4SLC0FN30T1"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/03/1999",
        "dateOfIncident": "07/25/1999",
        "fire": false,
        "manufacturer": "SAFARI MOTOR COACHES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 844196,
        "products": [
            {
                "manufacturer": "SAFARI MOTOR COACHES, INC.",
                "productMake": "BEAVER",
                "productModel": "PATRIOT",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT SHOCKS BROKE OFF AND THE FRAME RAILS SPLIT ABOVE AND BELOW SHOCK BRACKET.  THIS COULD HAVE CAUSED TIRE PUNCTURES AND SHOULD NOT HAVE HAPPENED. *AK",
        "vin": "4SLCOHN32T1"
    }
]