[
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/24/2000",
        "dateOfIncident": "06/16/1998",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 717802,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 1996 BMW M3. FOUR TIMES SINCE IT WAS NEW THE FUEL GAUGE HAS FAILED, AND EACH TIME FUEL SENDERS WERE REPLACED TO GET IT WORKING AGAIN. AS YOU'LL SEE, THE PROBLEM IS WIDESPREAD AMONG BMWS, BUT ONLY IN CALIFORNIA, AND BMW CAN'T OR WON'T SOLVE THE PROBLEM. MY DEALERSHIP'S SERVICE MANAGER (LARRY GORDON) TOLD ME THAT THE PROBLEM IS WELL KNOWN TO BMW DEALERSHIP SERVICE MANAGERS, BECAUSE THEY HAVE COMPLAINED TO BMW ABOUT IT REPEATEDLY, BUT THAT BMW WILL NOT ADDRESS THE PROBLEM. HE SAID THERE IS AGREEMENT THAT THE PROBLEM ONLY AFFECTS CARS IN CALIFORNIA, AND THAT IT IS CAUSED BY SOMETHING IN CALIFORNIA'S FUEL THAT CAUSES THE REPLACED PARTS TO FAIL VERY PREMATURELY. HE SAID BMW WILL NOT SOLVE THE PROBLEM BECAUSE IT ONLY AFFECTS CARS IN CALIFORNIA, AND THAT HE SUSPECTS THAT OTHER COMPONENTS COULD ALSO BE ADVERSELY AFFECTED BY OUR FUEL. LAST WEEK MATT SILVERSTEIN (BMW CUSTOMER SERVICE, 1-800-831-1117, EXT. 35421) TOLD ME, AFTER CHECKING HIS COMPUTER, THAT MY COMPLAINT WAS FULLY RESOLVED BY MY DEALER -- BMW OF SAN DIEGO. WHEN I SAID THAT WAS NOT TRUE -- THAT I WAS DEFINITELY NOT SATISFIED, HE TOLD ME THAT CUSTOMERS MAY ONLY GET COMPLAINTS RESOLVED THROUGH THEIR DEALER, WHO IN TURN COULD CONTACT THEIR ZONE REP. I TOLD HIM THAT MY DEALER HAD GOTTEN NOWHERE WITH BMW IN RESOLVING THIS -- THAT AS FAR AS HE AND OTHER SERVICE MANAGERS KNEW, IT WAS DUE TO AN INCOMPATIBILITY WITH CERTAIN BMW PARTS AND CALIFORNIA'S FUEL. HE REFUSED TO HELP ME. I THEN CONTACTED THE CLARK HOWARD CONSUMER WEBSITE BY E-MAIL. SOMEONE RESPONDED WITH THIS MESSAGE: \"SENDING UNIT (AN ELECTROMECHANICAL DEVICE LOCATED INSIDE THE FUEL TANK) IS A POTENTIAL SAFETY DEFECT. REPORT THEM TO THE NHTSA.\" CAN YOU HELP ME?  *AK",
        "vin": "WBSBG9328TE"
    }
]