[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/02/2017",
        "dateOfIncident": "08/01/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11012424,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 1996 FORD CROWN VICTORIA. THE CONTACT STATED THAT WHILE MAKING A LEFT TURN OFF A DRIVEWAY ONTO A LOT, THERE WAS A LOUD METAL BRAKING NOISE COMING FROM THE FRONT DRIVER SIDE OF THE VEHICLE. THE CONTACT STATED THAT THE FRONT DRIVER SIDE COLLAPSED TO THE GROUND. THE CONTACT NOTICED THE LOWER BALL JOINT DETACHED. THE VEHICLE WAS TOWED TO A PRIVATE INDEPENDENT PARKING LOT WHERE THE CONTACT WAS TO INSPECT THE VEHICLE. THE VEHICLE WAS NOT TAKEN TO A DEALER. THE VEHICLE WAS DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 136,000. *BF  CONSUMER STATED FAULTY RUBBER SEAL WAS DUE TO CORROSION AND MAY HAVE ANOTHER ONE WITH SAME PROBLEM.*JB  *BF",
        "vin": "2FALP74W1TX"
    },
    {
        "components": "STEERING,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/27/2015",
        "dateOfIncident": "06/02/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10786431,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "#1 - I CONSTANTLY HAVE MY ENGINE LIGHT ON AND DURING 2 INSPECTIONS I RECEIVED A SAFETY/EMISSIONS RECALL PRINTOUT, DEFECT # DR-1209 FOR MASS AIR FLOW SENSORS.  BOTH TIMES I HAVE TAKEN IT TO THE LOCAL DEALER AND THEY CLAIMED THERE'S NO RECALL FOR IT.  I JUST NOTICED ON THE NHTSA SITE, THAT RECALLS ONLY GO BACK AS FAR AS 1999.  THEY ALSO SAID THAT SINCE IT'S NO LONGER A \"POLICE OWNED\" VEHICLE, THEY WOULDN'T FIX IT.  # 2 - I HAVE BEEN GETTING A CONSTANT SEVERE FUEL SMELL THAT PERMEATES THROUGH THE CAR WHICH IS EXACERBATED WITH WARM WEATHER AND OR WHEN THE CAR WARMS UP.   #3 - THERE'S A CONSTANT ISSUE OF THE CAR VIBRATING WHEN BEING DRIVEN AT 55 - 60 MPH.",
        "vin": "2FALP71W5TX"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/13/2014",
        "dateOfIncident": "10/18/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10559561,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 1996 CROWN VICTORIA. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 55 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC, WHO DIAGNOSED THAT THERE WAS A SMALL FRACTURED IN THE MANIFOLD. THE VEHICLE WAS NOT REPAIRED. THE CONTACT STATED THAT THE MANIFOLD FAILURE WAS RECURRING. THE MANUFACTURE WAS MADE AWARE OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 150,000.   UPDATED 3/21/14*CN",
        "vin": "2FALP71W3TX"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/13/2014",
        "dateOfIncident": "10/18/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10559562,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 1996 CROWN VICTORIA. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 55 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS MANEUVERED TO THE SIDE OF THE ROAD. THE CONTACT STATED THAT THE MANIFOLD HAD FAILED FOR THE SECOND TIME IN TEN YEARS. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC. THE INDEPENDENT MECHANIC DIAGNOSED THAT THERE WAS A SMALL FRACTURE IN THE MANIFOLD. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURED WAS MADE AWARE OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 150,000.",
        "vin": "2FALP71W3TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/18/2011",
        "dateOfIncident": "10/24/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10436423,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASE MY VEHICLE ON OCTOBER 24TH, 2011 FROM A PRIVATE PARTY WHO SAID, \"THE COOLANT LEAK\", BUT THE VEHICLE OVER HEATED WHEN I DROVE IT HOME LESS THAN 3 MILES AWAY THE HOOD OF MY CAR WAS SMOKING. AFTER TAKING IT TO A LOCAL MECHANIC WITH MY FRIEND WHO DROVE HIS CAR TO ENSURE MY SAFETY, MY CAR BEGAN TO OVER HEAT AFTER DRIVING IT FOR 10 MINUTES!  I WAS SO FRANTIC THAT I THOUGHT I WAS GOING TO BURNED UP IN THE CAR.  THE MECHANIC TOLD ME THE NEXT DAY IT WAS THE INTAKE MANIFOLD AND INFORM ME THAT THIS MAY BE A RECALL  AND TO CHECK WITH THE FORD CORPORATION AND I DID CALLED FORD CORPORATION AND FOUND OUT THIS VEHICLE HAD CONTROL CRUISE HARNESS AND A INTAKE MANIFOLD  RECALL ID IS 01M02, THE DEALERSHIP FOR CAMELBACK FORD IN PHOENIX, MR. CHAD MCDOWELL OFFER THIS RECALL NUMBER BUT HIS EMPLOYEE [XXX] OFFER TO HELP ME FIX THE BOTH PROBLEMS, THEN LATER ON NEGATED.  I FEEL A RECALL OF ANY VEHICLE SHOULD NEVER BE EXPIRED BASE ON THESE ISSUES OF SAFETY AND REGARDLESS OF A SETTLEMENT THAT MAY HAVE BEEN REACHED, THERE ARE MILLIONS OF PEOPLE WHO NEED TO HAVE THEIR VEHICLE REPAIR TO MAKE IT AT LEAST A WHOLE AGAIN AS MUCH AS POSSIBLE AND AVOID A POSSIBLE INJURY OR DEATH.  I FOUND THE RECALL OF THIS INTAKE MANIFOLD OFFERING CONSUMER UP TO $ 750 TO REPAIR THE CAR WITHOUT ANY RECEIPTS?  WHAT ABOUT THE PEOPLE WHO PURCHASE THE VEHICLE AFTERWARDS, IS THAT FAIR.  NOW MY CONCERN IS THAT I AM SMELLING GASOLINE WHEN I AM DRIVING AND I BELIEVED IT MAY HAVE SOMETHING TO DO WITH THE GAS LINE OR THE SENSOR, AND I HATE PUTTING MORE MONEY INTO THE VEHICLE. I FEAR THAT THE MECHANIC WILL TELL ME ITS GOING TO BE A COSTLY MATTER AND IT'S NEVER GOING TO STOP WITH THIS CAR AND I JUST WANT TO GET RID OF IT OR HAVE IT REPAIR AS IT SHOULD OF BEEN BY THE DEALERSHIP BUT THE FORD COMPANY WOULD NOT APPROVE IT.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).*TR",
        "vin": "2FALP74W5TX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/17/2011",
        "dateOfIncident": "06/16/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10407258,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1996 FORD CROWN VICTORIA. THE CONTACT STATED WHILE DRIVING AT A LOW SPEED THE FRONT DRIVERS SIDE LOWER CONTROL ARM BROKE.  THE CONTACT DID NOT TALK TO THE MANUFACTURER REGARDING THE LOWER CONTROL ARM. THE CONTACT STATED THE VEHICLE WAS UNSAFE TO DRIVE.  THE FAILURE MILEAGE WAS 125,000.",
        "vin": "2FALP71W0TX"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/19/2009",
        "dateOfIncident": "09/17/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10288940,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 1996 FORD CROWN VICTORIA. HE TOOK HIS VEHICLE FOR INSPECTION AND THE MECHANIC TOLD HIM THAT THE UNDERCARRIAGE WAS POSITIONED INCORRECTLY, WHICH INCREASES THE RISK THAT A FIRE WOULD OCCUR. (HE STATED THAT HE COULD NOT REMEMBER SPECIFICALLY WHAT THE MECHANIC SAID). HE HAD NOT TAKEN THE VEHICLE TO THE DEALERSHIP OR SPOKEN WITH THE MANUFACTURER TO-DATE. THE CURRENT MILEAGE WAS APPROXIMATELY 18,000. THE FAILURE MILEAGE WAS APPROXIMATELY 17,000.",
        "vin": "2FALP71W7TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/11/2009",
        "dateOfIncident": "01/15/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10261515,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1996 FORD CROWN VICTORIA.  THE CONTACT STATED THAT THE AIR INTAKE MANIFOLD ON THE VEHICLE WAS MANUFACTURED OUT OF PLASTIC, WHICH CAUSED ANTI-FREEZE TO LEAK ONTO THE ENGINE.  THE ANTI-FREEZE LEAK WAS NOTICED DUE TO THE BURNING CHEMICAL ODOR AND SMOKE COMING FROM UNDER THE HOOD.  THE DEALER STATED THAT THE REPAIRS WOULD COST OVER $1,000 AT THE CONTACT'S EXPENSE.  HE WAS DENIED REPAIRS UNDER THE CLASS ACTION LAWSUIT.  WHEN THE HEATER WAS ACTIVATED, THE ODOR FROM THE ANTI-FREEZE WAS OVERBEARING IN THE PASSENGER COMPARTMENT OF THE VEHICLE.  THE FAILURE AND CURRENT MILEAGES WERE 82,000.   UPDATED 4/16/09 *CN  UPDATED 04/20/09. *JB",
        "vin": "2FALP7468TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/29/2008",
        "dateOfIncident": "12/29/2008",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253080,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1996 FORD CROWN VICTORIA WHICH WAS PURCHASED IN 2004. SHE NOTICED AN ORANGE FLAME UNDER THE VEHICLE AND SMOKE UNDER THE HOOD. THE FIRE DEPARTMENT WAS NOTIFIED AND THE FIRE QUICKLY ENGULFED THE ENTIRE VEHICLE. THE VEHICLE WAS DESTROYED.  THE FAILURE AND CURRENT MILEAGES WERE 196,000.    UPDATED 03/17/09.  *LJ  UPDATED 03/17/09. *JB",
        "vin": "2FALP74W4TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/10/2008",
        "dateOfIncident": "10/10/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10245079,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FORD",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST MY ENGINE SEEMED TO OVERHEAT A BIT THEN EVERY ONCE IN A WHILE IT WOULD SOUND LIKE THE ENGINE WAS GRINDING ON SOMETHING AND WOULDN'T STOP.. SOUNDED LIKE A BUNCH OF CHAINS IN MY HOOD. BUT THEN ON OCCASIONS THE STUPID THING WOULDN'T SHUT OFF WHEN IT WAS MAKING THE CHAIN SOUND, EVEN WITH MY KEY OUT. IT JUST HAPPENED AGAIN AND NOW THE THING SMELLS LIKE SOMETHING IS BURNING AND I HAVE NO POWER WHAT SO EVER IN MY VEHICLE. BEFORE WHEN IT FINALLY SHUT OFF IT SOUNDED LIKE IT WAS ABOUT TO SPARK. THEN IT WAS MAKING A CLICKING NOISE THAT WASN'T COOL. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/23/2008",
        "dateOfIncident": "08/01/2007",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10229544,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "1996 FORD CROWN VICTORIA CAUGHT FIRE. CONSUMER STATES THAT THE CAR CAUGHT FIRE IN AUGUST AND SHE RECEIVED A RECALL IN SEPTEMBER. SHE BELIEVES THAT SHE WASN'T TREATED FAIRLY BY FORD. SHE LOST BOTH CARSEATS, TIRES, BRAKES, AND ROTORS IN THE FIRE.  *KB",
        "vin": "2FALP73W5TX"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/30/2008",
        "dateOfIncident": "08/10/2007",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10226322,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1996 FORD CROWN VICTORIA.  THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN ID NUMBER 07V336000 (VEHICLE SPEED CONTROL).  THE BRAKE RESERVOIR CAUGHT FIRE AND CAUSED THE DRIVER SIDE EMERGENCY BRAKE TO FAIL.  THE FAILURE ALSO CAUSED THE WHEELS TO LOCK.  THE MANUFACTURER ADVISED THE CONTACT TO CALL HIS INSURANCE COMPANY FOR A CLAIM.  THE VEHICLE WAS PARKED AT THE TIME OF THE FIRE.  THE FAILURE MILEAGE WAS 150,000.",
        "vin": "2FALP7396TX"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/17/2008",
        "dateOfIncident": "03/26/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10224808,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1996 FORD CROWN VICTORIA.  THE CONTACT STATED THAT SHE TOOK THE VEHICLE TO THE DEALER TO HAVE THE RECALL REPAIRED FOR THE VEHICLE SPEED CONTROL: CRUISE CONTROL.  THE SAME DAY AFTER THE REPAIR WAS PERFORMED, WHILE DRIVING APPROXIMATELY 70 MPH, SHE DISCOVERED THAT THE CRUISE CONTROL DID NOT WORK PROPERLY.  THE CONTACT TOOK THE VEHICLE BACK TWO TIMES TO HAVE THE CRUISE CONTROL REPAIRED, BUT THE FAILURE STILL PERSISTS.  THE RECALL NUMBER WAS UNKNOWN.  THE CURRENT MILEAGE WAS 104,000 AND FAILURE MILEAGE WAS 103,582.",
        "vin": "2FALP73W6TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/14/2008",
        "dateOfIncident": "08/15/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10224451,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1996 FORD CROWN VICTORIA.  WHILE DRIVING 10-15 MPH, THE THERMOSTAT STUCK AND BECAME HOT.  THE VEHICLE OVERHEATED AND THE INTAKE MANIFOLD FAILED.  THE CONTACT RECEIVED A SAFETY RECALL NOTICE FOR THE VEHICLE SPEED CONTROL.  THE VEHICLE HAS NOT BEEN TAKEN TO THE DEALER BECAUSE IT CANNOT BE DRIVEN.  THE PURCHASE DATE AND RECALL NUMBER WERE UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 111,000.",
        "vin": "2FALP74W1TX"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/02/2008",
        "dateOfIncident": "09/01/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10223141,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL AND THEN NO AVAILABLE REPLACEMENT PART FOR 6+ MONTHS.  I HAVE BEEN TOLD THERE ARE OVER 700 PEOPLE AHEAD OF ME WAITING FOR THE REPLACEMENT PART!  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/30/2008",
        "dateOfIncident": "08/15/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10216506,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1996 FORD CROWN VICTORIA.  THE CONTACT RECEIVED A SAFETY RECALL NOTICE  FOR THE VEHICLE SPEED CONTROL IN AUGUST OF 2007.  THE SPEED CONTROL SWITCH WAS DISCONNECTED AT THAT TIME.  HE HAS BEEN INFORMED EVERY MONTH THEREAFTER THAT THE RECALL PART HAS STILL NOT BEEN RECEIVED.  THERE HAD BEEN NO FAILURE TO DATE.  THE PURCHASE DATE AND RECALL NUMBER WERE UNKNOWN.  THE CURRENT MILEAGE WAS 62,000.",
        "vin": "2FALP73W8TX"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/18/2008",
        "dateOfIncident": "01/11/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10215325,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FORD",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "1996 FORD EXPLORER, 4X4.  DRIVING IN DESERT WENT OVER A BUMP A LITTLE FAST, WHICH SET OFF MY AIRBAGS.  MY RIDER IS IN THE HOSPITAL FOR BROKEN NOSE, CHEEK AND SOME KIND OF SMOKE INHALATION.  MY WINDSHIELD IS BROKEN BECAUSE THE BAG HIT THE MIRROR WHICH THEN HIT THE WINDSHIELD. MY STEERING WHEEL IS DESTROYED, CRUISE CONTROL AND HORNS ARE OUT OF SERVICE.  BEFORE I COULD DRIVE THE CAR AGAIN I HAD TO CUT THE AIRBAGS OUT.  WHAT THE HELL IS THIS! NO DAMAGE TO THE CAR EXCEPT WHAT THE AIRBAGS DID.  I WANT THIS ALL FIXED AT FORD'S EXPENSE.  I HAVE HAD THIS CAR 10 YEARS WITH NO PROBLEMS EXCEPT; RECALLED TIRES, STEERING BARS AND BRAKES (ALL RECALL).  *TR",
        "vin": "1FMDU34X7TU"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/11/2008",
        "dateOfIncident": "08/01/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10214520,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD RECAL NUMBER 05S28 REPLACE FAULTY SPEED CONTROL HARNESS. I RECEIVED A LETTER OF RECALL DATED AUG OF 2007 AND WENT TO A LOCAL DEALER AND THE SPEED CONTROL WAS DISCONNECTED AND THEN THE DEALER INFORMED ME THAT THE PREPLACEMENT PART WAS NOT IN STOCK THE RECALL LETTER STATED THAT THE PART WOULD BE AVAILABLE IN THE 4TH QUARTED OF 07. I CALLED THE DEALER ON MANY OCASSIONS AND WAS INFORMED THAT THE PART WAS NOT AVAILABLE FROM FORD MOTOR CO. HERE IT IS JAN 2008 AND I STILL DON'T HAVE MY CAR REPAIRED.  *TR",
        "vin": "2FALP73W9TX"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/07/2008",
        "dateOfIncident": "08/29/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10214013,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1996 FORD CROWN VICTORIA.  THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN ID NUMBER 07V336000 (VEHICLE SPEED CONTROL) IN AUGUST OF 2007.  THE DEACTIVATION SWITCH HAS NOT YET BEEN DISCONNECTED.  HE NOTIFIED FORD MOTOR COMPANY AND THE DEALER NUMEROUS TIMES AND THEY CONTINUE TO INFORM HIM THAT THE PARTS ARE UNAVAILABLE.  THERE HAD BEEN NO FAILURE TO DATE.  THE CURRENT MILEAGE WAS 40,000.  UPDATED 02-19-08 *BF    UPDATED 02/19/08  *TR",
        "vin": "2FALP74W5TX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/07/2007",
        "dateOfIncident": "11/10/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10211101,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FORD",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 1996 MERCURY VILLAGER DEVELOPED A FAILURE IN THE AIR FLOW SENSOR (PART $330) THAT RESULTED IN VEHICLE STALLS, INCLUDING STOPS ON THE HIGHWAY, THAT NEARLY RESULTED IN CRASHES. THE  REQUIRED  REPAIRS EXCEEDED $500. I KNOW FORD HAS A SIMILAR RECALL OUT NOW FOR THE 1997-2003 (/) MODELS).  *TR",
        "vin": "4M2DV11W2TD"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/08/2007",
        "dateOfIncident": "09/05/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208404,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1996 FORD CROWN VICTORIA.  THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN ID NUMBER 07V336000 (VEHICLE SPEED CONTROL).  THE DEACTIVATION SWITCH WAS DISCONNECTED BY THE DEALER.  FORD STATED THAT THE PART WOULD BE UNAVAILABLE UNTIL JANUARY OF 2008.  THERE HAD BEEN NO FAILURE TO DATE.  THE CURRENT MILEAGE WAS 160,000.  UPDATED 01/09/08.  *LJ  THE CONSUMER STATED MADE 2 CALLS TO THE DEALER INQUIRING ABOUT THE PART AND REPAIR TO THE CRUISE CONTROL WHICH IS NEEDED BECAUSE OF NERVE DAMAGE. UPDATED 12/12/07  *TR",
        "vin": "2FALP71WXTX"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "10/15/2007",
        "dateOfIncident": "02/19/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10205733,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 1996 FORD CROWN VICTORIA WAS BEING DRIVEN A 7 MILE DRIVE TO CHURCH ON A SUNDAY MORNING.  THE DRIVER OF MY CAR NOTICED THE CAR WAS GOING VERY FAST, (APPROX. 80 MILES PER HOUR.) THE DRIVER STEPPED ON THE BRAKE, BUT THE CAR WOULD NOT SLOW DOWN. AFTER RIDING THE BRAKE FOR ABOUT 4 MILES, THE PANICKY DRIVER CALLED A RELATIVE FOR HELP.  THE RELATIVE TOLD THE DRIVER TO PULL OVER ON THE SHOULDER OF THE ROAD TO GET THE DRIVER OUT OF THE DANGER OF THE HIGHWAY.  AFTER HOLDING THE BRAKE DOWN FOR SO MANY MILES, THE CAR FINALLY SLOWED TO AROUND 40 MILES PER HOUR.  OUR CAR STRUCK A VAN TRYING TO MAKE A TURN INTO THEIR CHURCH PARKING LOT.  OUR CAR WAS FILLED WITH SMOKE AND SHAKING VIOLENTLY BEFORE HITTING THE VAN.  AFTER BEING EXAMINED BY TWO MECHANICS, OUR CARS ACCELERATION WAS CAUSED BY A FAULTY CRUISE CONTROL.  THE CAR'S DAMAGES AS WELL AS THE DRIVERS AND PASSENGERS MENTAL ANGUISH WAS TREMENDOUS. MY CAR IS STILL SITTING IN A BODY SHOP PARKING LOT WAITING TO BE REPAIRED.  *JB",
        "vin": "2FALP74W2TX"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/01/2007",
        "dateOfIncident": "09/13/2006",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204554,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1996 FORD CROWN VICTORIA.  WHILE DRIVING APPROXIMATELY 45 MPH, THE CONTACT NOTICED SMOKE COMING FROM UNDERNEATH THE HOOD.  HE PULLED OVER TO INSPECT THE VEHICLE AND NOTICED THAT THE WIRING HARNESS WAS ON FIRE.  HE ATTEMPTED TO RESTART THE VEHICLE, BUT IT WOULD NOT RESTART.  THE MANUFACTURER STATED THAT THEY WOULD ASSUME RESPONSIBILITY IF HE COULD PROVIDE PICTURES, A POLICE REPORT, AND THE TITLE BECAUSE A RECALL WAS ISSUED FOR THE SPEED CONTROL.  THE CONTACT COULD NOT LOCATE THE POLICE REPORT.  THE RECALL NUMBER WAS UNAVAILABLE.  THE FAILURE MILEAGE WAS 99,500 AND CURRENT MILEAGE WAS 102,000.",
        "vin": "2FALP71W9TX"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/10/2007",
        "dateOfIncident": "04/27/2007",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10202338,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1996 FORD CROWN VICTORIA.  WHILE DRIVING 30 MPH, THE CONTACT SMELLED SOMETHING BURNING AND NOTICED SMOKE RISING FROM THE VEHICLE.  THE CONTACT PULLED OVER AND DISCOVERED FLAMES RISING FROM UNDER THE HOOD.  THE POLICE DEPARTMENT FILED A REPORT AND EXTINGUISHED THE FIRE.  THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE, WHERE IT CURRENTLY REMAINS.  SHE REPORTED THE FIRE TO THE DEALER AND THEY STATED THAT IT WAS NOT THEIR CONCERN.  THE CONTACT RECENTLY RECEIVED NHTSA CAMPAIGN ID NUMBER 07V336000 (VEHICLE SPEED CONTROL).  THE PURCHASE DATE WAS UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 170,000.",
        "vin": "2FALP73W1TX"
    },
    {
        "components": "TIRES",
        "crash": true,
        "dateComplaintFiled": "07/03/2007",
        "dateOfIncident": "06/29/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10195275,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FORD",
                "productYear": "1996",
                "type": "Vehicle"
            },
            {
                "manufacturer": "B.F. GOODRICH TIRE CO.",
                "productMake": "B.F.GOODRICH",
                "productModel": "T/A RADIAL TIRE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TIRE ON 2 CASES BLEW THE TREAD AND BELT, THE LATER OF THE TWO INCIDENCES  WHICH RESULTED IN A CRASH THAT TOTALED THE  VEHICLE, AND  RESULTED IN TWO INJURIES  TO BOTH  THE DRIVER AND THE PASSENGER. BOTH NEEDED TO BE HOSPITALIZED.*AK",
        "vin": "1FMDU34X0TZ"
    },
    {
        "components": "STEERING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/17/2007",
        "dateOfIncident": "01/16/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10178967,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* -  THE CONTACT HAS A 1996 FORD CROWN VICTORIA POLICE INTERCEPTOR  WITH 108000 MILES AND THE PROTECTIVE SHIELD THAT COVERS THE FUEL TANK HAS NOT BEEN INSTALLED. THE CONTACT FOUND THAT THERE WAS A RECALL (02I003000): AND (96V135000) FOR STEERING:LINKAGES THAT HAD NOT BEEN FIXED ON HIS VEHICLE.  WHEN HE TOOK THE VEHICLE TO THE DEALER THEY TOLD HIM THAT HIS VEHICLE DID NOT FALL UNDER THE RECALL. THE CONTACT HAS NOT EXPERIENCED ANY PROBLEMS WITH HIS VEHICLE IN REGARDS TO THE RECALL TO DATE.     *JB",
        "vin": "2FALP71W2TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/06/2006",
        "dateOfIncident": "11/20/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10175427,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "DEAR SIR OR MADAM:  I AM AWARE OF THE FORD CAMPAIGN 05N04 REGARDING THE COMPOSITE INTAKE MANIFOLD REPLACEMENT PROGRAM.  MY 1996 CROWN VIC FELL TO THIS DEFECT TO ON 11/20/06 WHICH RESULTED IN A NEEDED REPLACEMENT USING THE PRESCRIBED FORD REPAIR KIT.  MY LOCAL FORD DEALER SAID THE REPAIR PROGRAM HAD EXPIRED WITH NO REIMBURSEMENT POSSIBLE.  AFTER SOLICITING FORDS COMMENTS DIRECTLY (REPLY CAN BE FORWARDED) I INTERPRET THEIR RESPONSE THAT PART FAILURE, WHILE THE SAME AS OTHERS, DID NOT HAPPEN SOON ENOUGH AND THEREFORE INELIGIBLE.    IN YOUR OPINION IS THERE ANY RECOURSE TO APPEAL THEIR DENIAL FOR CLAIM?  ARE YOU STILL RECEIVING LETTERS/EMAILS THAT THIS IS AN ONGOING PROBLEM?  MIGHT THERE BE ANOTHER JUDGMENT AGAINST THEM TO COVER OTHERS WITH THIS SAME FAILURE?  YOUR HELP IS APPRECIATED.  THANK YOU.  *NM  UPDATED 02/15/07. *JB",
        "vin": "2FALP73W1TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/21/2006",
        "dateOfIncident": "09/14/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168817,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WHILE TRAVELING TO VISIT HER SON IN A DISTANT CITY, SHE PULLED INTO A SHOPPING CENTER TO CALL HIM, HE LIVED NEARBY. HE CAME TO THE SHOPPING CENTER IN AN EFFORT TO LEAD HER TO HIS RESIDENCE. WHEN LEAVING SHE NOTICED SMOKE AND THOUGHT THE VEHICLE CAUGHT FIRE. FURTHER INVESTIGATION PROVED IT WAS AN ANT-IFREEZE LEAK.  THE FAILURE WAS THE INTAKE MANIFOLD PRODUCED OF AN INFERIOR MATERIAL (NYLON) A CRACK DEVELOPED AT 100614 MILES CAUSING THE ANTIFREEZE TO LEAK OUT AND OVERHEAT THE ENGINE AND CAUSE MORE DAMAGE.  WITHIN SEVERAL DAY THE AUTO WENT TO THE REPAIR SHOP AND THE INTAKE MANIFOLD WAS REPLACED A SUBSTANTIAL COST. THERE WAS NO RECALL PRESENT WITH THIS EVENT HOWEVER FORD MOTOR COMPANY HAD A CLASS ACTION SUIT WITH THIS EVENT AS ITS CENTER PIECE.  UNFORTUNATELY THE FAILURE ON MY FORD OCCURRED AFTER THE CLASS ACTION SUIT EXPIRED. THE SUIT WAS LIMITED BY A TIME FRAME. MY THOUGHT IS ALL NYLON MANIFOLD WILL FAIL FAR SHORT OF THE EXPECTATIONS OF THE LIFE OF THE ENGINE.  *JB",
        "vin": "2FALP74W9TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/11/2006",
        "dateOfIncident": "03/18/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10167914,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "MY INTAKE MANIFOLD BEGAN LEAKING APPROXIMATELY 2 DAYS AFTER I BOUGHT IT,6 MONTHS LATER IT'S LEAKING IN A SECOND LOCATION.  *NM",
        "vin": "2FALP71W8TX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/21/2006",
        "dateOfIncident": "08/21/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10166099,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE LOWER CONTROL ARM BALL JOINT FRACTURED WHILE DRIVING 20 MPH ON A DRY HIGHWAY.  THERE WAS A NHTSA RECALL, # 98V322000, REGARDING THE SUSPENSION: FRONT: CONTROL ARM: LOWER BALL JOINT.   THE VEHICLE WAS NOT INCLUDED IN THE RECALL DUE TO THE VIN.",
        "vin": "2FALP74WXPX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/11/2006",
        "dateOfIncident": "02/17/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10165275,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "ON A 1996 FORD CROWN VICTORIA THE INTAKE MANIFOLD FAILED DUE TO A SEVERE CRACK ON THE UNDERSIDE,LOOSING COOLANT AND CAUSING OVER HEATING OF ENGINE AND LEAVING US STRANDED.CAR WAS REPAIRED AT A SHOP WE HAVE USED FOR YEARS AT THE COST OF APPROX $700.00.",
        "vin": "2FALP73W4TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/18/2006",
        "dateOfIncident": "07/17/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10162810,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 96 FORD CROWN VIC  I DROVE IT HOME FROM WORK FINE  WITH NO PROBLEMS THEN I DROVE IT TO TAKE MY SON TO WORK IT STARTED TO OVERHEAT THERE WAS NO INDICATION SOMETHING WAS WRONG.  THEN THE TEMP  WENT UP  AND CHECK ENGINE LIGHT CAME ON. I HAVE CHANGE THE THERMOSTAT BUT IT STILL IS OVER HEATING AND  WATER IS COMING OUT THE EXHAUST AND SEEMS TO BE SPITTING OUT FROM TOP OF MOTOR. THIS CAR HAS ONLY 59,00 MILES ON IT.  *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/22/2006",
        "dateOfIncident": "12/20/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10160448,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FORD",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THAT THE SPEED CONTROL DEACTIVATION SWITCH WAS LEAKING FLUID.  THERE IS A NHTSA RECALL ON OTHER FORD VEHICLES.  THE VIN WAS NOT INCLUDED IN THE RECALL.  WHEN THE VEHICLE WAS TAKEN TO A SERVICE DEALER, THE REPAIR WERE MADE FOR A FEE. ALSO EVERY 25000 MILES, THE OIL PAN GASKET NEEDED TO BE CHANGED DUE A SMALL LEAK.  THE MECHANIC WAS UNABLE TO DETERMINE THE CAUSE OF THE PROBLEM.  THIRD, THE EXHAUST AND INTAKE MANIFOLDS WERE LEAKING CAUSING A NOXIOUS SMELL INSIDE THE VEHICLE.  THE VEHICLE WAS THEN TAKEN TO THE SAME SERVICE DEALER.  THE DEALER REPLACED BOTH MANIFOLDS, AND DETERMINED THAT THERE WAS AN OIL LEAK DRIPPING ONTO THE EXHAUST SYSTEM.",
        "vin": "2FMDA5148TB"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/20/2006",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10154089,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER COMPLAINT REGARDING REIMBURSEMENT FOR 1996 CROWN VICTORIA INTAKE MANIFOLD.  *TS  THE CONSUMER PRESENTED HIS BILL TO THE DEALER FOR REIMBURSEMENT.  THEY INFORMED HIM THAT HE WASN'T ENTITLED TO REIMBURSEMENT BECAUSE IT WASN'T WITH THEIR TIME FRAME.  *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/25/2006",
        "dateOfIncident": "02/20/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10151214,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE ONE OF THE PLASTIC INTAKE MANIFOLD ON A 1996 FORD CROWN VIC THAT CRACKED. I CONTACTED A DEALER IN TULSA AND THEY SAID THE RECALL WAS OUT OF DATE AND WOULD NOT DO THE WORK. IF THEY JUST RECALLED THE PART IN 2004 OR 2005 WHY WOULD IT NOT BE COVERED NOW.  *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/23/2006",
        "dateOfIncident": "01/28/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10150999,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "I FILED A STATEMENT WITH FORD MOTOR COMPANY ON JANUARY 26, 2006 WITH THE ORIGINAL REPAIR RECEIPT AND THE DEFECTIVE  MANIFOLD. I HAVE NOT RECEIVED ANY REPLY AS OF THIS DATE, I CHECKED WITH THE COMPANY ON FEBRUARY 16 AND WAS TOLD IT WAS BEING REVIEWED. WHAT DO THEY HAVE TO REVIEW?  I HAVE THE RECEIPT FROM JULY 2002, THE ORIGINAL  DEFECTIVE MANIFOLD, AND THE REPAIR DEPARTMENT MANAGER FILLED OUT THE PAPERS AND FILED THEM.  I FILED THE FORM AT COCONUT POINT FORD , 22360 S. TAMIAMI TRAIL, ESTEO, FL.  AND THEY SAID THEY HAD TO SEND THE FORM TO SAM GALLOWAY FORD INC, 1800 BOY SCOUT DR. , FT. MYERS, FL. SINCE THEY ARE THE ONES TO WRITE THE CHECKS.  I FOLLOWED THE DIRECTIONS TO THE LETTER FOR THE CLAIM AND AM NOT GETTING A RESPONSE. I THINK THEY ARE WAITING UNTIL MARCH 16 IS PAST THEN THEY WILL SAY I AM TOO LATE TO FILE.  PLEASE SEE WHAT YOU CAN DO FOR ME.   *JB",
        "vin": "2FALP73W5TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/14/2005",
        "dateOfIncident": "12/11/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10145182,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FORD",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SUNDAY DECEMBER 11, 2005 WHILE TRAVELING ON THE HIGHWAY I EXPIRED A SUDDEN SPIKE IN TEMPERATURE ON MY 1996 FORD CROWN VICTORIA. AFTER TAKING MY CAR TO A FORD DEALERSHIP I WAS INFORMED THAT MY \"PLASTIC\" INTAKE MANIFOLD HAD CRACKED. I HAVE RESEARCHED THE CURRENT INVESTIGATION AND HAD NEVER RECEIVED ANY SORT OF CUSTOMER NOTIFICATION FROM FORD. I HEARD ABOUT THE MANIFOLD ISSUE FROM A FELLOW EMPLOYEE. THE TOTAL COST OF REPAIRS FOR THIS FAULTY MANIFOLD WAS $978.00. I FEEL IF THEY KNEW THEY NEEDED TO UPDATE IT WITH AN ALUMINUM MANIFOLD THAN THEY KNEW THE PLASTIC ONES WERE FAULTY.*JB",
        "vin": "2FALP74W1TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/12/2005",
        "dateOfIncident": "02/15/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10142518,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD TO REPLACE THE INTAKE MANIFOLD ON MY 1996 CROWN VICTORIA EARLIER THIS YEAR.  I RECEIVED A LETTER ABOUT A LAWSUIT THAT THE COST OF THE MANIFOLD WOULD BE REIMBURSED BY FORD IF THE FINAL SETTLEMENT WAS APPROVED.  I HAVE READ THE INFORMATION PROVIDED AND ALTHOUGH FORD KNOWINGLY PUT A FAULTY PART IN MY CAR, I WILL NOT RECEIVE A REIMBURSEMENT SIMPLY BECAUSE MY REPAIR IS BEYOND THE 7 YEARS MENTIONED IN THE LAWSUIT.  I WANT TO KNOW WHAT CAN BE DONE.  HAD I KNOWN THAT THIS PART WAS INAPPROPRIATE FOR THE JOB THAT IT WAS INTENDED TO DO, I WOULD NOT HAVE BOUGHT THE CAR.  EVEN I KNOW BETTER THAN TO PUT A PLASTIC/VINYL PART WHERE THE HEAT IS SO INTENSE!!!!!  FORD NEEDS TO BE FORCED BY THE GOVERNMENT TO REIMBURSE ALL OF US ,.......PERIOD.    I DON'T MAKE A LOT OF MONEY AND HAD TO USE A HOUSE PAYMENT TO PAY FOR THIS AND I STILL HAVEN'T CAUGHT UP!  FORD SCREWED ME ONE TIME BEFORE BACK IN THE 80'S AND I SCREWED UP BY BUYING ANOTHER FORD. *JB",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/29/2005",
        "dateOfIncident": "08/06/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10138194,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY GOT THE VEHICLE AND ITS ALREADY GIVING ME PROBLEMS. THE CAR DRIFTS TO THE SIDE AND THE MOTOR IS GIVING ME PROBLEMS THE CAR HAS NOT EVEN REACHED 1500 MILES SINCE I GOT IT AND ITS ALREADY CAUSING ME PROBLEMS. *JB",
        "vin": "2FALP74W4TX"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/03/2005",
        "dateOfIncident": "08/25/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135262,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            },
            {
                "manufacturer": "B.F. GOODRICH TIRE CO.",
                "productMake": "B.F.GOODRICH",
                "productModel": "RADIAL T/A",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WE PURCHASED A SET OF B.F. GOODRICH RADIAL T/A (P21570S15) TIRES FROM SEARS, WHICH WERE COMPLETELY WORN AND CONSIDERED UNDER THE LEGAL LIMITATIONS AFTER ONLY 25,000 MILES OF USE.  THE TIRES HAD A 50,000 MILE WARRANTY.  WE HAVE HAD THE CAR FULLY MAINTAINED SINCE THE PURCHASE OF THE CAR AND THE TIRES, AND WERE TOLD BY PROFESSIONALS THAT THEY FELT THE TIRES WERE A MANUFACTURER DEFECT.  THEY ALSO TOLD US WE SHOULD REPLACE THE TIRES IMMEDIATELY OR WE COULD BE PUTTING OURSELVES AND OUR CHILD IN DANGER.  WE WENT TO SEARS AND THEY REFUSED TO HELP US AND SIMPLY WANTED US TO BUY A WHOLE NEW SET OF TIRES, EVEN AFTER I SHOWED THEM EVERY RECEIPT ON THE MAINTENANCE TO PROVE THIS DID NOT HAPPEN BECAUSE OF NEGLECT ON OUR PART.  *JB",
        "vin": "2FALP74W6TX"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/02/2005",
        "dateOfIncident": "08/25/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135214,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            },
            {
                "manufacturer": "B.F. GOODRICH TIRE CO.",
                "productMake": "B.F.GOODRICH",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WE PURCHASED A SET OF B.F. GOODRICH P21570S15 TIRES FROM SEARS, WHICH WERE COMPLETELY WORN AND CONSIDERED UNDER THE LEGAL LIMITATIONS AFTER ONLY 25,000 MILES OF USE.  THE TIRES HAD A 50,000 MILE WARRANTY.  WE HAVE HAD THE CAR FULLY MAINTAINED SINCE THE PURCHASE OF THE CAR AND THE TIRES, AND WERE TOLD BY PROFESSIONALS THAT THEY FELT THE TIRES WERE A MANUFACTURER DEFECT.  THEY ALSO TOLD US WE SHOULD REPLACE THE TIRES IMMEDIATELY OR WE COULD BE PUTTING OURSELVES AND OUR CHILD IN DANGER.  WE WENT TO SEARS AND THEY REFUSED TO HELP US AND SIMPLY WANTED US TO BUY A WHOLE NEW SET OF TIRES, EVEN AFTER I SHOWED THEM EVERY RECEIPT I HAD ON THE MAINTENANCE TO PROVE THIS DID NOT HAPPEN BECAUSE OF NEGLECT ON OUR PART.",
        "vin": "2FALP74W6TX"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/30/2005",
        "dateOfIncident": "08/30/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134718,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "PREMATURE? HEADLIGHT PLASTIC CLOUDINESS, AND  DECREASED LIGHT TRANSFER.  THIS HAPPENED WITH A PREVIOUS MERCURY VEHICLE (1990 SABLE) AND NOW ON 1996 FORD CROWN VICTORIA. HEADLIGHTS WERE EXCELLENT WHEN NEWER, NOW THE CLOUDING OF THE PLASTIC LENSES HAS REDUCED THE EFFECTIVENESS OF THE HEADLIGHTS AT NIGHT. DEALER ADVISES THAT THIS IS NORMAL AND THAT THE REPAIR IS NEW LENSES AT CUSTOMER EXPENSE.   *NM",
        "vin": "000000"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/16/2005",
        "dateOfIncident": "08/03/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133064,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  CONSUMER HAS A 1996 FORD CROWN VICTORIA.  HE COMPLAINED ABOUT A LOWER BALL JOINT  PROBLEM.  HE FOUND, ON THE INTERNET NHTSA RECALL 98V322000 .  HE WENT TO FORD WEB SITE AND ENTERED THE  VIN THE  WEB SITE SHOWED THAT THIS VEHICLE WAS NOT INCLUDED IN RECALL. THE VEHICLE IS NOW NOT DRIVABLE DUE TO BALL JOIN PROBLEM.  LOWER  BALL  FAILED ON 8-3-2005 WHILE DRIVING. THERE  WAS NO ACCIDENT, HE TRAVELING   BALL JOINT SEPARATED JUST LIKE MENTIONED  IN THE  RECALL.   CONSUMER WOULD LIKE TO HAVE VEHICLE INCLUDED IN THIS RECALL. *AK",
        "vin": "2FALP74W9TX"
    },
    {
        "components": "PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "08/07/2005",
        "dateOfIncident": "07/12/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131831,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "REPLACED RUSTED STEEL BRAKE TUBING ON LEFT SIDE OF VEHICLE.  *NM",
        "vin": "2FALP73W7TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/07/2005",
        "dateOfIncident": "11/09/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131834,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "LEAKING COOLANT FROM INTAKE MANIFOLD. REPLACED PLASTIC INTAKE MANIFOLD ASSEMBLY (VERY EXPENSIVE PARTS AND LABOR) BY PRIVATE MECHANIC (NOT FORD SERVICE). REQUESTED DEALER SERVICE REFUND FOR COVERED REPAIRS. NOT COVERED BY RECALL SO NOTHING WAS DONE BY SERVICE REP.  *NM",
        "vin": "2FALP73W7TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/04/2005",
        "dateOfIncident": "01/08/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10127386,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE EXPRESSWAY, I HEARD A POP THE ENGINE RAN HOT IMEDIATELY...  I LATER FOUND TI TO BE THE INTAKE MAINFOLD FITTING... ACCORDING TO THE MECHANIC, THIS IS COMMON FOR THIS PARTICULAR TYPE CAR...",
        "vin": "2FALP74WXTX"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/01/2005",
        "dateOfIncident": "04/27/2005",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10127258,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: 96 FORD CROWN VICTORIA BURNED WHILE PARKED IN GARAGE FOR A PERIOD OF 6 HOURS. ALSO, BURNED HOUSE. FIRE DEPARTMENT DETERMINED THAT THE FIRE STARTED ON THE CRUISE CONTROL SWITCH  THAT WAS ATTACHED TO BRAKE MASTER CYLINDER.   FIRE DESTROYED CONTENTS OF GARAGE AND HOUSE AS WELL. THIS WAS A POLICE VEHICLE FOR POLICE USE.*AK",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/27/2005",
        "dateOfIncident": "06/03/2005",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126633,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FORD",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 06/03/2005, A GOVERNMENT OWNED, 1996 FORD BRONCO, WAS OBSERVED ON FIRE WHILE PARKED IN A PARKING GARAGE.  THE VEHICLE HAD BEEN TURNED OFF AND PARKED FOR APPROXIMATELY EIGHT HOURS WHEN THE FIRE OCCURRED.  THE FIRE WAS OBSERVED AT THE FRONT OF THE VEHICLE, AND BURNED FOR SEVERAL MINUTES BEFORE IT COULD BE EXTINGUISHED.  THE FIRE WAS BELIEVED TO HAVE BEEN CAUSED BY THE CRUISE CONTROL DEACTIVATION SWITCH.",
        "vin": "1FMEU15N8TL"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/23/2005",
        "dateOfIncident": "05/27/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126398,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "METAL BRAKE LINES ALONG DRIVERS SIDE FRAME RAIL RUSTED THROUGH CAUSING COMPLETE LOSS OF BRAKES.",
        "vin": "2FALP7461TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/25/2005",
        "dateOfIncident": "05/23/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10122086,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FORD",
                "productYear": "1996",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "AIR BAG SWITCH",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "INTAKE MANIFOLD WAS REPLACED ON 1996 THUNDERBIRD IN 2000.  IT IS NOW CRACKED, AND AFTER SPENDING 550.00 TO FIND THAT OUT, THERE IS NOTHING FORD WILL DO EVEN THOUGH IT IS ON CAMPAIGN (97M91).  NOW I CAN NOT DRIVE MY CAR.",
        "vin": "1FALP62WXTH"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/19/2005",
        "dateOfIncident": "04/17/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10121455,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "1996 FORD CP INTAKE MANIFOLD CRACKED AT THE SEAAM.*MR...MANUFACTURER'S  RECALL, NO NOTIFICATION. *AK",
        "vin": "1FALP62WXTH"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/14/2005",
        "dateOfIncident": "05/12/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10120908,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "PLASTIC INTAKE MANIFOLD ON 1006 FORD CROWN VICTORIA VAILED.  CALIFORNIA CLASS ACTION SUIT ALREADY IDENTIFIED PROBLEM.  FORD HAS FAILED TO NOTIFY CONSUMERS OF POTENTIAL DANGEROUS DEFECT.  SEE - HTTP://WWW.LROLAW.COM/MANIFOLDS.JSP.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/04/2005",
        "dateOfIncident": "05/03/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10119736,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKED PLASTIC INTAKE MANIFOLD  LOST ENGINE COOLANT  REPALCED INTAKE MANIFOLD WITH ALUMINUM MANIFOLD  I STILL HAVE OLD PART",
        "vin": "2FALP73W7TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/17/2005",
        "dateOfIncident": "03/17/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10114266,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 1996 FORD CROWN VICTORIA WITH A 4.6L ENGINE.  I BOUGHT IT MARCH 16TH 2005.  ON MARCH 17TH 2005 I DROVE IT FOR THE FIRST TIME TO WORK.  I ACCELERATED TO 70 MPH ON THE US-131.  THE INTAKE GAVE OUT AND SMOKED OUT THE ENTIRE HIGHWAY.  IT CRACKED ON THE FRONT COOLANT RUNNER OF THE INTAKE MANIFOLD.  I WAS ALTE TO WORK AND HAD TO HAVE THE CAR TOWED.  I AM GOING TO BE CHARGED ABOUT $600 FOR THE REPLACEMENT INTAKE INSTALLLED.  THE MECHANIC TOLD ME THAT THE INTAKES WERE RECALLED, BUT ONLY ON COMMERCIAL VEHICLES NOT PRIVATE OWNED.    WHY IS THIS?  IS THE PRIVATE CITIZEN NOT IMPORTANT ENOUGH?  I AM LIVING FROM PAYCHECK TO PAYCHECK NOW, I CAN'T AFFORD TO HAVE THIS KIND OF WORK DONE.  MY INCOME IS LIMITED.  I CAN ONLY HOPE I CAN SCRAPE UP THE MONEY, SO I CAN GET TO WORK NOW.  NOT HAPPY.  I WILL KEEP THE OLD PART.*AK",
        "vin": "2FALP7469TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/16/2005",
        "dateOfIncident": "10/09/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10114191,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "PLASTIC INTAKE MANIFOLD CRACKED, FIRE HAZARD; MAJOR ENGINE PARTS MADE OF PLASTIC, NOT MADE TO WITH STAND HIGH HEAT TEMPS.  REPLACED INTAKE MANIFOLD, ONLY AVAILABLE REPLACEMENT IS PLASTIC AS WELL, WHICH WILL CRACK AGAIN!!!!*AK",
        "vin": "1FG667AK450"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/28/2005",
        "dateOfIncident": "06/23/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10108190,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE AT WORK PERFORMING AN ALTERNATOR TEST ON A 96 CROWN VICTORIA WITH THE 4.6 ENGINE I WAS RUNNING THE ENGINE AT 2000 RPM. THERE WAS A LOUD POP AND THEN THE ENGINE COMPARTMENT WAS FILLED WITH STEAM AND HOT COOLANT. I WAS ALMOST SCALDED, AS I WAS LEANING OVER THE ENGINE TO ACCESS THE THROTTLE LINKAGE.  THE INTAKE HAD CRACKED ON THE COOLANT RUNNER BEHIND THE ALTERNATOR ABOUT 2\" WIDE. OUR SHOP HAD TO REPLACE THE CUSTOMER'S INTAKE MANIFOLD AND COULD NOT CHARGE THE CUSTOMER FOR THE PARTS OR LABOR BECAUSE THE CUSTOMER BLAMED US FOR THE DAMAGE. I BELIEVE THAT THE CUSTOMER SHOULD HAVE BEEN INFORMED OF THIS SITUATION BY FORD MOTOR COMPANY AND THE RECALL SHOULD COVER MORE THAN JUST THE \"FLEET USE\" VEHICLES. THIS IS CLEARLY A PRODUCT DURABILITY/DEFECT ISSUE.*AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "11/29/2004",
        "dateOfIncident": "11/19/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10100710,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE LINE FROM THE ABS PUMP TO THE RIGHT FRONT BRAKE RUSTED THROUGH WHICH RESULTED IN THE LOSS OF ALL FLUID IN THE MASTER CYLINDER. FURTHER INSPECTION FOUND THE TWO REAR BRAKE LINES ALSO SEVERELY RUSTED. THE LOCATION OF THE FAILURE AND THE EXTENSIVELY RUSTED REAR LINES WAS DIRECTLY UNDER THE MASTER CYLINDER, ON TOP OF THE CHASSIS RAIL.       *AK",
        "vin": "2FALP72W0TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/20/2004",
        "dateOfIncident": "08/13/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10086944,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 1996 FORD CROWN VICTORIA LX, ON AUG. 13TH, 2004 THE CAR OVERHEATED. THERE WAS A SMALL CRACK IN THE PLASTIC INTAKE MANIFOLD. UPON INVESTIGATING THIS, IT WAS FOUND THERE ARE NUMEROUS COMPLAINTS BUT FORD ONLY REPAIRED VECHICLES OWNED BY POLICE AND TAXIS. THE COST TO REPAIR THEIR DEFECT IS OVER $800. I BELIEVE US CONSUMERS SHOULD BE REIMBURSED FOR FORD DEFECTIVE PLASTIC INTAKE MANIFOLD. THE RECALL FOR THE POLICE AND TAXIS WAS 01M02.  *AK  *NM",
        "vin": "2FALP74W8TX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/05/2004",
        "dateOfIncident": "08/04/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10087304,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT ANY SPEED  CONSUMER HEARD A GROANING SOUND.    VEHICLE WAS PARKED PARKED  WHEN THE RIGHT FRONT END COLLAPSED.   A REPAIR SHOP EXAMINED THE VEHICLE, AND FOUND THAT THE LOWER RIGHT BALL JOINTS BROKE.*AK UPDATED 11/18/09. *LJ  UPDATED 11/19/09.*JB",
        "vin": "2FALP74W3TX"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/07/2004",
        "dateOfIncident": "05/24/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10074140,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR  STEEL BRAKE LINES RUSTED.  *AK  *NM",
        "vin": "2FALP73W7TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/20/2004",
        "dateOfIncident": "02/11/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10059485,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AND WITHOUT WARNING COOLANT LEAKED FROM  INTAKE MANIFOLD. *AK",
        "vin": "2FALP73W2TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/07/2004",
        "dateOfIncident": "01/25/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10056714,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "INTAKE MANIFOLD CRACKED. CONTACTED FORD CUSTOMER SERVICE. ADVISED NO RECALL AT THIS TIME. ADVISED TO RETAIN RECEIPT IF RECALL ISSUED, FORD WOULD REFUND EXPENSE.  WAS ADVISED THAT IF I DID NOT HAVE REPAIR MADE AT FORD DEALERSHIP THERE WAS NO OTHER WAY FOR THEIR ENGINEERS TO DOCUMENT AND INVESTIGATE THE PROBLEM.  ALSO AWARE THE ESCAMBIA COUNTY, FL SHERIFF'S DEPT. HAS TO REPLACE THIS SAME PART ON A REGULAR BASIS.  AFTER REVIEWING THE NUMEROUS COMPLAINTS I FIND THAT A RECALL HAS BEEN ISSUED FOR POLICE AND TAXI VEHICLES BUT NOT PASSENGER VEHICLES.  THE COST OF THIS PART WITH A DISCOUNT WAS $501. THE REPLACEMENT MANIFOLD HAS A METAL WATER PASSAGE TO PREVENT FURTHER CRACKS.  FORD MUST BE HELD ACCOUNTABLE FOR THIS AND FORCED TO REPAIR, REPLACE OR REFUND THIS DEFECTIVE MAJOR ENGINE PART.*AK",
        "vin": "2FALP74W8TX"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "01/15/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10069858,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST I WOULD LIKE TO SAY THAT WHAT I HEAR ABOUT THE GRAND MARQUIS HAVING PROBLEM WITH THE FUEL TANK IS RATHER DISTURBING TO ME I AM AWARE NOW THAT THESE CARS ARE CAPABLE OF CATCHING ON FIRE IF HIT FROM BEHIND. I CARRY THREE SMALL CHILDREN TO SCHOOL EVERY MORNING IN &#34;THIS CAR&#34; I HAVE CONTACTED THE FORD CORP. ABOUT THIS PROBLEM AND THEY SEEM TO NOT BE BOTHERED ABOUT THIS FACT. NOW TO MY OTHER PROBLEMS. I HAVE JUST REPLACED MY INTAKE MANIFOLD BECAUSE THE ONE THAT CAME WITH THE CAR CRACKED WHILE I WAS DRIVING IT. MY MECHANIC STATED THAT HE FOUND OUT THAT IT WAS A VERY COMMON PROBLEM WITH THE 1996 MERCURY GRAND MARQUIS. THE FORD CORP. HAS REDESIGNED THE INTAKE MANIFOLD FOR THIS MODEL AND RAISED THE PRICE FROM ABOUT 250.00 TO ALMOST 500.00. IN JULY OF 2002 THERE WAS A PART THAT WENT OUT ON MY A/C UNIT THAT I HAD TO REPLACE (I HAVE TO CONTACT MY MECHANIC TO SEE WHAT PART IT WAS THAT WAS REPLACED) IN JULY 2002 I HAD TO HAVE MY ROTERS TURNED, IN JANUARY 2003, I HAD TO HAVE THEM TURNED AGIAN AND HAVE MY RIGHT BACK ROTER REPACED BECAUSE IT WAS NO LONGER GOOD. (ALL THIS WAS DONE ON JANUARY 10 2003 NOW IT IS JAN. 20, 2003 AND MY RIGHT FRONT ROTER IS GRINDING AGAIN (I ALSO HAD NEW BRAKES PUT ON ALL AROUND JAN.10,2003. MY DRIVER SIDE DOOR IS DROOPING BECAUSE IT NEEDS A NEW PIN PUT IN... MY CAR ALSO SEEMS TO BALK WHEN I PUSH ON THE GAS PEDDAL,MY CAR ALSO HAS A POPPING NOISE WHEN I HIT A HOLE OR TURN. WHEN I CALLED THE FORD CORP. ON THESE ISSUES THEY SEEMED LIKED THEY REALLY DIDN'T CARE ABOUT ANY OF THESE THINGS. MAYBE YOU MIGHT KNOW SOMEONE THAT I COULD CONTACT IN THE FORD CORP. THAT IS &#34;HIGH UP&#34; AND THAT WOULD LISTEN TO MY ONCERNS.      THANK YOU FOR YOUR TIME,                                           SINCERLY,                                           DIANE",
        "vin": "2MELM74WXTX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/13/2004",
        "dateOfIncident": "01/12/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10053129,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 1996 FORD CROWN VICTORIA P71 INTERCEPTOR. I HAVE A SERIOUS PROBLEM WITH MY INTAKE MANIFOLD ON THE ENGINE. THE RECALLED PART WAS NOT REPLACED BY THE DEPARTMENT THAT PREVIOUSLY OWNED THE VEHICLE, AND NOW IT HAS FAILED 6 MONTHS AFTER THE EXPIRATION LEAVING ME AN UNSAFE VEHICLE, AND RISK OF PERMANENT ENGINE DAMAGE OR FAILURE. FORD IS NOT WILLING TO ASSIST IN ANY WAY WITH THIS REPAIR OTHER THAN A STANDARD NEAR $800.00 REPAIR.",
        "vin": "2FALP71W1TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/03/2003",
        "dateOfIncident": "08/29/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10049139,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INTAKE MANIFOLD CRACKED.  *NLM",
        "vin": "2FALP73W9TX"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "11/26/2003",
        "dateOfIncident": "10/31/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10047597,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 10/31/03,  THE ACCELERATOR ON A 1996 FORD CROWN VICTORIA STUCK CAUSING A PROPERTY DAMAGE ACCIDENT WHICH WAS REPORTED TO THE POLICE.  THE VEHICLE WAS BEING DRIVEN BY MY DAUGHTER. THE VEHICLE EXHIBITED THE SAME PROBLEM WHEN MY SON WAS DRIVING IT ON 11/25/03. MY SON HAD TO PUT THE VEHICLE IN NEUTRAL AS THE BRAKES WOULD NOT STOP WITH THE BRAKES APPLIED OR STOP ACCELERATING. THIS IS AN EXTREMELY DANGEROUS CONDITION.   *LA",
        "vin": "2FALP74W8TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/20/2003",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10048498,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEMS WITH VEHICLE'S PLASTIC INTAKE MANIFOLD.*MR  (NAR)  DEALER WAS NOTIFIED.    *CB",
        "vin": "2FALP71W3TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/05/2003",
        "dateOfIncident": "11/05/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10046431,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 30 MPH DRIVER NOTICED SMOKE COMING FROM  INSIDE OF THE VENTS. DRIVER PULLED OVER AND LIFTED THE HOOD UP.    THE DRIVER HAD THE VEHICLE TOWED TO THE DEALER FOR ANALYSIS.  MECHANIC NOTICED THAT THE INTAKE MANIFOLD  CRACKED INSIDE, CAUSING  A LEAK.  *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/07/2003",
        "dateOfIncident": "06/15/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10042410,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT  INTAKE MANIFOLD CRACKED, CAUSING THE FLUID TO LEAK ONTO THE ENGINE. CONSUMER HAS CONTACTED THE DEALERSHIP. *AK",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/01/2003",
        "dateOfIncident": "08/25/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10038150,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE MAKING A LEFT TURN AT A TRAFFIC LIGHT STEERING WHEEL LOCKED UP, CAUSING  DRIVER TO LOSE CONTROL.  THE DRIVER MANAGED TO STOP THE VEHICLE AND HAD IT TOWED TO THE DEALER.  IT WAS DETERMINED THAT THE PITMAN ARM BROKE AT THE STEERING LINKAGE.  CONSUMER .  *AK  *NLM",
        "vin": "2FALP74V33T"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/29/2003",
        "dateOfIncident": "09/18/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10040934,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE OPERATING 1996 FORD CROWN VICTORIA LX 4DR  SEDAN (140K MILEAGE) ON LOCAL HIGHWAY, UPON STOPPING NOTICED COOLANT SMELL.  TOOK VEHICLE TO LOCAL DEALER.  DIAGNOSED A CRACKED \"RESIN\" ENGINE INTAKE ON 4.6 LTR V8 AT SEAM UNDER TEMPERTAURE SENSOR BEHIND ALTERNATOR.  REPAIRED WITH REPLACEMENT ALUMINUM INTAKE AT OWNERS EXPENSE.  OLD INTAKE SENT TO WILLIAM C. FORD, CEO FORD MOTOR COMPANY, ONE AMERICAN ROAD, DEARBORN, MI, 48121, WITH LETTER OF EXPLANATION/COMPLAINT.  FACTORY MANUFACTURING DEFECT.  REQUEST ACTION.",
        "vin": ""
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "09/11/2003",
        "dateOfIncident": "09/07/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10039777,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 55 MPH  HOOD LATCH SNAPPED.  HOOD FLEW UP AND SHATTERED THE FRONT WINDSHIELD.  CONSUMER MANAGED TO PULL OVER. *AK",
        "vin": "2FALP7469TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/08/2003",
        "dateOfIncident": "07/22/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10032467,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INTAKE MANIFOLD FAILED.  *JB",
        "vin": "2FALP73W5TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/24/2003",
        "dateOfIncident": "07/24/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10030034,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES  INTAKE MANIFOLD GASKET IS CRACKED, CAUSING  COOLANT TO GO  INSIDE THE ENGINE. DEALER NOTIFIED. *AK",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/18/2003",
        "dateOfIncident": "02/18/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10028584,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FOLLOWING IS A COPY OF THE \"INQUIRY/CONCERN\" SENT TO THE FORD MOTOR COMPANY RELATIONSHIP CENTER:  THE RIGHT FRONT ELECTRIC WINDOW MALFUNCTIONED ON 2/18/00 AT 42,134 MILES. IT COST ME A $50 DEDUCTIBLE TO REPLACE A DEFECTIVE REGULATOR BECAUSE I HAD PURCHASED THE EXTENDED WARRANTY.  THE LEFT REAR WINDOW MALFUNCTIONED ON 11/28/00 AT 51,983 MILES. IT COST A $50 WARRANTY DEDUCTIBLE TO REPLACE A FAULTY REGULATOR.  THE DRIVER'S LEFT FRONT WINDOW MALFUNCTIONED ON 12/26/00 AT 52,465 MILES. IT COST A $50 DEDUCTIBLE TO REPLACE A DEFECTIVE REGULATOR.  THE RIGHT REAR WINDOW MALFUNCTIONED ON 7/3/03 AT 90,201 MILES. IT COST $209 TO REPLACE A DEFECTIVE REGULATOR.  CYCLE COMPLETE. ANY PATTERN HERE?    FORD'S RESPONSE WAS SURPRISE AT THE CONSISTENT DEFECTS IN THEIR REGULATORS. THEY COULDN'T ASSIST FINANCIALLY BECAUSE I HAD USED AN INDEPENDENT TO FIX THE LAST WINDOW WHILE TRYING TO KEEP COSTS LOW.  WAS THIS EXPERIENCE UNIQUE? *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/09/2003",
        "dateOfIncident": "06/24/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10025757,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPLETE BRAKE FAILURE. DETERIATED FLUID LINE UNDER DRIVER'S DOOR. ALL FLUID WAS DISCHARGED AND WAS LEFT WITHOUT ANY BRAKES AT ALL. SHOULD BE INVESTIGATED.  *AK  REFERENCED IN RQ03-004",
        "vin": "2FALP74W1TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/27/2003",
        "dateOfIncident": "06/13/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10022225,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WERE PROBLEMS WITH THE ENGINE.  MANUFACTURER WAS CONTACTED AND STATED THE VEHICLE WAS NOT INCLUDED ON THE RECALL EVEN THOUGH THE VEHICLE EXPERIENCED THE SAME PROBLEM WITH THE MANIFOLD INTAKE.  *AK  SMOKE COME FROM UNDER THE HOOD.  THERE WAS NO WATER(WAS ALL OVER THE ENGINE AND THE INSULATION), AND NO OIL.  PLASTIC WAS USED FOR THE INTAKE MANIFOLD WHICH FORD CHANGED TO METAL.  THE CONSUMER'S NEW ENGINE HAD COME WITH THE NEW CHANGE.  FORD INSTRUCTED THE CONSUMER TO KEEP RECEIPTS BECAUSE THE WERE GOING TO ISSUE A RECALL.  *SCC   *JB",
        "vin": "2FALP73W5TX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/16/2003",
        "dateOfIncident": "06/16/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10024169,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "A ARM BRACKET WHICH IS ATTACHED TO THE FRONT SUSPENSION IS BROKEN. CONSUMER  DISCOVERED IT WHEN SHE HEARD A NOISE COMING FROM THE VEHICLE, AND HAD A MECHANIC CHECK THE NOISE OUT.  AFTER CHECKING THE VEHICLE  MECHANIC ADVISED HER TO TAKE THE VEHICLE TO A DEALER FOR REPAIR BECAUSE IT LOOKED AS A MANUFACTURE R'S PROBLEM.*AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/03/2003",
        "dateOfIncident": "05/20/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10020967,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES FAILED.  DRIVER NOTICED BRAKE FLUID LEAK AND ADDED BRAKE FLUID TO GET THE CAR BACK TO OUR RESIDENCE.  A REVIEW OF THE BRAKE LINES SHOWED CORROSION AND LEAKAGE IN THE BRAKE LINE ONLY.   ALL OF THE OTHER LINES AND THE UNDER CARRIAGE SHOW NO CORROSION AT ALL. THIS IS INDICATIVE OF A DEFECT IN THE MATERIAL USED FOR THE BRAKE LINE.  THIS INCIDENT COULD HAVE BEEN MORE SERIOUS, POSSIBLY CAUSING INJURIES OR DEATHS IF IT WERE NOT FOR THE ACTIONS OF THE DRIVER.   *NLM",
        "vin": "2FALP71W3TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/04/2003",
        "dateOfIncident": "04/04/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10015237,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE MANIFOLD CRACKED.   *JB",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/21/2003",
        "dateOfIncident": "12/04/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010838,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A USED 1996 FORD CROWN VICTORIA FROM CAL WORTHINGTON FORD IN ALASKA A LITTLE LESS THAN THREE YEARS AGO.  WHEN I PURCHASED THE CAR, I ALSO PURCHASED A PREMIUM WARRANTY POLICY AND THE VEHICLE IS STILL UNDER WARRANTY.    THE VEHICLE HAS HEATED REAR-VIEW MIRRORS.  A LITTLE OVER TWO YEARS AGO AFTER A SNOW STORM, THE PASSENGER-SIDE REAR-VIEW MIRROR CRACKED STRAIGHT DOWN THE MIDDLE.  SNOW HAD COVERED THE MIRROR AND I ASSUME WHEN THE MIRROR HEATED, IT CRACKED.  FOUR MONTHS AGO AFTER ANOTHER SNOW STORM, THE DRIVER??S SIDE MIRROR CRACKED STRAIGHT DOWN THE MIDDLE.  ONCE AGAIN, IT WAS COLD AND WHEN THE MIRROR STARTED HEATING UP IT CRACKED.  PLEASE NOTE - I ALWAYS BRUSH THE SNOW OFF MY CAR BEFORE I WARM IT UP.    REQUEST ?? FORD MOTOR CO. REPLACES THE MIRRORS AT NO COST TO ME    I CONTACTED CAL WORTHINGTON FORD AND ASKED THEM TO REPLACE THE MIRRORS UNDER WARRANTY AND THEY REFUSED.  I HAVE TWO REASONS FOR THIS REQUEST:  1) THE MIRRORS ARE DEFECTIVE AND POSE A SAFETY HAZARD.  THE MIRRORS CRACKED BECAUSE OF A POOR ENGINEERING DESIGN.  THE MIRRORS DIDN'T CRACK BECAUSE OF NEGLIGENCE CAUSED ON MY PART.  2) THE CAR IS STILL UNDER WARRANTY.    *NLM",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/17/2003",
        "dateOfIncident": "03/14/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10011897,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL TANK HAD NO SHIELD BEHIND IT, IF  THE VEHICLE WAS HIT FROM BEHIND IT COULD CATCH FIRE. THE DEALER STATED THERE WAS A RECALL REGARDING THE ISSUE, HOWEVER THE RECALL ONLY RELATED TO POLICE INTERCEPTOR VEHICLE'S. *JB",
        "vin": "2FALP71W7TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/06/2003",
        "dateOfIncident": "02/28/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10008504,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INTAKE MANIFOLD CRACKED ALLOWING COOLANT TO LEAK WHICH COULD GET ONTO WIRING AND CAUSE A FIRE, OR ENGINE OVER HEATING WHICH COULD CAUSE A FIRE. FORD HAS A RECALL ON POLICE CARS AND TAXI'S BUT NOT REGULAR CROWN  VICTORIA'S.*JB",
        "vin": "2FALP74WXTX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/07/2003",
        "dateOfIncident": "01/07/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10002268,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE IS A POLICE INTERCEPTOR MODEL.  THE CONSUMER CONTACTED THE DEALER REGARDING RECALL 02I003000 AND THE DEALER ADVISED HIM THAT THEY COULD NOT PERFORM THE RECALL BECAUSE VEHICLE  WAS NOT A PART OF THE FLEET OF LAW ENFORCEMENT VEHICLES.  TS  SCC",
        "vin": "2FALP71W6TX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": true,
        "dateComplaintFiled": "12/31/2002",
        "dateOfIncident": null,
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 3,
        "numberOfInjuries": 1,
        "odiNumber": 10001231,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE HAS BEEN 3 DEATHS AND 1 CRITICAL INJURY WITHIN THE ARIZONA LAW ENFORCEMENT, REGARDING THE FORD CROWN VICTORIA POLICE CRUISER'S, THE DESIGN AND PLACEMENT OF THE FUEL TANK HAS BEEN KNOWN TO CATCH ON FIRE IF THE VEHICLE  IS INVOLVED IN A REAR SIDE IMPACT COLLISION.*JB  *TT",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "12/23/2002",
        "dateOfIncident": "12/03/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10001438,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED HAVING THE SAME PROBLEMS AS RECALL #021003000 FUEL TANK/POLICE VEHICLE. DEALER WILL NOT REPAIR BECAUSE VIN# WAS NOT INCLUDED. TS",
        "vin": "PLEASE PROV"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/11/2002",
        "dateOfIncident": "11/02/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 770733,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "INTAKE MANIFOLD CROSSOVER, AS I ACCELERATED THE CROSSOVER ON THE MANIFOLD RUPTURED, BURSTING, MASSIVE AMOUNTS OF COOLANT TO BE EXPELLED , CAUSING SEVERE FOGGING IN THE INTERIOR AND EXTERIOR OF CAR, COOLANT ON HIGHWAY INTERSTATE, CREATING A SLICK SURFACE TO OTHER MOTORIST.  AFTER CONTACTING AND SURVEYING DEALERS AND REPAIR SHOPS IN THE AREA, THIS SEEMS TO BE A COMMON PROBLEM IN FORD VEHICLES WITH THE 4.6L V8. FORD DOES HAVE A TSB, HAS DONE A RECALL ON POLICE AND FLEET VEHICLES, REFUSES TO DO CONSUMER AUTOMOBILES.  THIS IS A MAJOR PROBLEM.  DT",
        "vin": "2FALP7462TX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/07/2002",
        "dateOfIncident": "10/17/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8022386,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED HAVING THE SAME PROBLEM AS RECALL#98V322000 LOWER CONTROL ARM. DEALER NOTIFIED       TS",
        "vin": "PLEASE PROV"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/25/2002",
        "dateOfIncident": "10/18/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8021636,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THE RIGHT TURN SIGNAL, FLASHER LIGHTS ARE WORKING PROPERLY. PLEASE PROVIDE FURTHER INFORMATION.        TS",
        "vin": "2FALP74W6TX"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/25/2002",
        "dateOfIncident": "10/07/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8021643,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES WHILE DRIVING 55MPH THAT HOOD FLEW UP IMPAIRING VISABILITY. TS",
        "vin": "PLEASE PROV"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/24/2002",
        "dateOfIncident": "06/27/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8019250,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES WHILE DRIVING 50MPH THE INTAKE MANIFOLD FAILED.*JB  CONSUMER STATED THAT SUDDEN FAILURE OF INTAKE MANIFOLD CAUSED THE VEHICLE TO OVERHEAT. THE INTAKE MANIFOLD WAS ON RECALL, BUT THE MANUFACTURER REFUSED TO HONOR THE RECALL.  *YH",
        "vin": "2FALP74W1TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/24/2002",
        "dateOfIncident": "06/16/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 767659,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PLASTIC INTAKE MANIFOLD ON THESE 4.6L ENGINES CRACK CAUSING LOST COOLANT.  FORD MOTOR COMPANY REPLACES THEM UP TO 6 OR 7 YEARS ON T-BIRDS, MUSTANGS, AND POLICE CARS AND TAXI'S.  NOT REGULAR CROWN VICS, GRAND MARQUE'S AND TOWN CARS.  WHY.  THE REPLACEMENT YOU BUY IS INPROVED WITH ALUMINUM COOLING SYSTEM PASSAGES.  THE REPLACEMENT EVEN GIVES A PICTURE OF WHERE TO LOOK FOR THE KNOWN DEFECT, YET FORD REFUSES TO HONOR THERE MISTAKE.",
        "vin": "2FALP7465TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/23/2002",
        "dateOfIncident": "08/18/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 767594,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "I WROTE TO THE FORD CUSTOMER SERVICE DEPARTMENT. THEY CALLED ME AND SAID THAT SINCE THEY DID NOT ISSUE A RECALL NOTICE FOR MY CAR, THEY WOULD NOT REIMBURSE ME FOR THE REPAIRS. I CHECKED WITH MY DEALER AND THEIR SERVICE DEPARTMENT FOUND THAT FORD HAD MADE SELECTIVE RECALLS OF CROWN VICTORIAS, COUGARS, & MUSTANGS THAT ALL HAD THIS SAME PROBLEM. MY CAR HAD A DEFECTIVE PART (NON-MOVING) AND BLEW OUT FROM NORMAL HEAT AND PRESSURE. FORD SHOULD PAY FOR THIS REPAIR.  NLM",
        "vin": "2FALP7467TX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/10/2002",
        "dateOfIncident": "08/18/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 766964,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS FORCED TO STAY AT A HOTEL OVERNIGHT UNTIL MONDAY AFTERNOON WHEN THE CAR WAS REPAIRED WITH A REPLACEMENT MANIFOLD MADE OF METAL BY FORD. THE HOTEL BILL CAME TO $220.",
        "vin": "2FALP7467TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/05/2002",
        "dateOfIncident": "08/01/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8017914,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES  THE VEHICLE  OVERHEATED AND THERE WAS LOSS OF COOLANT WHILE  DRIVING,  DUE TO A CRACK IN THE INTAKE MANIFOLD. DEALER AND THE MANUFACTURER WERE NOTIFIED. FEEL FREE TO PROVIDE ANY FURTHER INFORMATION.*JB",
        "vin": "2FALP74W1TX"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/19/2002",
        "dateOfIncident": "08/05/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 8016601,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "IN A FRONTAL COLLISION NONE OF THE AIR BAGS DEPLOYED ON IMPACT, RESULTING IN SERIOUS INJURIES TO DRIVER.*AK *JG",
        "vin": "2FALP74W7TN"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/01/2002",
        "dateOfIncident": "08/01/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 9007180,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "FRAME RUSTED OUT AFTER 5 YEARS NEXT TO TORQUE BOX---SOUTH BEND INDIANA POLICE PULLED 68 OF THEIR SQUAD CARS OUT OF SERVICE FOR THE SAME PROBLEM",
        "vin": "2FALP71W3TX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/31/2002",
        "dateOfIncident": "06/20/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 764991,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "IN 4-1999 A RECALL OWNER LETTER WAS SENT TO ALL FORD DEALERS IN REGARD TO FATIGUE CRACKS IN THE INTAKE MANIFOLDS USED ON THE 4.6 L SCHC ENGINES. THE RECALL IS FOR 1996-1998 CROWN VICTORIA TAXIS AND I FEEL SINCE I HAD THE SAME PROBLEM WITH MY INTAKE MANIFOLD  I SHOULD BE REIMBURSE FOR THE REPAIR. FORD HAS HAD RECALLS FOR THE INTAKE MANIFOLDS EVERY YEAR UP TO 2002.FORD DEALER IN TOWN IS NO HELP NOR THE 1-800 CUSTOMER ASSISTANCE NUMBER. I HAD  THE CAR TOWED TO A LOCAL GARAGE FOR REPAIR SINCE THEY WERE CHEAPER THE FORD DEALER. BRYAN WALKER AT THE GARAGE SAID HIS 96 FORD CROWN HAD THE SAME PROBLEM LAST YEAR AND THE FORD DEALER DID HELP HIM GET A REFUND SO I KNOW THEY ARE HELPING SOME PEOPLE.I KNOW THERE IS NO RECALL ON MY CAR BUT SINCE THERE IS ONE FOR THE TAXIX AND I HAD THE SAME PROBLEM I FEEL IT SHOULD BE UNDER THE SAME RECALL.*AK",
        "vin": "2FALP74W1TX"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/10/2002",
        "dateOfIncident": "06/01/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8012145,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "AS THE CONSUMER TURNED ON THE HAZARD LIGHTS, THE SIGNAL LIGHTS WENT OUT. THE DEALER DETERMINED THEY SHORTED OUT.*AK *TS  *JB",
        "vin": "2FALP73W6TX"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/09/2002",
        "dateOfIncident": "04/01/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 763998,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CHECK ENGINE LIGHT KEEPS COMING ON AND DEALER CAN'T FIND PROBLEM.  I FOUND PREVIOUS OWNER AND HE STATED THE CHECK ENGINE LIGHT CONSTANTLY CAME ON AND HIS MECHANIC NEVER FOUND THE PROBLEM EITHER.  IT HAS COME ON FOR THE 5TH TIME AND I HAVE ONLY OWNED THE CAR LESS THAN 4 MONTHS!!!!!  PREVIOUS OWNER STATED THAT HE DID NOT HAVE ANY ENGINE FAILURES OR NOTICEABLE PROBLEMS WITH THE ENGINE RUNNING; BUT THE LIGHT IS INFURIATING.  IT IS OBVIOUS THAT DEALER WHO SOLD ME THE CAR WAS AWARE OF THE PROBLEM AND FAILED TO CORRECT IT BEFORE SELLING IT TO ME AND MADE NO DISCLOSURE OF THE DEFECT TO ME.  IT IS ALSO OBVIOUS THAT THIS IS A PROBLEM WITH MANY CROWN VICS AFTER READING PREVIOUS NOTICES ON THIS SITE BUT FORD HAS FAILED TO DO ANYTHING ABOUT IT.  I'D LIKE TO GET CLASS ACTION PROCEEDINGS STARTED AGAINST FORD...ANYONE UP FOR IT?  CONTACT ME AT THIS EMAIL ADDRESS TALK2VELDA@MSN.COM.*AK",
        "vin": "2FALP7468TX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/02/2002",
        "dateOfIncident": "07/02/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 763741,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "HOW MANY COMPLAINTS ARE REQUIRED BEFORE A RECALL IS ISSUED, FORCING A MANUFACTURER TO MAKE REPAIRS FOR A MANUFACTURER TO MAKE REPAIRS FOR A MANUFACTURING DEFECT ? ON YOUR SITE, THERE ARE 24 COMPLAINTS ABOUT THE SAME COOLANT LEAKING PROBLEM WITH THE PLASTIC INTAKE MANIFOLD ON FORD'S 4.6L ENGINES. WHY WAS THE ACTION ALREADY TAKEN ONLY APPLIED TO POLICE VEHICLES ? I'M SURE THE LEAK IS THE SAME PROBLEM WE ALL HAVE HAD. MINE IS NUMBER 25 AND THESE ARE ONLY THE OWNERS WHO HAVE TAKEN THE TIME TO PURSUE THE ISSUE WITH NHTSA. MY COST FOR THE PART ALONE IS $650.00. SINCE THIS IS AN OBVIOUS MANUFACTURING DEFECT AND FORD HAS CHANGED THE DESIGN OF THE REPLACEMENT PART, I FEEL THE MANUFACTURER SHOULD BE REQUIRED TO REPAIR IT FOR FREE.*AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/01/2002",
        "dateOfIncident": "06/28/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8013017,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING INTAKE MANIFOLD CRACKED AND WAS LEAKING ANTI FREEZE, CAUSING ENGINE TO OVERHEAT. CONTACTED DEALER ,AND  DEALER  WASNOT WILLING TO DO ANYTHING.*AK",
        "vin": "2FALP74W7TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/30/2002",
        "dateOfIncident": "06/29/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 763653,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS COMPONENT IS HISTORICALLY MADE FROM CAST IRON OR ALUMINUM. THE WATER CHAMBER BLEW OUT BECAUSE IT WAS MADE FROM PLASTIC. IT CAUSED EXCESS VAPOR TO COME FROM HOOD. FAILURE WAS CATASTROPHIC AND WITH NO WARNING. ENGINE OVERHEATED IMMEDIATELY. THE PARTS PERSON AT THE DEALER NOW PERFORMING THE SERVICE (I WAS OUT OF TOWN WHEN THIS HAPPENED TO ME) TOLD ME THAT THEY STOCK THIS PART BECAUSE OF THE CONSTANT FAILURE. THERE HAVE BEEN RECALLS ISSUED ON OTHER MODELS WITH THE SAME PART BUT NOT ON MY SPECIFIC MODEL APPARENTLY.  THIS SHOULD HAVE BEEN REPLACED PROACTIVELY BY THE MFG. BASED ON THE PRESENT FAILURE RATES.*AK",
        "vin": "2FALP7464TX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/07/2002",
        "dateOfIncident": "06/06/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8011296,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING HEARD A NOISE/PULLED OVER, AND ANTI FREEZE HAD LEAKED OUT  DUE TO A BROKEN INTAKE MANIFOLD. *AK",
        "vin": "2FALT74W8VX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/03/2002",
        "dateOfIncident": "06/01/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8010907,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING AT  25 MPH THE TEMPERATURE GAUGE WENT TO HOT, AND CONSUMER COULD SMELL ANTIFREEZE BURNING SMELL.  MECHANIC STATED IT WAS A CRACKED MANIFOLD BEHIND ALTERNATER. PLEASE PROVIDE ANY FURTHER INFORMATION.*AK",
        "vin": "2FALP73W9TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/07/2002",
        "dateOfIncident": "05/05/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8009353,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A STRONG ANTIFREEZE SMELL WHILE DRIVING, THEN, POWER STEERING STARTED SLIPPING. VEHICLE WAS TOWED TO DEALER, CRACKED INTAKE MANIFOLD NEEDED TO BE REPLACED.*AK  CONSUMER STATES WHEN PULLING OVER, THE ENGINE WAS STEAMING FROM A CRACK IN THE INTAKE MANIFOLD JUST BEHIND THE ALTERNATOR, ENGINE COOLANT WAS SPRAYING ONTO THE ALTERNATOR AND BELT, THE COOLANT LEAK DISABLED THE POWER STEERING UNIT, THE SPARK PLUG WIRES HAD ALSO BEEN CONTAMINATED DUE TO THE COOLANT LEAK AND THE THERMOSTAT HAD TO BE REPLACED.    *SLC",
        "vin": "2FALP73W1TX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/18/2002",
        "dateOfIncident": "05/26/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 760868,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INTAKE MANIFOLD CRACKED NEAR THE THERMOSTAT AND ALL THE COOLANT LEAKED OUT CAUSING THE CAR TO OVERHEAT. TOOK IT TO RANDALL NOE FORD DEALERSHIP TO HAVE IT FIXED. THEY TOLD ME WHAT THE PROBLEM WAS. AT THAT TIME I TOLD THEM IT SOUNDED LIKE A DESIGN DEFECT. THEY SAID THEY HAD SEEN A LOT OF FAILURES LIKE THIS. I ASKED THEM TO CHECK FOR RECALLS WHICH THEY DID BUT NONE WERE FOUND. ABOUT 30 DAYS AGO (AROUND MARCH 15, 2002) A RELATIVE SENT ME AN EMAIL SHOWING THAT MANY 1996  CROWN VICTORIAS WERE BEING RECALLED FOR THE EXACT SAME PROBLEM. I CONTACTED FORD AND THEY SAID OURS WAS NOT INCLUDED. I WOULD LIKE THE NTSA TO MAKE THEM INCLUDE IT. I KNOW, ACCORDING TO THE MECHANIC, THAT THERE ARE MANY OTHER PEOPLE WITH THE SAME PROBLEM. IT WAS CLEARLY A DESIGN DEFECT AND FORD SHOULD BE REQUIRED TO REIMBURSE ME FOR THE $800+ THAT I PAID TO HAVE IT FIXED.   THANKS MIKE PARKS",
        "vin": "2FALP74W6TX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/15/2002",
        "dateOfIncident": "03/29/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8007669,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVING PROBLEMS WITH  INTAKE MANIFOLD.  *AK",
        "vin": "2FA1P73W2TX"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/09/2002",
        "dateOfIncident": "02/18/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8007180,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING  BRAKES CONSTANTLY  RUBBING AND  CAUSING BRAKE LINE TO FAIL. *AK  REFERENCED IN RQ03-004",
        "vin": "PLEASE PROV"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/23/2002",
        "dateOfIncident": "03/10/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 759709,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THEIR HAVE BEEN 3 VIN# RECALLED POLICE CARS,TOW TRUCK DRIVER NEW WHEN I TOLD HIM WHAT PART HAD FAILED INTAKE MANIFOLD. NEW MANIFOLD FRONT PART IS NOW MADE OF METAL. THIS A MANUFACTOR PROBLEM NOT A DEALER PROBLEM. A MAN CAME UP TO ME AND ASKED IF I HAD A PROBLEM WITH INTAKE MANIFOLD HIS HAD DONE THE SAME THING. *AK",
        "vin": "2FALP74W3TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/13/2002",
        "dateOfIncident": "11/27/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 759306,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "MY ENGINE COOLANT LEAKS OUT VIA A CRACKED MANIFOLD INTAKE. IT CAUSES THE ENGINE TO OVERHEAT, AND HAS DAMAGED THE ALTERNATOR WITH LEAKING COOLANT. *AK",
        "vin": "2FALP7368TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/13/2002",
        "dateOfIncident": "11/27/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 759307,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "MY ENGINE COOLANT LEAKS OUT VIA A CRACKED MANIFOLD INTAKE. IT CAUSES THE ENGINE TO OVERHEAT, AND HAS DAMAGED THE ALTERNATOR WITH LEAKING COOLANT.*AK",
        "vin": "2FALP7368TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/19/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 564375,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE VEHICLE STALLS IN THE MIDDLE OF THE ROAD OR DURING A TURN, VEHICLE LOSES ALL POWER, CAUSING LOSS OF CONTROL, VEHICLE HAS CRASHED INTO A CURB DAMAGING TIRES AND RIMS, DEALER CAN NOT REMEDY THE PROBLEM.   *SLC",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/19/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 564375,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS EXPERIENCED SEVERAL ELECTRICAL PROBLEMS, BATTERY FAILED AND WAS REPLACED, ALL DASH LIGHTS WENT OUT WHILE DRIVING, AND DEALER REPLACED IGNITION SWITCH.  *SLC",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/19/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 564375,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS EXPERIENCED SEVERAL ELECTRICAL PROBLEMS, BATTERY FAILED AND WAS REPLACED, ALL DASH LIGHTS WENT OUT WHILE DRIVING, AND DEALER REPLACED IGNITION SWITCH.  *SLC",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/06/2002",
        "dateOfIncident": "12/04/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8003645,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL 01 F 025 000/INTAKE MANIFOLD;  INTAKE MANIFOLD CRACKED AND CAUSED  COOLANT TO LEAK, AND  ENGINE TO OVERHEAT. DEALER NOTIFIED, AND INFORMED CONSUMER  THAT THIS VEHICLE  WAS NOT COVERED UNDER  RECALL DUE TO VIN.FEEL FREE TO PROVIDE ANY FURTHER INFORMATION. *AK",
        "vin": "2FALP74W0TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/05/2002",
        "dateOfIncident": "11/15/1995",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8003585,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLS WHEN MAKING SLOW TURNS. VEHICLE TAKEN TO DEALER 6 TIMES, CANNOT FIND CAUSE. *AK",
        "vin": "2FALP73WXTX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/17/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8002422,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING  AT SPEED LIMIT  VEHICLE LOST POWER STEERING WITHOUT WARNING.*AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/12/2001",
        "dateOfIncident": "12/01/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8000649,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "A CORNER SEAL FOR  INTAKE MANIFOLD IS CRACKING, CAUSING  ENGINE TO OVERHEAT.   DEALERSHIP INFORMED CONSUMER  THIS VEHICLE WAS NOT INCLUDED IN RECALL CAMPAIGN 01F025000.  PLEASE PROVIDE ANY ADDITIONAL INFORMATION / DOCUMENTATION.*AK",
        "vin": "2FALP74W2TX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/04/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 899804,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PULLING INTO A PARKING SPACE HEARD NOISE. CONSUMER GOT OUT OF VEHICLE AND NOTICED  A LARGE CRACK IN FRONT OF THE MANIFOLD, IT  LEAKED COOLENT. PLEASE PROVIDE FURTHER INFORMATION.  *AK",
        "vin": "2FALP74W9TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/19/2001",
        "dateOfIncident": "01/15/2001",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 898010,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "TURNING IGNITION ON  AND VEHICLE EXPLODED.  ENGINE OF WAS DESTROYED. CONTACTED DEALER, AND DEALER STATED THAT WARRANTY HAS EXPIRED. VEHICLE WAS REPAIRED BY CONSUMER.  PLEASE ADD VIN. *AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/17/2001",
        "dateOfIncident": "10/06/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 897866,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "INTAKE MANIFOLD HAD CRACKED DUE TO BEING MADE OUT OF PLASTIC. THIS CAUSED COOLANT FLUID TO LEAK ONTO ALTERNATOR AND MOTOR. STEAM WAS COMING FROM UNDER THE HOOD.  TEMPERATURE GAUGE HAD SHOWN VEHICLE RUNNING HOT WHILE DRIVING.  *AK  *JB",
        "vin": "2FALP74W1TX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/23/2001",
        "dateOfIncident": "06/06/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 750980,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "MY INTAKE MANIFOLD CRACKED, AND ACCORDING TO FORD (SERVICE CENTER REP) AND MY MECHANIC THIS PART IS UNDER RECALL.  PLEASE ADVISE WHO I CONTACT FOR REIMBURSEMENT.*AK",
        "vin": "2FALP73W0TX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/06/2001",
        "dateOfIncident": "08/02/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 893586,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING VEHICLE ENGINE STALLED AND FLUID WAS COMING FROM THE BOTTOM. THEN, VEHICLE WAS TOWED TO A NEAR DEALER, WHERE THEY FOUND OUT THAT THERE WAS A CRACK ON  INTAKE MANIFOLD. ALSO, THERE WAS A RECALL, BUT DID NOT INCLUDE THIS VEHICLE DUE TO VIN AND MILEAGE OVER THE WARRANTY.*AK  VEHICLE WAS HAD ALSO OVERHEATED, MECHANIC FOUND THE FRONT OF THE PLASTIC INTAKE MANIFOLD WAS CRACKED BADLY AT MANUFACTURING SEAM AND STATED THAT THIS WAS A FACTORY DEFECT.  CONSUMER STATES VEHICLE SHUDDERS, THERE ARE SEVERAL SERVICE BULLETINS RELATING TO THIS, HOWEVER CONSUMER STATES SHE PAID FOR REPAIRS AND FEELS THIS TOO SHOULD BE A RECALL ITEM.   *SLC",
        "vin": "2FALP74W9TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/07/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 748055,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FIRST TIME WE EXPERIENCED THAT ANYTHING WAS WRONG WAS WHEN THE YELLOW ENGINE LIGHT ON THE DASHBOARD SHOW UP.  WE IMMEDIATELY WENT TO NEARST FORD DEALAR SERVICE DEPT. (PURVIS FORD IN FREDERICKSBURG, VA. THEY PLACE THE AUTOMOBILE UNDER A DIAGNOSIS TEST AND TOLD US THEY HAD TO REPLACE A MASS AIRFLOW SENSOR ASSY. THEY TOLD US IT WAS SAFE TO DRIVE THE FORD CAR  THE INCIDENT HAPPEN TO US AGAIN AND WE CALLED THE PURVIS SERVICE DEPT. THEY HAD THE CAR TOW BACK TO THEIR SERVICE SHOP.  THEY AGAIN PUT THE CAR UNDER THE DIAGNOSIS COMPUTER AN AFTER 2 DAYS OF HAVING IT AT THEIR SHOP TOLD US THEY COULD NOT FIND ANY WRONG WITH OUR CAR. IT NOW HAPPEN TO US AGAIN ON A ROUTE 3 GOING 55 MILES AN HR.,ON HEAVILY TRAVELED ROAD. NOW HERE IS THE SCARY PART, ROUTE 3 IS A CURVY AND WINDING ROAD. NO ACCIDENT HAS OCCURRED, AS YET. BUT WHEN IT DOES WE COULD BE WRAPPED AROUND A TREE GOING AT 55 MILES PER.  SO PLEASE HELP US. WE HAVE BEEN DEALING A FORD DEALER BY THE NAME OF \"PURVIS FORD AND HAVE HAD NO SOLUTION TO OUR PROBLEM EVERY TIME WE HAVE LEFT OUR CAR WITH THEM. WE HAD TO PAY FOR A RENTAL EVERY TIME WE LEAVE THE CAR THERE. \"THE PROBLEM IS WHEN ARE DRIVING THE STEERING WHEEL LOCKS UP AND THE ENGINE QUITS\".  WE HAVE HAD THIS CAR SERVICED EVERY 3000 MILES SINCE THE DAY WE BOUGHT IT AND WE HAVE THE RECORDS TO PROVE IT.",
        "vin": "2FALP7362TX"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/01/2001",
        "dateOfIncident": "04/20/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 746243,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I ENTERED MY VEHICLE AND STARTED IT I ATTEMPTED TO PLACE THE TRANSMISSION INTO DRIVE.  THE SELECTOR LEVER JUST HUNTED BUT COULD NOT FIND THE PROPER GEAR.  I HAD MY VEHICLE TOWED TO MY TRANSMISSION REPAIR SHOP: JIM JENNINGS TRANSMISSIONS, 601 EASTERN BLVD., ESSEX, MD, 21221, 410-686-6700.  THEY INFORMED ME THAT A RETAINER BOLT HAD FALLEN FROM BENEATH THE DASH THAT SUPPORTED THE TRANSMISSION SELECTOR CABLE HOUSING.  THEY ALSO STATED THAT THIS HAD BECOME A COMMON PROBLEM WITH THIS TYPE OF VEHICLE.  THE FIX WAS TO REPLACE IT WITH THREAD LOCKER.*AK",
        "vin": "2FALP74W0TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/18/2001",
        "dateOfIncident": "05/01/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 888621,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "INTAKE MANIFOLD HAS CRACKED, ALLOWING WATER TO LEAK AND SPRAY INTO  ALTERNATOR AND DESTROY IT.  MANIFOLD NEEDS TO BE REPLACED.  *AK  ALSO OVERHEATING CAUSED TRANSMISSION TO FAIL, WHEN THE MANIFOLD LEAKED OUT ALL THE COOLANT, THERE WAS NO INDICATION OF IT, BECAUSE THE TEMPERATURE SENSOR DOES NOT REGISTER UNLESS ITS IN LIQUID.*JB",
        "vin": "2FALP73WXT1"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/08/2001",
        "dateOfIncident": "05/04/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 887746,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING AT 70 MPH FOR ABOUT TWO HOURS CONSUMER NOTICED A RATTLE AND SMOKE COMING FROM ENGINE.   PULLED OVER AND NOTICED ALL  RADIATOR FLUID HAD LEAKED TO  GROUND.  TOOK CAR TO FORD, AND THEY SAID INTAKE MANIFOLD WAS CRACKED, AND WHOLE ENGINE NEEDED TO BE REPLACED.*AK",
        "vin": "2FALP74WOTX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/07/2001",
        "dateOfIncident": "05/05/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 887576,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WAS TRAVELING 45MPH ON  HIGHWAY AND WAS IN  PROCESS OF PASSING ANOTHER VEHICLE.  HE NOTICED THAT VAPOR TRAIL  STEAM AND ANTI FREEZE COOLANT WAS PURING ONTO THE ENGINE. HE WAS ABLE TO PULL OVER TO  SHOULDERS.   VEHICLE HAD TO BE TOWED.  FORD DEALERSHIP TOLD HIM THAT  INTAKE MANIFOLD WAS MADE OUT OF PLASTIC.  *AK",
        "vin": "2FKLT73WXTX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/02/2001",
        "dateOfIncident": "04/20/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 744834,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD MY 1996 CROWN VICTORIA IN FOR ITS' REGULAR PREVENTATIVE MAINTENANCE.  MY MECHANIC (WHOM I HAVE BEEN GOING TO FOR 15 YEARS) DISCOVERED THE COOLANT WAS LOW.  UPON FURTHER INSPECTION; THE MANIFOLD WAS FOUND TO HAVE A CRACK IN IT AND WAS SLOWLY LEAKING OUT COOLANT.  THIS IS THE ORIGINAL FORD PART AND IS NOT UNDER A RECALL AT THIS TIME.  HOWEVER, UPON CONTACTING MY FORD DEALER - I WAS INFORMED THAT THIS PART HAS BEEN RECALLED FOR THE POLICE VEHICLES (SAME MAKE, MODEL AND YEAR).  I HAVE BEEN IN CONTACT WITH FORD.  THEY SAID IF THERE WOULD BE A RECALL, I WOULD BE ELIGIBLE FOR A REFUND FOR THIS REPAIR.  FORD GAVE ME THE NHTSA'S WEB SITE SO I CAN MOVE FORWARD ON A RECALL FOR THIS FORD PART.  THIS IS CLEARLY A DEFECTIVE PART - GIVEN THE LOW MILEAGE (LESS THAN 65,000) OF MY CAR.  I WANT TO KNOW WHAT ELSE I NEED TO DO TO PURSUE A RECALL FOR THIS DEFECTIVE PART.  THANK YOU.",
        "vin": "2FALP74W4TX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/17/2001",
        "dateOfIncident": "12/09/1998",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 560795,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ARIZONA DEPT PUBLIC SAFETY & PHOENIX POLICE DEPT ARE REPORTING HIGH OCCURENCES OF FIRES ASSOCIATED WITH REAR-END COLLISION OF THE CROWN VICTORIA VEHICLES, AN OFFICER WAS KILLED WHEN HIS VEHICLE WAS STRUCK FROM BEHIND AND BURST INTO FLAMES, THE OFFICER WAS STOPPED AT A COLLISION SCENE AND THE OTHER VEHICLE WAS TRAVELING INEXCESS OF 66 MILES MPH AT IMPACT, AUTHORITIES SUSPECT FUEL SYSTEM RELATED(NO VIN GIVEN)*JB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/17/2001",
        "dateOfIncident": "03/26/2001",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 560795,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ARIZONA DEPT PUBLIC SAFETY & PHOENIX POLICE DEPT ARE REPORTING HIGH OCCURENCES OF FIRES ASSOCIATED WITH REAR-END COLLISION OF THE CROWN VICTORIA VEHICLES, AS THE POLICE OFFICER HAD JUST BEGUN TO ACCELERATE FROM A STOP LIGHT, HIS VEHICLE WAS STRUCK FROM BEHIND AND BURST INTO FLAMES, THE OFFICER SUFFERED SEVERE BURNS, AUTHORITIES SUSPECT POSSIBLE FUEL SYSTEM RELATED.*JB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/17/2001",
        "dateOfIncident": "03/26/2001",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 560795,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ARIZONA DEPT PUBLIC SAFETY & PHOENIX POLICE DEPT ARE REPORTING HIGH OCCURENCES OF FIRES ASSOCIATED WITH REAR-END COLLISION OF THE CROWN VICTORIA VEHICLES, AS THE POLICE OFFICER HAD JUST BEGUN TO ACCELERATE FROM A STOP LIGHT, HIS VEHICLE WAS STRUCK FROM BEHIND AND BURST INTO FLAMES, THE OFFICER SUFFERED SEVERE BURNS, AUTHORITIES SUSPECT POSSIBLE FUEL SYSTEM RELATED.*JB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/12/2001",
        "dateOfIncident": "04/11/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 885752,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "INTAKE MANIFOLD BLEWOUT. FORD HAS AN EXTENDED WARRANTY PROGRAM FOR THIS, BUT WILL NOT COVER THIS VEHICLE.*AK",
        "vin": "2FALP7362TX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/11/2001",
        "dateOfIncident": "04/10/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 743869,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "4.6L ENGINE PLASTIC INTAKE MANIFOLD CRACK LEAKING HOT COOLANT.*AK",
        "vin": "2FALP7460TX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/07/2001",
        "dateOfIncident": "04/02/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 743692,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INTAKE MANIFOLD CRACKED, LEAKING COOLANT. FORD REFUSES TO REPAIR IT BECAUSE IT IS NOT A FLEET VEHICLE (REFER TO FORD PROGRAM #01M02).*AK",
        "vin": "2FALP74W1TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/03/2001",
        "dateOfIncident": "04/02/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 884917,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING  TEMPERATURE GAUGE WENT UP, CAR OVER HEATED.  CONSUMER LATER NOTICED THAT INTAKE MANIFOLD CRACKED.*AK",
        "vin": "2FALP73W7TX"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/26/2001",
        "dateOfIncident": "03/23/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 743049,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FORD",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE VEHICLE WAS PURCHASED IN 1999, I HAVE REPORTED TO FORD MOTOR AND BUDGET CAR SALES THE PROBLEM WITH THE BRAKE SYSTEM, BRAKES JAM, VEHICLE GOES BACKWARD AND JERKS FORWARD WHILE SITTING IN TRAFFIC. FORD MOTOR CO. REFUSES TO TAKE RESPONSIBILTY FOR THE MANUFACTURING DEFECT AND BUDGET AUTO SALES SAYS THEY CANNOT FIND THE PROBLEM AND I NEED TO WAIT UNTIL \"SOMETHING HAPPENS\"  THIS VEHICLE IS A DEATH TRAP AND I IMPLORE SOMEONE TO ASSIST ME IN GETTING THESE DEFECTS CORRECTED BEFORE SOMEONE IS KILLED.*AK",
        "vin": "1MELM50U5TG"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/26/2001",
        "dateOfIncident": "03/23/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 743052,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FORD",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE THE PURCHASE OF THIS VEHICLE (1996 FORD SABLE) I HAVE HAD PROBLEMS..THE CAR SHUTS OFF AT SPEEDS OF 10MPH, WHILE SITTING IN TRAFFIC, OR ATTEMPTING TO ACCELERATE.  I HAVE REPORTED THIS PROBEM TO NHTSA, THE DEALER, FORD MOTOR CO. AND THE LOCAL NEWSPAPER, THE DEALER SAYS HE CAN NOT FIX IT UNTIL IT DUPLICATES WHILE HE HAS IT...AGAIN HE SAYS \"WAIT UNTIL SOMETHING HAPPENS\" , I ASKED IF HE WERE WAITING FOR SOMEONE TO BE INJURED OR KILLED HE SAID UNFORTUNATELY THAT'S WHAT WILL HAVE TO HAPPEN IN ORDER TO LOCATE THE PROBLEM. I FIND THIS TO BE A LUDICRUOUS ANSWER, FORD MOTOR COMPANY SHOULD TAKE RESPONSIBLITY FOR MANUFACTURER DEFECTS. FORD MOTOR COMPANY REFUSES TO CORRECT THESE DEFECTS.*AK",
        "vin": "1MELM50U5TG"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/23/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 560509,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE TIRES CAUSED THE FLOORBOARD TO VIBRATE AND THE VEHICLE TO SHIMMY WHILE DRIVING, THE VEHICLE COULD NOT BE DRIVEN OVER 40 MPH, THE CONSUMER PURCHASED A DIFFERENT BRAND OF TIRES NOW THE VIBRATION AND SHIMMY HAS CEASED (MICHELIN P215-60RX15).  NLM",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/07/2001",
        "dateOfIncident": "02/07/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 740573,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "4.6L ENGINE PLASTIC INTAKE MANIFOLD CRACK LEAKING HOT COOLANT.  *AK",
        "vin": "2FALP71W7TX"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/31/2001",
        "dateOfIncident": "01/22/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 740213,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS AN ONGOING PROBLEM WITH ALL OF OUR 1995-1997 CROWN  CROWN VICTORIAS.  NO SAFETY DEFECT LISTED IN SUMMARY.  *AK",
        "vin": "2FALP71W2TX"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/12/2000",
        "dateOfIncident": "07/06/1999",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 785103,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT SUSPENSION COMPONENTS HAVE FAILED (TIE RODS, CONTROL ARMS).   *MJS",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/06/2000",
        "dateOfIncident": "10/27/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 735872,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 10/26/2000, THE MASS AIR FLOW SENSOR WAS REPLACED DUE TO THE CHECK ENGINE LIGHT COMING UP AND DIFFICULTY IN STARTING THE VEHICLE. AFTER THE REPLACEMENT, THESE PROBLEMS WERE SOLVED. HOWEVER, A NEW PROBLEM APPEARED. THE VEHICLE STALLED WITHOUT ANY WARNING. IT HAPPENED TWICE WITHIN A 24-HOUR PERIOD. IN BOTH INCIDENTS, IT HAPPENED ON A SLOW LEFT TURN AFTER EXITING AN INTERSTATE HIGHWAY. AT THE SAME TIME, THE POWER STEERING WAS DISABLED. THIS CREATED A MAJOR SAFETY HAZARD SINCE I HAD MINIMAL CONTROL OF THE VEHICLE. IN FACT, I ALMOST HIT A LAMPPOST. I CONTACTED THE DEALER, BUT THEY COULD NOT IDENTIFY THE CAUSE YET. IN FACT, THEY COULD NOT EVEN REPRODUCE THE PROBLEM. I HAVE A FEELING THAT THIS IS DUE TO A DEFECTIVE MASS AIR FLOW SENSOR, BUT THE DEALER DOES NOT AGREE. THE DEALER SAID THAT THEY ARE GOING TO INSTALL A FLIGHT RECORDER ON THE VEHICLE TO FURTHER INVESTIGATE THE CAUSE OF THE PROBLEM.",
        "vin": "2FALP74W4TX"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/26/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 735209,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FORD",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS M/V HAS BEEN WORKED ON AT LEAST 15-20 TIMES FOR THE SAME PROBLEM IN THE BEGINING CAR WAS TAKEN TO SULLIVAN  BROS WHILE UNDER WARRENTIE AND FOUND NOTHING WRONG. SINCE 7-2000 THIS CAR WAS AT TWO DEALERS AND THE COST CLOSE TO $800,00  CAR STILL HAS SAME PROBLEMS. STALLS  THE PAST WEEK THIS CAR HAS ALMOST BEEN IN TWO ACCIDENTS AS THE CAR HAS STALLED WHILE MAKING LEFT TURN INTO ON COMING LANES. CAR STALLS AND EVERY THING GOES DEAD. SINCE AUGUST THE CAR HAS BEEN WORKED ON AT  SHIRETOWN FORD INC 147 SAMOSET ST PLYMOUTH MA #02360   STILL WAITING FOR PHONECALL TO BRING CAR BACK AGAIN         WHAT CAN I DO.  *AK",
        "vin": "1LNLM82W9TY"
    },
    {
        "components": "SUSPENSION,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/20/2000",
        "dateOfIncident": "10/20/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 873522,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 60 MPH INTAKE MANIFOLD CRACKED AND COOLANTS WAS ALL OVER THE ENGINE. IT  WAS ALMOST INPOSSIBLE TO KEEP CONTROL OF VEHICLE.  LOWER  BALL JOINTS WERE CRACKED. TECHNICIAN STATED THAT FORD WAS FIXING THIS PROBLEM ON THE POLICE VEHICLES.  *AK",
        "vin": ""
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/16/2000",
        "dateOfIncident": "07/29/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 873096,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHENEVER THE VEHICLE IS IN LOW IDLE ENGINE WOULD STALL.  PROBLEM IS INTERMITTENT & WOULD HAVE NO WARNING. BEEN TO DEALERSHIP 3 DIFFERENT TIMES & MECHANIC CAN NOT LOCATE CAUSE OF PROBLEM. HAD  AIR FLOW SENSOR REPLACED DUE TO CHECK ENGINE LIGHT COMING ON.  *AK",
        "vin": "2FA1P7460TX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/28/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 871713,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "INTAKE MANIFOLD HAS MALFUNCTIONED WHICH  CAUSED ANTI FREEZE TO LEAK INTO  ENGINE COMPARTMENT,  RESULTING IN A POSSIBLE FIRE HAZARD.  CONSUMER HAS CONTACTED DEALER, DEALER HAS REPLACED  INTAKE MANIFOLD. PLEASE PROVIDE ANY FURTHER DETAILS.*AK",
        "vin": "2FALP74WOTX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/26/2000",
        "dateOfIncident": "09/17/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 871560,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "MANIFOLD PIPE IS CRACKED, IT IS MADE OUT OF PLASTIC AND WATER IS LEAKING OUT, AND VEHICLE OVERHEATED.   CONSUMSER HAS CONTACTED THE DEALERSHIP.*AK",
        "vin": "2SLP74W6TX1"
    },
    {
        "components": "PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "09/25/2000",
        "dateOfIncident": "09/25/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 732495,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "PARKING BRAKE: THE LINING ON THE PARKING BRAKES (DRIVER SIDE) WAS SEPARATED AND WOULD NOT ENGAGE THE PARKING BRAKE WHEN APPLIED. THE PROBLEM WITH THE DISK/DRUM COMBINATION OF THE REAR ROTORS IS THAT DURING BRAKES INSPECTIONS THE \u0011PARKING BRAKE\u0012 CAN BE OVERLOOK. IF THE BRAKE LINING WERE TO SEPARATE WHILE DRIVE AT HIGHWAY SPEEDS IT HAS THE POTENTIAL TO CAUSE A WHEEL TO FREEZE AND MAKE THE DRIVER LOSE CONTROL OF THE VEHICLE.*AK",
        "vin": "2FALP73W1TX"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/25/2000",
        "dateOfIncident": "09/25/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 732496,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE IGNITION SWITCH WILL RELEASE THE IGNITION KEY BEFORE IT IS IN THE PROPER OFF POSITION. AT TIMES THERE IS A WARNING SOUND AND OTHER TIMES THERE IS NONE. WITH THE IGNITION KEY REMOVED BEFORE THE OFF POSITION IT WILL ALLOW THE CAR TO BE STARTED WITHOUT A KEY. THIS PRESENTS TWO RISKS: ONE - THE CAR CAN BE STOLEN, SECOND \u0016 A CHILD COULD ACCIDENTALLY START THE CAR AND PUT THE CAR IN GEAR. *AK",
        "vin": "2FALP73W1TX"
    },
    {
        "components": "PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "09/25/2000",
        "dateOfIncident": "09/25/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 732495,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "PARKING BRAKE: THE LINING ON THE PARKING BRAKES (DRIVER SIDE) WAS SEPARATED AND WOULD NOT ENGAGE THE PARKING BRAKE WHEN APPLIED. THE PROBLEM WITH THE DISK/DRUM COMBINATION OF THE REAR ROTORS IS THAT DURING BRAKES INSPECTIONS THE \u0011PARKING BRAKE\u0012 CAN BE OVERLOOK. IF THE BRAKE LINING WERE TO SEPARATE WHILE DRIVE AT HIGHWAY SPEEDS IT HAS THE POTENTIAL TO CAUSE A WHEEL TO FREEZE AND MAKE THE DRIVER LOSE CONTROL OF THE VEHICLE.*AK",
        "vin": "2FALP73W1TX"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/25/2000",
        "dateOfIncident": "09/25/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 732496,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE IGNITION SWITCH WILL RELEASE THE IGNITION KEY BEFORE IT IS IN THE PROPER OFF POSITION. AT TIMES THERE IS A WARNING SOUND AND OTHER TIMES THERE IS NONE. WITH THE IGNITION KEY REMOVED BEFORE THE OFF POSITION IT WILL ALLOW THE CAR TO BE STARTED WITHOUT A KEY. THIS PRESENTS TWO RISKS: ONE - THE CAR CAN BE STOLEN, SECOND \u0016 A CHILD COULD ACCIDENTALLY START THE CAR AND PUT THE CAR IN GEAR. *AK",
        "vin": "2FALP73W1TX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/13/2000",
        "dateOfIncident": "08/01/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 731368,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INTAKE MANIFOLD ON THE 1996 CROWN VICTORIA IS MADE OUT OF PLASTIC.  I BEGAN NOTICING AN \"ANTIFREEZE SMELL\" SEVERAL WEEKS BEFORE THE PROBLEM WAS FINALLY ISOLATED.  EVIDENTLY, THE MANIFOLD WAS CRACKED AND WOULD NOT OPEN UP UNTIL THE ENGINE REACHED A CERTAIN TEMPERATURE.  THEN WHEN THE TEMPERATURE REACHED THAT POINT THE ANTIFREEZE WOULD SPEW OUT ON TOP OF THE HOT ENGINE.  WHEN THE HOOD WAS RAISED YOU COULD SEE THE MOISTURE ON THE NON-HOT PARTS.  THE RESERVOIR WOULD BE DOWN ABOUT ONE OR TWO INCHES.  I KEPT REFILLING IT WITH ANTIFREEZE.  FINALLY, I CARRIED IT TO THE SHOP THINKING IT WAS A PIN HOLE IN THE HOSE OR A HUNG THERMOSTAT.  IT WAS NEITHER.  IT WAS A CRACKED INTAKE MANIFOLD.  THE REPAIR COST $583.41.  I HAVE THE PART AND A COPY OF THE INVOICE.  *AK",
        "vin": "2FALP7368TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/06/2000",
        "dateOfIncident": "08/21/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 730406,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "VEH. # 1, \"WIFE'S CAR-1996 FORD CV WITH A 4.6 LTR. 281CU ENGINE SUFFERED A CRACKED PLASTIC MANIFOLD IN APRIL OF 2000 WHILE ENROUTE TO WORK.  VEHICLE HAS 85,000 MILES ON IT.  COST OF REPAIR WAS $839.00 .  FORD SHOP SAID THAT CAR WAS OUT OF WARRANTY.  VEH. NO. 2, \"HUSBANDS CAR\" SUSTAINED A CRACKED PLASTIC INTAKE MANIFOLD ON 8-21-2000, CAR HAD 105,000 MILES ON IT. COSTS OF REPAIR WAS 739.00. FORD SHOP SAID THAT THEY WERE GIVING ME A DEAL BUT THAT MANUF. WARRANTY WAS EXPIRED.  I SPOKE TO APPROX. 22 FORD DEALERS AND PARTS HOUSE'S AND QUESTIONED THE NUMBER OF PLASTIC MANIFOLD INTAKE THAT HAVE BEEN REPLACED AND FOUND THAT THIS IS A COMMON FAILURE AND MOST PLACES SELL MORE THAN TWO DOZEN EACH MONTH.  FORD CO. REFUSED TO DISCUSS THE MATTER WITH ME.  TOLD ME TO WRITE A LETTER AND THEY WOULD LOOK AT IT.  *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/06/2000",
        "dateOfIncident": "08/21/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 730406,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "VEH. # 1, \"WIFE'S CAR-1996 FORD CV WITH A 4.6 LTR. 281CU ENGINE SUFFERED A CRACKED PLASTIC MANIFOLD IN APRIL OF 2000 WHILE ENROUTE TO WORK.  VEHICLE HAS 85,000 MILES ON IT.  COST OF REPAIR WAS $839.00 .  FORD SHOP SAID THAT CAR WAS OUT OF WARRANTY.  VEH. NO. 2, \"HUSBANDS CAR\" SUSTAINED A CRACKED PLASTIC INTAKE MANIFOLD ON 8-21-2000, CAR HAD 105,000 MILES ON IT. COSTS OF REPAIR WAS 739.00. FORD SHOP SAID THAT THEY WERE GIVING ME A DEAL BUT THAT MANUF. WARRANTY WAS EXPIRED.  I SPOKE TO APPROX. 22 FORD DEALERS AND PARTS HOUSE'S AND QUESTIONED THE NUMBER OF PLASTIC MANIFOLD INTAKE THAT HAVE BEEN REPLACED AND FOUND THAT THIS IS A COMMON FAILURE AND MOST PLACES SELL MORE THAN TWO DOZEN EACH MONTH.  FORD CO. REFUSED TO DISCUSS THE MATTER WITH ME.  TOLD ME TO WRITE A LETTER AND THEY WOULD LOOK AT IT.  *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/05/2000",
        "dateOfIncident": "08/20/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 869558,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ABOUT 5 MPH AND MAKING A SHARP TURN ON A CITY STREET  ENGINE STALLLED WITHOUT PRIOR WARNING.HAD NOT HAPPENED AGAIN SINCE THIS DATE.*AK VEHICLE STALLED 2 MORE TIMES SINCE SEP 2000",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/27/2000",
        "dateOfIncident": "08/27/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 729283,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SUMMARY",
        "vin": "2FALP74W7TX"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/23/2000",
        "dateOfIncident": "08/15/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 868426,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES WERE VIBRATING VERY LOUD, CONSUMER WAS VERY CONCERNED THAT BRAKES WERE GOING  TO QUIT.*AK   THE FRONT DISC ROTORS FAILURE AND FRONT ROTORS PULSATING WAS THE CAUSE FOR LOUD VIBRATION OF BRAKES.  THE PROBLEM REOCCORED DUE TO BRAKE PAD FAILURE.   *YH",
        "vin": "2FALP74WXTX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/09/2000",
        "dateOfIncident": "06/28/2000",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 727206,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "CITY OF PENSACOLA POLICE VEHICLE A 1996 CROWN VICTORIA, UNIT 842, CAUGHT FIRE WHILE IT WAS PARKED AND SHUT OFF WHILE PARKED UNDER A CARPORT DAMAGING THE RENTED MOBILE HOME AND TOTALLING THE VEHICLE.  OUR JOFFICER WAS ASLEEP AT THE TIME AND WAS AWAKEN BY A NEIGHBOR WHO ADVISED HIM THAT THE VEHICLE WAS ON FIRE.  THIS COULD HAVE BEEN A FATALITY  .ITY",
        "vin": "2FALP71W5TX"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/18/2000",
        "dateOfIncident": "06/06/1998",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 865614,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT HIGHWAY SPEEDS, MAKING A TURN ON A SMOOTH CURVE,  VEHICLE JUST STRAIGHTENED OUT UNEXPECTEDLY.  PITMAN ARM AND  CONTROL ARM WERE RELACED AT OWNER'S EXPENSE. *AK",
        "vin": "2FALP71W5TX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/17/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 553013,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECT IN DESIGN CAUSED THE INTAKE MANIFOLD TO FAIL, MANIFOLD IS CONSTRUCTED OF PLASTIC WHICH IS TOO WEAK OF A MATERIAL.  YH",
        "vin": "2FALP7364TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/17/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 553013,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "COOLING SYSTEM IS LEAKING.  YH",
        "vin": "2FALP7364TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/06/2000",
        "dateOfIncident": "05/13/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 864880,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL PAN EXPERIENCING PROBLEM WITH SEVERE RUST AND CORROSION  WHICH CAUSING OILS LEAKAGES. DEALER / MANUFACTURER WERE NOT CONTACTED AT THIS TIME.*AK",
        "vin": "PLEASE FILL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/03/2000",
        "dateOfIncident": "06/28/2000",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 724868,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR POLICE OFFICER PARKED HIS POLICE UNIT # 842 A 1996 FORD CROWN VICTORIA UNDER HIS CAR PORT AREA AFTER COMPLETING HIS SHIFT AND WAS ASLEEP AT THE TIME HIS NEIGHBOR ALERTED HIM THAT HIS VEHICLE WAS ON FIRE WITH FLAMES COMING FROM UNDER THE HOOD.  ATEMPTS TO PUT OUT THE FIRE WITH EXTINGUISHER  WERE NOT SUCCESSFUL.  THE FIRE DEPT WAS CALLED AND RESPONDED.  THE FIRE ALSO ENGULFED THE CARPORT AND PORTIONS OF THE DOUBLE WIDE MOBILE HOME.  ACCORDING TO THE STATE FIRE MARSHALL THE FIRE DEVELOPED IN THE ENGINE COMPARTMENT AND WAS THE REULT OF AN ELECTRICAL MALFUNCTION.*AK",
        "vin": "2FALP71W5TX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/30/2000",
        "dateOfIncident": "06/20/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 864597,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "INTAKE MANIFOLD HAD A CRACK IN THE MOLD LINE, CAUSING A COOLANT LEAK.   MANUFACTURER NOTIFIED, AND INFORMED CONSUMER THAT THE VEHICLE   WAS NOT COVERED UNDER MANUFACTURER'S RECALL.   FEEL FREE TO PROVIDE FURTHER DETAILS.  *AK",
        "vin": "2FALP74W9TX"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/04/2000",
        "dateOfIncident": "01/01/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 723542,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "CABLE THAT CONTROLS WINDOW MOVEMENT BECAME FRAYED, THEN BROKE ATTACHMENTS TO WINDOW THROUGH OVERSTRESSING",
        "vin": "2FALP74W9TX"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "05/02/2000",
        "dateOfIncident": "09/26/1998",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 722170,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SHIFTED TO REVERSE AT HWY SPEED,LOCKING REAR WHEELS CAUSING ACCIDENT.  *AK",
        "vin": "2FALP71WXTX"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "04/28/2000",
        "dateOfIncident": "07/21/1999",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 552029,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "PRIOR TO RECALL (97V-024) THE LATCH ON THE HOOD RELEASED AND SLAMMED INTO THE VEHIICLE'S WINDSHIELD WHILE DRIVING ON HIGHWAY (ATTORNEY FOR CLIENT JEROME T. LINNEN,JR). YH",
        "vin": "2FALP74WXTX"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/17/2000",
        "dateOfIncident": "04/16/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 721581,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LINE FOWARD OF REAR AXLE AND ABOVE FUEL FILTER RUBS ON CAR BODY RESULTING IN A HOLE IN BRAKE LINE",
        "vin": "2FALP71W7TX"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/17/2000",
        "dateOfIncident": "04/16/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 721581,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LINE FOWARD OF REAR AXLE AND ABOVE FUEL FILTER RUBS ON CAR BODY RESULTING IN A HOLE IN BRAKE LINE",
        "vin": "2FALP71W7TX"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "03/31/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 859557,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE VEHICLE WAS IN PARK CONSUMER WALKED BEHIND  VEHICLE AND  VEHICLE SHIFTED ON ITS OWN  INTO REVERSE, STRIKING THE CONSUMER WITH THE REAR PASSENGER DOOR WHICH WAS OPEN.  DEALER HAS BEEN CONTACTED.  *AK",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/12/2000",
        "dateOfIncident": "03/09/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 720001,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FORD",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SUMMARY LISTED FOR ABOVE VEHICLE.  *AK",
        "vin": "2FTHF25H3TC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/11/2000",
        "dateOfIncident": "12/10/1999",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 856772,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ENGINE CHECK LIGHT CAME ON, AND THE NEXT DAY CONSUMER TRY TO START VEHICLE,  BUT IT COULDN'T START.  ENGINE  HAD BEEN REPLACED,  PROBLEM STILL EXITS.  *AK",
        "vin": "2FSLP74W4TX"
    },
    {
        "components": "SUSPENSION,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/08/2000",
        "dateOfIncident": "12/12/1999",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 856556,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE ROCKER ARM WAS REPLACED.   ALSO, CONSUMER EXPERIENCED SHAKING AND TREMBLING WHEN HE DROVE VEHICLE.  *AK",
        "vin": "2FALP74WTX1"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/06/1999",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 853697,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE USING HIGH BEAMS IN RAIN, WINDSHIELD WIPERS WOULD STOP WORKING. DEALER HAS BEEN NOTIFIED. PLEASE PROVIDE FURTHER INFORMATON. *AK",
        "vin": ""
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "11/23/1999",
        "dateOfIncident": "09/27/1999",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 715166,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "OFFICER WAS TRAVELING NORTHBOUND ON SUMMIT AVE E AT APPROXIMATELY 30-35MPH.  AT THE INTERSECTION OF SUMMIT AND E. HARRISON ST, THE OFFICER SLOWED TO CLEAR THE INTERSECTION AND TO NEGOTIATE HER PATROL VEHICLE AROUND A TRAFFIC CIRCLE.  THE OFFICER NEGOTIATED HER VEHICLE AROUND THE CIRCLE.  NORTH OF THE INTERSECTION, THE OFFICER ATTEMPTED TO BRAKE, BUT THE BRAKES DID NOT RESPOND - ABS LIGHT WAS ON AND THE ABS MODE DID NOT FUNCTION.  THE OFFICER THEN ATTEMPTED TO STRAIGHTEN THE VEHICLE, BUT FOUND THAT THE STEERING HAD FAILED AS WELL.  THE VEHICLE FISHTAILED.  THE OFFICER'S VEHICLE WAS NOW HEADING WEST TOWARDS A LEGALLY PARKED VEHICLE ON THE WEST SIDE OF SUMMIT AVE. E.  THE OFFICER ATTEMPTED TO STEER TO THE RIGHT TO STRAIGHTEN OUT THE VEHICLES MOVEMENT.  THE OFFICER FOUND THAT THE STEERING WHEEL WOULD NOT TURN LIKE IT HAD BEEN LOCKED.  THE VEHICLE HAD TOTAL STEERING FAILURE.   THE OFFICER WAS HEADED STRAIGHT TOWARDS THE PARKED VEHICLE, JERKED THE STEERING WHEEL AS HARD AS SHE COULD TO THE RIGHT.  HER VEHICLE RESPONDED BUT ENDED UP HITTING TWO PARKED VEHICLES ON THE EAST SIDE OF THE STREET.  THESE VEHICLES WERE PUSHED INTO TWO ADDITIONAL VEHICLES AND A MOTORCYLE.  THE OFFICE WAS TREATED FOR NECK AND BACK INJURIES. *AK",
        "vin": "2FALP71W0TX"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/08/1999",
        "dateOfIncident": "11/05/1999",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 714460,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION FLUID IN MY CAR IS NO LONGER RED BUT A MUDDY COLOR. THE CLUTCH PLATES ARE CHUDDERING WHEN THE CAR SHIFTS INTO OVER DRIVE AND LOCK UP,ONCE THE CAR SHIFTS THE TRANSMISSION IS IN AND OUT ALL THE TIME.",
        "vin": "2FALP74W3TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/17/1999",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 713442,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "IT GETS TOO HOT BECAUSE OF CATALIC CONVERTER RIGHT UNDER DRIVER SEAT. LACK OF PROPER INSULATION.",
        "vin": "2FALP72W2TX"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "10/13/1999",
        "dateOfIncident": "09/27/1999",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 713237,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "OFFICER WAS TRAVELING NORTHBOUND ON SUMMIT AVE E AT APPROXIMATELY 30-35MPH.  AT THE INTERSECTION OF SUMMIT AND E. HARRISON ST, THE OFFICER SLOWED TO CLEAR THE INTERSECTION AND TO NEGOTIATE HER PATROL VEHICLE AROUND A TRAFFIC CIRCLE.  THE OFFICER NEGOTIATED HER VEHICLE AROUND THE CIRCLE.  NORTH OF THE INTERSECTION, THE OFFICER ATTEMPTED TO BRAKE BUT THE BRAKES DID NOT RESPOND - ABS LIGHT WAS ON AND THE ABS MODE DID NOT FUNCTION.  THE OFFICER THEN ATTEMPTED TO STRAIGHTEN THE VEHICLE BUT FOUND THAT THE STEERING HAD FAILED AS WELL.  THE VEHICLE FISHTAILED.  THE OFFICER'S VEHICLE WAS NOW HEADING WEST TOWARDS A LEGALLY PARKED VEHCILE ON THE WEST SIDE OF SUMMIT AVE. E.  THE OFFICER ATTEMPTED TO STEER TO THE RIGHT TO STRAIGHTEN OUT THE VEHICLES MOVEMENT.  THE OFFICER FOUND THAT THE STEERING WHEEL WOULD NOT TURN LIKE IT HAD BEEN LOCKED.  THE VEHICLE HAD TOTAL STEERING FAILURE.   THE OFFICER WAS HEADED STRAIGHT TOWARDS THE PARKED VEHICLE, JERKED THE STEERING WHEEL AS HARD AS SHE COULD TO THE RIGHT.  HER VEHICLE RESPONDED BUT ENDED UP HITTING TWO PARKED VEHICLES ON THE EAST SIDE OF THE STREET.  THESE VEHICLES WERE PUSHED INTO TWO ADDITIONAL VEHICLES AND A MOTORCYLE.  THE OFFICE WAS TREATED FOR NECK AND BACK INJURIES.",
        "vin": "2FALP71W0TX"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/08/1999",
        "dateOfIncident": "09/09/1999",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 850347,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD WIPERS FAILS TO WORK PROPERLY WHEN IN USE. WINDSHIELDWIPERS STOPPED WORKING IN MIDDLE OF A DOWNPOUR. HAD TO STOP VEHICLE & GET OUT & JIGGLE WIPERS TO GET THEM WORKING AGAIN. THIS CAUSED HAVOC WITH THE DRIVER'S VISIBILIT. WILL BE TAKING VEHICLE TO DEALER TO HAVE THEM CHECK IT. *AK",
        "vin": "FILL IN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/06/1999",
        "dateOfIncident": "09/27/1999",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 850130,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS OF POWER STEERING WHEN MAKING QUICK LANE CHANGES OR MAKING SHARP TURNS. CONTACTED DEALER.  *AK",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/02/1999",
        "dateOfIncident": "12/05/1996",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 710853,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRE OCCURRED 6 HRS AFTER PARKING. DOES CROWN VIC USE SAME SPEED CONTROL DEACTIVATION SWITCH AS LINCOLNS? I UNDERSTAND THE LINCOLN TOWN CARS HAVE A RECALL FOR FIRES LIKE THIS.",
        "vin": "2FALP71W0TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/13/1999",
        "dateOfIncident": "12/15/1998",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 709971,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ABOVE MENTIONED CAR WAS TRADED IN AT A LOSE TO US, WE NOW OWN A 97 TAURUS WITH NO PROBLEMS.  FORD WAS CONTACTED, BUT THEY DID NOT SEEM TO CARE, WE DEPLETED OUR SAVINGS ACCOUNT OF $2000.00 IN A MONTH ON THIS CAR.  THE DEALER HASSELED US, BUT EVENTUALLY ATE THE COST TO FIX THE PLASTIC INTAKE MANIFOLD.  FROM SEPT. 15 ON SLIGHTLY CHILLY MORNINGS IT WOULD NOT CRANK, IT WAS WORKED ON THREE DIFFERENT TIMES AND I WAS OUT OF WORK FOR IT.  THEN THE HEAD GASKETS CRACKED, LEAVING ME OUT OF WORK AND A SAVINGS, AND IN DEC. THE INTAKE WENT OUT.  THE DEALER ATE THE REPAIR, BUT I HAD TO HAVE A MORE RELIABLE CAR SO I TRADED TO A TAURUS.  APPARENTLY I WAS NOT THE ONLY ONE TO GET A \"LEMON\".",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/03/1999",
        "dateOfIncident": null,
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 844217,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "AN ELECTRICAL SHORT UNDER THE HOOD IN THE AREA OF THE POWER DISTRIBITOR BOX CAUSED AN FIRE THAT TOTALED THE ENTIRE VEHICLE. DEALER HAS BEEN CONTACTED.  *AK",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/03/1999",
        "dateOfIncident": "07/31/1999",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 709562,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "AREA NEAR POWER DISTRIBUTION BOX (A/K/A ENGINE FUSE COMPARTMENT) STARTED FIRE WITH ELECTRICAL SHORT.  CAR WAS ONLY DRIVEN 4 MINUTES AT LOW RESIDENTIAL SPEEDS. PARKED IN DRIVEWAY OF OFFICERS HOME.  2 MINUTES LATER RAGING FIRE.  CAR WAS TOTALLED.  SATELLITE BEACH FIRE MARSHALL, LT. ABERNATHY PHONE 407-773-4405 HAS REPORT AND DIGITAL PHOTOS.  CAR HAS ONLY BEEN DRIVEN INTERMITTENTLY BEFORE, NOT ON ROUTINE PATROL.  NO SIRENS, STROBES, OR LIGHT BARS WERE BEING USED.",
        "vin": "2FALP71W0TX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/30/1999",
        "dateOfIncident": "03/03/1999",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 841434,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT PASSENGER'S SIDE CONTROL ARM BROKE.  OWNER HAS HAD  VEHICLE REPAIRED AT  HIS OWN EXPENSE.  A RECALL WAS ISSUED ON THE VEHICLE MAKE AND MODEL, HOWEVER, THIS VEHICLE WAS NOT INCLUDED.   MANUFACTURER HAS BEEN NOTIFIED.  *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/28/1999",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 841262,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 25 MPH, VEHICLE WILL SHUT DOWN WITHOUT PRIOR WARNING.  DEALER IS AWARE OF THE PROBLEM.  *AK  *YH",
        "vin": "2FALP73W8TX"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/27/1999",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 838527,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN BRAKES ARE APPLIED ON WET PAVEMENT THE PEDAL BECOMES HARD,  RESULTING IN EXTENDED STOPPING DISTANCE.  DEALER HAS REPLACED THE BRAKE BOOSTER,  PROBLEM STILL EXISTS.  PLEASE GIVE ANY FURTHER DETAILS.  *AK",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/27/1999",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 608923,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "STRESS CRACK OF THE FLOOR BOARD CAUSED THE BOLTS THAT HOLD THE FRONT DRIVERS SEAT SECURE TO BREAK RESULTING IN THE SEAT TO BE UNSTABLE AND LURCH BACKWARDS.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/23/1999",
        "dateOfIncident": "04/21/1999",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 706780,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INTAKE MANIFIOLD CRACKED, CAUSING THE COOLANT TO KEEP RUNNING OUT, THAT CRACK SUCKED IN SO MUCH AIR, CAUSING THE COOLANT TO STEAM AND THEN CAUSING MY ENGINE TO SEIZE UP. ALSO THE COOLANT WAS POURING ONTO THE ALTERNATOR, CAUSING IT TO GO BAD. FORD WILL NOT COVER ONE SINGLE BIT OF THEIR DEFECT. THEY RECALLED THE 96-97 TAXIS, INTERCEPTORS, AND MUSTANGS FOR THE SAME PROBLEM, JUST NOT MY CAR.  *AK",
        "vin": "2FALP74W0TX"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/10/1999",
        "dateOfIncident": "07/01/1997",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 706401,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAS MANY MORE PROBLEMS THAT ARE NOT LISTED AND THEY STARTED SHORTLY AFTER PURCHASE.  I HAVE ALL THE RECORDS WITH CORRECT DATES, TIMES, MILEAGES, AND ETC. OF ALL THE PROBLEMS. I WOULD BE MORE THAN HAPPY TO MAIL YOU COPIES OF EVERYTHING ABOUT MY VEHICLE. PLEASE FEEL FREE TO CONTACT ME. //  I USED A FAMILY MEMBERS COMPUTER TO SEND IN THIS COMPLAINT FORM SO PLEASE CONTACT ME BY MAIL OR TELEPHONE.   THANK YOU FOR YOUR TIME AND CONCERN IN THIS MATTER. *AK",
        "vin": "2FALP74W7TX"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/29/1999",
        "dateOfIncident": "01/30/1999",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 706091,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SUMMARY",
        "vin": "2FALP71W1TX"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/17/1999",
        "dateOfIncident": "04/01/1999",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 705731,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "SPEEDOMETER OCCASIONALLY FAILS TO REGISTER SPEED WHEN STARTING FROM STANDING STOP.WHEN THIS OCCURS IT USUALLY RETURNS THE SPEED READ-OUT WHEN APPROX. 35 MPH IS REACHED.FORD TESTED CAR BY DRIVING ON ROAD FOR 3 MILES.  *AK",
        "vin": "2FALP73W5TX"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/06/1999",
        "dateOfIncident": "04/01/1998",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 836551,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING AND TRYING TO USE THE WINDSHIELD WIPERS ,  WINDSHIELD WIPERS WORK INTERMITTENTLY.SOMETIMES  CONSUMER HAS TO PULL OVER TO THE SIDE OF THE ROAD UNTIL THE RAIN STOPS  IN ORDER  FOR THE CONSUMER  TO SEE.  *AK",
        "vin": "2F8LP74W5TX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/24/1999",
        "dateOfIncident": "02/24/1999",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 544550,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT PASSENGER SIDE BALL JOINT FAILED,DEALER REFUSED RECALL REPAIRS DUE TO MILAGE.",
        "vin": "2FALP71W4TX"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/22/1999",
        "dateOfIncident": "01/14/1999",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 835230,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "POLICE CRUISER: WHEN TURNING CORNERS, THE STEERING WHEEL IS VERY TIGHT AND HARD TO TURN. WOULD HAVE TO FORCE IT MANUALLY, TO ORIGINAL POSITION. THIS MAKES IT HARD TO DRIVE OR CONTROL  VEHICLE.  *AK",
        "vin": "2FALP71W7TX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/12/1999",
        "dateOfIncident": "02/12/1999",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 835808,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE EXPERIENCED LOWER BALL JOINT FAILURE WHILE DRIVING AT APPROIMATELY. 40 MPH. DEALER NOTIFIED AND INFORMED CONSUMER THAT VEHICLE WAS NOT UNDER A MANUFACTURER'S RECALL EVEN THOUGH A RECALL NOTICE WAS RECEIVED CONCERNING THAT DEFECT IN LATE JAN OF 1999.  *AK",
        "vin": "2FALP71W4TX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/04/1999",
        "dateOfIncident": "02/24/1999",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 835449,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WAS DRIVING APROXIMATELY 40MPH WHEN THE BALL JOINT SEPARATED. THERE IS AN OPEN INVESTIGATION AT THIS TIME--ID#-IE-98-040, THE VIN# OF THIS VEHICLE IS NOT INCLUDED.  CONSUMER'S OFFERING TO SEND PART(S) TO (ODI) IF WE WOULD LIKE, PLEASE CALL.  FORD HAS OFFERED TO TAKE PARTS BACK TO MI. TO LOOK AT.-----PLEASE ADD VIN.#.  *AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/04/1999",
        "dateOfIncident": "02/15/1999",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 704035,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT SUSPENSION LOWER CONTROL ARM BALL JOINT WAS WORE TO THE POINT OF POSSIBLE SEPERATION, THERE WAS A RECALL ON OR 1998 CROWN VIC , BUT THE RECALL WAS NOT MADE FOR THE 1996 AND THERE WAS A SERIOUS PROBLEM",
        "vin": "2FALP71W7TX"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC,FUEL SYSTEM, GASOLINE,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/19/1999",
        "dateOfIncident": "11/25/1998",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 703492,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEM INVOLVES NHTSA  RECALLS 98I001000 AND 98V322000.  DEALER AND FORD SAY MY CAR DOES NOT HAVE THESE PROBLEMS.  I DO NOT WANT TO TAKE THE CHANCE OF HAVING MY STEERING CONTROL FAIL, OR HAVING MY BRAKES FAIL.  PLEASE HELP.    ALSO, THE TRANSMISSION HAS AN EXTREMELY LONG SHIFT FROM FIRST TO SECOND.  FORD HAS A TSB ON THIS, AND STATES THIS WILL NOT AFFECT THE TRANSMISSION,BUT IT WILL SHORTEN THE LIFE AND LEAD TO POSSBILE ACCUMULATOR BORE SCUFFING.  THANKS!  *AK",
        "vin": "2FALP74W5TX"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/12/1999",
        "dateOfIncident": "02/07/1999",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 703223,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A 1996 CROWN VICTORIA WITH 58000 MILES. ONE OF THE SWITCHES UNDER",
        "vin": "2FALP73WXTX"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/02/1999",
        "dateOfIncident": "01/14/1999",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 702851,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING LOCKS UP AND WILL NOT RETURN.",
        "vin": "2FALP71W7TX"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/02/1999",
        "dateOfIncident": "01/11/1999",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 702852,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING LOCKS UP AND WILL NOT RETURN.",
        "vin": "2FALP71W9TX"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/02/1999",
        "dateOfIncident": "01/25/1999",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 702853,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING LOCKS UP AND WILL NOT RETURN.",
        "vin": "2FALP71W7TX"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/02/1999",
        "dateOfIncident": "01/26/1999",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 702854,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING LOKS UP AND WILL NOT RETURN.    *AK",
        "vin": "2FALP71W7TX"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/02/1999",
        "dateOfIncident": "01/26/1999",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 702855,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING LOCKS UP AND WILL NOT RETURN. *AK",
        "vin": "2FALP71W0TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/21/1998",
        "dateOfIncident": "12/12/1998",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 832507,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER HAS EXPERIENCED PROBLEMS WITH ELECTRICAL WIRING. VEHICLE WAS PARKED FOR 24 HOURS BEFORE IT BURST INTO FIRE.  THE CONSUMER PUT THE FIRE OUT.  THE MANUFACTURER HAS YET TO BE CONTACTED.  *AK  CONSUMER STATES THERE WERE SIGNS OF A SHORT UNDER THE FRONT RIGHT FENDER BY THE TRAILER WIRES, A FORD MECHANIC INFORMED CONSUMER THAT HE DID NOT BELIEVE THE FIRE WAS CAUSED BY THE TRAILER WIRES.  *ADJ  REFERENCED IN EA02-025",
        "vin": "2FALP73W4TX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/19/1998",
        "dateOfIncident": "06/05/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 700746,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 06/05/1996 EVENING SHIFT LT. C. DAVIS WAS DRIVING VEHICLE #102, A 1996 FORD CROWN VICTORIA POLICE PACKAGE SEDAN. WAS COMING TO A STOP ON CITY STREET WHEN LF BALL JOINT NUT CAME OFF. LF SUSPENSION CAME LOOSE AND VEHICLE LANDED ON PAVEMENT. CALLED WRECKER SERVICE HAD VEHICLE TOWED TO VEHICLE SERVICES. BALL JOINT NUT WAS FOUND AND PLACED IN ASH TRAY OF #102.     VEHICLE TOWED TO BOBBY JONES FORD ON 06/06/1996. REPLACED LF SUSPENSION ARM ASSY. VEHICLE SERVICES CHECKED OTHER CRUISERS. NO OTHER BALL JOINT PROBLEMS FOUND. SAW ARTICLE IN FLEET MANAGEMENT-OCT.98/VEHICLE RECALL REPORT.",
        "vin": "2FALP71W1TX"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "11/16/1998",
        "dateOfIncident": "11/05/1998",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 830874,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WAS DRIVING DOWN  ROAD WHEN STEERING LOCKED UP AND HE COULD NOT STEER THE VEHICLE. CONSUMER LOST CONTROL, AND STARTED DOWN AN EMBANKMENT.TRIED TO APPLY BRAKES, BUT THEY DID NOT WORK.  *AK",
        "vin": "ZFALP73W3TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/15/1998",
        "dateOfIncident": "11/14/1998",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 700632,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS BEEN IN THE SHOP 2 TIMES FOR GAS VAPORS INSIDE THE CAR, THE SECOND TIME THEY REPLACE A GAS LINE O-RING BUT THAT DID NOT HELP.I WILL BE SENDING IT BACK FOR THE SAME PROBLEM THIS IS THE THIRD TIME.  THE CAR ENGINE SHUTS DOWN AT ANY SPEED AND HAS DONE IT FOUR TIMES, AND THIS WILL BE THE SECOND TIME FOR THIS PROBLEM, LAST TIME MY CAR WAS IN THE SHOP FOR 5 DAYS AND THEY WERE UNABLE TO FIND ANY THING WRONG WITH IT.NO GAS VAPORS OR THE ENGINE SHUTTING DOWN.",
        "vin": "2FALP74W6TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/13/1998",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 542587,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "CATALYTIC CONVERTER HAS FAILED SEVERAL TIMES.",
        "vin": "2FALP72W9TX"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/12/1998",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 542541,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPUTER SYSTEM DESIGN COULD RESULT IN FAILURE AT THE YEAR 2,000.",
        "vin": "2FALP73W6TX"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/05/1998",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 830206,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING COLUMN HAS DETERIORATED WHILE MAKING A TURN.THE WHEEL DOES NOT RETURN, AND IT STARTED LOCKING UP, MAKING IT DIFFICULT FOR THE CONSUMER TO STRAIGHTEN THE WHEEL.  THIS IS A POLICE VEHICLE. DEALER HAS BEEN CONTACTED.  *AK",
        "vin": "2FALP71W6TX"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/27/1998",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 542274,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC TRANSMISSION ROLLS BACKWARD AFTER RELEASING BRAKE PEDAL, DUE TO DESIGN.",
        "vin": ""
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/06/1998",
        "dateOfIncident": "08/21/1998",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 828649,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING OUT OF THE YARD AND TURNING THE STEERING WHEEL COLUMN, CAN HEAR A POPPING  NOISE. ALSO, WHEN DRIVING ON THE HIGHWAY AND PARKING THE HOOD LATCH POPPED OPEN, AND THE DEALER WON'T REPAIR THE VEHICLE, DUE TO LACK OF ANY RECALL.  *AK",
        "vin": "2FALP74W5TX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/01/1998",
        "dateOfIncident": "09/24/1998",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 780628,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT FRONT BALL JOINT FAILED. *ET",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/01/1998",
        "dateOfIncident": "09/24/1998",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 780628,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT FRONT BALL JOINT FAILED. *ET",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/01/1998",
        "dateOfIncident": "09/24/1998",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 780628,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT FRONT BALL JOINT FAILED. *ET",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/08/1998",
        "dateOfIncident": "08/28/1998",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 827667,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "LOWER CONTROL ARM AND BALL JOINT BUSHINGS HAVE FAILED.  THE DEALER WILL BE NOTIFIED.  *AK",
        "vin": "2FALP71W7SX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/25/1998",
        "dateOfIncident": "05/19/1998",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 825514,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "CHIEF OF POLICE IS RESPONDING TO POLICE INTERNET RECALL CONCERNING VEHICLE RECALL FOR FRONT CONTROL ARM/ LOWER BALL JOINT . *AK",
        "vin": "2FALP71W2TX"
    },
    {
        "components": "SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "08/12/1998",
        "dateOfIncident": "07/19/1998",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 826584,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS INVOLVED IN A COLLISION.  WHEN THE BRAKES WERE APPLIED PRIOR TO IMPACT, THE RESTRAINTS DID NOT RETRACT, CAUSING THE OCCUPANTS TO BE THROWN INTO THE WINDSHIELD.  THE MANUFACTURER HAS NOT BEEN NOTIFIED.   *AK",
        "vin": "2FALP73W4TX"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/11/1998",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 539771,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "TORQUE CONVERTER SHUDDERS WHEN IT SHOULD LOCK UP, CAUSING THE VEHICLE TO VIBRATE VIOLENTLY.  *SLC",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/23/1998",
        "dateOfIncident": "07/07/1998",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 538191,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "LOWER BALL JOINTS FAILED.",
        "vin": "2FALP71W3TX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/22/1998",
        "dateOfIncident": "05/01/1998",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 538171,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "LOWER CONTROL ARM/BALL JOINTS FAILED, CAUSING FRONT END TO FEEL LOOSE. (QCAW)",
        "vin": "2FALP71WOTX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/22/1998",
        "dateOfIncident": "05/01/1998",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 605851,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "LOWER CONTROL ARM/BALL JOINTS FAILED CAUSING VEHICLE TO FEEL LOOSE IN THE FRONT END. (QCAW)",
        "vin": "2FALP71W9TX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/10/1998",
        "dateOfIncident": "06/05/1998",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 537569,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "LOWER CONTROL ARM BUSHINGS FAILED.",
        "vin": "2FALP71WOTX"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/07/1998",
        "dateOfIncident": "01/21/1998",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 825048,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS HAD THE FRONT BALL JOINT AND INNER TIE RODS  REPLACED.  RECALL WAS ORDERED ON VEHICLE.",
        "vin": "2FALP71WXTX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/07/1998",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 537356,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "BALL JOINT FAILURE ON TWO POLICE VEHICLES (1996 CROWN VICTORIAS).",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/07/1998",
        "dateOfIncident": "06/29/1998",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 537355,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "LOWER BALL JOINT FAILURE CAUSING LOSS OF STEERING CONTROL.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/01/1998",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 824891,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "LOWER CONTROL ARM BROKE WHILE DRIVING.  OWNER NOTES OF INVESTIGATION ON PROBLEM.  *AK",
        "vin": "2FALP71W3PX"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/01/1998",
        "dateOfIncident": "07/15/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 605254,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S DOOR STICKS.   QCAW",
        "vin": "2FALP74W4TX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/01/1998",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 537372,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "NOISE HEARD FROM THE FRONT BALL JOINT AREA.",
        "vin": "2FALP71W8TX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/01/1998",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 605823,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "NOISE FROM THE FRONT BALL JOINT AREA.",
        "vin": "2FALP71WXTX"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,STRUCTURE,TIRES",
        "crash": false,
        "dateComplaintFiled": "06/29/1998",
        "dateOfIncident": "04/26/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 824783,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "CHIEF OF POLICE CALLED TO INFORM OF RECALL NOTICE RECEIVED CONCERNING FORD CROWN VICTORIA LOWER BALL JOINT FAILURE.  *AK  DOOR HANDLES WERE REPLACED.  REAR BRAKE PADS AND ROTORS REPLACED AT 18290, FRONT PADS AND ROTORS WERE REPLACED AT 28679 MILES, FRONT AND REAR BRAKE PADS REPLACED AT 51031 MILES.  INTAKE MANIFOLD REPLACED TWICE.  HEATER HOSE REPLACED.  PASSENGER SIDE TAIL LIGHT REPLACED.  TIRE ROTATIONS ARE DONE EVERY 3000 MILES, HOWEVER TIRES HAD TO BE REPLACED AT APPROXIMATELY 9600 MILES AND AT 600000 MILES, NO SPECIFIC TIRE INFORMATION GIVEN.  COOLING FANT AND MOTOR REPLACED.  TPC, PVC, AND FUEL REGULATOR REPLACED.   *SLC",
        "vin": "2FALP71W0TX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/26/1998",
        "dateOfIncident": "05/21/1998",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 824719,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DEFECTIVE LOWER BALL JOINTS BROKE OFF,  CAUSING LOSS OF VEHICLE CONTROL.   ALSO, A SECOND VEHICLE, A NEW VEHICLE 1996 FORD CROWN VICTORIA VIN# [XXX],HAD A SIMILAR  PROBLEM WHICH OCCURRED JUNE 23, 1998 WITH 60 MILES, WITH  LOWER BALL JOINTS BROKE, CAUSING LOSS OF VEHICLE CONTROL.   *AK    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "2FALP71W7VX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/26/1998",
        "dateOfIncident": "12/04/1997",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 537166,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "LOWER CONTROL ARM BALL JOINT FAILED.",
        "vin": "2FALP71W6TX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/26/1998",
        "dateOfIncident": "05/21/1998",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 537167,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "LOWER CONTROL ARM BALL JOINT FAILED CAUSING DAMAGE TO VEHICLE.",
        "vin": "2FALP71W5VX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/26/1998",
        "dateOfIncident": "06/23/1998",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 605815,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "LOWER CONTROL ARM BALL JOINT CAME APART CAUSING LOSS OF CONTROL AND DAMAGE.",
        "vin": "2FALP71W5VX"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/16/1998",
        "dateOfIncident": "06/13/1998",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 824348,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "POLICE OFFICER WAS SLOWING DOWN WHEN WHEEL WENT INTO FENDER AREA (WHEEL HOUSING), CAUSING VEHICLE TO BE INOPERABLE. MECHANIC NOTICED THAT GREASE FITTING WAS OMITTED. THIS CAUSED THE BALL JOINTS TO FALL OUT.  *AK   *SLC",
        "vin": "2FALP71W8TX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/16/1998",
        "dateOfIncident": "06/16/1998",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 824364,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "POLICE OFFICER'S VEHICLE HAS BALL JOINTS FALLING OUT. MECHANIC HAD NOTICED THE GREASE FITTING WAS MISSING. THIS COULD CAUSE THE WHEEL TO GO INTO THE WHEEL HOUSING (FENDER).  *AK   *SLC",
        "vin": "2FALP71W8TX"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/16/1998",
        "dateOfIncident": "06/13/1998",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 824378,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "POLICE OFFICER'S VEHICLE WAS SLOWING DOWN WHEN THE WHEEL WENT INTO WHEEL HOUSING AREA (FENDER). VEHICLE COLLAPSED DOWNWARD. MECHANIC NOTICED THAT GREASE FITTING WAS MISSING & BALLJOINTS FELL OUT.  *AK   *SLC",
        "vin": "2FALP71W8TX"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/16/1998",
        "dateOfIncident": "06/13/1998",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 824384,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "POLICE CRUISER: SLOWING DOWN. WHEEL GOES INTO WHEEL HOUSING (FENDER). THIS CAUSED VEHICE TO DROP. MECHANIC NOTICED GREASE FITTING WAS OMITTED. THIS CAUSED THE BALL JOINTS TO FALL OUT.  *AK",
        "vin": "1FLAP71W1TX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/02/1998",
        "dateOfIncident": "06/02/1998",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 823881,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING COULD HEAR NOISE FROM THE FRONT OF VEHICLE (LIKE CRACKING NOISE). WAS INSPECTING THE VEHICLE AND SAW A FEW CRACKS ON THE LOWER BALL JOINTS.   CONSUMER HAD CONTACTED DEALER AND MANUFACTURER.  *AK",
        "vin": "2FALP74W8TX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/14/1998",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 535450,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO OF THE 1996 FLEET VEHICLES (CROWN VICTORIAS) HAVE HAD FAILED LOWER BALL JOINTS, ONE INCIDENT LEADING TO THE COLLAPSE OF THE VEHICLE'S FRONT WHEEL ASEMBLY.",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/13/1998",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 532810,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "OWNER CONVINCED THAT HE IS BEING EXPOSED TO A PESTICIDE THAT MOST LIKELY USED IN THE HEATER SYSTEM TO PREVENT MOLD AND MILDEW, CAUSING ILLNESS.",
        "vin": "2FALP74WOTX"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/12/1998",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 532529,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING INTERMITTENTLY GOES OUT.",
        "vin": ""
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/05/1998",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 531903,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR BRAKE LINES RUB ON BODY OF THE DRIVER'S SIDE, ABOVE TRANSMISSION CROSSMEMBER.",
        "vin": "2FALP71W1TX"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/03/1998",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 531830,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE EMITS PUNGENT CHEMICAL ODORS WHEN THE HEATER AND ESPECIALLY THE DEFROST IS ACTIVATED.",
        "vin": "2FALP74WOTX"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/30/1998",
        "dateOfIncident": "06/06/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 821049,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE AND GETTING READY TO MAKE A LEFT TURN AND THE VEHICLE STALLS. WHEN DRIVING AT 60MPH HIT A BUMP AND THE VEHCILE LOST ALL STEERING. TOOK VEHICLE TO THE DEALER AND THEY REPLACED THE WIRES ON THE VEHICLE, BUT THE DRIVER STILL IS HAVING THE SAME PROBLEM. THIS HAS BEEN AN ONGOING PROBLEM SINCE THE OWNER PURCHASED THE VEHICLE IN 1996.  *AK",
        "vin": "2FALP74W5TX"
    },
    {
        "components": "STEERING,SUSPENSION,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/30/1998",
        "dateOfIncident": "10/01/1995",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 530055,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING FAILURE.",
        "vin": "2FALP74W5TX"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/30/1997",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 527158,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "STEEL BRAKE LINE RUNNING TO THE REAR BRAKES RUB THE UNDERSIDE OF THE CAR BODY AT THE TRANSMISSION CROSSMEMBER.",
        "vin": "2FALP71WSTX"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/30/1997",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 605723,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "STEEL BRAKE LINE RUNNING TO THE REAR BRAKES RUBS ON THE UNDERSIDE OF THE CAR BODY AT THE TRANSMISSION CROSSMEMBER.",
        "vin": "2FALP72WITX"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/30/1997",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 605720,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "STEEL BRAKE LINE RUNNING TO THE REAR BRAKES RUBS ON THE UNDERSIDE OF THE CAR BODY AT THE TRANSMISSION CROSSMEMBER",
        "vin": "2FALP71WOTX"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/30/1997",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 605722,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "STEEL BRAKE LINE RUNNING TO THE REAR BRAKES RUBS ON THE UNDERSIDE OF THE CAR BODY AT THE TRANSMISSION CROSSMEMBER.",
        "vin": "2FALP71W8VX"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/30/1997",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 605721,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "STEEL BRAKE LINE RUNNING TO THE REAR BRAKES RUBS ON THE UNDERSIDE OF THE CAR BODY AT THE TRANSMISSION CROSSMEMBER.",
        "vin": "2FALP71W8VX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/05/1997",
        "dateOfIncident": "09/24/1997",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 525773,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "INTAKE MANIFOLD CRACKED.",
        "vin": "2FALP71W5TX"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/05/1997",
        "dateOfIncident": "11/22/1997",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 525747,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "METAL BRAKE LINE WHICH RUNS UP/OVER THE DRIVER'S SEAT FRAME CHAFED,  LINES ROUTED TOO CLOSE TO THE BODY.",
        "vin": "2FALP71WHTX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/05/1997",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 605696,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "PLASTIC  INTAKE MANIFOLDS ARE SPLITTING, CAUSING A LOSS OF COOLANT.",
        "vin": "2FALP71WOTX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/05/1997",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 605697,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "PLASTIC INTAKE MANIFOLDS ARE SPLITTING, CAUSING A LOSS OF COOLANT.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/05/1997",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 605698,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "PLASTIC INTAKE MANIFOLDS SPLIT, CAUSING COOLANT TO LEAK.",
        "vin": "2FALP71W8TX"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/05/1997",
        "dateOfIncident": "11/05/1997",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 818335,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE LINES HAVE BEEN REPLACED IN 4 OF THE FOLLOWING VEHICLES BECAUSE THE FRAME RUBS A HOLE IN THE BRAKE LINE; [XXX]/1996, [XXX]/1995, AND [XXX]/1995. NOT SURE OF MILEAGE AND DATE.  *AK   *SLC    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "2FALP71W0TX"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/05/1997",
        "dateOfIncident": "07/15/1997",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 818370,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DEFECTIVE REAR BRAKING LINES CAUSED THE BRAKE PADS TO WEAR OUT WHICH CAUSED INEFFECTIVE REAR BRAKE LINES.  THE REAR BRAKE PADS WERE REPLACED, ALL FOUR ROTORS WERE COMPLETELY WORN AT 12000 MILES.   *SLC",
        "vin": "2FALP71W2TX"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/04/1997",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 605135,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FORD",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION FAILED.",
        "vin": "1FALP58S7TA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/27/1997",
        "dateOfIncident": "02/04/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 605561,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FORD",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING PUMP FAILED RESULTING IN NOISE.",
        "vin": "1FTHX25G4TE"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/27/1997",
        "dateOfIncident": "02/04/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 605561,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FORD",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING PUMP FAILED RESULTING IN NOISE.",
        "vin": "1FTHX25G4TE"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/27/1997",
        "dateOfIncident": "04/01/1995",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 604185,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FORD",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING COLUMN FAILED.",
        "vin": "1FTEX15N2TK"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/22/1997",
        "dateOfIncident": "07/31/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 604576,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "KEYLESS REMOTE FAILED.",
        "vin": "2FALP74W7TX"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/30/1997",
        "dateOfIncident": "09/03/1997",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 814627,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "FAST IDLING, CAUSING UNCONTROLLED ACCELERATION, AS WELL AS STALLING.  CONSUMER CONTACTED DEALER, DEALER HAS YET TO FIND PROBLEM.  *AK",
        "vin": "2FALP72W3TX"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "09/10/1997",
        "dateOfIncident": "08/12/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 603597,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS GAUGE FAILED. GAUGE DOES NOT RETURN TO EMPTY WHEN VEHICLE MOTOR IS OFF.",
        "vin": "2FALP74W3TX"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/07/1997",
        "dateOfIncident": "02/13/1997",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 813837,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING AT HIGHWAY SPEED THE VEHICLE PULLS TO THE LEFT AND IT FEELS AS THOUGH  HAVE NO STEERING POWER. THE DEALER IS AWARE OF THIS SITUATION. THE PROBLEM HAS NOT BEEN CORRECTED.   *AK",
        "vin": "2FALP73W9TX"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/18/1997",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 603496,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FORD",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "FACTORY INSTALLED PUSH-ROD, BETWEEN THE BRAKE PEDAL AND MASTER CYLINDER, WAS NOT THE PROPER PART (IT WAS TOO LONG). THE RESULT OF THIS ERROR HAS CAUSED FAILURE TO THE ABS SYSTEM.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/21/1997",
        "dateOfIncident": "04/22/1997",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 517356,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "INADEQUATE LUBRICATION CAUSED THE RIGHT LOWER BALL JOINT TO SEPARATE, RESULTING IN AN ACCIDENT.",
        "vin": "2FALP71W0TX"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/11/1997",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 602915,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR WINDOW DEFROSTER INOPERATIVE.",
        "vin": "2FALP74W1TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/10/1997",
        "dateOfIncident": "12/30/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 603047,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "GASKET REPLACED DUE TO OIL LEAK.",
        "vin": "2FALP74W5TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/10/1997",
        "dateOfIncident": "12/30/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 603047,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL PAN REPLACED DUE TO OIL LEAK.",
        "vin": "2FALP74W5TX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/18/1997",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 602550,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FORD",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR END IS TO LIGHT, CAUSING LOSS OF TRACTION ON TURNS AND ON SMALL BUMPS AT ANY SPEED.",
        "vin": "1FTCR10A9TU"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/12/1997",
        "dateOfIncident": "07/25/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 602665,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "CRUISE CONTROL WOULD NOT TURN OFF WHEN BRAKES WERE APPLIED.",
        "vin": "2FALP7465TX"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/12/1997",
        "dateOfIncident": "07/25/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 602665,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PADS REPLACED TWICE.",
        "vin": "2FALP7465TX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/12/1997",
        "dateOfIncident": "07/25/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 602665,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE MISALIGNED TWICE.",
        "vin": "2FALP7465TX"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/12/1997",
        "dateOfIncident": "07/25/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 602665,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE IDLE HIGH.",
        "vin": "2FALP7465TX"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/12/1997",
        "dateOfIncident": "12/14/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 602726,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE WARNING LIGHT ILLUMINATED TWICE.",
        "vin": "2FALP74W9TX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/06/1997",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 525829,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FORD",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR END NOISE PRESENT, REPLACED REAR SUSPENSION AND NOISE CONTINUED.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/13/1996",
        "dateOfIncident": "09/10/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 802754,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "MARSHALL MIZE FORD 96V135 PITMAN ARM;   OWNER TOOK VEHICLE IN ON SERVERAL OCCASIONS FOR INSUFFICIENT LUBRICATION AND RECALL WORK WAS NOT PERFOMED, MANUFACTURER  DID NOT INIDCATE IF PARTS WERE AVAILABLE TO HONOR RECALL.*AK",
        "vin": "2FA1P72W2X1"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/18/1996",
        "dateOfIncident": "10/18/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 510211,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENT STALLING WHEN BRAKES ARE APPLIED.",
        "vin": "2FALP72W3TX"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/16/1996",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 510045,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE SHUTS DOWN, WHEN BRAKES ARE APPLIED.",
        "vin": "2FALP72W3TX"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/24/1996",
        "dateOfIncident": "07/03/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 801840,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "IF YOU BUCKLE UP THE SEAT BELT DOES NOT HOLD, IT POPS OUT.   *AK",
        "vin": "2FALP74W0TX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/27/1996",
        "dateOfIncident": "08/09/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 507937,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "LOWER CONTROL ARM WELD FAILURE, CAUSING VIBRATION AND SLIGHT PULL WHEN BRAKES ARE APPLIED/DIMINISHED STEERING AND BRAKING CONTROL.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/16/1996",
        "dateOfIncident": "08/09/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 507645,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE SURGES UNCONTROLLABLY.",
        "vin": "2FABP42FXTX"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/13/1996",
        "dateOfIncident": "07/03/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 507434,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING STICKS INTERMITTENTLY, RELEASES WITH EXCESSIVE FORCE.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/12/1996",
        "dateOfIncident": "08/03/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 507397,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PEDAL GOING TO THE FLOOR DUE TO FAILURE OF THE STOP SWITCH AND CLIP ON PEDAL.",
        "vin": "2FALP73W3TX"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/24/1996",
        "dateOfIncident": "04/15/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 601560,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "FRAME BRACKET WELD THAT HOLDS STEERING MECHANISM BROKE, CAUSING VEHICLE TO PULL TO THE RIGHT.   (2ND VEHICLE ON 506509)",
        "vin": "2FALP71W7TX"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/23/1996",
        "dateOfIncident": "04/15/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 506509,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT FRAME BRACKET BROKE AT WELD, CAUSING VEHICLE TO PULL TO THE RIGHT WHEN BRAKES APPLIED.   (FIRST VEHICLE ON 601560)  *AW",
        "vin": "2FALP71W4TX"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "07/18/1996",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 987053,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "NO PARTS. AT FORD MANUFACTURER, D AND L FORD,MERCURY. RECALL 95V070000.   *AK",
        "vin": "2FALP73W8TX"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/15/1996",
        "dateOfIncident": "06/16/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 985888,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "POLICE VEHICLE, STEERING GEAR FAILED, RESULTING IN STEERING WHEEL TURNING FREELY BUT THE WAS NO CONNECTION TO THE WHEEL.      *AK",
        "vin": "2FALP71W7TX"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/11/1996",
        "dateOfIncident": "07/10/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 986754,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "PITMAN ARM/BALL JOINT IS READY TO FALL OUT, REPLACED PITMAN ARM, POLICE CAR.   *AK",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/10/1996",
        "dateOfIncident": "06/20/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 985906,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "POLICE VEHICLE. THE STEERING WHEEL MOVES AND THE CAR WILL NOT MOVE WITH IT, ESPECIALLY IN CURVES.   *AK",
        "vin": "2FALP71W6TX"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/10/1996",
        "dateOfIncident": "07/05/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 986684,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "POLICE CARS, FOUND 3 PITMAN ARMS DEFECTIVE, REPLACED ALL THREE.",
        "vin": "2FALP71W6SX"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/10/1996",
        "dateOfIncident": "07/05/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 986693,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "POLICE CARS, FOUND 3 PITMAN ARMS DEFECTIVE, REPLACED ALL THREE.   *AK",
        "vin": "2FALP71WXSX"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "07/09/1996",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 986626,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "MS. JONES WAS TOLD WHEN THE PARTS COME IN THEY WOULD CONTACT HER. IT HAS BEEN 2 MONTHS NOW AND THE PARTS STILL AREN'T IN. RECALL 96V070000.  *AK",
        "vin": "2FALP74WOTX"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/02/1996",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 986413,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WA SDRIVING AND SOMETIMES THE STEERING JERKS, ALSO FRONT END MISALIGNMENT, WHILE GOING AROUND  CURVES TO THE LEFT, STEERING WHEEL WILL SUDDENLY PULL LEFT, ALMOST CAUSING LOSS OF CONTROL.  *AK",
        "vin": "2FALP71W7TX"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/02/1996",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 986440,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING PROBLEMS AT HIGH RATES OF SPEED. PLEASE DESCRIBE DETAILS.   *AK",
        "vin": "2FALP71H0TX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/27/1996",
        "dateOfIncident": "06/20/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 986239,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "BALL JOINT CONNECTING PITMAN ARM TO DRAG LINK (TRACK ROD) FELL OFF.   *AK",
        "vin": "2FALP71W4TX"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/20/1996",
        "dateOfIncident": "06/06/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 985943,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING SEEMS LOOSE TO THE POINT WERE THE CAR DOES NOT WANT TO  STAY IN LANE. PLEASE DESCRIBE DETAILS.   *AK",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/17/1996",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 985744,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE PLAY IN PITMAN ARMS FOUND DURING INSPECTION OF VEHICLE. PLEASE DESCRIBE DETAILS.   *AK",
        "vin": "2FALP71WDTX"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "05/28/1996",
        "dateOfIncident": "05/22/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 984893,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A POLICE VEHICLE. DURING AN ACCIDENT THE ABS SYSTEM WAS INOPERATIVE AND THE BRAKES LOCKED AND MAY HAVE CONTRIBUTED TO THE ACCIDENT. PLEASE DESCRIBE. *AK",
        "vin": "2FALP71W6TX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/23/1996",
        "dateOfIncident": "04/01/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 984810,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT BRACKET BROKEN, THAT THE STEERING AND THE FRONT END OF VEHICLE.  *AK",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/06/1996",
        "dateOfIncident": "04/25/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 984151,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "POLICE CARS EXPERIENCING EXCESSIVE PLAY IN PITMAN ARMS, FOUND DURING INSPECTION OF 11 CARS.  *AK",
        "vin": "2FALP71WDTX"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/03/1996",
        "dateOfIncident": "02/23/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 502971,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "NO DEPLOYMENT OF DRIVERS AIR BAG DURING ACCIDENT, ALSO DRIVER RECEIVED MAJOR BURNS WHEN AIR BAG  DEPLOYED. *DSH",
        "vin": "2FALP7468TX"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/16/1996",
        "dateOfIncident": "02/09/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 979314,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "NOISE WHEN TURNING THE TILT STEERING WHEEL, THEN STEERING LOCKS UP, DUE TO DEFECTIVE STEERING BOX CRACKED OPEN AND PUMP MALFUNCTIONED, REPLACE BOX AND PUMP.  TT",
        "vin": "2FALP7369TX"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/16/1996",
        "dateOfIncident": "02/09/1996",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 979314,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "NOISE WHEN TURNING THE TILT STEERING WHEEL, THEN STEERING LOCKS UP, DUE TO DEFECTIVE STEERING BOX CRACKED OPEN AND PUMP MALFUNCTIONED, REPLACE BOX AND PUMP.  TT",
        "vin": "2FALP7369TX"
    }
]