[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/16/2016",
        "dateOfIncident": "05/16/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10865162,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 1996 FORD EXPEDITION. WHILE DRIVING 40 MPH, THE ANTI-THEFT WARNING LIGHT ILLUMINATED AND THE VEHICLE STALLED. THE CONTACT WAS ABLE TO RESTART THE VEHICLE; HOWEVER THE ANTI-THEFT LIGHT REMAINED BLINKING. THE CONTACT WAS UNABLE TO DRIVE THE VEHICLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 100,000.",
        "vin": "1FMFU18L4VL"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/22/2007",
        "dateOfIncident": "10/20/2007",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10206554,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1996 FORD EXPEDITION.  LAST YEAR, THE CONTACT RECEIVED A RECALL NOTICE FOR THE VEHICLE SPEED CRUISE CONTROL SWITCH.  SHE HAD THE RECALL REPAIR PERFORMED.  ONE YEAR LATER, THE VEHICLE CAUGHT FIRE WHILE IDLING.  AN INSPECTOR FROM FORD STATED THAT THE FIRE ORIGINATED FROM THE CRUISE CONTROL SWITCH; HOWEVER,THEY WOULD NOT ASSUME LIABILITY BECAUSE THEY REPAIRED THE VEHICLE ONCE ACCORDING TO THE RECALL.  THE POWERTRAIN AND RECALL NUMBER WERE UNKNOWN.  THE FAILURE MILEAGE WAS 50,000 AND CURRENT MILEAGE WAS 105,000.",
        "vin": "1FMEU18W5VL"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/26/2002",
        "dateOfIncident": "07/27/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 567632,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER'S COMPLETED STREET ADDRESS IS:  8535 RED HILL COUNTRY CLUB DRIVE.  THE CONSUMER STATED THAT SHE AND HER SISTER WERE IN THE VEHICLE TALKING, WHILE DRIVING ON THE HIGHWAY, WHEN THE CONSUMER ACCELERATED TO PASS ANOTHER VEHICLE THE STEERING WHEEL STARTED TO VIBRATE INTENSELY.  THE CONSUMER STRUGGLED TO MAINTAIN CONTROL AND PULLED TO THE SIDE OF THE ROAD.  THE SISTER VISUALLY INSPECTED THE VEHICLE AND SAW THAT THE TIRE SEEMED TO BE INFLATED.  SO THEY PROCEEDED WITH THE STEERING WHEEL STILL VIBRATING, TRAVELING AT ABOUT 10-15 MPH TO A GAS STATION.  (A SHORT DRIVING TEST WAS PERFORMED, AND THE CONSUMER WAS SHOWN THE INSIDE OF THE LEFT TIRE, THERE WAS BULDGING FROM THE SPLINTERED TREAD AND A HUGE BUBBLE)-THE CONSUMER WAS TOLD THAT THIS WAS EVIDENCE OF A DEFCTIVE TIRE.  THE SECOND INCIDENT HAPPENED ON THE FOLLOWING DAY OF THE REPAIRS.  SEVERAL HOURS INTO THE TRIP, DRIVING AT A HIGH SPEED OF TRAFFIC, THE VIBRATION IN THE STEERING WHEEL STARTED AGAIN.  WHEN THE CONSUMER AND SISTER INSPECTED THE VEHICLE THEY HAD SEEN THE INSIDE OF THE RIGHT REAR TIRE WAS BULDGING OUT FROM THE SPLIT TREAD AND SPLINTERING STEEL WAS A HUGE RUBBER BUBBLE.  THE CONSUMER PURCHASED 5 NEW TIRES.  BOTH CONTINENTAL AND FORD HAVE BEEN INFORMED OF THE INCIDENTS AND DECLINED TO FULLY REIMBURSE THE COST.  THE CONSUMER STILL EXPECTS A FULL REIMBURSEMENT FOR THE EXPENSES SHE HAD INCURRED AS A RESULT OF THE NEGLIGENCE OF CONTINENTAL TIRE NORTH AMERICA AND FORD MOTOR COMPANY.  *SCC",
        "vin": ""
    }
]