[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/14/2017",
        "dateOfIncident": "06/28/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005394,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IT IS HOT OUT 85-100F, MY TRANSMISSION OVERHEATING LIGHT GOES ON WHILE DRIVING AT EXPRESSWAY/INTERSTATE HIGHWAY SPEEDS.  THE ENGINE TEMPERATURES ARE WITHIN NORMAL LIMITS.  IT OCCURS WITHOUT THE A/C ON.  WHEN THIS SITUATION HAPPENS, MY VEHICLE WILL NO LONGER ACCELERATE AND WILL BECOME SLOWER AND SLOWER UNTIL I'M GOING >20MPH.  THIS IS HAZARDOUS ON HIGH SPEED LIMIT CONGESTED ROADWAYS.  THIS HAS HAPPENED TO MY 2015 JEEP PATRIOT FREEDOM DRIVE 2 CVT AT LEAST 5 TIMES DURING HOT SPRING DAYS OR THE SUMMER.  I HAVE HAD TO PARK ON A SHOULDER OF AN EXPRESSWAY FOR 20-30 MINUTES FOR IT TO COOL DOWN SO I COULD SAFELY REENTER THE HIGHWAY.  I HAVE HEARD OF TWO OTHER PEOPLE WITH THIS ISSUE AND I DO NOT KNOW MANY PEOPLE WHO HAVE THIS MODEL.  ALL VEHICLES SHOULD BE CAPABLE OF GETTING TO HIGHWAY SPEED ON AN ON RAMP AND MERGE IN.  I DO NOT KNOW IF IT IS A COOLING ISSUE, A THERMOSTAT MALFUNCTION, OR SOMETHING ELSE.  I OWN THE LATITUDE, TRAIL RATED MODEL, 2015.  I BOUGHT IT WITH ONLY 2 MILES ON THE ODOMETER AND I DO REGULAR FULLY SYNTHETIC OIL CHANGES.    WHEN I KNOW THE ISSUE IS STARTING I HEAR A DISTINCTIVE WINDING SOUND WHEN ACCELERATING.  ALMOST LIKE THE SOUND A DRILL OR REMOTE CONTROL CAR MAKES (LIKE IT'S STUCK IN 1 GEAR, EVEN THOUGH MY CAR IS A CVT I USUALLY FEEL A \"SHIFT\" WHEN ACCELERATING OR PASSING.  WHEN THIS OCCURS, IT SOUNDS LIKE SOMETHING IS RESTRICTING THE \"GEARS\" AND CAUSING THE WINDING/WHINING SOUND, LIKE IF YOU PUT A MANUAL TRANSMISSION INTO 1ST OR SECOND AND KEPT ACCELERATING UP TO HIGHWAY SPEEDS.",
        "vin": "1C4NJRFB0FD"
    }
]