[
    {
        "components": "CHILD SEAT",
        "crash": false,
        "dateComplaintFiled": "06/19/2017",
        "dateOfIncident": "06/19/2017",
        "fire": false,
        "manufacturer": "Britax Child Safety, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000096,
        "products": [
            {
                "manufacturer": "Britax Child Safety, Inc.",
                "productMake": "BRITAX",
                "productModel": "ADVOCATE",
                "productYear": "9999",
                "type": "Child Seat"
            }
        ],
        "summary": "BRITAX ADVOCATE G4 CONVERTIBLE CAR SEAT, WHICH WAS PURCHASED IN 2015.  MY CHILD IS NOW 2 YEARS OLD, AND HAS BEEN REACHING IN BETWEEN THE LEGS, TO PRESS THE RELEASE BUTTON ON THE HARNESS (LOCATED RIGHT IN THE BOTTOM OF SEATING AREA) AND LOOSEN THE STRAP WHILE I AM DRIVING!  MANY TIMES!  I CHECKED AND CHECKED, CHILD IS PROPERLY STRAP UP BEFORE I DRIVE, CHILD IS NOT IN TOO TIGHT OR TOO LOOSE, WE FOLLOWED THE DIRECTIONS EXACTLY.  IT'S REALLY THE LOCATION OF THE HARNESS RELEASE BUTTON THAT IS THE PROBLEM (WHY IS IT LOCATED IN A PLACE WITHIN A YOUNG CHILD'S REACH?).     CONTACTED BRITAX THE FIRST TIME- WAS TOLD BY THE REP THIS IS A PARENTING ISSUE- RECEIVED A LECTURE ABOUT MY TODDLER \"MISBEHAVING\" AND I JUST HAVE TO TEACH MY CHILD NOT TO TOUCH THE BUTTON.  SO I IMPLEMENT THE \"TOUCH THAT BUTTON AND WE WILL GO STRAIGHT HOME\" METHOD FOR A FEW MONTHS.  DIDN'T WORK.   CONTACTED BRITAX THE SECOND TIME- WAS TOLD IT'S NOT A MANUFACTURE PROBLEM IT'S MY PARENTING ISSUES.  THERE'S NO KIT OR ANYTHING AVAILABLE WHERE I CAN BLOCK OFF THE BUTTON SO MY TODDLER CANNOT TOUCH IT.  IF AN ACCIDENT OCCUR, THE CAR SEAT WON'T BE ABLE TO FUNCTION THE WAY IT'S DESIGNED.  AND I AM SIMPLY NOT ABLE TO KEEP MY EYES ON THE ROAD AND TURN MY HEAD EVERY OTHER MINUTE TO SEE IF MY TODDLER HAS TOUCHED THE RELEASE BUTTON, BRITAX IS NOT GIVING ME ANY REALISTIC SOLUTIONS AND THE TWO REPS I'VE SPOKEN TO DOES NOT APPEAR TO BE CONCERN ABOUT THIS AT ALL.",
        "vin": null
    }
]