[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/03/2017",
        "dateOfIncident": "06/23/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002872,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT CAME ON WITH NO OTHER SYMPTOMS, DEALER REPLACED PURGE VALVE.  ONE YEAR LATER CHECK ENGINE LIGHT CAME ON AGAIN, BUT OCCASIONALLY TURNED OFF AND BACK ON AGAIN (EVERY FEW DAYS) BETWEEN APPOINTMENTS WITH DEALER.  PURGE VALVE REPLACED AGAIN AND CHECK ENGINE LIGHT CAME ON AS I WAS LEAVING DEALER CODE 0420.       RETURNED TO DEALER AND PROBLEM WAS DIAGNOSED FINALLY AS PARTIALLY COLLAPSED FUEL TANK (DIFFICULT TO SEE UNLESS CAR WAS ON A LIFT.)  DEALER RECOMMENDS REPLACING FUEL TANK, FUEL PUMP, EVAP CAN AND OTHER ASSOCIATED PARTS.       BESIDES THE CHECK ENGINE LIGHT THE ONLY SYMPTOM IS OCCASIONAL LACK OF POWER WHEN ACCELERATING.  THE PROBLEM IS THAT THIS SYMPTOM IS SOMEWHAT SIMILAR TO THE \"SHUDDER\" PROBLEM FIXED BY REPLACING THE CLUTCH ASSEMBLY.  SO, HAVING RECENTLY DONE THAT CLUTCH ASSEMBLY REPLACEMENT THIS FELT LIKE A SHADOW OF THE FORMER PROBLEM AND I IGNORED THE ISSUE UNTIL I GOT THE CHECK ENGINE LIGHTS.     I CONTACTED FORD DIRECTLY TO SEE IF THEY WOULD REIMBURSE FOR THE EXPENSIVE REPAIRS.  THEY HAVE NOT ISSUED A RECALL AND I AM PAST THE BUMPER TO BUMPER WARRANTY SO THEY WOULD NOT ASSIST...THEY WERE VERY POLITE, BUT UNWILLING TO PAY.    ADDITIONAL NOTE ON THE CHECK ENGINE LIGHT:  THE CHECK ENGINE LIGHT, WHEN IT CAME ON, WOULD USUALLY STAY ON FOR A FEW DAYS AND THEN EITHER LATE AT NIGHT OR EARLY IN THE MORNING I WOULD FIND THAT IT WAS OFF.  AND IT WOULD STAY OFF FOR A FEW DAYS AT A TIME AS WELL.  MY ASSUMPTION WAS THAT IT WAS SOMEHOW RELATED TO THE AMBIENT TEMPERATURE OF MY VEHICLE (WHICH IS BLACK) BECAUSE THE LIGHT WAS MORE LIKELY TO BE OFF WHEN IT WAS COOL AND DARK OR OVERCAST.           I AM LISTING THE DATE AS JUNE 2017 BUT THE PROBLEM, AT LEAST AS REGARDS THE PURGE VALVE, BEGAN A YEAR EARLIER.  BUT THE INTERMITTENT CHECK ENGINE LIGHTS AND SECOND PURGE VALVE REPLACEMENT AND CURRENT FUEL TANK COLLAPSE BEGAN IN JUNE 2017",
        "vin": "1FADP3F27DL"
    }
]