[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/10/2017",
        "dateOfIncident": "07/06/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004140,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE OUT OF TOWN AND ATTEMPTING TO REVERSE MY VEHICLE IN A PARKING LOT, MY POWER STEERING STOPPED WORKING AND MY STEERING WHEEL LOCKED UP. I WAS UNABLE TO MOVE THE STEERING WHEEL AND GOT A MESSAGE SAYING \"STEERING ASSIST FAULT. SERVICE REQUIRED\". FORTUNATELY, I WAS ABLE TO TURN OFF MY VEHICLE AND RESTART IT WITHOUT THE ERROR MESSAGE COMING BACK. WHILE DRIVING HOME ON THE HIGHWAY THAT NIGHT, I FELT THE CAR WAS HAVING DIFFICULTIES WHILE IDLING, FELT IT WAS ABOUT TO STALL SEVERAL TIMES AND WAS EXTREMELY FEARFUL THAT THE STEERING WOULD GO OUT SUDDENLY AGAIN. I TOOK MY VEHICLE INTO FORD THE NEXT DAY AND LEARNED THAT THE STEERING SYSTEM NEEDED REPLACED. THE SERVICE MANAGER SAID IT WAS COMPLETELY UNSAFE TO DRIVE HOME BEFORE A MORE THAN $1,700 REPAIR AND SAID THE STEERING COULD GO OUT AT ANYTIME. DUE TO SEVERAL OTHER RECALLS AND ISSUES WITH MY TRANSMISSION AND OTHER ELECTRICAL COMPONENTS OVER THE PAST FIVE YEARS, I CONTACTED THE CORPORATE FORD CUSTOMER SERVICE AND ASKED FOR A SOLUTION. THEY REFUSED TO ASSIST ME WITH ANY TYPE OF DISCOUNT OR FINANCIAL ASSISTANCE FOR THE $1,200 PART THAT SHOULD NOT BE SUDDENLY GOING OUT IN A FIVE YEAR OLD VEHICLE. THEY ALSO REFUSED TO TAKE ANY OWNERSHIP OVER THE MANY, MANY RECALLS ON MY VEHICLE AND MY FEARS REGARDING THE SAFETY OF THE VEHICLE. DUE TO THE OTHER RECALLS THAT FORD HAS HAD OVER STEERING CONCERNS IN RECENT YEARS, I AM EXTREMELY SCARED THAT MY CAR IS UNSAFE EVEN AFTER THE REPAIR DUE TO SEVERAL KNOWN PROBLEMS IN CARS AND PARTS THAT FORD MAKES.",
        "vin": "1FAHP3F20CL"
    }
]