[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/01/2017",
        "dateOfIncident": "06/23/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002615,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN HIGHWAY 101 AND HIT A BUMP GOING APPROXIMATELY 65 MPH.  THERE WERE 4 ADULT MALES IN THE TRUCK.  AFTER I HIT A BUMP IN THE ROAD, MY STEERING WHEEL STARTED SHAKING \"VIOLENTLY.\"  EVERYONE IN THE TRUCK WAS SCARED.  I TOOK MY FOOT OFF THE GAS AND STARTED SLOWING DOWN.  WHEN THE TRUCK GOT TO ABOUT 35 MPH, THE VIOLENT SHAKING STOPPED.  ON MY RETURN BACK HOME ON THE SAME TRIP, AGAIN THE SAME EXACT SITUATION HAPPENED WHEN I DROVE OVER A LANE DIVIDER.  MY STEERING WHEEL IS NOW  OUT OF ALIGNMENT FROM WHEN I BOUGHT THE TRUCK ABOUT 1 1/2 YEARS AGO.  I TOOK MY TRUCK TO HARPER MOTORS IN EUREKA, CA (ROBERT BARRERA SERVICE MANAGER 707-443-7311)  TO BE CHECKED OUT ON JUNE 28, 2017.   THE R/O NUMBER  WAS 785884/1. THEIR RESULT WAS THE FOLLOWING AND DOCUMENTED \"CUSTOMER STATES AROUND 60-65 MPH SLIGHT RIGHT TURN OVER LANE DIVIDERS FRONT END SHOOK HEAVILY HAS HAPPENED TWICE.  CHECK AND ADVISE.  WORK PERFORMED BY TOM CURTIS.  TEST DROVE UNIT TO TRINIDAD AND BACK UNABLE TO VERIFY CONCERN.  INSPECT FRONT SUSPENSION ALL COMPONENTS LOOK GOOD.  NO CONCERNS FOUND MADE CUSTOMER AWARE.\" NOTHING WAS DONE TO MY TRUCK TO ADDRESS THIS ISSUE NOR WAS MY STEERING WHEEL PLACED BACK INTO ALIGNMENT.  I HAVE DONE MY RESEARCH AND KNOW THIS IS CALLED THE \"DEATH WOBBLE.\"  IT SHOULD BE NOTED THAT LESS THAN 1 WEEK PRIOR TO THIS HAPPENING, I TOOK MY TRUCK INTO HARPER MOTORS FOR A FULL INSPECTION AND OIL CHANGE.  AT THAT TIME, MY TIRE PRESSURE WAS ALSO CHECKED.",
        "vin": "1FT8W3BT9GE"
    }
]