[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/23/2022",
        "dateOfIncident": "12/01/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458015,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "03/23/2022 11:06:18 3/23 Yes, I still have concerns and I have told Kia numerous times to email or text me but instead they conveniently call while I'm at work 7am-4pm so I can't answer the phone. Due to the continuous oil burning issue that Kia refuses to fix or address eventhough I have agreed to pay, the mechanic now says there's a knock sensor issue which makes it unsafe to drive. I have reached out to Kia for months now, with still no resolution in sight.. If this case is above your pay grade or administrative power, please direct my case to someone who can assist in a speedy and competent manner.  A very disappointed customer.   03/15/2022 12:24:02 3/14, 5th message- car needed to be taken to Goodyear due the following:This is the recall (see attachment) that hasn't been fixed on my Kia Sorento yet which can cause other issues  - knock sensor such as the ones (stalling) 3/13.  03/13/2022 18:03:52   4th message 3/13/2022 Interesting never received a Thursday or second call from rep Ronee as promised in a previous email. My senior citizen 2 time cancer survivor mom attempted to drive my car to return it to me in Vegas when an hour out of Tucson it stalled as oil light came on. Previously Royal Kia had promised to put extra oil in car so if this happened again, oil could be put in, no oil was in car. Everyone associated with Kia in this case has consistently been inconsistent not fulfilling promises made, plus me and my family just continued to be in convenience by Kia. Demanding a 1000 mileage a month oil consumption test during a pandemic when I work in North Vegas before service is ridulous, unrealistic, and unsafe.  Transparency and assistance would be appreciated,  but due to Kia's prior action and incompetence, I'm not hopeful. When calling, usually businesses leave a voice-mail, I have no such record from you.  Not a satisfied customer.  Pics of docs at https://photos.app.goo.gl/YauPabwvPoXzs7z87",
        "vin": "5XYKT3A62EG"
    }
]