[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/20/2017",
        "dateOfIncident": "10/15/2016",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000126,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC60",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "\"SUNROOF DRAINS TUBES ARE TOO SHORT AND ATTACH TO A SOUND TRAP IN THE A PILLAR OF VEHICLE. SOUND TRAP ALLOWS THE RAIN WATER TO DRAIN TO OUTSIDE OF VEHICLE. WITH THE DESIGN ON THE SHORT TUBES, THEY OFTEN DETACH FROM THE SOUND TRAP CAUSING EXCESSIVE WATER TO ENTER THE INTERIOR OF VEHICLE THEREBY FLOODING THE FLOOR BOARDS...  DURING HEAVY RAIN AND PARKED IN LOT, 3 INCHES OF WATER COLLECTED AT BRAKE PEDAL AREA AND RAIN DRIPPING FROM SUNROOF CONTROL AREA.... MOLD SPORES MAY DEVELOP UNDER CARPET PRESENTING HEATH CONCERNS...FAULTY DRAINAGE TUBES ARE A DOCUMENTED PROBLEM BY CUSTOMERS...\"    I FOUND THIS COMPLAINT ONLINE AND HAVE BEEN EXPERIENCING THE SAME PROBLEM FOR NEARLY ONE YEAR.  I INITIALLY THOUGHT MY WINDSHIELD WAS DAMAGED AND TOOK THE VEHICLE TO THE LOCAL VOLVO DEALERSHIP AND WAS TOLD THE EXTENDED WARRANTY WOULD NOT COVER THE REPAIR. AFTER RESEARCHING THE ISSUE ONLINE, I DISCOVERED NUMEROUS COMPLAINTS ABOUT THE DESIGN OF THE SUNROOF DRAINS. I LIVE IN WEST PALM BEACH, FL AND HAVE HAD NEGATIVE EXPERIENCES WITH THE LOCAL VOLVO SERVICE DEPARTMENTS HERE, SO I FEEL THERE IS NO RECOURSE FOR MY TROUBLES. IN TALKING WITH OTHERS REGARDING BAD SERVICE EXPERIENCES, I DISCOVERED OTHERS WHO HAVE HAD SIMILAR EXPERIENCES. ADDITIONALLY, AFTER READING COMPLAINTS ONLINE AND THE LITIGATION AGAINST VOLVO IN  THE STATE OF NEW JERSEY, IT IS APPEARS VOLVO HAS NO PLAN TO ACCEPT RESPONSIBILITY FOR THIS PROBLEM.",
        "vin": ""
    }
]