[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/10/2017",
        "dateOfIncident": "07/07/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004068,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA NOTE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I PULLED INTO MY DRIVEWAY FROM A TURN, PROBABLY GOING 5 MPH, AT A SLIGHT UP GRADE, AND MY CVT TRANSMISSION FAILED -- IT STOPPED.  THE ENGINE WAS ON, RUNNING NORMAL, BUT WHEN I PRESSED THE GAS, FLOORED IT, EVEN, THERE WAS ZERO RESPONSE.  NO REVVING, NOTHING.  I SWITCH GEARS TO LOW, THEN PARK, THEN REVERSE, THEN DRIVE.  STILL NOTHING.  THEN AFTER ABOUT A MINUTE HAD PASSED SINCE THE INITIAL FAILURE, IT STARTED TO REV A BIT AT LOW RPMS, THEN FINALLY KICK IN AND DRIVE ME UP MY DRIVEWAY.  THIS OCCURRED ON THE SAME DRIVE IN WHICH THE CAR WAS LURCHING, BUCKING, AND SHAKING VIOLENTLY UPON ACCELERATION, PARTICULARLY ACCELERATING FROM A LOW SPEED TO A HIGH ONE QUICKLY.  THIS HAS BEEN HAPPENING SINCE ONE MONTH AFTER I BOUGHT IT PRE-OWNED AND CERTIFIED FROM ENTERPRISE CAR SALES IN ELMWOOD NJ.  THE POWER TRAIN IS COVERED BY BOTH NISSAN AND ENTERPRISE.  BUT WHEN I BRING IT IN TO THE NISSAN DEALERSHIP IN ROCKLAND (BLAUVELT, NY), THEY WANT TO CHARGE ME $138 FOR DIAGNOSTICS THAT WILL PROBABLY SHOW NOTHING.  SIX WEEKS AGO I BROUGHT IT IN FOR THE EXACT SAME TWO PROBLEMS, AND IT REFUSED TO MISBEHAVE FOR THE MECHANIC, IT THREW NO CODES, AND THE ENGINE LIGHT DID NOT COME ON.  I HAVE A VIDEO POSTED TO YOUTUBE:  HTTPS://WWW.YOUTUBE.COM/EDIT?O=U&VIDEO_ID=LOOJECZO89C.  I SHOWED THE VIDEO TO THE DEALERSHIP.  THEY SAID IT WASN'T PROOF ENOUGH.  SO HERE I AM WITH A SUPPOSEDLY GOOD WARRANTY (THERE ARE ONLY 43,000 MILES ON THE CAR) FOR A NEWLY BOUGHT CAR, BUT I HAVE NO CONSUMER PROTECTION BECAUSE A MECHANIC SUPPOSEDLY CAN'T FIND A PROBLEM.  THE WARRANTY DOESN'T COVER DIAGNOSTICS.  THERE ARE AT LEAST 2 CLASS ACTION SUITS IN MOTION AGAINST NISSAN FOR THEIR CVT TRANSMISSIONS.  I HAVE A CALL IN TO THEM, TO ASK THEM TO TAKE MY CAR IN TO THE DEANSHIP AND ACTUALLY FIX THE PROBLEM, REPLACE THE CVT IF NECESSARY.  WHAT IF IT DIES AGAIN, AND I'M ON THE TRAIN TRACKS?  OR ON THE FREEWAY.  IT IS NOT SAFE!",
        "vin": "3N1CD2CPXFL"
    }
]