[
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/06/2017",
        "dateOfIncident": "06/28/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003282,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED A 2009 HYUNDAI SONATA FROM VOSS HYUNDAI IN CENTERVILLE, OHIO ON 5/21/2009. ON 10/14/14 WE TOOK THE CAR IN FOR AN 'IMPORTANT SAFETY RECALL' WHICH STATED THAT THEY CHANGED THE BRAKE LIGHT SWITCH BECAUSE IT COULD BE DEFECTIVE AND CAUSE SEVERAL PROBLEMS, ONE OF WHICH WOULD CAUSE THE ILLUMINATION OF THE ESC (ELECTRONIC STABILITY CONTROL) LAMP AMONG OTHER THINGS. EIGHT DAYS AGO OUR ESC LIGHT AND ABS LIGHT CAME ON AND STAYED ON. I MADE AN APPOINTMENT AND TOOK THE CAR TO VOSS THIS MORNING ONLY TO BE TOLD THAT I WOULD BE CHARGED $103 TO EVEN FIND OUT WHAT THE PROBLEM IS, NOT TO MENTION THE CHARGES FOR ACTUALLY FIXING A SAFETY RECALL PROBLEM WHICH I AM SURE WOULD BE EXPENSIVE. I CONSIDER THIS TO BE A SAFETY PROBLEM RELATED TO THE PREVIOUS RECALL WORK. THEY MAY HAVE REPLACED A PERFECTLY GOOD BRAKE LIGHT SWITCH WITH A FAULTY ONE. THIS CAR HAS 12,875 MILES ON IT AND WE ONLY USE IT OCCASIONALLY. IT IS IN A GARAGE AT ALL TIMES AND THIS MORNING WAS THE FIRST TIME IT HAS BEEN OUT IN RAIN. WE HAD NOT BOUGHT A NEW CAR IN MANY YEARS AND BOUGHT THIS ONE BECAUSE OF THE GREAT 10 YEAR WARRANTY ON IT. APPARENTLY I SHOULD HAVE SAT IN THE SHOWROOM AND ASKED TO READ THE FINE PRINT ON THEIR WARRANTY BEFORE BUYING IT. I HAVE RESEARCHED THIS PROBLEM ON THE INTERNET AND MANY PEOPLE ARE HAVING THE VERY SAME PROBLEM WITH ALL MODELS OF HYUNDAIS. SEVERAL PEOPLE HAVE EXPERIENCED STABILITY AND STEERING PROBLEMS RELATED TO THIS DEFECT IN DESIGN OR PARTS WHICH COULD EASILY LEAD TO AN ACCIDENT. WE REALLY LIKED THE CAR UNTIL THIS HAPPENED, THE DEALERSHIP 'NOT SO MUCH' NOW. I REALLY THINK THAT HYUNDAI SHOULD ADMIT THAT THERE IS A SAFETY PROBLEM AND FIX THE PROBLEM CORRECTLY FOR THE MANY OWNERS WHO ARE HAVING THIS HAPPEN TO THEM, NOT JUST A $10 BRAKE LIGHT SWITCH AFTER A $103 DIAGNOSTIC CHARGE.",
        "vin": "5NPET46C99H"
    }
]