[
    {
        "components": "POWER TRAIN,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/18/2019",
        "dateOfIncident": "07/09/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233215,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THIS CAR PREOWNED FROM DEALERSHIP. WITHIN A YEAR IT HAD  PROBLEMS. WELL DRIVING AT 30MPH NEAR MY HOME THE RPMS SHUT UP ON THE CAR WHILE THE SPEED STUTTERED AS IF THE CAR WAS IN NEUTRAL. I TOOK IT IN RIGHT AWAY OTHER PROBLEMS PERSISTED ON MY WAY TO THE DEALERSHIP SUCH AS NOT BEING ABLE TO SHIFT CORRECTLY.     THEY HAD TOLD ME THEY FIXED THE PROBLEM AND ALL WAS COVERED UNDER WARRANTY SO I WAS HAPPY. THIS IS WHERE IT GOT STRANGE. THEY TOLD ME THAT THEY NEED TO ORDER ANOTHER PART AND THAT IT SHOULD BE HERE WITHIN A WEEK. AS I AM NOT VERY CAR SAVVY SO I DON'T RECALL THIS PART BUT IT WAS UNDER WARRANTY SO I WAS AT EASE. THEY OFFERED TO KEEP MY CAR UNTIL THE PART ARRIVED, WHICH I THOUGHT WAS FINE.. LUCKILY I DIDN'T BECAUSE 2 1/2 WEEKS WENT BY BEFORE I MADE IT BACK INTO THE DEALERSHIP AND I ASKED THE PERSON WHO SERVICED MY CAR WHEN MY PART WAS COMING IN. HE SAID IT DEFINITELY SHOULD'VE ARRIVED BY NOW AND IT'S STRANGE THAT IT HASN'T. I COME BACK ANOTHER FEW WEEKS LATER AND THEY CLAIM THAT THERE WAS NEVER ANY ORDER FOR ME AT ALL. I DON'T KNOW WHO ORIGINALLY SERVICED ME I JUST ASSUMED THEY'D HAVE MY RECORDS.     FLASHFORWARD A YEAR LATER IN THE SAME EXACT THING IS HAPPENING BUT EVEN WORSE.      IT WON'T GO IN REVERSE OR  SPORT MODE. IT'S BEEN TURNING ON SOME DAYS AND NOT OTHERS AND IT GOES ABOUT 5 MILES AN HOUR. I TRY TO TAKE IT INTO THE FORD DEALERSHIP AND THEY'RE TRYING TO SAY IT IS NO LONGER UNDER WARRANTY EVEN THOUGH MY CAR IS UNDER 60,000 MILES. THEY WANT TO CHARGE ME $150 TO DIAGNOSE I GOOGLE SEVERAL DIFFERENT PLACES THAT WILL DO IT FOR FREE. GOT THE ERROR CODE  P2837. FORD STILL WANTS TO CHARGE ME TO DIAGNOSE. WHEN I TRY TO CALL AND TALK ABOUT HOW THIS CAR DOESN'T SEEM SAFE ENOUGH TO HAVE EVEN SOLD AND ASK ABOUT THE RECALLS THEY ACT LIKE IT'S A ONE IN 1 BILLION THING AND KEEP CONNECTING ME TO DIFFERENT DEPARTMENTS WHERE I JUST GET AN ANSWERING MACHINE. NOT RIGHT",
        "vin": "1FADP3F21EL"
    }
]