[
    {
        "components": "AIR BAGS,SERVICE BRAKES,ENGINE",
        "crash": true,
        "dateComplaintFiled": "06/20/2017",
        "dateOfIncident": "02/23/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11000204,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "RABBIT",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD OBSERVED TWICE THAT THE ABS AND BRAKE SYSTEM LIGHTS ILLUMINATED UNDER HEAVY BRAKING. I READ THE SERVICE MANUAL AND SEVERAL VW FORUMS AND MY UNDERSTANDING WAS THAT THIS WAS NORMAL UNDER WHAT IS CALLED 'EMERGENCY BREAK'. I BOTH CASES TURNING THE IGNITION OFF AND ON AGAIN RESTORED THE CAR TO NORMAL.    ON FEBRUARY 2013 THE ABS/ESC SYSTEM FAILED AND THE CAR CRASHED AGAINST A WALL WHILE BRAKING BEFORE A TURN. AIRBAGS DID NOT DEPLOY. WE WERE TWO PASSENGERS ON BOARD: BRIAN FOXE AND MYSELF. FORTUNATELY, NONE GOT HURT ALTHOUGH I HAD TO BE PICKED UP BY PARAMEDICS. WE BOTH HAVE TAKEN THAT TURN MANY TIMES AND WE COULD NOT EXPLAIN WHAT WENT WRONG WENT WE USED THE BRAKES BEFORE THE TURN. WE NEVER UNDERSTOOD WHAT HAPPENED UNTIL I GOT THE RECALL.     SINCE THEN, THE ABS FAILURE HAD CAUSED AT LEAST THE FOLLOWING:    -SUFFERING FROM THE CRASH AND INCREDIBLE AMOUNTS OF STRESS WHICH REQUIRED THERAPY  -I HAD TO BUY ANOTHER CAR ASAP AND I BOUGHT ANOTHER 2007 RABBIT   -THE 2009 RABBIT WAS FINALLY PUT BACK TOGETHER ON JULY  AUGUST 2013   -THE 2009 RABBIT WOULD LOSE ABS/ESC AT THE SIGHTLESS BREAK SO IT HAS BEEN SITTING AS A BACKUP CAR SINCE THEN.  -THE CAR WAS SERVICED FOR A TRANSMISSION ISSUE ON 2016 (VOLKSWAGEN CUSTOMER CARE 160612855) AND AFTER IT CAME BACK FROM THE DEALER THE SYMPTOMS DISAPPEARED. THAT MAKES ME BELIEVE THAT EITHER:  OVW KNEW ABOUT ABS/ESC ISSUES (SAFETY RECALL 45F2) AND PREVENTIVELY UPDATED THE ECU.  OTHE ECU WAS UPDATED AS A ROUTINE OR AS PART OF THE TRANSMISSION SERVICE.    AS PER TODAY, I BELIEVE I HAVE A RABBIT THAT HAS ALREADY HAD THE ECU UPGRADED AND CANNOT BE DIAGNOSED ANYMORE. HOWEVER, I HAVE EVIDENCE AND WITNESSES OF WHAT HAPPENED",
        "vin": "WVWBB71K59W"
    }
]