[
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/03/2017",
        "dateOfIncident": "07/11/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002877,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SMOG LIGHT KEEPS GOING ON EVEN AFTER I HAVE IT REPAIRED.  I KNOW SOMEONE WHO HAS THE SAME EXACT CAR THAT I HAVE AND SHE GOT THE RECALL ON THE ECM AND THEY REPLACED IT AND SHE DID NOT HAVE TO REPLACE THE CATALYTIC CONVERTER TO PASS THE CA SMOG.  I REPLACED IT ALREADY AND IT IS SUPER EXPENSIVE...1,600!!  LAST YEAR I HAD MY CAR SERVICE FOR THE CHECK ENGINE LIGHT AND IT COST ME 1,000.  AFTERWARDS THE CHECK ENGINE LIGHT WENT ON AGAIN.  THEY ARE SAYING I HAVE TO HAVE THE CATALYTIC CONVERTER REPLACED AGAIN.  I FEEL THIS IS UNFAIR IF MY FRIEND HAD THAT CONTROL MODULE REPLACED AND NO LONGER HAD THE CHECK ENGINE LIGHT PROBLEM LIKE I AM HAVING.  I BELIEVE IT COULD BE THE MECHANISM IS FAULTY.  IT IS HARD TO BELIEVE I HAVE TO REPLACE THE CATALYTIC CONVERTER ALL OVER AGAIN.  I DID NOT DRIVE THAT MANY MILES.  PLUS IN CA THEY SAID THEY WOULD GIVE US MONEY TOWARDS THE REPAIR BUT IT WAS VERY DIFFICULT AND I WAS LED TO BELIEVE I COULD GET 500 PLUS 800 SO I THOUGHT I WOULD BE PAYING THE BALANCE AFTER 1300 WHICH WOULD HAVE STILL BEEN 300 PLUS BUT I WAS ONLY ABLE TO GET 500 TOWARDS THE REPAIR SO I STILL HAD TO PAY 1,100!  IT REALLY BOTHERS ME BECAUSE MY FRIEND WHO HAS THE SAME MAKE AND MODEL HAD THE SAME PROBLEM WITH THE CHECK ENGINE LIGHT GOING ON AND THEY RECALLED IT AND REPLACED IT SHE HAS NEVER HAD TO REPLACE HER CATALYTIC CONVERTER YET BUT I AM NOW HAVING TO DO IT TWICE!  SHE HAS HIGH MILEAGE PERHAPS MORE THAN I HAVE.  PLEASE LOOK INTO THIS FOR ME.",
        "vin": "JTDBR32E330"
    }
]