[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/11/2017",
        "dateOfIncident": "06/19/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004321,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "NISSAN POWER CONTROL VALVE LOOSE FASTENERS:  MY CONCERN RESONATES WITH CONSUMER SAFETY THAT INVOLVES GROSS ENGINE FAILURE DURING OPERATIONS DUE TO LOOSENING INTERNAL FASTENERS/COMPONENTS.  WHILE DRIVING ON A CITY STREET, I NOTICED AN ABRUPT AND UNUSUAL MECHANICAL GRINDING SOUND COMING FROM MY VEHICLE (V6 PATHFINDER).  EVENTUALLY THE CAR WOULD NOT START.  AFTER HAVING IT TOWED TO THE DEALER FOR DIAGNOSTICS AND SERVICE, THE TECHNICIAN NOTICED THAT AN INTERNAL POWER CONTROL VALVE WAS MISSING FROM THE INTAKE AFTER HE HAD REMOVED THE VALVE COVER DURING HIS TROUBLESHOOTING. I PURCHASED THIS VEHICLE NEW (SOLE OWNER) AND HAVE NEVER HAD ANY WORK/MAINTENANCE PERFORMED THAT REQUIRED THE VALVE COVER TO BE REMOVED. AFTER DOING SOME RESEARCH ON MY OWN, I FOUND MULTIPLE COMPLAINTS ABOUT NISSAN POWER CONTROL VALVE SCREWS LOOSENING, FALLING WITHIN THE ENGINE AND CAUSING SEVERE ENGINE FAILURE WHILE DRIVING AND MORE THAN $2K IN REPAIRS TO THE CONSUMER.  I ALSO NOTED THAT NISSAN (WEST COAST, CALIFORNIA) RECENTLY RECALLED VARIOUS MODELS/MULTI-YEARS, INCLUDING THE 2002 PATHFINDER, ACKNOWLEDGING THE PROBLEM WITH LOOSENING FASTENERS WITHIN THE RESPECTIVE ENGINES; HOWEVER, NO RECALL WAS ENACTED FOR THE SAME MODELS ON THE EAST COAST USA.   ALTHOUGH MY VEHICLE WAS EVENTUALLY DIAGNOSED WITH IDLE AIR CONTROL VALVE  AND ELECTRONIC CONTROL MODULE (ENGINE) PROBLEMS, THE LOCATION (WITHIN MY ENGINE) OF THE MISSING POWER CONTROL VALVE AND IT'S FASTENERS IS NOT KNOWN AND I AM NOT CONVINCED THAT THIS FOREIGN MATERIAL (LOOSE SCREWS/VALVE) WOULD NOT HAVE BEEN THE ROOT CAUSE OF THESE DIAGNOSED FAILURES. PLEASE NOTE THAT I HAVE BEEN VERY FORTUNATE IN THAT MY VEHICLE HAS OVER 200K MILES; HOWEVER, THERE ARE MULTIPLE POWER CONTROL VALVES WITHIN MY (THESE) VEHICLES THAT MAY BE SUBJECT TO FAILURE AND MOST IMPORTANTLY IF OTHER CONSUMERS MAY BE ONE ENGINE FAILURE AWAY FROM A POTENTIAL CATASTROPHIC RESULT.",
        "vin": "JN8DR09X62W"
    }
]