[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/23/2017",
        "dateOfIncident": "06/23/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000909,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD MOTOR COMPANY (FORD) IS RECALLING CERTAIN MODEL YEAR 2013-2015 FORD TAURUS, FORD FLEX, LINCOLN MKS AND LINCOLN MKT VEHICLES EQUIPPED WITH 3.5L GTDI ECOBOOST ENGINES AND 2013-2015 FORD TAURUS POLICE INTERCEPTOR VEHICLES. A COMPONENT WITHIN THE FUEL PUMP ELECTRIC MODULE (PEM) MAY OVERHEAT CAUSING A LOSS OF ELECTRICAL POWER TO THE FUEL PUMP.    CONSEQUENCE  A LOSS OF POWER TO THE FUEL PUMP WILL CAUSE THE ENGINE TO STALL OR PREVENT THE VEHICLE FROM STARTING, INCREASING THE RISK OF A CRASH.    WHAT OWNERS SHOULD DO  FORD WILL NOTIFY OWNERS, AND DEALERS WILL INSPECT THE FUEL PEM PART NUMBER AND REPLACE THE FUEL PEM, AS NECESSARY, FREE OF CHARGE. THE RECALL BEGAN ON DECEMBER 1, 2016. OWNERS MAY CONTACT FORD CUSTOMER SERVICE AT 1-866-436-7332. FORD'S NUMBER FOR THIS RECALL IS 16S31.  I HAD THIS PART SUDDENLY GO OUT ON ME ON 6/22/2017 AND HAD IT TOWED TO MY DEALERSHIP. I HAD RECEIVED AN OIL CHANGE AT OUR LOCAL WALMART AND WHEN THEY WENT TO PULL IT OUT OF THE GARAGE THE CAR WOULD NOT START. SO I HAD IT TOWED.  I HAD THIS PART REPLACED 6/23/2017 AND I WAS TOLD THAT MY VIN # WAS NOT ISSUED FOR THE RECALL.  EVEN THOUGH THEY ADMITTED THAT THE VEHICLE WAS MANUFACTURED WHERE THE RECALLS CAME FROM AND THE DATES OF  PRODUCTIONS OF THE RECALL.  THIS VEHICLE MET THOSE CONDITION BUT FOR SOME REASON MY VIN WAS NOT ON THE RECALL LIST SO THEY WILL NOT PAY FOR MY PART OR LABOR TO REMOVE AND REPLACE IT.",
        "vin": "2FMGK5B83DB"
    }
]