[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/17/2017",
        "dateOfIncident": "05/08/2017",
        "fire": false,
        "manufacturer": "Newmar Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005981,
        "products": [
            {
                "manufacturer": "Newmar Corporation",
                "productMake": "NEWMAR",
                "productModel": "LONDON AIRE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS MODEL IS BUILT ON A FREIGHTLINER PASSIVE STEER CHASSIS.   FREIGHTLINER (FCCC) HAS HAD A PROBLEM WITH THEIR PRODUCTION MOUNTING THE TAG AXLE OFF CENTER WITH POOR ALIGNMENT FOR  THE TAG AND/OR STEER AXLES.  THIS PROBLEM WAS KNOWN BY FCCC SINCE ITS EARLY PRODUCTION(4/1/2015).  A REPORT BY FCCC ENGINEER, ERIC PANCEROFF, WAS PUBLISHED ON NEWMAR CORPS WARRANTY SITE.  I HAD WRITTEN A LETTER TO FCCC AND DAIMLER TRUCKING (DTNA), THE PARENT COMPANY FOR FCCC, RAISING CONCERN OVER THE CONTINUED PRODUCTION OF THIS DEFECTIVE CHASSIS.  SINCE MY LETTER, FCCC HAS REMOVED THEIR OWN ENGINEER'S REPORT AND IS NOT MAKING ANY EFFORT TO ADVISE THEIR CUSTOMER OF THIS VERY POTENTIALLY SERIOUS DEFECT.      THERE ARE MANY OTHERS WHO HAVE THIS PROBLEM AND ARE NOT AWARE.  THE POOR ALIGNMENT WILL CAUSE TIRE WEAR AND EVENTUALLY TIRE BLOWOUTS.  JUST TODAY, I DISCOVERED THE SIDE WALL ON THE LEFT FRONT OF MY UNIT IS STARTING TO SEPARATE FROM THE TIRE SURFACE.  THIS IS AFTER SIX ATTEMPTS ON ALIGNMENT AND 8 TIRES REPLACED SOFAR.   ON A 45 FT LONG RV WITH MORE THAN 40,000 POUND WEIGHT, A TIRE FAILURE CAN POTENTIALLY CAUSE A SERIOUS ACCIDENT.  THIS IS A SERIOUS TIME BOMB FOR MANY RV OWNERS WHO UNKNOWINGLY DRIVING THEIR UNITS WITH THIS POTENTIAL DEFECT.   THIS FCCC ATTEMPT TO HIDE THE PROBLEM CAN POTENTIALLY CAUSE SERIOUS HARM TO INNOCENT PEOPLE WHO MAY END UP IN A SERIOUS ACCIDENT DUE TO NEGLIGENCE ON PART OF FCCC AND DTNA.",
        "vin": "4UZFCTBG0HC"
    }
]