[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/09/2017",
        "dateOfIncident": "07/08/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003913,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FUSION",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JULY 8, 2017 WHILE RIDING AS A PASSENGER AND MY HUSBAND DRIVING WITH OUR 5 YR OLD NIECE IN THE BACK STRAPPED IN HER CAR SEAT.  A WARNING ON THE DASH BOARD SHOWED \"SERVICE ADVANCETRAC\"/\"SERVICE POWER STEERING NOW\" WE IMMEDIATELY HEADED FOR THE NEAREST AUTO STORE TO PURCHASE POWER STEERING FLUID AND IN DOING SO WE QUICKLY NOTICED THAT MY HUSBAND HAD TO USE MUSCLE AND ADDITIONAL EFFORT TO TURN THE STEERING WHEEL. AFTER FINDING OUT WE HAD AN ELECTRONIC MODULE AND COULD NOT MANUALLY REFILL THE POWER STEERING WE TOOK THE CHANCE OF HEADING HOME WHILE MY HUSBAND CONTINUED TO AGGRESSIVELY GET THE STEERING WHEEL TO TURN WITHOUT ANY ACCIDENT.  WHEN LOOKING UP RECALL INFORMATION I NOTICED THAT ACCORDING TO OUR VIN NUMBER OUR 2013FORD FUSION SE WAS NOT OF THE SPECIFIC MODELS COVERED.  WE HAVE CALLED THE DEALERSHIP AND WILL HAVE TO WAIT UNTIL JULY 11TH AND PAY $95.00 JUST TO DIAGNOSE THE OBVIOUS PROBLEM AND GET AN ESTIMATE.  WE HAVE NEVER RECEIVED A WARNING REGARDING THIS MALFUNCTION FROM  FORD THAT OUR LIVES COULD SUDDENLY BE IN DANGER BECAUSE OF THE POWER STEERING GOING OUT AND THE FACT THAT WE LIVE ON MODEST INCOME AND HAVE ONLY ONE CAR. WE EXPECT FORD TO DO THEIR DUE DELIGENCE IN EXTENDING THE RECALL TO COVER THE COST OF THE REPAIR FOR THE POWER STEERING ON OUR 2012 FORD FUSION.  WE HAVE ALWAYS AND ONLY PURCHASED OUR CARS FROM FORD AND LOOK FORWARD TO BEING PROVIDED EXCELLENT AND HONORABLE SERVICE IN RETURN SIMPLY BECAUSE IT IS THE RIGHT THING TO DO.",
        "vin": "3FAHP0HA6CR"
    }
]