[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/18/2017",
        "dateOfIncident": "06/23/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006153,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "Q50",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WE TOOK OUR CAR IN FOR ITS FIRST OIL CHANGE AT A OIL LUBE BUSINESS AND AFTERWARD OUR CAR'S ENGINE SEIZED UP ABOUT 4 MILES DOWN THE ROAD, AND COMPLETELY DESTROYED ITSELF. AFTER INVESTIGATING, IT SEEMS THE OIL TECH MAY HAVE DAMAGED THE OIL FILTER ASSEMBLY'S DELICATE END TIP PIECE UNBEKNOWNST TO HIM. IT IS INCONCLUSIVE IF HE DAMAGED IT OR BROKE IT OFF. AT A LATER DATE THIS OIL LUBE BUSINESS GAVE US AN INFINITI TBS THEY GOT FROM OUR INFINITI DEALERSHIP, THAT THEY NOR I, HAD EVER SEEN. ALSO IT DOES NOT SEEM TO BE FILED WITH ANYONE NOR THE NHTSA. THE TBS CLAIMS THAT THIS PART BREAKS VERY EASILY IF NOT PROPERLY HANDLED. ALSO WHEN OUR PROBLEM WAS DIAGNOSED BY AN INFINITI TECH, HE TOLD US THIS PART BREAKS SO OFTEN, THAT THEY HAVE TO KEEP THE ITEM IN STOCK IN THEIR PARTS DEPARTMENT. HE ALSO SAID THE PART WAS MISSING FROM THE ENGINE IMPLYING THAT THE OIL LUBE BUSINESS HAD BROKEN IT OFF, AND KNOWINGLY PUT A BROKEN PART BACK IN. BUT PER VIDEO THAT WAS GIVEN TO US, THAT IS INCONCLUSIVE. ALL WE SEE IN THE VIDEO IS THE OIL TECH HOLDING THE PART FROM THE DELICATE END OF THE OIL FILTER ASSEMBLY. PER THE INFINITI TBS AND THEIR TECH'S OWN WORDS TO US, THE PROBLEM STEMS FROM THE FIRST OIL CHANGE WHERE THE FILTER IS VERY HARD TO GET OFF THE FIRST TIME. HENCE MANY PEOPLE TEND TO OVER STRESS THE PART AND THE VERY DELICATE PLASTIC END TIP WILL GET DAMAGED OR BREAK OFF DURING THE OIL CHANGE. I BELIEVE THIS PART IS DEFECTIVE AND BUILT VERY WEAK WITH A PLASTIC MATERIAL THAT CAN'T HANDLE ANY STRESS ON IT. IF DURING AN OIL CHANGE BY A DIY OR ANOTHER OIL LUBE BUSINESS LIKE \"JIFFY LUBE\" WHO DON'T KNOW THIS TBS EXISTS (WHICH WE DID NOT BECAUSE INFINITI KEPT IT FOR THEIR OWN TECHS), THEN THERE IS A POTENTIAL FOR THE DAMAGED PART TO BE REINSERTED IN THE ENGINE WHERE IT COMPLETELY COMES OFF INSIDE AND RUINS THE ENTIRE ENGINE. THIS COULD BE A LIFE THREATENING HAZARD ON THE ROAD IF ENGINE COMES APART!",
        "vin": "JN1CV7AP4GM"
    }
]