[
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/01/2019",
        "dateOfIncident": "09/27/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265415,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS V",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS LEAVING WORK AND AS I GOT ON TO THE FREEWAY, I NOTICED THAT WHEN I PRESSED THE ACCELERATION, THE CAR WOULD REV AND JERK. DIDN'T THINK MUCH OF IT THINKING I WOULD MAKE IT HOME. BY TIME I MADE IT TO THE FREEWAY, MY CAR BEGAN TO REV LOUDLY AND I NOTICED I WAS LOOSING ACCELERATION. AROUND THIS TIME I WAS GOING ALMOST 65MPH.  SO I PULLED OFF THE FREEWAY AND INSPECTED THE ENGINE, DIDN'T SEE ANYTHING OUT OF THE ORDINARY SO TRIED TO CRANK IT UP AGAIN. CAR CRUNK, 'READY' LIGHT CAME ON AND SO DID ELECTRIC VEHICLE MODE. AS THE CAR WENT START THE ENGINE, THE LOUD RATTLE AND SHAKING OF THE CAR COULD BE HEAR AND FELT. I WAS ABLE TO DRIVE ANOTHER HALF A MILE BEFORE THE CAR JUST SHUT DOWN. THEY CAR WOULD NOT DRIVE OVER 5 MILES PER HOUR. WHEN IT SHUT DOWN THE ENGINE BEGAN TO SMOKE SO I KNEW THAT COULD NOT BE GOOD.   I TRIED TO TURN IT BACK ON AND AT THE POINT I NOTICED I COULD NOT PUT THE CAR INTO REVERSE NOR DRIVE. THE 'READY' LIGHT DID NOT COME ON AND I NO LONGER HAD POWER STEERING. THE FOLLOWING DAY I GOT IT TOWED TO THE MECHANIC AND WAS INFORMED THAT I HAD 'THREW A ROD.'   I LOOKED AND SAW THAT OTHER OWNERS HAD SUBMITTED A COMPLAINT WITH VERY SIMILAR ISSUES.   THOUGHT THAT SUBMITTING THIS WOULD BE EFFECTIVE AS IF THIS ISSUE PERSIST. THERE MAY NOT BE OTHER OWNERS WHO ARE LUCKY ENOUGH TO MAKE IT OFF THE FREEWAY WITHOUT HAVING ANY ACCELERATION POWER.",
        "vin": "JTDZN3EU3D3"
    }
]