[
    {
        "components": "AIR BAGS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/17/2020",
        "dateOfIncident": "06/20/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321415,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "IS",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "HI , MY FIRST NAME IS [XXX] LAST NAME IS [XXX] ,MY MAILING ADDRESS IS [XXX].  I HAS A LEXUS IS 250 2012  , 86000 MILE         LAST 10 MONTH AGO MY CAR HAS A RECALL MAIL REPLACEMENT AIR BAG FROM LEXUS,BUT MY CAR WAS IN A GOOD CONDITION EVERY THING IS FUNCTION GOOD WITH NO ANY PROBLEM, BUT AFTER I TOOK MY CAR TO THE LEXUS OF TOWSON LOCATION 1040 YORK RD , TOWSON, MD 21204 .AFTER THEY REPLACEMENT MY CAR AIR BAG .MY CAR WAS WENT ON A WARNING LIGHT NOTE THAT AIR BAG OFF ,SO IT MEANS AIR BAG NOT WORKING PROPERLY ,BUT BEFORE THAT MY CAR HAS NON OF THE LIGHT PROBLEM EVERYTHING  IS GOOD. I CALL THE LEXUS OF TOWNSON.  TOLD THEM MY CAR WAS A WARNING LIGHT AFTER THE RECALL REPLACEMENT AIR BAG, THEY TOLD ME THAT I HAS TO PAID FOR  300.00$ FOR DIAGNOSTIC AND ADDING LABOR AND MORE  TO FIX FOR  THE AIR BAG WARNING LIGHT. SO AFTER MY COUSIN TOLD ME DRIVING WITH AIR BAG WARNING LIGHT ON COULD  BE DANGER, BECAUSE ANY TIME HAS  ACCIDENT THE VEHICLE AIR BAG MAY NOT PROJECT THE PASSAGE  ,SO I SCHEDULE APPOINTMENT  I TOLD THEM MY CAR ISSUE AFTER THEY RECALL AIR BAG REPLACEMENT . I TOLD THEM THE DEALER HAS TO RESPOND FOR THIS. AT THE FINAL I TAKES MY CAR HOME BECAUSE THEY ASKED FOR 300.00$ DIAGNOSTIC  AND ADDING OVER THOUSAND FOR LABOR AND MORE .BECAUSE I ALWAYS BUSY FOR MY FAMILY I HAS TO TAKES MY MOM TO CHECK UP HER HIGH BLOOD PRESSURE AND OTHER THING EVERY WEEK. SO I CONTRACT THE  LEXUS HEADQUARTER THEY TOLD ME THE SAME THING, I KEEP CONTRACT THEM AND TODAY I CALL THEM AND KNOWN THAT THEY CLOSE MY CASE , BUT I NEVER RECEIVER ANY EMAIL THAT MY  CASE WAS CLOSE. I NEED MY AIR BAG LIGHT OFF  WARNING LIGHT GET  FIX  . AND THANK FOR READING THIS .. I HOPE THE DEALER WILL FIX MY CAR AIR BAG WARNING LIGHT FOR THE PASSAGE SIDE TO GET FIX THANK AND STAY SAFE ...       INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "JTHCF5C22C5"
    }
]