[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/06/2017",
        "dateOfIncident": "09/28/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11044015,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - I HAVE CONTACTED NISSAN'S CORPORATE OFFICES AFTER CALLING LOCAL NISSAN DEALERS TO COORDINATE THE REPLACEMENT. I WAS TOLD BY THE DEALERS THAT THE RECALL AND REPLACEMENT OF PARTS WILL NOT BEGIN TO TAKE PLACE UNTIL SPRING OF 2018. I WAS TOLD THE SAME BY THEIR CORPORATE OFFICES. I EXPLAINED THAT I DON'T FEEL COMFORTABLE AND SAFE OPERATING THE VEHICLE AND WAS ADVISED TO CONTACT MY LOCAL DEALERSHIP FOR A LOANER. I WAS TOLD BY ALL OF MY LOCAL DEALERS THAT MY REQUEST IS NOT FEASIBLE AS THEIR LOANER VEHICLES ARE LIMITED AND INTENDED FOR OTHER PURPOSES. I INFORMED THEM THAT IT WAS THEIR CORPORATE OFFICE WHO OFFERED IT AS A SOLUTION, BUT THEY SAID NO. WHEN ICALLED THEIR CORPORATE OFFICES TO INQUIRE AS TO WHY I WAS ADVISED TO REQUEST A LOANER IN THE MEANTIME, THEY ASKED ME TO BE PATIENT AND WAIT UNTIL THEY'RE READY TO REPLACE THE PARTS. AGAIN, I ASKED WHY THE AFOREMENTIONED SOLUTION WAS INITIALLY OFFERED IF IT WASN'T AN OPTION. I WAS MET WITH THE SAME STATEMENT AND THEIR REPRESENTATIVE STATED THAT TO DATE, THERE HAVE BEEN NO INCIDENTS REPORTED INVOLVING THIS PARTICULAR ISSUE. I ASKED, IF THAT'S THE CASE, HOW WAS YOUR COMPANY MADE AWARE OF THIS SAFETY ISSUE AND I WASN'T GIVEN AN ANSWER. THEY REPEATED THEMSELVES AND OFFERED NO VIABLE SOLUTION. AT THE MOMENT, I NEED THE VEHICLE FOR TRANSPORTATION TO/FROM WORK AND I PRAY THAT I DON'T GET INVOLVED IN ANY TYPE OF ACCIDENT. SINCE THEN, I'VE BEEN RECEIVING SOLICITED CALLS FROM THE DEALERSHIPS REGARDING THE RECALL. HOWEVER, IT'S NOT TO REPLACE THE DEFECTIVE PART(S), IT'S TO PURCHASE ANOTHER VEHICLE AS A SOLUTION TO THE RECALL. IT'S PREPOSTEROUS THAT THE WOULD EVEN CALL REGARDING THE RECALL TO SOLICIT SALES INSTEAD OF ACTUALLY ADDRESSING THE ISSUE.",
        "vin": "3N1BC1CP4BL"
    }
]