[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/26/2017",
        "dateOfIncident": "06/26/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001409,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE DOOR WON'T SHUT ON MY 2014 HONDA ODYSSEY VAN. I PARKED THE VAN IN A PARKING GARAGE AND WE SHUT ALL THE DOORS THE PASSENGER WOULD ONLY SHUT HALF WAY AND THEN RE-OPEN. AFTER ABOUT AN HOUR OF TRYING TO SEE IF ANYTHING WAS STUCK I CALLED AAA AND BECAUSE I COULD NOT LEAVE MY CHILDREN ALONE WHILE I DRIVE THE VAN OUT OF THE GARAGE AND BECAUSE I COULD NOT DRIVE WITH THEM IN THE VAN WITH THE DOOR OPEN WE HAD TO WAIT 3 HOURS FOR A TRUCK THAT WOULD FIT IN A GARAGE. AAA FINALLY CAME AND SAID THEY COULD NOT TOW THE VAN BECAUSE THE DOOR MUST BE SHUT FOR LIABILITY AND SAFETY REASONS. SO I AM STUCK IN A GARAGE WITH 4 KIDS AND NO ONE CAN HELP ME. AT THIS TIME MY FIANC SHOWED UP (WE WERE OUT OF TOWN ABOUT AN HOUR AWAY FROM HOME) AND AAA AND HE DECIDED TO CUT THE CABLE THAT IS ATTACHED TO THE DOOR AND THE DOOR SHUT.. BUT THE DOOR IS BROKEN. I CALLED HONDA OWNER AND MADE A COMPLAINT BUT FROM MY UNDERSTANDING IT'S JUST NOTED NO ACTION IS TAKEN IN THE MEAN WHILE MY ALMOST $30,000 VAN HAS A BROKEN DOOR THEY CAN IS ONLY 3 YEARS OLD. I CALLED MY LOCAL HONDA (THEY WERE NOT VERY NICE) IT SEEMS ALL ABOUT THE$$ AND NOT THE SAFETY OF THEIR HONDA OWNERS. THEY SAID THEY WILL LOOK AT MY CAR FOR A FEE OF$140.. I LOOKED UP PARTS ONLINE AND $400 + SO THAT PLUS WHAT EVER THEY CHARGE ME TO FIX PROBABLY $1000 FOR SOMETHING THAT SHOULD NOT BE BROKEN IN THE FIRST PLACE. PEOPLE WHO USUALLY GET VANS ARE PEOPLE THAT HAVE MULTIPLY CHILDREN. THIS IS A SAFETY ISSUE THAT NEEDS TO ADDRESSED ASAP IT'S CHILD INDANGERMENT TO HAVE A OPEN DOOR WHILE YOUR DRIVING DOWN THE ROAD. AND WHAT IF I HAD TO LEAVE IT THERE BECAUSE I HAD NO ONE THEN IT WOULD NOT BE SECURE IT WOULD BE WIDE OPEN.PLEASE LOOK INTO THIS ASAP THIS NOT SOMETHING ANY PARENT SHOULD HAVE TO GO THROUGH. THUS SITUATION MADE ME FEEL HELPLESS MY KIDS WERE TIRED, HUNGRY AND HAD TO USE THE BATHROOM AND I WAS HELPLESS. I COULDN'T DO ANYTHING.",
        "vin": "5FNRL5H69EB"
    }
]