[
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/10/2017",
        "dateOfIncident": "07/07/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004021,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "EYESIGHT TECHNOLOGY WARNING SHOWED INOPERABLE ALONG WITH LANE DEPARTURE AND FRONT END COLLISION AVOIDANCE SYSTEM. THE CAR HAD BEEN RUNNING LESS THAN 3 MINUTES AFTER OVER 24 . PULLED OVER CALLED DEALER WHO ATTEMPTED TO WALK ME THROUGH RESET. UNSUCCESSFUL NO AVAILABILITY FOR SERVICE SO SCHEDULED  AN APPOINTMENT 3 DAYS LATER. CAR WARNING LIGHTS CLEARED ON THEIR OWN. SHOWED ADVISOR EMAIL FROM AUTO MESS. FROM SUBARU INDICATING WARNING LIGHT WAS AN ISSUE. WAS TOLD CODE WOULD BE CHECKED BUT SUBARU WAS AWARE OF THE ISSUE WHEN SOME CARS WERE OVERHEATED. DEALERSHIP WAS ADVISED TO CLEAR THE CODE AND SEND PEOPLE ON THEIR WAY. NO CODES REGISTERED AT ALL IN THE SYSTEM AND WHEN I LET THEM KNOW THAT CAR WAS ABSOLUTELY NOT OVERHEATED, I WAS TOLD THERE WAS NOTHING THAT COULD BE DONE BECAUSE SUBARU KNOWS THAT WHEN CARS OVERHEAT IT SOMETIMES HAPPENS. NOTHING COULD BE DONE BUT THE GREATER CONCERN IS THAT THEIR PREMISE OF WHEN THE ISSUE IS OCCURRING IS INACCURATE AT LEAST IN OUR CAR'S CASE AND IT DID NOT APPEAR, DUE TO THE REPETITION OF THE COMPANY CONTENTION THAT OVERHEATING WAS THE CAUSE OF THE ISSUE NOR WERE THEY WILLING TO ENTERTAIN ANY OTHER SCENARIO THAN THAT WHICH SUBARU ALREADY DECIDED. SPOKE WITH SUBARU OF AMERICA WHO 7/10/17 CUSTOMER SERVICE WHO STATED NOT AWARE OF ANY ISSUES BUT WOULD LOOK IN TO IT. BY THE END OF DAY 7.13.17.",
        "vin": "4S4BSANC9G3"
    }
]