[
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/18/2019",
        "dateOfIncident": "09/18/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256515,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "2012 KIA SERENTO 2/25/2017& KIA HAD A \"ANTI-CORROSION\"RECALL AND WE HAD IT SERVICED AT MIKE SMITH KIA IN PADUCAH,KY-4/14/17,WE WILL CALL THIS DOCUMENT1.THEN WE WE RECEIVED MAJOR ENGINE RECALL IN SEPTEMBER 20,2017 ABOUT 2012 KIA SERENTO'S STALLING,DOCUMENT 2.WE TOOK THE VEHICLE TO WYATT JOHNSON KIA OF TN. OCTOBER 7,2017 & WE WERE TOLD IF IT DID NOT PASS THEIR TESTS THEY WOULD REPLACE THE ENGINE.OK,WELL THEY SAID IT PASSED,AND CHANGED THE OIL,&SUPPOSEDLY PUT AN \"MIL\" SENSOR AND\"MIL\" DASH LIGHT TO DETECT ONCOMING ENGINE FAILURE AND SEND THE CAR INTO WHAT THEY CALL A   'LIMP\" MODE. WHICH IS NOT DOCUMENTED ON DOCUMENT #3 WHICH TO OUR SURPRISE IT PASSED BECAUSE IT HAD BEEN MAKING AN KNOCKING SOUND AND EXPERIENCING SOME ATTEMPT'S OF THE VEHICLE STALLING.YES AFTER THE OIL CHANGE RAN SOME WHAT SMOOTHER,BUT STILL EVERY NOW AND THEN WE WOULD GET AN OCCASIONAL THROTTLE SPIKE,OR AN ATTEMPT TO STALL.GOT AN RECALL TO DO A LOGICUPGRADE,& TOOK IT IMMEDIATELY TO WYATT J. KIA DEC.12,2018,DIAGN. DID NOT DETECT CODE FROM KNOK SENSOR BUT CAUTIONED,ON PERFORM FUEL INJECTION/THROTTLE BODY SERVICE FOR $199.95 DOCUMENTS #4&5 THE WE HEAR ABOUT THIS FUEL PUMP AND FUEL LINE RECALL IN MICHIGAN ON 68,000 VEHICLES IN OUR YEAR,MAKE AND MODEL,WHICH RAISED A RED FLAG TO WHY OUR VEHICLE WAS CONTINUING TO THROTTLE SPIKE'S AND MORE APPARENT ATTEMPTS TO STALL.HOWEVER NO RECALL ON OUR'S?HAVE GOTTEN 2 MORE RECALL'S SINCE ON OUR VEHICLE,ONE HEADLAMP LOW BEAM CONNECTOR WARRANTY EXTENSION,&TWO AIR BAG CLOCK SPRING,CALLED KIA TO SCHEDULE AN APPOINT. FOR REPLACEMENT AND ASKED ABOUT THE FUEL PUMP ISSUE AND IT POSSIBLY BEING THE REASON FOR THE THROTTLE SPIKES & STALL ATTEMPTS ALL THIS TIME,BUT NO RECALL FOR OUR VEHICLE,AND WANT TO CHARGE$120+$199.FOR DIAG.AND THROTTLE BODY/FUEL INJECTION,BUT FREE REPLACEMENT OF AIR BAG SPRING ASS.?HAVE TO KEEP OIL CHANGED,BECAUSE START'S TO RUN REALLY ROUGH.THIS IS GETTING OLD!",
        "vin": "5XYKT3A65CG"
    }
]