[
    {
        "components": "ELECTRICAL SYSTEM,WHEELS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/24/2018",
        "dateOfIncident": "04/20/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089815,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "335I",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "IN  2017 MY SON WAS DRIVING ON THE INTERSTATE 91 HIGHWAY WHEN HIS FRONT DRIVER TIRE ROD BROKE OFF. BOLTS WERE MISSING BOTH DRIVER AND PASSENGER SIDES. TIRES WENT OUT AND IT COULD HAVE CAUSED A TRAGEDY THIS HAPPENED ON A FRIDAY NIGHT. WE PAID TO HAVE THE WHEELS AND TIRES REPAIRED AND REPLACED. I PROVIDE THE RECEIPTS TO THE BMW DEALER SHIP BUT THEY WERE NEVER HONORED OR REIMBURSED.  WE PAID TO HAVE WATERPUMP REPLACEMENT BECAUSE.  IN JULY 2017 THE AIR CONDITIONING WAS BLOWING HOT AIR.  IN  NOV. 2017 THE HEATING SYSTEM WAS BLOWING COLD AIR.  FEB 2018 BLOWER WAS STILL NOT WORKING, WHEN I FOUND OUT THAT THERE WERE (RECALLS). WE WAITED ALMOST 4 MONTHS FOR RECALLED BLOWER WAS REPLACED, WE PAID FOR THEMOSTRATE REPLACEMENT BUT STILL HAD NO HEAT.   CAR WON'T START. SO WE PAID FOR THE BATTERY TO BE TESTED AND REGISTERED.  SHORTLY AFTER THE CAR STARTED LEAKING COOLANT AGAIN APRIL 2018. DEFECTED WATER PUMP.   APRIL 2018 ELECTRIC SYSTEM. I DROVE THE CAR TO BMW DEALERSHIPS, FOR FUEL LEAKAGE NOW THE DEALERSHIP SERVICE DEPT. IS TELLING ME THAT THE CAR WON'T START!!! AND THAT THE STARTER NEEDS REPLACED. WE HAVE NOT HAD ANY PREVIOUS ISSUES WITH THE STARTER. AND I HAVE ALREADY SPENT NEARLY  $4,000.00  WITHIN THE PAST 5 MONTHS FOR THINGS THAT I BELIEVE I SHOULD NOT HAVE. PLEASE INVESTIGATE.      IN NOVEMBER 2017 THE CAR WAS OVERHEATING",
        "vin": "WBAPL5C5XBA"
    }
]