[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/28/2018",
        "dateOfIncident": "03/01/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11143515,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FUSION",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. I INITIALLY RECEIVED A RECALL LETTER FROM FORD DATED MARCH,2017 WHICH STATED THAT WHEN PARTS ARE AVAILABLE I WOULD BE NOTIFIED THAT PARTS ARE AVAILABLE AT WHICH TIME I WOULD CONTACT THE LOCAL FORD DEALERSHIP TO HAVE THE ISSUE CORRECTED.  I RECEIVED NO OTHER CORRESPONDENCE FROM FORD IN 2017. THEN THIS YEAR IN 2018 I RECEIVED ANOTHER NOTICE FROM FORD, STATING THE I CAN CONTACT THE LOCAL FORD DEALERSHIP AND THEY WOULD PROVIDE ME WITH A RENTAL VEHICLE UNTIL THE PARTS COME IN FOR REPAIR.  I THEN CALLED FORD OF MURFREESBORO IN MURFREESBORO, TN SO THAT THEY COULD PROVIDE ME WITH A RENTAL VEHICLE UNTIL THEY ARE ABLE TO REPLACE THE DEFECTIVE AIR BAGS. I WAS INSTRUCTED BY JONATHAN GREENE IN THEIR SHOP TO EMAIL HIM PHOTOS OF ALL 4 SIDES OF MY VEHICLE, ALONG WITH A  PHOTO SHOT OF THE VIN PLATE AND PHOTO SHOT OF THE ODOMETER, WHICH I DID ON JUNE 12, 2018.  I DID THAT AS INSTRUCTED, BUT I NEVER HEARD BACK FROM HIM. I THEN RE-SENT THE EMAIL TO HIM ON JULY 3, 2018, BUT AS OF THIS DATE, I HAVE HEARD NOTHING MORE FROM FORD OR FROM THE FORD OR MURFREESBORO DEALERSHIP. THEREFORE I STILL HAVE THE DEFECTIVE AIRBAGS IN MY VEHICLE, WAITING FOR A CRASH TO OCCUR.  IT WOULD APPEAR THAT FORD WOULD WANT TO TAKE CARE OF THIS ASAP IN ORDER TO AVOID A CATASTROPHIC OCCURRENCE AND POSSIBLE SUIT, BUT NO, I HAVE HAD NO FURTHER RESPONSE AND NO INDICATION OF CONCERN ON THE PART OF FORD.",
        "vin": "3FAHP08109R"
    }
]