[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/24/2019",
        "dateOfIncident": "02/20/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182215,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-150",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED MY F150 SHIFTING STRANGE AT SOME POINTS RECENTLY(WITH IN THE LAST COUPLE MONTHS) THEN I WAS WATCHING THE NEWS AND SAW THAT THERE WAS A RECALL ISSUED ON 11-13 F150S. SO I CALLED MY LOCAL FORD DEALER AND THEY LOOKED UP MY VEHICLE TO SEE IF IT WAS AFFECTED BY THE RECALL. IT WAS PART OF THE RECALL SO THEY ASKED ME TO SET AN APPOINTMENT FOR IT TO BE FIXED. SO I DID, I LEFT IT WITH THEM FOR TWO DAYS ON THE SECOND DAY THEY CALLED TO TELL ME THEY CAN'T FIX IT BECAUSE FORD HASN'T DEVELOPED THE SOFTWARE TO FIX IT AND IT WON'T BE AVAILABLE UNTIL SOMETIME IN THE SECOND QUARTER OF THE YEAR. I ASKED THEM IF I WAS GOING TO GET A RENTAL UNTIL IT CAN BE FIXED DUE TO IT BEING A SAFETY CONCERN. I DRIVE MY 2 SMALL CHILDREN IN THIS VEHICLE DAILY. THEY TOLD ME NO AND THAT I WOULD NEED TO CALL FORD. SO I CALLED FORD AND AFTER MULTIPLE ATTEMPTS TO TRY AND SPEAK TO A MANAGER IN THEIR CUSTOMER RELATIONS DEPARTMENT I FINALLY GET A CALL FROM LENNY THE MANAGER WHO PROCESSED TO TELL ME THAT 'SAFETY IS NOT A JUSTIFIABLE REASON FOR THEM TO ISSUE ME A RENTAL' SO I ASKED HIM WHAT HAPPENS WHEN MYSELF OR MY CHILDREN GET HURT OR KILLED DUE TO THE NATURE OF THE RECALL BEING THAT MY TRUCK CAN SUDDENLY DOWNSHIFT TO FIRST GEAR AS I'M GOING DOWN THE HIGHWAY. HE DID NOT HAVE ANY ANSWER FOR THAT AND TOLD ME THERE'S NOTHING HE CAN DO. SO I THEN ASKED TO TALK TO SOMEONE ABOVE HIM. HE SAID THERE WASN'T ANYONE ABOVE HIM. I'M VERY CONCERNED ABOUT DRIVING THIS TRUCK ESPECIALLY WITH MY CHILDREN IN IT IF IT CAN DOWNSHIFT TO FIRST GEAR AT ANYTIME. THAT CAN CAUSE A BIG PROBLEM AND HURT OR KILL ANYONE IN MY TRUCK AND OTHERS ON THE ROADWAYS. THIS IS A BIG SAFETY ISSUE BECAUSE IT'S PUTTING MOTORISTS AT POSSIBLE RISK EVERY TIME ONE OF THESE AFFECTED VEHICLES IS DRIVING DOWN THE ROAD. AND THEY DON'T HAVE ANY WAY TO FIX THE PROBLEM YET.",
        "vin": "1FTFW1CT2DK"
    }
]