[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/26/2021",
        "dateOfIncident": "06/15/2021",
        "fire": false,
        "manufacturer": "Entegra Coach",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426515,
        "products": [
            {
                "manufacturer": "Entegra Coach",
                "productMake": "ENTEGRA",
                "productModel": "ANTHEM",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The DEF head unit failed on our Anthem and left us stranded on the road.  These DEF heads are failing on diesel motorhomes across the country putting consumers in often dangerous situations along the nations highways.  Shaw Industries is the sole provider for Spartan Chassis emission systems.  We like many we had to wait weeks to get a new one.  We had to buy a 5th generation DEF head and these are the ones that fail the most. The 7th generation which supposedly is the only reliable DEF head won’t work on our 2016 Anthem.  Now we run the risk of another failure and being stranded possibly 1000’s of miles from home.  Shaw Industries and Spartan have no accountability or legal reason to be held financially liable since RV’s don’t fall under the automobile industries US code compliance.  The EPA and NHSTA needs to get this issue resolved ASAP.  My 45 ft motor coach is a very large truck in which I pay ridiculous license fees to keep it on the road.  This DEF head supplier has got to be held to the same reliability standards as the auto industry.  If not then you should demand a recall on these units at Shaw Industries cost for replacement or reimbursement to owners who spent upwards of $1000+ to fix this issue.  Please address this issue so diesel vehicle owners can enjoy the same protections we do for our gas vehicles.  Thank you , Mike Arnold",
        "vin": "4vzbu1d9xgc"
    }
]