[
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "07/06/2017",
        "dateOfIncident": "07/05/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003478,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "PACIFICA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAS 950 MILES ON IT, A ROTATORY GEAR SHIFT KNOW, AND AN ELECTRONIC PARKING BRAKE. AT HOME I PARK THE VEHICLE ON A LEVEL SURFACE. I DO NOT ENGAGE THE PARKING BRAKE WHEN I LEAVE THE VEHICLE. ON QUITE A FEW OCCASIONS WHEN I ENTER THE VEHICLE AND TURN ON THE ENGINE, THE PARKING-BRAKE LIGHT COMES ON AND THE BRAKE IS ENGAGED EVEN THOUGH I DID NOT SET IT.  FOR MOST OCCURRENCES, I CAN PRESS THE PARKING BRAKE BUTTON, AND THE LIGHT WILL GO OFF AND THE BRAKE WILL DISENGAGE.  HOWEVER, ON SOME OCCASIONS, PRESSING THE BRAKE BUTTON GIVES NO RESPONSE.  IF I TURN THE ENGINE OFF AND THEN BACK ON, THE BRAKE THEN DISENGAGES. A FEW TIMES I HAVE HAD TO TURN THE ENGINE ON AND OFF MORE THAN ONE TIME TO GET THE BRAKE DISENGAGED.  A MORE SERIES PROBLEM WITH THE PARKING BRAKE IS THAT ON SEVERAL OCCASIONS THE BRAKE HAS SUDDENLY COME ON WHILE I AM DRIVING. THIS HAS OCCURRED WHEN I HAVE STARTED THE ENGINE AND DRIVEN ABOUT 100 FEET.  IT HAS OCCURRED WHEN I AM MOVING FORWARD AND WHEN I AM BACKING UP.  THE BRAKE SUDDENLY ENGAGES AND BRINGS THE VEHICLE TO AN ABRUPT HALT. ON THESE OCCASIONS PRESSING THE BRAKE BUTTON GAVE NO RESPONSE. I HAD TO TURN THE ENGINE OFF AND BACK ON.  7/5 I STOPPED AT A PHARMACY DRIVE-UP WINDOW, AND PUT THE VEHICLE INTO PARK.  AFTER MY TRANSACTION, I ROTATED THE GEAR KNOB TO DRIVE, AND THE PARKING BRAKE LIGHT THEN WENT ON.  I PRESSED THE BRAKE BUTTON MULTIPLE TIMES, AND THE LIGHT WOULD NOT GO OUT.  I THEN TURNED THE ENGINE OFF AND BACK ON.  (TO DO THIS I HAD TO HAVE PRESSURE ON THE BRAKE PEDAL.)  WHEN I TURNED THE ENGINE BACK ON THE VEHICLE TOOK OFF AT SIGNIFICANT SPEED, AND I CRASHED INTO A STREET LIGHT POLE. WHEN A TOW TRUCK CAME TO GET THE VEHICLE THE TRUCK OPERATOR FOUND THAT THE VEHICLE GEAR KNOB WAS IN THE PARK GEAR. HE HAD A GOOD DEAL OF DIFFICULTY IN GETTING THE VEHICLE INTO NEUTRAL GEAR FOR THE TOWING PROCESS. HAVE PICTURES UPON REQUEST. .....UPDATED 11/03/17 *BF ..UPDATED 11/13/2017*JS     ...UPDATED 11/17/17 *BF  *JS  *TR",
        "vin": "2C4RC1EG2HR"
    }
]