[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/02/2017",
        "dateOfIncident": "06/28/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002702,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2012 JEEP WRANGLER UNLIMITED WITH 26000 MILES. IT HAS NEVER BEEN OFF ROAD OR DAMAGED. IT RECENTLY STARTED STALLING. IT HAS BEEN TO THE DEALERSHIP 3 TIMES FOR THIS PROBLEM. INITIALLY NONE OF THE DIAGNOSTICS FOUND ANYTHING AND THEY GAVE IT BACK. IT CONTINUED TO STALL WHILE STOPPED AND STALLED, TEMPORARILY, ON THE METRO TRAIN TRACKS. I TOOK IT BACK TO THE DEALERSHIP AND THEY AGAIN COULD NOT FIND ANYTHING WRONG-BASED ON MY READING I SUGGESTED IT MIGHT BE THE TIPM. THE DEALERSHIP DROVE IT AGAIN AND SAID IT DID STALL ON THE MECHANIC. SO THEY FIXED SOMETHING ($700) DEALING WITH THE POWER. I PICKED IT UP AND IT STALLED ON ME AGAIN ON THE NEXT DAY. I CALLED THE DEALERSHIP (RIVER OAKS JEEP IN HOUSTON) AND THEY DID NOT RETURN MY CALL. I HAVE ALSO SUBMITTED AN ONLINE REPORT. 2 DAYS AGO, THE JEEP AGAIN STALLED WHILE I WAS REVERSING OUT OF A DRIVEWAY. I PUT IT BACK INTO PARK FROM REVERSE AND RESTARTED IT. IT RESTARTED BUT WOULD NOT GO INTO GEAR. I THEN TURNED IT OFF AGAIN, RESTARTED AGAIN AND IT THEN WENT INTO GEAR AND ALLOWED ME TO GET OUT OF THE WAY OF ONCOMING CARS. THIS PATTERN OF STALLING, BEING UNABLE TO GO BACK INTO GEAR, REQUIRING TURNING IT OFF AND RESTARTING HAS BEEN RECURRENT AND HAS OCCURRED EXACTLY LIKE THAT ABOUT 8 TOTAL TIMES NOW. IT ADDITIONALLY WILL BE FULL OF GAS, GOING AT A CONSISTENT SPEED DOWN THE ROAD AND THE ENGINE JUST \"GIVES\" AND ALMOST FEELS LIKE IT PAUSES. WHEN IT'S IN MOTION, IT HASN'T ACTUALLY STALLED, ONLY WHEN IDLING OR IN REVERSE.. I FEEL LIKE AT THIS POINT THIS IS A MAJOR SAFETY CONCERN. THE VEHICLE IS NO LONGER UNDER WARRANTY JUST DUE TO THE YEARS SINCE PURCHASE BUT IS UNDER THE REQUIRED MILEAGE. I SEE ONLINE THAT JEEP/CHRYSLER HAS HAD MULTIPLE ISSUES WITH THE TIPM IN OTHER MODELS AND BELIEVE THAT THIS MAY BEE THE CAUSE OF THESE ELECTRICAL PROBLEMS",
        "vin": "1C4BJWDG5CL"
    }
]