[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/05/2017",
        "dateOfIncident": "06/29/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003013,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS PARKED IN DRIVIEWAY, PARTIALLY BLOCKING IN OTHER VEHICLES IN GARAGE, AND AUTOMATIC TRANSMISSION SHIFTER COULD NOT BE MOVED OUT OF PARK ON THE MORNING OF 6/29/17, STRANDING VEHICLE FROM BEING MOVED BY OWNER.  I THEN LOOKED ONLINE USING GOOGLE SEARCH AND FOUND PROBLEM LISTED UNDER CHRYSLER RECALL OF SOME 2005-2007 CHARGER/MAGNUM/300 MODELS, AND FOUND INSTRUCTIONS ON HOW TO TEMPORARILY INSERT SCREWDRIVER INTO SIDE OF  TRANSMISSION SHIFT LEVER ASSEMBLY BY REMOVING ONE PIECE OF TRIM, AND WAS ABLE TO THEN DRIVE OVER TO DARCARS CHRYSLER/JEEP/DODGE ROCKVILLE, MARYLAND DEALERSHIP TO DROP FOR RECALL REPAIR.  I LEFT VEHICLE AND THEN WAS TOLD BY SERVICE DEPT STAFF NEXT DAY ON 6/30/17 THAT MY VIN NUMBER WAS NOT PART OF RECALL, AND WOULD COST ME $510 OUT OF POCKET TO REPLACE THE ENTIRE TRANSMISSION SHIFTER ASSEMBLY RATHER THAN REPLACE THE SMALL CHEAP PLASTIC KNOWN CHRYSLER DEFECT THAT HAS PROBABLY ALREADY HAPPENED TO THOUSANDS OF CHARGERS/MAGNUMS/300S.  LUCKY FOR ME THIS DID NOT HAPPEN IN AN EMERGENCY SITUAITON WHERE I NEEDED TO MOVE MY CAR IMMEDIATELY TO GO TO HOSPITAL, OR AVOID A FLASH FLLOOD, HURRICANE, OR TORNADO OR THE PROBLEM COULD HAVE RESULTED IN A TOTAL LOSS OF THE VEHICLE AND POSSIBLE INJURY OR LOSS OF LIFE.  IN ADDITION, I DID MORE RESEARCH AND FOUND THE $16 PART ONLINE NEEDED TO FIX THE PROBLEM, ALONG WITH MANY VIDEOS ON HOW TO FIX IT YOURSELF, AND ORDERED IT ON 6/30/17 AND HAD THE CAR REPAIRED MYSELF AT HOME ON 7/2/17 A FEW HOURS AFTER RECEIVING THE PART IN THE MAIL.   CHRYSLER SHOULD MAKE THIS A RECALL FOR ALL AFFECTRED VEHICLES BECAUSE THE COST TO REPAIR IT IN PARTS AND LABOR IS VERY CHEAP, SINCE I ESTIMATE THEY COULD DO THE SAME JOB IN ABOUT 30 MINUTES AND THE PART WOULD ONLY COST THEM MAYBE UNDER $5.  SEE ATTACHED RECALL AND $16 PART COST WHEN ORDERED ON AMAZON.",
        "vin": "2B3LA53H76H"
    }
]