[
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/06/2017",
        "dateOfIncident": "07/06/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003495,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "4 JULY 2017, WHILE DRIVING AT HIGHWAY SPEEDS, VEHICLE FAULT INDICATORS SHOWING PROBLEM WITH STABILITY CONTROL SYSTEM, ABS SYSTEM, AND DISABLED CRUISE CONTROL.  FAULTS CLEARED APPROXIMATELY 30 SECONDS LATER.  5 JULY 2017, VEHICLE AGAIN DISPLAYED SAME FAULTS, HOWEVER, FAULTS REMAINED LATCHED (DID NOT SELF CLEAR).  I CONTACTED LOCAL DEALERSHIP FOR SERVICE, FAULT WAS DIAGNOSED ON 6 JULY 2017 AS A FAILED RIGHT FRONT WHEEL SPEED SENSOR.  SERVICE DEPARTMENT PLACED NEEDED PART ON ORDER, RETURNED KEYS TO ME AND ARRANGEMENTS WERE MADE TO BRING VEHICLE BACK TO DEALERSHIP FOR REPAIR ON 7 JULY 2017.  WHILE CONTINUING ON TO PLACE OF WORK, FAULTS RETURNED, THEN CLEARED.  AT THE END OF DAY, 6 JULY, WAS APPROACHING A STOP SIGN AT NORMAL APPROACH SPEEDS AND APPLIED BRAKES.  FRONT BRAKES INITIALLY OPERATED AS NORMAL, THEN WITHIN A SECOND OR SO, LOST BRAKE PRESSURE...I FELT THE ABS SYSTEM RELEASE THE BRAKES, CAUSING ME TO EXERT ENORMOUS PRESSURE ON THE BRAKE PEDAL WITHIN A FEW FEET OF THE STOP SIGN TO GET THE VEHICLE STOPPED FROM ONLY A FEW MPH.  ONCOMING TRAFFIC WAS 55 MPH. AFTER THE VEHICLE STOPPED (BARELY)..THEN THE SAME FAULTS APPEARED.  FROM MY POINT OF VIEW, THE INTERMITTENT WHEEL SPEED SENSOR CAUSED THE FRONT ABS SYSTEM TO ACTIVATE ON A DRY ROAD, ESSENTIALLY DISABLING MY FRONT BRAKES WHILE IN THE PROCESS OF BRAKING.  THIS IS NOT AN EXPECTED FAILURE MODE. I UNDERSTAND ONBOARD DIAGNOSTICS INDICATING THE PROBLEMS ABOVE, HOWEVER, IT APPEARS THAT IF THIS PROBLEM TAKES PLACE WHILE BRAKING, BRAKE PERFORMANCE IS COMPROMISED.  THIS IS NOW THE SECOND WHEEL SPEED SENSOR TO BE REPLACED IN THE LAST 6 MONTHS OR SO.  FROM MY PERSPECTIVE, THAT MEANS THAT THIS IS A HIGH FAILURE RATE ITEM (LAST ONE WAS ON THE RIGHT REAR WHEEL), AND IF IT HAPPENS WHILE BRAKING...I ESSENTIALLY LOSE BRAKING AT THE PRECISE MOMENT BRAKES ARE NEEDED.  I CONSIDER THIS A DESIGN ISSUE. REDUNDANT SENSORS RECOMMENDED FOR ABS.",
        "vin": "2C3CDZBG8FH"
    }
]