[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/21/2017",
        "dateOfIncident": "03/16/2017",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000373,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER SPORT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "A THIRD OF THE TIME, UPON ENTERING THE VEHICLE, THE DASH BEEPS AND DISPLAYS \"GEAR SHIFTER NOT IN PARK.\", THE AEB, NOW DISABLED, DISPLAYED ON THE DASH AT INAPPROPRIATE TIMES WHILE DRIVING, AND WHILE ATTEMPTING TO PARK THE CAR ONCE OUT OF D, THE GEAR SHIFT WOULD NOT GO INTO P, R, N OR BACK IN TO D. THE DASH MESSAGE INSTRUCTED ME TO SELECT A GEAR, BUT I COULD NOT. THE CAR HAD TO BE TURNED OFF AND RESTARTED.    AFTER THE FIRST REPAIR ATTEMPT, I CONTACTED A LR SALESPERSON LIVING IN ANOTHER CITY. HE TOLD ME, IN CONFIDENCE, THAT SOME OF THE RR SPORTS AT HIS DEALERSHIP EXPERIENCE THESE SAME PROBLEMS. HE SAID: THE ISSUE RUNS DEEPER THAN I HAVE EXPERIENCED, IS COMPLEX AND COULD TAKE MONTHS, MAYBE A YEAR, TO REPAIR, AND CONFIRMED IT IS A SAFETY ISSUE. HE ADVISED ME NOT TO DRIVE MY CAR.     AFTER CONTACTING LRNA, THEY TOLD ME THAT THIS PROBLEM IS \"UNDER INVESTIGATION\" AND THEY DON'T \"BELIEVE\" IT TO BE A \"SUBSTANTIAL SAFETY ISSUE.\" I DISAGREE. SINCE THEN, ON TWO OCCASIONS, LRNA TOLD MY CASE ADVISER AT THE DMV A FIX IS COMING. THE FIRST HAS COME AND GONE, THE SECOND IS DUE NEXT WEEK.     MY DEALERSHIP IS DISINTERESTED AND TREATS ME AS IF I AM THE ONLY OWNER OF A 2017 RR SPORT EXPERIENCING THESE ISSUES. EVEN THOUGH, I MET THE OWNER OF A 7 DAY OLD 2017 RR SPORT IN THE SERVICE WAIT AREA, WHOSE CAR WOULD NOT START THAT MORNING. UPON CONVERSATION SHE TOLD ME HER CAR DISPLAYED THE SAME WARNINGS AS MINE. OUR VISIT WAS ABRUPTLY INTERRUPTED WHEN THE DEALERSHIP'S GM APPROACHED US AND ASKED IF HE COULD PERSONALLY DRIVE HER HOME INSTEAD OF HER HAVING TO WAIT. ALTHOUGH WE WERE INTERRUPTED, IT IS EASY TO FIND THESE PROBLEMS ARE RAMPANT AS LR FORUMS CONFIRM.    THREE MONTHS AFTER PURCHASING MY NEW CAR WHICH STILL SITS IN SERVICE, AND HAS BEEN IN SERVICE OVER HALF OF THE OWNERSHIP DURATION, THERE ARE ONLY PROMISES OF A REPAIR ON THE WAY AND NO DEFINITIVE STATEMENT ON THE SAFETY OF MY VEHICLE.",
        "vin": "SALWG2FV0HA"
    }
]