[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/07/2017",
        "dateOfIncident": "05/16/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003635,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING TO WORK AT 547 AM ON COGAN IN PALM BAY, FL WHEN I HEARD A LOUD BANG, IT WAS DARK OUT NO RAIN AND I IMMEDIATELY ATTEMPTED TO PULL OVER AND MY ENTIRE SIDE CURTAIN AIRBAGS AND PASSENGER SEAT AIRBAGS DEPLOYED ON THEIR OWN WITHOUT HITTING ANYTHING OR ANY SORT OF IMPACT. A POLICE OFFICER LUCKILY APPROACHED THE SEEN BEHIND ME AND I DO HAVE A CALL FOR SERVICE REPORT FROM PALM BAY POLICE DEPARTMENT STATING AIRBAGS DEPLOYED FOR UNKNOWN REASON. I IMMEDIATELY CALLED NISSAN DEALERSHIP IN MELBOURNE TO REPORT THIS AND THEY HAD MY VEHICLE TOWED TO THE DEALERSHIP. INITIALLY THE DEALERSHIP WAS VERY ACCUSATORY TRYING TO TELL ME THIS HAD NEVER HAPPENED BEFORE MAKING ME FEEL I HAD DONE SOMETHING WHEN INDEED I HAD NOT. A THIRD PARTY INVESTIGATOR WAS CALLED TO ASSESS THE BLACK BOX WHICH INDEED REVEALED THERE WAS NO IMPACT AND THERE WAS A FAULTY AIRBAG SYSTEM. AFTER A WEEK AND A HALF WITH NO FINAL ANSWER I FINALLY WAS CALLED THAT NISSAN WOULD COVER THE DAMAGES UNDER THE WARRANTY. THEY DID NOT ACCOMMODATE ME WITH AN EQUIVALENT VEHICLE I WAS DRIVING INSTEAD GAVE ME A NISSAN VERSA STANDARD. THE REPAIRS TOOK APPROX A MONTH AND A HALF. THE NOW HAVE OFFERED A SETTLEMENT OF 2500 TO RELEASE THEM FROM ANY FUTURE LIABILITY WHICH I HAVE NOT SUBMITTED BACK TO THEM AND I AM IN THE PROCESS OF WORKING WITH THE ATTORNEY GENERALS OFFICE FOR A LEMON LAW CLAIM. MY SAFETY WAS COMPROMISED AND REGARDLESS OF HOW MANY REPAIRS DONE IT STILL BECAME A VERY TRAUMATIC EXPERIENCE TO GO THROW. HAD I BEEN ON THE HIGHWAY I COULD HAVE DIED DUE TO THE AIRBAGS DEPLOYING AND IMPEDING MY VISIBILITY. THIS NEEDS TO BE FURTHER INVESTIGATED FOR THE SAFETY OF OTHERS...UPDATED 07/13/17 *BF  *CN *TT  CONSUMER STATED IN THE INCIDENT REPORT: DRIVING TO WORK ON SMOOTH PAVED ROAD WHEN RIGHT SIDE CURTAIN AND SEAT AIRBAGS DEPLOYED. PULLED TO THE RIGHT, CLIMBED OVER CURB WITH TWO RIGHT WHEELS OVER SIDEWALK AND LEFT WHEEL OVER ROAD PAVEMENT. UPDATED 10/1/18*JB",
        "vin": "5N1AT2MT5HC"
    }
]