[
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/07/2017",
        "dateOfIncident": "07/03/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003710,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  AS I WAS DRIVING ON THE HIGHWAY, MY CAR STOPPED ON ME DURING TRAFFIC FLOW. THIS HAS HAPPENED MORE THAN FIVE TIMES AND I WAS ALMOST KILLED WITH MY SMALL CHILDREN IN THE VEHICLE. WE HAVE BEEN SUFFERING WITH THIS ISSUE FOR OVER A WHOLE YEAR. ON JULY 3,2017 MY MOTHER AND I WAS COMING HOME ON THE FWY AND ONCE AGAIN, DURING TRAFFIC FLOW, MY CAR SHUT OFF WHILE DRIVING ON THE ROAD. LUCKILY, I WAS ABLE TO PULL OVER TO GET A SAFE SPOT BEFORE I CRASHED BECAUSE THERE WERE SO MANY CARS COMING BEHIND ME SO FAST AND THE SIDE RAMPS WE'RE VERY NARROW. I HAVE TAKEN IT IN FOR SERVICING BUT FOR SOME REASON, THEY ARE NOT ABLE TO FIND OUT WHAT THE PROBLEM IS. I HAVE TAKING IT IN AND EVEN LEFT WITH THEM FOR ALMOST A WHOLE MONTH AT ONE TIME AND STILL NO DIAGNOSIS. RENTAL CAR AFTER RENTAL CAR. THEY INSTALLED A DATA RECORDER IN MY CAR AND THE FIRST TIME THEY FOUND NO DATA, THEN THEY INSTALLED IT AGAIN FOR ANOTHER WEEK AND THEY CLAIM THAT IT WAS THE FUEL PUMP RELAY. SO THEY INSTALLED A NEW FUEL PUMP RELAY IN MY CAR. A FEW WEEKS LATER MY CAR SHUT DOWN AGAIN ON THE WAY COMING HOME AND IN THE FREEWAY WITH MY MOTHER AND 2 YEAR NEICE. WE WE'RE ALMOST KILLED. THE CAR JUST SHUTS OFF WHILE DRIVING AND SAYS \"GOODBYE\" WITH NO WARNING WHILE DRIVING THIS IS HOW I KNOW THAT THIS HAS SOMETHING TO DO WITH THE ENGINE. PLEASE HELP IF YOU CAN. I DO NOT FEEL SAFE IN THIS CAR AND WE ARE IN DANGER. SOMETIMES THE LIGHTS IN THE CAR CUT ON AND OFF TOO.",
        "vin": "KNAGM4A78F5"
    }
]