[
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/18/2020",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309915,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS TOYOTA BRAND NEW IN LATE 2007 AND IT WAS DELIVERED IN EARLY 2008. IT WAS MODIFIED BY BRAUNABILITY TO BE WHEELCHAIR ACCESSIBLE. THIS MEANS THE ORIGINAL FLOOR WAS CUT OUT AND A NEW SUB-FLOOR WAS WELDED IN ITS PLACE TO ACCOMMODATE THE WHEELCHAIR.   I NOTICED A LOT OF PREMATURE RUST ON THE EXTERIOR MODIFIED SUB-FLOOR IN 2016 I CONTACTED BRAUNABILITY WITH MY CONCERNS ONLY TO BE DISMISSED BY THEM BECAUSE THEY CLAIMED THE VAN WAS OUT OF WARRANTY. I WAS PROACTIVE AND TOOK THE VAN TO A LOCAL BRAUNABILITY DEALER WHERE THE VAN WAS ORIGINALLY PURCHASED TO SANDBLAST THE EXTERIOR UNDERSIDE AND REPAIR EXTENSIVE RUST DAMAGE AND UNDERCOATED THE REPAIRS. THIS WAS DONE AT MY EXPENSE AND I PAID APPROXIMATELY $7K DOLLARS.   WELL RECENTLY I HAD TO MAKE A REPAIR ON THE INTERIOR OF THE VAN ONLY TO DISCOVER THE FLOOR IN THE INSIDE WAS ALSO ROTTING AWAY DUE TO RUST. THIS RUST IS ONLY OCCURRING ON THE METAL THAT BRAUNABILITY USED IN THEIR MODIFICATIONS. I CONTACTED BRAUNABILITY AGAIN TO RAISE MY CONCERNS ONLY TO BE DISMISSED AGAIN. THEY STUCK TO THEIR OUT OF WARRANTY ARGUMENT. THIS VAN HAS BEEN MAINTAIN IN A NEAR NEW CONDITION AND ALL THE ORIGINAL TOYOTA PARTS ARE IN NEAR NEW APPEARANCE BUT THE RUST IS ONLY ON BRAUNABILITY METAL.  I ALSO KNOW OF 2 OTHER CUSTOMERS WHO DEALT WITH SIMILAR RUST ISSUE AND HAD TO TOTAL THEIR VANS DUE TO DAMAGE BEYOND REPAIR AND THEIR VANS WERE STILL OPERATIONAL ASIDE FROM RUST DAMAGE.   THIS RUST WAS CAUGHT BY ME BECAUSE I AM VERY PARTICULAR ABOUT MAINTENANCE OF MY VAN AND KNOW RUST IS CANCER TO CARS. I NEVER EXPECTED THE RUST TO BE IN THE INTERIOR AS WELL ON A 10 YEAR OLD VAN WITH ONLY 105K MILES. THIS WOULD NOT BE AN ISSUE IF BRAUNABILITY HAD TAKEN RESPONSIBILITY FOR THE INADEQUATE METAL WORK. I PAID 40 THOUSAND DOLLARS FOR THESE MODIFICATION TO MY 07 TOYOTA SIENNA. THEY SHOULD NOT BE ROTTING. THIS IS A SERIOUS SAFETY ISSUE IF LEFT UNCHECKED.",
        "vin": "5TDZK22C67S"
    }
]