[
    {
        "components": "STEERING,AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/05/2017",
        "dateOfIncident": "07/04/2017",
        "fire": false,
        "manufacturer": "Mercedes-Benz USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002991,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC",
                "productMake": "MERCEDES BENZ",
                "productModel": "C300",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "DEAR MERCEDES BENZ USA,        FIRST AND FOREMOST I WOULD LIKE TO SAY I AM A PROUD DRIVER OF A 2009 MERCEDES BENZ C300, I AM EMAILING YOU REGARDING SOME CONCERNS WITH MERCEDES BENZ VEHICLES AND RECALLS. I HAVE A RECALL ON AIRBAGS FOR MY MERCEDES I'VE BEEN PATIENTLY WAITING (IM SURE LIKE MANY OTHERS) TO RECEIVE A LETTER TO GET MY AIRBAGS INSTALLED INTO MY VEHICLE.. A VEHICLE THAT CURRENTLY DO NOT HAVE ANY AIRBAGS IN IT I AM CONCERNED WITH MY SAFETY AT THIS POINT AND WOULD LIKE TO KNOW IF YOU CAN OFFER ME AN UPDATED ON THE DURATION. ALSO, THERE IS A COMMON ISSUE OCCURRING WITH ALL CLASS MERCEDES THAT I FEEL SHOULD ALSO HAVE A RECALL I HAVE READ NUMEROUS OF ONLINE POSTS REGARDING THIS SAME EXACT ISSUE AND THAT ISSUE IS THE FAULTY STEERING LOCK/ELS/EIS FAULT THAT DOES NOT ALLOW MERCEDES BENZ HOLDERS TO SOMETIMES NOT BE ABLE TO LOCK AND UNLOCKED THEIR VEHICLES USING MERCEDES SMART KEY FOB AND ALSO NOT BEING ABLE TO START UP VEHICLES IT'S LITERALLY A NO RESPONSE LOSE/LOSE SITUATION CAUSING THE VEHICLE OWNER TO GET THEIR VEHICLES TOWED TO DEALERSHIPS THAT CHARGES $1000-$3000 TO REPAIR WHICH IS A BIT PRICEY FOR A COMMON ISSUE WITH MERCEDES VEHICLES I THINK I SPEAK FOR MAJORITY OF MERCEDES OWNERS ON THIS MATTER. I ASK FOR A RECALL OR PRICE REDUCTION ON THIS COMMON ISSUE.            SINCERELY,  [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WDDGF54X09R"
    }
]