[
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/20/2019",
        "dateOfIncident": "03/16/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190215,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "RECURRENT PROBLEM. STARTED WHEN VEHICLE WAS 2 MONTHS OLD. TAKEN CAR TO DEALER SERVICE DEPARTMENT. NO SOLUTION.   WHEN IN MOTION (HIGHWAYS, CITY ROADS) SPEAKERS MAKE A SPARKLING SOUND FOLLOWED BY THE ENTERTAINMENT SCREEN ( NAVIGATION, HANDHELD PHONE, REAR VISION...) AND THE ODOMETER SCREEN (SPEED DISPLAY, ALL THE SIGNALS) BECAME DEAD. IT COULD LAST FEW SECONDS AND REBOOT BACK OR UP TO 30 MINUTES. IN A 15 MILE JOURNEY , COULD HAPPEN AROUND 15 TIMES. SO THE DANGEROUS SITUATION IS THAT I AM DRIVING WITH NO IDEA HOW MUCH SPEED I AM GOING, I AM NOT ABLE TO USE MY HANDHELD PHONE  (ALSO VERY IMPORTANT TO ME AS A BUSY DOCTOR TRYING TO ANSWER EMERGENCY CALLS), NO NAVIGATION SYSTEM AVAILABLE, THE REAR VISION CAMERA BECOMES USELESS WITH A BLANK SCREEN...  I LEARNT FROM THE INTERNET THAT THIS IS AN ONGOING PROBLEM AND NO SOLUTION HAVE BEEN FOUND.  PROBLEM HAPPENS IN MOTION AND ALSO OR WHEN CAR IS PARKED.  MY CAR IS 4 MONTHS OLD AND HAS SPENT SEVERAL DAYS AT THE DEALER SERVICE DEPARTMENT AND AT THE LAST VISIT I WAS GIVEN A REPORT IN WHICH STATES THAT HONDA IS STUDYING A NEW SOFTWARE UPDATE. I DON'T WANT RISK MY FAMILY OR OTHERS LIFE'S SO WAITING IS NOT AN OPTION.  THIS IS NOT JUST ONE INCIDENT , IT KEEPS RECURRING   WE BOUGHT THE CAR BRAND NEW FROM THE HONDA DEALER IN NOVEMBER 2018.  I HAVE VIDEOS TO PROVIDE PROOF (CAN NOT ATTACH THEM)",
        "vin": "5FNYF6H09KB"
    }
]