[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/14/2017",
        "dateOfIncident": "05/30/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005220,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "C-MAX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 FORD CMAX ENERGI - 70,300 MILES PURCHASED NEW NOV. 2014.  WAS DRIVING SWITCH BACKS DOWN HILL WITH MY CAR IN LOW.  I HEARD A NOISE AND SUDDENLY THE CAR SLIPPED  OUT OF GEAR IN NEUTRAL. I BRAKED TO A STOP.  PUT IT IN PARK AND BACK TO DRIVE AND IT SEEMED FINE.  A WEEK AND A LATER, IT DID IT AGAIN IN THE SAME DOWN HILL PLACE ON THE SWITCH BACKS.  I REALLY TAKES OFF WHEN IT UNEXPECTEDLY SLIPS OUT OF GEAR.  I TOOK IT TO THE FORD AGENCY THE NEXT DAY TO HAVE IT CHECKED.  THEY KEPT IT 42 DAYS (INCLUDING SUNDAYS) BUT NEVER FOUND THE CAUSE.  THEY TOLD ME TO TAKE THE CAR AND COME BACK IF IT DID IT AGAIN.  THEY COULD NOT SEEM TO GET THE TRANSMISSION TO SLIP THEREFORE THERE WAS NO PROBLEM.  TODAY, JULY 12, 2017 THE AGENCY CALLED AND ASKED ME TO PAY 0VER $900.00 FOR THE RENTAL CARS.  I TOLD THEM NO.  I CALLED THE AGENCY WEEKLY TO CHECK ON THEIR PROGRESS AND EACH TIME WAS TOLD THEY DIDN'T HAVE AN ANSWER OR THEY COULDN'T GET IT TO SLIP.  THE SLIPPING EXPERIENCE WAS VERY UNNERVING...THOSE FEW SECONDS FEELING YOU'RE OUT OF CONTROL FELT LIKE MINUTES.   I LOVE MY CAR AND JUST WANT A GUARANTEE IT WON'T DO IT AGAIN.  I'M NOT SURE HOW MANY OF THIS MAKE, MODEL AND YEAR HAVE 0VER 70,000 MILES THUS, COULD THIS BE A FACTOR IN THE TRANSMISSION PROBLEM WITH MY CAR THAT HASN'T SHOWN UP IN A LIKE CAR WITH LESS MILEAGE.   I DID TAKE OUT EVERY EXTENDED WARRANTY ON THE CAR AT THE TIME OF PURCHASE.   THE VEHICLE WAS DEFINITELY IN MOTION WHEN THE PROBLEM OCCURRED ON A 2 LANE ROAD.",
        "vin": "1FADP5CU8EL"
    }
]