[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/08/2018",
        "dateOfIncident": "11/17/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11071815,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "FAULTY THETA II ENGINE. DRIVING ON THE FREEWAY,HEARD KNOCKING NOISE IN THE ENGINE. TOOK THE CAR DIRECTLY TO THE DEALER, SERVICE ADVISOR HEARD THE SAME NOISE,SAID THE CAR WAS UNSAFE TO DRIVE. HE SAID SOME OF THEIR ENGINES HAVE THIS KNOWN PROBLEM & HE'D CHECK FOR A RECALL. SAID MINE WAS NOT RECALLED, I'D HAVE TO PAY FOR A NEW ENGINE. HE SENT THE CAR BACK TO THE MECHANIC WHO PUT IT ON A LIFT,HEARD THE NOISE,BROUGHT IT RIGHT BACK DOWN, AGREEING IT WAS THE KNOWN PROBLEM. THE SA SAID HE WOULD SUBMIT A REQUEST TO CORPORATE TO PAY FOR THE ENGINE. THE FACT THAT HE RECOGNIZED THE PROBLEM IMMEDIATELY AND KNEW TO DO A CORP. APPROVAL REQUEST TO PAY TO REPLACE THE ENGINE PROVES HE KNEW IT WAS A FAULTY ENGINE & HMA SHOULD PAY FOR IT. I RENTED A CAR TO DRIVE THE 2 HOURS HOME.MY CAR HAS BEEN THERE 10 WEEKS. HMA DENIED MY CLAIM 3 TIMES (ONCE AFTER THE DEALER ESCALATED THROUGH HIS DISTRICT MANAGER).  AFTER MUCH RESEARCH I REALIZED THIS ENGINE HAS BEEN RECALLED FOR MILLIONS OF CARS - HYUNDAI & KIA, DIFFERENT MODELS, DIFFERENT YEARS. MINE IS NOT RECALLED - YET. THE ENGINE WAS MANUFACTURED SO THAT SHAVINGS DROP ON TO THE ENGINE AND EVENTUALLY CAUSE THE FAILURE (IT IS MUCH MORE DETAILED & TECHNICAL THAT THAT). IF I HAD CONTINUED DRIVING, THE RESULT WOULD HAVE BEEN THE ENGINE SEIZING WHILE DRIVING OR THROWING A ROD OUT OF THE ENGINE WHILE DRIVING. HYUNDAI HAS THIS ENGINE ON THE ROAD RIGHT NOW IN MILLIONS OF CARS, IT IS EXTREMELY DANGEROUS , THEY REFUSE TO TAKE RESPONSIBILITY (EXCEPT IN THE LAWSUIT THEY LOST). THEY ARE UNDER NHTSA  INVESTIGATION FOR THE DELAYED RECALLS. THE OTHER 2 EXCUSES GIVEN TO ME BY HMA WERE: MY CAR IS 1K MI OUT OF WARRANTY & I DID NOT BUY IT FROM A HYUNDAI DEALER. ALL 3 REASONS (NO RECALL BEING THE FIRST) ARE COMPLETELY INVALID. THEY MANUFACTURED A FAULTY ENGINE. WHEN THE DEFECT APPEARS, WHERE THE CAR WAS PURCHASED AND WHETHER IT IS RECALLED YET, ARE NOT VALID EXCUSES.",
        "vin": "5XYZGDAB7CG"
    }
]