[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/10/2017",
        "dateOfIncident": "07/09/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004127,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ALTERNATOR ON OUR JEEP HAD THE SAME ISSUE AS THE P60 RECALL FOR THIS MODEL YEAR AND ENGINE EQUIPPED WITH THE 160 AMP ALTERNATOR. OUR VEHICLE HAS THE 180 AMP ALTERNATOR AND IS NOT COVERED. MY QUESTION/COMPLAINT IS THAT IF THE CHRYSLER WARRANTY REP TOLD ME THAT SHE IS SEEING THIS ISSUE MORE AND MORE THAN WHY ISN'T THE 180 AMP ALTERNATOR COVERED UNDER THE WARRANTY ALSO.  THE CAR WAS RUNNING PERFECTLY FINE AND INSTANTLY STARTED SQUEALING VERY LOUDLY AND WE COULD SMELL THE ELECTRICAL ISSUE WE ARE UNSURE OF A FIRE ISSUE BUT IT LOOKED LIKE THE ALTERNATOR COULD HAVE STARTED SOMETHING ELSE..LUCKILY WE WERE ABLE TO PULL THE VEHICLE OVER AND WHEN I LIFTED THE HOOD THE ALTERNATOR WAS POURING OUT SMOKE AND HAD SOOT AROUND THE COOLING FINS. WE RETURNED TO THE VEHICLE 3 HOURS LATER AND WE COULD STILL SMELL THE BURNT WIRE SMELL. OUR DEALER TRIED TO JUMP START USING A POWER PACK AND IT INSTANTLY DRAINED TWO POWER PACKS THAT CAN JUMP SEAMS FROM A DEAD BATTERY.  OUR VEHICLE HAD TO BE TOWED TO THE DEALER. NOW WE ARE WAITING TO FIND OUT WHAT OUR CHARGED WILL BE.  AS I SAID EARLIER, THE CHRYSLER WARRANTY REP SAID THAT THIS IS BEING REPORTED MORE AND MORE AND SHE ADVISED ME TO FILE A COMPLAINT HOPING THAT A RECALL WILL BE STARTED DUE TO THE NUMBER OF COMPLAINTS THEY ARE SEEING.  IS THERE ANYTHING I CAN DO IN THE MEANTIME WHILE I SPEND 500$ ON A TOW AND A ALTERNATOR?  THANK YOU [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).?*JB",
        "vin": ""
    }
]