[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/06/2017",
        "dateOfIncident": "07/02/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003277,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FUSION",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM A LIEUTENANT ON THE SAINT JOHN FIRE DEPARTMENT IN SAINT JOHN, INDIANA. MY DAUGHTER DRIVES THE 2012 FORD FUSION SE. SHE WAS ON A TRIP IN TEXAS WHEN THIS STEERING FAILURE ACCURED. SHE WAS LUCKY ENOUGH TO BE ABLE TO STEER IT INTO A SAFE PARKING AREA WHEN THIS HAPPENED. SHE WAS 100 MILES FROM HOME WHEN SHE CALLED ME TO TELL ME OF THIS PROBLEM. I RESEARCHED THIS ISSUE ON-LINE AND THAT IS WHEN I DISCOVERED THE ELECTRONIC POWER STEERING FAILURE RECALL # 15S18. EVIDENTLY, THIS HAS EFFECTED OVER 500,000 VEHICLES. BEING IN THE FIRE BUSINESS I AM THANKFUL THAT NOTHING HAPPENED TO MY DAUGHTER WHILE SHE WAS DRIVING THIS VEHICLE. THIS COULD HAVE BEEN A VERY SERIOUS ACCIDENT OR WORSE !! I ADVISED HER TO DRIVE THE VEHICLE BACK HOME AND TO THE NEAREST FORD DEALERSHIP INSTEAD OF GETTING IT TOWED FROM OVER 100 MILES AWAY IF SHE THOUGHT SHE COULD DRIVE IT SLOW AND SAFELY. SHE WAS INDEED ABLE TO DRIVE IT BACK HOME AND PARKED IT AT THE NEAREST FORD DEALERSHIP CLOSEST TO HER HOME. THE VEHICLE IS THERE RIGHT NOW AS I AM TYPING THIS COMPLAINT. I DO NOT HAVE A COST ESTIMATE FOR THIS REPAIR AS OF YET. I WANT FORD TO TAKE FULL AND COMPLETE RESPONSIBLITY FOR THIS SAFETY RECALL # 15S18 AND PAY FOR ALL EXPENSES TO REPAIR THIS VEHICLE. IF THIS WOULD HAVE BEEN A WORST CASE SCENARIO ( IF YOU KNOW WHAT I MEAN ) THEN WE WOULD BE TALKING ABOUT A LAWSUIT INSTEAD OF A REPAIR AND COSTING FORD MILLIONS OF DOLLARS TO SAY THE LEAST !!",
        "vin": "3FAHP0HACR4"
    }
]