[
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/19/2021",
        "dateOfIncident": "08/01/2020",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437415,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "In August 2020, while I was driving my vehicle at approximately 15 mph, with approximately 13,500 miles on the odometer, I noticed that the vehicle's transmission gauge was about 230-240 degrees. I pulled over and smelled smoke. Luckily, my passengers and I were able to get out of the vehicle. The vehicle was completely destroyed. I have video showing flames coming out of the passenger side engine compartment. I had previously taken my vehicle in for repair for recall W03 to have the transmission valve body replaced so the transmission wouldn't cause an engine fire. FCA had an expert inspect the vehicle and he found that \"fire progression appears to be from engine compartment thru entire vehicle terminating at rear truck bed,\" that \"possible source of ignition is hot surface of turbocharger/exhaust components. - Most likely method of ignition is transmission fluid expelled from dipstick tube,\" \"origin appears to be in the engine compartment,\" and \"possible cause appears to be transmission fluid expelled from dipstick tube onto turbocharger/exhaust components. The determination of possible cause is based on: 1. Owner/driver's description of events. 2. Transmission of dipstick is extended ~ 27.0 inch from the fill tube.\" Despite this, FCA refused to pay me for my destroyed vehicle (or the trailer that it destroyed) because: \"After the inspection of your vehicle, the information at hand would not permit us to associate the fire with a manufacturing or assembly error. We are sure you will understand fires of this nature can and do occur for a number of reasons not associated with the manufacturing process. Therefore, we must respectfully decline any assistance associated with this matter. Based on this, we suggest that you refer this matter to your insurance carrier . . .\" I already had the transmission fire recall performed and my truck still blew up. Luckily, I was not injured. I am worried that if FCA does not do another recall, other trucks will blow up too.",
        "vin": "3c6ur5nl9kg"
    }
]