[
    {
        "components": "AIR BAGS,WHEELS,SEATS",
        "crash": true,
        "dateComplaintFiled": "07/09/2017",
        "dateOfIncident": "04/09/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11003906,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "RAM 1500",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 DODGE RAM 1500 TRUCK 4X2 QUAD, WAS IN MOTION AT POSTED HIGHWAY SPEED, WITH MINIMAL WIND PRESENT.  AS AN EYEWITNESS & OWNER OF THE VEHICLE, THE DRIVER SUDDENLY LOST CONTROL OF THE VEHICLE, ROLLING THE TRUCK 4 -5 TIMES BEFORE LANDING ON ITS TOP (UPSIDE DOWN). DAMAGE THROUGHOUT WAS SEVERE AND EXTENSIVE. NO AIRBAGS DEPLOYED AND BOTH OCCUPANTS WERE WEARING THEIR SAFETY BELTS. FRONT PASSENGER HEAD REST RIPPED AWAY FROM SEAT AND WAS FOUND ABOUT 100 YARDS AWAY FROM ACCIDENT SCENE, STUCK IN A BUSH. RIGHT REAR TIRE (PASSENGER SIDE), SNAPPED OFF AND BROKE AWAY FROM THE REAR AXEL. TIRE WAS FOUND MORE THAN 100 YARDS AWAY FROM THE TOTALED VEHICLE & TIRE WAS NOT BLOWN OUT. CONCERNS ABOUT 2 SAFETY RECALLS ON THIS VEHICLE IS THE REASON FOR SUBMITTING COMPLAINT: RECALL INVOLVING A PROBLEM/DEFECT WITH THE AIR BAG DEPLOYMENT, AND RECALL CONCERNING A REAR AXEL PION NUT COMING LOOSE WHILE IN MOTION & CAUSING REAR WHEEL TO COMPLETELY BREAK AWAY FROM VEHICLE.  DEFECT COULD SUDDENLY CAUSE DRIVER TO LOSE COMPLETE CONTROL, CAUSING VEHICLE TO CRASH AND/OR VIOLENTLY ROLLOVER. THIS VEHICLE WAS SERVICED FOR BOTH RECALLS, TWICE.  HOWEVER, IN THIS ROLLOVER CRASH THAT OCCURRED, THE REAR WHEEL WITH BRAKE SYSTEM STILL ATTACHED, COMPLETELY SNAPPED OFF THE REAR AXEL.  ALSO, THE INSURANCE COMPANY DID AN ESTIMATE TO REPAIR VEHICLE, BUT DID NOT INCLUDE OR MENTION A REPAIR CHARGE FOR THE RIGHT REAR WHEEL OR THE REAR AXEL.  THE TAIL GATE WAS ALSO RIPPED OFF OF THE TRUCK AND WAS FOUND ABOUT 75 YARDS AWAY FROM THE TOTALED VEHICLE.  NO FATALITIES RESULTED FROM THIS HORRIFIC CRASH, BUT MY SON WHO WAS THE PASSENGER, DID SUFFER SERIOUS AND PERMANENT INJURIES, WHICH INCLUDE A HEAD INJURY (TBI), MULTIPLE FRACTURES TO HIS CTL-SPINE, INJURED RIGHT FOOT, LEG AND HIP, AND ABRASIONS AND DEEP SCRAPES THROUGHOUT HIS BODY.  THE DRIVER, MY SONS GIRLFRIEND, SUFFERED SCRAPES AND BRUISING, BUT NO SERIOUS INJURY. *TT  UPDATED 10/1/18*JB",
        "vin": "1D7HA18N95S"
    }
]