[
    {
        "components": "STEERING,SUSPENSION,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/21/2019",
        "dateOfIncident": "08/29/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290615,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "RANGER",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WE ARE ORIGINAL OWNERS OF A 2002 FORD RANGER XLT NOW WITH 57,000 HIGHWAY MILES, ALWAYS GARAGED/WASHED/MAINTAINED, LITTLE DRIVING IN WINTER (MOSTLY IN SUMMER), ALWAYS FORD MAINTAINED/SERVICED AT SAME DEALERSHIP, BODY/ENGINE/TRANSMISSION IN GREAT SHAPE, WILL LIKELY FAIL INSPECTION THIS SPING BECAUSE FRAME AND FRAME COMPONENTS ARE SEVERELY RUSTED OUT.  - SEVERE RUST ON THE ENTIRE FRAME INCLUDING BOTH CROSS MEMBERS (ENGINE AND TRANSMISSION), ARM BOLT POINTS AND CONTROL ARMS.  - FRAME ALSO HAS SEVERE RUST DOWN BOTH SIDES TO REAR BUMPER, REAR AXLE AND DIFFERENTAL, LEAF SPRINGS AND ALL MOUNTS.  - THE PASSENGER SIDE STEARING KNUCKLE IS DELAMINATING.  - ALL BRAKE LINES HAVE FAILED WHILE DRIVING: FIRST THE REAR BRAKES INCLUDING ALL AXLE COUPLINGS AND DRUM COUPLINGS; SECOND THE FRONT BRAKE LINES FAILED AT THE DISK BRAKES AND RUBBER COUPLINGS.  ALL BRAKE TUBES HAD TO BE REPLACED FROM THE MASTER CYLINDER TO THE WHEELS.   -  SERVICE MANAGER IS WORRIED ABOUT FRONT CROSS MEMBER FAILING UNDER THE ENGINE, MIDDLE CROSS MEMBER FAILING UNDER THE TRANSMISSION AND THE GAS TANK BRACKETS/STRAPS.   - THE FRAME AND MEMBERS AND MOUNTS MUST BE REPLACED; THE REST OF THE VEHICLE IS MECHANICALLY SOUND.  SERVICE MANAGER SAID NO REPAIR WAS POSSIBLE TO FRAME RUST IS SO BAD  PICTURES CAN BE PROVIDED AND/OR VEHICAL INSPECTED BY NHTSA IF DESIRED.  ALL BRAKE LINES AND COUPLINGS PERFORMED AROUND AUGUST 29, 2019.",
        "vin": "1FTZR45E02T"
    }
]