[
    {
        "components": "STEERING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/27/2020",
        "dateOfIncident": "03/14/2020",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341715,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 2500",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE IS EQUIPPED WITH SOME SORT OF WIND SHEER WARNING SYSTEM THAT DETECTS CROSS WINDS AND SUDDENLY SLAMS ON THE BRAKES, WHEN YOU LEAST EXPECT IT.  I WAS DRIVING THE SPEED LIMIT ON I-40 IN ARIZONA AT 75 MPH ON CRUISE CONTROL, AND WAS PASSING A TRUCK IN THE LEFT LANE.  IT WAS A SOMEWHAT WINDY DAY, BUT I WAS DEALING WITH THE WIND AS ANY NORMAL DRIVER WOULD DO, BY STEERING INTO THE WIND A BIT, AND DEALING WITH GUSTS AS THEY AROSE.   AS SOON AS THE NOSE OF MY VEHICLE PASSED THE FRONT OF THE TRUCK, MY VAN SUDDENLY BRAKED WITHOUT WARNING.  I DID NOT EXPECT IT AND THE CAR BEHIND ME DID NOT EITHER.  I SUDDENLY GRABBED THE WHEEL WITH BOTH HANDS, AND TRIED TO CORRECT THE STEERING, NOT KNOWING WHAT WHAT GOING ON, AND NEARLY VEERED OFF THE ROAD.  THE VAN SWERVED NEXT TO THIS TRUCK, RIGHT TO LEFT IN THE LANE,  AND I BATTLED TO REGAIN CONTROL WHEN THIS UNEXPECTED SUDDEN SLAMMING ON THE BRAKES RANDOMLY HAPPENED THAT I DID NOT DO.  THIS SUDDEN BRAKE-SLAMMING OCCURRED AT LEAST 5 MORE TIMES IN THIS 4 HOUR TRIP.  THIS IS SOMETHING THAT YOU DON'T EXPECT AND WHEN YOU ARE DRIVING AND CONVERSING WITH SOMEONE AND SUDDENLY THE BRAKES ARE SHARPLY APPLIED WHILE YOU ARE ON CRUISE CONTROL, WITHOUT ANY SORT OF WARNING.  THIS IS A VERY SERIOUS AND POTENTIALLY LIFE-THREATENING PROBLEM.  I CALLED MERCEDES AND THEY SAID THERE WAS NOTHING THEY COULD DO ABOUT THE PROBLEM.  I ASKED THEM TO TURN THIS FEATURE OFF, AND THEY TOLD ME THAT THEY COULD NOT DO ANYTHING ABOUT IT, AND MORE OR LESS IMPLIED THAT WE HAD TO \"LIVE WITH IT\".   THIS HAS ALSO HAPPENED TO ONE OF MY OTHER DRIVERS THAT ROUTINELY DRIVES THIS VEHICLE AS WELL.  AND HE REACTED IN THE SAME VIOLENT WAY THAT I DID, TRYING TO OVERCOMPENSATE FOR THIS SUDDEN AND UNPLANNED BRAKING. THIS IS GOING TO KILL SOMEONE FOR SURE IF WE CANNOT GET IT TURNED OFF.  IT IS A VERY DANGEROUS FEATURE TO HAVE ON A VEHICLE!.",
        "vin": "WD4PF1CD9KT"
    }
]