[
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/24/2017",
        "dateOfIncident": "06/24/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001175,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CBR250R",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PART THAT IS CAUSING THIS PROBLEM IS A KNOWN SOFTWARE PROBLEM ON THE BIKE AND IT IS VERY DANGEROUS. THE BIKE IS STALLING AND CUTTING POWER WHILE I AM RIDING OR AT A STOP, IT SEEMS TO BE RANDOM. IT HAPPENS EVERY TIME I RIDE, HOWEVER, AND IS VERY DANGEROUS. THE OTHER NIGHT MY BIKE JUST SHUT OFF WHILE CARS WERE FOLLOWING ME AT A HIGH RATE OF SPEED AND I WAS NEARLY HIT. THIS CAUSED THE OTHER MOTORISTS TO BECOME ANGRY WITH ME AND NEARLY PUT ME IN A TERRIBLE SCENARIO. THIS SEEMS TO BE A VERY COMMON PROBLEM AMONG CBR250 OWNERS AND IT IS NOT BEING ADDRESSED BY HONDA. THERE ARE A TON OF VIDEOS ON YOUTUBE OF THIS HAPPENING TO OTHER RIDERS AND YOU CAN SEE JUST HOW DANGEROUS IT IS. THE MOTORCYCLE ONLY HAS 2K MILES ON IT AND I HAVE CHECKED ALL FLUID LEVELS SO I SHOULD NOT BE HAVING TROUBLES. AGAIN, IT IS HAPPENING FAR TOO OFTEN, SOMETIMES MULTIPLE TIMES IN A SINGLE 10 MILE TRIP. IT MAKES ME NOT WANT TO RIDE THE BIKE, WHICH IS MY ONLY MEANS OF TRANSPORTATION AT THE MOMENT. HONDA SHOULD ADDRESS THIS ISSUE BEFORE SOMEBODY GETS HURT AND SUES THEM OR, EVEN WORSE, LOSES THEIR LIFE. IT SHOULD BE EASY ENOUGH FOR HONDA TO DO SOMETHING ABOUT THIS, AS THIS IS SUCH A POPULAR BIKE. IF THEY DO NOT, THEN THEY WILL HAVE TO FACE THE CONSEQUENCES AS SOMETHING BAD IS GOING TO HAPPEN DUE TO THIS PROBLEM.",
        "vin": "MLHMC4105C5"
    }
]