[
    {
        "components": "WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/19/2017",
        "dateOfIncident": "05/08/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006297,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD CONTINUOUS ISSUES WITH ALL FOUR OF MY WHEEL BEARINGS. AFTER ONE WENT BAD, I HAD TO REPLACE IT. TWO WEEKS LATER, I HAD TO REPLACE A SECOND ONE, AND THEN THE FINAL TWO WHEEL BEARINGS HAD TO BE REPLACE ONLY A WEEK AFTER THAT. UPON TAKING IT TO ONE MECHANIC, I WAS TOLD THAT THIS IS A FREQUENT PROBLEM WITH THE MAZDA CX-5, AND THEY GET A LOT OF OWNERS THAT COME IN TO REPAIR THIS ISSUE. I DID SOME RESEARCH ON MY OWN, AND REALIZED THAT WHAT THE MECHANIC HAD TOLD ME WAS TRUE. APPARENTLY, A LOT OF MAZDA OWNERS ARE HAVING THIS ISSUE.     I CALLED UP AN OFFICIAL MAZDA SERVICE CENTER TO INQUIRE ABOUT THIS AND THE SERVICE TECHNICIAN HAD TOLD ME THAT THEY EVEN GET BRAND NEW CARS (CX-5) WITH LOW MILEAGE THAT ARE HAVING THE SAME PROBLEM, SO IT'S NOT A MILEAGE ISSUE. THEY'RE CONSTANTLY REPLACING THE WHEEL BEARINGS FOR THE CX-5, REGARDLESS IF THE VEHICLE HAS LOW OR HIGH MILEAGE. UNFORTUNATELY, MY CAR IS NOW OUT OF WARRANTY, SO TO REPLACE EACH WHEEL BEARING, IT HAS COST ME ABOUT $500 FOR EACH ONE. THAT IS $2000 IN REPAIRS FORA  PROBLEM THAT SEEMS TO BE VERY CONSISTENT WITH A LOT CX-5 MODELS. I HAVE OWNED OTHER CARS WITH THREE TIMES THE MILEAGE WITHOUT HAVING SUCH AN ISSUE. I THINK, PERHAPS, MAZDA SHOULD LOOK INTO AS A RECURRING ISSUE ACROSS THE BOARD WITH MANY MAZDA OWNERS. THIS SOUNDS LIKE A MANUFACTURER DEFECT THAT IS OF NO FAULT TO THE OWNER. PERHAPS MAZDA SHOULD CONSIDER RELEASING A RECALL FOR THIS DEFECT.",
        "vin": "JM3KE4CE0D0"
    }
]