[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/09/2018",
        "dateOfIncident": "08/06/2018",
        "fire": false,
        "manufacturer": "Northwood Manufacturing, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118815,
        "products": [
            {
                "manufacturer": "Northwood Manufacturing, Inc.",
                "productMake": "NORTHWOOD",
                "productModel": "ARCTIC FOX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS AN ARTIC FOX 990 SLIDE-IN TRUCK CAMPER MANUFACTURED BY NORTHWOOD MANUFACTURING, WHICH IS MOUNTED IN A  PICK-UP TRUCK WHICH CONTAINS 2 30# (~7.2 GALLON) LPG/PROPANE CYLINDERS CONTAINED IN AN ENCLOSURE.  EACH CYLINDER IS SECURED WITHIN THE ENCLOSURE BY A BAND.  EACH BAND IS ATTACHED TO THE INSIDE OF THE ENCLOSURE WITH 3 SCREWS THAT ARE ALSO COATED WITH AN ADHESIVE/CAULK (I BELIEVE HOT-MELT GLUE).  THE HEAD OF  THE CENTER SCREW PRESSES DIRECTLY AGAINST THE BACK SIDE OF THE CYLINDER.  OVER TIME, THE MOTION OF THE CAMPER ON THE VEHICLE CAUSED THE HEAD OF THESE CENTER SCREWS TO BEGIN TO WEAR THROUGH THE WALLS OF THE CYLINDERS.  A REPUTABLE, LOCAL PROPANE GAS SUPPLIER CONFIRMED THAT NEITHER CYLINDER IS SAFE TO REFILL.  BASED ON THE CONDITION OF THE SCREWS RELATIVE TO THE CYLINDERS, I BELIEVE IT WAS JUST A MATTER OF TIME BEFORE I HAD A PUNCTURED PROPANE CYLINDER.  I IMAGE THE EFFECT OF  A PUNCTURED 30# (~7GALS) PROPANE CYLINDER MOUNTED IN A TRUCK CAMPER TRAVELING DOWN THE HIGHWAY WOULD BE QUITE DANGEROUS.    I DISCOVERED THIS PROBLEM WHILE MY CAMPER WAS STATIONARY IN MY DRIVEWAY, BUT CLEARLY THE DAMAGE TO THE CYLINDERS IS THE RESULT OF MOTION WHILE DRIVING.    CONSUMER STATED I DID NOT RECEIVE ANY DOCUMENTATION REGARDING THE CONDITION OF THE CYLINDERS THAT I LEFT WITH THEM. MY MAIN CONCERN WAS TO REMOVE THEM FROM MY PROPERTY/POSSESSION. THEY DID TELL ME THAT THEY WOULD NOT REFILL EITHER OF THESE CYLINDERS DUE TO THE DAMAGE. IT IS POSSIBLE THAT THEY STILL HAVE THESE CYLINDERS IN THEIR POSSESSION IF I NEED TO REACQUIRE THEM ONCE THEY ARE EMPTY. YOU ARE WELCOME TO CONTACT THEM AND SHARE MY INFORMATION IF THAT IS HELPFUL TO YOU. UNFORTUNATELY, I  DIDN'T GET THE NAME OF THE GENTLEMAN THAT HELPED ME, BUT IT IS A SMALL/LOCAL SHOP THAT WOULD REMEMBER ME WITH MY TRUCK, CAMPER AND DAMAGED PROPANE CYLINDERS. THE PICTURES I'VE UPLOADED INCLUDE A PICTURE OF THE MOUNTING AREA AND BANDS OF ONE OF THE CYLINDERS, FOLLOWED BY 2 CLOSE-UPS OF THE CENTER SCREW AND THEN 2 PICTURES OF THE CYLINDER FROM THE SAME LOCATION SHOWING THE DAMAGE CAUSED BY THE SCREW. *DT*JB",
        "vin": "1NCA990S8F0"
    }
]