[
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/17/2017",
        "dateOfIncident": "05/30/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005855,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE PURCHASE 2010 I HAVE NOTED A SUSPICION OF VEHICLE'S ELECTRICAL SYSTEM. I HAVE SPOKEN NUMEROUS TIMES OF THIS SUSPICION AND ISSUES OF CONCERN TO FRIENDS AND FAMILY AND  WITH DEALERSHIP. DEALERSHIP TOLD ME THEY ARE UNABLE TO CHECK THE ELECTRONIC SYSTEM.. MY SUSPICION BEGAN WITHIN A YEAR OF PURCHASE ,WITH AUTOMATIC DOOR LOCKS MAKING UNUSUAL SOUND AS IF NOT ENOUGH JUICE TO LOCK OR OPEN AUTOMATICALLY TO MORE CONCERN OF DRIVING WITH A DRAG SENSE AND FEELING LIKE GOING TO STALL AT TRAFFIC LIGHTS APPROXIMATELY 2015? COMPLAINT FORM ASKS FOR EXACT MILEAGE AND YEAR BEGAN. DATE I ENTERED IS JUST OVER PURCHASE DATE ALTHOUGH THE HEAT HAS BEEN MORE OF A SERIOUS SUSPICION 2015-2017 THAT I CAN RECALL; MILEAGE OF ISSUES NOTED ARE GUESSTIMATE 0 MILES THROUGH CURRENT 124,000 MILES   CAR PERIODICALLY FEELS LIKE WILL STALL IN TRAFFIC AT STOP LIGHT, AND LACK OF POWER WHILE DRIVING AT SPEEDS 30-70 MPH. IT IS COMMON TO FEEL LIKE I AM PULLING A TRAILER FILLED WITH HEAVY ROCK AS IF A PULL OR DRAG ON ENGINE, SOMETIMES LIKE IT IS JUST GOING TO STALL WHILE DRIVING.  I HAVE HAD BATTERY CHECKED  FOR MORE THAN 3 YEARS WHEN QUESTIONING WHY IT DRIVING THIS WAY AND I AM TOLD ,THE BATTERY IS OK. I HAVE REPLACED BATTERY 2X SINCE 2010 FOR ACTUAL BATTERY FAILURE. THE DRIVER DASHBOARD AND DRIVER FOOT AREA HEAT UP TO WHAT HAS BEEN NOTICEABLE AND OF SUSPICION TO ME,  FEELING LIKE AN UNUSUAL AND DANGEROUS LEVEL OF HEAT TO TOUCH. TO  TOUCH HEATING COOLING KNOB FOR EXAMPLE OR IN AREA OF DASHBOARD AND ELECTRONIC KNOBS HAVE BEEN VERY HOT. I HAD JUST SEEN ONLINE AND READ ABOUT A 2010 HONDA FIT ENGINE AND ENGINE COOLING NHTSA CAMPAIGN #11V101000 RECALL DATED MARCH 7, 2011. I AM TOLD BY HONDA AND NHTSA THAT MY 2010 HONDA FIT IS NOT INCLUDED DUE TO NOT BEING OF SAME MANUFACTURER OF OTHER HONDA FITS OF THIS RECALL. I AM CONCERNED THAT MY ENGINE ISSUES THAT HAVE BEEN OF MY SUSPICION ARE RELATED TO THIS RECALL.",
        "vin": "JHMGE8G22AC"
    }
]