[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/11/2019",
        "dateOfIncident": "11/19/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288415,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING RECALL 14S06 ,MY CAR, WAS MANUFACTURED 14 MARCH 2012,,, THERE IS A RECALL THAT INCLUDED THE EXACT SAME ISSUE INCLUDING THE ADVANCETRAC AND SERVICE POWER STEERING SOON PROBLEM ON EXPLORERS MANUFACTURED AT THE SAME PLANT UNTIL 28 FEBRUARY 2012,,,,, I GET THERE HAS TO BE A LINE BUT THEY ARE UNWILLING TO ACCOMODATE A FAITFUL CUSTOMER.     LOOKING THROUGH THE REST OF NHSTA THERE ARE EXTENSIONS OF THE ELECTRIC ASSIST REPROGRAMMING TO CORRECT THE ADVANCETRAC COMPUTER PROBLEM TIL 2023 HOWEVER ONLY IF THE EXPLORER WAS UNDER THE 28 FEBRUARY 2012 ORIGINAL RECALL. AGAIN MY CAR CAME OFF THE LINE, 14 MARCH 2012.     I HAVE GOTTEN NOWHERE WITH THE CUSTOMER SERVICE 800 NUMBER EXCEPT WERE SORRY YOU ARE EXPERIENCING THE SAME EXACT SYMPTOMS AS THE CARS MANUFACTURED TWO WEEKS PRIOR TO YOURS IN THE SAME PLANT, BUT WE HAVE TO DRAW THE LINE SOMEWHERE AND THE PROBLEM IS PROBABLY RELATED TO SOMETHING ELSE. THE DEALER HAS SOME RESOURCES TO WORK WITH YOU BUT YOU NEED TO SPEAK TO THEM. MEAN TIME I HAVE NOT HEARD FROM THE LOCAL CUSTOMER SERVICE REP ED, THIS CASE WAS OPENED LAST WEEK AND THE VEHICLE IS SITTING IN MY DRIVEWAY HOPING TO HEAR POSITIVE NEWS ABOUT THE COMPUTER ISSUE AFTER SPENDING TMY OWN $1200 TO REPLACE A PART THAT SHOULD HAVE CLEARLY BEEN COVERED IN THIS RECALL 14S06     I CANNOT DRIVE IT SINCE I GOT IT INTO MY DRIVEWAY WITH THOSE TWO MESSAGES (BOTH ADVANCETRAC AND SERVICE POWER STEERING SOON) IN THE DIC,,, I GOT HOME AND SHUT OFF RESTARTED, NO STEERING , I REPARKED IT IN THE DRIVEWAY WITH  \"ZERO ASSIST\" I ASSUME IT WILL NEED TO BE TOWED TO THE NEXT LOCATION.",
        "vin": "1FM5K7D87DG"
    }
]