[
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/05/2017",
        "dateOfIncident": "06/14/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003207,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 14, 2017 I WAS DRIVING MY 2011 DODGE DURANGO HOME FROM WORK AND THE BATTERY LIGHT CAME ON WHILE I WAS ON A BUSY HIGHWAY. I EXITED THE HIGHWAY AND PULLED INTO A MALL PARKING LOT AND SUDDENLY THE INTERIOR TEMPERATURE OF THE CAR BECAME EXTREMELY HOT, SO HOT, I COULD NOT STAY INSIDE OF THE VEHICLE. I STARTED TO SEE AND SMELL SMOKE, SO I TURNED THE VEHICLE OFF AND OPENED THE HOOD; AS I IT OPENED THERE WAS A LARGE AMOUNT OF SMOKE AND I CLOSED IT TO SNUFF OUT ANY FIRES.  I HAD THE VEHICLE TOWED TO MY MECHANIC AND WAS TOLD MY ALTERNATOR HAD GONE BAD. THE EXPLANATION I WAS GIVING WAS: THE SILICONE DIODES IN THE ALTERNATOR RECTIFIER BRIDGE MAY EXPERIENCE THERMAL FATIGUE DUE TO CYCLIC LOADING FROM THE ELECTRIC HYDRAULIC POWER STEERING (EHPS) SYSTEM, EVENTUALLY RESULTING IN NO OUTPUT, REDUCED OUTPUT, OR A FULLY SHORTED TO GROUND CONDITION. THESE FAILURE MODES VARY IN THEIR TIME TO FAILURE AND WARNING TO THE DRIVER. DEPENDING ON THE FAILURE MODE AND TIMING, SYSTEM VOLTAGE MAY DROP TO CRITICALLY LOW LEVELS, DISABLING SYSTEMS SUCH AS THE ANTI-LOCK BRAKE SYSTEM/ELECTRONIC STABILITY CONTROL, ENGINE CONTROL MODULE/CENTRAL BODY CONTROLLER, OR A TOTAL VEHICLE ELECTRICAL SYSTEM SHUT DOWN (IN THE EVENT OF A SHORT TO GROUND FAILURE MODE).  I EXPERIENCED A TOTAL SYSTEM SHUT DOWN. THE ALTERNATOR NOT ONLY FAILED BUT SHORTED OUT MY BATTERY, FUSES AND COMPUTER MODULE.   I CALLED DODGE CORPORATE AND ONLY RECEIVED AN APOLOGY.... DODGE HAS A RECALL P60 RECALL WHICH APPLIES TO 160AMP ALTERNATOR. THIS RECALL WAS NOT APPLICABLE TO MY VEHICLE BECAUSE IT HAS A 180 OR 220 AMP ALTERNATOR BUT IF IT IS FAILING LIKE THE 160AMP ALTERNATOR THEN DODGE SHOULD BE RESPONSIBLE FOR THE DEFECTIVE PART.",
        "vin": "1D4RE4GG3BC"
    }
]