[
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/15/2019",
        "dateOfIncident": "03/08/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187115,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2012 KIA SOUL (BASE) WITH THE 1.6L GDI  RECENTLY HAD A PROBLEM ON I-80 TRAVELING BETWEEN DES MOINES, IA AND DENVER, CO.  (THERE HAD BEEN NO PRIOR SYMPTOMS)      AFTER REACHING AROUND 65 MPH, THE ENGINE BEGAN MISFIRING EMMITING OBD ERROR CODE 0336 INDICATION A BAD CRANKSHAFT POSITION SENSOR.  I STOPPED AT THE NEAREST AUTOZONE, BOUGHT A  APPROPRIATE REPLACEMENT, AND INSTALLED THE PART IN THE PARKING LOT.  UPON IGNITION, THE CAR IMMIDIATELY BEGAN MISFIRING AND DIED.  ON THE SECOND ATTEMPT, THE CAR STARTED AND MISFIRED; BUT IT SENT THE SAME 0336 CODE THEN THE TACHOMETER DIED.  ALTHOUGH THE TECHOMETER DIED, THE ENGINE CONTINUED TO IDLE (AND RUN) WITHOUT FURTHER MISFIRES.    UPON SEEING THIS, I FIGURED IT WAS THE CAM SHAFT POSITION SENSORS (AS THE SYMPTOMS ARE VERY SIMILIAR).  I FOUND, AND REPLACED BOTH ENGINE MOUNTED CAM SHAFT POSITION SENSORS, BUT NO NEW SYMPTOMS UNTILL I TEST DROVE THE VEHICLE.    DURING THE TEST DRIVE, THE VEHICLE EMMITED 3 OBD CODES, AND DIDNT START MISFIRING UNTIL THE TACHOMETER WENT OVER 3500 RPM.  BY THEN, I WAS DOING A HIGHWAY TEST ON I-80 OUTSIDE LINCOLN, NE, AND THE CAR JUST DIED AT AROUND 55-65 MPH.  IT EMMITED CODE 0336 FOR A BAD CRANKSHAFT POSITION SENSOR, 0565 FOR CRUISE CONTROL ON SIGNAL MALFUNCTION (I HAVE THE BASE MODEL, SO THERE IS NO CRUISE CONTROL), AND 0517 FOR BATTERY TEMPERATURE CIRCUIT MALFUNCTION.    I MANAGED TO GET THE VEHICLE OFF THE INTERSTATE, AND BACK HOME WHERE THE PROBLEM CHANGED AGAIN.  NOW IT MISFIRES UNTILL THE TACHOMETER HITS 3500, THEN THE TACHOMETER DIES AND THE VEHICLE APPEAR TO RUN NORMAL (DISPITE THE REOCCURING ODB2 CODES 0366, 0517, AND 0565)    IT APPEARS THE ENGINE HEATED UP ENOUGH TO BURN OUT A BRAND NEW CRANKSHAFT POSITION SENSOR, AND CAUSE PROBLEMS WITH THE BATTERY. (AND POSSIBLY THE ECU AS IT NOW REPORTS MY NON-EXISTANT CRUISE CONTROL IS MALFUNCTIONING)",
        "vin": "KNDJT2A54C7"
    }
]