[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/12/2017",
        "dateOfIncident": "07/08/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004702,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL: AFTER MULTIPLE ATTEMPTS TO SCHEDULE AN APPOINTMENT FOR BOTH DRIVER AND PASSENGER AIRBAG INFLATOR RECALLS TO BE COMPLETED OVER THE PAST 2 YEARS - THEY STILL REMAIN UNFIXED.  THE LAST ATTEMPT FINALLY SECURED AN APPOINTMENT (SATURDAY, JULY 8, 2017 - 4:00 PM). UPON ARRIVAL, I WAS INFORMED THAT I NEEDED TO LEAVE THE VEHICLE FOR 5-7 DAYS AS NO PARTS WERE AVAILABLE. WHEN I ASKED IF THEY HAD A RENTAL/LOANER PROGRAM AS I CANNOT BE WITHOUT TRANSPORTATION FOR THAT LONG, I WAS INFORMED THAT THEY ONLY HAVE 40 LOANERS AND THEY WERE ALL OUT. THEN I WAS INFORMED THAT THEY DO NOT HAVE A RENTAL PROGRAM. WHEN I EXPLAINED THAT THIS IS MY ONLY FORM OF TRANSPORTATION AND I HAVE BEEN TRYING TO HAVE THIS COMPLETED FOR ALMOST 2 YEARS, I WAS ADVISED I COULD EITHER LEAVE THE VEHICLE OR CONTACT ANOTHER DEALER. EVEN AFTER I EXPLAINED THAT I FEAR FOR BOTH MY FAMILY'S HE REPEATED HIMSELF STATING I COULD CONTACT ANOTHER DEALER AND WAS SENT AWAY.     AS WE ALL KNOW,  THIS RECALL HAS NOT ONLY CAUSED SERIOUSLY INJURIED, IT HAS TAKEN LIVES. I AM ASKING FOR NYOUR ASSISTANCE IN GETTING THESE RECALLS COMPLETED. I VALUE BOTH MINE AND MY FAMILY'S LIVES. AFTER 2 YEARS PARTS SHOULD BE AVAILABLE. BELOW YOU WILL FIND THE DEALER INFORMATION:    CITRUS MOTORS FORD AND KIA  1375 S. WOODDRUFF WAY  ONTARIO, CA 91761  (800) 447-8907    AFTER CAREFUL RESEARCH, I UNDERSTAND THAT TAKATA HAS FILED  BANKRUPTCY AND THE VEHICLE MANUFACTURERS ARE NO LONGER USING THEIR PRODUCTS. I KNOW THAT THERE ARE 4 OTHER VENDORS WITH AVAILABLE PARTS AND THERE ARE NO SHORTAGE OF PARTS. MAYBE FORD SHOULD COMMUNICATE WITH AMERICAN HONDA MOTOR COMPANY AND TAKE A PAGENFROM THEIR BOOK. I KNOW MANY HONDA OWNERS WHO HAVE HAD THEIR RECALLS COMPLETED WITHOUT HESITATION AND/OR ISSUES WITH THE COMPANY. KOODOS TO HONDA, WISH THAT I AND MY FAMILY AS 3 GENERATIONS LOYAL FORD OWNERS WOULD RECEIVE THE SAME SERVICE.",
        "vin": "1ZVFT80N675"
    }
]