[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/23/2018",
        "dateOfIncident": "02/18/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11074415,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "MY NISSAN ALTIMA 2.5 S, AT 123,000 MILES, BEGAN LOSING POWER WHILE I WAS DRIVING IN BUSY TRAFFIC. MY CAR EVENTUALLY STOPPED. I HAD MY CAR HAULED TO MY HOME, BY A TOW TRUCK. THE NISSAN DEALERSHIP  WAS NOTIFIED AND GIVEN THE VIN #. THIS PARTICULAR YEAR (2011), WAS NOT ON THE RECALL LIST , BUT PREVIOUS YEARS HAD BEEN ADDED TO THE LIST, FOR THE SAME PROBLEM (CVT TRANSMISSION). I READ MULTIPLE COMPLAINTS ONLINE REGARDING NISSANS TROUBLE WITH THE CVT TRANSMISSION IN ALL NISSAN CARS FOR ALL YEARS. THE DEALERSHIP ADMITTED THERE WERE PROBLEMS AND COMPLAINTS ABOUT THE CVT TRANSMISSIONS, BUT THEY COULDN'T DO ANYTHING ABOUT IT SINCE MY CAR'S YEAR (2011) WASN'T ON THE LIST. I HAVE TAKEN GREAT CARE OF MY CAR, KEEPING UP WITH THE PREVENTIVE MAINTENANCE, SINCE I PURCHASED IT BRAND NEW. ANY CAR LOSING POWER IN BUSY TRAFFIC IS A SAFETY ISSUE. THIS ISSUE SHOULD HAVE A CLASS ACTION LAW SUIT BROUGHT AGAINST NISSAN. IT IS FREQUENTLY TALKED ABOUT ONLINE. A TREMENDOUS AMOUNT OF NISSAN CUSTOMERS ARE COMPLAINING ABOUT THE SAME ISSUE (CVT TRANSMISSION) IN ALL OF THEIR CARS, NO MATTER HOW MANY MILES THE CARS HAVE BEEN DRIVEN. PLEASE HAVE NISSAN TAKE RESPONSIBILITY FOR THIS FAULTY CVT TRANSMISSION THAT THEY CHOSE TO INSTALL IN ALL OF THEIR CARS, WHICH WAS A BIG MISTAKE AND A DANGER TO THE NISSAN DRIVERS AND THE PUBLIC. CVT TRANSMISSIONS, WHICH ARE EQUIVALENT TO A PULLEY /CHAIN SYSTEM, DO NOT BELONG IN CARS. A MORE DURABLE/APPROPRIATE TRANSMISSION IS NEEDED IN THEIR CARS TO KEEP THE NISSAN DRIVERS AND THE PUBLIC SAFE FROM HARM OR DEATH. THIS ISSUE IS A DISASTER WAITING TO HAPPEN. MY CAR IS CURRENTLY WITH A MECHANIC, ATTEMPTING TO BE REPAIRED WITH A USED CVT TRANSMISSION, WHICH IS ALL I COULD AFFORD AT THIS TIME. I FEEL IT DOESN'T MATTER WHETHER IT'S USED OR NEW, IT'S STILL A CVT TRANSMISSION THAT WILL EVENTUALLY FAIL. RENTING A CAR NOW. I WILL UPLOAD THE REPAIR BILL WHEN THE REPAIR IS COMPLETED.",
        "vin": "1N4AL2AP6BN"
    }
]