[
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/20/2017",
        "dateOfIncident": "06/13/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000213,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "NISSAN JUKE OWNERS ARE REPORTING OVER THE INTERNET THAT THE CAR SUFFERS FROM A DEFECTIVE ALTERNATOR OR BATTERY THAT CAUSES THE CAR TO LOSE POWER DURING NORMAL DRIVING IN HOT WEATHER. TEMPS ARE IN THE 100S IN CA RIGHT NOW 06/20/17. I PURCHASED MY JUKE A WEEKS AGO. IT DROVE FINE WHEN I DID THE INITIAL 3 TEST DRIVES BEFORE BUYING IT. IT WAS NOT UNTIL I ACTUALLY DROVE THE CAR SOME RESPECTABLE MILES THAT I NOTICED THAT THIS CAR HAS A SAFETY ISSUE THAT IS TRIGGERED WHEN ANY OF THE FOLLOWING CONDITIONS ARE MET:  #1. DRIVING IN HOT TEMPS ON THE FWY IN STOP AND GO TRAFFIC IF THE OPERATOR ROLLS THE WINDOW DOWN WHILE DRIVING THE CAR WILL REACT BY SHUTTERING WHEN THE WINDOWS ARE ROLLED DOWN OR IF YOU HOLD DOWN THE BUTTON. ONCE THIS IS TRIGGERED THE CAR MOVES AT A SNAILS PACE FOR THE REST OF THE TIME.    #2 IF YOU TURN YOUR AC ON IN AUTO MODE IN HOT WEATHER ~100 C OR MORE FOR LONGER THAN AN HOUR WHILE DRIVING IN HOT WEATHER AND STOP AND GO TRAFFIC THE CAR WILL SUDDENLY LOSE POWER IN AN UN-SAFE MANNER THAT COULD CAUSE A TRAFFIC ACCIDENT. IT IS NOT UNTIL YOU TURN OFF THE AC THAT THE CAR WILL SLOWLY START TO GAIN POWER PACK AFTER THE ISSUE IS TRIGGERED.     BOTH OF THESE ISSUES ARE COMMON AMONGST JUKE OWNERS. I HAVE EXPERIENCED BOTH ON MORE THAN ONE OCCASION AND TO BE HONEST NISSAN SHOULD HAVE DONE THEIR DUE DILIGENCE BY RECALLING THE NISSAN JUKE. IT APPEARS FROM WHAT I HAVE READ AND TO THE PEOPLE FROM NISSAN THAT I SPOKE WITH THE JUKE WAS SPECCED WITH THE WEAK BATTERY AND WEAK ALTERNATOR THAT ARE BOTH AFFECTED BY HEAT SOAK WHICH TRIGGERS THE CAR TO GO INTO SAFE MODE TO PROTECT THE ENGINE FROM DAMAGE.",
        "vin": ""
    }
]