[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/17/2017",
        "dateOfIncident": "06/29/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005998,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "CROSSTREK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMOBILE WAS TAKEN TO HAVE AN OIL CHANGE AND WHEN CAR WAS ATTEMPTED TO DRIVE OUT THERE WAS A SLIPPAGE OF THE DRIVE TRAIN.  I STOPPED AND HAD THE CAR CARRIED TO A MECHANIC THAT I TRUSTED.  I EXPLAINED TO HIM WHAT I HAD OBSERVED AT THE CHANGING OF THE OIL AND AS A PRECAUTION HE DRAINED BOTH THE OIL AND THE TRANSMISSION AS I TOLD HIM THAT IT WAS POSSIBLE THAT THEY MAY HAVE DRAINED THE TRANSMISSION OIL.   HE REPLACE THE TRANSMISSION OIL WITH THE PROPER TRANSMISSION FLUID AS CALLED FOR BY SUBARU.  THE CAR STILL WOULD NOT RUN PROPERLY.  I THEN HAD THE CAR TRANSPORTED TO THE SUBARU DEALER HERE IN ATLANTA, GEORGIA, CLASSIC CADILLAC. THE SUBARU DEALER SAID THAT  THEY COULD NOT TELL ME WAS WRONG, HOWEVER I WAS TOLD THAT THEY WOULD HAVE TO REPLACE THE TRANSMISSION.  WE THEN CALLED THE SUBARU NATIONAL OFFICE AND WAS TOLD THAT THE WARRANTY WAS VOIDED BECAUSE OF THE FACT THAT MAINTENANCE HAD BEEN PERFORMED BY AN UNAUTHORIZED COMPANY AND NOT BY SUBARU.  THE PERSON SPOKEN TO WAS A MS. S. BROWN WHO IDENTIFIED HERSELF AS THE PERSON AT SUBARU THAT WAS RESPONSIBLE FOR WARRANTIES.  MS. BROWN INSISTED THAT THE OIL CHANGE AND THE REPLACEMENT OF THE TRANSMISSION FLUID.   THE REPLACEMENT TRANSMISSION S TRANSMISSION WAS QUOTED AS $7,800.00.  THIS IS SO EVEN THOUGH NO ONE FROM SUBARU COULD TELL US WHAT WAS WRONG WITH THE TRANSMISSION THAT REQUIRED THAT IT BE REPLACED.  I WOULD APPEAR THAT WE ARE THE VICTIMS OF THE REFUSAL OF SUBARU NOT TO ISSUE A RECALL ON THE TRANSMISSION EVEN THOUGH THERE ARE THOUSANDS OF CASES OF TRANSMISSIONS PROBLEMS, THIS IS SO EVEN THOUGH WE JUST RECEIVED A LETTER FROM SUBARU EXTENDING THE WARRANTY ON THE POWER TRAIN.   THE CAR WAS NOT DRIVEN AT ANY TIME DURING EACH TIME THAT THE CAR WAS LOOKED BY ANY MECHANICS.",
        "vin": "JF2GPAG1E82"
    }
]