[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/12/2021",
        "dateOfIncident": "12/27/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440215,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "To whom it may concern,  VEHICLE: 2020 Honda Pilot Touring Purchase Date: 9/9/2020  After purchasing a 2020 Honda Pilot Touring brand NEW, the vehicle began to make a crackle sound via speakers. Then we began to notice the entire infotainment center would cut out displaying a \"Network Communication Lost\" and \"MOST Net Off\" message. The music, radio, dvd player, aux, dash board electronics would no longer work until the vehicle is stopped and restarted. Upon reboot, the same thing will occur once you hit a bump or just randomly will show same message. Below is a timeline of occurrences.   Timeline  12/29/20; Dropped vehicle off to Chantilly Honda to resolve problem - dealer replaced \"fakra connectors\". Problem occurred shortly after.  04/21: Received notice from Honda Inc. of MOST Bus Network Connectors recall  06/21/21: Dropped vehicle off to Chantilly Honda because dash was going out. In addition, vehicle lost 80% of power on major highway and had to be pulled over to avoid accident. We were stuck driving 20mph on the NJ turnpike in the middle lane. THIS IS DANGEROUS. VERY SCARY INCIDENT.  8/5/21: We filed a claim with Honda Inc to resolve situation b/c now this has become a safety hazard.  10/26/21: Newly designed Honda Issued connectors were installed via Chantilly Honda.  11/4/21: Vehicle displays \"Network Communication Lost\" error again on infotainment/dash.   We have not been able to resolve this dangerous recall with Honda. After many phone calls and requests to speak with managers, nothing has been done. We are out of options and would like to receive counsel from the state.  Thank you in advance, [XXX]  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "5FNYF6H92LB"
    }
]