[
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/07/2017",
        "dateOfIncident": "06/22/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003705,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHAT'S NOT WRONG WITH THIS CAR?? I BOUGHT IT USED WITH AN EXTENDED WARRANTY. AFTER A YEAR EVERYTHING WENT DOWNHILL. IT HAS BEEN IN AND OUT THE GMC SERVICE AT LEASE 3 TIMES A YEAR. I DON'T EVEN KNOW WHERE TO START. THE AIRBAG LIGHT IS ON BUT IT ISN'T COVERED UNDER THE AIRBAG RECALL. WHAT ABOUT SAFETY? THERE HAS BEEN A CHECK STABILITY TRAC AND TRACTION LIGHTS ON AS WELL ON SEVERAL OCCASIONS. WHEN THOSE LIGHTS COME ON THE VEHICLE DECELERATED WHILE DRIVING ACROSS THE KENTUCKY BRIDGE WHICH ALMOST CAUSED A 12 CAR PILE UP. IN ADDITION, IT ALSO SKIPS GEARS. WHEN TRYING TO SPEED UP IT JERKS INTO THE NEXT GEAR LIKE A HICCUP. THE DEALERSHIP STATED THESE PROBLEMS WERE ELECTRIC AND WEAR COVERED UNDER MY EXTENDED WARRANTY. I SUGGESTED THAT MAYBE THE TRANSMISSION WAS BAD. HOWEVER, THEY STATED OTHERWISE. LITERALLY, 4 MONTHS LATER THE TRANSMISSION IS OUT. BUT WHAT A SURPRISE NO LONGER UNDER WARRANTY. NOW I'M LOOKING AT A $5,000 BILL. THE SERVICE DEPARTMENT STATED THAT IT IS TRANSMISSION FAILURE DUE TO AN ELECTRIC ISSUE (OUT OF MY CONTROL). THERE IS NOTHING THAT I COULD HAVE DONE TO PREVENT IT FROM HAPPENING. BUT AFTER TALKING TO GM THEY, BASICALLY EXPLAINED THAT THEY DON'T STAND BY THEIR PRODUCT AFTER 100,000 AND THAT THEY CAN'T PROVE THAT THE ISSUES ARE ACTUALLY MANUFACTURERS DEFECT. I STRONGLY DISAGREE AS THERE ARE HUNDREDS OF PEOPLE EXPERIENCING THE SAME HARDSHIPS AS ME WITH THE 2008 VEHICLE. ON [XXX], FOR GMC ACADIA, 2008 IS THE WORST YEAR WITH THE MOST COMPLAINTS FOR TRANSMISSION FAILURE. HOW AREN'T THESE ALREADY RECALLED BY NOW? THEY ARE NOTHING BUT JUNK! NOT WORK ANYTHING. EVEN A GMC SERVICE REP. SAID THESE WERE THE WORSE YEAR AND GET THEM IN THE SHOP ALL THE TIME. WHY WON'T GMC JUST ISSSUE A RECALL AND TAKE THEM OFF THE MARKET. I HAVE ALL THE PROOF OF REGULAR MAINTENANCE AND SERVICE RECEIPTS.    PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "1GKEV337X8J"
    }
]