[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/08/2017",
        "dateOfIncident": "07/08/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003787,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT PASSENGER SIDE AIRBAG REMAINS OFF (SENSOR LIGHT IS ON) WHEN AN ADULT PASSENGER IS IN THE SEAT.  THIS BEGINS WHEN THE CAR IS STARTED IN PARK AND CAN REMAIN ON EVEN DRIVING WITH HIGH SPEED (40 OR 50 MPH).  THIS OCCURS INTERMITTENTLY.  SOMETIMES THE AIRBAG WILL TURN ON (SENSOR LIGHT TURNS OFF) AFTER A LENGTH OF TIME.  OTHER TIMES, THE CAR WILL NEED TO BE RESTARTED.  IT IS MOST REPRODUCIBLE WHEN THE CAR IS ALREADY ON AND THEN THE PASSENGER SITS.  A VIDEO OF THE PROBLEM IS AVAILABLE HERE:    HTTPS://WWW.YOUTUBE.COM/WATCH?V=JF-EATBAZHK    THE OWNER COULD NOT UPLOAD FILE TYPE ON WEBSITE, BUT INCLUDED A LINK HERE INSTEAD.    AS NOTED BELOW, THE OWNER FIRST OBSERVED THE PROBLEM IN DECEMBER 2014.  THE RECALL REPAIR WAS COMPLETED IN JULY 2016.  THE OWNER HAS REPRODUCED THE PROBLEM AT A DEALERSHIP IN JULY 2017.  TO DATE, THE OWNER HAS HAD TO BRING THIS PROBLEM TO NISSAN A TOTAL OF SIX TIMES.     DOCUMENTED HISTORY OF PROBLEM:    THE OWNER HAS BROUGHT THIS PROBLEM TO THE ATTENTION OF GURLEY LEEP NISSAN IN MISHAWAKA, IN ON THE FOLLOWING DATES (DATES CORRESPOND TO THE INVOICE DATE):    12/15/14 ' OWNER OBSERVED PROBLEM AND REQUESTED A CHECK OF THE PASSENGER SIDE AIR BAG.  GURLEY LEEP NISSAN PERFORMED ZERO POINT RESENT FUNCTION.    11/14/15 - OWNER OBSERVED PROBLEM AND REQUESTED A CHECK OF THE PASSENGER SIDE AIR BAG.  GURLEY LEEP NISSAN MADE NO REPAIRS    7/7/16 - GURLEY LEEP NISSAN COMPLETED PASSENGER SIDE AIRBAG RECALL REPAIR.    5/15/17 - OWNER OBSERVED PROBLEM AND REQUESTED A CHECK OF THE PASSENGER SIDE AIR BAG.  GURLEY LEEP NISSAN PERFORMED ZERO POINT RESENT FUNCTION.    5/30/17 - GURLEY LEEP NISSAN DOES NOT RECOMMEND REPAIRS.    7/7/17 - GURLEY LEEP NISSAN DOES NOT RECOMMEND REPAIRS.    7/8/17 - OWNER REMAINED AT GURLEY LEEP NISSAN UNTIL SHE COULD REPLICATE THE PROBLEM.  SHE DID THIS WITH TECHNICIAN IN THE CAR.",
        "vin": "5N1AT2MV6EC"
    }
]