[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/24/2020",
        "dateOfIncident": "09/15/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384815,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE FAILED BECAUSE THE CRANKSHAFT GOT SO HOT IT FUSED THE CRANKSHAFT AND THE BEARINGS CAUSING THE COMPLETE FAILURE AND REPLACEMENT OF THE ENGINE.  BMW HAS HAD NUMEROUS CLAIMS OF ENGINE FAILURES IN THE X5 BUT THEY WILL NOT DO ANYTHING TO REPAIR THE VEHICLE.  THE ENGINE ONLY HAD 84K MILES AND THEN WITHOUT WARNING, NO OIL LEAKS, NO HOT ENGINE RED LIGHTS, NOTHING AT ALL TO SPEAK OF IN THE MIDDLE OF TRAVEL, THE ENGINE COMPLETELY SHUT OFF AND I HAVE TO DO EVERYTHING TO GET TO THE SHOULDER OF THE ROAD. THE BMW DEALERSHIP IN BAY SHORE NY HAD THE VEHICLE FOR THREE WEEKS AND REALLY DIDN'T OPEN THE ENGINE UP TO FIND THE CAUSE.  AFTER BMWUSA SAID THEY WOULD DO NOTHING TO RESOLVE THEIR LATENT DEFECT IN THE ENGINE OBVIOUSLY METAL PARTS WHICH WE CAME TO THE CONCLUSION WERE INFERIOR, I HAD THE ENGINE TAKEN OUT BY A CERTIFIED TRAINED A MECHANIC.  HE STATED HE HAS NEVER SEE A MELTDOWN OF PARTS WHICH WELDED TOGETHER FROM THE EXTREME HEAT OF THE ENGINE. NO LEAK WERE DETECTED FOR EITHER COOLANT OR OIL YET THE ENGINE SEIZED SIMPLY FOR THE FACT, THE METAL USED INTERNALLY IS INFERIOR.  FOR THE PRICE YOU PAID FOR THE \"ULTIMATE DRIVING MACHINE\", BMWUSA NEEDS TO STEP UP AND BE HONEST ABOVE THE PROBLEMS THAT HAVE PLAGUED THEIR ENGINES AND THEIR COOLING SYSTEM.  I HAVE SPEND OVER $15,000 TO GET THIS VEHICLE REPAIRED AND BMWUSA SHOULD REIMBURSE ME BECAUSE OF IT'S KNOWN HISTORY. I HAVE OWNED BMWS SINCE 1992 AND THE VEHICLES LASTED PASSED 175K MILES. TO HAVE A MAJOR ENGINE FAIL AT 84K SPEAKS VOLUMES TO THE LACK OF INTEGRITY FOR THE ENGINE.  BMW IS USING STEEL AND METAL THAT HAVE SIGNIFICANT STRENGTH PROBLEMS AS DOCUMENTED BY ALL THE COMPLAINTS I HAVE READ ABOVE.  TO HAVE THE ENGINE SEIZED LIKE THIS IS THE MIDDLE OF TRAFFIC ENDANGERED ME AND MY PASSENGERS AND TOTALLY UNCONSCIONABLE.*DT*AS",
        "vin": "5UXZV4C55DL"
    }
]