[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/22/2017",
        "dateOfIncident": "06/09/2017",
        "fire": false,
        "manufacturer": "Mercedes-Benz USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000641,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC",
                "productMake": "MERCEDES BENZ",
                "productModel": "CLK350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MERCEDES BENZ VEHICLES MANUFACTURED BETWEEN 2004 & 2007 & EQUIPPED WITH MERCEDES' M272 HAVE A FAULTY BALANCE SHAFT WHICH WAS NOT PROPERLY ANEALED, CAUSING PREMATURE WEAR. THE SUBJECT ENGINES WERE MANUFACTURED WITH DEFECTIVE GEARS IN THEIR BALANCE SHAFTS. THESE DEFECTIVE GEARS WEAR OUT PREMATURELY, EXCESSIVELY, AND CAN CAUSE DAMAGE TO OTHER EXPENSIVE ENGINE COMPONENTS WITHOUT WARNING. REPAIR REQUIRES REMOVAL OF THE ENGINE AND WAS QUOTED AT $7000-$8000 BY THE MERCEDES BENZ DEALER. MOST OTHER IMPORT SHOPS DO NOT WANT TO EVEN ATTEMPT THE REPAIR DUE TO THE COMPLEXITY AND SPECIAL TOOLS REQUIRED. A CLASS ACTION LAWSUIT WAS SETTLED ON THIS ISSUE SEVERAL YEARS AGO (WE WERE NEVER EVEN NOTIFIED) BUT ONLY THOSE WHO HAD THE ISSUE AT THE TIME COULD TAKE ADVANTAGE OF THE SETTLEMENT'S DISCOUNTED REPAIR COSTS (IT WAS A TERRIBLE SETTLEMENT!). WE DID NOT HAVE THE ISSUE UNTIL A FEW MONTHS AGO AT AROUND 77000 MILES.  THIS PROBLEM CAN CAUSE THE ENGINE TO MISFIRE, STALL OR BREAK DOWN COMPLETELY. MERCEDES BENZ AND ITS DEALERSHIPS BASICALLY SAY, OH WELL, YOU GOT A LEMON. WE ALSO CANNOT POSSIBLY PASS THE EMISSION TEST WITHOUT REPAIRS THAT COST MORE THAN THE BLUEBOOK VALUE OF THE CAR - WHICH HAS BEEN DEALER MAINTAINED AND GARAGED SINCE PURCHASE. WE BELIEVE THIS BALANCE SHAFT MANUFACTURING FLAW PRESENTS A MAJOR SAFETY ISSUE AND SHOULD BE SUBJECT TO A MANDATORY RECALL AND REPAIRED ENTIRELY AT MERCEDES' EXPENSE.",
        "vin": "WDBTK56F67T"
    }
]