[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/20/2017",
        "dateOfIncident": "02/20/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000247,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WE CURRENTLY HAVE 4-2017 EXPLORERS THAT WERE PLACED IN SERVICE BETWEEN JANUARY 11 AND JANUARY 19, 2017.  MILEAGES RANGE FROM 700 TO 3000 ON THE 4. AFTER OUR DRIVER REPORTING DIZZINESS, HEADACHES AND NAUSEA, THE FIRST VEHICLE WAS TAKEN OUT OF SERVICE ON FEBRUARY 20, 2017.  THIS VEHICLE WAS TAKEN TO FORD FOR DIAGNOSIS ON MARCH 6, 2017 WHERE IT SAT UNTIL MAY 17, 2017 AFTER WE CONDUCTED PRELIMINARY AIR QUALITY TEST SHOWING TVOC'S COMING OUT OF THE VENTS WHEN THE AIR WAS IN RECIRCULATION MODE.  THIS HAPPENED WHETHER THE VEHICLE WAS IDLING, IN CITY DRIVING AND HIGHWAY DRIVING.  THE FORD DEALER COMPLETED ALL OF THEIR DIAGNOSTICS, UPDATED THE HVAC SYSTEM TO THE MOST CURRENT AND STATED THERE WAS NOTHING LEFT TO DO. ON MAY 17TH WE COMPLETED A MORE EXTENSIVE TEST AND SENT THAT TO AN INDEPENDENT LAB.  AT THAT TIME ALL FOUR VEHICLES WERE MOVED TO A GARAGE FOR PASSIVE AIRING OUT AT FORDS DIRECTION.  WE WERE TO LEAVE THEM A MINIMUM OF 10 DAYS AND THEN PLACE CHARCOAL FILTERS AND SILICA PACKS IN THE VEHICLES TO HELP ABSORB FUMES IF ANY WERE LEFT.  WE COMPLETED A NEW AIR QUALITY TEST AND FOUND THAT IT WAS STILL SHOWING TVOC'S BEING PUT OUT OF THE VENTS AND WAS NOW SHOWING CARBON MONOXIDE.  AFTER THESE RESULTS WERE PASSED ON WE  WERE NOTIFIED BY FORD THAT THIS WAS NOT A NEW CAR ISSUE AND THAT IT WAS DEFINITELY A PROBLEM.  WE WERE INSTRUCTED NOT TO DRIVE THE CARS IN RECIRCULATION MODE.  I EXPLAINED THAT UNLESS YOU REMEMBER TO TURN THIS OFF IT IS AUTOMATICALLY ON AND I WAS THEN INSTRUCTED NOT TO ALLOW ANYONE TO DRIVE THEM.  TODAY I RECEIVED AN EMAIL STATING THEY HAVE A \"SOLUTION\".  THE ARE USING TSB 17-0044 WHICH I WILL ATTACH.  I DO NOT BELIEVE THIS WILL FIX THE ISSUE AS MOST OF THE STEPS WERE COMPLETED WHEN IT WAS AT FORD THE FIRST TIME.",
        "vin": "1FM5K7FH9HG"
    }
]