[
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/03/2018",
        "dateOfIncident": "12/03/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11155815,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "3 DASHBOARD LIGHTS APPEAR ILLUMINATED ON DASHBOARD ALL AT ONCE WHILE DRIVING THE CAR, THESE THREE LIGHTS THAT REMAIN ILLUMINATED INCLUDE 1) ANTI-LOCK BRAKE SYSTEM (ABS) LIGHT, 2) VEHICLE STABILITY CONTROL SYSTEM (VSC) LIGHT, AND 3) ELECTRIC POWER STEERING LIGHT.  HONDA DEALER TOLD ME THAT THE ABS MODULATOR NEEDS TO BE REPLACED AND THAT MY CAR WAS NOT UNDER WARRANTY ANYMORE (3YRS OR 36K MILES).   THE QUOTE I RECIEVED TO REPLACE THE ABS MODULATOR FROM THE HONDA DEALERSHIP WAS $1,700.  I DECIDED TO GOOGLE ABS MODULATOR FOR HONDA ACCORD TO SEE IF THERE WERE OTHER ACCORD OWNERS THAT HAVE A SIMILAR ISSUE. UPON SEARCH FROM YOUTUBE AND HONDA FORUMS, I FOUND THERE TO BE OTHER OWNERS THAT HAVE THE SAME PROBLEM WITH 3 LIGHTS ILLUMINATED (ABS, VSC  AND ELECTRIC POWER STEERING) AND THE REPAIR COST IF NOT UNDER WARRANTY CAN RANGE FROM $1,300 TO AS HIGH AS $2,000 FROM WHAT I SAW OTHER HONDA ACCORD OWNERS TO REPORT.    I FEEL AS THOUGH HONDA IS NOT TAKING RESPONSIBILITY TO REPAIR THIS OUTSIDE OF THE WARRANTY AND FEEL AS THOUGH THEY SOLD ME A DYSFUNCTIONAL CAR. I FEEL COMPELLED TO WRITE THIS COMPLAINT BECAUSE MY CAR VALUE IS 10K AND TO REPAIR THE ABS MODULATOR I WOULD HAVE TO FORK UP NEARLY 20% OF MY CARS VALUE FOR AN ELECTRICAL ISSUE THAT WAS PERHAPS FAULTY DESIGN ON HONDAS PART.    THANK YOU FOR TAKING THE TIME TO READ THIS AND I HOPE YOU INVESTIGATE IT FURTHER.",
        "vin": "IHGCR2F38EA"
    }
]