[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/13/2017",
        "dateOfIncident": "07/08/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005078,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS RELATED TO P60 RECALL.  OUR CAR HAS THE SAME ALTERNATOR AS THE 3.6 CARS IN THE RECALL. IT HAD THE VERY SAME PROBLEMS:  WIFE DRIVING DOWN THE HIGHWAY , THE BATTERY LIGHT CAME ON THERE WAS A FEW CHIME SOUNDS, THEN ABS AND TC LIGHTS CAME ON, THEN ALL THE DASH WARNING LIGHTS CAME ON. THE WIFE KNOWS ENOUGH ABOUT CARS THAT SHE HAD TO IMMEDIATELY PULL OVER AND SHUT THE CAR OFF. THEN SMOKE CAME OUT FROM UNDER THE HOOD AND A SMELL OF ELECTRICAL BURNING WAS EVIDENT.  SHE HAD BEEN ON A HIGHWAY DOING 55 MPH.  THE WIFE CALLED ME AND I WENT DOWN THERE. THE FORST THING THAT I NOTICED WAS THERE WAS NOT ANYTHING ELECTRIC WORKING ON THE CAR. AND WORST OF ALL IT WAS STUCK IN PARK AND COULDN'T PUT IT IN NEUTRAL FOR TOWING.  THE TOW TRUCK GUY TRIED TO JUMP IT BUT SOON REALIZED THAT EVERYTHING WAS SHORTED OUT. HE FINALLY TOWED IT TO THE DEALERSHIP. I WAS ABLE TO SEE THE BURN MARKS AND WHERE THE METAL OF THE ALTERNATOR HAD MELTED.  UPON DOING RESEARCH ONLINE I FOUND ABOUT THIS SAME PROBLEM WITH OTHER CHALLENGERS. AND ALSO FOUND THE P60 SAFETY RECALL. THE RECALL LISTED THE SAME EXACT SYMPTOMS THAT WE HAD BUT DIDN'T COVER 5.7 ENGINE CARS. THE ALTERNATOR WAS BURNT(PICTURES ATTACHED) EXACTLY THE SAME AS THE 3.6 ENGINE CARS. THERE WERE A LOT OF POSTS OF THE 5.7 HAVING SAME ISSUE THAT MY CAR HAD. MOST OF THOSE WERE COVERED UNDER THE WARRANTY. OUR CAR WAS OUT OF WARRANTY. IT COST US $988.50 FOR A NEW ALTERNATOR,BATTERY AND LABOR. SINCE THIS SAME PART WAS COVERED UNDER P60 RECALL IT LOOKS LIKE CHRYSLER IS BEING DECEPTIVE ABOUT THE ISSUE. PLEASE INVESTIGATE AND REPLY. PIC OF ALTERNATOR BELOW. REGARDS, GREGORY",
        "vin": "2C3CDXCT0CH"
    }
]