[
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/15/2019",
        "dateOfIncident": "05/15/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220315,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE DAMAGE DUE TO OVERHEATING. REGULAR AND REQUIRED OIL CHANGES ARE DOCUMENTED AND IMPLEMENTED AS SCHEDULED.  NO OTHER ENGINE OR VEHICLE MALFUNCTIONS DURING THE COURSE OF OWNERSHIP, EXCEPT REGULAR OIL CHANGES AND TIRE REPLACEMENT.  HOWEVER, ON MAY 15,  2019, VEHICLE SENSOR NOTIFIED OIL CHANGE NEEDED. FIVE DAYS LATER VEHICLE STALLED AT LOCAL MOTEL DUE TO DECREASED POWER, ROCKING MOTION OF CAR AND LUCKILY WE WERE ABLE TO SLOWLY TURN INTO LOCAL HOTEL TO CUT OFF ENGINE AND GET TO SAFETY. AFTER 2 HOURS OF LETTING VEHICLE SET AND COOL DOWN, LOCAL MECHANIC, CHECKED AND SAID WE HAD ENOUGH OIL IN VEHICLE AND NOT SURE WHAT HAPPENED. WAS ABLE TO DRIVE VEHICLE HOME, WITH NO SENSORS ON DASHBOARD ALERTING US TO ANY FURTHER PROBLEMS.  THREE DAYS LATER, WITH NO VISIBLE SENSORS FLASHING, CAR BEGAN TO EXHIBIT ROCKING MOTION NOT SPUTTERING MOTION AS I BEGAN TO PULL OUT IN FOUR-WAY INTERSECTION, AND APPROACHING TRAFFIC HEADING MY WAY.  THEN SUDDENLY, CAR REGAINED POWER AND WAS ABLE TO CONTINUE TO PROPER LANE AS IF NOTHING WAS WRONG. AFTER TRAVELING ANOTHER 1.6 MILES, CAR JUST STARTING LOSING POWER, CHECK ENGINE, LOW OIL PRESSURE LIGHT, TEMPERATURE LIGHT WARNING ALL APPEARED SUDDENLY.  I WAS ABLE TO DRIFT IN MIDDLE LANE IN FRONT OF DEALERSHIP WHERE VEHICLE WAS PURCHASED.  I IMMEDIATEDLY TURNED VEHICLE OFF AND WALKED TO DEALERSHIP TO GET HELP IN MOVING VEHICLE OFF THE ROAD. AFTER 3DAYS OF WAITING, DUNCAH DEALERSHIP IN CHRISTIANSBURG, VA, NOTIFED US THAT HEAD GASGET WAS CRACKED AND OVER 7,000 REPAIR BILL WAS NEEDED TO FIX ENGINE REPAIR.  AS NOTED BEFORE NO MAJOR PROBLEMS HAS EVER BEEN REPAIRED OR REPLACED REGARDING THIS VEHICLE.  DURING THE TWO INCIDENTS REGARDING THE VEHHICLE LOSING POWER, WITHOUT NO VISIBLE VEHICLE SENSOR NOTIFICATIONS IS OF GREAT CONCERN TO US REGARDING OUR SAFETY IN DRIVING OUR VEHICLE.  THANKFULLY, WE WEREN'T ON A MAJOR HIGHWAY.",
        "vin": "1FMHK8D86BG"
    }
]