[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/19/2017",
        "dateOfIncident": "07/03/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006407,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2015 DODGE ECODIESEL AND IT HAS NOW ACTUALLY SHUT DOWN WHILE DRIVING TWICE, BOTH TIMES PLACING US IN GREAT DANGER. THE FIRST TIME MY HUSBAND WAS DRIVING ON THE HIGHWAY. WE TOOK IT TO THE DEALERSHIP AND THEY HAD TO CALL IN THEIR \"HEAD ENGINEERS\" TO FIGURE OUT THE PROBLEM. AFTER SEVERAL DAYS, THEY FINALLY IDENTIFIED  THAT THE TRUCK NEEDED MANY (I THINK THEY QUOTED AROUND 20) SOFTWARE UPDATES. HOWEVER, WE NEVER GOT NOTICE THAT THE TRUCK NEEDED THESE UPDATES AND/OR THAT IF IT DIDN'T GET THESE UPDATES THAT IT COULD JUST STOP WORKING AT ANY TIME. THE SECOND TIME THAT THIS HAPPENED, I WAS DRIVING THE TRUCK LATER AT NIGHT (AWAY FROM HOME) WITH 2 SMALL CHILDREN IN THE CAR AND THE TRUCK SHUT DOWN BEFORE I WAS ABLE TO FIND SOMEWHERE TO PULL OVER ON A COUNTY ROAD WITH NO SHOULDER. WE RECENTLY HAD A FAMILY KILLED IN COLLIN COUNTY DUE TO A VEHICLE SLOWING AND A DRIVER BEHIND COLLIDING INTO THE VEHICLE AT A HIGH RATE OF SPEED, SO YOU CAN SEE HOW THIS HAS ME EVEN MORE TERRIFIED THAT WE HAVE A VEHICLE THAT DOES THIS WITHOUT OUR CONTROL. I AM APPALLED THAT DODGE IS ABLE TO PUT A VEHICLE ON THE ROAD THAT CAN JUST SHUT DOWN FOR NO GOOD REASON PUTTING PEOPLE IN GRAVE DANGER. THE CHECK ENGINE LIGHT IS NOW ON IN THE TRUCK DESPITE IT SEEMINGLY WORKING OKAY, FOR NOW. WE TOOK IT TO THE DEALERSHIP AGAIN AND THEY ARE NOW SAYING THAT BECAUSE WE ARE SLIGHTLY OVER MILES THAT THE WARRANTY MAY NOT COVER THE FIX TO WHATEVER IS ALL OF THE SUDDEN WRONG WITH A 2 YEAR OLD VEHICLE. AGAIN, HOW IS DODGE ALLOWED TO USE THIS SOFTWARE THAT REQUIRES UPDATES (EVEN THOUGH THEY DO NOT NOTIFY DRIVERS) THAT IS ACTUALLY SHUTTING DOWN VEHICLES? WHAT IS THE SOFTWARE ACTUALLY DOING?I FEEL THAT DODGE SHOULD PROVIDE A GUARANTEE THAT THIS TRUCK WILL NEVER DO THIS AGAIN, BUT I DON'T KNOW HOW THAT IS EVEN POSSIBLE. I WOULD LIKE ANSWERS FROM DODGE ASAP.",
        "vin": "1C6RR7LM5FS"
    }
]