[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "07/17/2017",
        "dateOfIncident": "05/13/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11005851,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY NAVIGATION UNIT HAS BEEN UPDATED AND THE PROBLEM PERSISTS. THE LINES FOR NAV TRAFFIC CANNOT BE EASILY SEEN. THIS WAS FIXED IN 2015 AND 2016 ACURA MDX W/ NAV BUT HAVE NOT BEEN FIXED FOR THE 2014 MDX UNITS. THE TRAFFIC LINES ARE VERY FAINT AND UNREADABLE TO WHERE TOO MUCH TIME IS SPENT TRYING TO SEE TRAFFIC WHILE DRIVING.  THIS WILL RESULT IN ACCIDENTS DUE TO DIVERTED ATTENTION. ACURA/HONDA IS AWARE OF THE PROBLEM SINCE THE 2014 MODEL WAS RELEASED, AND STILL REFUSES TO RELEASE A FIRMWARE UPDATE TO MAKE THE TRAFFIC LINES BETTER VISIBILITY LIKE THEY DID FOR 2015 AND LATER. EVEN MY 2006 RL WAS EASIER TO SEE. WE WERE REAR ENDED NEAR UC DAVIS IN DAVID CALIFORNIA IN MAY 2017. WHILE I WAS ABLE TO ANTICIPATE 70 MPH TRAFFIC MAKING A SUDDEN STOP BECAUSE MY PASSENGER WAS USING NAV TRAFFIC ON THEIR PHONE, AND THEY WARNED ME OF THE TRAFFIC CONGESTION, IF I HAD BEEN LOOKING AT THE NAV UNIT TRYING TO FIGURE IT OUT WHAT TRAFFIC WAS LIKE AHEAD WE WOULD HAVE HIT THE CAR AHEAD OF US TOO INSTEAD OF JUST BEING REAR ENDED. THE OTHER CAR HIT US SO HARD IT WAS TOTALED.  THIS VISUAL ISSUE NEEDS TO BE FIXED EITHER AS A RECALL OR BY AN OPTIONAL UPDATE. THE 2017 NAV DISK UPDATE I TRIED FROM ACURA DID NOT FIX THE ISSUE. THE MDX FORUMS ARE FULL OF THE COMPLAINT FOR THE 2014 MDX WITH NAV, AND PEOPLE ARE QUITE ANGRY ABOUT IT.  ESSENTIALLY WHAT ACURA HAS DONE IS ADD A DISTRACTION ON THE 2014 MDX WITH NAV THEN FIX IT IN THE 2015 AND LATER MODELS BUT NOT FIX IT IN THE 2014.",
        "vin": "5FRYD4H42EB"
    }
]