[
    {
        "components": "AIR BAGS,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/28/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183115,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "RX-8",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  I RECEIVED A CALL REGARDING AN 'ESCALATION' OF MY RECALL AND WHEN I CALLED BACK THE INDIVIDUAL ON THE PHONE SAID THEY COULD NOT FIND MY INFORMATION.  THE LAST TIME I TRIED TO GET MY RX8 REPAIRED I WAS TOLD I HAVE TO DRIVE THE CAR OVER AN HOUR TO THE SHOP TO GET AIRBAG FIXED - THIS IS AFTER I RECEIVED A VERY GRAPHIC POSTCARD SHOWING AND TELLING ME HOW I WILL BE INJURED OR KILLED IF I DON'T GET MY CAR REPAIRED.  I AM TRYING TO GET THIS CAR REPAIRED, HOWEVER I WILL NOT DRIVE THIS CAR OVER AN HOUR IN HEAVY TRAFFIC IN SOUTH TEXAS HEAT AND HUMIDITY IN ORDER TO MAKE THE REQUIRED 100% COMPLIANCE EASY FOR TAKATA  THERE ARE MULTIPLE OTHER RECALLS ON THIS CAR, INCLUDING ON THE ENGINE THAT I HAVE REPLACED  4 TIMES.  DEALERS WERE TOLD TO INSTALL THE OLD ENGINES THAT WERE IN THEIR INVENTORY AND NOT INSTALL THE NEW DESIGN.  THE OLD ENGINES CONTINUED TO LOOSE COMPRESSION OVER TIME AND EVEN THOUGH MAZDA EXTENDED THE WARRANTY TO 100K ON THE VEHICLE, EVENTUALLY I EXCEEDED 100K - AND THE 4TH ENGINE WENT BAD @102K. MAZDA NEVER REPLACED THE ENGINE WITH AN ENGINE THAT DID NOT HAVE COMPRESSION ISSUES.  THE DEALERS USED THE SAME ENGINE AND MAZDA WAITED FOR CONSUMERS TO EXCEED THE 100K MILEAGE AND THEN REFUSED TO PROVIDE ANY FURTHER ASSISTANCE.   I HAVE A BEAUTIFUL RX8 THAT IS BASICALLY A ROLLING CHASIS BECAUSE IT WILL NOT RUN, OVERHEATS THE FUEL SYSTEM (CAN EXPLODE OR CATCH FIRE), AND AIRBAGS THAT CAN INJURE OR KILL ME AT ANY MOMENT.  I CANT EVEN OPEN THE DOOR ON THIS CAR FOR FEAR OF INJURY OR DEATH.  IF THE AIRBAGS WERENT AN ISSUE, I CANT DRIVE THE CAR BECAUSE THE ENGINE LOOSES COMPRESSION AND POWER AND CAN PUT THE DRIVER IN A VERY DANGEROUS SITUATION IN TRAFFIC, AND FINALLY IF ALL ELSE WERE FUNCTIONING, THE EXHAUST CAN OVERHEAT THE FUEL TANK CAUSE EXPLOSION AND/OR FIRE. AT ONE POINT THE INTERIOR OF MY TRUNK MELTED.  MY CAR HAS ZERO VALUE BECAUSE OF MAZDA AND TAKATA.",
        "vin": "JM1FE17N140"
    }
]