[
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/20/2019",
        "dateOfIncident": "11/17/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11281415,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON FREEWAY LESS THAN 35 MPH, CAR MADE LOUD NOISE FOR 1-2 MINUTES AT SAME TIME I FELT UNDER FLOOR BOARD  SOMETHING PULLING. I TRIED TO SLOW DOWN, BRAKES DIDN'T WORK. I REAR ENDED A CAR. THE CAR GEAR SHIFT POPPED INTO REVERSE; I PRESSED HARDER ON  BRAKES & THEY FINALLY WORKED. I NOTICED A BIG LIGHT ON THE DASHBOARD SAYING 'MALFUNCTION, CHECK OWNERS MANUAL' THERE WAS A GRAY SYMBOL NEAR THESE WORDS. INSIDE THE SPEEDOMETER CIRCLE THAT SAME SYMBOL APPEARED IN BRIGHT YELLOW. AT SOME POINT WITHIN AN HOUR 2 MORE YELLOW SYMBOLS APPEARED ON THE FAR LEFT OF THE DASH, A YELLOW TRIANGLE WITH AN EXPLANATION POINT, AND A CAR WITH 2 CURVED LINES BEHIND THE BACK TIRES. WHEN THE CAR WAS RETURNED TO THE DEALERSHIP I PURCHASED IT FROM, THE STAFF IMMEDIATELY ATTEMPTED TO BLAME ME FOR THE INCIDENT'ASKING WHY DIDN'T I BRING THE CAR IN FOR SERVICE? AND THAT I HAVE TO GET A RENTAL CAR AND MY CAR REPAIR THROUGH MY INSURANCE COMPANY. HE PUSHED THE IDEA OF GETTING THE CAR REPAIRED. I STATED I JUST BARELY GOT THE CAR 3-4 WEEKS AGO BRAND NEW. I LEFT THE CAR TO BE CHECKED BY SERVICE DEPARTMENT. THE NEXT DAY THE SERVICE MANAGER DENIED ANY MALFUNCTION SAYING THERE WASN'T ANY CURRENT CODES JUST PAST CODES; I ASKED WHAT THAT MEANT HE SAID A BRAKE SENSOR AND SOME OTHER DATA I DIDN'T COMPREHEND. HE SAID GET MY INSURANCE TO FIX THE CAR. I SAID NO SIR, I WANT MORE INFORMATION ON WHY THE CAR MALFUNCTION FIRST. ONCE I EXPLAIN TO HIM AGAIN WHAT HAPPENED HE SAID HE WOULD HAVE HIS FORMAN CHECK OUT THIS CAR THE NEXT MORNING; HOWEVER LESS THAN AN HOUR THE SERVICE MANAGER ME BACK TO SAY HE TALKED TO A FIELD TECH ENGINEER AND WAS ADVISED THAT I HAD A RIGHT TO CALL NISSAN CORP TO MAKE A REPORT. I WENT BY SRVC DPT TO GET SOMETHING, THEY TRIED TO GET TO TAKE/REPAIR MY CAR. I DIDN'T. ONCE I SPOKE TO NISSAN CORP THEY SAID IT TAKE 6-8 WEEKS FOR INVESTIGATION ETC TO BE COMPLETED AND FOR ME NOT TO GET CAR REPAIRED.",
        "vin": "3N1AB7AP7KY"
    }
]