[
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/14/2017",
        "dateOfIncident": "04/26/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005273,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS VEHICLE FOR MY 18 YEAR OLD DAUGHTER AS A PARENT YOU WANT TO HAVE YOU CHILD AS SAFE AS POSSIBLE.THE VEHICLE IS ANYTHING BUT SAFE. AS A MATTER OF FACT IT'S AN ACCIDENT WAITING TO HAPPEN. OR WORST A FATALITY.THE VEHICLE WHILE DRIVING JUST TURNS OFF. IT WASN'T EVEN A MONTH INTO OWNING THE BRAND NEW VEHICLE THAT ISSUES STARTED TO ARISE. WHILE REVERSING OUT OF A PARKING SPOT, THE VEHICLE STOPPED WITHOUT ANY WARNING.ABOUT 4 WEEKS LATER, WHILE ENTERING THE EXPRESSWAY,ONCE AGAIN THE VEHICLE WITHOUT WARNING COMPLETELY TURN OFF. BY A MIRACLE OF GOD MY DAUGHTER DID NOT GET INTO AN ACCIDENT. A VERY DANGEROUS SITUATION AS MANY OTHER VEHICLES ARE DRIVING AT HIGH SPEEDS. ON 3/31/17 THE VEHICLE WAS TAKE TO THE COLLECTION,WHERE THEY COULD NOT TELL ME EXACTLY WHAT THE PROBLEM WAS SINCE THEY THEMSELVES HAD NO CLUE. BUT THEY DID TELL ME THAT THERE WAS DEFINITELY A PROBLEM SINCE WHEN THEY CONNECTED THE VEHICLE TO THE COMPUTER IT GAVE SPORADIC ERROR CODES. I WAS TOLD THAT AUDI CORPORATE OFFICE WAS CONTACTED AND THEY ADVISED THE COLLECTION TO INSPECT THE FUEL SYSTEM AND HOSE, ELECTRICAL WIRING, AND VEHICLE PROGRAM ALL OF WHICH I WAS TOLD WAS DONE. ON 4/27/17 ANOTHER INCIDENT OCCURRED. WHILE AT A TRAFFIC LIGHT, MAKING A LEFT HAND TURN, THE VEHICLE STOPPED. THE VEHICLE BEHIND MY DAUGHTER WAS ALSO TURNING RIGHT BEHIND HER AND ALMOST REAR ENDED HER SINCE EVEN THE BRAKE LIGHTS WERE NOT WORKING T. IN THE MIDDLE OF THE TRAFFIC INTERSECTION, THE VEHICLE WAS NOT RESPONDING TO THE SHIFTING OF GEARS OR TO THE ACCELERATOR. AT THIS POINT THAT VEHICLE WAS NOT RESPONDING AT ALL LEAVING MY DAUGHTER STRANDED IN THE MIDDLE OF ONCOMING CARS AND AGITATED DRIVERS AROUND HER. THE COLLECTION HAD THE VEHICLE TOWED BACK TO THEIR SHOP WHERE IT HAS BEEN EVER SINCE. NO ONE, NOT EVEN AUDI'S CORPORATE HEAD ENGINEER HAS BEEN ABLE TO FIGURE OUT WHAT IS WRONG WITH THE VEHICLE.",
        "vin": "WAUAUGFFXH1"
    }
]