[
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/28/2017",
        "dateOfIncident": "12/01/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001849,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2013 NISSAN PATHFINDER AND THE SUN VISORS HAVE AN ISSUE WHERE THEY DO NOT STAY UP. THIS IS A COMMON ISSUE WITH THIS VEHICLE AS IF YOU GOOGLE IT, THERE ARE MULTIPLE THREADS DESCRIBING THE ISSUE. THIS IS A HUGE SAFETY ISSUE AS THE SUN VISOR ON THE DRIVER'S SIDE BLOCKS YOUR VISIBILITY. ADDITIONALLY, IT MAKES A LOUD CRACKING SOUND ANYTIME YOU OPEN OR CLOSE IT. I CONTACTED NISSAN LAST YEAR IN 2016 AND THEY BASICALLY SAID, \"OH WELL. YOU ARE OUT OF WARRANTY.\" THE ISSUE WITH MY VEHICLE IS A KNOWN ISSUE AND IS ALSO A SAFETY CONCERN. I CAN BE DRIVING MY VEHICLE ON THE HIGHWAY AND THE SUN VISOR WILL SUDDENLY FALL DOWN AND BLOCK MY VIEW. WHEN I CONTACTED NISSAN LAST YEAR, MY VEHICLE WAS NOT EVEN A YEAR OUT OF WARRANTY. I HAD NOTICED THE ISSUE WITH THE SUN VISORS FOR A WHILE, BUT DID NOT TAKE THE VEHICLE IN PREVIOUSLY DUE TO PERSONAL ISSUES GOING ON (I WAS IN THE MIDDLE OF A SEPARATION AND DIVORCE). THE DRIVER'S SIDE SUN VISOR IS HANGING SO LOW NOW THAT I HAVE TO PUSH TO THE LEFT SIDE OF MY VEHICLE IN FRONT OF THE WINDOW SO I CAN SEE WHEN I DRIVE. I HAVE INCLUDED SOME PICTURES SO YOU CAN SEE WHERE THE SUN VISOR IS SITTING ON A PERMANENT BASIS. EVEN IF I PUSH IT UP, IT FALLS BACK TO THIS POSITION. YOU CAN SEE FROM THE FINAL PICTURE THAT IS BASICALLY AT MY EYE LEVEL. I CAN UNDERSTAND NISSAN NOT WANTING TO REPLACE BOTH SUN VISORS, BUT THE DRIVER'S SIDE VISOR IS A HUGE SAFETY CONCERN. AT $250 A PIECE, I CAN'T REALLY AFFORD TO SPEND $500 TO HAVE THEM BOTH REPAIRED. I HAVE 2 SMALL CHILDREN AND I'M EXTREMELY CONCERNED FOR THEIR SAFETY AND MINE WHILE OPERATING THE VEHICLE.",
        "vin": "5N1AR2MN5DC"
    }
]