[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/27/2017",
        "dateOfIncident": "06/22/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001701,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE APPROACHING AN INTERSECTION IN A BUSY AREA OF SAN DIEGO COUNTY, THE BRAKES FAILED ON MY NISSAN LEAF.  THE BRAKE SHUDDERED UNDER MY FOOT, MUCH LIKE ANTI-LOCK BRAKES DO WHEN THEY'RE ENGAGED.  AFTER I FELT THE SHUDDERING, THE BRAKE PEDAL WENT DOWN BUT THE VEHICLE DID NOT DECELERATE AS IT NORMALLY WOULD IN RESPONSE TO BRAKING.  I TRIED THE BRAKE PEDAL A FEW TIMES WITH NO RESPONSE, BUT THE VEHICLE'S MOMENTUM SLOWED ENOUGH FOR ME TO AVOID A COLLISION AND CONTINUE ON THE ROAD.      AS I CAME TO A SECOND INTERSECTION, I AGAIN TRIED THE BRAKES AND THE VEHICLE DID NOT RESPOND.  I USED THE EMERGENCY BRAKE TO STOP THE LEAF AT THE INTERSECTION.      I LOCATED AN UPHILL DRIVEWAY TO A CORPORATE PARKING LOCATION, AND DROVE THE VEHICLE VERY SLOWLY TO A PARKING SPOT. I INTENDED TO PARK THE CAR AND CALL A TOWING SERVICE, BUT WHEN I ONCE AGAIN TRIED THE BRAKE PEDAL THE NISSAN LEAF RESPONDED TO THE BRAKES AND STOPPED IN THE PARKING SPOT.      BECAUSE I WAS CLOSE TO WORK AND THE BRAKES HAD RE-ENGAGED, I DROVE THE VEHICLE TO THE PARKING LOT AT MY OFFICE AND LATER THAT DAY CALLED NISSAN'S CONSUMER AFFAIRS LINE FOR THE LEAF (877-664-2738).  I REPORTED THE ISSUE TO NISSAN, AND THEY HAD THE VEHICLE TOWED TO A NEARBY NISSAN DEALERSHIP.      AT THIS POINT IN TIME, NISSAN IS WORKING WITH MOSSY NISSAN IN POWAY, CA TO TRY TO DIAGNOSE THE PROBLEM.  NISSAN OPENED CASE #27170321 ON THE ISSUE.      THIS IS A FAIRLY NEW VEHICLE (BOUGHT IN SEPTEMBER 2016), AND I DON'T THINK THERE ARE ANY PHYSICAL PROBLEMS WITH THE BRAKE PADS OR MECHANISM.  MY BEST GUESS IS THAT AN ELECTRIC/CONTROLLER FAILURE OCCURRED WITH REGENERATIVE BRAKING.",
        "vin": "1N4AZ0CP0GC"
    }
]