[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/27/2017",
        "dateOfIncident": "03/23/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001813,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M A FRUSTRATED CUSTOMER WITH A 2015 CHEVY SUBURBAN LOOKING FOR SOME ASSISTANCE WITH THE AIR CONDENSER ON MY VEHICLE. I HAVE GONE ALMOST 2.5 MONTHS WITHOUT A/C AND I AM INCREDIBLY DISAPPOINTED TO BE HAVE BEEN GOING SO LONG WITHOUT SOMETHING AS BASIC AS A/C. I HAVE 3 SMALL CHILDREN AND IT'S INCREDIBLY UNCOMFORTABLE IN THE VEHICLE NOW THAT IT'S SUMMER TEMPERATURES ESPECIALLY WITH BLACK LEATHER INTERIOR. ON AN UNEXPECTEDLY COOL DAY LIKE TODAY WITH OUTDOOR TEMPS AT 67 THE DRIVERSIDE FOOT AREA IS 98 DEGREES BECAUSE OF HOT AIR BLOWING WHICH I ASSUME COMES FROM THE ENGINE. I SHUT OFF ALL THE VENTS AND FANS AND IT STILL BLOWS. ON DAYS WHEN IT'S WARMER THAT FLOOR TEMP IS MORE LIKE 114-118 DEGREES AND IT'S CAUSING PAIN AND BURNING SENSATION TO MY FEET. I'VE CONTACTED MY DEALERSHIP AND THEY OFFERED ME TO END MY LEASE EARLY AND GET INTO A NEW SUBURBAN.  I'VE BEEN SO DISAPPOINTED WITH THE WAY THIS HAS BEEN HANDLED. I HAVE NEVER BEEN SO UNSATISFIED AS CUSTOMER FOR SUCH A LONG PERIOD OF TIME.  I FEEL LIKE I SHOULD BE REIMBURSED FOR THE TWO VISITS FOR DIAGNOSTICS ON THE VEHICLE TO FIND OUT WHY THE A/C WASN'T WORKING AND THE RENTAL CAR I NEEDED. I ALSO FEEL LIKE I SHOULDN'T HAVE TO BE PAYING MY LEASE PAYMENTS FOR A FAULTY VEHICLE FOR THE LAST FEW MONTHS THAT IT HASN'T BEEN FUNCTIONING PROPERLY. LASTLY, I WOULD LIKE THE OPTION OF ENDING MY LEASE EARLY WITHOUT PENALTY TO GET INTO A MORE COMFORTABLE VEHICLE OF MY CHOICE. I'VE CONTACTED GM CUSTOMER SERVICE ONLY TO BE TOLD THERE'S NOTHING THEY CAN DO UNLESS GM DECIDES THAT THIS SHOULD BE A RECALL. FRANKLY, THIS IS A PROBLEM AMONGST MANY VEHICLES IN THE GM LINE. THIS IS FRUSTRATING AND IS REALLY BECOMING A SAFETY ISSUE AS TEMPERATURES RISE. I AM GENUINELY CONCERNED FOR MY FAMILY'S SAFETY AND I AM FRUSTRATED WITH THE OVERALL LACK OF URGENCY ON THIS ISSUE.",
        "vin": "1GNSKKKC4FR"
    }
]