[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/27/2017",
        "dateOfIncident": "06/26/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001782,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN APPROACHING A STOP SIGN IN A ROUTINELY DRIVEN RESIDENTIAL NEIGHBORHOOD AT LOW SPEED WITH THE CAR IN DRIVE GEAR AND CLEAR WEATHER, SOMETIMES THE BRAKE PEDAL SLIPS PART WAY OR ALL THE WAY TO THE FLOOR ALLOWING THE CAR TO ROLL INTO THE INTERSECTION BEFORE STOPPING.  THE PEDAL HAS SLIPPED REPEATEDLY WITHIN 2 HOURS WHEN DRIVING IN URBAN, RUSH HOUR, STOP AND GO TRAFFIC.  IT HAS ALSO SLIPPED TO THE FLOOR AT 70 MPH ON AN INTERSTATE HIGHWAY WHEN THE VEHICLE WAS DECELERATING ON A DRY SURFACE.   PUMPING THE BRAKE PEDAL A FEW TIMES ENGAGES THE BRAKES.  I HAVE TAKEN THE CAR TO THE DEALER TO CORRECT THE ISSUE 4 TIMES AND TO ANOTHER DEALER 1 TIME FOR A 2ND OPINION WITH THE SAME RESULT ON EACH VISIT, 'COULD NOT DUPLICATE.'  THE 4TH REPAIR VISIT INVOICE SHOWS 'LOSES VACUUM WHEN BRAKES CONTINUOUSLY APPLIED AT IDLE.' ON THE 5TH VISIT I ASKED FOR THE VACUUM TO BE RESTORED TO PROPER FUNCTION. THEY SAID THERE WAS NO VACUUM LEAK OR RECORD OF A CODE THAT WOULD INDICATE LOSS OF VACUUM, AND THEY COULD NOT DUPLICATE.  I CANNOT DUPLICATE IT EITHER OR PREDICT WHEN THE PEDAL WILL SLIP.  IT HAPPENS SPORADICALLY.  AS SUGGESTED BY A SERVICE ADVISOR, I CALLED THE TOYOTA 800 NUMBER.  I SPOKE WITH A REPRESENTATIVE ON 12-15-16.  I TOLD HER MY EXPERIENCE WITH THE BRAKE ISSUE AND MY REQUESTS FOR REPAIR WITH UNSATISFACTORY RESULTS.  SHE SAID SHE WOULD CALL THE DEALERSHIP AND GET BACK TO ME.  ON 12-16-16, SHE REPORTED THE DEALER SAID THEY COULD NOT DUPLICATE, SO NOTHING COULD BE DONE.  SHE ASKED ME WHAT I WANTED.  I REPLIED THAT I WANTED THE BRAKES TO WORK PROPERLY.  SAFETY IS AT RISK FOR ME AND PASSENGERS AT ANY SPEED.  AT HIGHWAY SPEEDS, IT IS EXTREMELY DANGEROUS.",
        "vin": "JTMNFREV6GJ"
    }
]