[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/10/2017",
        "dateOfIncident": "04/01/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004014,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE SHORTLY AFTER PURCHASING THE VEHICLE IT BEGAN HAVING ISSUES WITH THE TRANSMISSION.  THEY INCLUDED UNCONTROLLED ACCELERATION, DECELERATION, ROUGH SHIFTING, TRANSMISSION AND FLUID LEAKS.    THE VEHICLE HAS BEEN IN THE SHOP MULTIPLE TIMES FROM 1 DAY TO OVER 90 DAYS AT A TIME.  SEVERAL REPAIRS TOOK 5-7 WEEKS.  INITIALLY THE FORD DEALERSHIP AND FORD MOTOR CO. COVERED THE REPAIRS AND PROVIDED A RENTAL CAR ON TWO OCCASIONS.  THE ISSUE HAS NOT BEEN FULLY RESOLVED AS THE VEHICLE HAS BEEN IN THE FORD SHOP SINCE APRIL 1, 2017 WHILE IT WAS BEING DIAGNOSED AND I TRIED TO DISCUSS THE ISSUES WITH FORD SINCE THEY REFUSED TO COVER THE REPAIRS.    FORD DENIED OUR CLAIM TO REPLACE THE VEHICLE WITH LESS THAN 25,000 MILES ON THE VEHICLE UNDER THE CALIFORNIA \"LEMON LAW\" STATUTES.    THE ISSUES HAVE NEARLY CAUSED SEVERAL ACCIDENTS AND THE VEHICLE HAD TO BE TOWED TO THE SHOP AT ONE POINT AS I FELT IT WAS UNSAFE TO DRIVE.  THE UNCONTROLLED ACCELERATION AND DECELERATION USUALLY TOOK PLACE AT FREEWAY SPEEDS OF 55-70 MPH.  THE ROUGH SHIFTING WAS COMMONLY DURING A FIRST START OR WHEN APPROACHING OR PULLING AWAY FROM A STOP AT AN INTERSECTION.  IT WOULD SHIFT ROUGH AT SPEEDS 20-35 ON RESIDENTIAL ROADWAYS.  THE LEAKS WERE TYPICALLY DISCOVERED AFTER FREEWAY DRIVING.       I HAVE NUMEROUS DOCUMENTS AND THE SYSTEM WOULD NOT ACCEPT THEM ALL SO I UPLOADED A FEW AS SAMPLES.  THE VEHICLE HAS BEEN IN THE SHOP SINCE APRIL 1, 2017 SO I DO NOT HAVE THE DOCUMENTS SHOWING THE CURRENT ISSUES.     FORD HAS BEEN DIFFICULT TO WORK WITH AND HAS REFUSED TO COVER ANY REPAIRS.  FORD MOTOR COMPANY INFORMED ME THAT THEY \"SELF REPORT\" CLAIMS LIKE THIS TO NHTSA AND PROVIDE NHTSA WITH MY CONTACT INFORMATION.  THEY ALSO TOLD ME MY ONLY OPTIONS WOULD BE TO FILE A LAWSUIT AGAINST FORD OR REPORT THE ISSUE TO NHTSA AS A SAFETY CONCERN.  I BELIEVE THIS VEHICLE HAS AN INHERENT DEFECT THAT IS A SERIOUS SAFETY ISSUE.",
        "vin": "1FMCU0GX3EU"
    }
]