[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/16/2021",
        "dateOfIncident": "11/16/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440715,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "This is regard to 2020 RAV4 XLE with 7,000 mileage battery dead issues twice due to software issue based on Toyota dealership reports.   I do drive my car daily and car not sat in garage more than 2 days!  On evening of July 24th I wan’t able to turn on the vehicle. It was totally dead. Had to request road assistance for jump then took  the car to Toyota Sunnyvale for check. They mentioned the issue was the battery and then having hard time with them to replace it with a new one. They Assured and Confirmed with me couple of times on the phone and at the Service Center this issue will never ever happen again. I was told it was a software issue that was consuming the battery and company fixed the software and they updated on my car and it won’t  happen again for sure.  Morning of November 16th while was heading to work same story repeated again. Faced with a totally dead vehicle, called again for road assistance for a jump and car is now sitting at Toyota Sunnyvale Service Center for analysis.  I cannot trust to Toyota Service Centers any more and now I cannot relay on my vehicle. I look forward for a reasonable response from Toyota Motor Corporation.  Why customer has to face with dead battery, ask roadside assistance and visit the dealership to identify the problem? What if I was out of town or in situations that cannot get roadside assistance? Why if this software issue it was not  software recall and customers was not informed? Why this issue happened twice? What guarantees this will never happen again?",
        "vin": "2T3W1RFV4LW"
    }
]