[
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "06/21/2017",
        "dateOfIncident": "07/19/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000496,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS PULLING IN A PARKING SPACE AT THE BACK OF THE BUILDING IN WHICH I WORKED. I TURNED RIGHT INTO MY SPACE GOING ABOUT IDLE SPEED.  I TOOK MY FOOT OFF THE BRAKE TO   MOVE INTO THE SPACE WHEN IT TOOK OFF AND WENT INTO THE BUILDING.  I MISSED THE SENSOR BY A QUARTER OF AN INCH AND THE AIR BAGS DID NOT DEPLORE.  I HAD THE BLACK BOX READ BY TOYOTA AND THEN THEY NEVER CALLED ME BACK TO EXPLAIN THE \"BOOK\" OF PAPERS THAT GAVE ALL SORTS OF INFORMATION WHICH I REALLY DON'T UNDERSTAND.  AFTER ABOUT TWO OR THREE MONTHS IT HAPPENED AGAIN WHEN MY HUSBAND WAS DRIVING AND CAME TO A FOUR WAY STOP ON A CITY STREET.  WHEN IT LET UP OFF THE BRAKE THE CAR TOOK OFF AND SINCE HE HAD ABOUT A HALF MILE OF STREET  HE LET IT GO.  IT TOOK HIM AT 40 MPH FOR THE WHOLE WAY.  HE HAD TROUBLE WHEN HE HIT THE BRAKE TO MAKE IT STOP.  HE HAD TO PUMP THEM SEVERAL TIMES.  THIS CAR HAD DONE THIS 7 OR 8 TIMES TO US.  WE TALKED TO THE DEALERSHIP AND BECAUSE IT WAS LEASED THEY COULDN'T HELP.  SO WE HAVE KEPT   THE CAR AND I DRIVE IT  WITH MY HAND ON THE GEAR SHIFT AND WHEN PULLING INTO PARKING SPACES I KEEP MY FOOT ON THE BREAK AND SOMETIMES PUT IT INTO NEUTRAL.  I FEEL THIS CAR IS VERY DEFECTIVE.  TOYOTA HAS READ THE BLACK BOX TWICE AND NEVER GOT BACK TO US TO EXPLAIN IF THEY KNOW WHY THIS DOES THIS THE CRASH CAUSED 8000 TO THE CAR AND 16000 TO THE BUILDNG",
        "vin": "2T3DFREV9FW"
    }
]