[
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/06/2017",
        "dateOfIncident": "06/22/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003273,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FUSION",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS CAR ON 8/31/16 AND ON 11/28/16 THE DREADED DEAD BATTERY PROBLEMS STARTED. I TOOK IN IT, THEY REPLACED THE BATTERY ON 11/28 SAID THAT IT WAS PROBABLY JUST A FAULTY BATTERY FROM THE MANUFACTURE AND THAT IT HAPPENS, RARELY BUT IT HAPPENS. ON 12/31/17 I WENT TO START MY CAR AND IT AGAIN WOULD NOT START. EACH TIME THAT THIS HAS HAPPENED, I HAVE TO MANUALLY UNLOCK MY CAR BY TAKING OFF A PIECE OF THE DOOR HANDLE TO EXPOSE THE KEY HOLE AND THE DOME LIGHTS OR DASH LIGHTS DO NOT COME ON, THAT'S MY DEAD GIVEAWAY THAT IT WONT START. WHEN I TOOK IT TO THE SHOP THIS TIME THEY INFORMED ME THAT THE CAR WAS MANUFACTURED ON 8/1/16 AND SAT TOO LONG WITHOUT BEING DRIVEN SO IT CAUSED THE BATTERY TO MESS UP(EVEN THOUGH I HAD THE BATTERY REPLACED A MONTH EARLIER, AND DRIVE EVERY SINGLE DAY TO WORK). I GOT THE CAR BACK AND I BET YOU CANT GUESS WHAT HAPPENED ON 2/4/17... MY CAR WAS DEAD. WOULDN'T START, WOULDN'T UNLOCK... DEAD. THIS TIME THEY WE'RE \"99.9% SURE\" THEY FIXED THE PROBLEM BY UPDATING MY POWER TRAIN CONTROL MODULE. THEY HADN'T, IT DIED AGAIN ON 5/22/17. WHEN I TOOK IT IN, THEY UPDATED THE POWERTRAIN CONTROL MODULE AND SENT ME ON MY WAY, SO I'M JUST WAITING FOR IT TO DIE AGAIN HONESTLY.  THEN... I TOLD THEM MY TRANSMISSION IS SLIPPING ON 5/22/17- THEY IGNORED IT WHEN DOING UPDATES AND IT WASN'T RESOLVED. ON 6/13/17 I TOOK IT IN BECAUSE THE TRANSMISSION WAS STILL SLIPPING SO THEY UPDATED THE POWERTRAIN CONTROL MODULE AGAIN... DIDN'T FIX IT(OBVIOUSLY) AND THEN ON 6/22/17 I TOOK IT IN BECAUSE I ALMOST GOT INTO AN ACCIDENT DUE TO THE TRANSMISSION SLIPPING AND SLIDING MY CAR INTO ONCOMING TRAFFIC TRYING TO SHIRT GEARS(ITS AUTOMATIC) AND THEY REPLACED A PRESSURE VALVE, NOT SURE WHY YOU WOULD NEED TO REPLACE A PART LIKE THAT ON A BRAND NEW CAR ANYWAY, BUT THE TRANSMISSION STILL ACTS UP.",
        "vin": "3FA6POG75HR"
    }
]