[
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "07/19/2017",
        "dateOfIncident": "06/01/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006448,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CR-V",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CR-V LX 3.2L  CVT TRANSMISSION14,000 MILES      I SWITCHED FROM A 2007 TOYOTA RAV4 TO A 2015 HONDA CR-V, NEVER CONSIDERING THAT I'D DEEPLY REGRET THE DECISION AND BE PINING FOR MY OLD RAV SEATS, WHICH WERE QUITE COMFORTABLE. SADLY, I DIDN'T DISCOVER THE PROBLEM WITH THESE INCREDIBLY UNCOMFORTABLE SEATS UNTIL I'D ALREADY PURCHASED THE CAR FROM A PRIVATE SELLER. NOW I SUSPECT THAT THE LOW MILEAGE HAD TO DO WITH THE UNCOMFORTABLE SEATS.    THERE IS ZERO LUMBAR SUPPORT OR MEANINGFUL ADJUSTMENT ON THE PASSENGER FRONT SEAT SO IT'S TRULY LIKE SITTING IN A TORTURE DEVICE. AFTER 15-20 MINS OF DRIVING MY LOWER BACK STARTS TO SCREAM, MY BUTT GOES NUMB AND I EXPERIENCE TINGLING AND NUMBNESS IN MY LEG. AFTER 30-60 MINUTES OF DRIVING DEVELOP A SHARP PAIN IN MY THORACIC REGION.    I'VE ATTEMPTED NUMEROUS WORK-AROUNDS IN ORDER TO MAKE A 13-HOUR CAR DRIVE, WHICH I WAS DREADING BECAUSE OF THE PROBLEMS I WAS EXPERIENCING WITH THE SEATS--JUST DRIVING AROUND TOWN. THE THOUGHT OF FACING AN ENTIRE DAY IN THE HONDA SEEMED LIKE A TORMENT.    I PUT A FULL-SEAT PAD OF FOAM UNDER A SHEEPSKIN SEAT COVER. RESULT: SOFTER BUT STILL CAUSING BACK PAIN. THEN, I PUT A MEMORY-FOAM SEAT ON TOP OF THE SHEEPSKIN COVER AND INSERTED A SMALL INFLATABLE LUMBAR SUPPORT FROM RELAX THE BACK UNDER MY LUMBAR AREA. WITH ENOUGH TWEAKING OF THIS ARRANGEMENT, I'M ABLE TO DRIVE WITHOUT TOO MUCH MISERY, BUT I'M FURIOUS THAT I'VE HAD TO DO THIS MUCH JERRY-RIGGING ON A $30K CAR.    FROM ALL THE OTHER COMPLAINTS I'VE DISCOVERED, ONLINE, ONE WOULD THINK THAT HONDA WOULD HAVE THE GOOD SENSE AND COMMON DECENCY TO CORRECT THE MYRIAD PROBLEMS WITH THEIR SEATS, BUT APPARENTLY THEY'RE CONTENT TO HAVE US OWNERS ROLLING DOWN THE ROAD, WRITHING IN PAIN.",
        "vin": "2HKRM3H50FH"
    }
]