[
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/20/2021",
        "dateOfIncident": "07/31/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433615,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "My Kia Soul's engine failed when we were exiting the highway. The car started making awful grinding sounds and went into \"limp mode.\" When I tried to restart the vehicle, the oil lamp and check engine lamp illuminated. The car had shown NO issues the entire day and I had put oil in it earlier that morning because I noticed it was low (I try to check the oil every time I get gas).   I had my partner and our dogs in the car with us and had to walk down the highway to the gas station to call somebody since we didn't have service. It was also 110 degrees outside, so the car failing put us in a pretty dangerous situation.    We had JUST gotten the recall notice for the vehicle's engine a week before (it looked like it had gotten lost in the mail) and had called around to the Kia Dealerships in the area and none could see us for over a month, which was a problem because we were going to be moving back to the PNW from Death Valley (we had to relocate because I was laid off due to COVID) in less than a month. The closest dealerships were also 100+ miles away.   We towed the car with us to WA and got it into a dealership ASAP and they confirmed that the engine had a knock, but Kia refused to fix the issue, stating that because the Knock Sensor Detection Software hadn't been installed, it was not under warranty.    The car got serviced at least once every 4 months (I have service records), and I would check and fill the engine oil regularly because the car would burn through it like crazy.",
        "vin": "KNDJP3A54G7"
    }
]