[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/27/2017",
        "dateOfIncident": "06/17/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 12,
        "odiNumber": 11001604,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 VOLKSWAGEN TOUAREG. THE CONTACT STATED THAT WHILE DRIVING THE VEHICLE FOR AN EXTENDED PERIOD, THE CONTACT BECAME ILL. THE CONTACT STATED THAT THE FAMILY MEMBERS WHO ALSO RODE IN THE VEHICLE BECAME ILL. THE CONTACT STATED THAT HIS SEVEN YEAR OLD SON BECAME UNCONSCIOUS. THE CONTACT STATED THAT HE AND HIS SEVEN YEAR OLD SON SUFFERED EXTENSIVELY FROM CARBON MONOXIDE POISONING WHICH REQUIRED MEDICAL ATTENTION. THE CONTACT WAS INFORMED THAT HE HAD SUFFERED FROM THE MEDICAL CONDITION KNOWN AS THE BENDS, DUE TO THE CARBON MONOXIDE POISONING. THE CONTACT STATED THAT TEN OTHER PASSENGERS WHO RODE IN THE VEHICLE OVER TIME ALSO BECAME ILL. THE VEHICLE WAS TAKEN TO THE DEALER TO BE DIAGNOSED AT MAROONE VOLKSWAGEN LOCATED AT: 2401 N. FEDERAL HIGHWAY, DELRAY BEACH, FL 33483, TEL: (561)243-4600. THE CONTACT WAS INFORMED OF AN EXHAUST LEAK WHICH EMITTED FROM THE TURBO CHARGER LOCATED IN THE ENGINE COMPARTMENT, WHICH ALLOWED EXHAUST FUMES TO ENTER THE CABIN OF THE VEHICLE. THE CONTACT STATED THAT THE VEHICLE WAS REPAIRED THEN AND ON FOUR OTHER OCCASIONS HOWEVER, THE REPAIRS FAILED TO REMEDY THE ISSUE. THE CONTACT FILED A POLICE REPORT AND ALSO REPORTED THE ISSUE TO THE EPA. THE CONTACT WAS PROVIDED POLICE REPORT NUMBER: 11-008915. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE CONTACT STATED THAT THE MANUFACTURER OFFER TO BUY THE VEHICLE BACK FOR CONSIDERABLY LESS THAN THE VEHICLE WAS WORTH. THE CONTACT DECLINED THE OFFER. THE APPROXIMATE FAILURE MILEAGE WAS 1,700.  *TR  CONUMER STATED THIS CAR WAS TAKEN OFF THE ROAD JAN 2010, CAR IS PAID IN FULL. BANK ACCOUNT XXX-XXXXXXXXXXX STATEMENT AND POLYGRAPH DOCUMENTS ATTACHED.    'PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'*JB",
        "vin": "WVGPT77L07D"
    }
]