[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/07/2017",
        "dateOfIncident": "07/05/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013315,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE HYBRID",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS APPROACHING A T-INTERSECTION AND ATTEMPTED TO MAKE A STOP AT THE STOP SIGN, BUT THE BRAKE PEDAL RESISTED MY FOOT PRESSURE AND I COULD NOT GET THE VEHICLE TO SLOW DOWN. I MANAGED TO MANEUVER THROUGH THE INTERSECTION WITHOUT FURTHER INCIDENT AND SPOTTED A SAFE PLACE TO PULL OVER TO GATHER MY THOUGHTS. THE BRAKE PEDAL AGAIN FAILED TO WORK WHEN I ATTEMPTED TO PULL OVER, BUT I USED THE EMERGENCY BRAKE TO STOP THE VEHICLE.. ONLY, THIS TIME THE BRAKE PEDAL WENT ALL THE WAY TO THE FLOOD, WITH NO BRAKING EFFECT TO THE VEHICLE. THIS TIME, UNLIKE THE FIRST, 2 BRAKE WARNING INDICATORS (ABS & BRAKES!) ILLUMINATED ON THE DRIVER'S CONSOLE.    I TURNED OFF THE VEHICLE AND RESTARTED IT, AND THE INDICATORS HAD DISAPPEARED AND THE BRAKE PEDAL HAD NORMAL RESISTANCE TO MY FOOT PRESSURE AND THE BRAKES WORKED NORMALLY.    I CALLED A LOCAL FORD DEALERSHIP AND THEY DESCRIBED THE PROBLEM AS A 'GLITCH', AND SAID IT WAS MOST LIKELY A SENSOR OR SOME OTHER COMPUTER MALFUNCTION, BUT THAT NO WORK DONE TO CORRECT THE PROBLEM WOULD BE COVERED SINCE THE VEHICLE IS OUT OF WARRANTY. WANTING MORE INFORMATION, I LOCATED A VIDEO ON YOUTUBE.COM THAT SHOWS ANOTHER VEHICLE WITH THE SAME PROBLEM. THE VIDEO IS SEARCHABLE AND IS FOUND UNDER THE TITLE OF 'FORD ESCAPE HYBRID BRAKE PROBLEM'.    I SEARCHED FOR ANY RECALLS FOR THIS SAME VEHICLE'S VIN, BUT FOUND NONE LISTED.     WHAT CAN BE DONE ON BEHALF OF THE CONSUMER, ESPECIALLY IF THOSE VIDEO COST ESTIMATIONS ARE CORRECT?",
        "vin": "1FMYU96H16K"
    }
]