[
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/16/2020",
        "dateOfIncident": "12/02/2020",
        "fire": false,
        "manufacturer": "Entegra Coach",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383615,
        "products": [
            {
                "manufacturer": "Entegra Coach",
                "productMake": "ENTEGRA",
                "productModel": "CORNERSTONE",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE OWNED BOTH A 2019 AND THE NEW 2021 ENTEGRA CORNERSTONE MOTOR HOMES.  ON BOTH MOTOR HOMES, THE DIESEL EXHAUST FLUID (DEF) SENSOR HAVE FAILED IN LESS THAT 2,000 MILES. WHEN DEF SENSORS FAIL THE ENGINE CAN GO INTO DERATE WHICH IS 5 MPH IN LESS THAT A COUPLE HUNDRED MILES. THIS PROBLEM IS LEAVING MANY LARGE DIESEL ENGINE OWNED VEHICLES STRANDED, FROM MOTOR HOMES TO LARGE OVER THE ROAD TRUCKS.  I HAVE CONTACTED SPARTAN MOTORS THE MANUFACTURE OF THE CHASSIS, WHICH REFERRED ME TO SHAW DEVELOPMENT, THE MANUFACTURE OF THE DEF SENSOR.  SHAW DEVELOPMENT REFUSES TO TAKE CALLS OR EMAILS REQUESTING INFORMATION REGARDING THIS PROBLEM.  THE DEF SENSORS WAS A REGULATION PASSED BY EPA IN 2016, STATING THE DEF CONCENTRATION BE MEASURED IN THE DEF TANKS OF VEHICLES.  HOWEVER THE DEF SENSOR MANUFACTURES CANNOT SEEMS TO MANUFACTURE A PART THAT WILL WORK AND NOT PUT ENGINE INTO DERATE.  SHAW DEVELOPMENT IS CURRENTLY AT THE SIXTH GENERATION OF THE DEF SENSOR WHICH ARE STILL FAILING ON BRAND NOW 2021 YEAR MOTOR HOMES.  THAT IS SIX ATTEMPTS TO MAKE A PART THAT CONTINUES TO LEAVE PEOPLE ON LONG TRIPS STRANDED.  WITH ALL OF THE CONTACTS I HAVE MADE REGARDING THIS PROBLEM, NOTHING IS BEING DONE EXCEPT PASSING THE BUCK.  THIS LINK IS A SMALL SAMPLE OF WHAT USERS HAVE BEEN FACING WITH THIS PROBLEM.  MANY POSTS LIKE THIS ARE ALL OVER THE INTERNET.  HTTPS://WWW.IRV2.COM/FORUMS/F278/MORE-ON-THE-DEF-SENSORS-PER-CUMMINS-516724.HTML  THE PHOTO SHOWS THE DEF UNITS THAT HAVE TO BE REPLACED AT CUMMINS DIESEL ENGINE SHOPS.  THIS IS A MAJOR PROBLEM WITH ALL DIESEL ENGINES. EPA REQUIREMENTS THAT THE CHASSIS MANUFACTURES CANNOT MEET LEAVING THE OWNERS STRANDED. THE DEF SENSOR BY SHAW DEVELOPMENT BEING PURCHASED BY SPARTAN MOTORS CHASSIS, INC ARE NOW ON THE SIXTH EDITION WITH THE FAILURE RATE CONTINUING.  MY REPAIR DATE WITH CUMMINS SERVICE IN FT MYERS FL WAS DEC 2, 2020 AND A NEW 2021 MODEL MOTOR HOME.*DT*JB*DT*TR",
        "vin": "4VZVU1E97MC"
    }
]