[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/28/2017",
        "dateOfIncident": "06/10/2017",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001907,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASH WAS RANDOMLY FREEZING FOR ABOUT 5 MINUTES AND THEN RESET ITSELF WHILE DRIVING. ONCE IT RESET ITSELF, IT WENT BACK TO THE DEFAULT SETTINGS. IT WAS AT HEART CITY TOYOTA MULTIPLE TIMES FOR THIS PROBLEM. EACH TIME THEY SAID THAT THEY COULD NOT GET IT TO DUPLICATE THE PROBLEM. AFTER DROPPING IT OFF IN APRIL OF 2017, THE TECHNICIAN STATED THAT HE WAS ABLE TO DUPLICATE THE PROBLEM OF THE DASH RESETTING. HE DID A SOFTWARE UPDATE AND A HARD-RESET IN ORDER TO TRY FIXING IT. LOW AND BEHOLD, TWO DAYS LATER IT HAPPENED AGAIN. AFTER HAVING IT AT HEART CITY TOYOTA TO HAVE THE PROBLEM WITH THE CRUISE CONTROL LIGHT FLICKERING, FOR THE FIFTH TIME, FIXED, I REPORTED ABOUT THE DASH STILL HAVING THE PROBLEM OF RESETTING ITSELF. THE MANAGER OF HEART CITY TOYOTA TOLD ME AT THAT POINT THAT I AM NOT WELCOME BACK TO THEIR DEALERSHIP. AFTER CONTACTING TOYOTA CORPORATE ABOUT THIS, I WAS TOLD THAT THEY ARE ABLE TO REFUSE SERVICE EVEN WITH THE WARRANTY STILL PRESENT. THEY EXPLAINED THAT I NEEDED TO TAKE IT TO ANOTHER TOYOTA DEALERSHIP TO HAVE IT DIAGNOSED. SO I CONTACTED JORDAN TOYOTA AND EXPLAINED THE SITUATION. THE SERVICE MANAGER THERE INFORMED ME THAT IF HEART CITY TOYOTA WAS NOT ABLE TO DIAGNOSE THE PROBLEM, THEN THEY WERE NOT GOING TO START FROM SCRATCH TO DIAGNOSE THE PROBLEM THEMSELVES. THREE WEEKS LATER, WHILE DRIVING ON A COUNTY ROAD, THE DASH BEGAN TO SMOKE AND I PULLED OFF OF THE ROAD. WHEN IT BEGAN TO SMOKE EVEN MORE, I EXITED THE VEHICLE AND AS I WAS GETTING AS FAR AWAY AS I COULD I SEEN FLAMES. I CALLED 9-1-1 RIGHT AWAY. BY THE TIME THE FIRE DEPARTMENT WAS ABLE TO GET THERE AND EXTINGUISH THE FIRE, THE VAN WAS DESTROYED. WHICH ENDED UP BEING A TOTAL LOSS. ALL OF WHICH SEEMED TO BE DUE TO AN ELECTRICAL FIRE IN THE DASH. LUCKILY NO ONE WAS HURT.",
        "vin": "5TDYK3DC6FS"
    }
]