[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/07/2018",
        "dateOfIncident": "05/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076715,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA INFLATORS: MY COMPLAINT IS WITH YOUR AGENCY AS MUCH AS FORD.  TWO YEARS AGO I LEARNED OF THE INFLATOR RECALL.  I FINALLY GOT WRITTEN NOTIFICATION FROM FORD JULY 2016. AFTER NO FURTHER CONTACT I CALLED THEM WITH NOTHING FURTHER THEY COULD ADD.  CALLED BACK JULY 2017 AND WAS TOLD NO PARTS WERE BEING MADE, JUST DON'T USE 1/4 THE VEHICLE SEATING FOR SAFETY. (NOT AN OPTION.) FOLLOW UP OCTOBER 2017, WORKING WITH A NEW VENDOR...PARTS SOON BUT NO DATE. GOT DECEMBER 2017 LETTER PARTS DELAYED UNTIL EARLY 2018.  ITS MARCH.  CALLED TODAY, MORE BS.  NO PARTS MADE.  MAYBE 1ST OR 2ND QUARTER.  LADY MADE A U-TURN OUT OF A PARKING LOT A COUPLE WEEKS AGO AND I MISSED HER BY INCHES.  WORRY EVERY TIME WE DRIVE IT OFTEN WITH GRANDKIDS IN CAR. NHTSA HAS DONE NOTHING WE HAVE OBSERVED TO FINE OR OTHERWISE HOLD FORD ACCOUNTABLE/MOTIVATE THEM.  I SUSPECT THEY PAY LOBBYIST TO PRESSURE YOUR AGENCY TO IGNORE THIS PROBLEM.  THEY HAD NO PROBLEM GETTING THEIR NEW CARS OUT THESE LAST TWO MODEL YEARS. TIRED OF MY FAMILIES LIVES BEING AT RISK DAILY, BUT CAN NOT GET OUT FROM UNDER THIS CAR AT THIS TIME AND WHO WOULD WANT TO BUY IT.  WHAT HAPPENED TO THE RALPH NADER DAYS WHEN COMPANIES WERE FINED INTO MOTIVATION TO DO THE RIGHT THING INSTEAD OF WORRYING ABOUT THEIR PROFITS.  I'M TIRED OF WORRYING ABOUT THIS PROVEN DEADLY FAULT.  FORD HAS VERIFIED WE ARE PART OF THE HIGH RISK GROUP BECAUSE OF HUMIDITY.  GET OFF YOUR BUTS AND GET US SOME HELP PLEASE!",
        "vin": "2FMDK3KC0AB"
    }
]