[
    {
        "components": "STEERING,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/20/2017",
        "dateOfIncident": "06/15/2017",
        "fire": false,
        "manufacturer": "Tesla, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000132,
        "products": [
            {
                "manufacturer": "Tesla, Inc.",
                "productMake": "TESLA",
                "productModel": "MODEL S",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS ANOTHER COMPLAINT ABOUT THE TESLA AUTOPILOT.  HERE IS A VIDEO OF AN OWNER USING AUTOPILOT HANDS FREE AT HIGH SPEED ON A FREEWAY AND INCHES AWAY FROM MANY ONCOMING CARS ON AN UNDIVIDED ROAD.  HTTPS://WWW.YOUTUBE.COM/WATCH?V=PIQYOOP5PYC  RATHER THAN KEEPING HER HANDS ON THE WHEEL SHE INSTEAD GIVES THE WHEEL A REGULAR TWEAK EVERY ABOUT ONCE A MINUTE BUT THE REMAINDER OF THE TIME HER HANDS ARE NOWHERE NEAR THE WHEEL.  THIS IS JUST ONE OF MANY VIDEOS SHOWING OWNERS DRIVING IN DANGEROUS WAYS.  I BELIEVE THAT THESE OWNERS HAVE BEEN DUPED INTO HAVING MISPLACED CONFIDENCE IN THE AUTOPILOT AND THAT THE SITUATION HAS BEEN MADE WORSE BY TESLA USING NHTSA APPARENT ENDORSEMENT OF THE AUTOPILOT.    NHTSA HAS STATED THAT TESLA AUTOPILOT IS 40% SAFER THAN A HUMAN DRIVER BASED ON THE NUMBER OF INCIDENTS WHICH RESULTED IN AIR-BAG DEPLOYMENT ACCORDING TO DATA SUPPLIED BY TESLA.  THE PUBLICATION OF THIS FINDING HAS CAUSED OWNERS TO HAVE HIGH CONFIDENCE IN THE AUTOPILOT.  MIGHT I POLITELY ASK - WHAT IS THE SAMPLE SIZE?  IF THE SAMPLE SIZE WAS FOR EXAMPLE 100 AIR-BAG DEPLOYMENTS THEN THAT IS A RATHER LARGE NUMBER OF CRASHES IN PROPORTION TO THE NUMBER OF CARS ON THE ROAD.  IT IS ALSO FAR TOO LOW A SAMPLE TO PROVIDE STATISTICALLY RELIABLE RESULTS.    WHENEVER A CRASH OCCURS TESLA CLAIMS THAT THE AUTOPILOT WAS NOT ENGAGED AT THE  TIME.  THIS IS PROBABLY TRUE BECAUSE THE AUTOPILOT WILL DISENGAGE IF THE OWNER TOUCHES THE WHEEL OR THE BRAKE IN THE INSTANT BEFORE IMPACT.  AT 3:20 IN THE VIDEO YOU CAN SEE THE OWNER GRAB THE WHEEL AFTER THE AUTOPILOT CROSSES DOUBLE LINES.  PLEASE TAKE ACTION TO PREVENT FURTHER LOSS OF LIFE.",
        "vin": "UNKNOWN"
    }
]