[
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/02/2017",
        "dateOfIncident": "06/22/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002703,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AROUND JUNE 22, 2017HE ANTI-LOCK BRAKE SYSTEM ABS, TRACTION CONTROL TC/ESP ELEC. STABILITY, AWD ALL-WHEEL DRIVE, AND BRAKE WARNING AND INDICATOR LIGHTS STAY ON AND WILL NOT RESET ACCORDING TO THE MANUAL INDICATING THE SYSTEMS ARE NOT FUNCTIONING/POWERED ON AND/OR NOT WORKING PROPERLY. ON MAY 9, 2017 SCOTT AUTOMOTIVE PUT NEW BRAKES ON THE CAR. THEY COULD NOT GET A READING FROM THE ABS/TC CONTROL SYSTEM AND SUGGESTED TAKING IT TO A DEALER - IT WOULD NOT COMMUNICATE. A TIRE PRESSURE LIGHT CAME ON AS WELL AND LATER IN THE WEEK, CARTER AUTO REPAIR REPLACED THE TIRE PRESSURE SENSOR AND STATED WITH THE CORRECT READING EQUIPMENT THE ABS/TC STILL WAS NOT COMMUNICATING AND ALSO SUGGESTED HAVING GM PERFORM A READING. GM TECHNICIANS' ONLINE RESPONSES TO FORUM COMPLAINTS OF 2008 SATURN VUE (AND OTHER MODELS) STABILITY TRACK SYSTEM AND TRANSMISSION ISSUES LEAD ME TO BELIEVE GM IS AWARE OF THE PROBLEMS BUT HAVE YET TO TAKE RECALL ACTION TO ADDRESS THEM. THE VEHICLE RUNS THROUGH A SELF-CHECK OF THE SENSORS WHEN THE CAR IS PARKED WITH ONLY THE AWD LIGHT BLINKING AND THE NORMAL ALL LIGHTS FLASH ON THE DASH AND THEN THE BRAKE, ABS, BOTH TC/ESP LIGHTS COME ON AND STAY ON AND THE AWD LIGHT CONTINUES TO BLINK. FROM WHAT I HAVE READ, THE TRACTION CONTROL/ELECTRONIC STABILITY AND ABS ARE NOT ON AND WORKING SO I AM HOPING WHEN I TAKE THE CAR TO GM ON WEDNESDAY THEY WILL OFFER TO REPLACE THE VEHICLE BECAUSE I PURCHASED THIS VEHICLE FOR MY MOTHER BECAUSE IT HAS A 5-STAR SAFETY RATING AND IT IS NO LONGER SAFE FOR HER TO DRIVE IF SHE IS IN AN ACCIDENT AND THE BRAKES LOCK UP AND SHE SKIDS ACROSS THE HIGHWAY.",
        "vin": "3GSDL737X8S"
    }
]