[
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/11/2017",
        "dateOfIncident": "05/22/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004191,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE RETURNING FROM TEXAS AND DRIVING AT HIGHWAY SPEEDS MY CAR'S DRIVETRAIN WARNING LIGHT SAID I NEEDED SERVICE BUT I COULD CONTINUE DRIVING AT MODERATE SPEEDS.  I DROVE TO BMW OF DALLAS.  THEY DETERMINED MY #5-CYLINDER FUEL INJECTOR HAD FAILED.  I STAYED THE NIGHT IN DALLAS AND RETURNED TO THE DEALERSHIP THE NEXT DAY.  AFTER REPLACING THE INJECTOR, THE CAR WOULD NOT IDLE PROPERLY.  I DROVE A RENTAL CAR HOME AND LEFT MY CAR.  THE DEALERSHIP DID EXTENSIVE TESTING TO DETERMINE THE CAUSE OF THE ISSUE OVER THE NEXT THREE AND A HALF WEEKS.  EVENTUALLY THEY DETERMINED THE INJECTOR FAILURE CAUSED A BACKFIRE WHICH BENT THE #5 INTAKE VALVE.  THE ENGINE HAD TO BE REMOVED SO THEY COULD REPLACE THE DAMAGED COMPONENTS.  ALL VALVES HAD TO BE LAPPED; THE VALVE STEM SEALS HAD TO BE REPLACED AND THE ENGINE HAD TO BE REINSTALLED.  THE VEHICLE WAS TRANSPORTED TO ME 26 DAYS LATER.  I DISCOVERED THREE OF THE FIVE SCREWS WHICH SECURE THE BATTERY COVER WERE MISSING.  I DROVE THE CAR FOR THE NEXT THREE DAYS AFTER WHICH IT BEGAN MAKING CLANKING NOISES FROM THE DRIVESHAFT.  THE CAR WAS TOWED TO BMW OF KANSAS CITY SOUTH WHO DETERMINED THE DALLAS DEALERSHIP FAILED TO INSTALL ONE OF THE DRIVESHAFT'S CARRIER BOLTS NOR DID THEY PROPERLY TORQUE A SECOND CARRIER BOLT.  THESE ARE SERIOUS PERSONAL SAFETY CONCERNS.  THESE REPAIRS WERE ALSO REPORTED TO CARFAX AS REGULARLY SCHEDULED MAINTENANCE.  I FILED A FORMAL COMPLAINT WITH BMW OF NORTH AMERICA AND ASKED THAT THEY REPURCHASE THE VEHICLE WHICH THEY REFUSED TO DO.  INSTEAD THEY HAVE OFFERED ME A SMALL CASH SETTLEMENT IF I WILL SIGN A GENERAL RELEASE WAIVING MY RIGHTS AND AGREEING THAT I NOT TO PURSUE ANY FUTURE CLAIMS OR LEGAL ACTIONS AGAINST THEM OR THEIR DEALERSHIPS.  I'M REPORTING THIS AS I AM CONCERNED THESE ISSUES MAY BE PREVALENT WITH OTHER BMW X5 VEHICLES WHICH COULD POTENTIALLY RESULT IN SERIOUS INJURY OR DEATH.",
        "vin": "5UXKR0C52H0"
    }
]