[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/10/2017",
        "dateOfIncident": "07/09/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004067,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "MALIBU",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL 13036D: I WAS EXTREMELY DISAPPOINTED TO LEARN THAT THE ISSUE WITH MY 2010 MALIBU WAS NOT COVERED UNDER RECALL 13036D. I HAVE HAD ISSUES WITH THIS CAR FOR OVER A YEAR AND HAVE TAKEN IT TO THE CHEVROLET DEALERSHIP THAT I PURCHASED THE CAR FROM MULTIPLE TIMES. THEY HAVE PERFORMED THE \"FIX\" LISTED BELOW AS FOUND AT HTTPS://GM.OEMDTC.COM/4133/13036D-PRODUCT-SAFETY-RECALL-BRAKE-LAMP-MALFUNCTION-2004-2012-CHEVROLET-PONTIAC-SATURN. THIS RESOLVED THE ISSUE FOR LESS THAN A WEEK. MY CRUISE CONTROL DOES NOT RESPOND. MY BRAKE LIGHTS CONSTANTLY TURN ON WHEN THE BRAKE PEDAL IS NOT PUSHED AND TURN OFF WHEN THE BRAKE IS PRESSED. THIS IS A HIGHLY DANGEROUS SITUATION AND OBVIOUSLY DUE TO A FAULTY PRODUCT. THERE IS NO WAY THAT THIS COULD HAVE BEEN PREVENTED BY THE CONSUMER, ME. THE LAST TIME I TOOK THE CAR IN TO HAVE THIS LOOKED AT THEY TOLD ME THAT THE BODY CONTROL MODULE WOULD NEED TO BE REPLACED AND THE PART IS $600. THAT IS COMPLETELY UNACCEPTABLE. WHY ON EARTH, WOULD I PAY TO HAVE A PART REPLACED WHEN THE COMPANY, THAT MEANS YOU CHEVY, IS AWARE THAT THERE IS AN ISSUE WHICH IS POTENTIALLY DANGEROUS TO THE CUSTOMER. I HAVE BEEN A CHEVY OWNER ALL MY LIFE AND I HAVE ALWAYS RECOMMENDED YOUR PRODUCT TO PEOPLE LOOKING TO PURCHASE NEW OR USED VEHICLES, DUE TO THE RELIABILITY I HAVE EXPERIENCED. BUT THIS ISSUE IS MORE THAN ENOUGH FOR ME TO NEVER WANT TO DEAL WITH YOUR COMPANY AGAIN.     IF YOU KNOW THE PART IS MALFUNCTIONING AND THE WORKAROUND DOES NOT COMPLETELY RESOLVE THE ISSUE THEN THE PART NEEDS TO BE REPLACED ON YOUR DIME AND NOT AT THE EXPENSE OF THE CUSTOMER. THAT SHOULD BE COMMON SENSE AND REALLY JUST GOOD BUSINESS. I HOPE YOU, AS A COMPANY, CAN SEE THE LIGHT AND RESOLVE THIS ISSUE WITHOUT NEEDING A LOYAL CUSTOMER TO SEND AN ANGRY EMAIL FOR SOMETHING THAT SHOULD HAVE BEEN RESOLVED AS SOON AS THE PROBLEM AROSE.",
        "vin": "1G1ZB5EB8AF"
    }
]