[
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/17/2017",
        "dateOfIncident": "07/07/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005821,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250 SD",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "7/7/17 - 2011 FORD F250, 6.7L DIESEL ENGINE, MILEAGE 79530. (PURCHASED DECEMBER 2010).  I WAS PULLING A SMALL TRAILER UP AN INCLINE (8%) ON I-64 IN WV.  ON THIS PORTION OF THE INTERSTATE THERE WAS NO EMERGENCY PULL OFF SHOULDER.  THE TRUCK OPERATED NORMALLY FOR THE FIRST 3 MILES ASCENDING THE HILL.  DURING THE 4TH MILE, THE TRUCK BEGAN TO GRADUALLY, BUT PROGRESSIVELY LOSE POWER, GOING FROM 70 MPH DOWN TO 0.  AT APPROXIMATELY 30 MPH, THE TRUCK BEGAN TO SHUTTER SLIGHTLY, AND CONTINUED TO DO SO UNTIL IT STOPPED IN THE LANE OF TRAFFIC AND STALLED.   THERE WERE NO WARNING LAMPS OR CHIMES THAT WENT OFF BEFORE THE ENGINE STALLED.  THIS VEHICLE IS EQUIPPED WITH A 'STOP SAFELY NOW' WARNING, ALONG WITH MANY OTHER WARNING INDICATORS ' BUT IT DIDN'T ILLUMINATE.  THE TRUCK WOULD NOT RESTART.  I IMMEDIATELY CALL 911 TO REPORT THAT MY VEHICLE WAS DISABLED IN THE ROADWAY.  AFTER BEING STUCK IN THE LANE OF TRAFFIC FOR ABOUT 10 MINUTES, I WAS ABLE TO DRIFT THE TRUCK AND THE TRAILER BACKWARDS SAFELY, OFF OF THE ROADWAY, INTO THE DRAINAGE DITCH, AFTER A BREAK IN TRAFFIC.  UPON HAVING IT TOWED TO A FORD DEALERSHIP, I WAS INFORMED THAT IT WAS GOING TO NEED A MOTOR, AND IT SOUNDED LIKE IT HAD SPUN THE BEARINGS ON ONE OF THE ENGINE RODS.  THE ENGINE WOULD RESTART AT THE FORD DEALERSHIP, BUT IDLED VERY ROUGH.    I CONFIRMED THAT THERE WERE IN FACT METAL SHAVINGS IN THE OIL.  THE FUEL WAS NOT CHECKED FOR CONTAMINATION.  THIS VEHICLE HAS BEEN MAINTAINED ACCORDING TO FORD'S RECOMMENDED SERVICE GUIDELINES.  BECAUSE OF THE COST TO ME TO REPAIR ($16,000 OR MORE), I'VE ELECTED NOT TO CONTINUE WITH DIAGNOSIS (AT $120 PER HOUR) TO DETERMINE REASON FOR FAILURE.      AGAIN, THERE WAS NO WARNING SYSTEMS ACTIVE AT THE TIME THE ENGINE STALLED.  THIS WAS AN ORIGINAL OWNER, PERSONAL VEHICLE, AND ONLY TOWED A TRAILER ON OCCASION. I HAVE VIDEO FROM DASH CAM W/AUDIO OF THIS EVENT.",
        "vin": "1FT7W2BT2BE"
    }
]