[
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/20/2017",
        "dateOfIncident": "06/17/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000177,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MANY DIFFERENT THINGS HAVE GONE WRONG WITH THIS CAR STARTING AT THE FIRST 900 MILES.  THE CLUSTER THAT SHOWS YOU SPEED AND RPM WENT OUT AT 900 MILES WHILE DRIVING HOME FROM WORK MAKING IT HARD TO DRIVE.  IT TOOK THE DEALERSHIP TWO WEEKS TO FIX THIS PROBLEM. A COUPLE MONTHS AFTER THIS THE CHECK ENGINE LIGHT CAME ON FOR NO REASON, THE DEALERSHIP TOLD ME THAT THERE WAS NOTHING WRONG AND GAVE IT BACK TO ME. TWO WEEKS LATER THE CHECK ENGINE LIGHT CAME ON AGAIN AND THEN THEY SAID THAT THERE WAS A PROBLEM WITH SOMETHING RELATED TO THE CLUSTER.  THEY HAD MY CAR FOR A WEEK THIS TIME WHILE THEY REPAIRED THIS PROBLEM.  SIX MONTHS LATER A GENERIC LIGHT CAME ON THAT SOMETHING WAS WRONG WITH THE CAR, I BROUGHT IT IN AND AGAIN THEY SAID THERE WAS NOTHING WRONG WITH MY CAR. A YEAR AFTER I PURCHASED IT THE DAYTIME RUNNING LIGHTS WENT OUT AND I STARTED GETTING A WARNING TO CHECK THEM, THEY SAID THIS WASN'T COVERED AND WOULD NOT REPLACE THEM. AT ABOUT 65,000 MILES MY HEAD LIGHTS BURNED OUT WHILE I WAS DRIVING AND I HAD TO DRIVE 70 MILES AT NIGHT WITH NO HEADLIGHTS ON THE FREEWAY.  I REPLACED THESE MYSELF FOR $60.  THEN THREE MONTHS LATER MY HEADLIGHTS STOPPED WORKING AGAIN. THE LIGHTS WEREN'T BURNT OUT BUT THEY WERE LOOSE AND I HAD TO JIGGLE THEM TO GET THEM BACK.  AT THE SAME TIME THEY HAD A RECALL ON THE CLUTCH AND IT TOOK THEM A YEAR TO GET THE PARTS AND REPAIR THE RECALL AT 66,751 MILES. NOW AT 74,500 MILES THE CLUTCH HAS COMPLETELY GONE OUT WHILE I WAS DRIVING.  LUCKILY I HAD JUST GOT TO MY DESTINATION AND LEFT IT PARKED IN A PARKING LOT.  THE DEALERSHIP WANTS TO CHARGE ME $3,300 TO FIX THE CLUTCH.  THE CAR IS ONLY WORTH $6600 AND I OWE $13000.  ALSO I HAVE TRIED TO TRADE IT IN AND NO ONE WILL TAKE IT DUE TO ALL THE PROBLEMS THESE CARS HAVE. FIAT SHOULD BE BANNED FROM SELLING THESE CARS UNTIL THEY STOP TURNING OUT CRAPPY CARS.",
        "vin": "3C3CFFAR0FT"
    }
]