[
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "06/24/2017",
        "dateOfIncident": "06/24/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001184,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TODAY, JUNE 24, 2017 AT ABOUT 1:00 PM, I WAS STOPPED AT A RED LIGHT ON A CITY STREET, WAITING FOR THE LIGHT TO TURN GREEN, TO TURN LEFT ONTO THE STATE HIGHWAY. MY FOOT WAS ON THE BRAKE PEDAL, SO I WAS NOT TOUCHING THE GAS PEDAL AT ALL.  SUDDENLY, AND WITHOUT  ANY WARNING, MY VEHICLE ACCELERATED WITHOUT ANY ACTION ON MY PART, AND RAPIDLY STARTED INTO THE BUSY INTERSECTION. DESPITE MY VAIN ATTEMPTS TO STOP MY VEHICLE, BY PUSHING AS HARD IS POSSIBLE ON THE BRAKE PEDAL WITH BOTH FEET, IT DIDN'T DECREASE THE ACCELERATION AT ALL. BECAUSE THE STEERING WHEEL WOULDN'T TURN, I WASN'T ABLE TO AVOID A COLLISION. I COLLIDED WITH A VAN WHICH WAS TRAVELING ON THE HIGHWAY AND GOING ABOUT 40 MILES PER HOUR THROUGH THE INTERSECTION ON THE GREEN LIGHT.  ALTHOUGH THERE WAS EXTENSIVE DAMAGE TO BOTH VEHICLES (WITH THE POSSIBILITY OF ONE OR BOTH VEHICLES BEING TOTALED), VERY FORTUNATELY, THERE WERE NO SUBSTANTIAL INJURIES TO THE WOMAN OR HER FOUR YOUNG CRYING CHILDREN IN THE OTHER VEHICLE, NOR TO ME.  AFTER MORE THAN FIFTY YEARS OF DRIVING WITHOUT AN ACCIDENT, I WAS SHOCKED AND UPSET BY THIS, AND ALL THE PASSENGERS WERE TRAUMATIZED BY THE ACCIDENT. THE POLICE OFFICER DIDN'T GIVE ME A CITATION, ATTRIBUTING THE ACCIDENT TO A MECHANICAL MALFUNCTION.  SEVERAL PEOPLE, INCLUDING YOUNG CHILDREN, COULD HAVE EASILY BEEN KILLED BY THIS AWFUL EXPERIENCE. THIS SHOULD HAVE NEVER HAPPENED, AND I HOPE YOU WILL INVESTIGATE THIS PROBLEM, SO THAT OTHER PEOPLE WON'T BE BADLY INJURED OR LOSE THEIR LIVES IN THE FUTURE.  AN ADDITIONAL ITEM I SHOULD MENTION IS THAT I HAVE ALWAYS KEPT THIS VEHICLE MAINTAINED ON A REGULAR BASIS.",
        "vin": "1FAFP53UX1A"
    }
]