[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/29/2020",
        "dateOfIncident": "11/13/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377015,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "TOWN AND COUNTRY",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "CHRYSLER TOWN AND COUNTRY AND DODGE MINIVAN HAVE AN ACTUATOR THAT LOCKS AND UNLOCKS THE REAR SLIDING DOORS. THE SAME PART IS USED FOR BOTH SIDES, IT JUST NEEDS AN ARM ON IT DEPENDING ON THE SIDE. THE DEFECT IS THAT WHEN THESE ACTUATORS GO OUT, IT WILL EITHER NOT ALLOW THE DOOR TO LOCK, OR PERMANENTLY LOCKE THE DOOR AT ANY TIME AND REMAIN LOCKED UNTIL IT IS FIXED. **IF THERE IS AN EMERGENCY AND THE ACTUATOR BROKEN IN THE LOCKED POSITION THE DOOR WILL NOT OPEN OR OPERATE (INSIDE OR OUTSIDE). IT IS IMPOSSIBLE POSSIBLE TO OPEN THE DOOR IN ANYWAY UNLESS TAKING OFF THE INSIDE PANEL AND GETTING INSIDE TO THE LOCK MECHANISM. IF THE DOOR IS IN THE UNLOCKED POSITION AND YOU WERE UNAWARE THAT THE ACTUATOR IS BROKEN IN THE UNLOCKED POSITION AND YOU THINK IT'S LOCKED AND YOU LEAVE YOUR CHILD IN THERE TO RUN INTO THE HOUSE SOMEBODY COULD OPEN THE DOOR AND STEAL ANYTHING OUT OF YOUR CAR INCLUEDING A CHILD. WHEN THE ACTUATOR BRAKES IN THE UNLOCK POSITION YOU HAVE NO IDEA WHAT IT IS BROKEN. HOWEVER WHEN IT BREAKS IN THE LOCK POSITION IT IS IMMEDIATE AND WITHOUT WARNING AS WELL. WHEN I FOUND OUT THAT MY DOOR WAS LOCKED ON THE DRIVERS SIDE WAS WHEN I WENT TO GET MY DOG OUT OF MY BACK SEAT AND IT WAS BROKEN.I LOOKED THIS ISSUE UP ON THE INTERNET AND THAT'S WHAT I WAS TOLD TO CHECK BOTH DOORS AND FOUND MY MY PASSENGER SIDE WAS PERMANENTLY UNLOCKED.",
        "vin": "2A4RR6DG2BR"
    }
]