[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/02/2020",
        "dateOfIncident": "02/29/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315515,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HEARD ABOUT RECALL ON NEWS FOR 2013 KIA OPTIMA ON SATURDAY, 2.29.2020. FOR ENGINE FIRES. DEALERSHIPS WERE ALREADY CLOSED. CALLED RICK CASE KIA FIRST THING THIS MORNING, 3.1.2020. LARRY IN THE SERVICE DEPARTMENT WAS VERY RUDE AND SAID HE WASN'T SURE WHAT I WAS TALKING ABOUT, THEY DO NOT KNOW OF ANY RECALLS. VERY DISMISSIVE. I'M NOT QUITE SURE HOW KIA KEEPS GETTING AWAY WITH THESE TYPES OF THINGS. YOU WANT ME TO KEEP MY FAMILY IN A DEATH TRAP? GTFOH.  THIS IS THE 4TH OR 5TH MAJOR RECALL ON MY CAR.    ONE OF THE OTHER MAJOR RECALLS WAS FOR METAL SHAVINGS IN THE OIL. AFTER BULLDOG KIA, THEY WERE GREAT, REPLACED THE ENTIRE ENGINE, MY CAR STARTED EATING OIL LIKE CRAZY. I SWITCHED TO HIGH MILEAGE, FULL SYNTHETIC, 5W30 INSTEAD OF 5W20, OIL THINKING IT WOULD HELP SINCE IT HAS SO MANY MILES ON IT. IT DIDN'T. YOU'RE SUPPOSED TO GET 5K MILES WITH FULL SYNTHETIC BEFORE ANOTHER OIL CHANGE, MY CAR IS COMPLETELY OUT OF OIL WITHIN 2K MILES. SO I'M ADDING OIL MYSELF BETWEEN OIL CHANGES.    WHEN CONTACTING RICK CASE KIA, I WAS TOLD \"JUST LET IT BLOW UP BECAUSE WE DO NOT COVER OIL CONSUMPTION\".    TO ME, THIS IS ABSOLUTELY ABSURD. I'VE SPENT MONEY ON THIS CAR. THIS IS MY FAMILY'S CAR, THIS IS HOW I GET TO AND FROM WORK TO BE ABLE TO PAY FOR THIS [XXX] CAR....AND I GET TOLD TO LET IT BLOW UP.    PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "5XXGM4A72DG"
    }
]