[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/21/2017",
        "dateOfIncident": "05/10/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000343,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "RANGER",
                "productYear": "1997",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Michelin North America, Inc.",
                "productMake": "BF GOODRICH",
                "productModel": "RADIAL T/A",
                "productYear": "9999",
                "size": "225/75R16",
                "type": "Tire"
            }
        ],
        "summary": "I HAD FIVE (5) BF GOODRICH RADIAL ALL TERRAIN TA TIRES FAIL WHILE DRIVING THE SAME VEHICLE OVER ABOUT A TEN YEAR PERIOD. EACH FAILURE IS THE SAME. THE STEEL BELT OF THE TIRE PARTIALLY SEPARATES WHILE ROLLING. THE FIRST OCCURRED ABOUT TEN YEARS AGO ON THE INTERSTATE WHILE PULLING A SMALL FLATBED TRAILER. STEEL BELT THEN WHIPS AROUND INSIDE WHEEL WELL DAMAGING WHATEVER IT COMES IN CONTACT WITH. BF GOODRICH RADIAL ALL TERRAIN TA TIRES WERE ON THIS TRUCK WHEN PURCHASED USED. SECOND TIRE FAILED APPROXIMATELY THREE YEARS AGO THE SAME WAY AT LESS THAN 30 MPH. REPLACED ALL WITH USED SET OF FOUR TIRES WITH 50 % TREAD LEFT. LESS THAN A MONTH AFTER, THIRD TIRE FAILED ON INTERSTATE ONCE AGAIN IN THE SAME WAY. STEEL BELT CUT THE FIBERGLASS REAR OUTER FENDER IN HALF, RIPPED OUT THE REAR WIRING HARNESS, DESTROYED THE LEFT TAIL LIGHT, AND EVEN DAMAGED THE GASOLINE FILL TUBE AND DESTROYED ITS LOCKING GAS CAP FROM THE FORCE OF THE BELT WHIPPING ROUND AND ROUND THE WHEEL, PARTIALLY ATTACHED AND PARTIALLY OFF. NEARLY LOST CONTROL OF VEHICLE, BUT WAS NOT INVOLVED IN ACCIDENT. ALL TIRES FAILED WHILE  IN DRIVER'S REAR WHEEL POSITION. THEN LAST MONTH AGAIN, THE LEFT REAR BF GOODRICH RADIAL ALL TERRAIN TA TIRE STEEL BELT CAME PARTIALLY OFF AT ABOUT 30 MPH. EACH TIME A USED TIRE REPLACED THE FAILED TIRE. THEN TWO DAYS LATER, A FIFTH BF GOODRICH RADIAL ALL TERRAIN TA BEGAN TO FAIL WITH STEEL BELT COMING APART. THIS TIME RIGHT REAR WHEEL LOCATION. NOTICED THE FAILURE BEFORE STEEL BELT CAME COMPLETELY OFF AND ANY DAMAGE WAS DONE.  REPLACED WITH BF GOODRICH MUD TERRAIN TA THAT WERE ALSO USED BUT HAVE NOT FAILED.",
        "vin": ""
    }
]