[
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/07/2017",
        "dateOfIncident": "05/01/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003743,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "INITIAL PROBLEM WITH PUSH BUTTON START - WOULD NOT START ON FIRST PUSH.  STARTED AT ABOUT 55K MILEAGE.  PROBLEM HAS WORSENED - MAY START ON FIRST PUSH, BUT SOMETIMES TAKES MANY PUSHES IN COMBINATION WITH BRAKE RELEASE AND DEPRESSING OR JUST PUSHING WITHOUT TOUCHING THE BRAKE - THEN BRAKING AND PUSHING.  VERY INTERMITTENT IN TERMS OF HOW MANY PUSHES - SOMETIMES JUST A COUPLE, SOMETIME 10 OR MORE!  NOW AT JUST UNDER 60K MILEAGE, CAR CANNOT BE TRUSTED.  ERROR CODES COME UP AS 85-01 VSA SYSTEM MALFUNCTION AND 61-11 VSA MODULATOR CONTROL UNIT POWER SOURCE CIRCUIT (IC) LOW VOLTAGE AND B-1240 - A PROBLEM IN THE MODE CONTROL LINKAGE DOOR OR MOTOR.    THESE ERROR CODES DO NOT SEEM RELATED TO THE PUSH BUTTON START ISSUE, BUT IS ANOTHER PROBLEM TO INVESTIGATE AND FIX.      THE PUSH BUTTON PROBLEM HAPPENS TO MANY PEOPLE AND HONDA IS AWARE OF IT.  MY MECHANIC CALLED HIS INSIDE CONTACT AT THE LOCAL DEALER AND THEY KEEP STARTERS ON HAND FOR THIS.  THEY WILL NOT HANDLE AS A WARRANTY OR 'RECALL' TYPE PROBLEM AND ONE HAS TO PAY A LOT FOR THE FIX - STARTER REPLACEMENT CAN BE CLOSE TO $1K!!  ANOTHER HONDA CONTACT KNOWS OF THIS ISSUE - IT IS BECAUSE THE STARTER ON THE ACCORD, ESPECIALLY THE 2.4L ENGINE, IS MOUNTED BELOW THE EXHAUST MANIFOLD, HEATS UP SIGNIFICANTLY AND BEGINS TO FAIL - DEPENDS MORE ON THE # OF STARTS THAN MILEAGE, APPARENTLY.  MY ACCORD IS STARTED MANY TIMES PER DAY.  THIS ISSUE SHOULD BE FIXED UNDER A RECALL EVENT, I BELIEVE, BUT I MUST GET MINE FIXED NOW!!!  NOT GOOD!    ALSO A PROBLEM FROM DAY 1, IS THE FORWARD WARNING CAMERA GETS HOT, HERE IN SOUTHERN CAL, AND WILL NOT WORK UNTIL THE AC SYSTEM COOLS IT DOWN.  VERY UNSAFE AND WORTHY OF FURTHER REVIEW AS WELL.  *JS",
        "vin": "1HGCT1B8XEA"
    }
]