[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/30/2017",
        "dateOfIncident": "06/01/2017",
        "fire": false,
        "manufacturer": "Mercedes-Benz USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002583,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC",
                "productMake": "SMART",
                "productModel": "FORTWO",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PAINT ON MY 2009 RED SMART CAR IS PEELING. SOME SMART CARS HAVE BEEN RECALLED FOR BAD PAINT WHICH COULD LEAD TO LOSS OF THE WINDSHIELD OR ROOF; THE ADHESIVE IS LAID OVER THE PAINT AND IF THE PAINT SOME OFF THE ADHESIVE WILL TOO; THUS IS A SAFETY ISSUE. MY CAR WAS ORDERED IN 2008, BUT I PURCHASED IT IN 2009. I HAVE CONTACTED THE DEALERSHIP, AND THE SMART HEADQUARTERS AND SPOKE WITH ADAM. I HAD THE ESTIMATE OF HOW MUCH IT WOULD COST TO REPAINT OR REPLACE THE PANELS ON THE CAR. THIS WAS PART OF A \"GOODWILL OUT OF WARRANTY GESTURE.\" ADAM FROM HEADQUARTERS CALLED ME TODAY AND INFORMED ME THAT THEY WOULD NOT HONOR THE REPAIRS. I'M SO SAD. I'M A SENIOR AND I SAVED UP FOR 3 YEARS TO GET THAT CAR NEW. I HAVE TAKEN IMPECCABLE CARE OF IT, AND IF YOU GOOGLE \"RED SMART CARS WITH PEELING PAINT ISSUES\" YOU WILL FINE MANY POSTINGS. I'M STUCK WITH THIS CRAPPY LOOKING CAR. IT LOOKS AWFUL. I'M NOT GOOD ON THE COMPUTER, BUT WILL TRY TO GET SOMEONE TO TAKE PHOTOS AND SEND THEM IN. I HAVE BEEN THE SOUL OWNER OF THE CAR, I HAD WASH IT WITH WATER, AND IT IS GARAGE KEPT. I ONLY HAVE 54,000 MILES ON IT. THE STRESS HAS MADE ME QUITE DEPRESSED AS GETTING IN THE  CAR I HAVE TO BE REMINDED OF HOW IT LOOKS. THIS CAR WAS TO BE MY LAST CAR DUE TO MY AGE. SO NOW, WHEN SOMEONE ASKS HOW I LIKE MY SMART CAR, I GIVE THEM THE TOUR AROUND MY CAR SO THEY CAN SEE FOR THEMSELVES. THEY JUST SHAKE THEIR HEADS IN AMAZEMENT. I THEN TELL THEM THAT MERCEDES/SMART WILL NOT MAKE IT RIGHT. THIS IS WRONG. VERY POOR CUSTOMER SERVICE.",
        "vin": "WMEEK31X49K"
    }
]