[
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/10/2017",
        "dateOfIncident": "07/02/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003936,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "RANGER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING AND SUDDENLY, MY VEHICLE STARTED TO LOSE POWER.  WAS VERY SCARY BECAUSE IT WAS AT NIGHT.  ENGINE LIGHT CAME ON AND POWER WAS LOST.  PULLED OFF FREEWAY INTO GAS STATION.  CHECKED FLUIDS, ETC..  UPON TRYING TO LEAVE, VEHICLE WAS SPUTTERING WITH NO COMPRESSION.  I DID NOT THINK I WAS GOING TO MAKE IT HOME.  AFTER A FEW  MINUTES, I TRIED AGAIN, THIS TIME GIVING VEHICLE MORE GAS.  IT SEEMED TO DO A LITTLE BETTER.  BUT, EVERY TIME I HAD TO SLOW DOWN OR STOP FOR A STOP SIGN OR TRAFFIC LIGHT, VEHICLE WAS SPUTTERING AND ACTING LIKE IT WAS GOING TO STALL OUT.  WAS VERY NERVE RACKING, AS I WAS AFRAID OF BEING REAR ENDED BY CARS THAT WERE BEHIND ME.  NOW EVERY TIME I SLOW DOWN TO WHERE VEHICLE IS IN IDLE, IT ACTS LIKE IT IS GOING TO STALL OUT ON ME, WHICH MAKES ME VERY NERVOUS.  HAD A MECHANIC INSTALL NEW PLUGS, NEW INJECTOR, COIL PACKAGE AND VEHICLE IS STILL DOING BADLY AND RUNNING VERY ROUGH.  ENGINE LIGHT STILL COMES ON AFTER HAVING ALL THESE NEW PARTS INSTALLED.  MECHANIC ALSO RECOMMENDED USING A GAS ADDITIVE AND FILLING TANK WITH PREMIUM GAS, WHICH I DID.  STILL RUNNING ROUGH.  UPON FURTHER RESEARCH, HAVE FOUND OUT THAT FORD RANGERS, YEARS 2004 THROUGH 2006 ARE HAVING THE SAME PROBLEM.  MY VEHICLE ONLY HAS 66,362 MILES ON IT AND I HAVE KEPT MAINTAINED AT ALL TIMES.  FORD HAS KNOWN ABOUT THIS BUT HAS NOT DONE A RECALL YET.  I FEEL THAT THEY ARE RESPONSIBLE AND THAT THERE SHOULD BE A RECALL ON THESE VEHICLES.  EITHER I WILL HAVE TO BUY A NEW ENGINE OR A NEW VEHICLE, WHICH I CAN NOT AFFORD.  FORD NEEDS TO RECALL AND PAY FOR WHAT NEEDS TO BE DONE TO FIX THIS PROBLEM, AS THEY WERE AWARE OF THIS PROBLEM AND HAVE DONE NOTHING ABOUT IT.  I SHOULD NOT HAVE TO PAY FOR NEW ENGINE OR NEW VEHICLE, WHEN MY 2004 RANGER HAS LOW MILEAGE AND HAS BEEN WELL MAINTAINED THE WHOLE TIME THAT I HAVE HAD IT.  IT IS THE 3.0 VULCAN ENGINE.  PLEASE HELP.",
        "vin": "1FTYR14U54P"
    }
]