[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/30/2017",
        "dateOfIncident": "03/25/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002500,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IN THE RAIN ALL OF A SUDDEN THERE WAS A LOUD NOISE AND MY ENGINE STARTED KNOCKING LOUDLY. I WAS ABLE TO PULL THE ENGINE AND PULL IT APART AND FOUND THERE WAS WATER IN THE INTAKE AND THE NUMBER 5 CYLINDER ROD HAD BROKE. LUCKILY THE PART THAT BROKE WENT DOWN AND THE OIL PAN GASKET/WINDAGE TRAY SLOWED IT DOWN ENOUGH TO NOT GO THROUGH THE BLOCK. AFTER FURTHER INSPECTION I NOTICED THAT THE INTAKE GASKETS WERE NOT SEALING PROPERLY AND ALLOWED WATER TO BE SUCKED INTO THE INTAKE AND THEN HYDRA LOCKED THE NUMBER 5 PISTON. WHEN I PUT IT TOGETHER I NOTICED THE \"SEAL\" ON THE COWL WASN'T EVEN TOUCHING THE WINDOW AND THAT LET THE RAIN GO DIRECTLY INTO THE ENGINE COMPARTMENT AND SIT ON THE ENGINE. PUT THOSE TWO PROBLEMS TOGETHER WITH THE RAIN AND NOW I HAVE A MOTOR THAT IS BROKEN. I CALLED DODGE AND THE LADY TRIED TELLING ME THAT HER \"MASTER\" MECHANIC HAD NEVER HEARD OF THIS PROBLEM AND YET WHEN I TYPED IN A SEARCH ON THIS MODEL AND YEAR THAT WAS THE FIRST THING THAT POPPED UP. I KNOW THAT THIS IS A PROBLEM WITH THE 2004 DODGE DURANGO. I HAVE INSERTED PICTURES OF THEIR INTAKE GASKETS AND THEN I HELD A RULER UP TO THE INTAKE FLAT AND YOU CAN CLEARLY SEE THE LIGHT SHINING THROUGH THE GASKET WHICH MEANS THAT THIS WAS DEFINITELY NOT SEALING. ALSO I PUT A PICTURE OF THE COWL SEAL AND SHOWED HOW CHEAP IT IS. ALSO WHILE WE WERE WAITING TO GET THE FUNDS TO REPAIR THE ENGINE IT SAT THROUGH THE WINTER COMPLETELY COVERED AND THE ENGINE HADN'T EVEN BEEN TAKEN APART YET AND WHEN WE PULLED THE INTAKE OFF IT WAS COMPLETELY \"FULL\" OF WATER WHICH IN TURN FILLED THE HEADS AND THE CYLINDERS WITH WATER.",
        "vin": "1D4HB58DX4F"
    }
]