[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/02/2020",
        "dateOfIncident": "05/21/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337115,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MAY 21, 2020, I'D TAKEN MY 2013 KIA OPTIMA EX FOR A SIMPLE OIL CHANGE AT HAWKINSON KIA, MATTESON, IL. THE SERVICE DEPT. TECH CONDUCTED ADD'L INSPECTIONS, AS THEY USUALLY PERFORM, MADE RECOMMENDATIONS, INCLUDING SERPENTINE BELT REPLACEMENT. I'D AGREED TO BELT REPLACEMENT. MY CAMERA DISPLAY WAS WORKING PRIOR TO THIS VISIT. NO REPORT OF ANY CAMERA PROBLEM WAS INDICATED ON THE INSPECTION OR RECOMMENDATION REPORTS OR RECEIPT.    AFTERWARDS, MY CAMERA DISPLAY CEASED OPERATION, ONLY DISPLAYING A BLACK BACKGROUND WITH GUIDELINES. SEVERAL TIMES AFTERWARDS, I'D CONTACTED THE SERVICE DEPT. TO COMPLAIN OF THE ISSUE. THEY'D SUGGESTED BRINGING VEHICLE BACK FOR DIAGNOSTIC, WHICH I COMPLIED AND PAID ITS FEE ON JUNE 8, 2020. DEALERSHIP SERVICE DEPT. THEN SAID IT WASN'T AN ISSUE THEY'D CREATED/WASN'T CAUSED BY INSTALLATION OF BELT AND THAT IT RECOMMENDED REPLACEMENT OF HEAD UNIT [RADIO SYSTEM] AND CAMERA AT A COST OF APPROX. $511.    I'D COMPLAINED SEVERAL TIMES TO KIA'S CORPORATE CUSTOMER SERVICE BUT DID NOT RECEIVE ANY CONSIDERATION NOR RESOLUTION: ONLY TO BE TOLD MY VEHICLE'S WARRANTY HAS EXPIRED.     THE DEALERSHIP SERVICE DEPT. HAD SEVERAL OPPORTUNITIES TO VISUALLY NOTICE ANY CAMERA DEFECT AS IT'S TECH(S) OPERATED MY VEHICLE BY DRIVING IN AND OUT OF ITS SERVICE GARAGE AS THE CAMERA DISPLAY IS ACTIVATED WHEN VEHICLE IS IN REVERSE.    SINCE ISSUE WITH THE REAR-VIEW CAMERA WAS A 'KNOWN ISSUE,' AT LEAST ACCORDING TO KIA'S TECHNICAL SERVICE BULLETIN [GRP. ELE, NO. 077] ISSUED IN 2014, THE CAMERA, ETC., SHOULD HAVE BEEN RECALLED AND REPLACED AT KIA'S EXPENSE! I'D DISCOVERED THAT A HOST OF OTHER KIA OWNERS HAD EXPERIENCED AND COMPLAINED OF SIMILAR REAR-VIEW CAMERA ISSUES WHEN I'D CONDUCTED A WEB SEARCH ABOUT THIS DEFECT.    THE REAR-VIEW CAMERA IS A SAFETY FEATURE! AND SHOULD ALWAYS WORK PROPERLY!  *TR",
        "vin": "5XXGN4A77DG"
    }
]