[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/22/2017",
        "dateOfIncident": "06/11/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000662,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 6/11/17 WILE I WAS DRIVING I FELT MY CAR 'JERK' WHEN I WOULD PRESS ON THE GAS AND THE CAR WOULD SHIFT GEARS. MY DASHBOARD ALERTED ME THAT THERE WAS A PROBLEM AND I WOULD NEED TO TAKE THIS CAR IN FOR SERVICE. [ATTACHMENT 1] MY VEHICLE ONLY HAD 2040 (ESTIMATED) MILES ON IT AND I'VE ONLY HAD IT FOR 2 MONTHS, HOW COULD THIS BE?  WHILE ON THE WAY HOME, THAT SAME DAY, I WAS STOPPED A RED LIGHT WAITING FOR IT TO TURN GREEN FOR ME TO GO.  ONCE THE LIGHT WAS GREEN I PRESSED ON THE GAS AND I GOT TO ACCELERATE FOR ABOUT 10 FEET AT THAT POINT THE CAR WAS INOPERABLE. I TRIED SWITCHING GEARS TO DRIVE, REVERSE AND NEUTRAL BUT IT DIDN'T WORK. AT THIS POINT I HAD A DIFFERENT ALERT ON MY DASHBOARD [ATTACHMENT 2].  I QUICKLY PUT MY HAZARDS ON AND LET THE VEHICLE SLOWLY PULL OVER TO THE SIDE OF THE ROAD. AT THAT POINT I PRESSED ON THE BRAKE PEDAL PUT THE CAR INTO PARK AND PUT THE EMERGENCY BRAKE ON. THE VEHICLE WAS  SENT VIA TOW TO ROUTE 22 HONDA FOR SERVICE ON 6/12/17. THE VEHICLE WAS RETURNED TO ME ON 6/21/17.  I WAS TOLD THAT THE TRANSMISSION WAS REPLACED HOWEVER WHEN I ASKED WHAT EXACTLY WAS WRONG WITH IT THE RESPONSE WAS \"WE DO NOT KNOW BUT WE ARE SENDING IT TO HONDA FOR FURTHER REVIEW\".  I AM FEARFUL OF DRIVING THIS VEHICLE HOWEVER I AM LOCKED INTO THIS LEASE.  HONDA DOES NOT KNOW WHAT WENT WRONG AND HOW TO PREVENT IT FROM HAPPENING AGAIN. I FEAR I MAY BE ON THE HIGHWAY AND THIS MAY HAPPEN AGAIN. I TRULY FEAR FOR MY LIFE AND ANY PASSENGERS I MAY HAVE IN MY VEHICLE.",
        "vin": "5FNYF6H92HB"
    }
]