[
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/06/2017",
        "dateOfIncident": "06/14/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003471,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "GRAND MARQUIS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL 15S39: MY LIGHTS WERE WORKING JUST FINE BUT I RECEIVED A RECALL NOTICE. WHEN I CALLED TO MAKE AN APPOINMENT I SAID I HAD NO PROBLEMS WITH MY LIGH BUT THE LETTER SAID IT MIGHT OCCUR AT ANYTIME. I DRIVE APPROX. 35,000 MILES PER YEAR.   MAY 17,2017 I MADE APPOINMENT.FOR JUNE12,2017. WHAT I THOUGHT WAS A NEW MODULE WAS INSTALLED. JUNE 14, 2017 MY LIGHTS SUDDENLY WENT OUT WHEN I WAS DRIVING. THEY SUDDENLY CAME BACK ON. LATER THAT EVENING THEY WOULD NOT COME ON AT ALL. (IT STAYS ON AUTOMATIC). I GOT THE MANUAL LIGHTS TO COME ON . NO BRIGHT LIGHT ONLY INTERMITTANT BRIGHTS. THE NEXT DAY I TOOK IT TO GEM CITY FORD. AFTER AN HOUR THEY SAID THEY WERE O.K. 10 P.M. THE LIGHTS WENT OUT AGAIN. I USED MANUAL. CALLED THEY SAID THEY WOULD CALL BACK.THEY DIDNOT WITH MORE THAN ONCALLS NEVER TO BE CALLED BACK. THEN I LEFT A NOTE I WOULD GET IT CHECKED WHILE OUT OF SATE. THEN I GOT A CALL REQUESTING THAT I BRING IT IN. I WAS LEAVINE THE STATE F OR A WEEK. CAME BACK TO TOWN THE NEXT WEEK TOLD THAT THE PATCH THAT WAS PUT IN WAS WORKING AND I COULD PURCHASE THE MODULE.THIS IS A DANGEROUS THING . THE FIX CAUSED A PROBLE THAT THE FIX WAS SUPPOSED TO DO. I WANT MY CAR BACK TO THE WAY IT WAS.  WHEN DRIVING IT MAKES A POP THEN GOES OUT OR COMES ON. WHEN STARTING THEY MAY NOT COME ON AT ALL. I DON'T WANT THIS TO HAPPEN WHEN I'M GOING THROUGHT THE MOUNTAINS OF GEORGIA OR TENNESSE AT NIGHT. THIS SHOULD HAVE NOT BEEN PATCHED. IT'S LAZY . A PERSONS LIFE THAT BOUGHT THIS VEHICAL SHOULD BE WORTH MORE THAN THAT. NO WAY TO UP LOAD. I CAN FAX.",
        "vin": "2MEFM75WX3X"
    }
]