[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/11/2017",
        "dateOfIncident": "07/11/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004287,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-150",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS TOOK 4 ATTEMPTS AND 2 DEALERS TO RESOLVE - ~34K MILES- LOUD GRINDING/VIBRATION FROM FRONT LEFT 4X4 HUB WHEN DRIVING ANY SPEED. THE FIRST DEALER HAD THE TRUCK FOR 6 DAYS AND CLAIMED THEY DIDN'T SEE OR HEAR THE PROBLEM. THE SECOND TRIP TO THE DEALER THEY HAD FOR A FEW MORE DAYS AND SAID THEY FIXED IT. ON THE WAY HOME IT WAS OBVIOUSLY NOT FIXED AND I TURNED AROUND AND TOOK IT BACK. AGAIN AFTER TWO DAYS THEY SAID IT WAS FIXED YET IT WAS NOT. I THEN TOOK IT TO A DIFFERENT DEALER AND THEY KNEW WHAT THE PROBLEM WAS AND FIXED IT. THEY ALSO INFORMED ME THE SERVICE LOG DIDN'T SHOW ANY SERVICE ATTEMPTS TO THE TRUCK SO MY TRUCK SAT FOR ALMOST TWO WEEKS AND NO WORK WAS ACTUALLY DONE AND I WAS LIED TO.     SECOND ISSUE - NOT RESOLVED. LIFE OF VEHICLE -  WOBBLE/VIBRATION FROM 4X4 TRANSFER CASE THAT INTENSIFIES WITH INCREASED SPEED. DRIVING IN 4X4 LOW AT ALL SPEEDS YOU CAN FEEL AND SEE THE STEERING WHEEL SHAKE, EVEN GOING AS SLOW AS 10MPH. THE STEERING WHEEL, SEATS AND PEDDLES SHAKE AS IF THE TIRES AREN'T BALANCED. I HAVE INSTALLED 3 DIFFERENT SETS OF TIRES AND IT STILL SHAKES. 2 DIFFERENT TIRE SHOPS VERIFIED THE TIRES ARE GOOD AND THE ALIGNMENT WAS GOOD. THE SHAKING ISN'T BAD LIKE THE DEATH WOBBLE BUT DOESN'T FEEL SAFE. IT SHAKES ENOUGH THAT MY 3 YEAR OLD GETS SICK TO HER STOMACH FROM THE BOUNCING.      THIRD ISSUE - RESOLVED WITH MY MONEY  - AT ABOUT 45K MILES THE FACTORY FRONT ROTORS WERE WORN TO THE POINT OF REPLACEMENT DUE TO DEEP CUTS. THIS OCCURRED WITH THE FACTORY BRAKE PADS.",
        "vin": "1FTEW1EG3FF"
    }
]