[
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/03/2017",
        "dateOfIncident": "11/29/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052115,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "STABILITY CONTROL SYSTEM ENGAGES DURING NORMAL DRIVING AND DRY, LEVEL, LOW-SPEED CONDITIONS SUCH AS PULLING ONTO HIGHWAY FROM A STOP.  THIS HAS OCCURRED THREE TIMES, IN EACH INSTANCE STARTING FROM A DEAD STOP TO MAKE A TURN.  WHEN THE SYSTEM ENGAGES THE DRIVER HAS LITERALLY NO CONTROL OVER THE VEHICLE - BRAKES ENGAGE ABS WITHOUT DRIVER INPUT, ENGINE POWER IS SUDDENLY REDUCED, AND VEHICLE IS BROUGHT TO AN IMMEDIATE CRAWL AND THEN STOP, UNTIL IT DISENGAGES.  THUS FAR I'VE BEEN FORTUNATE ENOUGH THAT THIS HAS NOT OCCURRED WHERE ANY ONCOMING TRAFFIC HAS POSED A THREAT OF COLLISION, BUT THE POTENTIAL FOR A MAJOR ACCIDENT IS OBVIOUS.  RESEARCHING THIS ISSUE ONLINE INDICATES THAT IT IS NOT AN UNCOMMON EXPERIENCE WITH THIS VEHICLE, AND REPORTED DEALER RESPONSES ARE NOT ENCOURAGING.  AN ELECTRONIC SAFETY SYSTEM SHOULD BY DEFINITION NOT BE A LETHAL THREAT; THERE APPEARS TO BE NO PROTECTION AGAINST A HARDWARE/FIRMWARE FAILURE MODE CAUSING UNWARRANTED AND WHOLLY UNPREDICTABLE DEPLOYMENT OF THE SYSTEM WITH VERY HIGH RISK OF CAUSING COMPLETE LOSS OF CONTROL OF THE VEHICLE.  HOW IS IT POSSIBLE THAT I READ DOZENS AND DOZENS  OF REPORTS OF THIS ISSUE WITHOUT THERE HAVING BEEN A RECALL? I GRANT THAT MY VEHICLE HAS 185K MILES...BUT COMPETENT ENGINEERS KNOW HOW TO DESIGN S/W THAT WOULD DISABLE THE STABILITY CONTROL IF ANY FAULT IS DETECTED, IE STEERING POSITION SENSOR, YAW SENSOR, ECM.  IT'S STAGGERING TO IMAGINE THAT A FEW LINES OF CODE COULDN'T BE ADDED DOING JUST THAT, INSTEAD OF ALLOWING THE SYSTEM TO DEPLOY AT WILL WHEN NO VALID CONDITIONS EXIST.  I CAN TELL YOU THAT IT'S A DESPERATELY DANGEROUS SITUATION TO SUDDENLY FIND YOURSELF FACING, AND THEN READ REPORT AFTER REPORT OF DEALER SERVICE BLINDLY REPLACING SENSORS AND MODULES AT VERY HIGH COST TO THE VEHICLE OWNER WITHOUT RESOLVING THE PROBLEM BECAUSE 'WE DON'T REALLY KNOW WHAT CAUSES IT'.",
        "vin": "1GYEE637850"
    }
]