[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/28/2018",
        "dateOfIncident": "05/27/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11098315,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR BRAKES LOCKING UP. I DROVE THE TRUCK A COUPLE MILE AND WE HAD A LOT OF RAIN AND WHEN I PARKED THE CAR I SET THE EMERGENCY BRAKE AS ALWAYS SINCE IT IS A STICK SHIFT/ MANUAL TRANSMISSION. I WENT TO GO TO THE STORE THE NEXT DAY AND THE TRUCK WOULD NOT MOVE SINCE THE REAR LEFT WHEEL WAS LOCKED UP. I CALLED TOYOTA ROAD SIDE ASSISTANCE AND THIS WAS MEMORIAL DAY WEEKEND AND THEY WOULDN'T COME TO GET THE CAR BECAUSE THE DEALER WAS CLOSED AND SOMEONE HAD TO SIGN FOR THE CAR. I WAS FORTUNATELY HOME AT THE TIME BUT DID HAVE TO GO TO WORK ON TUESDAY AND THAT WOULD BE WHEN THEY CAME. I DID SOME RESEARCH ON THE INTERNET AND FOUND OUT THAT I AM NOT THE ONLY ONE WITH THIS ISSUE. THIS IS NOT CALLED AN EMERGENCY BRAKE FOR NO REASON!!! WHAT WOULD HAPPEN IF I HAD TO USE IT IN A DRIVING EMERGENCY AND NEEDED TO RELEASE THE BRAKE AND IT DID NOT RELEASE???? THIS CAR HAS 13400 MILES ON IT AND THIS IS A SERIOUS ISSUE IF YOU ASK ME! I WAS LUCKY ENOUGH TO FIGURE OUT HOW TO REPAIR IT MYSELF WITH ENOUGH SEARCHING THE INTERNET AND READING EVERYONE ELSE'S COMPLAINTS AND FREED THE DRUM UP TO MOVE THE CAR SO I CAN GET TO WORK BUT TOYOTA NEEDS TO STEP UP TO THE PLATE AGAIN AND CORRECT THE ISSUE FOR EVERYONE'S VEHICLE INCLUDING MINE BECAUSE I WILL NOT BE DOING THIS AGAIN WHILE THIS CAR IS STILL UNDER WARRANTY AND HAS A LONG HISTORY OF THIS. I WISH I HAD KNOWN OF THIS BEFORE I BOUGHT THE VEHICLE!!!",
        "vin": "5TFSX5EN8HX"
    }
]