[
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/29/2020",
        "dateOfIncident": "12/21/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11385415,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2019 TOYOTA CAMRY SE. THE CONTACT STATED THAT HIS WIFE WAS DRIVING AT 50 MPH ON THE HIGHWAY AND A TRAILER FROM ANOTHER VEHICLE  DETACHED AND CAME INTO THE LANE.  THE VEHICLE HIT THE TRAILER IN THE FRONT PART AND IT WENT AIRBORN AND FLIPPED OVER AND LANDED ON THE PASSENGER SIDE OF THE VEHICLE. IT THEN ROLLED TWO TIMES AND LANDED ON THE SIDE OF THE HIGHWAY IN A MARSH IN AN UPRIGHT POSITION. THE ONLY AIR BAGS THAT DEPLOYED WERE THE SIDE CURTAIN AIR BAGS. OUT OF THE TEN AIR BAGS ONLY TWO ENDED UP DEPLOYING.THE WIFE AND TWO OTHER PASSENGERS WERE TRANSPORTED BY AMBULANCE TO THE HOSPITAL FOR PRECAUTIONARY REASONS INCASE OF INTERNAL INJURIES. AT THE HOSPITAL THE XRAYS WERE NEGATIVE OF THE CHEST AND  PELVIC AREAS AND ELBOW. ONE OF THE PASSENGER'S ANKLE WAS BROKEN. THE INJURIES WERE MOSTLY SEVERE BRUISING OVER SEVERAL AREAS ESPECIALLY FROM THE SEAT BELTS. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOTALED. BOTH THE FRONT AND REAR BUMPERS WERE TORN OFF, THE DRIVER'S SIDE WAS SMASHED IN. THE FRAME BAR ON THE DRIVER'S SIDE UNDER THE HOOD WAS BENT. THE UNDERSIDE OF THE   VEHICLE WAS RIPPED OFF  AND ALL FOUR WHEELS WERE BENT OUT. THERE WAS  DAMAGE TO REAR AXEL AND FRONT SWAY BARS. THE PASSENGER SIDE OF THE VEHICLE WAS ALSO SMASHED IN AND REAR WINDOW WAS SHATTERED. THE VEHICLE WAS TOWED FROM THE CRASH AREA. THE DEALER AND MANUFACTURER HAD NOT BEEN NOTIFIED YET. THE FAILURE MILEAGE WAS 33,400.",
        "vin": "4T1B11HK4KU"
    }
]