[
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/01/2018",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "Mercedes-Benz USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075715,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC",
                "productMake": "MERCEDES BENZ",
                "productModel": "GL450",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FOLLOWING CONDITION APPEARED WITHIN THE LAST COUPLE OF MONTHS. (I PUT A DATE OF 1/1/18, IN THE BOX BELOW, BUT THE PROBLEM HAS OCCURRED AT LEAST A DOZEN TIMES SINCE THEN, AND I FIND IT UNSAFE TO  DRIVE THE VEHICLE ANY MORE).    AT HIGHER SPEEDS, THE VEHICLE'S TRANSMISSION WILL DOWNSHIFT TO BY ITSELF INTO 1ST GEAR SUDDENLY AND WITHOUT WARNING. EVEN AT FREEWAY SPEEDS RPMS WILL SUDDENLY JUMP UP TO \"RED-LINE\" LIMITS AS THE DOWNSHIFT OCCURS FROM 7TH GEAR TO 1ST GEAR. THE VEHICLE MUST BE BROUGHT TO A COMPLETE STOP AND ENGINE MUST BE TURN OFF AND RESTARTED FOR TRANSMISSION TO ENGAGE PROPERLY. IT'S VERY DANGEROUS WHEN OTHER VEHICLES ARE FOLLOWING OR IN ADJACENT LANES TRAVELING AT HIGH SPEEDS.  ALSO, AFTER DRIVING AT HIGHER SPEEDS, VEHICLE RPMS DROP SUDDENLY AND WITHOUT WARNING WHEN COMING TO A COMPLETE STOP. TRANSMISSION BASICALLY DISENGAGES AND WILL NOT RE-ENGAGE EVEN WHEN GAS PEDAL IS PRESSED. ENGINE MUST BE TURNED OFF COMPLETELY AND RESTARTED FOR TRANSMISSION TO ENGAGE. EQUALLY DANGEROUS CONDITION - ESPECIALLY WHEN DECELERATING ON FREEWAY OFF-RAMPS.  THE VEHICLE HAS BEEN WELL MAINTAINED (ALL SERVICE RECORDS ARE AVAILABLE), AND I AM THE ORIGINAL OWNER (BOUGHT NEW IN LATE 2006). THE VEHICLE HAS BEEN DRIVEN APPROXIMATELY 117,500 MILES AS OF FEBRUARY 2018.  WHAT ALARMS ME THE MOST IS THAT I HAVE SEEN MANY OTHER  OWNERS OF THE SAME VEHICLE REPORT EXACTLY THE SAME DANGEROUS TRANSMISSION PROBLEM. EVEN MY INDEPENDENT MECHANICS SAYS ITS A WELL KNOWN PROBLEM. I SAY IT'S A DANGEROUS PROBLEM. I SHOULD KNOW, IN PART BECAUSE I HAVE BEEN REGISTERED TRAFFIC ENGINEER FOR OVER 39 YEARS, AND WAS A PAST RECIPIENT OF A NATIONAL HIGHWAY TRAFFIC SAFETY ADMINISTRATION FELLOWSHIP IN HIGHWAY SAFETY.",
        "vin": "4JGBF71E37A"
    }
]