[
    {
        "components": "SUSPENSION,STRUCTURE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/19/2017",
        "dateOfIncident": "02/10/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006306,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA INFLATORS:  UNDERSTANDING THAT IT IS A SUPERCHARGER AND IT WILL NOT GET THE FUEL MILEAGE AS A FOUR-CYLINDER VEHICLE I SHOULD NOT BE GOING  THROUGH THIS MUCH GAS AND I  DO NOT HAVE MY FOOT IN IT ALL THE TIME ALSO MY FRONT DRIVER SEAT IS ABOUT TO DISMANTLE FROM THE FLOOR THERE IS A LOT OF ELECTRICAL ISSUES WHICH I'M NOT SURE IF THAT IS WHAT IS CAUSING SENSOR PROBLEMS THE CHECK ENGINE LIGHT IS NOW ON AGAIN. I HAVE HAD OVER $3000 OF MY OWN MONEY PUT INTO THIS TRUCK ALONG WITH ANOTHER USED MOTOR AND SUPERCHARGER PUT IN  RIGHT AFTER PURCHASING THIS TRUCK USED I WOULD NOT HAVE PREFERRED THEM BUYING USED I WANTED REMANUFACTURED BUT IT WAS NOT MY CHOICE THEY SAID. THE BED OF THE TRUCK IS ALSO RIDING OUT THE BRAKE SYSTEM I ALSO HAVE TO REDO AGAIN WHICH I SHOULD NOT HAVE ANY ISSUES. AND FOR A SUPERCHARGER IT SHOULD HAVE A LOT MORE POWER THAN IT DOES.   I HAVE DOCUMENTATION TO PROVE THAT I HAVE SPENT SO FAR RECEIPTS AND I DO NOT EVEN LIKE TAKING THE HIGHWAY AT TIMES BECAUSE I JUST DON'T FEEL LIKE IT SAFE ENOUGH TO BE HONEST WITH YOU AND I SHOULD NOT FEEL THAT WAY WHEN I JUST PURCHASED THIS TRUCK NOT EVEN A YEAR AGO. THIS IS THE FIRST USED TRUCK I HAVE  EVER PURCHASED WHERE I HAVE HAD SO MANY ISSUES WITH IT I DON'T KNOW WHETHER NOT TO BLAME MYSELF TO USE DEALERSHIP OR THE TRUCK ITSELF I FELL IN LOVE WITH THE TRUCK AT FIRST SIGHT BUT  I WILL NEVER DO THAT AGAIN. WHEN IT RAINS AND I'M ON THE HIGHWAY I WILL LOSE POWER ALMOST TO THE POINT WHERE I THINK THE ENGINE AND THE ENGINE WELL ALMOST SHUT OFF I WILL HAVE TO GET OFF THE HIGHWAY SHUT THE TRUCK DOWN LET IT SIT FOR ABOUT A MINUTE OR TWO TURN IT BACK ON AND THEN PROCEED IF I STILL IN LOSING POWER I WILL HAVE TO SHUT IT OFF AGAIN AND THEN WAIT UNTIL THE TRUCK IS READY IN ORDER FOR IT TO HAVE ITS POWER BACK I DO NOT KNOW WHAT THE PROBLEM IS I'M NOT SURE IF TOO MUCH RAIN IS GETTING INTO THE ENGINE AND I'M NOT SURE WHY",
        "vin": "1N6MD29Y22C"
    }
]