[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/08/2017",
        "dateOfIncident": "06/07/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003839,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN STARTING FROM A STOP THE TRANSMISSION SLIPS INTO NEUTRAL AND THE CAR ROLLS UNPOWERED TO A STOP. IF THE ENGINE IS TURNED OFF AND TRANSMISSION IS SHIFTED TO \"PARK\" TO RESTART THE ENGINE IT IS THEN IMPOSSIBLE TO SHIFT THE TRANSMISSION OUT OF \"PARK\" INTO NEUTRAL OR ANY OTHER GEAR. WHENEVER THIS IS HAPPENING VARIOUS WARNING LIGHTS APPEAR ILLUMINATED ON THE WARNING PANEL-EG. \"LOW WASHER FLUID\" AND  \"TRACTION CONTROL WARNING.\" IN TRAFFIC THIS IS VERY DANGEROUS AND TO GET TO AN \"OUTSIDE LANE\" MAY BE IMPOSSIBLE. TO LOSE POWER WHEN STARTING FROM A STOP SIGN AND HAVING TO COAST TO A STOP IN THE LANE ONE HAS JUST ENTERED IS VERY DANGEROUS. TWICE WHEN TURNING LEFT WITH A LEFT-TURN GREEN ARROW THE TRANSMISSION FAILED AND I ROLLED TO A STOP, SHIFTED TO \"PARK\" TO RESTART THE ENGINE ONLY TO HAVE THE TRANSMISSION \"LOCK-UP\" IN \"PARK\" WITH ME UNABLE TO PHYSICALLY GET THE SELECTOR LEVER INTO \"DRIVE.\"  THIS CAR HAS BEEN SERVICED AT VW EVERY 10,000 MILES SINCE NEW AND AT 104,000 MILES I AM TOLD IT MAY NEED A NEW $7,000.00 TRANSMISSION.  ON-LINE I SEE THAT THE \"DSG TRANSMISSION \" HAS BEEN RECALLED TWICE FROM 2006 TO 2016 FOR \"SLIPPING INTO NEUTRAL.\"  HOWEVER, VW CLAIMS THERE ARE NO RECALLS FOR MY VEHICLE AND WHEN I DO A NTSC VIN SEARCH I FIND NO SUCH PROBLEM LISTED. MY NEAREST VW SERVICE DEPARTMENT IS 45 MILES AWAY VIA INTERSTATE AND CITY DRIVING AND I AM AFRAID TO ATTEMPT DRIVING THERE FOR A DIAGNOSIS. LOCAL TRANSMISSION SHOPS ARE UNABLE TO SERVICE OR EVEN DIAGNOSE OR MEASURE THE FLUID LEVEL IN THE VW PROPRIETARY SEALED-UNIT.",
        "vin": "3VWTL8AJ1AM"
    }
]