[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/13/2017",
        "dateOfIncident": "06/27/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005157,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY TACOMA WITH 15619 MILES ON THE ODOMETER IN FOR THE LEAKING DIFFERENTIAL CHECK ON MAY 2, 2017 AT A TOYOTA DEALER. THEY PERFORMED THE TOYOTA SPECIFIED RECALL BY CHECKING FOR LEAKS AND APPARENTLY FOUND NONE AND RE TIGHTENED THE FASTENERS. ON JUNE 27 I WAS CHECKING THE TACOMA PRIOR TO OUR LEAVING ON VACATION AND NOTICED SEEPAGE ON THE REAR DIFFERENTIAL IN 3 LOCATIONS. I EMAILED TOYOTA WITH MY CONCERN. I INFORMED THEM I WOULD BE TAKING MY TACOMA TO THE DEALER ON JUNE 28, 2017 TO HAVE IT LOOKED AT. I TOOK THE TACOMA ON JUNE 28, 2017 TO 2NDTOYOTA DEALER. I INFORMED THE SERVICE ADVISOR OF MY CONCERN WITH THE DIFFERENTIAL. THE MASTER TECH LOOKED AT IT. I FOLLOWED UP WITH TOYOTA CORPORATE BY PHONE INFORMED THEM OF MY CONCERNS AND WAS ADVISED TO SPEAK WITH THE SERVICE MGR. AND I DID. AFTER THE TECH HAD A CHANCE TO LOOK AT THE TACOMA I WAS ADVISED THAT I WOULD NEED TO HAVE THE REAR DIFFERENTIAL REPLACED. THE SERVICE MGR. TOLD ME THAT THEY WOULD ORDER THE PARTS TO REPAIR MY TACOMA AND I COULD HAVE USE OF A TRUCK ON LOAN FROM THE DEALERSHIP UNTIL MY TACOMA COULD BE REPAIRED. I RETURNED FROM VACATION MY TRUCK WAS NOT REPAIRED WAS TOLD TOYOTA WAS HAVING SOME TYPE OF ISSUE BECAUSE 1ST DEALER HAD ALL READY PERFORMED THE RECALL. HOWEVER, THE TACOMA BEGIN LEAKING AND THE DIFFERENTIAL WAS MAKING A LOUD NOISE AFTER THE RECALL WAS PERFORMED INITIALLY. I AM CONFUSED AS IT STILL SHOULD BE A WARRANTY COVERED ISSUE EVEN IF ANOTHER DEALER HAD ALL READY DID A RECALL. THE SERVICE ADVISOR AGREED AND THEY ARE STILL TRYING TO GET THE TRUCK REPAIRED. IT IS MY CONTENTION THAT THE 1ST DEALER DID THE RECALL CORRECTLY AND THE DIFFERENTIAL FAILED BECAUSE OF SUBSTANDARD PARTS OR DESIGN AFTER THE FIRST RECALL WAS DONE. MY CONCERN IS THAT MY TACOMA IS POTENTIALLY A RISK OF CRASH AS NOTED IN THE OFFICIAL TOYOTA RECALL. MY VEHICLE HAS BEEN AT THE DEALER SINCE JUNE 28TH 2017 OR 15 DAYS AND COUNTING.",
        "vin": "3TMCZ5ANXGM"
    }
]