[
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/30/2017",
        "dateOfIncident": "06/30/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002595,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. RELIGIOUSLY IN FOR ROUTINE OIL CHANGE AND MAINTENANCE, NOT DUE FOR AN OIL CHANGE FOR 1200 MORE MILES. THE VEHICLE SAT FOR 7 DAYS WHILE I WAS ON VACATION, RAN FINE BEFORE IT SAT. DROVE THE VEHICLE FOR 4 DAYS AFTER RETURNING FROM VACATION.  ABOUT 6PM COMING HOME FROM WORK, OPPOSITE FROM RUSH HOUR TRAFFIC. I SUDDENLY HEARD SLIGHT TICKING SOUND WHEN I PRESSED ON THE GAS TO ACCELERATE QUICKLY GETTING ON TO THE HIGHWAY, I ALSO NOTICED THE RPMS WERE HIGH AND NOT MUCH POWER BEHIND ACCELERATING. DROVE ABOUT 10-15 MILES, TICKING GOT LOUDER WHEN ACCELERATING UNTIL THERE WAS A CONSTANT TICKING AND RATTLE IN THE FRONT END. PARKED THE CAR LET IT SIT FOR A NIGHT. WENT TO TAKE IT TO THE GARAGE, UPON STARTING THE CAR THERE WAS TICKING FROM UNDER THE HOOD, RATTLELING, AND SHAKING, TURNED THE VEHICLE RIGHT OFF. NO CHECK ENGINE LIGHT, NO LOW OIL LIGHT, NO DASH NOTIFICATION LIGHTS LIGHT UP INDICATING ANYTHING WAS WRONG, TEMPERATURE SEEMED NORMAL. POPPED THE HOOD TO CHECK FLIUDS. CHECKED OIL DIPSTICK,  DRY AS DRY COULD BE. NO COOLANT, NO OIL. HAVE TO HAVE IT TOWED TO THE DEALERSHIP, AFRAID ENGINE IS SHOT! IF I WAS TO CONTINUE TO DRIVE THE VEHICLE IT COULD HAVE SEIZED UP IN THE MIDDLE OF THE  HIGHWAY, CAUSING AN ACCIDENT OR LOSS OF CONTROL. I AM THANKFUL MY 17 YEAR OLD WAS NOT BEHIND THE WHEEL. I AM SURE A HEAFTY ENGINE REPLACEMENT BILL IS COMING MY WAY.",
        "vin": "KM8SR4HF5DU"
    }
]