[
    {
        "components": "STEERING,SUSPENSION,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/20/2021",
        "dateOfIncident": "04/06/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389015,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2015 HYUNDAI ELANTRA IT STARTED MAKING A RATTLING NOISE FROM THE AREA AROUND THE ENGINE. THIS NOISE EVENTUALLY GREW TO A LOUD KNOCKING NOISE. THE KNOCKING NOISE CONTINUED AND I BEGAN TO FEEL IT VIBRATING IN MY STEERING WHEEL.   I TOOK MY CAR TO MY LOCAL HYUNDAI DEALERSHIP IN GRAND JUNCTION, CO TO HAVE IT LOOKED AT. THE SERVICE TECHNICIAN CAME OUT AND AS SOON AS I DESCRIBED IT HE SAID HE KNEW EXACTLY WHAT THE PROBLEM WAS BECAUSE THEY HAVE BEEN RECEIVING A LOT OF COMPLAINTS ABOUT IT. AFTER TURNING THE VEHICLE ON AND INSPECTING IT HE ASSURED ME THAT THE CONNECTION RODS AND BEARINGS WERE GOING OUT AND THAT I NEEDED TO REPLACE MY ENGINE THAT HAD 50,000 MILES ON IT. I WAS ALSO GIVEN THE OPTION TO ONLY REPLACE THE LOWER HALF OF MY ENGINE FOR HALF THE PRICE BUT THAT PRICE WOULD POSSIBLY EVEN OUT TO AN ENTIRE ENGINE REPLACEMENT BECAUSE THE COST OF LABOR WOULD GO UP.  I DECIDED TO RESEARCH THIS ISSUE FURTHER AND HAVE FOUND THAT RECALLS HAVE BEEN ISSUED FOR SEVERAL OTHER VEHICLES WITH THE SAME ENGINE AND ISSUE BUT MY VEHICLE HAS YET TO BE PART OF THE RECALL.   THIS HAS BEEN A MAJOR INCONVENIENCE FOR MY FAMILY AND I AS I HAVE NOT USED THIS VEHICLE SINCE MAY 2020 AND HAVE BEEN TOLD BY HYUNDAI THAT EVEN THOUGH THIS IS A COMMON ISSUE THERE IS NOTHING THAT CAN OR WILL DO TO HELP ME BECAUSE IT HAS NOT BEEN RECALLED FOR MY VEHICLE.",
        "vin": "5NPDH4AE3FH"
    }
]