[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/10/2017",
        "dateOfIncident": "06/27/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004178,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE EXPRESSWAY AND WENT TO USE MY BRAKES AND WITHOUT ANY WARNING I.E. BRAKE/ABS WARNING LIGHTS MY BRAKES WENT OUT.  I WAS ABLE TO AVOID ANY COLLISIONS WITH OTHER VEHICLES BY MANUALLY DOWN SHIFTING AND USING MY EMERGENCY BRAKE.  I WAS ABLE TO FINALLY COME TO A COMPLETE STOP BY UTILIZING ALL THE ABOVE PLUS USE BOTH OF MY FEET TO PUSH BRAKES HARD ENOUGH TO COME TO A SLOW STOP.  I TURNED THE CAR OFF WAITED A FEW MINUTES AND BACK ON SINCE THIS VEHICLE ALREADY HAD SERIOUS MALFUNCTION AT 10,000 MILES OF RANDOMLY STALLING WITHOUT WARNING DUE TO FAULTY WIRE HARNESS WHICH FINALLY GOT RECALLED A YEAR LATER.  TURNED IT BACK ON AND STILL NO BRAKES.  TOOK IT TO FORD DEALER AND WAS ADVISED THAT THE BRAKING SYSTEM HAD A LOT OF DEBRIS IN IT AND BRAKE BOOSTER, MASTER CYLINDER AND OTHER BRAKING COMPONENTS WHERE AT FAULT.  NOW THE DEALER HAS REPLACED ALL THE PARTS BUT STILL SAY IT IS NOT WORKING PROPERLY AND THEY ARE WAITING FOR GUIDANCE FROM FORD ENGINEERS.  THIS IS THE SAME ROUTE I HAD TO GO DOWN WITH MY WIRE HARNESS AT 10,000.  THE VEHICLE HAS 100,000 MOSTLY HIGHWAY MILES ON IT AND I WOULD NOT EXPECT FOR BRAKES TO JUST GO OUT WITHOUT ANY NOTICE OR BRAKE SYSTEM WARNING LIGHTS.  AS OF NOW STILL AT DEALER WAITING FOR ENGINEERS TO CALL IN WITH A \"FIX\".  I FEAR FOR MY SAFETY IN THIS VEHICLE AND THE BRAKE SYSTEM/ELECTRICAL SYSTEM NEED TO INVESTIGATED.  WHO KNOW HOW MANY PEOPLE MAY HAVE ALREADY OR ARE AT RISK OF LOSING THEIR BRAKES WITHOUT WARNING AND IT WILL NOT SHOW UP BECAUSE NO WARNING SENSOR/LIGHTS ARE ON.",
        "vin": "1FMCU9J99DU"
    }
]