[
    {
        "components": "STEERING,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/26/2017",
        "dateOfIncident": "06/25/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001474,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "IN AUGUST OF 2015 MY WIFE WAS DRIVING THE VEHICLE. ALL DASH LIGHTS CAME ON AND THE VEHICLE BECAME INOPERABLE AS A RESULT. AFTER SEVERAL ATTEMPTS SHE WAS ABLE TO RESTART THE VEHICLE. HOWEVER, AFTER ABOUT 150 FT ALL WARNING LIGHTS CAME ON AGAIN SAYING THAT IS WAS DISABLING SEVERAL SAFETY FEATURES (ABS, EYESIGHT, HILL ASSIST, ETC.). SHE AGAIN PULLED OVER, AND THE VEHICLE WOULD NOT RE-START (FLAT-OUT WOULD NOT COME ON, THE POWER WOULD COME ON BUT THE VEHICLE WOULD NOT START [HAS A KEY LESS IGNITION SYSTEM]). SHE CALLED ROAD SIDE ASSIST AND THEY CAME TO TRY AND HELP HER WITH THE CAR. THEY WERE ABLE TO GET IT STARTED AND SHE DROVE IT TO THE DEALERSHIP. THEY TOOK THE VEHICLE IN AND LOOKED AT IT. THEIR SERVICING NOTES INDICATE THAT THEY WERE UNABLE TO REPLICATE THE ISSUE, HOWEVER, WHILE MY WIFE WAS THERE THEY WERE UNABLE TO START THE VEHICLE AS WELL. IN REVIEW OF THESE NOTES THEY INDICATE THE FOLLOWING ERROR CODES WERE PRESENT P1531 AND B2809 AND THEY ALSO REPLACED THE FOLLOWING PART [83311FJ000]. ON JUNE 25, 2017, THE PROBLEM OCCURRED AGAIN WHILE DRIVING. ALL SAFETY FEATURES DISABLED, ALL SYSTEMS SHUT-OFF. ONCE I TURNED THE VEHICLE OFF I WAS UNABLE TO START IT AGAIN. IT SEEMED AS IF I WAS UNABLE TO DEPRESS THE BRAKE PEDAL FAR ENOUGH TO TRIGGER THE KEYLESS START FEATURE. SO, THE VEHICLE WAS UNUSABLE AND UNSAFE. I CONTACTED SUBARU AND THEY HAVE TOWED THE VEHICLE TO THE DEALERSHIP AS ALL ATTEMPTS TO START THE VEHICLE HAVE FAILED (ALL POWER WORKS, BUT NO START AND ALL SAFETY FEATURES INDICATE THEY ARE DISABLED). I SPOKE WITH THE DEALERSHIP AND EXPRESSED ALL OF THESE CONCERNS AS WELL AS SEVERAL OTHERS. THE VEHICLE IS AT THE DEALERSHIP AT THIS TIME. IN ALL INSTANCES WHEN THE VEHICLE HAD ISSUES WE WERE EITHER DRIVING ON A CITY STREET, A LOCAL HIGHWAY, OR UNABLE TO START THE VEHICLE DUE TO THESE PROBLEMS. THIS IS THE SECOND OCCURRENCE IN LESS THAN THREE YEARS.",
        "vin": "JF2SJAWCXFH"
    }
]