[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/09/2017",
        "dateOfIncident": "07/03/2017",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003897,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 CROWN VICTORIA. FORD HAS A RECALL OUT FOR 2003-2005 GRAND MARQUIS AND CROWN VICTORIA'S FOR THEIR LIGHT CONTROL MODULE (LCM) BECAUSE OF SOLDERS BREAKING CAUSING EXTERIOR LIGHTING NOT TO WORK. I TOOK MY CAR TO MY LOCAL FORD DEALERSHIP (APRIL 22, 2017)  TO HAVE SUCH RECALL DONE BECAUSE MY EXTERIOR RUNNING LIGHTS WERE NOT WORKING. (PARKING LIGHTS FRONT AND RUNNING LIGHTS REAR) I ALSO ADVISE THE DEALERSHIP OF THIS. WHICH IS DOCUMENTED ON THE RECEIPT I HAVE KEPT. FORD DOESN'T REPLACE THE ACTUAL LCM, ALL THEY DO IS INSTALL A \"BYPASS HARNESS\" TO BYPASS THE ISSUE WHICH DOES NOT FIX THE PROBLEM. I LEFT THE DEALERSHIP WITH THE SAME LIGHTS STILL NOT IN WORKING CONDITION. AGAIN, STATED ON RECEIPT. THE PROBLEM FIXED ITSELF AND I ASSUMED IT WENT AWAY. NOW IT'S BACK BUT EVEN WORSE. AGAIN MY EXTERIOR LIGHTS ARE NOT WORKING, PARKING AND REAR RUNNING LIGHTS, AND NOW MY INTERIOR INSTRUMENT CLUSTER LIGHTS ARE NOT WORKING AS WELL. FORD KNOWS ABOUT THIS ISSUE. FORD REFUSES TO REPLACE THE FAULTY LCMS IN THESE CARS. I KNOW OF SEVERAL OTHER PEOPLE WITH THE EXACT SAME ISSUE I'M HAVING WHO HAVE CALLED FORD AND COMPLAINED. THIS IS A HUGE SAFETY ISSUE BECAUSE THERE ARE NO REAR RUNNING LIGHTS AT NIGHT, PERIOD. WHEN IT'S PARKED, ON ROADWAYS, HIGHWAYS, ETC. NO ONE CAN SEE ME AT NIGHT FROM THE REAR.. AND THE DASH LIGHTS ARE NOT ON. I CAN PROVIDE WHATEVER NEEDED TO HELP BECAUSE THIS NEEDS TO BE ADDRESSED ASAP. I'LL CALL TOMORROW IF I HAVEN'T HEARD BACK BEFORE.",
        "vin": "2FAHP71W24X"
    }
]