[
    {
        "components": "EXTERIOR LIGHTING,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/11/2017",
        "dateOfIncident": "09/12/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004358,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2013 NISSAN ALTIMA IS THE WORST CAR I HAVE EVER OWNED.  SINCE I HAVE PURCHASED IT, THERE HAS BEEN A CONSTANT ENGINE NOISE UNTIL I REACH ABOUT 40 MPH.  JUST IN THE PAST 3 MONTHS, WITHIN WEEKS OF EACH OTHER BOTH FRONT INSIDE DOOR HANDLES HAVE BROKE (MY KIDS AND I HAVE TO ROLL DOWN BOTH WINDOWS JUST TO GET OUT OF THE CAR WHICH WOULD BE A HUGE SAFETY ISSUE IN THE EVENT OF A FIRE, CRASH OR BEING TRAPPED IN THE CAR AT ALL), THE DOME LIGHTS THROUGH THE INSIDE OF THE CAR HAVE STOPPED WORKING (WHICH IS A SAFETY ISSUE BECAUSE THERE IS NO WAY TO SEE INSIDE MY VEHICLE AT NIGHT), THE LIGHT IN THE DRIVER'S SIDE DOOR PANEL FELL OUT, THE AC HAS GONE OUT (AND THE COMPRESSOR PART IS $425!!!! ARE YOU SERIOUS?!?!?! I HAVE A 10.5 MONTH OLD AND IT IS 100 DEGREES OUTSIDE!!! ANOTHER HUGE SAFETY ISSUE) AND NOW THERE IS ANOTHER NOISE COMING FROM THE ENGINE AT ALL SPEEDS, A GRINDING NOISE.  I AM A SINGLE MOM OF THREE KIDS WHO I SUPPORT ON MY OWN.    I CANNOT AFFORD TO FIX THESE THINGS.  I BOUGHT THIS CAR BECAUSE IT WAS SUPPOSED TO BE \"RELIABLE\".  AND IT IS NOT! THERE HAVE BEEN SO MANY COMPLAINTS REGARDING ALL OF THE SAME THINGS THAT I AM EXPERIENCING AND A RECALL NEEDS TO BE DONE ON ALL OF THEM.  THIS CAR IS BARELY 4 YEARS OLD AND THESE PROBLEMS SHOULD NOT BE HAPPENING!!!!  DO SOMETHING NISSAN!  YOU ARE LOSING CUSTOMERS AND REPUTATION IS ON THE LINE!",
        "vin": "1N4AL3AP7DC"
    }
]