[
    {
        "components": "SUSPENSION,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/28/2021",
        "dateOfIncident": "03/15/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390515,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK VEHICLE INTO FORD DEALER FOR SERVICE ON FRONT WHEEL, YESTERDAY 1/ 27/ 2021, WHICH IS UNRELATED.  SERVICEMAN TOLD ME THAT, DUE TO EXCESSIVE RUST,  THE UNDERFRAME HAS UP TO SIX CRACKS IN IT AND THAT THE VEHICLE IS UNSAFE TO DRIVE.  THE VEHICLE IS THIRTEEN YEARS OLD.  HE STATED THAT THERE IS NO REPAIR FOR THIS EXCEPT TO REPLACE THE WHOLE UNIBODY UNDERFRAME, WHICH FORD TAKES NO RESPONSIBILITY FOR.  I HAD TO REPLACE THE TWO REAR SHOCK TOWER HOUSINGS BECAUSE ONE POPPED THROUGH THE FLOOR ON SEPT., 2020.  THE OUTER BODY HAS SOME RUST BUT LOOKS GOOD, NORMAL RUST FOR IT'S AGE. ON THE INTERNET I RESEARCHED THE PROBLEM AND IT SHOWS THAT THE 2001 TO 2003 ESCAPES HAVE HAD A POSSIBLE RECALL AND SHOWS THAT ONE FORD DEALER HAD A 'FIX' FOR THE ENGINE CRADLE, THAT DID NOT WORK OUT WELL. THERE ARE NUMEROUS COMPLAINS ONLINE ABOUT UNDERCARRIAGE RUST AND ITS PROBLEMS.  I'VE ALSO TALKED TO A BODY SHOP OWNER AND HE TELLS ME THAT THEY GET SEVERAL ESCAPES A YEAR FOR THIS PROBLEM.  WHEN I TOOK MY VEHICLE IN TO GET THE REAR WHEEL HOUSE MOUNTINGS REPLACED, THERE WAS ANOTHER ESCAPE BEING REPAIRED FOR THE SAME THING IN FROM OF MINE.  MY VEHICLE WAS  REPAIRED AT IRON MIKE'S METAL FAB SHOP IN FLINT, MI.  810 234 2996,  OF COURSE WELDING ANY METAL TO RUSTED METAL HAS NO GUARANTEE..  TRUCK WAS IN MOTION ON A RESIDENTIAL STREET WHEN THE SHOCK STARTED BREAKING THROUGH THE FLOOR, AROUND MARCH OF 2019. NOW I AM STUCK WITH A VEHICLE THAT I HAVE TO USE, WHICH IS UNSAFE TO DRIVE. THIS VEHICLE, ACCORDING TO YOUR STANDARD IS UNDER FIFTEEN YEARS OLD.",
        "vin": "1FMCU94128K"
    }
]