[
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/09/2022",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455915,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "MALIBU",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Chevrolet Malibu. The contact stated that while driving at 60 MPH, the accelerator pedal sensor failed with the check engine warning light and several other unknown warning lights illuminated. As the vehicle entered reduced power mode, the vehicle independently slowed down as the contact pulled to the side of the road. The contact was able to restart the vehicle and took the vehicle to a dealer. The dealer informed him that the accelerator pedal sensor was defective and needed to be replaced. The contact was also informed that the parts to repair the vehicle were unavailable. The contact then had an independent mechanic replace the accelerator pedal and the sensor. The contact also stated that while merging onto a highway at 60 MPH, the vehicle stalled with several unknown warning lights illuminated. The vehicle entered reduced power mode as the contact pulled off to the side of the highway. The contact was able to exit the highway and drove the vehicle slowly back to his residence. The following day, the vehicle was towed back to the dealer where he was informed that the high-pressure fuel pump failed and that the vehicle was not included in NHTSA Campaign Number: 18V358000 (Fuel System, Gasoline). The manufacturer was not notified of failure. The vehicle was repaired but remained at the dealer. The failure mileage was approximately 32,000.",
        "vin": "1g1zb5st6hf"
    }
]