[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/15/2018",
        "dateOfIncident": "06/01/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102115,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-150",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAS FAILED ELECTRONICALLY ON SEVERAL INSTANCES.  GENERALLY THE CENTER CONTROL PANEL WILL NOT COME ON WHICH MEANS THE RADIO DOES NOT WORK.  OTHER TIMES THE FAN BLOWER WILL ALSO NOT COME. IN THE WORST INSTANCE, NONE OF THE LIGHTS WILL COME ON NOR THE INSTRUMENT PANEL TO BE ABLE TO KNOW HOW FAST I AM DRIVING, TEMPERATURE, ALERTS, OR ANYTHING THAT NEEDS POWER OTHER THAN TO START/DRIVE THE TRUCK.  I ALSO NOTED WHEN I SHIFTED GEARS ON THE TRANSMISSION, IT DID NOT INDICATE WHAT GEAR/DRIVING MODE THE VEHICLE WAS ACTUALLY IN.  THIS HAS OCCURRED ON NO LESS THAN A HALF DOWN INSTANCES. THE DEALER HAS NOT BEEN ABLE TO REPLICATE THE ISSUE AS IT IS INTERMITTENT SINCE I PURCHASED THE VEHICLE BRAND NEW OFF THE LOT.  IT HAS NOT OCCURRED AFTER EVERYTHING IS ALREADY OPERATIONAL WHILE DRIVING, ONLY AT STARTUP/IGNITION POINT. I HAVE ATTEMPTED TO RESET IT MULTIPLE TIMES BY TURNING THE VEHICLE OFF/ON AND REMOVING THE KEY FROM THE IGNITION BUT IT DOES NOT SEEM TO SOLVE THE PROBLEM AS IT RANDOMLY COMES ABOUT AND THEN RANDOMLY GOES AWAY.  IT DOES NOT APPEAR TO BE AFFECTED BY BUMPS (LOOSE WIRE) OR EVEN TAPPING THE DASH TO SEE IF ANYTHING CHANGES.  I HAVE ALSO PULLED THE MAIN FUSES THAT CONTROL THESE AREAS AND FOUND NO PROBLEMS WITH THE FUSES.  RESETTING THE ENTIRE SYSTEM DID NOT ALSO HAVE AN AFFECT BY DISCONNECTING THE BATTERY BUT DID WORK IN ONE INSTANCE HOWEVER IT DID NOT IN OTHERS.",
        "vin": "1FTEW1EF5GF"
    }
]