[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/01/2021",
        "dateOfIncident": "02/16/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398515,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SOUL",
                "productYear": "2020",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION FAILED WHILE DRIVING ON HIGHWAY CREATING A POTENTIALLY VERY DANGEROUS SITUATION.  AS I WAS DRIVING ON THE HIGHWAY, I NOTICED THE ENGINE REVVING UP FOR NO APPARENT REASON.  AT FIRST I THOUGHT THAT PERHAPS THE TIRES WERE SPINNING ON BLACK ICE OR A FROZEN FROST ON THE PAVEMENT.  NOPE, IT CONTINUED TO HAPPEN ON VERY DRY SECTIONS OF THE HIGHWAY.  MAYBE IT WAS THE CRUISE CONTROL CAUSING THE ENGINE TO SURGE.  NOPE, IT CONTINUED TO HAPPEN AFTER TURNING IT OFF.  THE CAR BEGAN SLOWING ON A LONG UPHILL GRADE EVEN THOUGH THE ENGINE WAS STILL RUNNING. AN ERROR MESSAGE STATING \"A PROBLEM HAS BEEN DETECTED WITH THE TRANSMISSION CONTROL UNIT\" WAS DISPLAYED. I PULLED INTO THE EMERGENCY LANE AND DISCOVERED THAT THE TRANSMISSION WOULD NO LONGER ENGAGE INTO ANY GEAR - REVERSE, DRIVE, OR MANUAL SHIFT MODE GEARS 1, 2, 3, AND 4 - NOTHING.  I TURNED THE CAR OFF AND RESTARTED IT.  SAME RESULTS. AFTER 30 MINUTES OF DOING THIS, THE TRANSMISSION ENGAGED INTO AN UNDER-POWERED GEAR AND I WAS ABLE TO SLOWLY DRIVE IN THE EMERGENCY LANE A MILE TO THE NEXT EXIT.  IT HAD A LIGHTED INTERSECTION AT THE END OF IT AND I HAD TO COME TO A STOP.  WHEN IT TURNED GREEN, THE TRANSMISSION FAILED TO ENGAGE AGAIN. I ENDED UP BLOCKING THE RAMP AS I SAT THERE FOR AN HOUR TRYING TO GET THE CAR MOBILE AGAIN. I WAS AFRAID THAT I WAS GOING TO GET REAR-ENDED. EVENTUALLY IT RE-ENGAGED AND I WAS ABLE TO DRIVE THE CAR TO A SAFE PARKING AREA OUT OF TRAFFIC AND WAIT FOR A TOW TRUCK. KIA IS GOING TO REPLACE THE TRANSMISSION BUT I WILL NOT TRUST THE RELIABILITY OF IT ONCE I HAVE THE VEHICLE BACK.  I'M VERY WORRIED THAT IT WILL HAPPEN AGAIN AND FEEL THAT THIS VEHICLE IS NOW VERY UNSAFE. WHAT WOULD HAPPEN IF IT FAILED AGAIN LATE AT NIGHT IN AN UNPOPULATED AREA WITH NO CELL SERVICE DURING A BLIZZARD AND MY WIFE WAS DRIVING? THIS IS CREATING A POTENTIALLY EXTREMELY DANGEROUS SITUATION AND A RECALL SHOULD BE MANDATED.",
        "vin": "KNDJ33AU2L7"
    }
]