[
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "01/04/2022",
        "dateOfIncident": "11/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446215,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2019 Ford F-250. The contact stated that while driving at an undisclosed speed, the electronic tailgate opened without warning. The vehicle was taken to the local dealer where it was diagnosed that the wiring harness needed to be replaced. The vehicle was repaired however, the failure recurred. The vehicle was taken to the same local dealer however, the mechanic was unable to duplicate the failure. The mechanic informed the contact that the key fob button might have been opening the tailgate. The manufacturer was notified of the failure and a case was filed. The contact was informed not to drive with the key fob in his pocket. The approximate failure mileage was 12,500. After last servicing done by Apple Ford I received a phone call from their customer service on a bad review I gave with the safety issue with the tailgate open while driving. What Apple Ford found out from their regional Manager was that the tailgate can be opened with the key fob while the truck is moving from 0 mph to 3.1 mph. I tested this and my finding were as follows: (1st test) Sat in truck while it running, and in Park. Pressed tailgate open on Key fob and tailgate would not open. (Test 2) While sitting in truck with it running and foot on brake pedal, I put truck in Drive and pressed tailgate open on Key Fob and tailgate opened. (Test 3) While in track and it's running, I put into Drive and start to move forward (between 1 and 2 mph). As the truck started roll, I pushed the Tailgate open button on the Key Fob and the tailgate opened. (Test 4) Same as Test 3, but I waited till truck was moving about 15 mph before I pressed the Tailgate open button on the Key Fob, and the Tailgate did not open. NOTE: There is notification lights or sounds on the instrumental panel that indicated that the tailgate is unlocked or open. Where the Safety issue is when towing trailer or even caring something tin the truck bed and when you come to a stop (with Key Fob in pocket) there is the risk of coming to a stop (light) and somehow the Open Tailgate button gets pressed while in my pocket and the tailgate opens and I have no idea that it open. This a SAFETY Issue, Potential of losing load out of truck bed, causing accident when towing camper/trailer.",
        "vin": "1FT7W2B63KE"
    }
]