[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/20/2017",
        "dateOfIncident": "12/19/2017",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055615,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SAFETY DEFECT/NON COMPLIANCE DESCRIPTION AND SAFETY RISK    THE ALTERNATOR MAY EXPERIENCE DIODE THERMAL FATIGUE FAILURE DUE TO CYCLICAL LOADS INDUCED BY ELECTRO-HYDRAULIC POWER STEERING. FAILED DIODES MAY ALSO DEVELOP A RESISTIVE SHORT CIRCUIT THAT CAN RESULT IN HEAT, SMOKE AND/OR FIRE ORIGINATING WITHIN THE ALTERNATOR.    REPAIR DESCRIPTION    THE ALTERNATOR PART NUMBER MUST BE INSPECTED ON ALL INVOLVED VEHICLES. VEHICLES FOUND WITH THE SUSPECT ALTERNATOR WILL HAVE IT REPLACED WITH A NEW ALTERNATOR CONTAINING IMPROVED DIODES ON ALL AFFECTED VEHICLES.    RECALL STATUS  INCOMPLETE BUT REPAIR PARTS ARE NOT AVAILABLE  GET NOTIFIED WHEN PARTS ARE AVAILABLE    ON DECEMBER 19, 2017 WE EXPERIENCED ONCE AGAIN ANOTHER PROBLEM. AFTER MY SON'S YOUTH BASKETBALL GAME, WE WENT TO THE PARKING LOT TO HEAD A COUPLE OF BLOCKS HOME AT APPROXIMATELY 8:15 PM. TURNING OUT ONTO THE ROADWAY, THE DASHBOARD LIT UP WITH WARNING LIGHT STATING THAT THE BATTERY WAS LOW AND THE ELECTRONIC POWER STEERING STARTED HOWLING. I SHUT DOWN AS MUCH OF THE INFOTAINMENT CENTER AS POSSIBLE TO CONSERVE POWER TO MAKE SURE THAT I MADE IT HOME. THE FRONT WINDSHIELD STARTED TO FOG UP SO I TURNED THE DEFROSTER ON LOW. AS SOON AS THE AIR STARTED COMING OUT, I COULD SMELL AN ELECTRICAL FIRE. UPON MY ARRIVAL HOME, I POPPED OPEN THE HOOD AND COULD SMELL ELECTRICAL BURN. I DECIDED TO SHUT THE VEHICLE OFF AND RESEARCH RECALLS AND TECHNICAL SERVICE BULLETINS. I BELIEVE THIS NEW ISSUE FALLS UNDER RECALL T75.",
        "vin": "1C4RJFBG7EC"
    }
]