[
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/02/2020",
        "dateOfIncident": "11/25/2020",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377415,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED THE CAR TO GET HEATER GOING AND WARMED UP AND STARTED BUCKLING MY KIDS UP IN THEIR CAR SEATS. THAT'S WHEN I STARTED TO SMELL AN ELECTRICAL BURNING SMELL COMING THROUGH THE VENTS. I TURNED THE HEATER OFF AND THE SMELL GOT STRONGER. I TURNED THE HEATER BACK ON AND SMELLED IT EVEN WORSE. I IMMEDIATELY SWITCHED IT TO AC INSTEAD OF HEAT AND THEN I STARTED TO NOTICE SMOKE COMING THROUGH THE AIR VENTS. I IMMEDIATELY TURNED THE CAR OFF. THE SMOKE CONTINUED TO BELLO OUT OF THE AIR VENTS. AS SOON AND THE INTERIOR LIGHTS TURNED OFF I NOTICED A GLOW UNDER THE PASSENGER DASH DOWN BY THE CORNER OF THE FLOORBOARD. WHEN I WENT AROUND TO LOOK TO SEE WHAT WAS GLOWING I NOTICED THERE WAS A FIRE DOWN IN THAT CORNER AND IT WAS ALREADY BIG ENOUGH THAT I COULDN'T BLOW IT OUT NO MATTER HOW HARD I BLEW. I AM THANKFUL THAT I KEEP A FIRE EXTINGUISHER IN MY GARAGE AND WAS ABLE TO QUICKLY PUT IT OUT.  I NORMALLY STRAP MY KIDS IN AND TURN ON A MOVIE FOR THEM WHILE I GO BACK IN THE HOUSE AND SPEND AROUND 3 TO 5 MINUTES GETTING THE KIDS WATERS, MAKING SURE THE DIAPER BAG IS STOCKED, AND BASIC STUFF LIKE THAT. HAD THAT FIRE STARTED AFTER I WALKED BACK IN THE HOUSE I AM SURE THAT I WOULD HAVE LOST MY KIDS IN A BLAZE, STRAPPED IN TO CAR SEATS, THAT DAY. IT WAS THANKSGIVING EVE.  I FOUND OUT THAT THE BLOWER FAN FOR THE VENTS IS WHAT SPARKED UP AND CAUGHT FIRE. THERE ARE NO RECALLS BY FORD FOR THIS AND I HAVE FOUND OUT THAT I AM NOT THE ONLY ONE THIS HAS HAPPENED TO. THIS IS AN ENORMOUS SAFETY HAZARD AND I AM SHOCKED THAT IT HAS GONE IGNORED BY FORD. DOES AN ACTUAL DEATH NEED TO TAKE PLACE BEFORE THEY SET IT RIGHT?  BECAUSE I DID JUST BUY IT; THE DEALERSHIP REPLACED THE FAN. BUT THE FLOORBOARD IN THAT CORNER IS ALL BURNT UP AND AM NOW QUESTIONING WHAT MORE SERIOUS DAMAGE IS IN THAT DASH THAT I CAN'T SEE. LIKE THE AIRBAG OR OTHER ELECTRONIC WIRING THAT MAY NOW BE AT RISK.*DT*JB",
        "vin": "1FMJK1JT8GE"
    }
]