[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/08/2017",
        "dateOfIncident": "03/21/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003804,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A FRONT PASSENGER SIDE DOOR AJAR LIGHT THAT IS ON.   IT CAME ON JUST AFTER THE WARRANTY EXPIRED.  AS TIME WENT ON, IT CAUSED MY BATTERY TO GO DEAD LEAVING MY WIFE AND DAUGHTER STRANDED.  AFTER REPLACING THE BATTERY I DID SOME ONLINE RESEARCH AND FOUND THAT THIS IS UNFORTUNATELY A VERY COMMON PROBLEM THAT FORD IS UNWILLING TO ADDRESS.  I ALSO DETERMINED THAT I NEEDED TO REMOVE THE DOME LIGHT FUSE TO DISABLE THE INTERIOR DOME LIGHTS  FROM STAYING ON AND CAUSING ANOTHER BATTERY FAILURE.  CHECKING WITH THE FORD DEALERSHIP, I FOUND TO REPAIR THE WOULD COST ME  $385.00, AND THAT THE PROBLEM HAS NO RECALL.  THIS CONDITION IN MY OPINION IS DANGEROUS, NOT ONLY DOES IT CAUSE THE BATTERY TO EVENTUALLY FAIL, BUT IF YOU REMOVE THE DOME LIGHT FUSE, IT CAUSES THE DOOR LOCKS NOT AUTOMATICALLY LOCK, SO YOU HAVE TO MANUALLY LOCK EACH DOOR AND THE HATCH,  BECAUSE WHEN THE KEY IS IN THE IGNITION, THE DOOR LOCKS WON'T LOCK.  ALSO, YOU HAVE NO INTERIOR LIGHTNING AT NIGHT WHEN YOU OPEN THE DOORS, PLUS YOU LOSE THE LIGHTING ABILITY ON THE STEERING WHEEL COMPONENTS.  THIS IS A DEFINITE SAFETY ISSUE THAT FORD NEEDS TO STEP UP AND ADDRESS.  EVERYONE THAT I HAVE SPOKEN WITH THAT HAS AN EDGE, HAS HAD ONE OF THESE SENSORS PROBLEMS ON AT LEAST ONE OR MULTIPLE DOORS.  I HAVE BEEN TOLD THAT FORD IS MORE THAN AWARE OF THE PROBLEM, BUT DOESN'T CONSIDER IT RECALL WORTHY.  I REALLY THOUGHT MORE OF FORD MOTOR COMPANY THAN THIS, BUT I GUESS I WAS WRONG",
        "vin": "2FMDK4JC9DB"
    }
]