[
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/28/2017",
        "dateOfIncident": "06/12/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001953,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2016 PRIUS 2 SEDAN WINDSHIELD WAS STRUCK BY A SMALL ROCK CAST LATERALLY ACROSS THE FREEWAY FROM SEVERAL LANES TO MY RIGHT, AS ONE WOULD SKIP A STONE ACROSS WATER, TRAVELING ABOUT 55MPH. UNFORESEEABLE, UNAVOIDABLE ACT OF CHANCE, KICKED UP BY ANOTHER CAR'S TIRE. INITIAL DAMAGE (SEE PHOTO SERIES) WAS TWO UNSIGHTLY BUT REPAIRABLE CRATERS IN THE OUTER LAYER OF GLASS. WITHIN MINUTES / BEFORE AN EPOXY REPAIR WAS POSSIBLE, TWO CRACKS GREW AT AN ALARMING RATE. A SMALLER CRACK WENT VERTICALLY, AND A FAST AND LARGE CRACK RAN HORIZONTALLY. WITHIN A DAY IT SPANNED THE ENTIRE DRIVER'S SIDE. THE CRACK REFLECTS AND REFRACTS LIGHT INTO THE DRIVER'S EYES, AND IS THICK ENOUGH TO OBSTRUCT VISION EVEN IN DIM LIGHT. OUR PRIMARY TRAVEL IS EAST IN THE MORNING AND WEST AT NIGHT, SO THE OBSTRUCTION OF VISION IS AN ACTIVE DANGER AS WE ARE TYPICALLY ORIENTED ON THE SUN.  I WAS ADVISED BY THREE DIFFERENT GLASS SERVICES THAT NOT ONLY IS THERE NO AFTERMARKET WINDSHIELD AVAILABLE, BUT THAT THERE WAS AN UNKNOWN WAIT TIME TO RECEIVE ONE FROM THE ONLY AVAILABLE SOURCE, TOYOTA. THERE IS NO INTEGRATED TECHNOLOGY AND I WAS QUOTED REPLACEMENT COSTS OF $800-$900, NOT COVERED BY INSURANCE.     I HAVE REVIEWED THE FORUMS, NHTSA SITE, AND A PROMINENT COMPLAINT SITE, AND EXCESSIVE CRACKING APPEARS TO BE A FREQUENT FLAW, BOTH FROM DEBRIS IMPACTS AND WHEN OWNERS REPORT \"SPONTANEOUS\" CRACKING.  OUR GLASS SHOPS STATED THEY SAW THIS PROBLEM MORE FREQUENTLY ON TOYOTAS THAN ON ANY OTHER CAR. GIVEN THE COST AND FREQUENCY THIS PROBLEM IS REPORTED, I AM HESITANT TO REPLACE THE WINDSHIELD UNTIL I GET A REASONABLE RESPONSE FROM THE DEALER, AS IT OTHERWISE SEEMS LIKELY TO RECUR. THIS IS NOT A ONE-OFF PROBLEM. DEALER WON'T RETURN CALLS. GLASS SERVICE STILL HAS NO ETA ON REPLACEMENTS.     WE WOULD LIKE TO UNDERSTAND WHY THIS PROBLEM IS SO COMMON. THANK YOU.",
        "vin": "JTDKBRFU2G3"
    }
]