[
    {
        "components": "AIR BAGS,SEAT BELTS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/05/2017",
        "dateOfIncident": "02/12/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003209,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "RENEGADE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I BELIEVE THERE IS A PROBLEM WITH THE ELECTRICAL SYSTEM WITH THIS 2016 JEEP RENEGADE TRAILHAWK WHICH I BOUGHT NEW IN 01/07/2017.     THESE PROBLEMS BELOW HAPPEN AT RANDOM TIMES: DRIVING CITY, HIGHWAY, PARKED. STARTED AROUND 1300 MILES WHICH WAS AROUND 02/12/2017; LAST TIME I PICKED IT UP FROM THE DEALER WAS 06/30/2017 WHICH THEY HAD IT FOR 10 DAYS.      FREEZING CLUSTER, REAR REVERSE CAMERA STAYING ON WHILE IN DRIVE, ALARM GOING ON AND OFF ON ITS OWN.     THE MAIN SAFETY CONCERN I HAVE AND HAVE BEEN BACK TO THE DEALER THREE TIMES IN 6,000 MILES WITH NO SOLUTIONS: IS THE ALARMS OF 'SERVICE ELECTRONIC PARKING BRAKE' ALERT GOING ON WHICH IS 90% TIME PAIRED UP WITH 'SERVICE AIRBAG SYSTEM' ALERT GOING ON, AND THE SEATBELT WARNING SYSTEM FLASHING ON. SOMETIMES IT WILL CLEAR ITSELF, OTHER TIMES IT WILL CLEAR WHEN I STOP TURN THE CAR OFF, AND THEN BACK ON.     DEALER SAYS THERE IS NO ERRORS IN THE SYSTEM, AND IT DIDN'T HAPPEN WHILE THEY HAD THE VEHICLE.    JULY 5 STILL GOING ON MORE FREQUENTLY. I CALLED DEALER TWICE IN THE LAST FIVE DAYS AND I HAVE NOT RECEIVED A CALL BACK.  I DO NOT FEEL SAFE IN MY VEHICLE, I HAVE PERSONALLY WITNESSED WHILE WORKING ON A FIRE ENGINE AND AMBULANCE THAT AIR BAGS SOMETIMES DO NOT GET DEPLOYED FOR VARIOUS REASONS, AND THE OUT COME IS SOMETIMES NOT GOOD FOR THE PASSENGERS. I HAVE ALSO SEEN THAT WHEN AIR BAGS DEPLOY PROPERLY IT CAN SAVE LIVES. I DO NOT TRUST MY VEHICLE FOR THE SAFETY OF MY FAMILY AND I.      I DO HAVE ALL DOCUMENTATION FROM THE DEALERSHIP. AS WELL AS VIDEO'S ON MY IPHONE OF THIS HAPPENING.",
        "vin": "ZACCJBCT5GP"
    }
]