[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/13/2017",
        "dateOfIncident": "06/09/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005039,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF R",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED THE (NEW) CAR ON JUNE 09, 2017. 5 DAYS AFTER WE PURCHASED, WE FOUND OUT THE TRANSMISSION HAD BEEN REPLACED AND THAT FACT WAS NOT DISCLOSED BY THE DEALERSHIP.  THE DEALERSHIP MAINTAINS THEY ARE NOT REQUIRED TO DISCLOSE SERVICE ACTIONS AND FURTHER STATED VW CONCURRED.  VW MAINTAINS THE RECALL WAS ISSUED BY NHTSA. HERE IS THEIR EMAIL RESPONSE INDICATING SAME:    REFERENCE # 170784881    THANK YOU FOR REACHING BACK OUT TO ME. I APOLOGIZE FOR THE DELAY IN MY RESPONSE, AS WELL AS FOR THE EXPERIENCES YOU'VE HAD WITH YOUR VEHICLE AND THE DEALER.     I CAN SEE THAT YOU HAVE BEEN IN CONTACT WITH SARAH G., WHO WAS THE REGION CASE MANAGER WHO HAD WORKED YOUR PREVIOUS CASE, AS WELL AS THAT SHE HAS REACHED OUT TO THE DEALER TO TRY AND TURN THE EXPERIENCE AROUND.    FROM OUR UNDERSTANDING, THE TRANSMISSION WAS REPLACED DUE A SERVICE ACTION THAT WAS ISSUED BY NHSTA. THE REPAIRS THAT WERE COMPLETED BEFORE PURCHASE WERE TO BENEFIT THE SAFETY OF VEHICLE, AS WELL AS THE DRIVER(S). I APOLOGIZE THAT THAT DEALER DID NOT DISCLOSE THIS INFORMATION TO YOU AT THE TIME OF PURCHASE; HOWEVER, THE DEALER WAS JUST DOING AS THEY WERE TOLD BY NHTSA. AT THIS TIME, THERE WOULDN'T BE ANYTHING FURTHER THAT VWGOA WOULD BE ABLE TO DO. ANY RESOLUTION YOU'RE SEEKING WOULD NEED TO COME FROM THE DEALER LEVEL.    IF YOU HAVE ANY OTHER CONCERNS, PLEASE CONTACT VOLKSWAGEN GROUP OF AMERICA AT 800-822-8987 OR CHAT OR EMAIL US AT WWW.VW.COM.    I HAVE COMPLETE EMAIL AND TEXT DOCUMENTATION FROM THE DEALER AND VW.    A TOTAL OF 250 2017 VW GOLF R'S ARE SUPPOSED TO BE AFFECTED.    IS VW CORRECT IN THAT NHTSA ISSUED THE RECALL OR SERVICE ACTION? DON'T VW AND THE DEALER HAVE AN OBLIGATION TO DISCLOSE THAT A MAJOR SAFETY/PERFORMANCE COMPONENT WAS REPLACED PRIOR TO THE SALE?",
        "vin": "WVWVF7AU1HW"
    }
]