[
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/07/2017",
        "dateOfIncident": "06/07/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11003543,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUN VISOR BROKE WHILE ATTEMPTING TO LOWER IT INTO POSITION WHILE DRIVING. THE PLASTIC PARTS THAT SURROUND THE ARM INSIDE OF THE VISOR BROKE. THE SOUND AND MOVEMENT OF THE BROKEN VISOR CAUSED ME A MOMENT OF STARTLED, DISTRACTED DRIVING UNTIL I COULD PULL OVER AND TRY TO DEAL WITH IT. THE VISOR WILL NOT STAY UP OR DOWN. IT HANGS IN MY LINE OF VISION AND CREATES A DRIVING HAZARD. IT ALSO HANGS TOO CLOSE TO MY HEAD AND CREATES A PHYSICAL HAZARD. I BUMPED MY HEAD ON IT YESTERDAY WHILE AT THE DRIVE-THROUGH PHARMACY. THE OWNER'S MANUAL STATES THAT A WARNING (WITH AN EXCLAMATION POINT INSIDE A TRIANGLE IN A YELLOW BOX) INDICATES THAT A CONDITION MAY RESULT IN HARM, SERIOUS BODILY INJURY OR DEATH IF THE WARNING IS IGNORED. THERE IS A WARNING ON PAGE 4-94 OF THE OWNER'S MANUAL THAT STATES, \"WARNING FOR YOUR SAFETY, DO NOT OBSTRUCT YOUR VISION WHEN USING THE SUNVISOR.\" HYUNDAI KNOWS THAT OBSTRUCTING ONE'S VISION WITH THE SUNVISOR MAY RESULT IN HARM, SERIOUS BODILY INJURY OR DEATH. HYUNDAI KNOWS THAT THIS IS A RECURRING PROBLEM WITH THIS VEHICLE AND SEVERAL OTHER VEHICLES, AS THEY HAVE ISSUED TECHNICAL SERVICE BULLETINS IN THE PAST (08-01-029, HYUNDAI RECALL CAMPAIGN T64) FOR THE SAME ISSUE. HYUNDAI KNOWS THAT THIS CONTINUES TO BE A PROBLEM FOR SEVERAL ELANTRA, SANTA FE, ACCENT, SONATA, AND OTHER OWNERS. A SIMPLE WEB SEARCH WILL SHOW SEVERAL RESULTS:  HTTP://WWW.HYUNDAI-FORUMS.COM/MD-2011-2016-ELANTRA-SEDAN-COUPE/130049-BROKEN-SUN-VISOR.HTML  HTTP://WWW.CARSAFETYREFERENCE.COM/HYUNDAI-SONATA-2007/VISIBILITY_WIPER/  HTTP://WWW.HOWTOMENDIT.COM/ANSWERS.PHP?ID=157121  THE DEALERSHIP HAS INFORMED ME THAT THE REPLACEMENT SUNVISOR WILL COST OVER $100 WHICH DOES NOT INCLUDE LABOR CHARGES. THIS SEEMS TO BE A MANUFACTURING DEFECT AND SHOULD BE COVERED UNDER WARRANTY AND/OR EXTENDED WARRANTY.",
        "vin": "KMHDH4AE3CU"
    }
]