[
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/09/2017",
        "dateOfIncident": "11/03/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11044815,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2012 JEEP GRAND CHEROKEE VIN: [XXX] FOR THE PAST SEVERAL MONTHS SINCE PURCHASE, THE JEEP HAS HAD ISSUES STARTING AND HAS STALLED WHILE DRIVING AT HIGH RATES OF SPEED. THIS VEHICLE IS NOT SAFE TO CURRENTLY DRIVE AND I AM GETTING NOWHERE WITH THE DEALERSHIP (PERFORMANCE JEEP: DELAWARE, OHIO    HTTPS://WWW.MOPAR.COM/EN-US/MY-VEHICLE/RECALLS/SEARCH.HTML  WHEN CLICKING ON THIS LINK AND ENTERING THE VIN BELOW IT SHOWS THE RECALLS COMPLETED FOR OUR JEEP. THE 2ND .PDF ATTACHMENT (ATTACHED) SHOWS THE TIPM RECALL WAS COMPLETED ON 2/24/15. OUR CAR IS CONTINUING TO STALL.      ?THE TOTALLY INTEGRATED POWER MODULE (TIPM) ON YOUR VEHICLE CONTAINS AN INTERNAL FUEL PUMP RELAY THAT COULD OPERATE INTERMITTENTLY OR FAIL WITHOUT WARNING. AN INTERMITTENT OR FAILED FUEL PUMP RELAY COULD CAUSE THE ENGINE TO STALL WHILE DRIVING AND CAUSE A CRASH WITHOUT WARNING. WHAT YOUR DEALER WILL DO... FCA WILL REPAIR YOUR VEHICLE FREE OF CHARGE. YOUR DEALER WILL INSTALL AN EXTERNAL FUEL PUMP RELAY.?    CARFAX ATTACHED.     FIRST, A CHRYSLER DEALER TRIED REPROGRAMMING THE COMPUTER MODULE AND THEN HAD TO REPLACE IT  IN 2013.  PRIOR TO THE FEBRUARY 2015 RECALL.  (I ASSUME WHAT THEY IDENTIFY AS THE ENGINE/POWERTRAIN COMPUTER/MODULE IS THE TIPM MODULE ?I.E., THE TOTALLY INTEGRATED POWER MODULE.)  ISSUE 1    IN AUGUST 2015, THEY REPLACED THE FUEL PUMP RELAY (I.E., THE RECALL WORK).  2ND ISSUE    THEN, IN APRIL 2016, THEY TRIED TO REPROGRAM THE ENGINE POWERTRAIN COMPUTER MODULE AGAIN, AND AGAIN FAILED AND HAD TO REPLACE IT.   THIRD ISSUE    WE ARE NOW HAVING ISSUES WITH THE VEHICLE:  FOURTH ISSUE, STILL NOT FIXED AFTER TAKING IT TO PERFORMANCE JEEP ON 3 OCCASIONS.     THERE HAS BEEN A CLASS ACTION LAW SUIT WITH A SETTLEMENT. AS I UNDERSTAND THOSE TERMS, THEY INCLUDE AN EXTENDED WARRANTY ON FUEL PUMP REPAIRS FOR UP TO 7 YEARS/70,000 MILES. WE ARE WELL UNDER THE 7 YEARS/70,000 MILES.     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1C4RJFCTXCC"
    }
]