[
    {
        "components": "AIR BAGS,STRUCTURE,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/27/2018",
        "dateOfIncident": "09/27/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132015,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DMV VISIT AND RECORDS AS OF 09/27/2018-THUR.PLEASE READ BELOW.  CURRENTLY IN 2018, AND A FEW YEARS IN THE PAST DMV PULL OUT RECORDS FOR DIFFERENT CAR UNDER MY OWNERSHIP> MY CAR IS 2001 TOYOTA CAMRY WITH AUTOMATIC TRANSMISSION,AIRBAGS,CRUISE CONTROL, POWER STEERING WHEEL, UPDATED LEATHER SEAT, MOBILE SEATS AND MUCH MORE. IT IS SILVER/PLATINUM-METALLIC COLOR AND ETC. DMV EMPLOYEE PER TODAY'S VISIT 9/27/2018 REFUSING TO GIVE ME A PAPERWORK OR TO COOPERATE WITH THE STATE RULES TO THE TRUE ID OF THE OWNERSHIP(TANGIBLE OWNERSHIP-I PAID CASH FOR MY CAR IN 2001). SHE (WOMAN-WORKER)TOLD ME AT DMV OFFICE REDWOOD CITY,CA 94063 APPOINTMENT # B0039, APPROX WINDOW 9 SERVICE  TIME2:40PM; THAT DMV WILL NOT CHANGE NOR UPDATE NOR TO CORRECT RECORDS - BUT THE WRONGFUL ENTRY INTO DMV RECORDS MAKES PROPERTY OWNER TO SUFFER WITH THE ID CASES THROUGH LAW ENFORCEMENT AGENCIES AND OTHER RE DEPARTMENTS OF USA.  IT AFFECTS MY PERSONAL HOLDINGS VALUE AND MY OWN FINANCIAL STABILITY AND PERSONAL SAFETY - RECALLS FOR 2000 ARE DIFFERENT TO RECALLS OF 2001-DUE TO MAJOR UPDATES AND IMPROVEMENTS TO THE SUBJECT CAR WITH THE APPROVAL OF JUDICIAL COURT SYSTEM IN 2001 AND LATER. CURRENTLY MY VEHICLE IS STATIONED, I AM SEARCHING FOR THE TRUE ANSWERS OF THE TITLE ON MY CAR. HOW TO PROVE POLICE DEPARTMENT AND OTHER AGENCIES - POLICE/LOT SECURITIES THAT MY CAR HAS BEEN TAKING CARE OF AND FREE OF ANY PAYMENTS. I AM AFRAID FOR MY LIFE DUE TO SCRUTANY OF EMPLOYEES OF DMV -SAN MATEO COUNTY, CITY OF REDWOOD CITY. BY THE WAY MY CAR RECORDS ARE IN SANTA CLARA COUNTY AND EVEN SOME ATTACHMENTS IN SANTA CRUZ COUNTY-STATE OF CALIFORNIA.",
        "vin": "JT2BL22K5Y0"
    }
]