[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/26/2020",
        "dateOfIncident": "05/16/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319315,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "CHEROKEE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS BROUGHT TO THE DEALERSHIP FOR SEVERAL ISSUES AT ONE TIME ON 5/16/2017 (MILEAGE 32779). THE VEHICLE WAS PURCHASED, NEW, 5/2016. THE SERVICE SHIFTER MESSAGE HAD BEEN COMING ON AND GOING OFF AND THE DEALERSHIP TOLD ME THAT THEY DID NOT KNOW WHY AND COULD NOT DO ANYTHING ABOUT IT UNLESS IT WAS ON WHEN I BROUGHT IT IN. THE DEALERSHIP STATED THAT THE PROBLEM MAY COME FROM THE BATTERY BEING BAD AND THAT THEY WOULD NOT COVER THE BAD BATTERY. AFTER A CALL TO JEEP CUSTOMER CARE, JEEP AGREED TO PAY TO HAVE THE BATTERY REPLACED BY THE DEALERSHIP AT NO COST TO ME. THIS WAS 7/12/2017 AND THE SHIFTER ISSUE WAS NOTED AGAIN ON THIS SERVICE ORDER. 4/2018, A TECHNICAL SERVICE BULLETIN WAS PUT OUT ABOUT THIS ISSUE, BUT I WAS NOT AWARE OF IT UNTIL 12/2019. AFTER RESEARCH AND THE DISCOVERY OF THE TECHNICAL SERVICE BULLETIN, THIS IS A COMMON PROBLEM WITH MANY OF THE JEEP CHEROKEES PRODUCED BETWEEN 2015 AND 2018. THERE HAS BEEN NO RECALL. I BROUGHT THE VEHICLE TO THE DEALERSHIP 3/12/2020 TO GET ANOTHER ISSUE FIXED AND ASKED THEM TO REPAIR THE SERVICE SHIFTER PROBLEM, NOW THAT THEY KNEW HOW TO FIX IT. THEY WOULD ONLY FIX IT IF I PAID FOR IT. I, AGAIN, CALLED JEEP CUSTOMER CARE FOR ASSISTANCE, BUT HAVE BEEN TOLD THIS TIME THAT THE MILEAGE IS TOO HIGH AND IT IS OUT OF WARRANTY, EVEN THOUGH I BROUGHT THIS TO THEIR ATTENTION DURING THE BATTERY ORDEAL IN 5/2017. THEY ARE REFUSING TO COVER THE COST OF THE REPAIR, EVEN THOUGH THIS HAS BEEN BROUGHT TO THEM DURING THE WARRANTY PERIOD (AS WITH THE BATTERY). ORIGINALLY, JEEP TECHS DID NOT KNOW WHAT THE PROBLEM WAS OR HOW TO FIX IT WHEN I BROUGHT IT TO THEM IN 2017. BUT JEEP IS NOW AWARE OF THE PROBLEM AND HOW TO FIX IT BUT WON'T UNLESS I PAY FOR A REPAIR THEY WEREN'T ABLE TO DO, AT THE TIME, BUT ARE ABLE TO DO NOW.",
        "vin": "1C4PJMDS9GW"
    }
]