[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/01/2017",
        "dateOfIncident": "05/18/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002667,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "STS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THURSDAY 18 MAY 2017, WHILE DRIVING NORTH ON INTERSTATE 405 IN HEAVY TRAFFIC AT NORMAL SPEEDS, THE ENGINE BEGAN TO MISS OUT; AND THE BRAKES LOST POWER ASSIST.  THE PROBLEMS PERSISTED AND WORSENED, SO I EXITED THE FREEWAY TO SURFACE STREETS AND BEGAN THE TRIP BACK SOUTH ON INTERSTATE 405 TO TAKE THE VEHICLE TO THE DEALER FOR DIAGNOSIS AND REPAIR.  WHEN STOPPED ON SURFACE STREETS (AND ON THE FREEWAY), IT WAS NECESSARY TO SHIFT TO NEUTRAL AND ADD FUEL TO THE ENGINE TO KEEP IT RUNNING.  ALSO, IT WAS NECESSARY TO APPLY EXTRA STRONG PRESSURE ON THE BRAKE PEDAL BECAUSE OF THE LACK OF POWER ASSIST.  AFTER ARRIVING AT THE DEALER AND SHUTTING OFF THE ENGINE, THE MECHANIC COULD NOT GET THE ENGINE TO RESTART.    AFTER EXTENSIVE EXPOSURE OF ENGINE INTERNAL PARTS, DEALER DIAGNOSIS WAS THAT A ROCKER ARM HAD BROKEN AT ONE OF THE CYLINDERS, RESULTING IN DEBRIS FALLING THROUGH THE VALVE OPENING INTO THE CYLINDER AND SCORING THE VALVE SEAT AND THE PISTON.  THE DEALER RECOMMENDED REPLACING THE ENGINE.   -- AT THAT TIME, THE VEHICLE HAD ACCUMULATED 83,000 MILES OF MODERATE DRIVING, AND WAS ONLY A LITTLE OVER 11 YEARS OLD.  THE VEHICLE WAS PURCHASED NEW FROM THE DEALER IN DECEMBER 2005, AND HAD BEEN MAINTAINED EXCLUSIVELY BY THAT DEALER SINCE THE VEHICLE WAS PURCHASED.    SUBSEQUENTLY, A NEW (REMANUFACTURED) ENGINE WAS PURCHASED FROM AND INSTALLED BY THE DEALER AT A COST OF $12,678.25.  THE VEHICLE WAS WITH THE DEALER FOR A TOTAL OF SIX WEEKS TO COMPLETE THE REPAIR AND INSTALLATION.    -- CLEARLY, HAD THE ENGINE COMPLETELY FAILED WHILE DRIVING ON THE FREEWAY, INTENSIVE ACTION WOULD HAVE BEEN REQUIRED TO SAFELY EXIT THE FREEWAY AND TO BRING THE VEHICLE TO A STOP (ESPECIALLY BECAUSE OF LOSS OF POWER ASSIST ON THE BRAKES).  THIS WOULD HAVE PLACED MY PASSENGERS IN VERY HIGH DANGER AND PERSONAL RISK.",
        "vin": "1G6DC67A860"
    }
]