[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/31/2020",
        "dateOfIncident": "01/31/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306415,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING ON THE HIGHWAY ON MY WAY BACK TO HILO FROM KONA DRIVING THE SPEED LIMIT ON MY 2007 PRIUS AND OUT OF NOWHERE I LOST BREAKS FOR A TIME AND IT WAS A TERRIFYING EXP AND I M HAPPY I M STILL ALIVE. BREAKS CAME BACK WITH WARNING SIGNS ON DASHBOARD THAT THERE IS A FAILURE IN THE BREAK SYSTEM, ABS AND OTHER.     CALLED HILO TOYOTA DEAL MORE THAN 5 TIMES AND EACH TIME I GIVE THEM THE VIN NUMBER THEY HANGUP ON ME IN A RUDE WAY WITHOUT GIVING ANY EXPLANATION WHY THEY ARE CUTTING THE CALL.     FROM THERE WEBSITE I MANAGED TO START A TXT MESSAGE AND ASKED FOR APPOINTMENT TO SEE WHAT'S WRONG AND PAID 170$ AND THE RESULT WHERE THAT MY BREAK SYSTEM HAVE A RECALL ON IT AND MY CAR IS AT 118 000 MILES SO THE RECALL EXPIRED IN 2017 AND THEY ASKED ME 3500$ TO FIX THE BREAK SYSTEM INVOLVED IN THE RECALL.     AFTER MANAGING TO CALL TOYOTA MAIN OFFICE THEY STARTED A CASE FOR THIS PROBLEM AND ON MONDAY THEY WILL GIVE A FINAL ANSWER IF THEY WILL CHANGE THE FAILING RECALL BREAK SYSTEM OR NOT.     ALSO I MANAGED TO CONTACT TOYOTA HONOLULU AND I KNEW FROM THEM THAT TOYOTA HAWAII IS A DIFFERENT ENTITY FROM TOYOTA MAINLAND AND THAT THE SAFETY RECALLS NEVER EXPIRED AND THEY SHOULD CHANGE THE BREAK SYSTEM INVOLVED IN THE REPORT NO QUESTIONS ASKED.     HERE I AM REPORTING THIS TO NHTSA AS TOYOTA IS GAMBLING WITH PEOPLE LIVES WHO STILL DRIVING PRIUS WHICH MIGHT LOSE BREAKS AT ANY TIME AND MIGHT ENDUP IN DEATH RESULT.     I HOPE NHTSA WILL DO THE RIGHT THING AND ASK TOYOTA TO CHANGE ALL THOSE DEFECTED BREAK SYSTEM FROM MANUFACTURES BEFORE MORE AMERICAN FAMILIES DIES FROM BREAK FAILURE WHICH WHERE NEVER CHANGED BECAUSE THE DEALER PREFER PROFIT ON SAFETY OF THE PEOPLE.",
        "vin": "JTDKB20U977"
    }
]