[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/09/2017",
        "dateOfIncident": "07/07/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003896,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FRIDAY, JULY 7, THE SUNROOF ON MY 2014 ACURA RDX EXPLODED WHILE DRIVING ON A HIGHWAY.  I HEARD A SOUND LIKE A BOMB GOING OFF, THEN I SAW GLASS FLY BEHIND MY CAR.  FORTUNATELY THERE WERE NO CARS BEHIND ME AT THAT TIME AND THE LINER INSIDE MY CAR WAS CLOSED OR GLASS WOULD HAVE FLOWN INTO THE CAR AND MOST LIKELY HURT MYSELF AND MY CLIENT.   I CALLED ACURA DEALER, AND THEY SAID THEY NEVER HEARD OF SUCH A THING.  AFTER SEARCHING ON THE INTERNET, I FOUND THAT THIS IS A CHRONIC PROBLEM AND HUNDAI AND AUDI HAVE ISSUED VOLUNTARY RECALLS OF SUN ROOF GLASS AND THAT MANY OTHER CAR MANUFACTURERS HAVE HAD THIS PROBLEM.  HERE IS A LINK TO A TV NEWS STORY ON THE ACURA RDX :  HTTP://WWW.NBCNEWYORK.COM/NEWS/LOCAL/SHATTERED-GLASS-SUNROOF--293692881.HTML.  THERE ARE THOUSANDS OF COMPLAINTS ABOUT THIS PROBLEM AT THE NATIONAL HIGHWAY TRAFFIC SAFETY ADMINISTRATION AND THERE ARE CLASS ACTION SUITS UNDERWAY.  I AM IN THE PROCESS OF ASKING ACURA TO PAY FOR THE REPAIR WHICH WILL BE ABOUT $1,200 ($367 FOR THE GLASS AND THE REST LABOR CHARGES).  WITH ALL OF THE SUN ROOFS OUT THERE, THIS IS A SAFETY ISSUE FOR PEOPLE IN THE CAR AND OUTSIDE OF THE CAR WHEN THERE IS FLYING GLASS.  ACCORDING TO REPORTS, THINNING OF THE SUN ROOF GLASS AFTER 2010 COULD BE PARTLY RESPONSIBLE AS CAR MANUFACTURERS ATTEMPTED TO LIGHT WEIGHT FOR BETTER GAS MILEAGE.  ALSO, THE GLASS USED IS NOT THE SAME AS WINDSHIELD GLASS.  .  I AM HOPING THIS REPORT WILL MAKE OTHERS AWARE OF THIS SAFETY PROBLEM.",
        "vin": "5J8TB3H50EL"
    }
]