[
    {
        "components": "FUEL SYSTEM, GASOLINE,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/08/2017",
        "dateOfIncident": "08/01/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013815,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE HAS BEEN TAKEN TO THE TOYOTA DEALERSHIP AT LEAST 12 TIMES SINCE PURCHASED. IT HAS ALREADY HAD A REAR SEAL LEAK, BACK BRAKES AND FRONT BRAKE WORK AND REAR BRAKES REPLACED. THE TIMING CHAIN CABLE WAS LEAKING OIL AND THEY REPLACED IT. IT HAS NOT RAN THE SAME SINCE. IT CONTINUES TO HESITATE TO ALMOST STALLING OUT DURING TAKEOFF AT RED LIGHTS AND INTERSECTIONS. IT'S ACCELERATION IS TERRIBLE EVEN FOR A 4 CYLINDER. WE HAVE BEEN COOPERATIVE FOR THE 3 YEARS WITH TOYOTA, BUT NOW THAT THE WARRANTY IS VOID DUE TO THE 3 YEARS, AND NOT THE MILEAGE, WE NO LONGER RECEIVE SUCH A HELPFUL CONVERSATION WITH ANY OF THE MANAGERS THERE. THE CAR IS STILL UNDER  25,000 MILES, AND HAS BEEN A TOTAL LEMON TO US. WE'VE EXHAUSTED ALL HOPES OF THEM FIXING THE REAL PROBLEM SINCE THEY CONTINUE TO CLAIM THAT THEY COULDN'T FIND ANY SUCH PROBLEM IN THE ACCELERATION ISSUES AND STALLING IN THE INTERSECTIONS. WE WILL NEVER AGAIN PURCHASE A TOYOTA VEHICLE EVER AGAIN. WE HAVE PURCHASED MANY TOYOTA'S IN THE PAST, WHICH PROMPTED US TO BUY ANOTHER. BUT AFTER THIS CAR, AND POOR MECHANICS AND SERVICE MANAGEMENT, WE WILL REFRAIN FROM ANOTHER TOYOTA, EVER. IF YOU CAN RESOLVE OUR ISSUE BY EITHER AN EQUIVALENT EXCHANGE OF ANOTHER VEHICLE, OR FIX THE REAL REASON IT'S NOT RUNNING PROPERLY, AND FRANKLY NEVER HAS, I WOULD APPRECIATE ANY HELP THAT CAN BE GIVEN ON MY BEHALF. THANK YOU, [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "2T1BPRHE3EC"
    }
]