[
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/17/2022",
        "dateOfIncident": "02/16/2022",
        "fire": false,
        "manufacturer": "Tesla, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452515,
        "products": [
            {
                "manufacturer": "Tesla, Inc.",
                "productMake": "TESLA",
                "productModel": "MODEL 3",
                "productYear": "2021",
                "type": "Vehicle"
            }
        ],
        "summary": "When using the traffic-aware cruise system on the interstate, the car will sometimes dramatically reduce its speed (within seconds)/apply the brakes for what appears to be no reason at all (often referred to as phantom braking).   The most recent incident occurred while accelerating up an interstate entrance ramp. The car had reached the target speed of 75 MPH before suddenly braking and reducing the speed down to around 65MPH before I hit the accelerator to prevent it from slowing down any further. Within a few seconds, the care went back to accelerating normally again. There were no warning indicators on the display that would explain why the vehicle slowed down.  I've noticed that sometimes there are certain spots on the interstate where this behavior will happen repeatedly. I will be cruising along at a set speed and the vehicle will suddenly slow down for a few seconds then continue back at the set cruise speed. This occurs when there are no other vehicles or objects in front of the car.  Available for inspection upon request: Yes Safety Risk: Rapid deceleration on the interstate at high speeds risks a rear end collision Reproducible: Yes, but it seems to occur mostly at random, has not been confirmed by the dealer Inspected By Others: No Warning Lamps/Messages: Only once has it generated a pre-collision warning, all other instances generate no warning/alert   Only once have I had the system falsely generate a pre-collision warning and dramatically slow the vehicle while the vehicle had just entered the interstate from an entrance ramp (traveling at 70 MPH) and no other objects or vehicles were around me.",
        "vin": "5YJ3E1EB5MF"
    }
]