[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/11/2017",
        "dateOfIncident": "04/12/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004653,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AIRBAGS IN MY CAR ARE NON-FUNCTIONAL. THE RED AND YELLOW AIRBAG LIGHTS ARE ON FOR THE DURATION OF ANY TRIP IN THE CAR. THE SENSOR THAT IS SUPPOSED TO DETECT AN ADULT IN THE PASSENGER SEAT DOES NOT FUNCTION SO THE PASSENGER AIRBAG IS ALWAYS OFF -ATTACHMENT 1.  I WENT TO THE DEACON JONES NISSAN DEALERSHIP IN GOLDSBORO NC ON 4-12-17 FOR THE RECALL ON THIS ISSUE. THE \"REPROGRAMMING\" THAT WAS DONE WAS INEFFECTIVE. THIS WAS NOT REPORTED TO ME.  I RETURNED TO THE DEALERSHIP ON 7-6-17 TO GET THE ISSUE ADDRESSED. I WAS TOLD THAT MY CAR HAD NO RECALLS OUTSTANDING AND I WOULD NEED TO PAY OUT OF POCKET TO GET THE AIRBAG CONTROL UNIT REPLACED.   INSTEAD I ELECTED TO CALL NISSAN TO SEE IF THEY COULD OFFER AN EXPLANATION OR REMEDY THE PROBLEM.  I CALLED AND SPOKE WITH [XXX] AGENTID: [XXX]. HE CREATED A CASE AND SENT IT TO THEIR REPAIR SPECIALISTS.  TODAY, 7-11-17 I SPOKE WITH [XXX] THE CASE MANAGER. HE INFORMED ME THAT NISSAN WOULD NOT BE REPLACING THE DEFECTIVE AIRBAG CONTROL UNIT AND THAT I WOULD NEED TO PAY TO HAVE IT REPLACED OUT OF POCKET.  MY CONCERNS ARE:  1. NISSAN ISN'T TAKING THEIR CUSTOMERS SAFETY SERIOUSLY. SOME PEOPLE WOULD SIMPLY NOT BE ABLE TO PAY TO HAVE THIS DEFECTIVE UNIT REPLACED AND COULD SUFFER INJURY AS A RESULT.  2. THE AIRBAG CONTROL UNIT (IF I REPLACED IT OUT OF POCKET) WOULD FAIL AGAIN.   3. THE AIRBAG UNIT REPROGRAMMING HAS BEEN INEFFECTIVE ON OTHER CARS AND DOESN'T SEEM TO ADDRESS THE ISSUE. SIMILAR TO THE HOOD LATCH ISSUE WHICH REQUIRED 3 RECALLS TO ADDRESS. HTTP://BLOG.CARANDDRIVER.COM/NISSAN-RECALLS-ALTIMA-FOR-THIRD-TIME-TO-FIX-HOOD-LATCHES/    ATTACHMENT 2 = SECOND TRIP TO DEALERSHIP  ATTACHMENT 3 = RECALL SHEET  ATTACHMENT 4 = NOTES OF CONVERSATIONS WITH NISSAN  ATTACHMENT 5 = PDF OF MY VIN NUMBER FORM NTHSA WEBSITE    THIS IS THE AIR BAG CONTROL UNIT RECALL INFORMATION FROM NISSAN.  HTTP://WWW.COYLENISSAN.COM/RECALL.HTML    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1N4AL3AP4DN"
    }
]