[
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/11/2017",
        "dateOfIncident": "06/30/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004350,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE SECOND TIME, I HAVE HAD OIL LEAKING OUT OF THE VALVE COVER OR TIMING BELT COVER ONTO THE ALTERNATOR. SO MUCH SO, THAT THE ALTERNATOR BECOMES SOAKED AND \"SHORTS OUT\" ACCORDING TO A HYUNDAI DEALER. MECHANICS WHO HAVE REPAIRED THIS ALL AGREE THAT THIS IS A HAZARD AND PUBLIC SAFETY ISSUE. \"FIRE RISK\" AND \"SUDDEN COMPLETE LOSS OF CONTROL AT HIGHWAY SPEEDS\" WERE BOTH MENTIONED. HYUNDAI STATES THAT MY VEHICLE IS OUT OF WARRANTY DUE TO MILEAGE AND SAYS THAT THERE IS NO RECALL FOR THIS PROBLEM DESPITE THE OBVIOUS RISKS THAT THEIR MECHANICS AND OTHER MECHANICS MENTION. AFTER VERY LITTLE EFFORT IN RESEARCHING THIS PROBLEM ON THE INTERNET, IT IMMEDIATELY BECAME OBVIOUS THAT THIS IS A COMMON RECALL FOR HYUNDAI CONCERNING THIS ENGINE(3.3L V6). THE RECALLS NAME OTHER HYUNDAI PRODUCTS BUT FOR SOME REASON SKIP MY VEHICLE EVEN THOUGH TWO REPS AT HYUNDAI CUSTOMER SERVICE STATE THAT \"YOU ARE DESCRIBING THE EXACT SAME PROBLEM\". WE HAVE SPENT CLOSE TO $1000 ON THIS ONE ISSUE IN THE LAST YEAR. IT NEARLY CAUSED MY WIFE TO BE STRANDED ON THE INTERSTATE 10HRS FROM HOME. AND HYUNDAI ADMITS THAT IT IS AN ISSUE BUT BECAUSE MY VIN IS NOT LISTED, THEY REFUSE TO HELP FIX OR REFUND ANY THING THAT HAS ALREADY BEEN SPENT ON THIS MANUFACTURE DEFECT. AGAIN, I EMPHASIZE THAT THIS IS A PUBLIC SAFETY HAZARD THAT NEEDS TO BE ADDRESSED. DESPITE RECENT REPAIR, THIS PROBLEM STILL CONTINUES. THE VEHICLE WAS TRAVELING AT 70MPH EACH TIME THIS ISSUE OCCURRED. I HAVE RECORDS OF REPAIR FROM INDEPENDENT MECHANICS AND STATEMENT FROM HYUNDAI STATING THIS PROBLEM. THIS OCCURRED AT 118,000 AND 132,000 MILES. IT SEEMS LIKE IT OCCURRED PRIOR TO THIS AS WELL(LOOKING FOR RECORDS).",
        "vin": "5NPEU46F47H"
    }
]