[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/02/2019",
        "dateOfIncident": "06/03/2016",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217415,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "330XI",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 6-3-2016 MY 2006 BMW 330XI STARTED ON FIRE IN THE PARKING LOT AT MY PLACE OF EMPLOYMENT.  AS I PULLED MY CAR INTO A PARKING SPACE, I NOTICED SMOKE COMING FROM UNDER THE HOOD.  I PARKED THE CAR, SHUT IT OFF AND I OPENED THE HOOD AND SAW SMALL FLAMES ON THE DRIVER'S SIDE OF THE ENGINE COMPARTMENT.  I WAS ABLE TO PUT THE FIRE OUT MYSELF. I NOTICED THAT SOME ENGINE COMPONENTS WERE BURNED AND MELTED.  AT THE END OF THE WORKDAY I HAD THE CAR TOWED TO AVA RESTORATION IN DUBLIN, NEW HAMPSHIRE.  THEY COMPLETED THE NECESSARY REPAIRS.  THE OWNER TOLD ME THAT THERE WAS A SHORT IN THE PCV VALVE HEATER(ALSO REFERRED TO AS AN ANGLE CONNECTOR) AND IT HAD CAUSED DAMAGE TO THE INTAKE MANIFOLD AND WIRING HARNESS.  AFTER THE REPAIRS WERE COMPLETED I WAS ABLE TO CONTINUE DRIVING MY CAR.      I CONTACTED BMW IN JANUARY 2018 AFTER LEARNING THAT THEY RECALLED 2007 MODELS FOR THE SAME COMPONENT FAILURE. I EXPLAINED MY SITUATION TO THEM AND TOLD THEM THEY SHOULD EXPAND THE RECALL TO COVER 2006 MODELS ALSO.  I ALSO TOLD THEM THAT I WANTED TO SPEAK TO A REPRESENTATIVE ABOUT GETTING REIMBURSEMENT FOR MY REPAIR COSTS.  THEY TOLD ME I HAD TO GET MY CAR EXAMINED AT A LOCAL BMW DEALER AND THAT SOMEONE FROM THEIR CORPORATE OFFICE IN NEW JERSEY WOULD CALL ME ABOUT THE MATTER.  THE REPRESENTATIVES AT THE DEALERSHIP WERE LESS THAN HELPFUL AND THE REPRESENTATIVE FROM THEIR CORPORATE OFFICE LEFT ME A MESSAGE AT 8:45 PM ONE NIGHT AND THEN NEVER CALLED ME BACK AFTER I TRIED TO REACH HER SEVERAL TIMES AND GOT ONLY VOICE MAIL.      I RECEIVED A LETTER FROM BMW RECENTLY SAYING THAT MY CAR NOW HAS A RECALL ON THE PCV VALVE HEATER, RECALL 19V-273.  I BELIEVE THAT BMW KNEW ABOUT THIS PROBLEM FOR A LONG TIME AND DID NOT ADDRESS IT, WILLINGLY PUTTING VEHICLE OWNERS AT RISK.  IN ADDITION, THE OWNER OF AVA RESTORATION TOLD ME HE REPAIRED A NUMBER OF BMWS THAT HAD FIRE DAMAGE CAUSED BY THE SAME MALFUNCTION.",
        "vin": "WBAVD33566K"
    }
]