[
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/28/2017",
        "dateOfIncident": "11/11/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001922,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "IA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "@ 9851 MILES, PICKED UP THE CAR FROM AN OIL CHANGE (IN NOV. 2016.) NOTICED A LIGHT SHAKING WHEN AT A COMPLETE STOP AT STOP LIGHT. THE ISSUE CONTINUED RANDOMLY, AT FIRST NOT VERY OFTEN, THEN STARTED HAPPENING MORE AND MORE OFTEN AND BECAME MORE AND MORE INTENSE AT TIMES. CAR IS AT 18,029 MILES (6/28/17,) AND IT STILL CONTINUES TO RANDOMLY HAPPEN. HAVE TAKEN THE VEHICLE TO THE DEALER SEVERAL TIMES, THEY DO NOT KNOW WHAT'S WRONG WITH IT, NO SERVICE/ENGINE LIGHTS OR CODES. THE SERVICE MANAGER AND SERVICE ADVISOR WITNESSED THE PROBLEM IN THE SERVICE BAY. I HAVE BEEN TOLD IT IS \"CHARACTERISTIC\" OF THE VEHICLE (BUT DIDN'T HAPPEN FOR THE FIRST 9851 MILES,) AND I HAVE ALSO BEEN TOLD I PUT \"BAD GAS\" IN IT (ALTHOUGH IT'S BEEN DRIVEN  8,358 MILES SINCE IT STARTED AND THERE HAVE BEEN NUMEROUS TYPES OF GAS FROM NUMEROUS GAS STATIONS PUT IN THE VEHICLE.) IT STILL HAPPENS RANDOMLY, IT DOESN'T MATTER IF THE AC IS ON OR OFF, HOW LONG IT BEEN DRIVEN, THE TYPE OF GAS THAT IS IN IT, OR WHAT THE TEMPERATURE IS OUTSIDE. MANUFACTURERS REP COULD NOT \"RECREATE\" THE INTERMITTENT PROBLEM, ARBITRATOR SAID THE 20 OR SO VIDEOS I RECORDED OF THINGS SHAKING IN MY VEHICLE WHEN IT DOES HAPPEN, WAS NOT \"CREDITBLE EVIDENCE.\" I WOULD LIKE THE ISSUE I'M EXPERIENCING WITH MY CAR TO BE POSTED ON THE NHSTA WEBSITE UNDER PROBLEMS, JUST IN CASE OTHER OWNERS ARE EXPERIENCING THE SAME ISSUE.",
        "vin": "3MYDLBZV1GY"
    }
]