[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/16/2018",
        "dateOfIncident": "09/21/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151915,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE VEHICLE USED IN AUGUST 2017 WITH 42K MILES ON IT. THE VEHICLE AFTER DRIVING IT FOR A FEW WEEKS NOTICED A SHUDDER IN LOW SPEEDS. I CONTACTED A FRIEND WHO WAS AN AUTOMOTIVE TECHNICIAN HE MADE ME AWARE OF THE ISSUE WITH THIS TYPE VEHICLE AND HOW IT WOULD BE COVERED UNDER A RECALL. I WENT FORWARD AND HAD THE CLUTCH AND TRAINING MODULE REPLACED UNDER THE WARRANTY. TWELVE MONTHS LATER I START EXPERIENCING THE SAME ISSUES WITH THE CAR. I BROUGHT IT AGAIN THE FORD DEALERSHIP REPLACED THE TRAINING MODULE BUT DID NOT REPLACE THE CLUTCH BECAUSE IT WAS NO LONGER COVERED UNDER WARRANTY. THE SERVICE DEPARTMENT TOLD ME THAT I WOULD HAVE TO DEAL WITH FORD DIRECTLY IF I WANTED THIS PART TO BE COVERED BY FORD. I WAS ALSO MADE AWARE THAT THE SAME PARTS WERE REPLACED IN 2015 BY THE PREVIOUS OWNER. I CONTACTED FORD AND SPOKE TO A CUSTOMER SERVICE REPRESENTATIVE AND A SUPERVISOR.. I WAS TOLD THERE WAS NOTHING THEY COULD DO BUT THEY WOULD SUBMIT MY ISSUES TO A THIRD PARTY ARBITRATOR. THAT WAS ALMOST TWO MONTHS AGO. I HAD HEARD OF A CLASS ACTION LAWSUIT WAS GOING ON WITH FORD REGARDING THIS ISSUE.. ALTHOUGH I WAS PAST THE FILING DEADLINE TO BE PART OF THE INITIAL LAWSUIT THE WEBSITE SAID THEY WOULD STILL ADDRESS MY CONCERNS. I WAS ALSO MADE AWARE THAT I NEEDED TO CONTACT FORD DIRECTLY BEFORE I STARTED THE ARBITRATION PROCESS. I CONTACTED THEM A REPRESENTATIVE CALLED ME.. REVIEWED MY CASE AND TOLD ME HE COULD ONLY OFFER ME $400 FOR MY INCONVENIENCE. THE VEHICLE WAS NOT COVERED UNDER MY STATE'S LEMON LAW. WHEN I MENTIONED MY CLUTCH NEEDED TO BE REPLACED AND THE $400 WOULD ONLY COVER A FRACTION OF THE COST HE SAID THEY COULD HELP WITH THE REPAIR UNCERTAIN IF IT WOULD BE COVERED IN FULL. SO I DECIDED TO CONTACT MY STATE'S ATTORNEY GENERAL'S OFFICE. THEY HAVE AGREED TO HELP ME WITH MY CASE BUT SUGGESTED I REPORT MY ISSUES TO THIS AGENCY.",
        "vin": "1FADP3E25EL"
    }
]