[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/06/2018",
        "dateOfIncident": "10/24/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11149715,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM COMPLAINING ABOUT MY 2007 TOYOTA CAMRY SE CAR. THIS CAR HAS A DASHBOARD PROBLEM THAT CAN CAUSE SEVERE ACCIDENTS. ITS DASHBOARD IS BECOMING STICKY, SMELLY AND SHINY AS A MIRROR. THE PROBLEM HAS BEEN DEVELOPING FOR YEARS AND IT IS GETTING WORSE. WHEN I CALL A TOYOTA DEALER ABOUT 3-4 YEARS AGO TO ASK WHETHER THERE WAS A RECALL OR OTHER SOLUTION TO THIS PROBLEM, I WAS TOLD THERE WAS NO RECALL AND THEY COULD DO NOTHING. THIS YEAR, THE PROBLEM IS BECOMING SEVERE SINCE THE SHINY DASHBOARD OFTEN BLINDS MY EYES AND I ALMOST HIT A WALKER. I GOOGLED THIS PROBLEM AND FOUND TONS OF SIMILAR COMPLAINS AND SOME LUCKY COSTUMERS GOT FREE REPLACEMENT. SO, I CALLED THE SAME DEALER AGAIN ASKING ABOUT THE POLICY. I WAS TOLD THAT THERE WAS A RECALL SEVERAL YEARS AGO, BUT IT EXPIRED TWO YEARS AGO, SO THEY COULD DO NOTHING. THIS ANSWER IS RIDICULOUS CONSIDERING I CALLED THEM BEFORE. I THEN CALL THE HEADQUARTER. THE OPERATOR TOLD ME THAT IT WAS NOT A RECALL, BUT AN EXTENDED 10-YEAR WARRANTEE. SINCE MY CAR HAS BEEN MORE THAN TEN YEARS, TOYOTA WILL NOT BE RESPONSIBLE FOR THE DASHBOARD UNLESS I HAVE WRITTEN EVIDENCE THAT I CONTACTED TOYOTA BEFORE ABOUT THE DASHBOARD.    MY COMPLAINS ARE AS FOLLOWS:  (1)THIS DASHBOARD PROBLEM SHOULD BE A RECALL SINCE IT CAN CAUSE DANGEROUS ACCIDENTS. AS MENTIONED, THE SPECULAR REFLECTION FROM THE SHINY DASHBOARD CAN BLIND THE DRIVERS AND MAKE THE DRIVING VERY DANGEROUS. TOYOTA MUST HAVE KNOWN THIS PROBLEM A LONG TIME AGO AND SHOULD NOTICE ALL COSTUMERS TO CHANGE THE DASHBOARD FOR FREE, INSTEAD OF FINDING EXCUSES TO REJECT MOST UNLUCKY CUSTOMERS. TOYOTA SHOULD BE RESPONSIBLE AND CARE ABOUT ITS CUSTOMERS' LIVES.    (2)TOYOTA SHOULDN'T PUT THE BURDEN OF PROVIDING EVIDENCE ONLY ON COSTUMERS. THE REQUEST OF WRITTEN EVIDENCE THAT I CONTACTED THE DEALER BEFORE IS RIDICULOUS. THE FACT THAT THE DEALER FAILED TO PROVIDE ME A RIGHT SUGGESTION/SOLUTION BECOMES MY FAULT.",
        "vin": "4T1BE46K47U"
    }
]