[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/15/2020",
        "dateOfIncident": "10/14/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364515,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2020",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTI PRO CONTACT TX",
                "productYear": "9999",
                "size": "245/40/ZR19",
                "type": "Tire"
            }
        ],
        "summary": "CONTINENTAL PRO CONTACT TIRE:  NON-ROAD HAZARD TIRE SIDEWALL FAILURE ON BARELY WORN TIRE, POTENTIALLY LEADING TO LOSS OF VEHICLE CONTROL AND/OR VEHICLE ROLLOVER.    TIRE CONCERN WAS INITIALLY INDICATED WITH A MILD (~26 PSI) LOW TIRE PRESSURE WARNING.  AFTER STOPPING TO INSPECT, NO DEBRIS OR OTHER INDICATION OF PUNCTURE WAS NOTED, SO PRESSURE WAS ADDED TO RETURN TO FACTORY SETTINGS.    HOWEVER, HOURS LATER AND AT HIGHWAY SPEED, LOW TIRE PRESSURE INDICATION RETURNED (TO A SIMILAR LOW VALUE IN THE MID-20'S, FOLLOWED WITHIN MINUTES BY SUDDEN PRESSURE DROP AND TIRE DISINTEGRATION.  VEHICLE CONTROL WAS COMPROMISED DUE TO SUDDEN TIRE FAILURE.    UPON TIRE REMOVAL AT SIDE OF FREEWAY, I NOTED THAT THE INTERIOR TIRE SIDEWALL WAS MISSING SUBSTANTIAL CHUNKS OF RUBBER, A CLASSIC \"BLOW OUT.\"    THE NEXT DAY A VERY CAREFUL INSPECTION BY LOCAL DISCOUNT TIRE STORE REVEALED ABSOLUTELY ZERO INDICATION OF PRE-FAILURE PRESSURE LOSS:  NO NAIL OR OTHER DEBRIS PUNCTURES IN ANY PART OF THE REMAINING TIRE, AND ZERO/NO INDICATION OF PRIOR LOW-PRESSURE OPERATION (WHICH COULD LEAD TO TIRE OVERHEATING AND SUBSEQUENT FAILURE).      STRONGLY SUSPECT EITHER A MAJOR CONSTRUCTION OR MATERIAL DEFECT WAS LIKELY CAUSE OF THIS HAZARDOUS AND NEARLY SPONTANEOUS TIRE FAILURE, ON A TIRE MOUNTED ON A NEW CAR UNDER A YEAR OLD, AND WITH MINIMAL TIRE WEAR.    UPON SUBMISSION OF THIS COMPLAINT I WILL CONTACT DISCOUNT TIRE AND REQUEST TIRE BE RETAINED FOR SUBMISSION/INSPECTION, IF DESIRED; PLEASE ADVISE PROMPTLY IF YOU'D LIKE TO INSPECT THE TIRE.",
        "vin": "1N4BL4EV1LC"
    }
]