[
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/10/2017",
        "dateOfIncident": "11/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003990,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE PURCHASING MY CAR IT HAS DONE STRANGE THINGS WITH WHAT I THOUGHT WAS THE BREAKS. WHEN STOPPING AT A LIGHT ETC.. THE CAR WILL JUMP FORWARD.. SOMETIMES ONLY ONCE AND OTHERS IT DOES IT OVER AND OVER UNTIL I ACCELERATE AGAIN. I TOOK IT TO THE DEALERSHIP WHERE I PURCHASED IT. DAVID MAUS IN SANDFORD FL. THE SERVICE TECH TOOK A RIDE WITH ME.. HE STATED THAT HE'S HEARD THIS FROM OTHER CHEVY CRUZE OWNERS AND IT'S JUST WHAT THESE CARS DO. IT DID DEMONSTRATE THE JUMPING, THRUSTING FORWARD WHILE THE SERVICE TECH WAS DRIVING. I WAS NOT HAPPY WITH THIS ANSWER BUT BELIEVED HE KNEW WHAT HE WAS TALKING ABOUT. YESTERDAY I GET IN MY CAR AND IT WILL HARDLY GO. THE SERVICE STABILTACK LIGHT WAS ON. THEN EVERY LIGHT ON THE DASH CAME ON. OBVIOUSLY I UNDERSTAND THINGS GO BAD ON CARS AS IT'S 4 YEARS OLD. BUT AFTER READING HUNDREDS OF THESE COMPLAINTS ONLINE I BELIEVE THIS IS A PROBLEM WITH THESE CARS THAT CAN BE DANGEROUS. AND IT'S UNBELIEVABLE TO ME THAT THERE IS NO RECALL AFTER ALL THE REPORTS AND COMPLAINTS. WHEN IT JUMPS HOPS THRUST FORWARD YOU NEVER KNOW IF IT'S GOING TO BE A LITTLE OR A LOT. THIS PROBLEM HAS BEEN ONGOING WITH NO HELP FROM THE CERTIFIED MECHANICS. I PUT THE DATE AS 2013 BECAUSE AS I SAID IT'S BEEN ON GOING AND NOW IT'S COMPLETELY BROKEN. WHICH COULD HAVE BEEN PREVENTED HAD THE MECHANICS HELPED ME IN 2013",
        "vin": "1G1PE5SB1D7"
    }
]