[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/24/2017",
        "dateOfIncident": "07/07/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010215,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - I HAVE A NEW 2017 NISSAN ROGUE PURCHASED IN APRIL 2017.  WHILE DRIVING IN MY NEIGHBORHOOD LESS THAN 25 MILES AN HOUR, MY DAUGHTER RUBBED THE CURB WITH THE BACK TIRE AND THE SIDE AIRBAGS DEPLOYED.  THERE IS NO BODY OR OTHER DAMAGE TO THE CAR AT ALL. NO ONE WAS SITTING IN THE PASSENGER SEAT EITHER WHICH I THOUGHT WAS ODD.  I WAS IN THE BACK SEAT OF THE CAR BECAUSE SHE CAME TO PICK ME UP BECAUSE I TWISTED MY ANKLE WHILE JOGGING AND CALLED HER TO COME GET ME.  TWO VERY NICEPOLICE OFFICERS STOPPED TO HELP US CHANGE THE TIRE AND WERE SURPRISED THAT THE AIRBAGS DEPLOYED WHEN THERE WASN'T ANY DAMAGE TO THE CAR.  ONE OF THE OFFICERS RECOMMENDED I SUBMIT THIS FORM BECAUSE HE HAD HEARD OF AN ISSUE WITH THE TAKATA AIRBAGS DEPLOYING DUE TO AN INFLATER ISSUE.  I HAD THE TIRE REPLACED BUT HAVE NOT FILED WITH MY INSURANCE COMPANY AS I DO NOT WANT MY PREMIUMS TO INCREASE.  THE POLICE OFFICER TOLD ME IF I DECIDED TO CLAIM THIS ON MY INSURANCE I COULD GO ON LINE AND COMPLETE A GEORGIA SR13 FORM.  I STILL HAVEN'T REPLACED THE AIRBAG, SEAT OR SEAT BELT AS I HAVE HEARD IT IS NOT CHEAP TO REPLACE.  I CALLED NISSAN AND THEY TOLD ME THAT THE SEAT BELT ALONE WOULD COST $500.00. I HAVE HIT/RUBBED MANY CURBS IN MY LIFE AND HAVE NEVER HAD OR HEARD OF AN AIRBAG DEPLOYING, ESPECIALLY DRIVING LESS THAN 25 MILES PER HOUR.      PLEASE LET ME KNOW WHAT ADDITIONAL INFORMATION YOU MAY NEED FROM ME FOR THIS COMPLAINT.",
        "vin": "5N1AT2MT0HC"
    }
]