[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/29/2019",
        "dateOfIncident": "07/12/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252215,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "7/8/19 I BROUGHT MY 2015  JEEP GRAND CHEROKEE IN FOR THE VO8 EMISSIONS RECALL TWO DAYS LATER MY VEHICLE WAS RETURNED 7/10/19. 7/12/19 I WENT TO HAVE MY VEHICLE SMOG CHECK COMPLETED AND THE SMOG CHECK FAILED DUE TO THE FOLLOWING 'YOUR VEHICLE FAILED THE SMOG CHECK INSPECTION DUE TO THE FACT THE FACT THAT THE VEHICLES ON-BOARD COMPUTER SYSTEM HAS NOT COMPLETED THE EMISSION SYSTEM SELF-CHECKS.'    DURING THAT TIME I HAD ALREADY CONTACTED THE DEALERSHIP TO RETURN MY VEHICLE TO CHECKED FOR POSSIBLE ISSUES CAUSED BY THE VO8 EMISSIONS RECALL.  UPON MY DRIVE FROM SMOG TEST TO JEEP CHRYSLER DEALERSHIP (10.3) NO WARNING LIGHTS CAME ON AND AS I APPROACHED THE DEALERSHIP THE OIL TEMPERATURE GAUGE DID START TO RISE. ONCE PARKED I NOTICED OIL DRIPPING FROM THE PASSENGER FRONT OF MY VEHICLE. THE DEALERSHIP SERVICE ATTENDANT PLUGGED IN THE ERROR CODE READER AND NO CODES/ERRORS WERE DETECTED AS IF OPERATING 100% AS INTENDED.  EVEN THOUGH IT WAS EVIDENT THAT MY JEEP HAD CATASTROPHIC ENGINE FAILURE.   IT WAS DETERMINED MY ENGINE NEEDED TO BE REPLACED DUE TO THE  VO8 EMISSIONS RECALL AND I HAVE CO-WORK THAT EXPERIENCED THE SAME ISSUE RESULTING IN THE ENGINE TO BE REPLACED TWO DAYS AFTER THE VO8 EMISSIONS RECALL WAS COMPLETED . THE REPLACEMENT ENGINE WAS ON BACK ORDER UNTIL 8/21/19 AND I MAY HAVE MY JEEP BACK 8/30/19.   THE REPAIR WORK COMPLETED ON MY VEHICLE IS NOT FLUKE AND THE RECALL WORK BEING PERFORMED IS NOT SATISFACTORY AND POSSIBLY RUSHED TO MEET DEADLINES FOR COMPLIANCE. FCA US LLC , AS AN ORGANIZATION NEEDS TO LOOK AT THE RECALL PRACTICES HOLISTICALLY, THINK ABOUT THE PEOPLE AND THEIR FAMILY BEING IMPACTED BY THE V08 EMISSIONS RECALL SHORT COMINGS.",
        "vin": "1C4RJFBMXFC"
    }
]