[
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/21/2017",
        "dateOfIncident": "11/15/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000544,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2012",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "AUDI 2012 A6    #1 I TRIED TO FUEL MY CAR AND THE ACCESS DOOR TO THE GAS CAP WOULD NOT OPEN IN THE COLD WEATHER OF NOVEMBER 2016. I TRIED THE EMERGENCY PULL CORD IN MY TRUNK AND THAT WOULDN'T UNLOCK THE ACCESS DOOR EITHER? THE NEXT THING I DID WAS DRIVE HOME PRAYING THAT I WOULD NOT RUN OUT OF FUEL. I PARKED MY CAR IN MY WARM GARAGE AND AFTER ABOUT AN HOUR AND HALF I BANGED ON THE ACCESS DOOR A NUMBER OF TIMES AND IT FINALLY POPPED OPEN.  THERE WAS NO EVIDENCE OF ICE OR WATER THAT WOULD HAVE PREVENTED THE DOOR FROM OPENING..    #2 THIS FAILURE HAPPENED AT LEAST 3 OR 4 TIMES BEFORE I HAD TO BRING MY CAR TO MY DEALER TO HAVE THEM GET THE ACCESS DOOR UNLOCKED.    #3 THE DEALER HAD TO ORDER THE DOOR LOCK PART AND REPLACE THE ACCESS DOOR LOCK WHICH WHEN THEY FINISHED COST ME A RIDICULOUS $250.00!  WHEN I CALLED AUDI CUSTOMER ADVOCATE, SHE DANCED AROUND MY QUESTION OF HOW MUCH SHOULD THAT REPAIR COST ME. I ASKED THE ADVOCATE HOW MUCH WOULD AUDI HAVE PAID THE DEALER IF MY CAR WAS STILL UNDER WARRANTY AND THEY WOULDN'T VOLUNTEER THAT INFO EITHER. IN CLOSING, I FIND THIS TO BE A SERIOUS DEFECT AND IT CAN ENDANGER LIVES IF A WOMAN WITH CHILDREN SHOULD RUN OUT OF FUEL AND HAVE NO WAY OF OPENING THE ACCESS DOOR.  BTW, I HAVE THE DEFECTIVE LOCK AND THERE IS NO WAY THAT YOU CAN GET THE LOCK TO OPEN WITH THE PULL CORD.  WHEN I SPOKE WITH THE SERVICE REP AT THE DEALERSHIP, SHE ADMITTED THAT THIS GAS DOOR LOCK MALFUNCTIONS ESPECIALLY IN COLD WEATHER. HOW CAN A MANUFACTURER GET AWAY WITH INSTALLING AN UNDEPENDABLE FUEL ACCESS DOOR LOCK AND NOT EVEN HAVE AN EMERGENCY PULL CORD THAT WILL OPEN THE DOOR NO MATTER HOW HARD YOU PULL ON IT?",
        "vin": "WAUHGAFC9CN"
    }
]