[
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/24/2017",
        "dateOfIncident": "06/22/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001179,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "TOWN AND COUNTRY",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I FILLED UP MY GAS TANK. I BARELY GOT DOWN THE ROAD AND MY ENGINE STARTED SPUTTERING. AS I ENTERED A LEFT TURN THE STEERING WHEEL LOCKED UP. I RAN INTO A CURB AND HAD TO PRESS THE GAS PEDDLE SEVERAL TIMES TO KEEP IT FROM DYING. AFTER TRYING TO TURN THE WHEEL SEVERAL TIMES THE STEERING FINALLY LOOSENED UP. THE CAR CONTINUED TO SPUTTER ALL THE WAY HOME. I TOOK THE CAR OUT AN HOUR LATER AND THE SPUTTERING HAD QUIT AND THE STEERING WAS BETTER. 2 DAYS LATER I WAS DRIVING ON THE FREEWAY. AS I ENTERED A LEFT CURVE MY STEERING LOCKED UP. THIS WAS VERY SCARY BECAUSE I HAD MY DAUGHTER IN THE CAR. I MANAGED TO GET TO THE SIDE OF THE FREEWAY, BUT THE STEERING WHEEL WOULD NOT TURN AT ALL. I PLAYED WITH THE WHEEL TRYING TO TURN IT BACK AND FORTH. I TURNED OFF THE VAN AND THEN BACK ON AGAIN. THE WHEEL WAS STILL LOCKED. FINALLY AFTER SEVERAL SCARY MINUTES THE WHEEL UNLOCKED AND I CAUTIOUSLY CONTINUED HOME.  THIS WAS VERY DANGEROUS AS WE COULD HAVE GOTTEN IN A SEVERE ACCIDENT SINCE THIS HAPPENED AT FREEWAY SPEEDS. THE STEERING WHEEL LOCKING UP HAS HAPPENED OFF AND ON BEFORE AFTER STARTING THE CAR AND ATTEMPTING TO BACK OUT OF THE DRIVEWAY. IT ALWAYS LOOSENED UP AFTER A FEW MINUTES. NOW I AM SCARED TO DRIVE THIS CAR BECAUSE I DON'T KNOW WHEN THIS WILL HAPPEN AGAIN. THIS IS OUR PRIMARY TRANSPORTATION. I HAVE ALSO NOTICED THAT WHEN IT IS WET OR RAINING THE CAR WILL ALSO HAVE PROBLEMS WITH THE STEERING.",
        "vin": "2C4GP54L05R"
    }
]