[
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/20/2017",
        "dateOfIncident": "07/19/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006483,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS MAY BE A SCENARIO FOR THE ONGOING INVESTIGATION OF ROLLAWAY (NHTSA ACTION NUMBER: PE16014)  THE VEHICLE IN THIS SCENARIO WAS STATIONARY.   I FOLLOW THE NORMAL PROCEDURE FOR PARKING MY DURANGO BY (1)APPLYING PARKING BRAKE, (2)MOVING THE SHIFTER TO PARK, (3) TURN IGNITION OFF, AND THEN (4)EXITING THE VEHICLE.   TODAY, I BROUGHT MY VEHICLE TO STOP FOR PARKING, WHICH TRIGGERED THE STOP-START SYSTEM, TURNING THE ENGINE OFF. AT THIS TIME, BEFORE SHIFTING THE TRANSMISSION TO PARK, I OPENED THE DOOR OF THE VEHICLE. THIS ACTION OF OPENING DOOR MADE THE STOP-START SYSTEM UNAVAILABLE. AFTER THIS WHEN I LIFTED MY FOOT FROM THE BRAKE PEDAL, AND MOVED TRANSMISSION TO PARK (WITH PARK LIGHT LIT), MY THINKING WAS THAT THE VEHICLE WOULD START ITS ENGINE AS IT WOULD BE COMING OUT OF STOP-START SYSTEM. BUT, THIS DID NOT HAPPEN AS THE DRIVER DOOR WAS OPEN AND THE STOP-START SYSTEM WAS DISABLED. AT THIS TIME, WHEN I LIFTED MY FOOT OF THE BRAKE, THE CAR ADVANCED FORWARD WITH NO POWER. EVEN THEN THE ENGINE DID NOT START. THEN I TURNED THE CAR OFF AND TURNED IT BACK ON AND ALL WORKED FINE.   WHILE CHECKING THIS SCENARIO AGAIN, I TURNED THE CAR OFF WHILE THE STOP-START WAS DEACTIVATED. THE VEHICLE DID A POWERLESS ROLLING. I STARTED THE VEHICLE AGAIN AND ALL WORKED FINE.  IT SEEMS THAT THE OPENING OF THE DRIVER DOOR BEFORE THE VEHICLE EXITS THE STOP-START SYSTEM INITIATED ENGINE-OFF, CAUSES THE VEHICLE TO ENTER A STATE WHERE THINGS ARE NOT PREDICTABLE. MY EXPECTATION WAS THAT THE TAKING FOOT OFF THE BRAKE PEDAL OR CHANGING GEAR SHIFTER, WOULD MAKE THE ENGINE COME BACK TO LIFE. BUT THAT DID NOT HAPPEN.  I HOPE THAT THERE COULD BE SOLUTION FOR THIS ISSUE. I ALWAYS APPLY PARKING BRAKE SINCE THE TIME I HAVE LEARNED HOW TO DRIVE, AND THAT SURELY MUST BE HELPING ME HERE.",
        "vin": "1C4RDHEG0GC"
    }
]