[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/15/2017",
        "dateOfIncident": "07/08/2017",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005504,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER EVOQUE",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "LAST SATURDAY, JULY 8, 2017, WE ARE ON OUR WAY TO LAND ROVER DEALERSHIP IN PARAMUS NEW JERSEY FOR OUR RANGE ROVER EVOQUE 2012, SCHEDULED MAINTENANCE SERVICING, WHILE DRIVING  I JUST NOTICED THAT THE AIRBAG LIGHT IS SHOWING UP IN THE CONTROL PANEL WHILE THE CAR IS IN MOTION GOING TO THE DEALERSHIP. SO AS WE GET THERE IN THE DEALERSHIP, I TOLD THE SERVICE GUY TO INCLUDE THE CHECK OF THE AIRBAG THAT ILLUMINATE IN THE CONTROL PANEL. IN 2 DAYS, WE RECEIVED A CALL FROM THE DEALERSHIP, INFORMING US THAT THERE IS A NEED TO CHANGE THE FRONT PASSENGER AIRBAG SENSOR, THAT COST $1970.00. THE MESSAGE WAS SO SHOCKING, BECAUSE I DON'T HAVE THAT SUCH AMOUNT OF MONEY.  AND THAT $1970 DOESN'T INCLUDE YET THE MAINTENANCE SERVICING FEE OF $580.00. IT WAS SO SHOCKING, THE MILEAGE OF THE IS IN THE LOW END OF 40,000 MILES, IT HAS NEVER HAD A COLLISION OR ANY OTHER IMPACT INCIDENT AND WHY THE AIRBAG IS LIGHTING UP. THAT HIGH END CAR IS BRAND NEW WHEN I BOUGHT THAT ON THAT DEALERSHIP ON YEAR 2012. THE SERVICE GUY TOLD US, THAT IT IS SO DANGEROUS TO DRIVE THIS CAR WHILE THE AIRBAG LIGHT IS \"ON\". I WAS IN A LOANER CAR RIGHT NOW. MEANWHILE, I TOLD THE DEALERSHIP, LET ME THINK ABOUT IT. SO I WENT ONLINE  TO DO A RESEARCH ABOUT THIS SITUATION, AND I LEARNED THAT THE LAND ROVER LR2 AND RANGE ROVER EVOQUE HAS A RECALL ISSUE OF THE AIRBAG SENSOR, BUT THE VIN THAT BELONGS TO MY CAR HAS A ZERO RECALL FOR THIS MATTER. PLEASE HELP US, MY CAR STILL LOOK LIKE A BRAND NEW AND IT IS PROPERLY AND SERIOUSLY MAINTAIN AND WHY THIS PROBLEM OCCUR. FIXING THIS ISSUE FROM OWN POCKET IS SO HARD, I SHOULD BE ENTITLE FOR A NO COST TO FIX THIS PROBLEM VIA RECALL. THE OTHER NIGHT I CALL THE RANGE ROVER CORPORATE SIGHTING A RECALL FOR THIS PARTICULAR ISSUE AND THEY SAID MY CAR HAS ZERO RECALL, PLEASE HELP, THE FACT THAT THE AIRBAG ILLUMINATE WHILE THE CAR IS IN MOTION THEN THERE IS A PROBLEM OF THE AIRBAG SYSTEM.",
        "vin": "SALVR2BG1CH"
    }
]