[
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/13/2017",
        "dateOfIncident": "06/30/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005083,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "ION",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "IN THE PHOTOGRAPH BELOW YOU WILL SEE THE WIPER TRANSMISSION, MADE OF  PLASTIC, THAT BROKE ON MY 2003 SATURN ION AND WAS REPLACED ON MY VEHICLE ON  7/7/2017 AT MY EXPENSE OF $298. I WAS STUNNED TO LEARN THAT ANY CAR  MANUFACTURER WOULD USE PLASTIC FOR ANY MOVING PART IN A VEHICLE ENGINE  COMPARTMENT. I HAVE BEEN IN CONTACT WITH GENERAL MOTORS, AND AT FIRST THEY  TOLD ME THERE WAS NOTHING THEY COULD DO. HOWEVER, I HAVE REQUESTED THAT  THEY DO A RECALL ON THE 2003 SATURN TO REPLACE THE WIPERS TRANSMISSIONS.    I HAVE ALSO BEEN TOLD NOT TO WASTE MY TIME THAT THIS IS NOT CONSIDERED A  SAFETY ISSUE BY NHTSA. LET ME ASSURE YOU, IT MOST DEFINITELY IS A SAFETY  ISSUE. IT IS EXTREMELY DANGEROUS TO DRIVE WITHOUT THE USE OF WIPERS WHEN  IT IS POURING RAIN. THE WIPER BROKER WHILE I WAS DRIVING IN MORNING RUSH  HOUR TRAFFIC WHEN I THOUGHT A ROCK HAD HIT MY WINDSHIELD. IT WASN'T A  ROCK, IT WAS THE WIPER THAT HAD SLAMMED BACK INTO MY WINDSHIELD. I HAD NO  CHOICE BUT TO KEEP GOING UNTIL I REACHED MY DESTINATION AT WHICH TIME I  CALLED A FRIEND WHO LOANED ME THEIR CAR UNTIL I COULD GET THIS FIXED.    I HAVE ALSO DONE A LITTLE BIT OF RESEARCH ON THIS AND FOUND THAT MY CAR IS  NOT THE ONLY SATURN 2003 THAT HAS HAD THIS PROBLEM. THE CASE FILE NUMBERS  WITH GM ARE 8-2993888661 AND 8-3078081084, WITH THE LATTER BEING THE MOST  RECENT COMMUNICATION.    AND, WHILE I KNOW MY CARE IS 14 YEARS OLD, THE AGE SHOULD NOT BE AN ISSUE  SINCE THE WIPER TRANSMISSION IS MADE OF PLASTIC.    I THANK YOU FOR YOUR CONSIDERATION OF THIS MATTER, AND IF THIS IS NOT ON  YOUR LIST OF SAFETY/HAZARDOUS CONDITIONS THAT IT BE ADDED TO THE LIST.",
        "vin": "1G8AJ52F63Z"
    }
]