[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/09/2020",
        "dateOfIncident": "10/09/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363615,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "FJ CRUISER",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "IT HAS TAKEN A FEW YEARS SINCE I KEEP MY FJ CRUISER GARAGED, BUT I FOUND A SOUND MAT ON THE INSIDE OF THE DOORS THAT RETAIN WATER AND CAUSE RUST. MY PROBLEM RIGHT NOW IS IN THE LEFT DOOR (DRIVER'S SIDE) AND THE RUST FROM INSIDE THE DOOR HAS FINALLY MADE IT'S WAY COMPLETELY THROUGH THE DOOR.  I AM ATTACHING PHOTOS SHOWING THE PERFORATION WHICH IS WELL OVER 1/8 OF AN INCH DEEP. I ONLY HAVE 57450 MILES ON MY VEHICLE DUE TO BEING OVERSEAS IN SYRIA, IRAQ, AND AFGHANISTAN AS A CIVILIAN DOD WAR ZONE PILOT SO WEATHER AND RAIN HAVE NOT BEEN AN ISSUE WHILE IT WAS GARAGED.   VEHICLES ARE DESIGNED TO LET WATER IN THE DOOR THEN DRAIN THROUGH THE DRAIN HOLES AT THE BOTTOM OF THE DOOR BUT TOYOTA BUT THIS SOUND MAT ON THE INSIDE OF THE DOOR WHICH CAUSING PROBLEMS FOR MYSELF AND A FEW OTHER UNFORTUNATE FJ CRUISER OWNERS. KNOWING THIS IS A DESIGN PROBLEM / DEFECT FROM TOYOTA, I FEEL THEY SHOULD COVER THE REPAIR BECAUSE THIS ISSUE IT OUTSIDE OF NORMAL USE DUE TO IT'S DESIGN.  I LIVE INLAND AND SALT FREE DOWN HERE IS FLORIDA SO ROAD SALT OR ROAD CHEMICALS CANNOT BE BLAMED.  ALL I CAN DO FOR NOW IS FILL IN THE HOLES AND USE TOUCH UP PAINT WHICH RUINS THE APPEARANCE OVERALL OF MY VEHICLE BECAUSE IT IS KEPT IN TOP NOTCH SHAPE INSIDE AND OUT AND THIS DOOR NOT ONLY LOOKS BAD, BUT OVER TIME WILL COMPLETELY RUST THROUGH COSTING MY HUNDREDS OF DOLLARS.",
        "vin": "JTEBU11F070"
    }
]