[
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/08/2018",
        "dateOfIncident": "10/08/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139115,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CR-V",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 CRV-EXL PURCHASED ON 9/3/18, OUR 5TH HONDA (3RD CRV), CURRENTLY AT 620 MILES.   WE'VE ALWAYS BEEN IMPRESSED WITH THE RELIABILITY OF HONDA VEHICLES, UNTIL RECENTLY. LAST FRIDAY (10/8/18), CNN NEWS REPORTED ON A CONSUMER REPORTS (CR) ARTICLE REGARDING THE CRV 2018 ENGINE PROBLEMS, INVOLVING FUEL MIXING W/ ENGINE OIL. APPARENTLY, THERE'S AN ISSUE REGARDING GAS MIXING W/ OIL IN 2017 & 2018 HONDA CRVS WITH 1.5-LITER ENGINES, POSSIBLY CAUSING STALLING AND ENGINE DAMAGE. NUMEROUS CR AND NHTSA COMPLAINTS INVOLVED STALLING, LOSS OF POWER, AND SMELL OF GAS IN THE PASSENGER CABIN. HONDA IS WORKING ON A FIX NEXT MONTH.  OWNERS ARE ADVISED TO CHECK THE OIL LEVEL ON THEIR CRVS AS IT WILL BE HIGHER AND LESS VISCOUS IF MIXED W/ GAS. WE CHECKED OUR CRV'S OIL LAST NIGHT AND NOTICED THE STRONG SMELL OF GAS ON THE DIPSTICK.  BROUGHT THE CRV THIS MORNING TO OUR HONDA DEALERSHIP. SERVICE REP REPORTED THAT THEIR TEST REVEALED NO GAS MIXED W/ THE OIL AND THAT THE SMELL IS FROM A SPECIAL OIL ADDITIVE THAT HONDA USES IN NEW VEHICLES. WE WERE ADVISED TO BRING THE CRV BACK FOR AN OIL CHANGE AT 1500 MILES.   REP WAS NOT AWARE OF THE CR & NHTSA COMPLAINTS ON GAS LEAKING INTO THE ENGINE OIL, UNTIL WE TOLD HIM. WE AGREED TO BRING THE CRV BACK FOR THE OIL CHANGE.  CALLED HONDA TO CONFIRM THE FIX IN NOVEMBER AND MENTIONED OUR VISIT TO THE DEALERSHIP. CUSTOMER REP INSISTED THAT HONDA DOES NOT PUT ANY OIL ADDITIVE IN THE NEW CRVS AND THAT I WAS MISS-INFORMED BY THE SERVICE REP. I WAS REFERRED TO THE CRV MANUAL ON PAGE 572, STATING THAT OIL ADDITIVES MAY ADVERSELY AFFECT THE ENGINE PERFORMANCE AND DURABILITY. I WAS ASSURED THAT HONDA ENGINEERS ARE WORKING ON THE FIX FOR THE PROBLEM. I WAS DIRECTED TO TAKE MY CRV TO ANOTHER DEALERSHIP FOR A 2ND OPINION AND OIL ANALYSIS.  WE'RE IN THE 'WAIT AND SEE' MODE UNTIL THE FIX IS DEPLOYED NEXT MONTH.",
        "vin": "7FARW1H8XJE"
    }
]