[
    {
        "components": "STEERING,POWER TRAIN,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/16/2017",
        "dateOfIncident": "07/15/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005541,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "PACIFICA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2006 CHRYSLER PACIFICA SEEMS TO HAVE SOME VERY COMMON AND RELATED ISSUES TO AN EXISTING RECALL. MY VEHICLE EXPERIENCES ALL KIND OF ISSUES RELATED TO A FAULTY FUEL PUMP/TANK DESIGN AND POSSIBLY SOFTWARE ISSUES ALSO. MY VEHICLE CAN BE VERY HARD TO START. MY VEHICLE CAN SHUT OFF WITHOUT WARNING. (NO OTHER KNOWN ISSUES) MY VEHICLE TENDS TO THINK THE GAS CAP IS BAD. DISPLAYING GASCAP IN THE ODOMETER AREA. WE EXPERIENCE POWER LOSS, STALLS, POOR FUEL ECONOMY, FUEL CAPOR SMELL ON OCCASION THAT COULD IGNITE, IF FOR ANY REASON THE FUEL SYSTEM IS SLIGHTLY OVERFILLED BY EVEN TEN CENTS WORTH OF FUEL IT CAN POOR FUEL ONTO THE GROUND. THIS HAPPENS ON TOP OF THE TANK. NOT AT THE FILLER HOSE. CHECK ENGIN LIGHT CODE POINTS TO EVAPORATIVE SYSTEM. MY VEHICLE WAS MANUFACTURED IN AUGUST 2005. I BELIEVE THE FUEL PUMP MODULE IS BAD AS WELL AS POSSIBLY SOFTWARE. IF YOU DO YOUR OWN RESEARCH YOU WILL FIND THIS CAR IS KNOW TO HAVE EVAP SYSTEM AND FUEL SYSTEM ISSUES. LOTS OF THEM. ONE THAT COMES TO MIND IS A CONNECTOR ON THE PUMP OR MODEL CRACKING AND ALLOWING FUEL /AIR TO ESCAPE. I AM TERRIFIED MY CAR MIGHT BLOW UP WITH MY CHILDREN IN IT. I CAN'T GIVE EXACT DATES BECAUSE THIS HAPPENS ALL OF THE TIME. EVAP CODES RETURN, FUEL SMELLS, POOR ENGINE PERFORMANCE POWER LOSS, IF IT DOES SHUT OFF WHILE DRIVING IT BECOMES HARD TO STEER. ETC ETC",
        "vin": "2A4GF68456R"
    }
]