[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/03/2020",
        "dateOfIncident": "05/26/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353015,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS V",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAKES FAILED ON A TWO-LANE DIVIDED STREET IN LUTZ.  WE WERE DRIVING STRAIGHT, AND WHEN MY HUSBAND PUT HIS FOOT ON THE BRAKE, THEY FAILED. WE DROVE TO THE NEAREST TOYOTA GARAGE AND THE AGENT SAID THAT IT WAS A MASTER CYLINDER PROBLEM BUT THE PRIUS WOULD BE COVERED UNDER A RECALL - PRIUS' LESS THAN 10 YEARS OLD AND LESS THAN 150,000 MILES ON THE CLOCK WERE COVERED. MY CAR FIT BOTH CRITERIA.    ON RETURNING TO COLLECT THE CAR, NONE OF THE V CLASS PRIUS' WERE INCLUDED. THE PART NUMBER WAS C1391. WE HAD TO PAY $3886.09. OUR MANUFACTURER NUMBER WAS NOT COVERED. IT WAS ONE NUMBER DIFFERENT.    I SPOKE TO THE MOST SENIOR EXECUTIVE I COULD CONTACT AT TOYOTA. (DANNY CASTRO). DANNY HAD NO ANSWERS THAT I FOUND SATISFACTORY. HIS BASIC REPLY WAS: 'YOUR MANUFACTURERS NUMBER IS NOT INCLUDED.'     THESE ARE MY CONCERNS AND REASONS:  1. THERE IS A KNOWN FAULT WITH THE MASTER CYLINDER WITH ALL PRIUS CARS, BUT THE COMPANY SAYS THAT IT IS ONLY RESPONSIBLE FOR CERTAIN MANUFACTURER PART NUMBERS, WHICH DOESN'T INCLUDE THE V'S.  I THINK IT'S A DESIGN FAULT AND BY GIVING THE PART A DIFFERENT NUMBER TO AVOID THE RECALL ON V'S, SEEMS UNDERHANDED.     2. THERE IS NOTHING I HAVE DONE TO INSTIGATE OR AGGRAVATE THIS PROBLEM.    3. MY CAR HAS BEEN PERFECTLY SERVICED AND I HAVE NOT MISSED ANY MILEAGE DATES.      4. WE WERE LUCKY. WITH THE BRAKES FAILING ABRUPTLY AND WITHOUT WARNING, WE WERE AT RISK AND I BELIEVE THAT MY COMPLAINT MAY SAVE OTHERS THAT AREN'T SO FORTUNATE AS US.     ALL PRIUS CARS SHOULD BE COVERED UNDER THE RECALL PROGRAM.THE INTERNET DOCUMENTS MASTER CYLINDER FAILURES ON ALL PRIUS MODELS, THE TOP ONE BEING A LEAK; MY PROBLEM. 1.5 MILLION CARS ARE BEING RECALLED - WHY NOT MINE!!!!",
        "vin": "JTDZN3EU6D3"
    }
]