[
    {
        "components": "STEERING,SUSPENSION,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/16/2017",
        "dateOfIncident": "06/16/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005601,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI XL",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "1. WHILE DRIVING STEERING WHEEL WAS MAKING A CLICKING NOISE WHEN TURNING. DEALER REPLACED UPPER STEERING COLUMN BEARING AND TURN SIGNAL.  THREE MONTHS LATER DEALER REPLACED STEERING COLUMN AGAIN DUE TO SAME ISSUE.  2. ONE MONTH LATER BOTH FRONT COIL SPRINGS WERE REPLACED.  3. WHEN REPLACED SPRINGS, DEALER FOUND THAT LEFT FRONT UPPER BALL JOINT WAS LOOSE SO REPLACED UPPER BALL JOINT AND UPPER CONTROL ARM.  4. AFTER REPLACING ABOVE MENTIONED PARTS, NOISE WAS STILL PRESENT WHEN DRIVING SO DEALER REPLACED BOTH LEFT AND RIGHT FRONT STRUTS.  5. THE FOLLOWING MONTH RIGHT FRONT STRUT WAS REPLACED AGAIN DUE TO NOISE WHILE DRIVING.  6. ONE MONTH AFTER THAT SERVICE THE RADIATOR BEGAN LEAKING WHILE ON THE ROAD AND THE DEALER REPLACED THE RADIATOR.  7. 07/12/2017 LEFT FRONT STRUT WAS REPLACED AGAIN.  THIS IS THE 4TH STRUT PUT IN THIS VEHICLE.  8. 07/12/2017 A/C STOPPED WORKING.  DEALER SAID IT NEEDS NEW CONDENSER WHICH IS ON BACK ORDER INDEFINITELY AT THIS POINT SO NOT ABLE TO FIX AT THIS TIME.    THESE ISSUES HAPPENED OVER A PERIOD OF 18 MONTHS.  NOT AT A SPECIFIC TIME.  THE STEERING COLUMN IS STILL MAKING A CLICKING NOISE WHILE TURNING.  WE HAVE TAKEN THE VEHICLE BACK, HOWEVER THE DEALER SAYS THEY ARE UNABLE TO DUPLICATE THE NOISE.  IF THEY END UP REPLACING THE STEERING COLUMN AGAIN IT WILL BE THE THIRD TIME.  THIS VEHICLE IS NOT TRUST WORTHY TO DRIVE LONG DISTANCES OR CROSS COUNTRY.  VERY DISAPPOINTING FOR A $70,000 NEW VEHICLE.",
        "vin": "1GKS2JKJ2FR"
    }
]