[
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/25/2019",
        "dateOfIncident": "11/23/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282315,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE AND I WERE HEADED TO COSTCO AND WERE DRIVING THROUGH WEST CHESTER OHIO.  WE WENT OVER A SET OF RAILROAD TRACKS ON PRINCETON GLENDALE RD. JUST BEFORE PORT UNION RD.  ONCE WE WENT OVER THE TRACKS THE FRONT OF THE TRUCK BEGAN TO JUMP AND SHAKE UNCONTROLLABLY.  IT WAS VERY SCARY.  WE HAD NO IDEA WHAT WAS GOING ON.  THE TRUCK WOBBLED SIDE TO SIDE FOR A GOOD DISTANCE AFTER WE WENT OVER THE TRACKS.  THE WOBBLING WAS FELT EXTREMELY STRONG IN THE FRONT END AND CARRIED THROUGH THE CAB OF THE TRUCK.  IT ONLY SUBSIDED AFTER SLOWING THE TRUCK DOWN BY LETTING OFF THE ACCELERATOR AND LETTING IT COAST TO ABOUT 25 MPH.  THANK GOODNESS WE WEREN'T ON THE HIGHWAY OR WORSE YET, THAT WE WEREN'T TOWING ANYTHING.  WE BOUGHT THIS TRUCK TO TOW A LARGE FIFTH WHEEL CAMPER.  IF THIS WERE TO HAPPEN WHILE TOWING THIS ON THE HIGHWAY WE WOULD PROBABLY LOSE CONTROL AND CRASH.  THAT WOULD BE CATASTROPHIC TO SAY THE LEAST.  I HAVE JUST UNDER 4,000 MILES ON MY NEW TRUCK AND THIS IS THE SECOND TIME THIS HAS HAPPENED.  THE FIRST TIME WAS MINIMAL.  SO MINIMAL THAT WE WROTE IT OFF AFTER IT HAPPENED.  BUT, IT TOO HAPPENED AFTER GOING OVER A SET OF RAILROAD TRACKS ON A RURAL ROAD JUST OUTSIDE OF SEVEN MILE OHIO.  IT WAS NOTHING LIKE WHAT HAPPENED THIS WEEKEND.  SINCE THIS HAPPENED I TOOK IT UPON MYSELF TO LOOK TO THE INTERNET FOR MORE INFO.  IT SEEMS THIS IS A NATIONAL PROBLEM WITH THE SUPER DUTY TRUCKS.  THERE IS A PLETHORA OF COMPLAINTS OF THIS EXACT SAME THING.  MY FEAR IS CONTACTING MY LOCAL SALES DEALERSHIP AND GETTING THE STANDARD JARGON.  HAVING THE MECHANIC TAKE IT FOR A TEST DRIVE AND THEN CALL ME AFTER I DROP IT OFF TO THEM FOR THREE DAYS AND THEM TELL ME THAT NOTHING OCCURRED AND NOTHING APPEARS BROKEN.  LIKE I SAID EARLIER, I HAVE ALMOST 4,000 MILES ON THE TRUCK AND IT HAS HAPPENED TWICE.",
        "vin": "1FT8W3BT4KE"
    }
]