[
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/23/2017",
        "dateOfIncident": "06/21/2017",
        "fire": false,
        "manufacturer": "SMART USA DISTRIBUTOR LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000905,
        "products": [
            {
                "manufacturer": "SMART USA DISTRIBUTOR LLC",
                "productMake": "SMART",
                "productModel": "FORTWO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AS MY WIFE WAS FILLING THE GAS TANK IT FAILED TO BUILD BACK PRESSURE THAT WOULD NORMALLY SHUT OFF THE GAS PUMP. THIS HAS OCCURRED TWICE. THEN ON MON. THE 19TH OF JUNE AFTER WORK MY WIFE COMPLAINED OF A STRONG GAS ODER INSIDE THE VEHICLE. SHE DROVE THE CAR TO WORK ON TUES. MORNING AND HAD THE SAME STRONG GAS SMELL. SHE THOUGHT THAT IT MIGHT BE DUE TO OVERFILLING THE TANK. WHEN SHE GOT HOME ON TUES. NIGHT WE NOTICED A STEADY STREAM OF GAS POURING OUT OF THE VEHICLE UNDER THE CAR NEAR THE PASSENGER SIDE OF THE VEHICLE. THE GAS ONLY STREAMED OUT WHEN THE ENGINE WAS RUNNING. ONCE WE SHUTOFF THE CAR IT WOULD DRIBBLE OUT FOR A FEW MORE MINUTES THEN EVENTUALLY STOP. WHEN I TURNED THE CAR ON IT WOULD BEGIN FLOWING FUEL ONTO THE GROUND IMMEDIATELY. I HAD THE CAR TOWED TO THE MERCEDES BENZ\\SMART CAR DEALER LOCATED NEAREST TO ME.     AFTER THE CAR WAS TOWED I STARTED TO DO SOME RESEARCH ONLINE TO DETERMINE IF THIS IS A COMMON ISSUE. I WAS SURPRISED TO FIND THAT THERE HAVE BEEN MANY COMPLAINTS POSTED TO CHAT ROOM BOARDS REGARDING A FUEL LEAK AND A BROKEN DISCHARGE LINE FROM THE FUEL PUMP TO THE ENGINE. WHAT I WAS EVEN MORE STARTLED TO FIND WAS LITERALLY HUNDREDS OF DIFFERENT VIDEOS OF SMART CARS CATCHING ON FIRE. I SOON DISCOVERED THAT THERE IS AN OPEN INVESTIGATION WITH THE NHTSA FOR ENGINE FIRES ON MODEL 2008-2009 FORTWO SMART CARS. THE INVESTIGATION NUMBER IS PE-16-016    THE DEALERSHIP CALLED ME TODAY AND STATED THAT THE FUEL PUMP IS LEAKING GAS ON TOP OF THE TANK AND THAT THE FUEL PUMP WILL NEED TO BE REPLACED. THEY HAVE NOT DROPPED THE FUEL TANK YET. THEY WITNESSED THE FUEL LEAK USING A MIRROR. IT IS NOW FRIDAY AT 2:15PM PST, AND TO LATE FOR THEM TO START REPAIRING THE FUEL PUMP TODAY. THE DEALERSHIP PLANS TO DROP THE TANK AND REPLACE THE FUEL PUMP ON TUES. MORNING. I WILL BE THERE TO PHOTOGRAPH THE LOCATION OF THE BREAK ON THE FUEL LINE AND UPDATE THIS COMPLAINT AFTER THAT.",
        "vin": "WMEEJ31X88K"
    }
]