[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/30/2017",
        "dateOfIncident": "06/30/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002590,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2014 PATRIOT IS A 5 SPEED MANUAL TRANSMISSION WITH A 2.4 L ENGINE. IT HAS JUST UNDER 54000 MILES AND HAS RECENTLY (WITHIN THE PAST FEW MONTHS) STARTED STALLING WHILE DRIVING. LUCKILY NOT SUPER SERIOUSLY TO THE POINT OF LOSING ALL POWER AND BEING STRANDED, BUT IT'S  GETTING WORSE. THOUGHT I WAS IMAGINING IT DUE TO NO SENSOR OR WARNING LIGHTS, THEN ONE DAY FOR A SPLIT SECOND THE ETC LIGHT FLASHED. IT'S NEVER FLASHED SINCE AND THE CAR WOULD NEVER DO ANYTHING WHEN MY BOYFRIEND DROVE IT. LAST WEEK WHILE STOPPED, WAITING TO MAKE A RIGHT TURN ON DRY PAVEMENT MY TRACTION CONTROL LIGHT FLASHED. FINALLY LAST WEEK AS WELL MY BOYFRIEND FELT IT STARTED TEMPORARILY WHILE HE WAS DRIVING, ON THE FREEWAY. NOW IT HAS STARTED NOT STARTING. ALL ELECTRICAL WILL WORK, BUT ABSOLUTELY NOTHING AS FAR AS ENGINE. IT HAD ONLY DONE THAT COUPLE TIMES, NOW, TODAY IT DID IT FOUR TIMES IN 4 HOURS. THE FIFTH TIME IT STARTED TO TURN OVER, THEN DIED MID-TURNOVER AND WOULDN'T START AGAIN. IT SAYS THERE WAS ORIGINALLY A RECALL ON THIS AND A COUPLE OTHER YEARS PATRIOT, COMPASS AND SOME OTHER CHRYSLER MODELS. NOT SURE IF MINE WAS FIXED OR NOT NOW DUE TO THE PROBLEM ARISING AT THIS POINT IN TIME. I'VE ONLY HAD THE JEEP SINCE MAY 2015. CONTACTED THE DEALER AND I'LL BE TAKING IT IN HOPEFULLY NEXT WEEK BUT I HAVE A DEDUCTIBLE. 'IF' MY BUMPER TO BUMPER WARRANTY COVERS IT, I'LL HAVE RENTAL COVERAGE WHICH IS BETTER THAN SOME OTHER PEOPLE'S STORIES I'VE READ. IS THERE ANYONE ELSE EXPERIENCING MORE RECENT ISSUES? MOST OF WHAT I'VE READ WAS FROM LAST YEAR SOMETIME. I'VE ALSO READ THAT CHRYSLER KNOWS OF THIS BEING A MORE CURRENT ISSUE AND REFUSING TO DO ANYTHING.",
        "vin": "1C4NJRBB1ED"
    }
]