[
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/29/2017",
        "dateOfIncident": "05/27/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002096,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "PT CRUISER",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "A FOLLOW-UP TO COMPLAINT 11001939 ; WHERE THE WHEEL SENSOR/VALVE BLEW OUT OF THE RIM ; TOOK THE TIRE AND RIM TO \"COSTCO TIRE\" WHERE I HAD BOUGHT THE TIRES ; THE CHRYSLER ALUMINUM SENSOR WAS STILL INSIDE THE TIRE ; THEY SAID THE ALUMINUM WAS SO CORRODED ; THEY COULD NOT REPAIR IT ; NOW AS AN ENGINEER IN THE METALS INDUSTRY ; YOU N E V E R ; PUT ALUMINUM AND STEEL PARTS TOGETHER BECAUSE JUST THEM TOUCHING EACH OTHER ; CAUSES A GALVANIC REACTION WHICH DOES EXACTLY WHAT HAPPENED HERE...............CORROSION AND SEPARATION.     ANY TIME THE TWO METAL TOUCH YOU GET THIS REACTION; TO PUT THESE TOGETHER YOU SURROUND THE METAL WITH A SLEEVE CALLED A \"JOCK\" KIT TO KEEP THE SEPARATE; OBVIOUSLY TO PREVENT THIS.    EVEN THOUGH I STOPPED THE VEHIHCLE AS SOON AS MY SENSOR LIGHT CAME ON I ALSO DESTROYED THE SIDEWALL OF THE TIRE (BFGOODRICH ADVANTAGE)........THE TIRE MANAGER ASKED HOW I KEPT THE VEHICLE FROM CRASHING; I TOLD HIM I WAS AN EXPERIENCED RACE CAR DRIVER AND DIDN'T PANIC.    NOW ; ALL CHRYSLER PT CRUISER TO MY AND COSTCO'S TIRE MANAGER HAVE SEEN HAVE THE SAME SET-UP FOR WHEEL SENSORS IN ALL THEIR MODELS ; I OWN 2 OF THEM ; LOVE THEM ; BUT THIS HAS HAPPENED BEFORE AND WITH WATER ETC. ADDED TO THE FACTS, I'M SURE THEIR ARE OTHERS' WITH THE SAME PROBLEM AND MAYBE NOT THE EXPERIENCE TO NOT MAKE THIS A \"ROLLOVER\" OR \"OTHER LANE SWERVE \" SITUATION.    I LIVE IN PA. BUT THIS VEHICLE IS NEVER DRIVEN THE WINTER THRU SALTS FOR SNOW ; REALLY A CONCERN IN MY MIND HOW THESE ARE IN STEEL RIMS.............PROBABLY DOES NOT EFFECT THE ALUMINUM OPTIONAL WHEELS THEY OFFERED.      THANKS",
        "vin": ""
    }
]