[
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/14/2019",
        "dateOfIncident": "02/22/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186815,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2003 HYUNDAI ELANTRA IS SUFFERING FROM SEVERE CORROSION ON THE SUBFRAME/UNIBODY, A PROBLEM FOR WHICH A CLASS ACTION SETTLEMENT WAS APPROVED (SEE THE FOLLOWING LINK HTTP://SALTBELTCORROSION.HYUNDAIUSA.COM/ FOR DETAILS REGARDING THE CIRULLI V. HYUNDAI MOTOR AMERICA SETTLEMENT, WHICH REACHED FINAL APPROVAL ON MAY 25, 2011). THE SETTLEMENT PROVIDED REIMBURSEMENT FOR REPAIRS.     ALTHOUGH HYUNDAI PERFORMED A \"RUSTPROOFING/WAX\" REPAIR IN 2010 ON THIS CAR, AS WELL AS A SUBFRAME REPAIR/REPLACEMENT IN 2015 (WHICH IS CONSIDERED BY HYUNDAI TO HAVE SOLVED THE PROBLEM AS ORIGINALLY DESCRIBED IN THE CLASS ACTION LAWSUIT), WE BELIEVE THAT THE DEFECT AS DESCRIBED IN THE CLASS ACTION SETTLEMENT WAS IN FACT NOT RECTIFIED, AND THUS CONSISTS OF A FAILURE OF RECALL REPAIR. IN FACT, IT WOULD SEEM THAT ALTHOUGH HYUNDAI DID REPLACE ALL OR A PORTION OF THE SUBFRAME IS 2015, THE EXACT SAME PROBLEM HAS RE-OCCURRED ON THE CAR WITHIN LESS THAN 5 YEARS, AND IS A SERIOUS SAFETY ISSUE (IF THE SUBFRAME COLLAPSES UNDER THE WEIGHT OF THE CAR, THERE WOULD BE SERIOUS RISKS OF INJURY TO ANY PASSENGERS ON BOARD).    THE DEEP SUBFRAME CORROSION ITSELF WAS ONLY NOTICED AND PHOTOGRAPHED BY A LOCAL MECHANIC MORE THAN A YEAR AFTER PURCHASING THIS VEHICLE FROM ITS SECOND OWNER AND IS EVIDENCED BY THE ATTACHED PICTURES.     IN SUMMARY, ALTHOUGH HYUNDAI MOTOR AMERICA CONSIDERS THAT THE CORROSION PROBLEM AS DESCRIBED IN CIRULLI V. HYUNDAI MOTOR AMERICA SETTLEMENT WAS REPAIRED SUCCESSFULLY IN 2015 ON THE CAR CORRESPONDING TO THE VIN NUMBER ATTACHED TO THIS COMPLAINT, WE BELIEVE THAT IT CONSISTED OF A FAILED RECALL REPAIR, AND THAT IT IS THE RESPONSIBILITY OF HYUNDAI MOTOR AMERICA TO RECTIFY THE SITUATION AT THEIR EXPENSE.    ALSO ATTACHED IS A PDF SHOWING A DESCRIPTION OF THE CORROSION WITHIN A LARGER ESTIMATE, WHICH WAS AUTHORED BY THE SAME SHOP THAT TOOK THE PHOTOS OF THE VEHICLE'S CORRODED SUBFRAME.",
        "vin": "KMHDN45D73U"
    }
]