[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/27/2017",
        "dateOfIncident": "06/14/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001724,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-150",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE VACUUM PUMP FAILURE: USED 2012 FORD F150 PURCHASED IN OCTOBER 2016.  WHEN WE MOVED IN MARCH 2017 TO A HOME WITH A SLIGHT DRIVEWAY SLANT, THERE WERE DAILY BRAKE ISSUES WHERE WHEN APPLYING THE BRAKE IT WOULD FEEL STIFF AND FAIL TO STOP THE VEHICLE. UPON INVESTIGATION, WE LEARNED THAT A RECALL HAD BEEN DONE ON OUR MAKE, MODEL, AND YEAR OF VEHICLE DUE TO A VACUUM BRAKE PUMP FAILURE, BUT WERE TOLD THAT OUR VEHICLE WAS MADE AT A DIFFERENT PLANT THEN WHERE THE RECALL WAS VALID FOR. ON 4/24/17 WE TOOK THE VEHICLE IN TO HAVE IT CHECKED OUT AND WERE TOLD BY THE DEALERSHIP THAT THIS WAS \"NORMAL\" AND CHARGED $83.95 FOR THIS. WITHIN A COUPLE WEEKS WE STARTED HEARING ANOTHER LOUD NOISE WHEN STARTING THE VEHICLE AND TOOK IT IN ON 5/12/17 WHERE THE TIMING CHAIN WAS REPLACED UNDER POWERTRAIN WARRANTY. A MONTH LATER, THE SERVICE BRAKE LIGHT STARTED COMING ON WHILE DRIVING, BUT IF WE STOPPED AND TURNED OFF THE VEHICLE AND TURNED IT BACK ON IT WOULD STAY OFF (FOR A DAY OR TWO). WE CALLED AND WERE TOLD NOT TO BRING IT IN UNLESS THE LIGHT WAS ACTUALLY ON. A WEEK LATER THE LIGHT CAME ON AND WE TOOK IT INTO AN AUTO SHOP TO HAVE THE CODES READ TO IDENTIFY THE ISSUE TO SHOW THE DEALERSHIP. ON 6/21/17 THE VEHICLE WAS TAKEN IN WITH THE READINGS AND AT THAT TIME WE WERE INFORMED THAT THE VACUUM PUMP HAD FAILED AND NEEDED TO BE REPLACED. FORD REFUSED TO PAY FOR ANY OF THE SERVICE AND WE WERE CHARGED $559.08 FOR THE EXACT PROBLEM THE OTHER VEHICLES HAD BEEN RECALLED FOR AND WHICH WE WERE ORIGINALLY TOLD WAS \"NORMAL\" TO NOT BE ABLE TO USE THE BRAKES ON OUR VEHICLE FOR 20 SECONDS OR SO WHEN STARTED. AT THIS TIME WE REQUESTED TO SEE WHAT REPAIRS HAD BEEN DONE ON THE VEHICLE IN THE PAST PRIOR TO US PURCHASING THE VEHICLE AND OUR LISTED BELOW:3/21/16 REPLACE TIMING CHAIN AT BICKLEY FORD;3/21/16 REPLACE VACUUM PUMP AT BICKLEY FORD;4/8/16 REPLACE HOSES FOR VACUUM PUMP AT BICKLEY FORD",
        "vin": "1FTFW1ET5CF"
    }
]