[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/12/2017",
        "dateOfIncident": "08/06/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004812,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY HYBRID",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN NOTICING THAT MY CAR HAS BEEN BURNING EXCESSIVE OIL FOR OVER A YEAR.  WHEN I HAVE TAKEN MY CAR IN FOR THE REGULARLY SCHEDULED OIL CHANGES THE SERVICE DEPARTMENT (NOT TOYOTA) HAS NOT FOUND A PROBLEM.  RECENTLY A FRIEND FOUND OUT ON LINE THAT THERE IS A TOYOTA WARRANTY ENHANCEMENT FOR THIS ISSUE GOOD FOR 10 YEARS/150,000 MILES.  I CALLED A LOCAL TOYOTA SERVICE DEPARTMENT BUT I AM OUTSIDE OF THE WARRANTY ENHANCEMENT BECAUSE I AM OVER THE 150,000 MILES BUT I AM WITHIN THE YEARS.  MY CAR  IS 8 YEARS OLD WITH 154,000 MILES.  I TOLD THEM THAT I HAVE BEEN HAVING THIS ISSUE FOR A YEAR AND MY CAR HAD ABOUT 137,000 MILES AT THE TIME I NOTICED IT WAS AN ISSUE.  THE SUGGESTED I CALLED THE TOYOTA MOTOR COMPANY,  I CALLED THEM ON 6/15/2017 BUT I DID NOT GET ANY SATISFACTION. THEY WILL NOT HONOR THE WARRANTY ENHANCEMENT SINCE I AM OVER THE MILES.  THEY SAY THIS IS A WARRANTY ENHANCEMENT AND NOT A RECALL.  IT SHOULD BE A RECALL.  THE WOMAN I SPOKE TO MADE A COMMENT THAT I DO NOT TAKE MY VEHICLE TO BE SERVICED AT THE DEALERSHIP.  TODAY I LOOKED AT MY RECORDS.  I HAVE TAKEN MY CAR TO TOYOTA TO BE SERVICE, RECALL ISSUES AND ANOTHER WARRANTY ENHANCEMENT THAT I WAS NOT NOTIFIED ABOUT.  I TOLD THEM TODAY 7/12/2017 THAT I HAVE TAKEN IT TO TOYOTA SERVICE DEPARTMENT NUMEROUS TIMES BUT I WAS NOT INFORMED OF THE EXCESSIVE OIL BURNING ISSUE.  SHE SAID THAT I WOULD NEED TO TELL THEM I WAS HAVING A PROBLEM FIRST.  SHE ALLEGED THAT I WAS SENT A LETTER BUT I NEVER RECEIVED A LETTER.  I SHOULD HAVE ASKED HER WHY I WAS SENT A LETTER BUT WHEN I HAVE ASKED TOYOTA IF THERE WERE ANY RECALLS THEY DID NOT TELL ME ABOUT THE EXCESSIVE OIL BURNING ISSUE.  I AM PUTTING A QUART OF OIL IN MY CAR PER WEEK (500 MILES).  THIS IS VERY EXPENSIVE.  I AM WAITING TO HERE BACK FROM A SUPERVISOR.  THERE IS A PROBLEM BUT TOYOTA IS BEING SNEAKING AND DISHONEST ABOUT THE ISSUE.",
        "vin": "4T1BB46K79U"
    }
]