[
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/19/2017",
        "dateOfIncident": "04/15/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000110,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT VARYING SPEEDS, VEHICLE'S TRACTION CONTROL POWERS OFF. AS A RESULT, THE CAR LOOSES ALL POWER, STEERING WHEEL LOCKS, AND I AM UNABLE TO STEER OR BREAK. ONCE THE CAR POWERS DOWN OR IS TURNED OFF, IT WILL RESTART. USUALLY THE ENGINE LIGHT INDICATOR WILL TURN ON. IT HAS POWERED DOWN AT IT'S PEAK FREQUENCY THREE TIMES WITHIN 10 MILES. THE ISSUE IS TOTALLY UNPREDICTABLE AND HAS HAPPENED OVER 8 TIMES TOTAL, INCLUDING ON THE HIGHWAY TRAVELING 65-70 MILES PER HOUR AND ON A NEIGHBORHOOD STREET GOING AS SLOW AS 20 MILES PER HOUR. IT HAS BEEN TAKEN TO THE GMC DEALERSHIP WHERE IT WAS PURCHASED FOR REPAIRS 4 TIMES, BEGINNING IN APRIL 2017. IT IS CURRENTLY THERE NOW (THE 4TH TIME, WAS TOWED TODAY 6/19/17;). IT IS UNSAFE TO DRIVE AS THERE IS NO WAY OF KNOWING WHEN OR WHERE THE CAR WILL LOOSE POWER. THERE IS VERY LITTLE TIME TO DO ANYTHING WHEN THE WARNING SOUND/MESSAGE APPEARS. LITERALLY, YOU MUST PRAY THAT NO ONE HITS YOU AND THAT YOU CAN COAST TO A SAFE PART OF THE ROAD (E.G., SHOULDER). THE DEALER HAS BEEN UNABLE TO DIAGNOSE THE CAUSE OR REPAIR THE VEHICLE PROPERLY. I WORK IN A CITY (ATLANTA, GA) WHERE A CAR IS NECESSARY GIVEN THE DISTANCE I DRIVE FROM HOME TO WORK EVERYDAY. I HAVE LOST VALUABLE WORK HOURS AND PEACE OF MIND WITH THIS CAR. I JUST WANT MY FAMILY TO BE SAFE WHEN DRIVING. I HAVE ALSO CALLED THE CORPORATE GMC OFFICE AND OPENED A CASE.",
        "vin": "1GKKRRKD3DJ"
    }
]