[
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/12/2021",
        "dateOfIncident": "06/04/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420715,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "200",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Chrysler 200 (2015) engine shuts down with no notice. I have to literally stop, put the car in park and restart the ignition in the middle of the road to get the car moving again.  Mostly when deacceleration (turning a corner/slowing down for a traffic stop,  going over a bump, etc.). The electrical system just shuts off.  Notice that the temperature outside is usually warm.  Seems to do better in cooler weather.  The car does not get hot (temperature gauge has been tested).  Oil is full and gets regular changes.  It is Extremely Dangerous.  Many times throughout this month I have almost been hit.  Angry people cuss you out for stopping in the middle of traffic.  Not only does it cause me high anxiety but the safety of myself and my grandchild is at risk.  I am afraid to drive it but have no other means of transportation. Message displays:  Put gear in park, restart engine.  No engine light comes on so the mechanics are unable to diagnosis issue.  It has been put on the code reader but not codes appear.  Midas said it was  the Power Distribution Center Electrical Connector  (R24) . That they couldn't fix it but that it should be under warranty but it wasn't for my VIN # .  Prior ( a week or so before) the airbag alert illuminated on the dash  (2 different times) but went off after I adjusted my seat.  At one time after I started having problems my low light beam indicator said my bulb was out but then went off and my low light still worked (not burnt out).  Now my control in the middle of my dash work.",
        "vin": "1c3cccab6fn"
    }
]