[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/22/2017",
        "dateOfIncident": "11/17/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11048115,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "2012 KIA SPORTAGE (APPROX 55K MILES, VIN NOT COVERED BY THE  RECALL - MANUFACTURER WARRANTY EXPIRED IN JANUARY). DRIVING  ACROSS COUNTRY FOR THANKSGIVING. WE LEFT TUCSON, AZ LAST  THURSDAY NIGHT (11/16). FRIDAY AFTERNOON WE STARTED HEARING A  RATTLING SOUND COMING FROM THE ENGINE. AS I ACCELERATED, THE  RATTLING BECAME FASTER AND WORSE. ABOUT 1 TO 2 MILES LATER, THE  CARS JUST STOPPED RUNNING. WE WERE STRANDED 50 MILES WEST OF  ODESSA TX FOR ABOUT 2 HOURS. $400 TOW TRUCK RIDE TO THE KIA  DEALERSHIP IN ODESSA. WE GOT THERE ABOUT 30 MINUTES BEFORE  THEY CLOSED AND WERE TOLD THE CAR LIKELY WOULD NEED A ENGINE  REPLACEMENT, BUT THEY COULDN'T CHECK IT OUT UNTIL MONDAY.    WE DECIDED TO RENT A CAR AND FORGE AHEAD TO NORTH CAROLINA  LEAVING OUR SPORTAGE IN TEXAS. I CALLED ON MONDAY, AND WAS  THE TOLD THE ENGINE WOULD NEED TO BE REPLACED. I ASKED ABOUT  THE OIL, AND WAS TOLD THE OIL WAS \"FULL AND CLEAN\". THEY WERE  GOING TO TRY TO FIND A REASONABLY PRICED USED ENGINE FOR US.    AFTER LEARNING OF THE ENGINE RECALL, I CALLED KIA ON TUESDAY  MORNING (800-333-4KIA) AND WAS TOLD OUR CAR WASN'T  AFFECTED BY THE RECALL, BUT IF THE CAR WAS DIAGNOSED AT THE  DEALERSHIP A \"TECH-LINE\" WOULD BE GENERATED AND KIA COULD  LOOK AT THE CASE AND POSSIBLY HELP OUT ON A CASE-BY-CASE  BASIS.    I CALLED THE DEALERSHIP BACK AND THEY TOLD ME THEY DON'T START  A \"TECH-LINE\" IF THE CAR IS NO LONGER COVERED BY WARRANTY, BUT  THEY WOULD CHECK WITH HIS REGIONAL MANAGER AND GET BACK TO  ME. I HAVEN'T HEARD FROM THEM TODAY.    ANYWAY... SORRY FOR THE NOVEL. BASED ON OTHER  STORIES, AND NEWS ARTICLES I'VE READ, I BELIEVE THIS ENGINE HAS  THE SAME KIND OF DEFECTS THE OTHERS HAVE HAD. ANY HELP WOULD BE APPRECIATED. THANKS!",
        "vin": "KNDPB3A21C7"
    }
]