[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/02/2021",
        "dateOfIncident": "09/14/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398715,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I BELIEVE THERE IS A PROBLEM WITH THE TRANSMISSION IN THIS CAR. IT IS AN LX WITH THE 2.4L ENGINE GDI. IT'S THE STANDARD ENGINE. THE TRANSMISSION SEEMED \"OFF\" AFTER A FIRMWARE UPDATE. PRIOR TO THIS, THE CAR REALLY PERFORMED AND ROLLED NICELY. BY THAT I MEAN, THERE WAS NO DETECTABLE DRAY WHEN TAKING MY FOOT OFF THE GAS. IN DRIVING THE CAR NOW, THE CAR JUST SEEMS TO LUG, AS IT TAKES MORE ACCELERATION TO GET THE CAR MOVING. THE TRANSMISSION \"HANGS UP\" AT AROUND 40MPH, WITH NO LOAD ON THE ENGINE. THE TACH AT 40MPH OR THEREABOUTS, READS AROUND 1900-2200RPMS. THIS IS FAR TOO HIGH IN MY OPINION, BEFORE I GO A LITTLE FASTER, AND THE TRANS FINALLY SHIFTS TO THE NEXT GEAR, LOWERING THE RPMS TO WHERE THEY SHOULD BE AT 40 MPH. GAS MILEAGE IS DOWN APPROX. 20% TO WHAT I ENJOYED BEFORE THIS STARTED. I DID HAVE THE CAR BACK TO THE DEALER, FRED BEANS IN LANGHORNE PA, FOR ROUTINE MAINTENANCE AND MENTIONED IT TO THE SERVICE WRITER. OF COURSE (AND I MEAN THIS WITH ALL DUE RESPECT), THEY COULDN'T DUPLICATE THE EXPERIENCE. WHAT THE DID DO WAS WIPE THE TRANSMISSION MEMORY CLEAN AND WE STARTED FRESH. THE IDEA BEING THE TRANSMISSION WOULD RELEARN MY DRIVING HABITS. I DON'T PROFESS TO KNOW EVERYTHING ABOUT A TRANS LEARNING HABITS, BUT I DO KNOW THAT THE TRANS SHOULD NOT HANG UP BETWEEN GEARS FOR ANY REASON. DUE TO RETURN TO THE DEALERSHIP FOR REGULAR SERVICE. WILL MENTION IT AGAIN. OUT OF REGULAR WARRANTY BUT I DID PURCHASE AN EXTENDED WARRANTY.",
        "vin": "5XXGT4L39HG"
    }
]