[
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/21/2017",
        "dateOfIncident": "03/15/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000425,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE CAR IS IDLING WHETHER IN PARK OR DRIVE, IT WILL LOSE POWER AND I NOTICE THE RPM NEEDLE BOUNCES ALL OVER THE PLACE.  I HAVE HAD THE CAR COMPLETELY DIE ON ME 3 DIFFERENT TIMES AS I HAVE STARTED TO ACCELERATE.  LUCKILY ALL 3 TIMES WERE WHEN I WAS LEAVING A DRIVE-THRU AND WASN'T IN HEAVY TRAFFIC. IT WILL LURCH AND SPUTTER WHEN IN DRIVE AND THE BRAKE IS APPLIED.  I TOOK IT TO OUR LOCAL FORD DEALERSHIP WHERE I PURCHASED THE VEHICLE NEW IN 2010 AND THE SERVICE DEPARTMENT CHECKED TO SEE IF IT WAS ON THE RECALL LIST BECAUSE IT WAS SHOWING ALL OF THE SAME SYMPTOMS OF SEVERAL OTHERS THAT HAD A THROTTLE BODY RECALL AND I WAS LUCKY IT HADN'T LOST POWER GOING DOWN THE HIGHWAY AT 70 MPH LIKE SOME OF THE OTHERS HAD.  WHEN THEY CHECKED MY VIN IT DIDN'T HAVE A RECALL BUT I WAS TOLD THAT I WOULD HAVE TO HAVE THE THROTTLE BODY REPLACED AND IT WOULD COST AROUND $600!! MY 2011 FOCUS ONLY HAS 48,000 MILES ON IT AND I CAN'T FIGURE OUT WHY IF IT HAS THE EXACT SAME MALFUNCTION AS THE RECALLED MODELS, THAT THE 2011 IS NOT A PART OF THAT RECALL?? I WOULD EXPECT A CAR TO BE BETTER MADE TO LAST A LITTLE LONGER THAN THIS! I HAVE HAD TO HAVE THE MOTOR IN THE REAR WINDOW WORKED ON AND CLIPS REPLACED TWICE WITHIN THE FIRST 2 YEARS I HAD THE CAR BUT I LOVE MY FOCUS SO I THINK FORD SHOULD STEP UP AND FIX THE THROTTLE BODY ISSUE NO MATTER WHAT MODEL OF VEHICLE IT IS ON!",
        "vin": "1FAHP3HN5BW"
    }
]