[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/09/2017",
        "dateOfIncident": "06/30/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003909,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR KIA SORENTO HAD 46963 MILES.  WE ARE THE SECOND OWNERS AND HAVE PUT 34K MILES ON IT AND HAVE HAD THE OIL CHANGED AT APPROXIMATELY  EVERY 5K MILES. THE KIA SORENTO STOPPED RUNNING WHILE IT WAS BEING DRIVEN AT 55 MPH ON A TWO-LANE ROAD.  I WAS BEING FOLLOWED BY A DUALLY PICK UP TOWING A LARGE BOAT. THE CAR LOST POWER AND THE \"CHECK ENGINE\" LIGHT CAME ON.  I HAD JUST ENOUGH TIME TO TURN ON MY EMERGENCY FLASHERS AND FIND A SAFE PLACE TO PULL OFF THE ROAD.  WE HAD IT TOWED TO A REPAIR SHOP IN KINGSLAND, TX,  THEY CUT THE SERPENTINE BELT, COULDN'T GET THE ENGINE TO TURN, TOLD US THAT THE OIL PUMP HAD FAILED AND THE ENGINE SEIZED. WE THEN HAD IT TOWED TO THE DEALER IN AUSTIN, WHERE THEY HAD A TECHNICIAN LOOK AT IT AND CONFIRMED THAT THE ENGINE WAS BLOWN. THEY SAID THAT THE ONLY WAY TO KNOW IF THERE WERE METAL SHAVINGS WOULD BE TO PULL THE OIL PAN ($195) AND THAT WOULD ONLY CONFIRM THAT SHAVINGS WERE IN THE OIL. TO ACTUALLY KNOW WHAT HAD CAUSED ENGINE FAILURE THEY WOULD HAVE TO PULL THE MAIN AND ROD BEARINGS ($400). THEY SAID THAT EVEN IF WE DID FIND THAT THE ENGINE FAILURE WAS DUE TO METAL SHAVINGS THAT IT WOULD NOT BE CONSIDERED AS PART OF RECALL SC147 BECAUSE IT WASN'T MANUFACTURED AT A \"CERTAIN PLANT\" IN A \"CERTAIN MONTH\".  HE WAS UNABLE TO TELL ME WHAT PLANT AND MONTH. WE HAVE NOW FOUND, THROUGH DECODING OUR VIN, THAT THIS CAR WAS BUILT IN GEORGIA AND HAS THE THETA II ENGINE. THEY DID OFFER TO PUT IN AN ENGINE FROM A WRECKED KIA WITH 100K MILES ON IT AT A COST OF $6700-$6800.  THE KBB VALUE IS $9800. WE WERE TOLD THAT THE BASIC WARRANTY HAD ENDED ON APRIL 24, 2017 AND THAT THE 5YR/60K WARRANTY WAS NOT TRANSFERABLE TO THE SECOND OWNER.   WE THEN FOUND THIS: HTTPS://WWW.NHTSA.GOV/VEHICLE/2013/KIA/SORENTO/SUV/FWD#MANUFACTURERCOMMUNICATIONS SHOWING THAT THEY HAD MODIFIED THE WARRANTY.  NO ONE AT THE KIA CUSTOMER SERVICE CENTER OR AT THE DEALERSHIP TOLD US THIS.",
        "vin": "5XYKT3A13DG"
    }
]