[
    {
        "components": "EXTERIOR LIGHTING,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/14/2017",
        "dateOfIncident": "06/24/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005226,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-150",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TO BEGIN WITH I HAD TO HAVE ALL 4 WINDOWS REPAIRED. THE MECHANISM THAT RAISES AND LOWERS THE WINDOWS BROKE. SINCE THIS WAS BOUGHT AS A USED VEHICLE, THERE WAS NO WARRANTY. SO I PD. $150. TO $175.00 EACH. WAS TOLD FORD KNEW OF THIS PROBLEM BUT SINCE IT WASN'T A \"SAFETY FACTOR\" NO RECALL WAS ISSUED. I FEEL LIKE THIS IS QUITE UNFAIR TO THE CONSUMER. WE PURCHASE A VEHICLE THAT HAS A GOOD REPUTATION AND THEN ARE TOLD THAT THIS EXPENSE IS OUR BABY TO TAKE CARE OF. I FEEL LIKE THIS WAS VERY  UNFAIR TO THIS CONSUMER. I HAVE PURCHASED FORDS FOR YEARS WITH NO COMPLAINTS UNTIL NOW.  ALSO, THE HEADLIGHTS DEVELOPED A LEAK AND FILLED WITH WATER THUS SHORTING OUT MY RIGHT HEADLIGHT,AND IS SLOWLY DOING THE SAME TO THE LEFT ONE. I HAVE BEEN TOLD THAT JUST THE BURNED OUT BULBS CANNOT BE REPLACED,THAT THE WHOLE ASSEMBLY HAD TO BE REPLACED AND THIS IS AT A COST OF APPROX. $175 TO $200. PER ASSEMBLY. THIS IS OUTRAGEOUS. ALSO,THERE IS A PROBLEM WITH WHAT USED TO BE \"POINTS & PLUGS\" WHICH ARE NOW A \"COIL\" ASSEMBLY. THIS PROBLEM DEVELOPED APPROX. 6 MONTHS AGO. ACCORDING TO THE READOUTS I HAVE GOTTEN, THE #1 PLUG IS MISFIRING APPROX. EVERY 1,000 REVOLUTIONS WHICH CAUSES A MISS IN THE ENGINE AND WAS VERY ALARMING TO ME SINCE I WAS ON THE HIGHWAY ABOUT 200-250 MILES FROM HOME, TRAVELING BY MYSELF. SO, ANOTHER EXPENSE IS LOOMING. I REALIZE THERE ARE EXPENSES TO OWNING A VEHICLE. I DO NOT EXPECT TO NOT HAVE ANY PROBLEMS OR REPAIRS WITH MY VEHICLE,BUT I DID NOT ANTICIPATE THIS MANY. NOR DID I EXPECT THE COST OF THE REPAIR PARTS ALONE TO BE SO OUTRAGEOUS. I AM ON A FIXED INCOME AND HAD I ANTICIPATED THESE PROBLEMS I WOULDN'T & #8203; HAVE MADE THIS PURCHASE. I TRULY LOVE MY TRUCK, BUT IS THERE ANYWAY THESE OTHER REPAIRS CAN BE DONE FOR A LESSER AMT?  I'VE ALREADY PD. TO REPLACE MOTOR & ROTORS IN ALL 4 WINDOWS. ANY HELP YOU CAN GIVE ME WOULD BE GREATLY APPRECIATED. THANK YOU. [XXX]    ('PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).')*JB",
        "vin": "1FTRW12W34K"
    }
]