[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/03/2017",
        "dateOfIncident": "06/20/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002800,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION'S FINAL DRIVEN GEAR HAS GONE OUT ON ME TWICE IN THE LAST YEAR. AS THE ATTACHED IMAGE OF ANOTHER PERSON'S GEAR SHOWS, TWO TEETH SOMEHOW SHEER OFF, AND WREAK HAVOC ON THE TRANSMISSION BEARINGS AND TRANSMISSION CASING IF NOT RECOGNIZED AND TURNED OFF IMMEDIATELY. BEING A MANUAL TRANSMISSION, I HAVE ALWAYS BEEN CONFIDENT THAT THE TRANSMISSION'S LIFE WOULD BE MUCH LONGER SINCE THE CLUTCH TAKES MOST OF THE WEAR-AND-TEAR OF SHIFTING GEARS.   WITH MULTIPLE DISCUSSION FORUMS FROM OTHER CONSUMERS OUTLINING THE ISSUE AT HAND (INCLUDING THIS ONE: (HTTP://WWW.TSXCLUB.COM/FORUMS/1ST-GEN-PROBLEMS-FIXES/105177-KNOCKING-NOISE-ONLY-WHEN-POWER-WHEELS.HTML ), THE FACT THAT THE PART NUMBER HAS CHANGED SINCE THE CAR WAS MANUFACTURED, AND KNOWING THAT THE NUMBER OF VEHICLES EFFECTED RELATIVELY LOW LEAD ME TO BELIEVE THAT THIS IS A MANUFACTURING DEFECT THAT ACURA DECIDED TO IGNORE RATHER THAN RECALL.   THE FIRST TIME I WASN'T ABLE TO REBUILD THE TRANSMISSION, WHICH ENDED UP COSTING ME OVER $3,000 IN ORDER TO BUY A USED TRANSMISSION AND INSTALL IT, AND THIS SECOND TIME, IT HAS COST ME $1,850 TO REBUILD IT. I NOTICED THE PROBLEM WHILE DRIVING ON THE HIGHWAY BOTH TIMES IT BROKE DOWN ON ME. THE ISSUE IS EASILY RECOGNIZED AS A TICKING SOUND THAT OCCURS EVERY TIME THE WHEEL/AXLE MAKES A FULL TURN. IT WILL GET PROGRESSIVELY LOUDER OVER THE SUBSEQUENT 30 MINUTES OR MORE UNTIL THE CAR IS BASICALLY CLUNKING DOWN THE HIGHWAY. MY CAR HAD APPROXIMATELY 116,000 MILES ON IT THE FIRST TIME, AND THE SECOND TRANSMISSION HAD ABOUT 135,000 WHEN IT BROKE DOWN. THOUGH THE MILEAGE CAN BE POINTED AS BEING 'TOO HIGH', IT IS WELL-KNOWN THAT ACURA AND HONDA ARE LONG-LIVING VEHICLES, INCLUDING THE TRANSMISSION, AND SHOULD NOT HAVE SUCH AN ISSUE AS THIS UNLESS THE CAR WAS BEING RACED AND ABUSED.    IN SUM, THIS IS CERTAINLY A SAFETY ISSUE FOR ANYONE TRAVELING LONG DISTANCES AND SHOULD BE RECALLED.",
        "vin": "JH4CL95865C"
    }
]