[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/10/2017",
        "dateOfIncident": "03/06/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004176,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED A SOUND COMING FROM THE FRONT END OF MY 2016 TOYOTA COROLLA LE. I INITIALLY TOOK IT IN TO SEE WHERE THE SOUND WAS STEMMING FROM THE MECHANIC AT TOYOTA STATED THAT THE SOUND WAS NORMAL AND NO NEED TO HAVE CONCERN ABOUT THE NOISE IT WAS NORMAL WITHIN THESE MODELS OF COROLLAS. I LET THE DEALERSHIP WITH RELIEF BUT AS I DROVE BACK THE NOISE WAS LOUDER ,  SO I TOOK THE VEHICLE BACK IN TO THE SAME SHOP LUTHER BROOKDALE TOYOTA WHERE THE MECHANIC STATED THE SOUND WAS NORMAL BUT THIS TIME THE MECHANIC SUGGESTED THAT THEY REPLACE THE STRUTS AND ALONG WITH THE STRUT MOUNTS. HE STATED THIS WOULD ALLEVIATE THE PROBLEM AND THE SOUND WOULD GO AWAY BECAUSE HE AGREED THAT THE FRONT END SUSPENSION WAS INDEED FAULTY (HENCE). THAT'S WHY HE REPLACED THE STRUTS ALONG WITH THE MOUNTS. UPON REPLACING THE PART OF THE SUSPENSION  THE SOUND PERSISTED.  NOW BROOKDALE WHERE I WENT INITIALLY STATED THEY WHERE NO LONGER ABLE TO HELP ME WITH THE ISSUES KEEP IN MY THE CAR IS UNDER WARRANTY, SO I WENT  TO WALSER TOYOTA  WHERE THEY KEPT MY VEHICLE FOR OVER A WEEK TRYING TO REPAIR AND GET RID OF THE SOUND MY VEHICLE  WAS MAKING  AFTER THAT WEEK I WAS TOLD THEY CALLED A TOYOTA  SPECIALIST OVER THE PHONE PLUS AFTER A WEEK I WAS TOLD THE SOUND WAS NORMAL  NO FURTHER WORK NEEDED TO BE DONE I INQUIRED  IF THE REP FROM TOYOTA HEARD THE SOUND OVER THE PHONE WHILE DRIVING  MY VEHICLE  THE TECH AT WALSER TOYOTA STATED YES HE HEARD THE SOUND OVER THE PHONE I WAS SHOCKED HOW CAN YOU DEEM A SOUND NORMAL VIA TELEPHONE , NOT HAPPY WITH THIS I THEN TOOK MY VEHICLE TO FIRESTONE REPAIR SHOP WHERE THEY RECOMMENDED I HAVE MY FRONT REPLACED I HAVE A PRINT OUT OF THE RECOMMENDATIONS AT THIS POINT I FEEL MY SAFETY OF ME AND MY FAMILY IS AT STAKE.",
        "vin": "2T1BURHE7GC"
    }
]