[
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/25/2018",
        "dateOfIncident": "12/07/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064915,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 1500",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING VEHICLE AT ANY SPEED IT STEERS TO THE LEFT OR RIGHT . NOT A SIMPLE ALIGNMENT PULL OR WANDER I CAN FEEL THE WHEEL AS TO WHICH WAY IT WANTS TO STEER AT RANDOM. IF NOT PAYING ATTENTION OR IF YOU WERE TO LET GO OF THE STEERING WHEEL IT WILL GO OFF THE ROAD ABSOLUTLY NOT SAFE TO DRIVE. WHILE ACCELERATING THE VEHICLE FEELS LIKE THE BRAKES ARE BEING APPLIED AND DOES NOT ACCELERATE I HAVE TO GIVE EXCESSIVE GAS PETAL THROTTLE TO GET UP TO SPEED. THERE HAVE BEEN TIMES I HAVE CAME HOME FROM AS SHORT DRIVE AND I CAN SMELL THE BRAKES THEY SMELL BURNT HOT. ONE INSTANCE I WAS MERGING ONTO THE HIGHWAY AND THE TRUCK STRUGGLED TO GET UP TO 60MPH I HAD THE PETAL FLOORED AND THE TRUCK WOULD NOT GO OVER 65MPH THE ENGINE WAS @ 5000RPM MAXED OUT IT WOULD NOT SHIFT NOR GO FASTER THAN 65MPH. RANDOMLY TRANSMISSION THUNKS THUD AND SLAMS INTO GEARS WHEN THE AUTOMATIC TRANSMISSION IS SHIFTING AT LOW SPEED BELOW 50. WHILE DRIVING TRUCK FEELS LIKE THE DRIVE TRAN IS BOUND UP LIKE BRAKE IS APPLIED ON INDIVIDUAL WHEEL(S) . I HAVE HAD NOTHING BUT PROBLEMS WITH THIS TRUCK VERY WEIRD ISSUES THAT DON'T MAKE MECHANICAL SENSE. ALSO THE INSTRUMENT CLUSTER GAUGES AND INFOTAINMENT SCREEN DON'T LIGHT UP JUST BLACK SCREENS AFTER STARTING VEHICLE. HAPPENED 2 TIMES NOW. RADIO WAS OFF WHILE DRIVING THEN CAME ON FULL VOLUME WITHOUT TOUCHING ANYTHING. SERVICE STABILITY /STEERING WARNING CAME ON ONCE.I CAN HEAR FRONT TRANSFER CASE ENGAGE AND DISENGAGE AT LOW SPEEDS RANDOMLY WHEN IN 2WD. RANDOMLY STUCK IN LOW GEAR WHEN ACCELERATING FROM A STOP. AND YOU DON'T HAVE TO USE THE BRAKES MUCH TO STOP YOU BECAUSE AS SOON AS YOU LET OFF GAS PETAL THE VEHICLE NEARLY COMES TO A STOP WITHOUT APPLYING BRAKES. AND IF YOU ARE TURNING IT WILL AT TIMES COME TO A COMPLETE STOP. HAS BEEN TO DEALER 6 TIMES NOW THEY SAY EVERYTHING CHECKS OUT. THERE IS A MAJOR COMPUTER ISSUE OR IS HACKED PER ALL IVE RESEARCHED.",
        "vin": "3GTU2NEC4JG"
    }
]