[
    {
        "components": "STEERING,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/05/2019",
        "dateOfIncident": "10/18/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165415,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "ON OCTOBER 18, 2018 I RECEIVED THE POWER STEERING ASSIST FAILURE ERROR ON MY INSTRUMENT PANEL WHEN TURNING ON MY VEHICLE. I HAD DRIVEN IT EARLIER IN THE DAY WITHOUT ISSUE. PREVIOUSLY I HAD THE OCCASIONAL WARNING NOISE AND QUICK FLASH OF AN ERROR (TOO QUICK FOR ME TO READ ALL THE WAY) AND WOULD HAVE MOMENTARY DIFFICULTY TURNING. THIS ISSUE MAKES IT ALMOST IMPOSSIBLE TO STEER THE VEHICLE. RESEARCH INDICATES THAT IT IS MOST LIKELY A MALFUNCTIONING TORQUE SENSOR. I REACHED OUT TO FORD AFTER LEARNING OF RECALLS FOR THE 2009 MODEL YEAR. I WAS INFORMED THAT MY VIN WAS NOT INCLUDED IN THE RECALL. FORD WAS UNWILLING TO ASSIST WITH THE COST OF REPAIRS IN ANY WAY. THEIR SUGGESTION WAS TO KEEP THE RECEIPT ON THE SLIM CHANCE THAT THE RECALL WOULD BE EXPANDED. THIS IS UNACCEPTABLE. HAD I BEEN ON A HIGHWAY WHEN THIS OCCURRED IT COULD HAVE BEEN FATAL TO MYSELF OR OTHERS. THIS REPAIR WILL COST IN THE NEIGHBORHOOD OF $1000 OR MORE. I WILL NEED TO HAVE THE WORK DONE AT A DEALERSHIP TO ENSURE THE REPAIR IS DONE CORRECTLY AND THAT FORD WON'T GIVE ME REIMBURSEMENT ISSUES SHOULD THE RECALL BE EXPANDED.     THIS OCCURRED LESS THAN A YEAR AFTER THE FUEL INLET VALVE FAILED ON THE VEHICLE, CAUSING IT TO SHUT DOWN WHILE DRIVING AND RENDERING IT UNABLE TO BE STARTED.     THE REAR HATCH HAS NOT BEEN ABLE TO BE OPENED FOR OVER THREE YEARS BECAUSE OF AN ISSUE WITH THE LATCH.    I HAVE HAD ISSUES WITH THE CLIMATE CONTROL SYSTEM AND WELL. THERE WERE ISSUES WITH AIR CONDITIONING WHEN I PURCHASED THE VEHICLE (APRIL 2015). THE ISSUES WERE NOT APPARENT PREVIOUS TO PURCHASE BECAUSE OF THE WEATHER AT THE TIME. WITHIN A MONTH THE WEATHER WARMED UP. WHEN I ATTEMPTED TO USE THE A/C IT WAS ONLY BLOWING HOT AIR. THE DEALERSHIP WAS WILLING TO FIX THE ISSUE FREE OF CHARGE BECAUSE OF THE CIRCUMSTANCES. HOWEVER, THE ISSUE IS OCCURRING AGAIN EVEN AFTER HAVING AN A/C RECHARGE PERFORMED.",
        "vin": "4M2CU91789K"
    }
]