[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/26/2017",
        "dateOfIncident": "11/28/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001325,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR'S ENGINE WOULD STOP FOR NO REASON AND NOT RESTART AT STOP SIGNS AND WHILE DRIVING.  THE POWER STEERING AND POWER BRAKES WOULD GO OUT WHEN THIS WOULD HAPPEN WHICH WAS ESPECIALLY DANGEROUS WHEN DRIVING.  IT WAS TAKEN TO THE DEALERSHIP FOR REPAIRS ON AT LEAST 4 OCCASIONS AND NEVER FIXED.  IT IS AGAIN LISTED ON THE DEALERSHIP SITE FOR SALE AFTER I TOOK A $3,000 LOSS TRADING IT IN FOR ANOTHER VEHICLE.  I WAS TOLD BY THE MANAGER THAT THE CAR WOULD NOT BE SOLD AGAIN, BUT IT IS ON THE PRE-AUCTION LOT OF THE DEALERSHIP FOR SALE AT NEARLY THE AMOUNT I PAID FOR THE VEHICLE IN NOVEMBER 2016.  IT WAS DRIVEN ABOUT 2,000 MILES IN THE 6 MONTHS I OWNED IT BECAUSE MOST OF THE TIME IT WAS BROKEN DOWN.  IT SAT IN THE DEALERSHIP LOT FOR THE LAST 2 MONTHS BECAUSE I WAS TOLD THAT THERE WAS \"NOTHING WRONG WITH YOUR CAR.\"  I TRADED IT IN RATHER THAN HAVE AN ACCIDENT WHERE EITHER MYSELF OR SOMEONE ELSE MAY BE HURT OR KILLED DUE TO THE LACK OF ABILITY TO CONTROL THE CAR WHEN THE ENGINE SHUT DOWN.  THE CAR FAX FOR THIS VEHICLE CAN BE SEEN ON LINE WITH SOME OF THE REPAIRS THAT WERE COMPLETED DURING THE TIME I OWNED IT.  THE REPAIRS WERE FOR VARIOUS SENSORS; ONE OF THEM WAS REPLACED MORE THAN ONCE.  I WAS INSTRUCTED TO BY ONE OF THE SERVICE MANAGERS TO HAVE THE CAR \"TOTALED\" BY THE INSURANCE COMPANY BECAUSE THEY WOULDN'T BE ABLE TO FIGURE OUT WHAT WAS WRONG WITH THE CAR UNLESS IT STOPPED RUNNING WHILE THEY WERE WORKING ON IT.  I HAD A VIDEO OF THE ENGINE STOPPING WHICH SHOWED THAT THERE WAS NO WARNING.  I MADE IT BECAUSE I WAS BEING ASKED WHAT LIGHTS CAME ON, ETC., BEFORE IT SHUT DOWN.  THE VIDEO WAS SHOWN TO THE SERVICE MANAGER, BUT IT WAS USELESS AS THE CAR ENGINE AGAIN STOPPED FOR NO REASON.  IT FIRST BROKE DOWN THREE DAYS AFTER I HAD PURCHASED THE CAR, BUT BEYOND THE \"NO QUESTIONS ASKED\" RETURN POLICY OF HAVING LESS THAN 150 MILES ON THE CAR DUE TO MY HAVING DRIVEN IT OVER 200 MILES.",
        "vin": "1G4HD57228U"
    }
]