[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/18/2017",
        "dateOfIncident": "02/08/2017",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006229,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A KNOWN DEFECT IN SEVERAL VOLVO CAR MODELS SINCE 2008. THERE IS CURRENTLY A CLASS ACTION LAWSUIT IN PLACE DUE TO THIS DEFECT. THE DEFECT INVOLVES THE VOLVO XM/SIRIUS RADIO SYSTEM INSTALLED IN MANY VOLVO MODELS AND RESULTING BATTERY DRAIN, BATTERY REPLACEMENT COSTS, VOLVO FIRMWARE UPGRADE COSTS AND THE ADDITIONAL INABILITY TO PASS CALIFORNIA SMOG TESTS. THE PROBLEM: WHEN AN AFFECTED VOLVO VEHICLE DOES NOT HAVE AN ACTIVE SUBSCRIPTION TO XM/SIRIUS RADIO, THE INTEGRATED VOLVO RADIO SYSTEM CONTINUALLY AND CONSTANTLY CHECKS FOR XM/SIRIUS ACCOUNT REACTIVATION, EVEN WHEN THE VEHICLE IS TURNED OFF. THIS CONSTANT ELECTRONIC SEARCHING DRAINS A NEW AND FULLY CHARGED BATTERY WITHIN TWO TO THREE DAYS. THIS HAS LEFT MANY VEHICLE OWNERS STRANDED AND HAS COST OWNERS THOUSANDS IN UNNECESSARY REPAIRS, BATTERY REPLACEMENTS AND TOWING CHARGES. (THIS FREQUENTLY OCCURS TO VOLVO OWNERS LEAVING THEIR VEHICLES AT AIRPORT PARKING FOR A FEW DAYS.) VOLVO HAS BEEN SLOW TO ACKNOWLEDGE THE PROBLEM AND HAS BEEN CHARGING CAR OWNERS FOR BATTERY REPLACEMENTS AND FIRMWARE UPGRADES. FURTHERMORE, WHEN THE BATTERY DIES, IT RESETS THE COMPUTER SYSTEMS INCLUDING THE OBDII WHICH IS REQUIRED FOR SMOG TEST READINESS. THE ONEROUS DRIVE CYCLE REQUIRED TO GET THE OBDII SYSTEM INTO READINESS STATE PREVENTS USERS FROM BEING ABLE TO COMPLETE SMOG CERTIFICATIONS IN CALIFORNIA. VOLVO DEALERS WANT TO CHARGE $500 TO COMPLETE THIS SMOG TEST READINESS DRIVE CYCLE, EVEN THOUGH THERE IS NOTHING ELSE WRONG WITH THE VEHICLE EXCEPT FOR THE MANUFACTURER'S DEFECTIVE AND BATTERY DRAINING XM/SIRIUS SYSTEM AND THE ONEROUS DRIVE CYCLE THAT IS NEARLY IMPOSSIBLE TO COMPLETE ON SOUTHERN CALIFORNIA ROADS & HIGHWAYS. (OUR MECHANIC, MY WIFE AND I HAVE ALL TRIED TO COMPLETE THE DRIVE CYCLE AND HAVE BEEN UNSUCCESSFUL.) THIS IS CLEARLY A DEFECT IN DESIGN AND USABILITY WHICH VOLVO SHOULD BE REPAIRING WITHOUT COST TO THE CAR OWNER.",
        "vin": "YV4952CY2B1"
    }
]