[
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/19/2022",
        "dateOfIncident": "06/18/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448115,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I bought my 2018 Subaru Forester in may of 2020 it is now January of 2022 and I have replaced the entire windshield THREE TIMES. If requested, my vehicle can be inspected. It is clear that this windshield is too fragile and poses a safety risk for myself and those passengers that enter my vehicle. It is also costing me a lot of money to repair multiple windshields and causing my insurance to go up for something out of my control. I can only imagine what would happen if I were ever to get into an accident with the windshield being that fragile. I am not a dangerous driver nor have I ever been in an accident, I have a clean record. A class action lawsuit filed in 2017 stating that  “The cracks were allegedly due to the deicer creating a condition that makes the glass susceptible to cracking after a minor strike to the glass, such as the stone's impact“ it also stated that the lawsuit included 2.5 million Subaru models between the years of 2017-2020.  “[XXX], represented by Attorneys [XXX] Law Group, Moon Law APC, and [XXX], contends the Subaru models have \"defective and dangerous\" windshields that are prone to \"cracking, chipping and otherwise breaking.\"” After the first windshield crack in June of 2020 (1 month after I purchased the vehicle) I called my authorized Subaru dealership and asked if there was a common problem or known safety issue with the windshields, I was told there was not and my issue was singular.   This is a SEVERE safety concern. A minor crack went through both panes of the windshield and rapidly become in my line of vision.   I feel as though this is an unfair and unjust safety concern that is costing Subaru drivers like myself their safety and money.   INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "JF2SJAJC1JH"
    }
]