[
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/09/2017",
        "dateOfIncident": "07/09/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003905,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "RAM 2500",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "2009 DODGE RAM 2500 HAS WHAT IS DESCRIBED BY MANY AS \"DEATH WOBBLE\". AT FREEWAY SPEEDS (70MPH HERE IN MI) IF SOME EVEN MINOR BUMPS, POT HOLES ARE RUN OVER THE FRONT END OF THE TRUCK STARTS TO SHAKE UNCONTROLLABLY. TO GET CONTROL OF THE VEHICLE AGAIN YOU MUST SLOW TO BELOW 55MPH. MANY TIMES JUST THE DRIVERS SIDE FRONT TIRE AS BOUNCING OR WOBBLING, RECENTLY THE ENTIRE FRONT END. VEHICLE HAS HAD BOTH PRIOR RECALLS FOR TIE-ROD ENDS COMPLETED. HAD FRONT SHOCKS CHANGED IN CASE THEY WERE THE ISSUE NO CHANGE, HAD TIRES CHANGED IN CASE THERE WAS AN ISSUE WITH ANY OF THE TIRES, NO CHANGE. HAD BELLE TIRE TECHS LOOK FOR ISSUE WITH BOUNCING/WOBBLING TIRES THEY SAID EVERYTHING WAS TIGHT AND IN WORKING ORDER. ALSO HAS ANOTHER GARAGE LOOK AT IT FOR THE SAME ISSUE THEY DID NOT FIND ANY ISSUES. THIS PROBLEM THAT LOOKS TO BE PRETTY WIDESPREAD WITH OWNERS OF 2009 RAM 2500S MAKES THIS VEHICLE UNSAFE AT HIGHWAY SPEEDS UNTIL A FIX IS FOUND. I WILL ASK DEALER ABOUT BOUNCING/WOBBLING FRONT END AGAIN BUT IF THIS IS ON MANY OF THESE TRUCKS THE PROBLEM WILL END UP RESULTING IN ACCIDENTS SHOULD A DRIVER NOT BE ABLE TO SLOW DOWN QUICKLY TO REGAIN CONTROL OF THE STEERING. THIS PROBLEM HAS BEEN HAPPENING FOR OVER A YEAR ON AND OFF, I HAD AVOIDED DRIVING ON THE FREEWAY UNTIL THE LAST REPAIRS WHERE THE TIRES WERE CHANGED AND THE TECHS SAID EVERYTHING WAS GOOD WITH THE FRONT END. FIRST TIME ON THE FREEWAY AT 70MPH IT HAPPENED AGAIN WHEN A FEW SMALL BUMPS WERE RUN OVER, THE ENTIRE CAB OF THE TRUCK WAS SHAKING, OTHER DRIVERS BEHIND AND AROUND ME SLOWED AS I AM GUESSING THEY THOUGHT I WAS GOING TO LOOSE CONTROL AND CRASH. I HAD TO SLOW BELOW 50MPH BEFORE THE SHAKING WAS UNDER CONTROL AND BECAUSE THE OTHER DRIVERS SLOWED IT ALLOWED ME TO GET TO THE RIGHT AND AVOID AN ACCIDENT. SO I WILL NO LONGER USE THE TRUCK AT ANYTHING OVER 45MPH AND ONLY USE SPARINGLY UNTIL THE ISSUE IS IDENTIFIED AND REPAIRED.",
        "vin": "3D7KS28T19G"
    }
]