[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/05/2018",
        "dateOfIncident": "01/05/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11060815,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "A FEW MONTHS BACK I TOOK MY 2014 NISSAN ALTIMA, 4-CYLINDER TO THE NISSAN DEALERSHIP FOR A RECALL THAT WAS IN CONNECTION WITH RECALL WITH THE SOFTWARE OF THE TRANSMISSION OF SOME SORT.  I DID NOT RECEIVE NOTICE BUT WAS ADVISED OF THIS RECALL WHEN I TOOK MY VEHICLE TO NISAAN TO GET SERVICES FOR AN OIL CHANGE.  THE RECALL WAS COMPLETED.  SINCE HAVING THE RECALL COMPLETE MY VEHICLE HAS BEEN HAVING TRANSMISSION ISSUES. AT TIMES I AM DRIVING ON THE FREEWAY AND THE CAR SHUDDERS AND LOSES POWER.  I HAVE COME CLOSE TWICE TO AN AUTO COLLISION AS I AM SHIFTING LANES MY CAR COMPLETELY LOSES POWER AND DROPS SPEED WITHOUT MY CONTROL WITH HE RPM DROPPING DRASTICALLY BUT REGAINING WITHIN SECONDS.  THE CAR JERKS AND SHUDDERS.  I HAVE HAD ANOTHER FAMILY TEST AS WELL AND HAS SAID THAT THE CAR IS UNSAFE AND SOMETHING IS WRONG.  I RESEARCHED AND SEE A MULTITUDE OF COMPLAINTS IDENTICAL TO MINE TO THIS PARTICULAR YEAR AND MODEL.  I AM TAKING TO THE DEALER TO HAVE DIAGNOSTIC COMPLETE AND HAVE EXPLAINED THAT MY VEHICLE WAS FINE PRIOR TO THE SOFTWARE ADJUSTMENT WITH THE TRANSMISSION.  I HAVE BEEN TOLD THAT THEY ARE NOT SURE IF THIS IS THE ISSUES AND POSSIBLY I WILL GET STUCK WITH PAYING WHATEVER REPAIRS.  THIS IS COMPLETELY UNFAIR TO THE CONSUMER HAVING TO PAY OUT OF POCKET FOR A TRANSMISSION DEFECT THAT THOUSANDS OF NISSAN OWNERS ARE HAVING THE ISSUES AND NOTHING SEEMS TO BE DONE TO REMEDY THIS UNSAFE VEHICLE.  I WOULD LIKE INVESTIGATION TO BE DONE ON THIS AND IN THE EVENT THAT WHILE I AM DRIVING THIS VEHICLE AND THIS OCCURS CAUSING AN ACCIDENT I WILL HOLD THE MANUFACTURER AT FAULT FOR ALLOWING THIS VEHICLE TO GO UN-REPAIRED FOR A FAULTY TRANSMISSION THAT THOUSANDS OF CONSUMERS ARE COMPLAINING ABOUT AS BEING A \"LEMON OF A CAR\" AND \"UNSAFE.\" THE DATE THIS ISSUE LAST OCCURRED WITH ME DRIVING MY VEHICLE WAS AROUND 8:30A.M. ON JANUARY 5, 2018.",
        "vin": "1N4AL3AP7EC"
    }
]