[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/05/2017",
        "dateOfIncident": "03/01/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003125,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY CAR IN MAY 2011 AND WITHIN A FEW MONTHS, I NOTICED THE OIL BURNING FASTER THAN USUAL YET THERE WERE NO LEAKS. THIS WAS MY SECOND CAMRY WHICH MY FIRST I OWNED FOR 12 YEARS (ALSO OWNED A SCION SO 3RD TOYOTA CAR PURCHASED) AND NO ISSUES SO I KNEW THIS WAS NOT NORMAL. I WOULD TAKE MY CAR IN FOR INSPECTION AND THEY COULDN'T FIND ANY LEAKS AND TOLD ME IT WAS NORMAL. FINALLY AFTER YEARS OF HAVING TO GET CONSTANT OIL CHANGES AND PURCHASING EXTRA GALLONS OF OIL TO REFILL EVERY 1K MILES OR LESS, I GOT A LETTER FROM TOYOTA ON MARCH 2016 AND AFTER TAKING IT IN FOR THE OIL CONSUMPTION TEST, MY CAR FAILED MISERABLY AND IT WAS ADDED TO THE LIST. MY CAR WAS FIXED ON JANUARY 2017 AND WAS TOLD I WOULD GET REIMBURSED FOR THE OIL THAT I HAD TO ADD BECAUSE OF THE DEFECT. I SUBMITTED ALL RECEIPTS AND DOCUMENTATION THAT THEY REQUESTED ON MARCH 2017 AND THEY GAVE ME THE RUNAROUND FOR MONTHS. ALTHOUGH EVERY SINGLE PIECE OF PROOF WAS SUBMITTED, THEY WOULD DENY THE REQUESTS. I KEPT CALLING AND SPEAKING TO DIFFERENT REPS, FAXED/EMAILED DOCUMENTS AS WELL AS SENT LETTERS THROUGH CERTIFIED MAIL. FINALLY ON JULY 1, 2017, THEY DECIDED TO ONLY PAY $500 WHEN THE TOTAL OUT OF POCKET EXPENSES SINCE 2012 WAS $1,558.08. THEIR REASONING WAS THAT THEY WERE ONLY PAYING FOR ANY EXTRA OIL USED BETWEEN MARCH 2016 UNTIL JANUARY 2017. THIS IS NOT OK BECAUSE I STARTED HAVING ISSUES IN 2012 AND THE ISSUE WAS FOUND IN 2011 YET THEY DIDN'T NOTIFY ME UNTIL MARCH 2016. THEY SHOULD HAVE HONORED WHAT THEIR ORIGINAL LETTER STATED WHICH WAS BASED ON WHEN MY CAR STARTED HAVING ISSUES. I SUBMITTED PROOF OF RECEIPTS AS WELL AS INVOICES FROM GOODYEAR OF WHEN THIS STARTED. THEY DID NOT HONOR THEIR AGREEMENT AS THEY SHOULD HAVE. I AM VERY DISAPPOINTED AND THEY HAVE LOST A LOYAL TOYOTA CUSTOMER.",
        "vin": "4T4BE46K89R"
    }
]