[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/10/2017",
        "dateOfIncident": "06/21/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004143,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BODY CONTROL MODULE FAILED. AFTER ONLY 4 YEARS AND 53K MILES ON THE ROAD THE BCM SIMPLY STOPPED WORKING.     THE CAR WAS NOT SHOWING ANY OF THE SIGNS OF A FAILING BCM (ELECTRICAL GLITCHES, ENGINE ISSUES, ETC.). AS FAR AS I KNEW, UNTIL THE COMPONENT FAILED THE CAR WAS IN PERFECT CONDITION.     THE CAR WAS PARKED OUTSIDE MY OFFICE WHEN THE PART FAILED. WHEN I MADE MY 20 MINUTE COMMUTE TO WORK AROUND 7:30AM IT OPERATED FINE. WHEN I RETURNED TO THE VEHICLE AROUND 5PM THE KEY FOB WOULD NOT WORK, THE INSTRUMENTATION PANEL WOULD NOT LIGHT UP AND THE ENGINE WOULD NOT TURN OVER. I TRIED JUMPING THE BATTERY MULTIPLE TIMES WITH NO IMPROVEMENT. THE CAR WAS COMPLETELY DEAD. WE HAD TO MANUALLY OVERRIDE THE BRAKES JUST TO GET THE CAR LOADED ONTO A TOW TRUCK.     MECHANICS SPENT MORE THAN 4 HOURS LOOKING OVER THE VEHICLE TO DETERMINE THE SOURCE OF THE ISSUE. AFTER MULTIPLE TESTS THEY DETERMINED THAT THE TCM WAS WORKING FINE (FORD ISSUED A CSP FOR TCMS ON THIS BUILD) AND THAT THE BCM FAILED. THEY TOLD ME THAT TYPICALLY A BCM WILL FAIL IF THERE IS AN ACCIDENT, WATER DAMAGE OR A SHORT, BUT THEY ALSO CONFIRMED THAT THIS VEHICLE SHOWED NO SIGNS THE FAILURE WAS CAUSED BY THESE PROBLEMS. THEY ALSO TOLD ME THAT THE PART CAN FAIL WITH AGE, HOWEVER, THIS IS A NEWER MODEL YEAR WITH RELATIVELY LOW MILEAGE.    WHILE I WAS FORTUNATE THAT MY CAR FAILED WHEN THE CAR WAS PARKED, I WORRY THAT OTHER DRIVERS MAY NOT BE SO LUCKY. IT SOUNDS LIKE THIS PART COULD FAIL WHILE THE VEHICLE IS IN MOTION, AND IF IT DOES, CAN CAUSE ENGINE PROBLEMS AND RESULT IN SUDDEN DANGEROUS DRIVING CONDITIONS. THIS IS EVEN MORE CONCERNING KNOWING THAT THERE ARE OTHER VEHICLES OUT THERE WITH THIS VERSION OF BCM AND THAT THEY CAN FAIL PREMATURELY TOO.",
        "vin": "1FADP3F26DL"
    }
]