[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/05/2017",
        "dateOfIncident": "12/23/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003039,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "2009 VOLKSWAGEN JETTA WOLFSBURG 2.0TSI TIMING CHAIN TENSIONER FAILURE.  AT 109K MILES THE CAR WOULD NOT START IN THE AM TO GO TO WORK.  THIS HAPPENED ON 12/23/16.  HAD CAR TOWED TO DEALER AND RECEIVED PHONE CALL FROM SERVICE DEPARTMENT THAT THE TIMING CHAIN TENSIONER HAD FAILED.  THE ENGINE WILL NEED BETWEEN $3600 AND $5500 TO REPLACE THE ENGINE COMPONENTS.  I WAS TOLD BY THE SERVICE TECH TO CALL VW CUSTOMER CARE BECAUSE THIS IS A KNOWN ISSUE AND THEY MAY HELP WITH THE REPAIRS.  VW TOLD ME THEY KNEW NOTHING ABOUT THIS PROBLEM.  GOT A SECOND OPINION FROM A MECHANIC THAT WAS PREVIOUSLY EMPLOYED BY VW AND HE VERIFIED THE DIAGNOSIS.  THE CAR IS STILL SITTING IN MY DRIVEWAY WITHOUT BEING REPAIRED.  I HAVE SINCE FOUND THAT THIS IS A VERY LARGE ISSUE THAT GOES BACK TO THE 2008 MODEL YEAR.  THERE ARE SEVERAL CLASS ACTION LAWSUITS PERTAINING TO THIS ISSUE.  ONE CASE FILED IN NEW JERSEY IN MAY 2016 HAS JUST HAD ANOTHER HEARING ON MAY 9TH 2017 WHERE THE SUPREME COURT OF NJ HAS AGREED TO LET THE CASE GO FORWARD STATING THERE IS ENOUGH EVIDENCE SHOWING VW AT FAULT.  I HAVE DOCUMENTATION FROM THE DEALER AND CAN PROVIDE THAT ONCE I AM BACK AT MY HOME.  ANY HELP THE MANY CONSUMERS THAT OWN VW AND AUDI VEHICLES WITH THE 2.0TSI ENGINE FROM 2008-2013 CAN GET WOULD BE GREATLY APPRECIATED.  RESEARCHING VW 2.0TSI TIMING TENSIONER ON THE INTERNET WILL BRING UP THE HUNDREDS, IF NOT MORE, OF THE PEOPLE THAT HAVE PAID UPWARDS OF $10K TO HAVE ENGINES REPAIRED ON CARS THAT HAVE AS LITTLE AS 30K MILES ON THEM.  THE VW SERVICE MANUAL DOES NOT MENTION THE TIMING CHAIN TENSIONER NEEDING SERVICE AT A PARTICULAR MILEAGE.",
        "vin": "3VWRA71K99M"
    }
]