[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/14/2017",
        "dateOfIncident": "05/17/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005420,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "(TOYOTA CASE # [XXX]) - ON 7/14/2017, I PHONED THE TOYOTA PHONE NUMBER LISTED ON THE ATTACHED DOCUMENT, INDICATING THAT MY VEHICLE HAD A \"SAFETY RECALL\" BEGINNING 2009, REQUIRING THE \"SOUND INSULATOR SSC (17T0C90C)\" TO BE REPLACED (SEE ATTACHED LETTER -TO FOLLOW). ALTHOUGH THEY CLAIMED TO HAVE REPLACED IT \"ON 4-8-2009, ORDER # 0913552\", I DON'T RECALL THIS TO BE TRUE BECAUSE I DO NOT RECALL EVER RECEIVING ANY MAIL REGARDING THIS ISSUE. I REQUESTED REPRESENTATIVE [XXX], TO PROVIDE ME WITH SUCH DOCUMENTATION.    SHE THEN SAID THAT THE RECALL TIME PERIOD ENDED AND THAT I HAD ONLY 6-12 MONTHS TO TELL THEM THAT THIS REPLACEMENT WAS DEFECTIVE. AS PER THE DOCUMENTATION, THE DRIVER WOULD NOT BE ABLE TO DETECT THIS UNLESS CHECKED BY THE SERVICE DEPT.  IT WAS DETERMINED ON 5-17-2017 TO BE DEFECTIVE, NEEDING REPLACEMENT WHEN I BROUGHT MY CAR TO THE DEALERSHIP FOR A PERIODIC OIL CHANGE (SEE ATTACHED DOCUMENT - TO FOLLOW). I ASKED [XXX] TO HAVE HER SUPERVISOR REVIEW OUR TAPED CONVERSATION AND CONTACT ME WITH THE APPROPRIATE REPLACEMENT.  IT APPEARS THAT EVEN IF THEY CAN SUBSTANTIATE THAT THEY REPLACED IT BACK IN 2009, MY CONTENTION THAT IT IS ILLEGAL FOR THEM TO POSE AN ARBITRARY 6-12 MONTH CUT OFF PERIOD FOR A REPLACEMENT AT NO CHARGE TO THE OWNER.  AS OF THIS WRITING, I DID NOT GET A CALL BACK OR EVEN AN E-MAIL RESPONSE FROM TOYOTA.   PLEASE INTERVENE ON MY BEHALF BECAUSE A \"SAFETY RECALL\" ISSUE MUST BE ADHERED TO BY LAW AND IF THE ONE PUT IN AS A REPLACEMENT (LIKE THE TAKATA AIRBAG RECALL), THEN TOYOTA IS LIABLE AND RESPONSIBLE TO REPLACE THAT DEFECTIVE ONE TOO.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "JTDJT903775"
    }
]