[
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/02/2021",
        "dateOfIncident": "02/19/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398615,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASH CRACKED ON PASSENGER SIDE 80 K.THIS VEHICLE IS VERY WELL-MAINTAINED IT LOOKS LIKE IT ROLLED OFF THE SHOWROOM FLOOR. TAKATA AIRBAG RECALL WHAT A JOKE. SO YOU RECALL THE VEHICLE BUT YOU DON'T HAVE THE PARTS TO FIX IT. THE VEHICLE HAS A DEFECT IN THE FUEL SYSTEM, I STARTED NOTICING IT WHEN I WOULD FILL UP WITH FUEL. IT HAS TO BUILD THE PRESSURE UP BEFORE IT'LL START. MANY MECHANICS TOLD ME THIS IS A DEFECT. KAT FRIDAY NIGHT I RAN AN ERRAND. PULLED IN THE DRIVEWAY EXITED THE VEHICLE HIT THE KEY FOB TO LOCK THE VEHICLE. I GO OUT THE NEXT MORNING AND I CAN SMELL BURNT WIRES. THE WINDOW/POWER LOCKS/MIRRORS MODULE ON DRIVERS SIDE DOOR CAUGHT ON FIRE. LUCKILY IT SHORTED OUT THE MODULE, BUT IT BURNT UP AND MELTED ONE OF THE CONNECTORS. THIS JUST HAPPENED SO I HAVE NOT HAD TIME TO FIGURE THE CAUSE. BURNS 2 QUARTS OF OIL BETWEEN OIL CHANGES. GENERAL MOTORS THREW ME UNDER THE BUS IN 1988 ON A BRAND NEW PICK UP TRUCK WITH THE DEXCOOL ANTIFREEZE THAT ATE EVERY GASKET OUT OF THE ENGINE AND THEY REFUSED TO REPLACE IT I REPLACED IT AT MY COST WITH NO HELP FROM GENERAL MOTORS. ENOUGH IS ENOUGH THESE PEOPLE NEED TO TAKE CARE OF ALL THESE PROBLEMS THEY GOT TOP DOLLAR FOR THESE VEHICLES. ALL OF THESE OCCURRED WHEN THE VEHICLE WAS SITTING STILL. THE DOOR HANDLE ON PASSENGER SIDE DOOR HAVE CUT SEVERAL PEOPLE. IT'S LIKE A RAZOR. A BRAND NEW VEHICLE HAS HAD A PIECE OF TAPE WRAPPED AROUND THE DOOR HANDLE HOW EMBARRASSING.",
        "vin": "1GNFC13007R"
    }
]