[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/19/2017",
        "dateOfIncident": "06/16/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000028,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BEGINNING IN EARLY MAY, MY VEHICLE WOULD LOSE ALL POWER AND GO INTO \"LIMP\" MODE WHILE DRIVING.  THE \"WRENCH\" WARNING LIGHT APPEARED AND I PULLED OVER INTO THE NEAREST PARKING LOT. THE OWNER'S MANUAL INDICATE IT WAS A POWERTRAIN PROBLEM AND NEEDED TO BE TAKEN TO A DEALERSHIP.  WHEN I STARTED THE VEHICLE, THE LIGHT WAS NO LONGER ON AND IT RAN NORMALLY.  A FEW DAYS LATER, SAME PROBLEM.  THIS HAPPENED ABOUT 50% OF THE TIME I WOULD DRIVE IT.  DRIVING, LOSE POWER, WRENCH LIGHT APPEARS, PULL OVER, TURN OFF CAR, RESTART, ALL NORMAL.  IT WAS EXTREMELY FRUSTRATING AND AT TIMES SCARY WHEN THIS WOULD OCCUR AT HIGHWAY SPEEDS.  WHEN TAKING THE VEHICLE TO THE DEALER, THEY COULD NOT PULL CODES BECAUSE THE WRENCH LIGHT WAS NOT ACTIVELY ON AT THE TIME I WOULD GET THERE.  FINALLY, ONE MORNING, LIGHT COMES ON, POWER IS LOST AND I ALTER MY PLANS FOR THE DAY TO DRIVE STRAIGHT TO THE REPAIR SHOP, LEAVE THE CAR RUN AND DEMAND THAT THEY PULL THE CODES RIGHT THEN AND THERE BECAUSE IF I TURNED IT OFF, IT WOULD RESET AND I'D BE STUCK DRIVING IT AGAIN UNTIL THE CYCLE REPEATED ITSELF.  THEY WERE ABLE TO PULL 5 CODES AND I ENDED UP PAYING $822.08 FOR A THROTTLE BODY W/SENSOR, THROTTLE BODY GASKET, AND PEDAL.  OF COURSE, AT 40,000 MILES, NOTHING IS COVERED UNDER WARRANTY ANY LONGER.  THE MOST FRUSTRATING PART OF THIS IS SEARCHING ONLINE AND DISCOVERING THAT THIS IS AN EXTREMELY COMMON PROBLEM FOR FORD OWNERS SINCE 2011.  AT ONE TIME, FORD EVEN AVOIDED A RECALL TO CORRECT THE PROBLEM, BY OFFERING AN EXTENDED WARRANTY TO THOSE CUSTOMERS WHO HAD YET TO HAVE THEIR THROTTLE BODY FAIL.  IT IS CLEAR THAT FORD MERELY WANTED TO AVOID THE BAD PUBLICITY OF A RECALL BY THIS ACTION.  FORD HAS NOT CORRECTED THE PROBLEM, THOUSANDS OF PEOPLE STILL HAVE TO BEAR THE COST OF THESE REPAIRS.  THIS IS A SAFETY AND CONSUMER PROTECTION ISSUE.  MAKE FORD RECALL THIS PART AND PROTECT CONSUMERS!",
        "vin": "2FMHK6DT3EB"
    }
]