[
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/26/2017",
        "dateOfIncident": "06/22/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001477,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE WAS IN MOTION ON A CITY STREET WHEN IT COMPLETELY SHUT DOWN WITHOUT WARNING.  THE ENGINE STALLED AND THERE WAS NO POWER TO THE VEHICLE WHATSOEVER.  I WAS UNABLE TO STEER, BRAKE, PUT THE CAR IN NEUTRAL, ROLL DOWN WINDOWS, UNLOCK DOORS, OR HAVE MY HAZARD LIGHTS ON.  I WAS BLOCKING TRAFFIC AND HAD NO WAY TO SIGNAL TO OTHER DRIVERS THAT MY VEHICLE WAS STALLED IN THE MIDDLE OF THE ROAD.  AFTER HAVING IT TOWED TO THE DEALER, I WAS TOLD THE ALTERNATOR SHORTED OUT, WHICH IN TURN FRIED THE BATTERY AND POWERTRAIN MODULE.  THE DEALER AGREED TO PAY TO REPLACE THE POWERTRAIN MODULE AT NO COST TO ME BUT THE REMAINING REPAIRS COST ME $1300.  UPON DOING SOME RESEARCH I DISCOVERED THAT AS OF OCTOBER 2014 MORE THAN 435,000 VEHICLES WERE EFFECTED BY AN ALTERNATOR RECALL, INCLUDING CARS THE SAME MAKE, MODEL, AND YEAR AS MY OWN. I FOUND OTHER COMPLAINTS ONLINE OF OWNERS OF THE SAME TYPE OF CAR WHO EXPERIENCED A SIMILAR BREAKDOWN WHILE DRIVING AND THEY WERE TOLD THAT THE REPAIRS WOULD NOT BE COVERED.  I CALLED CHRYSLER'S CUSTOMER SERVICE LINE AND THEY INVESTIGATED THE ISSUE BUT REFUSED TO PAY FOR THE WORK.  HAVING A CAR STOP DRIVING WITHOUT WARNING WHILE IN TRAFFIC IS EXTREMELY DANGEROUS.  KNOWING THERE ARE OTHER VEHICLES OUT THERE EXPERIENCING THE SAME ISSUE INDICATES TO ME THAT THE ALTERNATOR RECALL SHOULD BE EXTENDED TO INCLUDE ADDITIONAL CARS.  I WOULD LIKE TO BE REIMBURSED FOR MY EXPENSES AND TO BE SURE THAT OTHER DRIVERS DO NOT EXPERIENCE THIS DANGEROUS SITUATION THAT COULD EASILY RESULT IN A VERY SERIOUS CAR CRASH.",
        "vin": "1D4RE4GG4BC"
    }
]