[
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/16/2017",
        "dateOfIncident": "07/16/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005582,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-150",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD F150 4X4 XLT, DASH BOARD KEEPS GOING OUT. SHOWS SKIDDING, AND TIRE SENSOR FAULTY, DINGGING, A/C GOES HOT, INSIDE LIGHTS DON'T WORK. HAS HAPPENED MANY TIMES, SPOKE WITH FORD TOOK IT IN, THEY STATED THEY COULD NOT DUPLICATE THE PROBLEM, WHICH WE HAVE FOUND OUT IS A LIE. THEY STATED WE NEEDED A NEW BATTERY, WHICH WE HAD TESTED AS WELL AS THE ALTERNATOR AND NOTHING WRONG THERE EITHER. WE TOOK IT TO ADVANCED AUTO TO SEE WHAT THEY COULD TELL US. A YOUNG MAN SAID THAT FORD HAD PUT OUT A INSIDE NOTICE THAT HIS BUDDY SHOWED HIM OF A FAULTY WIRING HARNESS IN THE DASH. HE ASKED IF HE COULD SHOW US A SHORT TERM FIX...HE SMACKED THE DASH AND ALL THE LIGHTS CAME BACK ON. IF WE HIT A BUMP IT WILL DO IT AGAIN, OR ON REALLY HOT DAYS, BECAUSE OF THE HEAT. WE ARE WAITING ON FORD TO RECALL THIS AS IT IS A SERIOUS HAZARD AND MAYBE START FIRES. AS SOMETIMES YOU SMELL ELECTRICAL, THIS HAPPENS DAILY WHEN EVER WE DRIVE THE TRUCK, YOU CAN HAVE A WRECK TRYING TO SMACK IT HARD ENOUGH TO GET IT TO COME BACK ON. THIS HAPPENS WHEN YOU ARE SITTING IN THE TRUCK , DRIVING, OR WHEN YOU GO TO START IT UP...YOU WILL HAVE NO GAUGES, LIGHTS A/C OR HEAT IN THE WINTER. YET THE OUTSIDE LIGHTS WILL WORK, YET WHEN YOU PUSH THE BRAKES YOU HEAR A LOUD CLICKING. THIS HAS BEEN HAPPENING FOR APPROX. 2.5 YRS +...FORD NEEDS TO RECALL AND FIX THIS. EVERYDAY WE DEAL WITH THIS PROBLEMS MULTIPLE TIMES A DAY. WE BROUGHT THIS TRUCK NEW AND IT FIRST DID THIS AROUND 23,000 MILES. NOW AT JUST OVER 50,000 MILES. THERE ARE TIMES THAT SMACKING THE DASH DOES NOTWORK AND WE HAVE TO WAIT FOR IT TO COME ON, THOSE TIME YOU HAVE TO RUN WITH TRAFFIC OR IF OTHERS ARE PASSING YOU NEED TO SPEED UP. VERY DANGEROUS",
        "vin": "1FTFW1EV8AF"
    }
]