[
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/23/2017",
        "dateOfIncident": "05/03/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000853,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FAULTY ECU COMPUTERS CAUSEING VARIATIONS IN SPEED AND PROBLEMS WITH HARD SHIFTING, DAMAGEING TRANSMISSONS, CAUSEING VEHICLES TO FAIL WHILE DRIVING WHILE IN MOTION VEHICLE WILL NOT SHIFT CORRECTLY. MY VEHICLE STOPPED IN AN INTERSECTION AND I WAS NEARLY HIT BY ANOTHER VEHICLE WHILE ATTEMPTING TO ACCELERATE THE VEHICLE WOULD NOT SHIFT INTO GEAR WHILE TURNING LEFT. I FELT I COULD HAVE BEEN KILLED BY ON COMMING TRAFFIC WITH NO ABILITY TO CONTROL MY VEHICLE. TOYOTA DEALER AND MECHANIC TOLD ME THIS IS A WELL KNOW DEFECT AND PROBLEM KNOW TO TOYOTA WITH RAV 4 2001-2003. ALSO, 02 SESSORS GO BAD EARLY LEADING TO HAZARDOUS EMISSIONS TO PUBLIC AND THIS BURNS OUT CATALITIC CONVERTERS WHICH CAN ALSO CAUSE HARMFUL EMISSIONS. RAV 4 2001 TO 2003 HAVE BEEN IDENTIFIED AS HAVING FAULTY ECU'S, AUTO TRANSMISSIONS AND 02 SENSOR DEFICITS AND SHOULD BE RECALLED BY TOYOTA TO PROTECT THE PUBLIC FROM ACCIDENTS RELATED TO POOR SHIFTING, UNSAFE SPEED CONTROL AND HARMFUL EMISSIONS TO THE PUBLIC. I NOTIFIED TOYOTA AND THEY SAID THEY WOULD DO NOTHING BECAUSE THEY OFFERED AN EXTENDED WARNETY BUT THAT EXPIRED AFTER 10 YEARS AND THEY NEVER NOTIFIED ME OF ANY PROBLEMS TO LOOK OUT FOR WITH THE TRANSMISSION. I FEEL THESE VEHICLES MAY BE A DANGER TO THE PUBLIC DUE TO BUILT IN ENGINEERING DEFECTS THAT AFFECT SPEED CONTROL AND EMISSIONS. THEY ALSO LEAD TO VERY COSTLY REPAIRS FOR THE CUSTOMERS.",
        "vin": "JTEHH20VX20"
    }
]