[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/27/2018",
        "dateOfIncident": "06/18/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104215,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY 2010 CADILLAC SRX IN FOR AN INSPECTION TO RENRW MY REGISRTATION AND WAS TOLD THAT BE CAUSE OF THE ENGINE LIGHT BEING ON IT WAS AN AUTOMATIC FAIL. I WAS SURPRISED BECAUSE I HAD PREVIOUSLY TAKEN IT THE DEALERSHIP THAT HAD GIVEN ME THIS LINE, ALTHOUGH YOUR ENGINE LIGHT IS ON, THERE IS NOTHING WRONG WITH YOUR VEHICLE, ITS PROBALLY JUST A LOSE WIRE, NEVERMIND THAT HE NEVER TOLD ME IF IT COMES BACK ON I WOULD NOT PASS IN SPECTION. SO WHEN I TAKE IT BACK TO THE DEALER,  I GET A WHOLE OTHER STORY FROM WHAT   THE MECHANIC, HE TOLD ME, WITH OUT TELLING ME HE COULD NOT TOUCH BECAUSE IT WAS A DEFECTIVE MANUFACTURED FLAW. THE WIRING TO THE E-VAP SYSTEM IS EXPOSED TO THE ENVIORNMENT. NHTSA, PLEASE HELP ME FIGURE OUT WHAT IS GOING ON WITH THIS VEHICLE, I REALLY FEEL UNSAFE AND BELIEVE THAT IT IS ONLY BY THE GRACE OF GOD THAT I HAVE NOT BEEN HARMED BYTHHIS VEHICLE OT HARMED OTHERS. ONLY NOW IT IS AT THE DEALERSHIP, WAITING FOR ME TO SIGN OFF ON $3000, 00 WORTH OF REPAIRS, OF WHICH 75% HAS NOTHING TO DO WITH THE ENGINE LIGHT BEING ON.  OH, BEFORE I FORGET I WAS TOLD BY THE DEALERSHIP THEY ONLY KNEW OF A COUPLE OF RECALLS ON MY VEHICLE, ONE HAD TO DO WITH THE TIGHTENING OF THE TORQUE, BUT I WENT ONLINE AND I FOUND OVER A DOZEN RECALLS FOR MY VIN. PLEASE NHTSA, I HOPE YOU HAVE SOME GOOD NEWS FOR ME, BECAUSE I FEEL LIKE A STATISTIC WAITING TO HAPPEN, BUT THIS IS THE THING EVERYONE KNEW ABOUT THE POTENTIAL FOR ALARM, BUT NO ONE WOULD SAY ANYTHING, EVEN WHEN ASKED. ATTN: PLS. CARE",
        "vin": "3GYFNAEY8A5"
    }
]