[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/23/2017",
        "dateOfIncident": "03/15/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000764,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "ONE DAY ME AND MY WIFE WERE DRIVING AROUND THE CITY RUNNING SOME ERRANDS WHEN I NOTICED A SOUND COMING FROM THE ENGINE AREA. SO I ADMEDIATLY HEADED HOME. WHEN I ARRIVED I OPENED THE HOOD OF MY 2012 KIA SPORTAGE TO HEAR A KNOCKING SOUND. AFTER CONFIRMING THE SOUND WAS MY ENGINE I CALL KIA TELLING THEM WHAT WAS GOING ON, THEY MADE ME A APPOINTMENT DATE AND TOLD ME TO CALL MY EXTENDED WARRANTY COMPANY TO NOTIFY THEM OF THE SITUATION AND GET AUTHORIZATION TO DO AN INSPECTION. SO I DID AND THEY TOLD ME TO TAKE IT IN WHILE THEY INVESTIGATE. AS A COUPLE DAYS PASSED I TOOK MY CAR IN AN IMMEDIATELY THEY KNEW WHAT THE PROBLEM WAS AND GUARANTEED ME KIA WOULD HANDLE THE PROBLEM. AS THREE WEEKS WENT BYE I CALLED THE WARRANTY COMPANY TO SEE WHAT WAS TAKING SO LONG AND THEY BEGAN TO SAY THAT THE REASON FOR THE PROBLEM WAS MY FAULT DUE TO LACK OF MAINTENANCE AND IF I WANTED THE ENGINE FIXED IT WOULD COST $8000. I REFUSED REPAIRS AND WENT TO RECOVER MY VEHICLE. AS I DROVE AWAY IN MY VEHICLE I NOTICED THEY GAVE IT BACK MAKING A LOUDER KNOCKING. AS I PROCEEDED TO GO HOME MY CAR SUDDENLY STALLED IN THE MIDDLE OF THE STREET WITH TRAFFIC BEHIND ME. THE CAR WOULD NOT TURN ON ANYMORE. I PUSHED IT TO THE SIDE OF THE ROAD WERE I HAD TO CALL FOR A TOW TRUCK TO TAKE IT HOME WERE MY VEHICLE HAS BEEN FOR THE LAST   TWO MONTHS.. KIA AND THE EXTENDED WARRANTY COMPANY STILL REFUSING TO DO ANY REPAIRS WITHOUT ME PAYING $8000 FOR A NEW ENGINE.",
        "vin": "KNDPB3A22C7"
    }
]