[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/03/2017",
        "dateOfIncident": "07/02/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002748,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA DENALI",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY GMC 2015 DIESEL DURIMAX TRUCK HAD THE ENGINE LIGHT TURN ON AND SAID EMISSION NEEDS SERVICED. IT PROCEEDED TO CUT MY TRAVELING SPEED FROM 75 MPH TO 65 MPH TO 55 MPH. I MADE IT TO DENVER COLORADO BARELY WITHOUT THE TRUCK FALLING TO 4 MPH. I WENT YESTERDAY TO HAVE IT SERVICED. THEY SAID THAT THEY FIXED IT STILL UNDER POWERTRAIN WARRANTY. I DROVE AWAY TO GO BACK TO TEXAS 700 MILES OF HIGHWAY HOME. I DROVE AND THE EXACT SAME PROBLEM HAPPENED AGAIN.   I'M WAS ON A HIGHWAY AT THIS POINT WITH HEAVY HIGHSPEED TRAFFIC IN THE MIDDLE OF NOWHERE WHERE THE SPEED LIMIT IS 75 MPH. MY TRUCK SPEED WAS REDUCED BY THE EMISSION SYSTEM AGAIN FROM 75 MPH TO 65 MPH TO 55 MPH. I WAS ALMOST HIT BY A BIG RIG TRUCK WITH MY WIFE IN THE CAR. SOMETIME LATER WERE ALMOST SIDE SWIPED TWICE, AND THEN IT STARTED RAINING AND THE SUN STARTED TO SET, AND MATTERS WENT FROM DANGEROUS TO NEAR DEADLY. WE TRIED TO TURN THE TRUCK AROUND TO GET BACK TO DENVER AND ALMOST WERE HIT AGAIN BECAUSE WITH THE GMC SPEED REDUCTION I COULD NOT ACCELERATE AWAY FROM THE HIGH SPEED CARS COMING AT US.   GMC SHUTDOWNS THE CAR SPEED PURPOSELY TO AVOID SOME TINY AMOUNT OF NOX, AND PUT PEOPLE AT RISK OF BEING KILLED ON A HIGHWAY IN RAINY NIGHTIME WEATHER. WE FINALLY MADE IT BACK TO DENVER JUST 19 MILES BEFORE THE TRUCK SPEED WOULD HAVE BEEN REDUCED TO 4 MPH.   WE WOULD HAVE TO BEEN ON THAT 75 MPH HIGHWAY RIDING IN THE RIGHT SIDE OF THE SLOW LANE AT 4 MPH !!!!! AT NIGHT IN THE RAIN WITH HIGH SPEED 18 WHEELERS GOING BY AT 75 TO 85 MPH.   THE GOVERNMENT AND GMC ARE INSANE TO HAVE DESIGNED THIS,    I AM BRINGING IT  TOMORROW TO GET TRY TO GET IT FIXED AGAIN  BUT THE ORDEAL I WENT THRU IS STILL SCARY AS HELL, AND WORRIED ABOUT IT GETTING FIXED. WE COULD BE KILLED DUE TO THIS.   I AM AN ENGINEER DEALING WITH PUBLIC SAFETY, AND I AM IN SHOCK CONCERNING GMC'S AND THE GOVERNMENT OVER STEP IN THIS DESIGN.   [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": ""
    }
]