[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/28/2017",
        "dateOfIncident": "05/01/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001920,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "CC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INFORMED THAT MY VEHICLE WAS RECALLED, VEHICLES IN THE STATES WITH HIGH TEMPERATURES WOULD RECEIVE PRIORITY TREATMENT.  I WAS INFORMED THAT PARTS WERE NOT AVAILABLE.I WAS INFORMED THAT VW WAS NOT ATTEMPTING TO PURSUE THESE RECALLS AS THEY HAD NOT EXPERIENCED ANY FAULTY VW MISHAPS WITH TAKATA AIRBAGS. THEY SAID THAT HONDAS AND OTHER  AUTOMOBILES THAT WERE EXPERIENCING THESE INCIDENTS. NO RENTAL WAS MADE AVAILABLE UPON REQUEST THOUGH THEY DID SAY THAT MAY HAPPEN BUT IT WASN'T SET UP AS OF THEN..  AS A LEASEE I INFORMED THE LOCAL DEALER WHERE I PURCHASE MY VW THAT I WOULD LIKE TO TURN IN MY CAR EARLY (IT WAS DUE IN MAY) AND THAT THE CAR WAS IN MINT CONDITION AND UNDER MILEAGE. I GAVE MY REASONS TO THE GENERAL MANAGER, THE SERVICE DEPARTMENT AND I HAD MADE SEVERAL CALLS TO NHTSA. ALL WERE IN AGREEMENT THAT I LIVED IN A STATE WHERE PRIORITY SHOULD BE GIVEN. HOWEVER, THE ATTITUDE FROM VW WAS THAT THEY FELT NO URGENCY TO PUSH THROUGH FOR THESE RECALLS AS THEY WERE NOT LIABLE. YET. MY SAFETY WAS NOT AN ISSUE WITH VW. I AM NOW LOOKING AT A BILL FOR EARLY TURN-IN FOR $821.82 THIS INCLUDED A TINY CORNER ON A TINY WING WINDOW( THAT DOES NOT OPEN) WHERE THEIR FACTORY INSTALLED SOLAR FILM WAS INSTALLED AND STARTING TO LIFT AT ONE OF THE EDGES. I NEVER SAW THIS AND THEY NEVER SHOWED ME AT TURN IN.  LASTLY, THEY INFORMED ME AT THE LOCAL AUCTION THE CAR WOULD LIKELY SELL AND THAT WAS THAT. HANDED THE KEYS OVER, NO PAPERWORK TO SIGN AND OUT THE DOOR WE WENT. MY HUSBAND AND I WERE STUNNED AT THE LACK OF CUSTOMER SERVICE THAT THIS DEALERSHIP DISPLAYED NOT ONLY WITH REGARD TO THE RECALL BUT TO THE HANDLING OF THEIR CUSTOMERS DURING SERVICE AND THE MANY PHONE CALLS I HAVE RECEIVED SINCE ASKING IF I WANT TO PURCHASE ANOTHER VEHICLE WHEN MY LEASE IS UP. NOT TOO MUCH COMMUNICATION GOING ON THERE AS ITS BEEN THREE MONTHS SINCE I NO LONGER HAVE A VW. NOR WILL I EVER AGAIN.",
        "vin": "WVWBN7AN4DE"
    }
]