[
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/24/2019",
        "dateOfIncident": "10/19/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270915,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVETRAIN MALFUNCTION LIGHT CAME ON STATING TO DRIVE MODERATELY.  MAXIMUM DRIVETRAIN OUTPUT NOT AVAILABLE. CONSULT SERVICE CENTER.  THE CODES WAS CDA904 NO MESSAGE (STATUS TRAILER 0X2E4) RECEIVER ENGINE ECU TRANSMITTER TRAILER.  130F20 EXHAUST CAMSHAFT OFFSET ANGEL TO CRANKSHAFT OUTSIDE TOLERANCE; 120408 BOOST PRESSURE CONTROL, CUT OFF PRESSURE RISE BLOCK     AFTER PAYING $180.00 FOR DIAGNOSTIC I WAS TOLD TODAY THAT I NEED TO  REPLACE THE TIMING CHAIN/ GUILD.  REPLACE OIL PUMP CHAIN MODULE AND REPLACE THE VALVE COVER.  THE TIMING CHAIN GUIDE IS BROKEN.  THIS IS CRAZY MY CAR HAS 88000 MILES AND IS NOT PAID FOR.  THE COST TO GET THIS REPAIRED IS APPROXMIATELY $6,000.  THERE IS A CURRENT CLASS ACTION LAWSUIT. BMW KNOWS THAT THIS IS A PROBLEM BUT REFUSES TO DO A RECALL. THE PLAINTIFFS TAKE ISSUE WITH TWO SPECIFIC DEFECTS IN THE ENGINE'S CHAINS. THE FIRST DEFECT AFFECTS THE PRIMARY CHAIN, ALSO KNOWN AS THE TIMING CHAIN, WHICH COORDINATES THE ACTION OF THE CRANKSHAFT, CAMSHAFTS, AND CYLINDER VALVES.    ACCORDING TO THE PLAINTIFFS, THE PLASTIC GUIDE ASSEMBLY FOR THE PRIMARY CHAIN IS MADE OF A DEFECTIVE POLYCARBONATE MATERIAL THAT BECOMES BRITTLE AND BREAKS APART, CREATING DEBRIS THAT LODGES IN THE CRANKSHAFT DRIVE SPROCKETS. THE DEBRIS CAN CAUSE THE PRIMARY CHAIN TO SKIP, LETTING THE CAMSHAFTS AND CRANKSHAFT FALL OUT OF SYNC AND POSSIBLY DAMAGING OR DESTROYING THE ENGINE.    THE SECOND DEFECT AFFECTS THE SECONDARY CHAIN, WHICH CONNECTS THE OIL PUMP AND BALANCE SHAFT ASSEMBLY TO THE CRANKSHAFT. THE MATERIALS IN THIS ASSEMBLY CAN'T STAND UP TO HIGH-RESISTANCE WEAR, THE PLAINTIFFS SAY. THIS DEFECT CAUSES THE CHAIN TO ELONGATE PREMATURELY, SLIP, AND DAMAGE THE CHAIN SPROCKET.  *JS",
        "vin": "WBA3B5C57DF"
    }
]