[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/06/2021",
        "dateOfIncident": "08/04/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428115,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving alone at night a on dark two lane highway, both low beam headlights went out at the same time leaving me in the frightful and dangerous situation of not being able to see where I was headed. I was however able to safely stop on the side of the road and do some troubleshooting.  All the other lights (high beam, turn, parking, fog, etc.) worked perfectly.  The instrument panel showed that the low beams were still on.  No warning of any type of malfunction was indicated or shown. I have not contacted KIA about the problem yet, but I am sure they are aware of the problem. I have read multiple blogs online and this appears to be a common problem, and has been for a long time, with multiple KIA models and generations.    My suspicions are the problem may be in either the multi-position switch, airbag clock spring, or cable harness, or any combination of the three.  It is my understanding the fuses and relays for the lights are side related ( all either on LH or RH).  I checked fuses and relays even though I find it hard to believe both sides would go bad at the same time, and all were good.  There is a long history of this electrical problem in these vehicles that needs to be found and fixed before someone needlessly loses their life.  Who knows, maybe someone has already been killed.  Lights go out, they go off the road and hit a tree.  The instruments would show the headlights are on, but they were not.  Now its hard to prove with the head lights totally destroyed.",
        "vin": "5XYKWDA70EG"
    }
]