[
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/15/2017",
        "dateOfIncident": "11/13/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11046415,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 08/16/2016 I PURCHASED A MOTOR VEHICLE FROM STAR NISSAN LOCATED AT 5757 W. TOUHY AVE., NILES, IL 60714 (2013 NISSAN PATHFINDER SUV VIN).     ON OCTOBER OF 2016 I WAS DRIVING IN THE EXPRESS WAY GOING 60MPH AND MY VEHICLE SUDDENLY STOPPED ACCELERATING AND CAME TO A COMPLETE STOP WHILE I HAD OTHER VEHICLE PASSING ME BY AT 60+ MPH. I HAD TO PULL TO THE SIDE TO AVOID GETTING HIT IN THE REAR. THE VEHICLE FINALLY TOOK OFF BUT NOT WITHOUT JERKING AND RATTLING NOISES. I IMMEDIATELY CAME OFF THE EXPRESS WAY.  I TOOK THE VEHICLE TO STAR NISSAN AND THEY ADMITTED MY CAR ON 10/22/2016. I WAS CONTACTED BY NISSAN AND WAS TOLD THAT THEY REPLICATED THE PROBLEM AND THE CVT WOULD NEED TO BE CHANGED AND EVERYTHING SHOULD BE FINE. THE CHANGES WERE MADE AND ON 10/28/2016 I RECEIVED THE VEHICLE BACK. MY VEHICLE HAS BEEN BACK TO THE DEALER ON 11/12/2016, 11/16/2016, 04/22/2017, 07/12/2017 7/28/2017 WITH THE SAME SYMPTOMS AND THE PROBLEM HAS NEVER BEEN RECTIFIED. ON 07/01/2017 MY VEHICLE WAS DRIVEN BY A NISSAN SERVICE TECHNICIAN FOR 237 MILES IN ORDER TO REPLICATE THE PROBLEM AGAIN. THEY WERE SUCCESSFUL BUT NOW STATED THAT THE PROBLEM WAS A RELAY LIGHT. THEY GAVE ME THE VEHICLE BACK ON 07/06/2017. MY VEHICLE WAS ADMITTED AGAIN ON 07/25/2017 WITH THE SAME PROBLEMS. THE TECHNICIAN HAD TO DRIVE MY VEHICLE 344 MILES TO REPLICATE THE SYMPTOMS ONCE AGAIN.  HOWEVER MY VEHICLE WAS ADMITTED UNTIL 08/17/2017. THE NISSAN CONSUMER AFFAIRS OFFICE SENT OUT AN ENGINEER WHO MADE RECOMMENDATIONS. THE RECOMMENDATION WAS TO REMOVE BRAKE LIGHT RELAY AND REPLACE BRAKE SWITCH. I WAS GIVEN THE VEHICLE BACK AND THE PROBLEMS HAS PERSIST. ON 11/13/2017 MY CAR JERKED AND CAME TO A STOP IN THE MIDDLE OF A BUSY INTERSECTION THIS HAS BEEN A NIGHTMARE AND I HAVE ALMOST BEEN A PART OF AN ACCIDENT ON SEVERAL OCCASION DUE TO THIS PROBLEM. I AM NOW CAR-LESS BECAUSE THIS VEHICLE IS NOT SAFE TO DRIVE.",
        "vin": "5N1AR2MM8DC"
    }
]