[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/11/2017",
        "dateOfIncident": "06/10/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004659,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-150",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SATURDAY JUNE 10, 2017 I WAS OUT OF TOWN WITH FAMILY IN CARY, NC. WE WERE LEAVING THE HOTEL PARKING LOT THAT MORNING AND WHEN I STARTED THE TRUCK AND PUT TRUCK IN REVERSE THE BRAKES DID NOT WORK..  AFTER LOOKING, I SAW THERE WAS NO BRAKE FLUID. THERE WAS NO BRAKE FLUID ON THE GROUND SO I DIDN'T KNOW WHAT THE ISSUE COULD BE. I GOT MORE BRAKE FLUID THEN DROVE TO A MECHANIC.  BY THE TIME I GOT TO THE MECHANIC (1 MILE DOWN THE ROAD) THE BRAKE FLUID WAS GONE AGAIN.  AFTER THE MECHANIC LOOKED AT ISSUE, IT WAS DETERMINED THAT THE BRAKE BOOSTER FAILED.  THEY FOUND THAT THERE WERE NO PARTS AND IT TOOK UNTIL TUESDAY JUNE 13, 2017 TO GET PART AND REPAIR. THINKING THERE MUST BE AN ISSUE SINCE NO PARTS WERE AVAILABLE.  I FOUND THAT 126 COMPLAINTS WERE REGISTERED REGARDING THE BRAKE BOOSTER ON 2013 FORD F150'S.  AFTER CALLING FORD IT WAS DETERMINED THAT MY 2013 FORD F150 WAS NOT ON THE LIST.  MY FORD F150 HAD THE EXACT SAME MAJOR ISSUE THAT THE FORD F150'S THAT WERE RECALLED.  THIS IS VERY DISTURBING THAT THE BRAKES WENT OUT, ESPECIALLY AFTER WE HAD JUST DROVE THROUGH THE WEST VIRGINIA MOUNTAINS. I HAVE TALKED TO FORD MULTIPLE TIMES AND THEY ARE NOT WILLING TO DO ANYTHING ABOUT THIS ISSUE. ONLY UNTIL THE PART IS PUT ON THE RECALL LIST FOR MY VIN# WILL FORD DO SOMETHING. I HAVE BEEN TOLD TO KEEP MY RECEIPTS JUST IN CASE IT IS PUT ON THE RECALL LIST. I FIND THIS VERY UPSETTING THAT THE EXACT SAME PART HAD BEEN RECALLED ON OTHER 2013 FORD F150, BUT MY VIN# WAS NOT ON THE LIST.  I HAD THE EXACT SAME ISSUE AND THIS COULD HAVE BEEN A VERY BAD PROBLEM IF THIS HAPPENED IN THE MOUNTAINS THAT WE HAD DRIVING THROUGH. I HAVE THE PART THAT FAILED AND ALL RECEIPTS. I HOPE THAT THIS COMPLAINT GETS NOTICED AND SOMETHING IS DONE.  THANK YOU",
        "vin": "1FTFW1ET1DF"
    }
]