[
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/04/2017",
        "dateOfIncident": "07/03/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002926,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN VEHICLE OPERATES IN MOUNTAINOUS HIGHWAYS REQUIRING 3000-3500 RPM FOR CONTINUOUS LONG GRADE, OR A SERIES OF SMALLER GRADES WHICH HEAT THE TRANSMISSION.  THE COMPUTER IS AUTOMATICALLY PROGRAMED TO SHUT DOWN THE VEHICLE . THIS OCCURS  WITHOUT REGARDS TRAFFIC, ROAD CONDITIONS OR SAFETY.     WE BOUGHT THE VEHICLE LAST YEAR AND HAVE RECORDED 55 SEPARATE OCCASIONS OF  SUCH OPERATING HAZARDS. THIS ACTIVITY LEAVES THE STRANDED VEHICLE AT THE EDGE OF THE ROADWAY FOR PROLONGED PERIODS OF TIME AS TRAFFIC FLIES BY AT EXCESS OF 65 MPH  OR HIGHER. THE STRANDED VEHICLE REPRESENTS A HAZARD TO BOTH THE OCCUPANTS OF THE  VEHICLE AS WELL AS THE VEHICLES IN TRANSIT NEARBY.    THESE STOPS FOR THE VEHICLE CAN BE AS LONG AS THIRTY MINUTES FOR COOL DOWN. THE DANGERS POSED BY THIS ACTIVITY ARE GREATLY ENHANCED WHEN THIS OCCURS AT NIGHT.  TRAFFIC STOPPED WITH LIGHTS  AT ROADS EDGE ARE OFTEN CONFUSED WITH A MOVING VEHICLE AND DRIVERS PLOW INTO THE REAR OF THE STRANDED VEHICLE UNKNOWING IT IS AT  A DEAD STOP.    THESE COMPUTER GENERATED STOPS ARE INHERENTLY DANGEROUS.  THE MANUFACTURER IS AWARE AN UNABLE TO MAKE THE DRIVE LINE MODIFICATIONS THAT  WOULD ELIMINATE THE DANGERS POSED BY THIS DEFECT IN ENGINEERING. IT IS HARD TO BELIEVE THAT THIS PROBLEM WAS NOT MADE AWARE TO THE MANUFACTURER IN TESTING TRIALS OF THESE PARTICULAR VEHICLES. PLEASE HELP US WITH THIS LEMON!!!",
        "vin": "1C4NJRBB7ED"
    }
]