[
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL,TRACTION CONTROL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/14/2017",
        "dateOfIncident": "07/14/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005385,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "MALIBU",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2009 CHEVROLET MALIBU. WHILE DRIVING 60 MPH, THE CONTACT FELT AN ABNORMALITY WHILE STEERING THE VEHICLE. THE CONTACT PULLED THE VEHICLE OVER TO THE SIDE OF THE ROAD AND EVERYTHING APPEARED NORMAL. THE CONTACT BEGAN TO DRIVE AGAIN WHEN THE  STEERING WHEEL PULLED TO THE RIGHT WITHOUT WARNING. THE CONTACT PULLED THE VEHICLE OVER TO THE SIDE OF THE ROAD AGAIN. THE CONTACT STATED THAT THE STEERING WHEEL AND WHEELS STARTED TO MOVE INDEPENDENTLY AND THE POWER STEERING, SERVICE ESC, AND TRACTION CONTROL WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TOWED TO THE DEALER (PINEGAR CHEVROLET BUICK GMC  OF BRANSON, 163 ADAIR RD, BRANSON, MO, 65616). THE CONTACT WAS INFORMED THAT THE VEHICLE WOULD BE DIAGNOSED ON THE NEXT BUSINESS DAY, JULY 17, 2017. THE MANUFACTURER STATED THAT THE VEHICLE WAS NOT INCLUDED IN THE SPECIAL COVERAGE ADJUSTMENT FOR LOSS OF ELECTRIC POWER ASSIST DUE TO THE VEHICLE BEING A SALVAGE TITLE UNDER CASE NUMBER: [XXX]. THE MANUFACTURER STATED THAT THE ONLY WAY THE VEHICLE WOULD BE COVERED WAS IF THERE WAS A RECALL OR SAFETY ISSUE. THE MANUFACTURER REFERRED THE CONTACT TO NHTSA. NO FURTHER ASSISTANCE WAS OFFERED. THE FAILURE MILEAGE WAS APPROXIMATELY 93,850.    PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "1G1ZH57BX9F"
    }
]