[
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/22/2017",
        "dateOfIncident": "06/20/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000579,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FUSION",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A BUSY CITY STREET DURING RUSH HOUR WHEN I NOTICED THE CAR JERKING WHEN IT CHANGED GEARS. THE RPM WOULD SHOOT UP HIGH THEN BACK DOWN WHILE LOSING POWER TO THE VEHICLE. I MANAGED TO GET TO AN AUTO ADVANCE STORE WHERE I HAD A DIAGNOSTIC DONE SINCE MY CHECK ENGINE LIGHT WAS ON. THE DIAGNOSTIC CAME BACK WITH CODE PO455 TWICE AND  PO457 TWICE. IT WAS THEN EXPLAINED THAT TOO MUCH AIR WAS GETTING INTO MY FUEL SYSTEM. I PROCEEDED TO GO TO THE FORD DEALERSHIP, WHICH WAS A HALF MILE AWAY. ON THE WAY, MY CAR CONTINUED TO JERK AND LOOSE POWER AND SOME POINTS. THEN EVERYTHING DIGITAL WHICH ONE DISPLAYS MY MILEAGE AND THE OTHER DISPLAYS HOW MANY MILE TILL EMPTY DISPLAYED INTERMITTENT LINES AND THE WRENCH ILLUMINATED ON MY DASHBOARD. AT THIS TIME MY CAR WAS ON BUT QUICKLY LOST POWER TO GO FORWARD. IT ALMOST GOT REAR ENDED BY THE CAR BEHIND ME. I PUT ON MY TURN SIGNAL AND  I COASTED TO THE SIDE OF THE ROAD, TURN OFF MY CAR WAITED A FEW MINUTES THE TURNED BACK ON AND PUT IT IN DRIVE. THE CAR WOULD NOT MOVE FORWARD. THE ENGINE JUST REVVED UP LIKE I HAD IT IN NEUTRAL. I PUT IT BACK IN PARK THEN PUT IT IN REVERSE. THE CAR WOULD OPERATE IN REVERSE. HAD TO HAVE CAR TOWED TO DEALERSHIP. THREE MONTHS PRIOR TO THIS INCIDENT, I HAD TO TAKE MY CAR TO THE DEALERSHIP BECAUSE OF EXCESSIVE BATTERY ACID ON MY POSITIVE TERMINAL THAT HAD EATEN THROUGH THE WIRING HARNESS. HAD TO HAVE HARNESS AND BATTERY REPLACED. I STILL NOTICE ISSUES OF BATTERY ACID ACCUMULATING AROUND THE SCREWS ON THE BATTERY HARNESS AND POSITIVE LEAD AGAIN.",
        "vin": "3FAHP0HA2BR"
    }
]