[
    {
        "components": "PARKING BRAKE,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/07/2019",
        "dateOfIncident": "01/23/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194415,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA3",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY 2014 MAZDA 3 IN NOVEMBER 2013. DURING THE FIRST 6 MONTHS OF PURCHASING THE CAR, MY DIVER SIDE REAR CALIPER FROZE CAUSING ME TO PAY ALMOST 900 DOLLARS TO REPLACE THE CALIPER, BOTH REAR PADS, BOTH REAR ROTORS, AND LABOR. A MAJOR REASON FOR THE INFLATED PRICE WAS DUE TO THE CALIPERS BEING A SPECIALTY ITEM WHICH NOT ONLY MADE THEM EXTREMELY EXPENSIVE BUT ALSO TOOK WEEKS TO GET DELIVERED. FAST FORWARD ANOTHER FIVE MONTHS LATER MY REAR SIDE PASSENGER CALIPER FROZE. SO, ONCE AGAIN I HAD TO PAY CLOSE TO 900 DOLLARS AND WAIT WEEKS FOR THE CALIPER TO COME IN. I WAS TOLD BY MULTIPLE MAZDA CERTIFIED MECHANICS AS WELL AS THE MAZDA DEALERSHIP SHOP MANAGERS TO KEEP MY RECEIPTS BECAUSE THE BRAKES I HAD WERE FREEZING ON A LOT OF THE NEW STYLE 2014 MAZDA 3S. FINALLY IN 2017, THE RECALL FINALLY POSTED. I CALLED THE DEALERSHIP I BOUGHT THE CAR FROM, CENTRAL MAZDA IN PLAINFIELD, CT, AND WAS TOLD MY VIN DIDN'T HAVE A RECALL ASSOCIATED WITH IT. APPARENTLY, EVEN THOUGH MY CAR HAD THE EXACT PART THAT WAS BEING RECALLED, AS WELL AS THE ISSUES DESCRIBED IN THE RECALL FITTING EXACTLY TO MY ISSUE, MY CAR WAS MADE IN 2013 WHICH THE RECALL DID NOT INCLUDE. I WAS TOLD TO CALL MAZDA TO SEE IF SOMETHING COULD BE DONE DUE TO MY SITUATION OBVIOUSLY BEING EXACTLY WHAT THE RECALL WAS POSTED FOR. UNFORTUNATELY, ONCE AGAIN I WAS TOLD BY MAZDA THAT MY ISSUE WAS DIFFERENT FROM THE RECALL DUE MY CAR BEING MANUFACTURED BEFORE THE DATE FOR THE RECALLED CARS. IN CONCLUSION , I WAS STIFFED WITH A BILL FOR ALMOST 2,000 DOLLARS WITHIN THE FIRST YEAR OF BUYING A BRAND NEW CAR, AS WELL AS WEEKS OF HEADACHES DUE TO NOT HAVING MY CAR. I HAVE HAD A GREAT EXPERIENCE WITH THE CAR AFTER THIS ISSUE WAS FINALLY FIXED, BUT I WILL NEVER BUY A OTHER MAZDA DUE TO THE WAY I WAS TREATED. IF IT WASN'T FOR THE MANIPULATIVE WAY MAZDA CLAIMED NO RESPONSIBILITY, I WOULD BE A RETURNING MAZDA CUSTOMER.",
        "vin": "JM1BM1T73E1"
    }
]