[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/31/2021",
        "dateOfIncident": "12/19/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427315,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "3 systems have failed within my two years of ownership.  The biggest fault ....and this is what you guys need to know!!!!!!! ATTENTION NEEDED.  DECEMBER 2020, I was put in total danger and others ️. After months of telling the dealer that the engine was idling really rough - like a shaking - and revving weirdly at times of acceleration. They continued to tell me there was nothing wrong with it and made me seem like I was the crazy one. Fast-forwarding to December 2020, I started to now hear this metal clacking noise from the engine. Made a 3rd appointment at the dealer that was a week out - but never MADE IT. Because few days before it, I was going out to a friend's and clacking started to get even louder - as LOUD could hear in the cabin. THEN as about to get onto highway on-ramp WITH NO WARNING- no check engine light - no notice whatsoever - engine rpm spiked loudly and a very loud pop followed - and engine totally ceased. Lost total engine propulsion - vehicle rolled to a stop and then all lights and sounds started going off with check engine light NOW FLASHING. HAD TO have HYUNDAI towed to the dealer - in which \"there was an engine rod bearing failure - which caused the engine to cease. Dealer took days to even get it seen and wouldn't give a loaner till deemed a fault under \"warranty\" which clearly was with there 10 yr - 100,000 mile warranty - which makes sense because there poorly made/crafted engine designs that involve the GDI ENGINES_ which have been known to fail prematurely - CAUSE FIRES _ and has even killed people. They aren't fixing the engine design they simply are putting the same KIND IN>>> and putting a system that detects engine knocking. THAT DOESNT FIX THE PROBLEM - and they KNOW THAT. There was no recall on my car or got anything in mail regarding engine dangers.  Further Hyundai would not give me any paperwork regarding the repair besides an engine assembly - a replacement that all. I readily asked for more info and they wouldn't give it.",
        "vin": "5XYZTDLB6GG"
    }
]