[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/26/2017",
        "dateOfIncident": "06/23/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001495,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BATTERY LIGHT INDICATOR ILLUMINATED IN THE DRIVER'S INFORMATION PANEL. WITHIN ANOTHER MINUTE THE DRIVERS SEAT BELT WARNING BEGAN CHIMING & FLASHING IN THE DISPLAY ALSO, EVEN THOUGH THE DRIVER'S SEATBELT WAS BUCKLED. AT THIS TIME ALL OF THE INDICATORS IN THE DRIVER'S INFORMATION PANEL BEGAN SPORADICALLY FLASHING. WITHIN THE NEXT FEW MINUTES, THE POWER STEERING STOPPED WORKING & THE CAR SHUT COMPLETELY DOWN. I HAD THE VEHICLE TOWED TO A MECHANICS SHOP. THERE, THEY REPLACED THE BATTERY & ALTERNATOR. UPON REPLACING THE PARTS, THE MECHANIC LISTED \"MORE ISSUES EXIST, VEHICLE STILL DOES NOT STAY RUNNING. POSSIBLE ISSUE WITH ECM AND/OR CAC\". THE MECHANIC ALSO POINTED OUT TO ME SAFETY RECALL P60/NHTSA WHICH WAS FOR A 2012 DODGE DURANGO (SAME MODEL YEAR AS MINE). WHEN I CONTACTED THE DODGE DEALER ABOUT THIS RECALL, HE INSTRUCTED ME THAT IT WAS ONLY FOR THE 160 AMP ALTERNATOR. MINE CONTAINED THE 180 AMP ALTERNATOR & WAS BUILT ABOUT A MONTH BEFORE THE RECALLED VEHICLES. HOWEVER, BOTH THE 160 AMP & THE 180 AMP ALTERNATOR SEEM TO SUFFER FROM THE SAME PROBLEMS. WITH ONLY A SHORT CHECK OF THE INTERNET, I WAS ABLE TO IDENTIFY OVER 100 CASES OF 180 AMP DODGE DURANGO SUDDENLY LOSING POWER WHILE BEING DRIVEN & CAUSING CATASTROPHIC ELECTRICAL FAILURE; SOME TRAVELING AS FAST AS 40-50 MPH. LUCKY FOR ME, I WAS ONLY GOING 10-15 MPH WITHIN THE CITY LIMITS OF BLOOMINGTON, ILLINOIS. ALTHOUGH IT WAS AROUND A CURVE THE ISSUE BEGAN WHILE I WAS DRIVING STRAIGHT ON A 6 LANE BYPASS DRIVING BETWEEN 40-45 MPH. I CAN NOT BEGIN TO EXPLAIN HOW UNBELIEVABLY FRUSTRATING IT IS FOR THE AUTOMAKER TO DENY THEIR CULPABILITY ON AN ISSUE THAT IS PUTTING THOUSANDS OF FAMILIES IN GRAVE DANGER & EQUALLY AS DISAPPOINTING TO FORCE THEIR OWN CUSTOMERS TO FOOT THE BILL FOR THEIR OWN CARELESS MISTAKE.",
        "vin": "1C4RDJDG4CC"
    }
]