[
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/19/2017",
        "dateOfIncident": "07/16/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11006400,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BODY:  THE TENSION BAR DOES NOT OPEN THE CAR TRUNK LID ALL THE WAY WHICH MORE OFTEN DROPS DOWN AND HIT THE PERSON'S HEAD OR FACE WHO IS PUTTING STUFFS IN THE TRUNK ASSUMING IT IS FULLY OPEN ALL THE WAY. I DID GOT HIT TWICE BY THE CORNER AND EDGE OF THE TRUNK LID ON THE FOREHEAD AND LEFT TEMPLE. THE LATTER CAUSED BRUISE AND PAIN THAT TOOK ME A WEEK TO RECOVER. SHOULD CHANGE WEAK TENSION BAR TO STRONG GAS TUBE OPERATION.    ENGINE: THE CAR VIBRATES AND RATTLES UPON PUTTING ON REVERSE GEAR EVEN AFTER AT LEAST A MINUTE WARMUP IN THE MORNING. THE DEALER SAID IT IS NORMAL FOR THIS TYPE OF CAR? THIS IS VERY EMBARRASSING FOR A NEWER CAR. I NEVER SEE THIS IN A TOYOTA CARS THAT I OWNED: SIENNA, AVALON...    SEATS: DRIVER SEAT IS NOT WELL DESIGNED AND CAUSING AWKWARD AND UNCOMFORTABLE AND FATIGUE POSITION WHILE DRIVING. THERE IS INSUFFICIENCY OF SUPPORT FOR LUMBAR ARE ( THE CURRENT ONE IS TOO SOFT AND SITTING BACK SO THERE IS VIRTUALLY NO SUPPORT AT ALL). AGAIN TOYOTA CARS SEEM NOT HAVING THIS KIND OF PROBLEM.  ALSO, THE DRIVER WINDOW IS NOT TALL ENOUGH THAT EVEN A 5'6\" PERSON CAN BANG HIS HEAD TO THE TOP OF THE WINDOW WHEN GETTING UP AND OUT OF THE DRIVE SEAT. IT SHOULD BE 2\" TALLER TO AVOID THIS PROBLEM. THEY SHOULD PUT CUSHION TO THE TOP EDGE AND SAFETY GRIP HANDLE AT THE MINIMUM.    DRIVING CONDITION:  THE CAR SEEMS TO WANDER WHEN RUNNING ON FREEWAY AT NORMAL SPEED.",
        "vin": "1HGCR2F58EA"
    }
]