[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/30/2017",
        "dateOfIncident": "06/22/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002592,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TAILGATE IS UNLATCHING AND FALLING OPEN. TAILGATE WHEN CLOSED IS SECURELY CLOSED DOES NOT MOVE. WHILE LOCKING AND UNLOCKING THE DOORS AND TAILGATE SEVERAL TIMES, TAILGATE BECOMES LOOSE. TAILGATE NOW BECOMES MOVABLE WITH ONE HAND. IF GOING OVER AN IRREGULAR SURFACE, ANGLE, WHILE DRIVING TAILGATE COMES FULLY UNLATCHED AND WILL FALL OPEN. THIS HAS BECOME A DAILY OCCURRENCE, AND MUST CONTINUALLY CHECK TAILGATE TO ENSURE THAT TAILGATE IS FULLY LATCHED. THIS TAILGATE PROBLEM STARTED AT 20674 MILES. TRUCK CURRENTLY HAS 21887 MILES. THIS HAS OCCURRED BACKING DOWN MY DRIVEWAY OR UP MY DRIVEWAY AS THE TRANSITION FROM LEVEL ROAD SURFACE TURNING INTO AND UP MY DRIVEWAY, OR BACKING OUT OF DRIVE WAY TRANSITIONING FROM SLIGHT GRADE TO ZERO GRADE OF ROAD SURFACE. SAME THING DRIVING INTO OR DRIVING OUT OF PARKING LOTS, ALSO ON HIGHWAY FROM ROAD SURFACE TO BRIDGE SURFACE TO ROAD SURFACE. NO WARNING. ONLY THE TAILGATE CABLES ARE SUPPORTING TAILGATE. SEEMS TO HAPPEN WHEN ANY KIND FLEXING OF BED AND FRAME. THIS IS MY SIXTH PERSONAL PICK UP TRUCK, LET ALONE THE DOZEN OR SO I HAVE USED THROUGH MY EMPLOYMENT. I AM VERY FAMILIAR WITH PICKUP TRUCKS, AND KNOW WHEN A TAIL GATE IS SECURED AND COMPLETELY AND FULLY LATCHED. * THIS STARTED 06/22/2017 AND HAS PROGRESSIVELY CONTINUED TO BECOME A DAILY OCCURRENCE, SOMETIMES SEVERAL TIMES, DEPENDING ON SURFACE TRUCK IS DRIVING ON. THIS TRUCK IS NOT OFF ROAD AT ANY TIME. TRUCK IS ONLY USED ON PAVED SURFACES.",
        "vin": "1C6RR6GT9GS"
    }
]