[
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/19/2017",
        "dateOfIncident": "02/03/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006288,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\"  I PURCHASED A 2013 CHEVROLET IMPALA 02/2015. ONE MONTH LATER MY CAR STOPPED IN ME. I GOT THE CAR TOWED TO SERRA CHEVROLET. THEY SAID I WAS OUT OF GAS WHICH I DIDN'T BELIEVE CAUSE I WAS AT QTR OF TANK. THEY SAID WITH THE KIND OF ENGINE I HAD QTR OF A TANK MEANT EMPTY IN MY CAR. I DIDN'T BELIEVE THIS. IN 02/2016, ON MY WAY TO WORK, MY CAR STOP ON THE INTERSTATE. I GOT THE CAR TOWED TO SERRA CHEVROLET AGAIN. THEY SAID MY FUEL PUMP SENSOR AND SOMETHING ELSE WAS GONE. THEY USED MY EXTENDED WARRANTY THAT I PURCHASED W/ SERRA TOYOTA WHEN I BOUGHT THE VEHICLE. I LOST MY JOB DUE TO THIS PROBLEM WITH THIS CAR. IN 02/2017, THE CAR STOPPED ON ME AGAIN. I GOT THE CAR TOWED AGAIN TO SERRA ON 02/03/17. THEY SAID IT WAS MY FUEL PUMP SENSOR. I HAD TO PAY $420.21 OUT OF POCKET ON 02/09 TO GET MY CAR. THEY SAID MY EXTENDED WARRANTY HAD EXPIRED. I DON'T UNDERSTAND CAUSE MY POWERTRAIN WARRANTY HAVEN'T EXPIRED, I'M ALSO STILL PAYING FOR AN EXTENDED WARRANTY WITH MY CARNOTE BUT I CAN'T UTILIZE, AND I ONLY USED THE EXTENDED WARRANTY ONCE. ON 02/13/17 AFTER I GOT MY CAR FROM SERRA MY CAR STOP WHILE I WAS DRIVING AGAIN. I CONTACTED SERRA. THEY PAID FOR TOWING BUT I HAD TO PAY FOR AN EMC, WHICH WAS $329.18. AT THE TIME, MY CAR HAD 86,078 MILES. ON 4/28/2017, I DON'T KNOW WHAT THEY SAID WAS WRONG BUT I PAID $1,131.25 ON 05/15/2017. I DON'T THINK THEY KNEW WHAT WAS WRONG. ON 05/24/2017, MY CAR MESSED UP AGAIN, AND I HAD TO PAY $133.00. SERRA GAVE ME A $32.95 DISCOUNT CAUSE I'VE HAD TO SPEND SO MUCH MONEY. AT THIS TIME, I HAVE 90668 MILES ON MY CAR. ON 06/21 OR 27TH, MY SERPINTINE BELT BROKE AND I HAD TO PAY $468. TO HENDRIX CHEVROLET. THAT WAS THE CLOSEST CHEVY STORE WHERE MY CAR STOPPED. NOW 7/18/17 MY CAR IS BACK IN THE SHOP AT SERRA. THEY SAY MY CRANKSHAFT AND SOMETHING WITH MY MOTOR. MY CAR HAVE 93,586 MILES. I WAS SOLD A LEMON FROM SERRA TOYOTA. I HAVE PAID $2,481 SINCE.",
        "vin": "2G1WG5E7D12"
    }
]