[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/15/2017",
        "dateOfIncident": "06/28/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005449,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "IF THIS HAPPENED ON THE INTERSTATE WE COULD BE KILLED(DEAD).  OUR ESCAPE HAS ONLY 10,800 MILES ON IT, AND IS DRIVEN BY MY WIFE. SHE DROVE IT IN TOWN  FOR ABOUT 15 MILES 2 DAYS PREVIOUSLY. ON THIS DAY, SHE STARTED THE CAR. IDLED IT FOR ABOUT 3 MINUTES, PUT IT IN GEAR AND 400 FT. LATER THE DASH LIGHT SAID SHUT DOWN ENGINE, OVERHEAT. THE GAS PEDAL WAS IN OP.. THE CAR WOULD ONLY GO ABOUT 1 MILE PER HOUR.  NO MATTER WHAT I DID TO THE GAS PEDAL IT WOULD NOT ALLOW THE CAR TO DO MORE THAN IDLE.  I CHECKED UNDER THE HOOD AND SAW NO LEAKS, THE RADIATOR RESERVOIR WAS ABOUT 1/2 FULL.  WE HAD THE CAR TOWED TO LANDMARK FORD IN SPFD, IL  5 DAYS LATER THEY TOLD ME THAT THE RADIATOR HOSE HAD A HOLE IN IT. (THEY THREW THE HOSE AWAY AND WOULD NOT LET ME SEE IT)  WE HAVE ABSOLUTELY NO LEAKAGE STAINS ON OUR DRIVEWAY.  THEY CHARGED ME $429.49  TO REPLACE THE RADIATOR HOSE. I CHECKED THE COST OF THE MOTORCRAFT HOSE AT THE AUTOPARTS STORE IT WAS $28.66. I AM LONG AGO RETIRED , BUT WAS CERTIFIED IN MANY DIFFERENT ENGINE REPAIR TYPES.  THE 1ST THING WE ALWAYS CHECKED WAS THE THERMOSTAT. THEY DID NOT TEST OR REPLACE THE THERMOSTAT ACCORDING TO THEIR BILL. I SUSPECT FRAUD FROM THE DEALER, BUT THIS IS NOT YOUR CONCERN. WHAT IS THE CONCERN IS THE PROBABLE CAUSE OF INJURY OR DEATH WHEN THE ENGINE COMPUTER LIGHTS THE DASH AND STOPS THE ACCELERATOR FUNCTION. ON A HIGHWAY THAT CAN AND PROBABLY WILL CAUSE AN ACCIDENT..  THANK YOU --[XXX], [XXX].    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'*JB",
        "vin": "1FMCU9GX0DU"
    }
]