[
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/30/2019",
        "dateOfIncident": "08/21/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252515,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "LIGHTS APPEARED ON DASHBOARD ON MY VEHICLE ON MORNING OF 8/21/2019, ON MY WAY TO WORK. AFTER WORK, I STOPPED BY BACHMAN HYUNDAI IN JEFFERSONVILLE, IN TO GET DIAGNOSTIC OF WHAT WAS GOING ON WITH MY VEHICLE. I MET WITH THE SERVICE PERSON I WOULD NORMALLY SEE. I WAS TOLD ME THAT MY WHEEL SPEED SENSOR REAR LH OPEN/SHORT, PART #C1206 AND WHEEL SPEED SENSOR REAR RH OPEN/SHORT, PART #C1209 + SHE TOLD ME I WOULD NEED TO REPLACE MY REAR ROTORS AS WELL, I STATED I HAD MY REAR ROTORS REPLACES  ABOUT A YEAR &A HALF AGO. SHE QUOTED THE JOB MORE THAN $1200.00 INCLUDING PARTS, LABOR + TAXES. I PURCHASED MY HYUNDAI SANTAFE FROM JIM ELLIS HYUNDAI IN ATLANTA, GA. I REACHED OUT TO A SERVICE TECH I TRUST AT JIM E. HYUNDAI/ATLANTA, HE INFORMED ME THAT THIS WAS A RECALL PART AND HYUNDAI SHOULD DO A PA REPLACE FREE OF CHARGE. I WENT BACK TO BACHMAN HYUNDAI, IN, TOLD HER WHAT WAS TOLD TO ME. PA WAS DONE, PA WAS DECLINED. SHE STATED YES SHE KNEW OF THE RECALL & WHY DIDN'T SHE MENTION TO ME. SHE STATED I HAD NOT HAD ALL OF MY VEHICLE SERVICED AT THERE LOCATION AND THAT I WAS NOT THE ORIGINAL OWNER AND IT HAD MORE THAN 13K MILES. I ASKED WHAT DID ALL OF THIS HAVE TO DO WITH REPAIRING MY VEHICLE? I CONTACTED ATLANTA BACK, WAS GIVEN # FOR HYUNDAI USA. THEY COULD SEE THAT PA WAS DONE & DECLINED, I ASKED WHY, HE DIDN'T UNDERSTAND WHY. HE UPDATED A NEW CASE # AND ESCALATED MY COMPLAINT AND SENT NEW CASE # HYUNDAI, IN TO GET JOB DONE. I RECEIVED CALL FROM HYUNDAI USA TODAY, ONLY TOE TOLD THAT MY VEHICLE IS OUT OF WARRANTY IS WHY THEY CANNOT REPAIR THIS RECALL ISSUE. PLEASE   ! I NEED YOUR HELP IN RESOLVING THIS SIMPLE ISSUE. TODAY THE LADY TOLD ME, WELL TAKE YOUR CAR BACK TO ATLANTA AND HAVE THEM REPAIR IT BECAUSE THEY WERE NOT APPROVING REPAIRS. SO UNFAIR! I HAVE RECEIVED SO MANY CONFLICTING STORIES NOT TO REPAIR THIS RECALL. PLEASE HELP ME! THANK YOU, [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "5XYZK4AG5CG"
    }
]