[
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/04/2017",
        "dateOfIncident": "07/04/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002976,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "GENESIS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JULY 4 2017 AT APPROXIMATELY 7:30AM ET I WAS WAITING TO PARK AND HAD MY FOOT ON THE BRAKE WHEN SUDDENLY THE ENGINE REVVED AND ACCELERATED, MOVING THE CAR FORWARD AND CRASHING INTO THE PASSENGER REAR BUMPER OF A PARKED FORD F-150.  I PRESSED EVEN HARDER ON THE BRAKES AND THE CAR CONTINUED TO MOVE FORWARD AS IF IT WAS SLIDING ON ICE; IT CREATED TIRE SKID MARKS FROM MY FRONT TIRES - SUPPORTING THAT THE BRAKES WERE ENGAGED.   I ATTEMPTED TO PUT THE CAR IN NEUTRAL AND THE ENGINE CONTINUED TO REV FASTER. THE NOSE OF MY CAR WAS LOWERED DUE TO MY PRESSING ON THE BRAKES AND AS A RESULT THE FRONT END OF MY CAR WENT UNDER THE BUMPER OF THE TRUCK AND BEGAN LIFTING THE TRUCK UNTIL IT FINALLY CAME TO A STOP.  THE CONDITIONS WERE SUNNY AND THE ASPHALT WAS DRY.     ON FRIDAY JUNE 23 AT APPROXIMATELY 2:00PM ET I WAS BACKING DOWN MY DRIVEWAY, WHICH HAS A SLIGHT VERTICAL DECLINE, SO THE BRAKES WERE ENGAGED.  THE CAR'S ENGINE SUDDENLY REVVED AND ACCELERATED DOWN THE DRIVEWAY INTO THE STREET; ONCE AGAIN, IT FELT AS IF I WAS SLIDING.  THE BRAKES WERE FULLY ENGAGED.  I WAS ABLE TO PLACE THE TRANSMISSION IN NEUTRAL AND THE CAR CAME TO A STOP.  I PLACED THE CAR IN PARK AND TURNED OFF THE ENGINE AND RESTARTED WITHOUT ANY ISSUE.    REGARDING THE JUNE 23 INCIDENT, THE CAR WAS NOT DRIVEN FOR APPROXIMATELY 6-8 DAYS.  RELATING TO THE INCIDENT ON JULY 4; THE LAST TIME THE CAR WAS DRIVEN WAS ON JUNE 23.  FROM JUNE 23 THROUGH JULY 4 THE CAR WAS PARKED AT THE AIRPORT.  THE ONLY PARALLEL THAT I CAN DRAW BETWEEN THESE TWO INSTANCES IS THAT THE ENGINE REV AND ACCELERATION OCCURRED AFTER THE CAR HAD NOT BEEN DRIVEN FOR A PERIOD OF TIME.    MY RESEARCH INDICATES THIS HAPPENED TO MANY OTHER DRIVERS; HOWEVER, THE MANUFACTURER CLAIMS THERE IS NO ISSUE WITH THE CAR AND THAT IT IS HUMAN ERROR; AVOIDING ACCOUNTABILITY.  I WILL TAKE A POLYGRAPH TO PROVE THIS WAS NOT HUMAN ERROR, RATHER A MECHANICAL FAILURE.",
        "vin": "KMHGC4DD9EU"
    }
]