[
    {
        "components": "STEERING,AIR BAGS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/07/2017",
        "dateOfIncident": "07/11/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013415,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  I BOUGHT THIS CAR ON 2015,USED WITH 35,000 MILES,AND I GOT WARRANTY.  WHILE I WAS DRIVING ON HIGHWAY TO TAKE MY LITTLE KIDS -18 MONTH OLD DAUGHTER,AND 2 MONTHS OLD BOY,ON THE DAYCARE,I HEARD NOISE,LIKE CLICKING ,AND LIKE A BROKEN THING.I TRIED TO USE THE HORN.IT DIDN'T WORK.AND ON MY DASHBOARD I SAW THE WARNING LIGHT OF AIRBAGS.AND ALL THE ELECTRICAL WAS NOT WORKING.I STOPPED IN ONESIDE OF HIGHWAY AND CALLED MY HUSBAND.IT WAS REALLY SCARY SITUATION. THE STEERING WHEELS IS TO HARD TO TURN LEFT AND RIGHT. I PANIC ABOUT THIS, BECAUSE I HAVE LITTLE KIDS THAT I HAVE TO TAKE AT DAYCARE  EVERYDAY. I START SEARCHING ABOUT THIS ISSUE WHEN I SAW THE RECALLS. FOR VOLKSWAGEN TIGUAN ,2014. I CALLED RECALLS CUSTOMER SERVICE. THE PERSON WHO ANSWERED HIS NAME IS [XXX] AND HE TOLD ME I HAD TO GO ,TO DO AN DIAGNOSTIC SCREENING FOR MY VEHICLE. SO I WENT IN A VW DEALER HERE IN AUSTIN. AND THERE THEY FIGURED OUT. THE AIR BAG CLOCK SPRING WAS BROKEN. AFTER HIM A LADY NAMED [XXX] CALLED ME TO ASK ALSO FOR THE DIAGNOSTIC SCREENING,TO FIX THE PROBLEM. AFTER I SENT TO HER THE PAPER I GOT FROM VW. SHE CALLED ME AND SAID WE WILL NOT DO THAT. IT IS NOT OUR PROBLEM. I AM REALLY ANXIOUS ABOUT THIS. I DON'T HAVE ANOTHER VEHICLE TO MOVE. EVERYDAY I AM FACING VERY DANGEROUS AND UNSAFE SITUATIONS. I CAN'T USE THE HORN, WHILE I AM DRIVING AND I FEEL UNSAFE USING THE VOLKSWAGEN. I AM EUROPEAN AND WHILE I WAS LIVING IN EUROPE. I WAS USING ALWAYS VOLKSWAGEN AND FOR ME WAS ON TOP. RIGHT KNOW I CANT BELIEVE HOW UNSAFE IS FOR ME AND MY LITTLE KIDS. I NEED A SOLUTION FOR MY SITUATION. URGENT SOLUTION.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WVGAV3AX6EW"
    }
]