[
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/25/2017",
        "dateOfIncident": "12/26/2014",
        "fire": false,
        "manufacturer": "Yamaha Motor Corporation, USA",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001233,
        "products": [
            {
                "manufacturer": "Yamaha Motor Corporation, USA",
                "productMake": "YAMAHA",
                "productModel": "XT1200Z",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEVERAL OCCASIONS, MY 2012 YAMAHA XTZ1200 SUPER TENERE HAS FAILED TO DECELERATE WHEN I COMPLETELY SHUT THE THROTTLE.  THE ENGINE CONTINUED TO REV AT OVER 3,000RPMS AND THE MOTORCYCLE MAINTAINED APPROXIMATELY 40MPH, WITHOUT THROTTLE INPUT.  THIS MOTORCYCLE IS NOT EQUIPPED WITH CRUISE CONTROL.  BRAKING TO STOP REQUIRED ME TO OVERCOME THE TORQUE OF THE ENGINE POWERING THE BIKE FORWARD AT OVER 3,000 RPMS IN ADDITION TO THE VELOCITY OF THE MACHINE ITSELF.  WHEN I WAS ABLE TO FIND A SAFE PLACE TO STOP AND SHUT THE BIKE OFF, IT RESTARTED WITH THE SAME PROBLEM AND REQUIRED 5-7 RESTARTS UNTIL IT STARTED NORMALLY AND RAN WITHOUT ANY PROBLEM UNTIL THE NEXT TIME THE ISSUE OCCURRED WITHOUT WARNING:  DURING THE SECOND INCIDENT I WAS APPROACHING AN EXIT RAMP AND LET OFF THE THROTTLE.  THE BIKE DID NOT DECELERATE UNDER ENGINE BRAKING AS EXPECTED DUE TO THE FACT THAT THE ENGINE REMAINED AT THE RPMS I HAD BEEN TRAVELING.  CLOSING THE THROTTLE HAD NO EFFECT ON THE SPEED OF THE ENGINE AND AS SUCH I ENTERED THE CORNER TOO FAST AND WAS FORCED TO DRAG THE BRAKES AGAINST THE POWER OF THE ENGINE.  AGAIN, AFTER FINDING A SAFE PLACE TO STOP, A RESTART RESOLVED THE ISSUE EVENTUALLY.  ON SEVERAL OTHER OCCASIONS, THE BIKE WOULD NOT IDLE AND DIED WHILE SITTING AT A RED LIGHT.  THE ENGINE, IDLING NORMALLY, WOULD SUDDENLY DROP TO ABOUT 800 RPMS AND THEN STOP.  IT HAS, ON OCCASION, REFUSED TO RESTART.  DURING EACH OF THESE EPISODES, THE 'MODE SELECTOR' SWITCH THAT CONTROLS THE THROTTLE MAP FAILED TO WORK, BUT NO ENGINE OR FAULT CODE WAS SHOWN ON THE DASH.",
        "vin": "JYADP03E5CA"
    }
]