[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/23/2018",
        "dateOfIncident": "01/19/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064515,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 JEEP GRAND CHEROKEE WITH A 3.6 LITRE PENTASTAR V6 ENGINE AND 56,500 MILES DID NOT PRODUCE HEAT FROM THE VENTS AND OVERHEATED.THE VEHICLE WAS TOWED TO SEAVIEW JEEP IN OCEAN NEW JERSEY.THE FIRST TWO TIMES THE VEHICLE WAS TOWED TO THE DEALERS SERVICE DEPARTMENT IT WAS RETURNED TO ME AND THE SERVICE REP STATED THAT THE OVERHEATING ISSUE COULD NOT BE REPLICATED. AFTER RESEARCHING THE ISSUE MYSELF AND THE ENGINE OVERHEATING A THIRD TIME I ASKED THE SERVICE MANAGER IF THE ENGINE COULD BE HAVING AN ISSUE WITH EXHAUST GASES ENTERING THE COOLING SYSTEM AND CAUSING THE ENGINE TO OVERHEAT AND IF THIS WAS CHECKED IN THE PREVIOUS TROUBLESHOOTING OF THE VEHICLE. THE MANAGER REPLIED THAT A BLOCK TEST WAS NOT DONE AND TO RETURN THE VEHICLE SO THE TEST COULD BE PERFORMED. THE VEHICLE WAS KEPT AT THE DEALERSHIP AFTER THE SECOND TIME IT WAS TOWED THERE FROM 12/22/17 - 1/16/18 AND RETURNED TO ME AFTER THEY CLAIMED THAT THEY FLUSHED AND FILLED THE COOLING SYSTEM AND RAN THE VEHICLE FOR SEVERAL DAYS WITHOUT IT OVERHEATING OR LOSING HEAT. THE MANAGER DID ADMIT THAT THERE WAS A WATER SWOOSHING SOUND COMING FROM BEHIND THE DASH THAT WAS UNUSUAL AND CLAIMED THERE WAS AIR POCKETS THAT THEY REMOVED WHEN THEY BLED THE AIR FROM THE SYSTEM. AFTER THE VEHICLE WAS RETURNED TO ME ON 1/16/18 IT WAS DRIVEN ON 1/17/18 BY MY WIFE AND THE NO HEAT/OVERHEATING ISSUE RETURNED AGAIN. THE VEHICLE WAS TOWED TO THE DEALERSHIP FOR THE THIRD TIME AND THE BLOCK TEST WAS PERFORMED.THE SERVICE MANAGER REPORTED TO ME THAT THE ENGINE HAD A CRACKED LEFT CYLINDER HEAD AND QUOTED ME A $2600 REPAIR COST. I CALLED CHRYSLER JEEP CUSTOMER CARE AT 877-426-5337 TO FILE A COMPLAINT AND A REDUCED RATE FOR REPAIRS WAS NEGOTIATED DOWN TO $500 WITH A CASE #33267278. I DON'T BELEIVE I SHOULD BE LIABLE DUE TO THE MANUFACTURES DEFECTIVE CYLINDER HEAD. THE CRACKED CYLINDER HEAD HAS BEEN REPORTED ON NUMEROUS 3.6 PENTASTAR ENGINES.",
        "vin": "1C4RJFAG9DC"
    }
]