[
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/22/2017",
        "dateOfIncident": "05/23/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000637,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON SURFACE STREET AT APPROX 35MPH I WAS FORCED TO SWERVE DUE TO BEING CUT OFF BY AN ADJACENT WRECKLESS VEHICLE.  MY 2013 BMW E93, WITH JUST OVER 43,000 MILES, AND WHICH I HAD PURCHASED LESS THAN 30 DAYS PRIOR,  IMMEDIATELY SHUT DOWN ENTIRELY WITHOUT WARNING. I WAS LITERALLY LEFT IN THE MIDDLE OF A BUSY STREET WITH ZERO FUNCTIONALITY. FROM ELECTRICAL TO EVERY ASPECT OF MECHANICAL, THERE WAS NO WARNING, NO FUNCTION OF ANY KIND. MY VEHICLES COMPLETELY UNEXPECTED FAILURE WAS SO SEVERE THAT IT REQUIRED MULTIPLE TOW TRUCKS IN ORDER TO LIFT THE REAR, AS IT HAD LOCKED UP ENTIRELY AND THE MOTOR SEIZED.  UPON ARRIVING AT CENTER BMW (SHERMAN OAKS, CA), THEY CONFIRMED THE OBVIOUS COMPLETE FAILURE OF THE ENTIRE VEHICLE. THEIR MASTER MECHANIC,  SHAUN, VERIFIED THE OIL WAS FULL AND CLEAN, AND NOTED THEY TOO RECEIVED NO ERROR CODES OR IDICATORS OF ANY KIND UPON IN DEPTH INSPECTION. THIS BMW DEALERSHIP & SERVICE CENTER IS AS BEWILDERED AS I AM.  BECAUSE I HAD LITERALLY JUST PURCHASED THE VEHICLE, WITH A FULL WARRANTY, I NOTIFIED MY WARRANTY COMPANY  RED AUTO WHOM SENT A 3RD PARTY INSPECTOR. WITHOUT ACTUALLY INSPECTING THE MOTOR, THE WARRANTY CO HAS DENIED MY CLAIM AND REFUSES TO DO ANYTHING FURTHER, CLAIMING IT IS A \"PRE-EXISTING CONDITION\" BASED ON ONLY REMOVING THE OIL PAN. HOWEVER, FINDINGS OF CENTER BMW'S MASTER MECHANIC DISPUTE THIS ENTIRELY. THIS REPORT, AS WELL AS THE DEALERSHIP INSPECTION REPORT AT THE TIME OF MY PURCHASE (LESS THAN 30 DAYS PRIOR) BOTH REFLECT THE VEHICLE AS WELL MAINTAINED PRIOR TO THIS CATASTROPHIC ENGINE SEIZE.   I AM APPALLED TO HAVE A BASICALLY BRAND NEW BMW ENGINE IN COMPLETE FAILURE FOR NO ADVISABLE REASON. I AM WITHOUT VEHICLE AND WITH A $30,000 REPAIR ESTIMATE.",
        "vin": "WBSDX9C50DE"
    }
]