[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/17/2018",
        "dateOfIncident": "02/23/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079915,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FEBRUARY 23,2018, I PURCHASE A NEW 2017 ACURA MDX WITH TECHNOLOGY PACKAGE.  THE VEHICLE HAD 378 MILES WHEN I PURCHASED IT.  IT HAD NEVER BEEN TITLED AND WAS SOLD AS A NEW VEHICLE.  UPON TAKING DELIVERY OF THE VEHICLE, I NOTICED THAT  THE VEHICLE HESITATES WHEN SHIFTING GEARS. WHEN STOPPED AT A TRAFFIC LIGHT ON A FLAT PAVED, CITY STREET, THE VEHICLE EXPERIENCES POOR ACCELERATION WHEN TAKING OFF.  I AM PRESSING THE GAS PEDAL DOWN REALLY HARD, YET THE VEHICLE IS MOVING VERY SLOWLY--NOT EQUAL TO THE AMOUNT OF PRESSURE I AM APPLYING TO THE GAS PEDAL. THE ACCELERATION IS VERY POOR, ESPECIALLY WHEN PULLING OFF FROM A STOPPED POSITION.  WHEN I AM GOING DOWNHILL ON A PAVED CITY STREET, THE VEHICLE ACCELERATES EVEN WHEN NO GAS IS APPLIED. EXPERIENCING ROUGH SHIFTING, ESPECIALLY IN LOW GEARS ON ALL PAVED ROADS. DANGEROUS WHEN TRYING TO MERGE ONTO THE HIGHWAY DUE TO EXTREMELY SLOW ACCELERATION.  SOMETIMES WHEN SLOWING DOWN TO STOP, THE VEHICLE ACCELERATES. WHEN I TRY TO MAKE A LEFT TURN AGAINST ONCOMING TRAFFIC, THE VEHICLE HESITATES AND COULD CAUSE A SERIOUS ACCIDENT.   ALL DRIVING TAKES PLACES ON CITY STREETS, HIGHWAYS AND PAVED ROADWAYS.  ON ONE OCCASION, THE VEHICLE WOULD NOT SHIFT INTO REVERSE FROM A PARKED POSITION. I RECEIVED AN ERROR CODE SAYING 'TRANSMISSION PROBLEM, PULL OVER WHEN SAFE.\"   THE POOR ACCELERATION PROBLEM IS WORSE WHEN I ENABLE THE ADAPTIVE CRUISE CONTROL AND LANE KEEPING ASSIST FEATURES. I HAVE RETURNED THE VEHICLE TO THE DEALERSHIP ON 2 SEPARATE OCCASIONS.  EACH TIME THEY TELL ME THE VEHICLE IS OPERATING AS DESIGNED.  THEY EVEN SAID THAT I NEED TO DRIVE THE VEHICLE MORE SO THAT THE TRANSMISSION WILL LEARN MY DRIVING PATTERNS AND MAKE THE NECESSARY ADJUSTMENTS.",
        "vin": "5FRYD4H57HB"
    }
]