[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/27/2020",
        "dateOfIncident": "04/04/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322415,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "CROSSTREK",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2019 SUBARU CROSSTREK (16.8K MILES) IS NOT BEING DRIVEN AS OFTEN AS IT USED TO BE BECAUSE WE ARE NOW WORKING FROM HOME. ON 4/4/2020 WE FOUND THE ORIGINAL BATTERY DRAINED DEAD AFTER ONLY 6 DAYS OF THE CAR BEING UNDRIVEN. TRIED AND FAILED TO START THE CAR - DASHBOARD LIGHTS LIT UP BUT THERE WERE RAPID CLICKING SOUNDS. TO GET IT TO THE DEALER, I STARTED THE PROCESS OF JUMP STARTING IT WITH MY BATTERY-PACK TYPE JUMP STARTER. I ATTACHED THE POSITIVE CABLE TO THE POSITIVE TERMINAL FIRST, AND THE JUMP STARTER'S INDICATOR LIGHT WAS FLASHING 'ALL GOOD ' CONTINUE'. I THEN ATTACHED THE NEGATIVE CABLE TO THE NEGATIVE TERMINAL AND THE INDICATOR LIGHT TURNED RED, WHICH MEANS 'THERE IS SOMETHING WRONG ' DO NOT PROCEED'. ON 4/6, I BROUGHT THE DEAD BATTERY TO THE DEALER USING MY OTHER CAR. THEY CHECKED THE BATTERY AND BECAUSE THE CAR IS STILL UNDER WARRANTY, I RECEIVED A NEW SUBARU-BRANDED BATTERY. I WENT HOME, INSTALLED IT, AND TURNED THE CAR ON TO MAKE SURE EVERYTHING WORKED. ON 4/10, WE STARTED UP THE CROSSTREK AND TOOK IT FOR A SEVERAL-MILE TRIP. 6 DAYS LATER, AFTER THE CAR NOT BEING DRIVEN, THE NEW BATTERY WAS DEAD - KEY FOB WOULD NOT OPEN THE CAR, NO DASHBOARD LIGHTS CAME ON WHEN WE TRIED TO START THE CAR. USING MY JUMP STARTER AGAIN, I RECEIVED THE SAME INDICATOR LIGHT WARNING. WE HAD THE CROSSTREK TOWED TO THE DEALER ON 4/16. TECHNICIANS COULD FIND NOTHING WRONG. THEY CHARGED THE BATTERY AND KEPT THE CAR UNTIL 4/20 WHEN THEY TRIED TO START IT UP ' IT STARTED. WE PICKED THE CAR UP AND DROVE IT HOME. TODAY IS 4/27. THE CAR HAS STARTED UP AFTER 6 DAYS OF NOT BEING DRIVEN ALTHOUGH LAST WED. AND SUN. I CHARGED THE BATTERY A BIT USING A TRICKLE CHARGER. I CURRENTLY DO NOT GET A WARNING LIGHT ON MY JUMP STARTER WHEN I DO A TEST. WE ARE NOW GOING TO DRIVE IT WHEN WE NEED TO WITHOUT USING THE BATTERY CHARGER AND SEE WHAT HAPPENS.",
        "vin": "JF2GTACC0K9"
    }
]