[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/29/2017",
        "dateOfIncident": "06/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002077,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE ARE MULTIPLE ISSUES, AS FOLLOWS, BUT OUR CONCERN IS THAT OUR SON HAS TRIED REPEATEDLY TO GET SUPPORT BY CALLING THE NUMBERS ON THE POST CARDS. WE HAVE BEEN UNABLE TO GET ANY SERVICE AS A RESULT OF THE CALLS AND CONVERSATIONS. HE LIVES ON THE ISLAND OF KAUAI, WEST OF OAHU.    #1: WE MUST SHIP THE CAR AT OUR EXPENSE IF WE EXPECT IT TO GET SERVICED. GM AND SAAB WILL NOT PAY FOR THAT SHIPPING OVER OR BACK. THEY WILL NOT PAY FOR A RENTAL CAR, AND REGARDLESS OF THE RECALL MANDATE, THEY STILL SEND OUT BOGUS INFORMATION.(EXAMPLE: BAY AREA SAAB IS NO LONGER A SAAB DEALER IN SAN FRANCISCO ' BUT IF THEY WERE OUR SON WOULD HAVE TO PAY THE TRANSPORTATION OVER AND BACK TO THE MAINLAND.)    #2: I HAVE ALSO CALLED,  AND FINALLY GOT GOOD ADVICE FROM THE GM 800 NUMBER REPRESENTATIVE ON THE PHONE WHO REFERRED ME TO A POINT OF CONTACT ON OAHU. THERE CURRENTLY IS NO SAAB DEALERSHIP IN HAWAII, BUT WE HAVE USED THE FORMER SAAB DEALERSHIP (A FORMER OWNER, HAS MAINTAINED THE PHONE NUMBER: 808-735-2488) FOR PARTS IN PAST YEARS. FORTUNATELY FOR SAAB OWNERS, THIS INDIVIDUAL HAS DONE ALL WITHIN HER POWER TO HELP OAHU OWNERS GET THE RECALL BUT IT HAS BEEN A NIGHTMARE FOR HER AS WELL TO MAKE ALL THE NECESSARY ARRANGEMENTS.  SHE IS A 'POSTER ADULT' FOR RESPONSIBILITY IN SMALL BUSINESS. SHE AND I HAVE EXCHANGED PHONE CALLS AND E-MAILS, AND I UNDERSTAND THAT SHE TOO IS TRYING TO GET GM/SAAB TO EITHER PAY FOR OFF-OAHU SAAB OWNERS TO SHIP THEIR CARS OVER AND BACK TO THE SERVICE PROVIDER HAS ARRANGED FOR ON OAHU, OR TO PAY TO HAVE QUALIFIED TECHS TRAVEL TO OUT ISLANDS TO SERVICE THE CARS. SO FAR ' NO ACTION TBMK. AND SHE IS AWAITING MONTHS FOR PAYMENT FOR THE PARTS AND SERVICE PROVIDED TO OAHU OWNERS ALREADY.    WE ARE REQUESTING A CONGRESSIONAL INQUIRY VIA CONGRESSWOMAN TULSI GABBARD AT THE SAME TIME AS THIS REQUEST TO INFORM NTHSB THAT FROM OUR PERSPECTIVE, THE RECALL IS FAILING.",
        "vin": "YS3FD49Y371"
    }
]