[
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/18/2017",
        "dateOfIncident": "10/19/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006120,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASE DATE 4-16.  EIGHT DOCUMENTED VISITS TO DEALER/REPAIR.  OTHER VISITS WHERE SERVICE ADVISER SAID TO RETURN WHEN SYSTEM FAILURES WERE HAPPENING, AS PROBLEM WOULD RESOLVE BEFORE I ARRIVED AT SERVICE. RE WATER INSIDE, DRIVER DOOR ISSUES, SYNC, CAMERA/STEREO  ELECTRICAL ISSUES INCLUDE DOORS WILL NOT UNLOCK AT TIMES, TAKES MULTIPLE ATTEMPTS TO BE GRANTED ACCESS INTO CAR, THUS CAUSING SAFETY CONCERN. SYNC GOES OUT FAIRLY REGULARLY INCLUDING PHONE FUNCTION, BACK UP CAMERA, STEREO. CURRENTLY IN SHOP AGAIN SINCE 7-3-17 @ 9 AM.(16 CONSECUTIVE DAYS THIS TRIP). SAFETY CONCERN OF  MOST IMPORTANCE TO ME IS THE FACT THAT CAR HAS LOST POWER MULTIPLE TIMES ON HIGHWAY AND THANKFULLY HAS NOT YET BEEN IN A MAJOR ACCIDENT. QUICK REFLEXES OF DRIVERS BEHIND ME ARE ONLY REASONS THAT ACCIDENTS HAVE BEEN AVOIDED THUS FAR. I AM TOLD BY DEALER THAT THIS IS A THROTTLE BODY MALFUNCTION. THROTTLE BODY HAS BEEN REPROGRAMMED AFTER A NEAR REAR END ACCIDENT ( HIGHWAY/ INTERSECTION/TURN). THROTTLE BODY WENT OUT WITH NO WARNING CAR INSTANTLY DECELERATED WITH NO ACCELERATION CAPABILITY. ONE WEEK LATER THROTTLE BODY FAILS AGAIN CAUSING A NEAR ACCIDENT THAT WOULD HAVE BEEN FATAL IN NATURE DUE TO THE SPEED OF TRAFFIC ON HIGHWAY. MY 7 YEA OLD WAS IN REAR SEAT. MY CHILDREN ARE NO LONGER FOR ANY REASON ALLOWED IN THE VEHICLE SINCE OCTOBER 2016.  THROTTLE BODY HAS YET AGAIN BEEN REPLACED JUNE 2017.  THIRD ATTEMPT TO REPAIR THIS CAR WITH NO INDICATION THAT THIS IS A REPAIR, IT SEEMS TO BE MERELY A REPAIR ATTEMPT AS THIS PROCESS OF ATTEMPTED REPAIRS HAS CAUSED 3 NEAR REAR ACCIDENTS. THIS CAR HAS PROVEN ITSELF TO BE A DANGER ON THE ROAD AND A MAJOR SAFETY HAZARD FOR ANYONE INSIDE OR OUTSIDE OF THIS VEHICLE WHILE IT IS IN MOTION. LOW MILEAGE IS INDICATOR OF HOW UNTRUSTWORTHY VEHICLE IS TO ME.  IT IS ONLY DRIVEN BY ME, NO PASSENGERS ALLOWED. ONLY DRIVEN IF ANOTHER CAR CAN NOT BE BORROWED.  UNRESOLVED ISSUES.",
        "vin": "1FA6P8AM1G5"
    }
]