[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/07/2018",
        "dateOfIncident": "06/23/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110015,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CR-V",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HONDA CRV BRAKING SYSTEM FAILUREJUNE 2018      MODEL:  CR-V  YEAR:   2017  MILEAGE:  5,900  VIN:   [XXX]      ON JUNE 23RD, 2018, WHILE EXITING A FREEWAY AT ABOUT 60MPH, I REMOVED MY FOOT FROM THE ACCELERATOR AND APPLIED NORMAL PRESSURE TO THE BRAKE PEDAL, BUT NO BRAKING OCCURRED.  I TRIED PUMPING THE BRAKE PEDAL, BUT THERE WAS NO RESPONSE. I THEN USED GREATLY INCREASED PRESSURE ON THE BRAKE PEDAL, BUT WITH NO DISCERNIBLE EFFECT.  AFTER ABOUT EIGHT SECONDS OF CONTINUED EXTREME PEDAL PRESSURE, A YELLOW \"BRAKING SYSTEM\" WARNING LIGHT CAME ON, FOLLOWED  BY A RED \"BRAKE\" WARNING LIGHT ON THE INSTRUMENT CLUSTER.  IMMEDIATELY FOLLOWING THE APPEARANCE OF THE WARNING LIGHTS, A LOUD NOISE WAS HEARD, COMING FROM THE WHEELS, ACCOMPANIED BY A VIBRATION WHICH I INTERPRETED AS MODULATED BRAKING THAT COULD BE FELT THROUGH MECHANICAL FEEDBACK IN THE PEDAL. THE CAR CAME TO A STOP JUST IN TIME, BEHIND TRAFFIC THAT HAD BEEN WAITING AT A SIGNAL LIGHT. TEN SECONDS AFTER STANDING AT THE LIGHT, ALL WARNING LIGHTS EXTINGUISHED, AND THE BRAKES FUNCTIONED NORMALLY THEREAFTER.       WHEN THE VEHICLE WAS TAKEN TO THE DEALERSHIP FROM WHICH IT WAS PURCHASED FOR WARRANTY REPAIRS, THE SERVICE REPRESENTATIVE STATED THAT HE WAS FAMILIAR WITH THE PROBLEM, HAD RECENTLY ENCOUNTERED AN IDENTICAL CASE OF BRAKING SYSTEM FAILURE, BUT THAT HIS SERVICE DEPARTMENT HAD BEEN UNABLE TO FIND THE FAULT OR ENACT REPAIRS. HE DECLINED TO EXAMINE MY VEHICLE ON THAT BASIS.       SINCE THE DEALER SERVICE CENTER PROVIDED NO RESOLUTION,  I UPDATED THE SOFTWARE IN MY OWN SCANNER, CONNECTED IT TO THE VEHICLE, AND FOUND THAT TWO ERROR CODES HAD BEEN RECORDED:  1)   U0418-68/P   ESB FAILURE    EMINENT    2)  U0416-68/P  VSA SYSTEM MALFUNCTION    DTC      I AM CONTINUING TO PURSUE A REMEDY TO THE BRAKING SYSTEM FAILURE THAT OCCURRED IN MY VEHICLE, SINCE IT REPRESENTS AN ONGOING AND UNREASONABLE RISK.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "2HKRW6H34HH"
    }
]