[
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/17/2017",
        "dateOfIncident": "07/14/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005818,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM A FRUSTRATED OWNER OF A 2013 NISSAN JUKE SL.  I AM THE FIRST AND ONLY OWNER.  AT ABOUT 20K MILES, I TOOK THE CAR IN FOR ITS REGULARLY SCHEDULED MAINTENANCE AND COMPLAINED THAT THE VEHICLE WAS NOISES WHILE DRIVING ON THE HIGHWAY.  I WAS GIVEN, WHAT I KNOW NOW TO BE THE TEXTBOOK RESPONSE, 'I'M SORRY WE DROVE THE CAR AND COULD NOT DUPLICATE THE ISSUE YOU'RE COMPLAINING ABOUT'. 30K MILES, I TOOK THE CAR IN FOR ITS REGULARLY MAINTENANCE WITH THE FOLLOWING COMPLAINT:  THE CAR IS EXTREMELY NOISES ON THE HIGHWAY THAT I CAN BARELY HEAR MY MUSIC, THUS I HAVE TO APPEAR OBNOXIOUS TO SURROUNDING DRIVERS BECAUSE MY MUSIC IS LOUDER THAN THEIRS, SO THAT I CAN HEAR IT OVER THE NOISE COMING FROM UNDER MY HOOD WHICH SOUNDS LIKE AN AIRPLANE.  FURTHERMORE, WHEN I STEP ON THE GAS PEDAL TO INCREASE SPEED, THE CAR IS SLOW TO RESPOND.  ONCE AGAIN, NISSAN CLAIMS THEY ARE NOT ABLE TO PINPOINT THE ISSUE.  45K MILES, THE CAR GOES IN FOR ITS REGULARLY MAINTENANCE WITH THE FOLLOWING COMPLAINT:  WHILE DRIVING ON THE HIGHWAY FOR 3 HOURS, THE CAR WILL LOOSE POWER'IT IS STILL NOISES AS ALL HELL, BUT THE CAR WILL SLOW DOWN WITHOUT WARNING.  I HAVE BEEN HIGH BEAMED AND HONKED AT.  THIS IS DANGEROUS TO ME, MY PASSENGERS AND OTHER DRIVERS ON THE ROAD. THE CAR DOESN'T OVERHEAT AND ALL FLUID LEVELS ARE FINE.  ONCE AGAIN, NISSAN CLAIMS THEY ARE NOT ABLE TO PINPOINT THE ISSUE. THIS PAST WEEKEND, I AM DOING MY 4.5 HOUR ROAD TRIP AGAIN IN NISSAN'S DEATHTRAP THEY HAVE FONDLY NICKNAMED JUKE. LIKE CLOCK WORK, AFTER 3 HOURS ON THE HIGHWAY, THE CAR STARTS TO SLOWDOWN, I CALLED NISSAN WHILE IT WAS HAPPENING, BUT HE CAN BARELY HEAR ME OVER THE LOUD NOISE (JET ENGINE SOUND EMITTING FROM UNDER MY HOOD).  I TOOK THE CAR INTO NISSAN WHO COULD NOT DO ANYTHING BECAUSE THEY DON'T LOOK INTO PROBLEMS LIKE THIS ON THE WEEKEND.",
        "vin": "JN8AF5MV1DT"
    }
]