[
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/26/2019",
        "dateOfIncident": "11/02/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291215,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE FREEWAY AT APPROXIMATELY 60-70 MPH I DROVE ACROSS A BRIDGE TRANSITION POINT WHEN OUT OF THE BLUE MY TRUCK BEGAN TO WOBBLE EXCESSIVELY TO THE POINT I HAD TO MERGE TO MY RIGHT AND SLOW DOWN TO UNDER 40 MPH TO GET THE WOBBLE TO STOP.  CARS BEHIND COULD SEE I WAS IN SOME SORT OF TROUBLE AND THEY WOULD NOT PASS ME.  ONCE THE WOBBLE STOPPED I PROCEEDED TO MERGE BACK ONTO THE FREEWAY AND ONCE AGAIN THE WOBBLE STARTED AS SOON AS I PASSED OVER THE BRIDGE TRANSITION.  AGAIN I APPLIED MY BRAKES AND MOVED OVER TO THE RIGHT FOR MY SAFETY AS WELL AS OTHERS.  THE MILEAGE ON MY TRUCK AT THAT TIME WAS 20,780 MILES.  I TOOK THE TRUCK TO MY FORD DEALER AND EXPLAINED THE SITUATION TO THEM.  THEY INSPECTED THE TRUCK AND REPLACED THE STEERING DAMPER ASSEMBLY.   THE PROBLEM DID GO AWAY UNTIL AUGUST 19, 2019 WITH 34,052 MILES WHEN IT HAPPENED AGAIN IN THE SAME LOCATION.  I RETURNED TO THE DEALER AGAIN AND THEY REPLACED THE STEERING DAMPER AGAIN.  IT RESOLVED THE ISSUE FOR 1695 MILES AND IT HAPPENED AGAIN SEVERAL TIME AT DIFFERENT LOCATIONS ON DIFFERENT FREEWAYS.  THIS TIME REPLACING THE DAMPER DID NOT WORK.  THEY ALSO TOLD ME I NEEDED TO HAVE THEM INSTALL A CASTER/CAMBER ADJUSTER SHIM TO RESOLVE THE PROBLEM.  THAT ALSO DID NOT WORK.  THEY HAVE READJUSTED THE CAMBER AND CASTER WITH WORSE RESULTS.  THEY NOW TELL ME THAT I NEED TO REPLACE MY TIRES WHICH STILL HAVE 6/32 OF TREAD LEFT ON THEM.  THE TRUCK HAS NOW BEEN AT THE DEALERSHIP FOR SIX WEEKS WITH NO FIX AVAILABLE.  THEY PUT A SET OF TIRES AND RIMS OFF OF ANOTHER NEW TRUCK AND SAID THE PROBLEM WENT AWAY.  SO WHAT THERE TELLING ME IS I WILL HAVE TO REPLACE MY TIRES EVERY 20,000 MILES WHICH BE RIDICULOUS.  FORD HAS A BIG PROBLEM THAT THEY DON'T WANT TO ADMIT.  I BELIEVE A DUAL STEERING STABILIZER UNIT WILL FIX THIS PROBLEM BUT THEY DON'T WANT TO ADMIT THAT WOULD WORK.  THIS NEEDS TO BE A RECALL ASAP TO SAVE  LIVES.",
        "vin": "1FT7W2BT9FE"
    }
]