[
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,ENGINE",
        "crash": true,
        "dateComplaintFiled": "07/06/2017",
        "dateOfIncident": "06/16/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11003530,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 7:15AM IN A PUBLIC PARKING LOT OF A STRIP MALL SETUP, I APPROACHED A PARKING PLACE BUT FIRST LETTING AN EMPLOYEE OF PANERA BREAD CROSS IN FRONT OF ME BEFORE I APPROACHED THE SPACE.  UPON APPROACHING I WAS GLIDING IN USING THE BRAKE TO SLOW ME WHEN ALL AT ONCE THE ENGINE REVED WHILE MY FOOT WAS ON THE BRAKE ACCELERATING ME AND THE VEHICHLE INTO A TREE 8 FEET PAST THE PARKING SPACE, DEPLOYING THE AIR BAG AND BOUNCING ME BACK AROUND 16 FEET.  THE VEHICHLE HAD AT LEAST ACCELERATED TO 20MPH TO ACCOMPLISH WHAT HAD HAPPEND.  MY HUSBAND HAD TOLD ME AS WELL AS THE OFFICER AT THE SCENE, THAT THIS HAD HAPPENED TO HIM 3 TIMES IN THE RECENT PAST ON A GRADUATED INTENSITY.  I SUFFERED HAND LACERATIONS AS WELL AS FOREHEAD WITH CHEST BRUISING FROM THE SEAT BELT AND A HAND BURN FROM THE DEPLOYED AIR BAG.  I ALSO HAD A SLIGHTLY BLEEDING LIP AND WAS RELEASED AT THE SCENE FROM THE AMBULANCE WITH A STRONG SUGGESTION TO FOLLOW UP IF NECESSARY.  IT IS A SHAME THAT YOUR OWN INSURANCE COMPANY WOULD RATHER LOOK THE OTHER WAY THEN GET INVOLVED AND ATTORNEYS ONLY WANT \"SEVERE\" HOSPITAL RIDDEN PATIENTS TO MOVE FORWARD ON A CASE.  MY INSURANCE COMPANY WANTS TO FIX THE HONDA PILOT AND PUT ME BACK BEHIND THE WHEEL.  I HAD SPOKEN WITH ONE INDIVIDUAL WHO WORKS ON HONDA'S AT A HONDA GARAGE AND ISN'T IT INTERESTING HE SUGGEST IT MAY BE A SENSOR OR ELECTRICAL ISSUE WITH THE ACCELERATION SYSTEM......BUT ODDLY ENOUGH, HE HASN'T HEARD OF THIS EITHER, BUT UPON RESEARCH, I'VE FOUND IT ALL OVER THE INTERNET.  I TOLD MY INSURANCE COMPANY, \"SHOULDN'T WE START SOMEWHERE.\"",
        "vin": "5FNYF4H59AB"
    }
]