[
    {
        "components": "AIR BAGS,ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/28/2017",
        "dateOfIncident": "06/14/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001866,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AUTO IS UNSAFE TO DRIVE THE STEERING SENSOR KEEPS MALFUNCTIONING AND PUTS CAR IN LIMP MODE. HAPPENED 7 TIMES IN ONE DAY, CAR IN LIMP MODE DOES NOT HAVE ENOUGH POWER TO GET OUT OF TRAFFIC . MAKING A LEFT TURN IN HEAVY TRAFFIC IT MALFUNCTIONED AND TRAFFIC BEHIND ME CAME EXTREMELY CLOSE TO COLLISION BECAUSE CAR LOST 99% OF POWER. CAR HAS ACTIVE RECALLS VERY OLD NOW BMW SAYS TEY HAVE NO PARTS TO REPAIR. THIS CAR HAS 37,186 MILES ON IT ,  MAKING THE OPERATING COST OVER $2.00 A MILE NOT INCLUDING GASOLINE OR MAINTAINENCE. TO RESET MALFUNTIONING SENSOR THE BATTERY IS DISCONECTED TO REBOOT THE ENGINE CONTROLLS RECONECTED RESTART THEN TURN HARD LEFT AND THEN HARD RIGHT, NORMAL DRIVING IS RESUMED ON THIS UNIT IT ONLY WORKS UNTILL YOU SLOW FOR TRAFFIC OR TO MAKE A TURN MAKING THE CAR AND TRAFFIC AROUND IT EXTEMELY UNSAFE AS THE AUTO HAS SUDDEN POWER LOSS.  THE RECALLS ON AUTO ARE OLD AND AGAIN BMW SAY NO REPLACEMENT PARTS. PHONE MESSAGES TO SERVICING DEALER ARE UNANSWERED AND WHERE I LIVE THER IS NO DEALER.   MY OWN SEARCH ON THE INTERNET REVEALED ALL 5 SERIES BMW HAVE COMPLAINTS OF THIS MALFUNCTION. I AM A CANCER PATIENT AND USING THIS VEHICLE TO TRAVEL TO TREATMENTS IS GOING TO KILL ME BEFORE THE CANCER. AND MAYBE OTHER INNOCENT PEOPLE TOO. I FEEL THAT BMW LOOKING IN TO IT IS NOT ENOUGH ACTION NTSB SHOULD TAKE IMMEDIATE ACTION AND BMW SHOULD BE MADE LIABLE FOR ALL REPAIRS AND RESPONCIBLE FOR THE TRANSPORTATION OF AFFECTED AUTOS TO A REPAIR CENTER AS THE AUTOS ARE IN FACT UNSAFE TO OPERATE.",
        "vin": "5UXFE83557L"
    }
]