[
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/18/2017",
        "dateOfIncident": "07/18/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006258,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN MOTION ON A MAJOR HIGHWAY THE CAR HAS UNEXPECTEDLY LOST POWER. THIS HAS NOT BEEN A ONE TIME ISSUE. THIS HAS HAPPENED WHILE TURNING, WHILE DRIVING ON A CITY STREET, DRIVING UP A HILL, AND ALL OTHER INSTANCES WHERE YOUR CAR IS IN MOTION. I AM TERRIFIED TO BE IN THE CAR, BUT THIS OUR ONLY MEANS OF TRANSPORTATION. THE DEALERSHIP THAT SERVICES US HAS TOLD US THAT MANY OTHER 2015 JEEP PATRIOTS ARE HAVING THIS SAME ISSUE AND CHRYSLER REFUSES TO FIX THE PROBLEM. HE SAID THAT IT COULD BE THE THROTTLE BODY OR POSSIBLY SOMETHING ELSE- THE DIAGNOSTIC TEST SHOWED ELUSIVE RESULTS. THE MAN WHO LOOKED AT THE JEEP SAID THAT HE CONTACTED CHRYSLER HOPING THAT THEY WOULD \"GOODWILL\" THE NEEDED REPAIRS, AS WE JUST PASSED THE WARRANTY BY 1000 MILES. CHRYSLER REFUSED DESPITE THIS MAN'S PERSISTENCY TO ASSIST US. BUT OUR JEEP NIGHTMARE DOES NOT END THERE. BEFORE 15,000 MILES, A BRAND NEW TRANSMISSION HAD TO BE PUT IN. NOW AT 37,000 MILES THE CAR IS PRESENTING TRANSMISSION ISSUES AND THROTTLE BODY ISSUES. WE WERE ADVISED NOT TO DRIVE THE CAR AS IT HAS PROVEN ITSELF TO BE UNSAFE, AND AS I MENTIONED PREVIOUSLY THIS IS OUR ONLY WAY OF TRANSPORTATION. SO NOW WE ARE STARING AT OUR PARKED CAR THAT SOMETIMES DOES NOT EVEN START, WHILE MAKING PAYMENTS ON SAID VEHICLE, WHICH HAS BEEN DEEMED TOO UNSAFE TO DRIVE, PAYING ADDITIONAL MONEY TO BE DRIVEN AROUND TO WORK AND SCHOOL, AND DEALING WITH SUBSTANDARD CUSTOMER SERVICE. WHAT A JOY!",
        "vin": "1C4NJRVV7FD"
    }
]