[
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/14/2017",
        "dateOfIncident": "07/14/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005412,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS PROBLEM HAS HAPPENED SEVERAL DIFFERENT TIMES. THE FIRST TIME WAS IN MAY 2017. AS I WAS DRIVING HOME, I KEPT GETTING A \"SERVICE STABILITRAC\" MESSAGE. ABOUT 2 MINUTES AFTER THE LAST MESSAGE I WAS SLOWING DOWN TO TURN AND MY TRUCK COMPLETELY LOST ALL POWER. IT WENT COMPLETELY DARK. THE STEERING WHEEL RIPPED OUT OF MY HANDS AND I NEARLY CRASHED HEAD ON INTO ONCOMING TRAFFIC. WITH ALL MY STRENGTH I TURNED THE WHEEL ENOUGH TO AVOID A HEAD ON COLLISION. AFTER I COASTED TO A STOP, I TURNED THE KEY OFF, THEN RESTARTED IT AND DROVE HOME. I TOOK IT TO A DEALER AND THEY TOLD ME THEY COULDN'T FIND A PROBLEM. FOR THE LAST 3 MONTHS IT HASN'T HAPPENED AGAIN UNTIL YESTERDAY. ALL KINDS OF ELECTRICAL PROBLEMS. LOSING POWER, STABILITRAC MESSAGES, DIMINISHED STEERING, LOSS OF POWER BRAKES. I PULLED INTO MY DRIVEWAY YESTERDAY AND LOST ALL POWER, MY DOOR LOCKS WENT UP AND DOWN LIKE THREE TIMES, AC SURGES, RADIO WENT ON AND OFF A FEW TIMES. I LOOKED UP THE PROBLEM ONLINE AND FOUND THAT THIS ISAME PROBLEM IS HAPPENING TO A LOT OF 2014 1500 SILVERADOS. THIS SHOULD DEFINITELY BE A RECALL ISSUE. TOTAL LOSS OF POWER WHILE DRIVING. SOMEONE IS GOING TO DIE FROM THIS ISSUE. TODAY WHEN I WAS DRIVING HOME I WAS GOING ABOUT 30 MPH IN TRAFFIC AND MY TRUCK LOST ALL POWER AGAIN, TOTAL BLACKOUT OF ALL ELECTRONICS, NO STEERING OR BRAKES, BUT THANKFULLY ALL SYSTEMS TURNED BACK ON IN A MATTER OF SECONDS AND I MADE IT HOME. AFTER LOOKING ONLINE, IT SEEMS THAT SOMEONE HAS LOCATED THE SOURCE. IT IS A FAULT AT THE \"G218\" GROUND POINT WHICH IS LOCATED UNDER THE FRONT LEFT DASH SPEAKER. (SEE YOUTUBE VIDEO, SEARCH 2014 CHEVY SILVERADO 1500 STABILITRAC PROBLEM). SERIOUSLY, HOW IS THIS NOT A RECALL, TOTAL LOSS OF POWER WHILE DRIVING.",
        "vin": "3GCUKSEC1EG"
    }
]