[
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "06/26/2017",
        "dateOfIncident": "06/25/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001518,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 1500",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD A RUSTED BRAKE LINE (DRIVER SIDE FRONT) FAIL JUNE 25TH, 2017. THIS TRUCK IS 12 YEARS OLD AND HAS LESS THAN 90,000 MILES. IMMEDIATELY ALL BRAKING WAS LOST AND THE PEDAL PUSHED TO THE FLOOR. REPEATED PRESSING THE BRAKE ONLY PUMPED OUT ALL THE BRAKE FLUID. THIS WAS A SUDDEN AND CATASTROPHIC LOSS OF BRAKING. THE WORST PART IS, BRAKING IS SUPPOSED TO BE SPLIT AND INDEPENDENT BETWEEN FRONT AND REAR BRAKES, SO IF YOU LOSE THE FRONT, THE REAR BRAKES STILL WORK, AND VICE VERSA. WELL I LOST ALL BRAKING, I HAD NO FRONT OR REAR BRAKING! THIS SHOULD BE A CLEAR SAFETY PROBLEM AND A MANDATORY RECALL!  I CRASHED INTO THE CAR IN FRONT OF ME, BECAUSE OF COURSE MY EMERGENCY BRAKE DIDN'T WORK EITHER.     DESPITE GM'S INSISTENCE THAT SOMEHOW THIS PREMATURE BRAKE LINE FAILURE IS NORMAL AND THE OWNER'S MAINTENANCE PROBLEM, IT SHOULD BE A VERY SIMPLE ISSUE FOR THE NHTSA TO SIMPLY OPEN A SINGLE BRAKE LINE AND TEST TO REALIZE THE AFFECTED VEHICLES DO IN FACT LOSE ALL BRAKING, NOT JUST FRONT OR REAR. I'VE ALREADY COMPLETELY LOST FAITH IN GM TO DO THE RIGHT THING, BUT I'D LIKE TO BELIEVE THE NHTSA WILL STILL DO THE RIGHT THING, AND NOT LET GM OFF WITH A CLEAR SAFETY PROBLEM WITH THEIR BRAKE DESIGN.    THIS CRASH WAS PULLING UP TO THE STOPLIGHT IN PRESCOTT, WI, HEADING INTO TOWN ACROSS THE PRESCOTT BRIDGE. I WAS DRIVING MAYBE 30 MPH WHEN I REALIZED I HAD LOST ALL BRAKES.",
        "vin": "3GNFK16Z95G"
    }
]