[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/06/2017",
        "dateOfIncident": "06/20/2017",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003513,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING HOME FROM WORK ON THE EXPRESS WAY A CAR CHANGED LANES IN FRONT OF ME TO CLOSE FOR COMFORT.  I ATTEMPTED TO APPLY THE REAR BRAKE BUT COULD NOT PUSH THE PEDAL DOWN.  I SWERVED AND USED THE FRONT BRAKE TO SLOW DOWN TO CREATE SPACE BETWEEN MYSELF AND OTHER TRAFFIC.  I CONTINUED HOME KNOWING I ONLY HAD FRONT BRAKES.   ONCE HOME I ATTEMPTED TO PUSH THE BRAKE PEDAL.  IT WOULD NOT MOVE.      UPON RESEARCHING THIS ON THE COMPUTER I FOUND MANY COMPLAINTS OF THIS HAPPENING TO OTHERS SOMETIMES THE REAR BRAKE SOMETIMES THE FRONT BRAKE.       I TOOK THE BIKE TO THE DEALERS FOR MAINTENANCE.   WHAT FAILED WAS THE REAR ABS CONTROL MODULE.  THIS IS THE SAME PART LISTED ONLINE BY MANY AS FAILING.  ONE WEEK AFTER TAKING THE MOTORCYCLE TO THE DEALER I RECEIVED A LETTER FROM HARLEY DAVIDSON INFORMING ME THAT MY MOTORCYCLE CONTAINED DOT 4 BRAKE FLUID AND THAT IT WAS REQUIRED TO BE CHANGED EVERY TWO YEARS TO PREVENT POSSIBLE FAILURE.  I HAVE OWNED THIS BIKE SINCE NEW, 2008,  AND NEVER RECEIVED A LETTER FROM HARLEY  BEFORE.  THE DEALER CONFIRMED THAT IT WAS THE ABS MODULE THAT HAD FAILED AND ORDERED ONE.  THE PART THAT WAS ON MY BIKE IS NO LONGER AVAILABLE. (I AM ASSUMING BECAUSE HARLEY KNOWS THEY ARE NO GOOD).  THE NEW PART THAT IT HAS BEEN REPLACED WITH WILL NOT WORK ON MY MOTORCYCLE UNLESS I PURCHASE A NEW ELECTRONIC ABS ELECTRONIC CONTROL UNIT ALSO WHICH IS IN EXCESS OF FIVE HUNDRED DOLLARS.        WHEN THE ABS BRAKES FAILED ON THE HIGHWAY, THEY FAILED IN A MANNER THAT I HAD NO BRAKES.  NOT JUST NO ABS BUT NO BRAKES ON THE REAR SYSTEM WHAT SO EVER.        ALTHOUGH HARLEY DAVIDSON KNOWS THAT THIS PART WAS DEFECTIVE, AS IT WAS DISCONTINUED AND REPLACED WITH ANOTHER PART, THEY BLAME THE CONSUMER BY SAYING THE BRAKE FLUID WAS NOT CHANGED OFTEN ENOUGH.   THIS WAS NOT A GRADUAL FAILURE BUT SUDDEN.  THEY WORKED FINE THAT MORNING.  THE COMPLETE LOSS OF BRAKES COULD BE FATAL.",
        "vin": "1HD1FL4108Y"
    }
]