[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/23/2017",
        "dateOfIncident": "06/07/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000781,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS HAD INCREASED METALLIC ENGINE NOISE WHILE STATIONARY, IN MOTION, ON A CITY STREET OR A HIGHWAY THAT INCREASES IN SOUND WHEN ACCELERATING.  I BROUGHT MY CAR INTO A HYUNDAI DEALERSHIP AND THEY HAVE SAID THAT EVERYTHING SOUNDS FINE THOUGH YOU CLEARLY HEAR THE ENGINE DOES NOT SOUND RIGHT. THREE WEEKS AGO, A CHECK ENGINE LIGHT CAME ON IN MY CAR. I BROUGHT MY CAR INTO A HYUNDAI CERTIFIED DEALERSHIP. THEY DID WORK ON IT AND SAID MY CAR WAS FIXED. I LEFT THE DEALERSHIP AND THE CHECK ENGINE LIGHT CAME BACK ON ABOUT 12 HOURS LATER. ON THE SECOND VISIT, ALL THEY DID WAS 'CLEAR THE CHECK ENGINE LIGHT' AND TOLD ME TO DRIVE IT AROUND FOR A COUPLE DAYS THAT IF THE LIGHT CAME BACK ON TO BRING MY CAR IN AGAIN. THE LIGHT CAME BACK ON THE NEXT DAY. I BROUGHT MY CAR BACK IN AND THEY STILL HAVE IT AT THE DEALERSHIP TO THIS DAY 6/23/17. THE ENGINE SOUNDS LIKE A METALLIC KNOCKING AND IS HESITANT TO DRIVE AT TIMES. I AM CONCERNED ABOUT THE SAFETY OF THIS VEHICLE. I HAVE BEEN WITHOUT MY CAR FOR ABOUT 11 TOTAL DAYS WHILE THE DEALERSHIP DRIVES IT AROUND AND TRIES TO FIGURE OUT WHY THE CHECK ENGINE LIGHT KEEPS COMING ON. THIS LAST VISIT LEFT ME WITHOUT MY CAR (CURRENTLY IN A RENTAL THE DEALERSHIP PROVIDED) FOR OVER SEVEN CONSECUTIVE DAYS. THEY HAVE IGNORED MY COMPLAINTS THAT I HAVE ENGINE NOISE AND SAID MY ENGINE SOUNDS NORMAL EVEN THOUGH OTHER HYUNDAI SONATAS OR ANY OTHER HYUNDAI VEHICLE WITH THE SAME 2.4L ENGINE 'NOT AFFECTED BY THE 162 RECALL SOUNDS VERY DIFFERENT FROM MINE. I DROPPED MY CAR OFF THERE ON 6/15/17 FOR THE THIRD TIME TO RESOLVE THIS ISSUE BY CERTIFIED HYUNDAI MECHANICS. THEY HAVE NOT FIXED MY CAR AND HAVE NOT OFFERED TO REPLACE MY ENGINE EVEN THOUGH MY ENGINE IS PART OF RECALL 'NHTSA CAMPAIGN NUMBER: 17V-226 ' HYUNDAI CAMPAIGN162'. I ATTACHED THE ORIGINAL RECEIPT OF WORK DONE THEY CLAIMED WAS SUPPOSED TO FIX MY CAR, WHICH DID NOT.",
        "vin": "5NPEB4AC5DH"
    }
]