[
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/12/2017",
        "dateOfIncident": "07/07/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004792,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE HAS BEEN SERVICED NUMEROUS TIMES REGARDING THE PAST TWO RECALLS. UPDATING THIS VEHICLE IS NOT WHAT IT NEEDS. THIS VEHICLE NEEDS TO BE REPLACED COMPLETELY. I CANNOT ACCELERATE FROM A STOP, WHEN I'M IN MOTION, OR FROM A SLOW SPEED ON ANY HIGHWAYS, INTERSTATES, CITY STREETS, ETC. THIS VEHICLE DOES NOT WANT TO MOVE. ALSO, NOW GIVEN ALL OF THE ISSUES I'VE BEEN HAVING WITH THIS BRAND NEW CAR, THE AIR CONDITIONING AND BRAKES ARE FADING IN AND OUT. SO ALL OF THE ISSUES I'VE HAD WITH THIS BRAND NEW CAR INCLUDE BUT NOT LIMITED: LACK OF ACCELERATION, STALLING, DUAL CLUTCH TRANSMISSION, AIR-CONDITIONING, BRAKING, AND RADIO/BLUETOOTH/CD PLAYER WILL NOT ALWAYS WORK. I SUBMITTED A LEMON LAW COMPLAINT THROUGH THE BBB AND SPOKE WITH HYUNDAI CONSUMER AFFAIRS. THIS IS POSSIBLY MY THIRD OR FOURTH COMPLAINT ONLINE WITH THIS HEINOUS VEHICLE. IT'S UNSAFE FOR ANYONE LOOKING TO PURCHASE!!!! IT'S JERKY AND WILL LAUNCH YOU ONCE IT FINALLY DECIDES TO ACCELERATE AND THEN I'M AT A STANDSTILL ONCE MORE. THIS VEHICLE HAS A MIND OF ITS OWN AND I CAN'T BELIEVE THAT A DEALERSHIP WOULD SELL A DEFUNCT CAR TO SOMEONE. MAYBE UNKNOWINGLY, BUT NOW I HAVE TO JUMP THROUGH HOOPS AND FIND OTHER MODES OF TRANSPORTATION JUST TO GET TO WORK AND BACK. UNRELIABLE, UNSAFE, UNREASONABLE FOR THE COST, AND I'M NOT WILLING TO DO ANYTHING ELSE WITH THIS VEHICLE. HYUNDAI NEEDS TO MAKE THIS RECURRING AND SUBSTANTIAL ISSUE RIGHT WITH THIS UNHAPPY CUSTOMER. LET'S JUST HOPE THE REGIONAL OFFICE WILL FIND A SOLUTION AND PAY OFF THE REST OF THIS CAR. I SHOULDN'T BE TERRIFIED EVERY TIME I GET INTO MY CAR TO DRIVE WITH MY BABY BECAUSE I KNOW ONE OF THESE TIMES, WE WILL GET HIT. PRETTY SAD TO BE SITTING IN THE MIDDLE OF AN INTERSECTION AND I CAN'T MOVE AND OTHER PEOPLE WON'T MOVE FOR YOU. THE LIKELIHOOD OF GETTING HIT... 99%. PLEASE MAKE THIS RIGHT.",
        "vin": "KM8J33A28GU"
    }
]