[
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/25/2017",
        "dateOfIncident": "05/02/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001286,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "ASPEN 4X2",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MAY 1ST 2017 I WAS ON THE MARKET FOR A DEPENDABLE VEHICLE FOR MY CHILDREN AND I.  MY BOYFRIEND SUGGESTED AUTO DEALS LLC. ON 12838 SAN PEDRO IN SAN ANTONIO, WHERE HIS COUSIN RICHARD MCKINNEY IS A SALESMAN. MY BOYFRIEND AND I ARRIVED AT 1:30 PM AND STAYED TILL 6PM THAT SAME DAY FILLING OUT PAPERWORK AND LOOKING AT VEHICLES. RICHARD'S COWORKER DOUG ASSISTED US ON THIS FIRST DAY. WE DECIDED TO GO HOME AND SLEEP ON IT AND SEE THE NEW SHIPMENT THE NEXT DAY AS I WAS UNSATISFIED WITH THE CURRENT OPTIONS.  AS WE DECIDED TO LEAVE THE SUPERVISOR ALEX SINNO SAID \"COME BACK TOMORROW AND I WILL GIVE YOU A YEAR WARRANTY\".  WHEN WE RETURNED THE NEXT MORNING WITH THE $700 WE WERE TOLD WE NEEDED TO DRIVE OFF THE LOT, WE WERE THEN TOLD THAT THE BOSS WAS ASKING FOR $1000 DOWN PLUS INSURANCE THAT THEY WOULD TAKE CARE OF IN HOUSE ON AN IOU THAT WE WERE TO PAYBACK THAT FRIDAY. FEELING UNEASY BUT STILL DESPERATE WE SCRAPED TOGETHER THE EXTRA $300 PLUS INDEBTED OURSELVES FOR THE IN HOUSE INSURANCE.   SHORTLY AFTER WE DROVE OFF THE LOT ON THE WAY HOME ON MAY 2ND 2017 THE VEHICLE STARTED TO SHAKE AND THE CHECK ENGINE LIGHT TURNS ON AND I NOTICE THAT IT IS OUT OF GAS AS WELL. AFTER FUELING UP, I DRIVE OVER TO OUR FAMILY MECHANIC. HE INFORMS ME OF A MULTITUDE OF ISSUES INCLUDING THE RADIATOR BEING BONE DRY, AND GASKETS NEEDING REPLACEMENTS.  I ALSO NOTICE I CANNOT LOCK MY DOORS AND SEE THAT THERE ARE OVER 20 FUSES MISSING. WE MANAGE TO MAKE IT HOME BECAUSE THE DEALERSHIP IS CLOSED AT THIS POINT  SO WE CALL IN THE MORNING. FOR A WHOLE WEEK WE CALL REPEATEDLY DAILY BUT NEVER MAKE IT PAST THE RECEPTIONIST AND NEVER RECEIVE A CALL BACK. DURING THE WEEK I TAKE IT TO A NEARBY ADVANCE AUTO AND AUTO ZONE, WHERE THE VEHICLE IS PUT ON THE COMPUTER. I ENDED UP BUYING COOLANT AND AN IGNITION COIL, AS WELL AS RECEIVED COPIES OF RECEIPTS AND DIAGNOSTICS ON THEIR MACHINES.ON MAY 5TH WE ALSO PAYED BACK THE I.",
        "vin": "1A8HX58P07F"
    }
]