[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/15/2017",
        "dateOfIncident": "07/14/2017",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005461,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON STOPPING, BRAKE PEDAL BECAME HARD TO DEPRESS AND CAR WOULD NOT BRAKE EFFECTIVELY. BRAKING ACTION BECAME DEGRADED, TIME FRAME WAS ONE DAY. IT WAS INTERMITTENT, BUT WOULD NOT STOP EFFECTIVELY CREATING A HAZARD. UNABLE TO JUDGE STOPPING DISTANCE DUE TO BRAKE DEGRADATION. TOOK TO MECHANIC WHO REPLACED BRAKE BOOSTER, SAID MOST LIKELY A VACUUM ISSUE. SAID THIS IS A RECALL ITEM ON SAME PART FOR FORD ESCAPE 2010 AND LINCOLN MKZ. FORD OWNS MOST OF MAZDA AND THE CX-9 USES FORD MADE PARTS. UPON RESEARCH, MAZDA AND NHTSA BOTH KNOW OF THE ISSUE, BUT HAVE NOT ISSUED A RECALL NOTICE. FORD HAS WARRANTIED THE SAME PART FOR 150,000 MILES, MAZDA HAS NOT ISSUED RECALL FOR SAME PART WITH SAME PROBLEM AND RISK. UPON RESEARCH OF ONLINE BOARDS REGARDING THE SAME PROBLEM, THERE HAVE BEEN SEVERAL REPAIRS BY MAZDA OWNERS FOR THE SAME PROBLEM. THIS FAILURE ON MY CAR IS AT 98,000. WITH THE TAKATA AIRBAG RECALL, AND NOT BEING ABLE TO GET REPLACED AND THE BRAKE BOOSTER PROBLEM, PRESENTS SIGNIFICANT HAZARD TO MAZDA CX-9 OWNERS FOR RISK OF REAR END COLLISIONS DUE TO BRAKE BOOSTER FAILURE AND TAKATA AIRBAG DEPLOYMENT POTENTIALLY CAUSING SERIOUS HARM OR DEATH TO THE DRIVER AND PASSENGER. I AM WANTING NHTSA TO MOVE FORWARD PAST THE MONITORING PHASE AND ASK FOR A RECALL OR WARRANTY OF THE VACUUM BOOSTER FAILURE AT HIGHER MILEAGE AS FORD HAS ALREADY DONE THE SAME FOR THEIR VEHICLES FOR THE SAME PART.",
        "vin": "JM3TB2MA6A0"
    }
]