[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/21/2017",
        "dateOfIncident": "06/10/2017",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000445,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "XL1200T",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN A GROUP RIDE IN STAGGERED FORMAT ON THE 15S FREEWAY ON SATURDAY, JUNE 10TH AT APPROX. 8:20 AM, IN THE RAIN, I WAS CORNERING ON THE TRANSITION RAMP TO THE 163S AND LET HAND OFF THROTTLE, BUT ENGINE ACCELERATED WITHOUT THROTTLE INPUT TO 4000 RPMS.  I WAVED BACK OTHER RIDERS, PULLED THE CLUTCH IN AND APPLIED BRAKES UNTIL I COULD GET TO THE SIDE OF THE FREEWAY SAFELY, ALL WHILE ENGINE REMAINED AT 4000 RPMS.  PLEASE SEE ATTACHED WITNESS STATEMENT .AFTER THE INCIDENT, MY MOTORCYCLE WAS TOWED TO THE SHOP FOR REPAIR.  I HAVE ENCLOSED THE MOST RECENT WORK TICKET #974874 FOR YOUR REVIEW.  I WAS INFORMED BY THE HARLEY SERVICE TECHNICIAN THEY WERE UNABLE TO DUPLICATE THE SITUATION AND NO ERROR CODES WERE PRESENT.  PLEASE NOTE THE MILEAGE IN AND MILEAGE OUT RECORDED ON THIS WORK TICKET.  ACCORDING TO THIS TICKET, THE SERVICE TECHNICIAN ASSIGNED RODE MY MOTORCYCLE EXACTLY 4 MILES TO ATTEMPT TO DUPLICATE A SERIOUS THROTTLE ISSUE.  THAT IS, TO ME, A COMPLETE LACK OF EFFORT TO DIAGNOSE A THROTTLE ISSUE AND COMPLETE DISREGARD FOR A CUSTOMER'S SAFETY.  THIS 2016 SPORTSTER WAS OFFERED TO ME AS A ?COLLATERAL EXCHANGE? ON SEPTEMBER 23, 2016, TO REPLACE A 2015 XL1200T SUPERLOW SPORTSTER (VIN [XXX]) I PURCHASED JUNE 15, 2015, AFTER A SIGNIFICANT HISTORY OF ELECTRICAL AND WIRING ISSUES, AND RANDOM ENGINE ACCELERATION WITHOUT THROTTLE INPUT WITH APPROX. 8K MILES ON THE ODOMETER.  MULTIPLE TECHNICIANS COULDN'T RECREATE THE SITUATION OR REPAIR THE ISSUE ON THE 2015 SPORTSTER.  NOW, I'M HAVING THE VERY SAME ISSUE WITH ANOTHER SPORTSTER WITH APPROX. 9,650 MILES ON THE ODOMETER.  WHILE THIS 2016 XLT1200 IS STILL UNDER WARRANTY, I BELIEVE THERE IS A SERIOUS DESIGN FLAW IN THE ELECTRONIC SYSTEM WITH THESE SPORTSTERS.  GIVEN MY PREVIOUS HISTORY WITH THIS SAME ISSUE, I HAVE ESCALATED THIS COMPLAINT DIRECTLY TO THE MANUFACTURER FOR RESOLUTION. THE COMPLAINT NUMBER IS 3098584.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1HD1LL331GC"
    }
]