[
    {
        "components": "STEERING,POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/17/2017",
        "dateOfIncident": "07/13/2017",
        "fire": false,
        "manufacturer": "Tesla, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005992,
        "products": [
            {
                "manufacturer": "Tesla, Inc.",
                "productMake": "TESLA",
                "productModel": "MODEL S",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JULY 13, 2017, MY TESLA WAS DRIVING SOUTH ON THE I-680 IN THE VICINITY OF FREMONT, CALIFORNIA. MY VEHICLE WAS IN SELF-DRIVE MODE TRAVELING IN THE LEFT-MOST LANE AT 65 MPH. MY HANDS WERE ON THE STEERING WHEEL. WE ENTERED A LONG CURVE TO THE RIGHT AND APPROACHED STOPPED CARS AHEAD OF US. THE SELF-DRIVE MODE IN MY TESLA THEN STOPPED OPERATING AND I WAS LEFT TO SUDDENLY HAVE TO STEER THE TESLA ONTO THE LEFT SHOULDER OF THE HIGHWAY IN ORDER TO AVOID HITTING THE VEHICLE DIRECTLY AHEAD OF ME. THIS ALL OCCURRED UNDER CLEAR SKIES AND DRY ROAD CONDITIONS. I COULD NOT SIMPLY ACCEPT THIS BEHAVIOR BY MY VEHICLE WITHOUT REGISTERING A COMPLAINT AT MY TESLA DEALER IN SEASIDE, CALIFORNIA. THE TESLA SERVICE REP EXAMINED THE LOGS ON MY VEHICLE AND LATER THAT SAME DAY REPORTED TO ME THAT THE SELF-DRIVING FEATURE ON MY TESLA WAS STILL IN BETA STAGE AND THAT MY NEW TESLA'S FIRMWARE WAS DEFECTIVE. I WOULD NOW LIKE TESLA TO TAKE BACK THIS TESLA AND RETURN TO ME A FULL REFUND. THIS IS THE SECOND MAJOR FAILING OF THIS TESLA WHICH HAS ONLY ABOUT 700 MILES ON ITS ODOMETER. I TOOK INITIAL DELIVERY OF THIS TESLA ON MAY 3, 2017. THIS FAILURE OF THE SELF-DRIVING FEATURE OCCURRED AT AROUND 10:30AM ON JULY 13, 2017. THE FIRST FAILURE OF THE NAVIGATION SYSTEM OCCURRED ON MAY 3, 2017, THE ORIGINAL DELIVERY DATE. THE NAVIGATION SYSTEM HAD SIMPLY FROZEN AT THE DEALERSHIP. AGAIN, I WOULD LIKE TO RETURN THIS VEHICLE TO TESLA FOR A FULL REFUND.",
        "vin": "5YJSA1E2XHF"
    }
]