[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/30/2017",
        "dateOfIncident": "06/30/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002560,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "EXPERIENCING SPORADIC ISSUES WITH MY TRUCKS ELECTRICAL SYSTEM.  WHAT WILL HAPPEN IS  THAT AS I'M DRIVING DOWN THE ROAD (DOESN'T MATTER WHAT SPEED), I WILL HEAR A LOUD \"POP\" (SOUNDS EXACTLY LIKE A DESKTOP COMPUTER LOSING POWER) AND THEN MY DASHBOARD/MONITOR SCREEN WILL GO DARK AND AFTER A SPLIT SECOND EVERYTHING COME BACK ON.  THE DASHBOARD WILL FLASH ON AND OFF FOR A FEW MORE SECONDS.  ABOUT EVERY THIRD TIME THIS HAPPENS, IF I PARK THE CAR AND TRY TO RESTART IT IT WON'T TURN OVER.  IN THESE INSTANCES, I CAN HEAR CURRENT CYCLING THROUGH MY POWER DOOR LOCK SWITCH ALONG WITH AN ELECTRIC CLICKING NOISE THAT WON'T STOP.  IF I LET THE TRUCK SIT FOR 15 MINUTES OR SO, I CAN GET THE TRUCK TO RESTART.  I HAVE HAD TO HAVE IT TOWED A COUPLE OF TIMES BECAUSE I COULD NEVER GET IT TO TURN OVER.  THIS PROBLEM FIRST OCCURRED WHEN THE TRUCK WAS 3-4 YEARS OLD AND STILL UNDER WARRANTY. THEY COULDN'T FIND THE ISSUE AND DIDN'T REPLACE ANY PARTS.  NOW ALL THE REPAIRS ARE COMING OUT OF MY POCKET.  I'VE REPLACED THE BATTERY A COUPLE TIMES THINKING I HAD A FAULTY BATTERY.  LATER I REPLACED THE BATTERY CABLE THINKING THIS WAS THE CAUSE AND MOST RECENTLY REPLACED THE FUSE BOX.  IN ALL INSTANCES, THE PROBLEM WOULD GO AWAY FOR ANYWHERE FROM 3-6 MONTHS AND THEN REAPPEAR.  AS I SAID IT IS VERY INTERMITTENT WITH NO CONSISTENCY TO IT WHATSOEVER.    MY TRUCK HAS NEVER DIED WHILE DRIVING WHEN THIS HAS OCCURRED, ALTHOUGH I'M SCARED TO DEATH IT WILL DO SO AND I'LL LOSE ALL POWER.    MY BROTHER-IN-LAW IS A MASTER MECHANIC FOR A LOCAL DEALERSHIP AND IT HAS HIM COMPLETELY STUMPED.  HE'S READ THROUGH ALL THE TSB'S, CHECKED ON-LINE BLOG'S, ETC. AS WELL AS DOING HIS OWN TECHNICAL TROUBLESHOOTING, BUT CANNOT PIN DOWN THE EXACT ISSUE.  AT THIS POINT WE'VE RESORTED TO REPLACING THE MOST LIKELY PARTS AND HOPING FOR THE BEST.  AS I SAID I REPLACED THE FUSE BOX ABOUT 4 MONTHS AGO AND THE PROBLEM RESURFACED TODAY.",
        "vin": "2GCEK13Y081"
    }
]