[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/17/2017",
        "dateOfIncident": "02/08/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005859,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "WINDSTAR",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT NIGHT ON THE INTERSTATE OR ANY OTHER ROAD, THE HEADLIGHTS SUDDENLY WENT OFF FOR ABOUT 10 SECONDS. I HEARD A CLICKING SOUND UNDER THE LEFT SIDE OF THE DASH LIKE THE SOUND OF A RELAY ENGAGING. THIS HAPPENED SEVERAL TIMES. I HAD THE BATTERY REPLACED AND IT WAS OK FOR ABOUT 2-3 WEEKS THEN STARTED AGAIN. DRIVING DURING THE DAY W/NO LIGHTS ON THE A/C BLOWER MOTOR SUDDENLY STOPPED WORKING AND THEN RE-STARTED. THIS ALSO HAPPENED SEVERAL TIMES. I HEARD THE CLICKING UNDER THE DASH AT THAT TIME TOO. I TOOK THE VAN TO THE FORD DEALER. THEY KEPT IT FOR 5 DAYS AND FOUND NOTHING. I WAS AT CHURCH AND CAME OUT TO LEAVE. I STARTED THE VAN AND THE WIPERS CAME ON BY THEMSELVES ON INTERMITTENT AND WOULD NOT SHUT OFF NO MATTER WHAT I DID. I TURNED THE VAN OFF WHEN I GOT HOME AND THE NEXT TIME I STARTED IT THE WIPERS WERE OFF. I WAS DRIVING DOWN THE ROAD WITH THE A/C ON AND THE BLOWER MOTOR SUDDENLY STOPPED WORKING AGAIN AND ALSO THE RADIO, POWER WINDOWS, AND POWER LOCKS. AGAIN I HEARD THE RELAY CLICKING SOUND. IT STAYED OFF FOR ABOUT 10 MINUTES AND CAME ON LONG ENOUGH TO OPEN THE WINDOWS (IT WAS 92 DEGREES OUTSIDE). A COUPLE OF MINUTES LATER IT WENT OFF AGAIN AND STAYED OFF FOR THE REST OF THE DAY AND MOST OF THE NEXT. WHEN I NOTICED A STORM COMING, I WENT OUT AND STARTED THE VAN. THANK GOD THE A/C, RADIO, WINDOWS, AND LOCKS WERE WORKING AT THAT TIME SO THAT I COULD SHUT THE WINDOWS. I DROVE IT TO WORK THE NEXT DAY AND ALL WAS WORKING. I LEFT THE VAN WITH MY BOSS (HE'S A MECHANIC) SO THAT HE CAN TAKE A LOOK AT IT. MY REAR AXLE WAS REPLACED UNDER RECALL ABOUT 16 MONTHS AGO. I'M FRUSTRATED WITH THIS PROBLEM. I BOUGHT THE VAN USED IN JULY OF 2015. IT HAS METICULOUS SERVICE RECORDS AND HAS BEEN GREAT UP UNTIL THIS YEAR. FORD REALLY NEEDS TO DO SOMETHING ABOUT THIS.",
        "vin": "2FMZA52473B"
    }
]