[
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/20/2017",
        "dateOfIncident": "06/11/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000172,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G6",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE ARE 3 DIFFERENT AREAS THAT I ASSUME ARE THE CAUSE OF MY CAR'S PROBLEMS. FIRST THE PASSENGER SIDE AIR BAG IS HAS STAYED OFF, REGARDLESS OF PASSENGERS BEING PRESENT SINCE 2014, I BELIEVE. USING THE KEY DOES NOT CHANGE THE AIR BAG STATUS. ALSO THIS MAY BE PART OF THE ELECTRICAL AREA, BUT AT AROUND THE SAME TIME MY CRUISE CONTROL ALSO MALFUNCTIONED. THE CAR WAS IN MOTION WHEN I REALIZED BOTH THINGS. ALSO I'VE HAD PROBLEMS WITH TRACTION CONTROL COMING ON OUT OF NO WHERE, AND INSTEAD OF THE ENGINE SPEED BEING REDUCED, THE CAR WILL NOT MOVE AT ALL. SOMETIMES IT WILL LIKE RESET AFTER I PULL OVER AND WAIT FOR OVER 10 MINUTES, BUT IT WILL COME BACK ON REPEATEDLY. I HAVE TO PULL OVER WAIT RESTART, PULL OVER WAIT RESTART SEVERAL TIMES WITHIN A USUAL 20 MINUTE DRIVE AT TIMES. ALSO I'M HAVING PROBLEMS WITH THE AIR COMPRESSOR STAYING ENGAGED. MY CAR KIND OF BOGS DOWN WHEN THE COMPRESSOR DOES KICK IN, AND IT REPEATEDLY KICKS ON AND OFF WHILE DRIVING ANY DISTANCE AT ALL. ALSO THE INTERIOR LIGHTS FLICKER CONSTANTLY. THE MESSAGE CENTER ON THE RADIO CONSTANTLY SAYS THAT I HAVE LOW COOLANT, BUT THAT IS AN ERROR MESSAGE. IN THE SUSPENSION AREA MY WHOLE FRONT END(STRUTS, BALL BEARINGS, ETC) SEEM TO BE BAD. WHEN I DRIVE OVER A SMALL BUMP THE WHOLE CAR SHUTTERS AND PULLS WILDLY TO ONE SIDE OR THE OTHER. IT FEELS LIKE MY TIRES HIT INTO THE RIM ITSELF OVER SPEED BUMPS WHEN I AM DRIVING MERELY 10 MILES PER HOUR.",
        "vin": "1G2ZM151864"
    }
]