[
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "11/07/2018",
        "dateOfIncident": "11/09/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11149915,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG GT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. THE DRIVERS SIDE SEAT BELT WAS REPLACED UNDER WARRANTY THE FIRST TIME, AS IT WAS FAILING TO RETURN TO DEFAULT POSITION PROPERLY. THE SEAT BELT WAS REPLACED A SECOND TIME, AFTER I WAS REAR ENDED (IT WAS FAILING TO RETRACT AGAIN AT THE TIME, IDENTICAL TO THE FIRST TIME I HAD TO HAVE IT REPLACED UNDER WARRANTY), AND CRUSHED INTO THE VEHICLE IN FRONT OF ME. I WAS AT A FULL STOP WHEN THE VEHICLE HIT ME FROM BEHIND. THAT CRASH DEPLOYED BOTH AIRBAGS. THE FRONT AND REAR BUMPERS WERE REPLACED DUE TO THAT CRASH, ALONG WITH THE SEAT BELT. I HAVE NO WAY OF KNOWING IF THOSE TWO REPLACEMENT AIRBAGS WERE MADE BY TAKATA. THE SEAT BELT HAS AGAIN BECOME \"UNSAFE\" DUE TO IT NOT RETRACTING. I HAVE NO WAY OF KNOWING IF THE SEAT BELT WILL FUNCTION PROPERLY IF I'M INVOLVED IN ANOTHER ACCIDENT! THIS LEAVES ME WITH TWO QUESTIONS: DO I HAVE TAKATA AIRBAGS IN THIS CAR, AND, IS THIS SEAT BELT ISSUE A KNOWN PROBLEM THAT HAS BEEN RECALLED OR AT LEAST HAS A TSB ISSUED? THIS IS AN 18 YEAR OLD CAR THAT I SELDOM DRIVE, AND HAVE OWNED SINCE BRAND NEW, BUT IF I HAVE TWO SAFETY ISSUES THAT FORD SHOULD BE TAKING CARE OF, I WOULD LIKE TO KNOW ABOUT IT, SO I CAN GET THE PROBLEMS RESOLVED. IS THERE ANY WAY FOR ME TO DETERMINE THE I DO OR DO NOT HAVE TAKATA AIRBAGS, SINCE THEY WERE REPLACED BY A FORD DEALER (NOW CALLED \"AUTO NATION FORD\") HERE IN FRISCO, TEXAS. THE DATE OF THE ACCIDENT IS AN ESTIMATE.",
        "vin": "1FAFP42XXYF"
    }
]