[
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/01/2019",
        "dateOfIncident": "04/27/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205015,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "COMPASS",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD TWO INSTANCES WITHIN A 2 MONTHS OF EACH OTHER WHERE MY NEW JEEP COMPASS HAS BROKEN DOWN AND NEEDED TO BE TOWED TO THE DEALERSHIP.    BACK IN FEBRUARY, I WAS DRIVING ABOUT 65 MPH ON THE HIGHWAY AND THE CHECK ENGINE LIGHT CAME ON, WHICH I THOUGHT WAS STRANGE. I CAME UP TO A STOP SIGN AND TRIED TO ACCELERATE AGAIN, AND I CRAWLED THROUGH THE INTERSECTION WITH NO POWER, RPMS SHOOTING THROUGH THE ROOF, AND MY WHOLE VEHICLE SHAKING VIOLENTLY. THE HARDER I PRESSED ON THE GAS, THE SLOWER IT WENT. THERE WAS ONCOING TRAFIC AT THIS TIME, SO IM GLAD NO ACCIDENT OCCURED.    THE DEALERSHIP SAID THAT I NEEDED TWO SOFTWARE UPDATES, FOR MY TRANSMISSION AND ONE OTHER ONE, AND IT FIXED THE PROBLEM.    FAST FORWARD TO APRIL 27, 2019, IM DRIVING 50 MPH AND THE SERVICE ENGINE LIGHT COMES ON AGAIN. I COME TO A STOP SIGN AGAIN, AND TRY TO ACCELERATE, ONLY FOR THE SAME THING TO HAPPEN AS LAST TIME. I MADE IT HOME AND HAD MY CAR TOWED TO THE DEALERSHIP AGAIN.     THE SAID THAT THEY DID NOT SEE A CHECK ENGINE LIGHT ON AND WERE NOT ABLE TO FIND THAT ONE HAD EVER BEEN ON WHEN THEY CHECKED THE COMPUTER IN THE VEHICLE. THIS IS ALARMING BECAUSE IT WAS IN FACT ON, AND MY WHOLE VEHICLE WAS BASICALLY DISABLED AND SHAKING VIOLENTLY.     THEY SAID SINCE THEY COULDNT FIND ANYTHING THAT THERE WAS NOTHING THEY COULD DO TO FIX THE PROBLEM UNLESS THEY CAN RECREATE IT.     THERE IS CLEARLY SOMETHING MAJORLY WRONG WITH THIS CARS COMPUTER SYSTEM IF IT RANDOMLY DOES THIS WITH NO WARNING, AND IT IS DANGEROUS. IT DOESNT EVEN WORK ENOUGH TO LOG THE HISTORY OF ENGINE LIGHTS THAT ARE TRIGGERED.     I DONT FEEL SAFE DRIVING IT. IT IS UNDER A YEAR OLD AND ONLY HAD 9500 MILES ON IT WHEN THIS HAPPEND THE FIRST TIME, NOW IT HAS 13000 MILES ON IT AND IS STILL NEW. THIS IS A MAJOR ISSUE WHEN THE SERVICE SHOP I BOUGHT IT FROM CANT EVEN FIGURE OUT WHAT IS WRONG.",
        "vin": "3C4NJDBBXJT"
    }
]