[
    {
        "components": "STEERING,WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/03/2017",
        "dateOfIncident": "07/03/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002761,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER RESEARCHING THE INTERNET I CAM ACROSS THE ACRONYM OF THE ISSUE. WHAT HAPPENED IS EXACTLY DESCRIBED IN THIS ARTICLE AS THE \"DEATH WOBBLE.\"  HTTP://ABC7NEWS.COM/ARCHIVE/8547340/    THIS HAS HAPPENED MULTIPLE TIMES WHILE I'M DRIVING AT AN AVERAGE SPEED OR HIGH SPEED. IF I HIT A DIP OR TURN AT A AVERAGE TO HIGH SPEED MY JEEP SHAKES UNCONTROLLABLY.   TODAY I WAS DRIVING TO WORK ON THE 60 EASTBOUND IN THE HIGH SPEED LANE GOING THE SPEED LIMIT (CRUISE CONTROL). MY JEEP HIT A DIP AND SHOOK SO UNCONTROLLABLY I ALMOST HAD TO DO A COMPLETE STOP ON THE FREEWAY. I TRIED THE BEST I COULD TO MERGE TO THE SLOW SPEED LANE TO POSSIBLY EXIT THE FREEWAY. A FEW VEHICLES WERE BEHIND ME WHEN THIS HAPPENED AND IT ALMOST CAUSED A SEVERE ACCIDENT.  IT LITERALLY FEELS LIKE THE AXEL IS GOING TO SNAP IN HALF OR THE VEHICLE MAY EVEN FLIP IF THE SHAKING WERE TO CONTINUE. WHEN THE VEHICLE IS SHAKING LIKE THIS THE ONLY WAY I'VE EXPERIENCED FOR IT TO STOP IS QUICKLY SLOWING DOWN ALMOST TO A COMPLETE STOP. IF I SLOW DOWN SLOWLY IT STILL SHAKES UNCONTROLLABLY SO MUCH SO THAT IT PUTS ME IN THE OTHER LANE.     THIS ISSUE NEEDS TO BE FIXED AND CAN MOST DEFINITELY KILL SOMEONE.     THIS HAPPENED TODAY AT LEAST 3 TIMES. I THEN FINALLY PUT MY VEHICLE IN FOUR WHEEL DRIVE AT 2H WHILE DRIVING FEARING IF IT HAPPENS AGAIN, MY AXEL MAY BREAK; OR WORSE MY LIFE TAKEN.    BEFORE THIS INCIDENT I'D SAY IT'S HAPPENED EVERY NOW AND THEN. APPROX. ONCE EVERY 3-6 MONTHS SINCE I GOT THE VEHICLE.   I ALSO HAVE MY TIRES ROTATED EVERY TIME I GET MY OIL CHANGED AT 3,000 MILES.     THIS SHOULD NOT BE HAPPENING",
        "vin": "IJ4BA5H12AL"
    }
]